{
  "contributor_author": "Lorca, Tatiana Andrea",
  "contributor_committeechair": "Pierson, Merle D.",
  "contributor_committeemember": [
    "Eifert, Joseph D.",
    "Claus, James R.",
    "Sumner, Susan S.",
    "Marcy, Joseph E."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2011-08-22T18:35:37Z",
  "date_adate": "2002-08-19",
  "date_available": "2011-08-22T18:35:37Z",
  "date_issued": "2002-07-19",
  "date_rdate": "2003-08-19",
  "date_sdate": "2002-07-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The affects of hydrodynamic shock wave treatment on the bacterial flora of raw beef and poultry were evaluated.  Hydrodynamic shock waves were generated in an aqueous treatment medium by either the detonation of two types of explosive charges (explosively-generated hydrodynamic shock waves [EHSW]) (a binary or a molecular explosive) or by electrical discharge (high voltage arc discharge Hydrodyne (TM [HVADH; Hydrodyne, Inc.]).  A variety of sample types (whole steaks, ground beef, a water and ground beef slurry) were used to determine the lethality affects of EHSW on cells of the marker microorganism Listeria innocua suspended in a simple broth medium.  These sample types were used in order to evaluate the affects of the process not only on the surface, but throughout the bulk of the samples in order to determine whether EHSW could also be used as a non-thermal alternative to reduce the bacterial flora of non-intact or ground meats.  The levels of psychrotrophic, lactic, and coliform populations on the surface of whole eye of round steaks submitted to EHSW processing did not differ (P> 0.05) from those of untreated whole eye of round steaks.  Parameters expected to influence the nature, magnitude, and propagation of the hydrodynamic shock wave were also varied and evaluated in order to determine which individual parameter or combination of parameters affected the bactericidal potential of EHSW or HVADH processing.  Treatment with EHSW failed (P > 0.05) to produce lethality effects on the psychrotrophic, lactic, and coliform populations of ground beef, regardless of the composition and mass of explosive used, the number of successive EHSW treatments used, the relative distance between the explosive charge and the top surface of the sample, or the temperature of the water used in the treatment chamber.  EHSW processing did not change (P >0.05) the bacterial population of treated ground beef samples when compared to untreated controls during a five day refrigerated storage study.  No lethality effects were observed (P >0.05) in ground beef samples treated by HVADH when samples were subjected to one, two, or three successive HVADH treatments.   Minimal penetration of surface inoculated bacteria was observed for both beef steaks and boneless skinless chicken breasts subjected to EHSW and HVADH, respectively.  In EHSW-treated beef eye of round steaks, marker bacteria were detected within the first 300 um of tissue below the inoculated surface, 50-100 um beyond the depth of untreated surface inoculated steaks.  In HVADH-treated boneless skinless chicken breasts, marker bacteria were detected within the first 200 um below the inoculated surface, 50-100 um beyond the depth of untreated surface inoculated boneless skinless chicken breasts.  This suggests that although no difference in the bacteriological populations was observed between EHSW treated, HVADH treated, and untreated control samples of whole steaks (and ground beef treated with both HVADH and EHSW), HVADH and EHSW treatments affect the movement of surface bacteria.  United States Department of Agriculture (USDA) guidelines suggest intact beef steaks be cooked to achieve a cooked color appearance on the surface and raw poultry be cooked to an internal temperature of 77°  C to inactivate the pathogens Escherichia coli O157:H7 and salmonellae which are of concern in beef and poultry, respectively.  By following these guidelines during proper cooking, consumers achieve thermal inactivation of these pathogens.  Since the movement of the marker bacterium observed in treated steaks and boneless skinless chicken breasts was minimal, proper cooking of the products would be expected to inactivate vegetative bacterial cells at this depth.  Therefore, EHSW and HVADH treated whole beef steaks and boneless skinless chicken breasts would not be expected to pose a bacterial hazard if the products were properly cooked.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:35:37Z (GMT). No. of bitstreams: 12  vita.pdf: 15269 bytes, checksum: bb53f9531415d1295d09db33f022b67e (MD5)  title.pdf: 3800 bytes, checksum: 85d0d7a838afa29eaf8eff9b296ba955 (MD5)  tableofcontents.pdf: 15603 bytes, checksum: 2ed446e939d5f81be3c3f1c667e70d85 (MD5)  litreview.pdf: 164849 bytes, checksum: a33c1ff6df11b5b9d145872dd8e66c8a (MD5)  litcited.pdf: 14224 bytes, checksum: e1cc4014d345cf74d89918d03895ea33 (MD5)  jpoultryscience.pdf: 54157 bytes, checksum: b911103c1a981f19bf442563d0f02b5b (MD5)  jfoodscience.pdf: 36656 bytes, checksum: def0e3af83005b8a013f5f715645c55f (MD5)  jfoodprot.pdf: 51829 bytes, checksum: 449e21acb119b17e28b0974d6cb6f20e (MD5)  applenvironmicro.pdf: 69905 bytes, checksum: 59bf5e3aa9ad379657acceb333eaf631 (MD5)  abstract.pdf: 10363 bytes, checksum: 305b0676ec31bbb26377befee2b6b4f0 (MD5)  Introduction.pdf: 13645 bytes, checksum: 46de7d568bcfbb6f7b09275f0e0ebe61 (MD5)  APPENDIX.pdf: 22781 bytes, checksum: a871546229c8b3a90388f09a6e26315f (MD5)    Previous issue date: 2002-07-19",
    "Author Email: yerma@vt.edu",
    "Advisor Email: jeifert@vt.edu",
    "Advisor Email: jrclaus@facstaff.wisc.edu",
    "Advisor Email: sumners@vt.edu",
    "Advisor Email: piersonm@vt.edu",
    "Advisor Email: jmarcy@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11046",
  "identifier_other": "etd-07292002-153950",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07292002-153950",
  "identifier_uri": "http://hdl.handle.net/10919/11046",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "litreview.pdf",
    "jpoultryscience.pdf",
    "litcited.pdf",
    "jfoodscience.pdf",
    "title.pdf",
    "abstract.pdf",
    "APPENDIX.pdf",
    "vita.pdf",
    "tableofcontents.pdf",
    "jfoodprot.pdf",
    "Introduction.pdf",
    "applenvironmicro.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Microbial Flora",
    "Explosives",
    "Hydrodynamic Shock Waves"
  ],
  "title": "The Affects of Explosively and Electrically Generated Hydrodynamic Shock Waves on the Bacterial Flora of Beef and Poultry",
  "type": "Dissertation"
}