{
  "contributor_author": "Kriz, Kerri-Lynn Murphy",
  "contributor_committeechair": "Madison-Colmore, Octavia D.",
  "contributor_committeemember": [
    "Messier, Louis",
    "Hohenshil, Thomas H.",
    "Lichtman, Marilyn V.",
    "Curcio, Claire Cole Vaught"
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2011-08-22T18:35:36Z",
  "date_adate": "2002-05-21",
  "date_available": "2011-08-22T18:35:36Z",
  "date_issued": "2002-05-06",
  "date_rdate": "2003-05-21",
  "date_sdate": "2002-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this dissertation is to identify the variables associated with abstinence from binge-eating disorder and Bulimia Nervosa in the twelve-step recovery program of Overeaters Anonymous. The data were gathered through the completion of a survey by 231 active members of Overeaters Anonymous in the Washington metropolitan area. In addition to assessing the demographic composition of the aforementioned population, the variables that were assessed comprise the 'tools' of Overeaters Anonymous. They include: attendance at OA meetings, reading/writing from the Twelve Step literature, adhering to a food plan, having a sponsor, giving service, taking time for prayer and meditation, and making phone calls to other members. The activities of binge eating and bulimic participants were also examined to determine whether or not statistically significant differences exist between these two populations.  Results revealed the typical OA participant to be a college educated (80%), Caucasian (89%) female (84%), between the ages of 34 and 44 (30%), married or living with a partner (44%), and employed in a full-time capacity (71%).  Eight-four percent of the respondents were binge eaters, 15% were bulimic, and 1% anorexic. Multiple regression analyses revealed longer lengths of involvement in OA, a decrease in the frequency of relapse or 'slips', performing service, greater attendance at meetings, and progress on the ninth step, to be predictors of abstinence at the .05 level of significance.  A lower frequency of relapse was predicted by longer lengths of involvement in OA, greater adherence to a food plan, increased frequency of phone calls to other members, and more time spent writing about one's thoughts and feelings at the .05 level of significance. Lastly, Independent Sample t-tests revealed bulimics to have significantly longer mean lengths of abstinence than did binge eaters.  Alternately, the difference in the frequency of relapse or 'slips' between the two populations was not significant, suggesting that both bulimics and binge eaters have a comparable likelihood to relapse or slip back into eating disordered behaviors.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:35:36Z (GMT). No. of bitstreams: 1  Dissertation.pdf: 562112 bytes, checksum: e28f6322e7bba5d13260c058ee957304 (MD5)    Previous issue date: 2002-05-06",
    "Author Email: htkriz@juno.com",
    "Advisor Email: loumess@yahoo.com",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: omadison@vt.edu",
    "Advisor Email: mlichtma@vt.edu",
    "Advisor Email: vaughtc@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11044",
  "identifier_other": "etd-05092002-143548",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092002-143548",
  "identifier_uri": "http://hdl.handle.net/10919/11044",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "addictions",
    "bulimia nervosa",
    "binge-eating disorder",
    "eating disorders",
    "Overeaters Anonymous"
  ],
  "title": "The Efficacy of Overeaters Anonymous in Fostering Abstinence in Binge-Eating Disorder and Bulimia Nervosa",
  "type": "Dissertation"
}