{
  "contributor_author": "Prater, Mary Renee",
  "contributor_committeechair": "Holladay, Steven D.",
  "contributor_committeemember": [
    "Wong, Eric A.",
    "Bender, Holly S.",
    "Gogal, Robert M. Jr.",
    "Ahmed, S. Ansar"
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2011-08-22T18:42:30Z",
  "date_adate": "2002-04-26",
  "date_available": "2011-08-22T18:42:30Z",
  "date_issued": "2002-03-08",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-03-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The present study examined adverse effects of sunlight exposure (mimicked by intradermal cis-urocanic acid, cUCA) on local and systemic immune responses, with or without co-exposure to the immunotoxic insecticide permethrin. A single exposure to cUCA caused diminished splenic macrophage phagocytosis that was persistent up to 30 days post-exposure.  Five-day exposure to cUCA subtly increased splenocyte proliferation in response to the T cell mitogen Concanavalin A. Four-week exposure to cUCA caused increased splenic lymphocyte cellularity, thymic hypocellularity, and enhanced hydrogen peroxide production by splenic leukocytes. Single exposure to topical permethrin resulted in decreased thymic and splenic weight and cellularity, and inhibited antibody production by splenic B cells. cUCA worsened the negative effect of permethrin on both thymic weight and cellularity, and depressed splenocyte blastogenesis, hydrogen peroxide production, and antibody production. Five-day exposure to either cUCA or permethrin also caused persistent decreased contact hypersensitivity responses, an effect that became more than additive when the chemicals were administered concurrently. Defects in antigen processing and presentation by cutaneous Langerhans cells were evaluated as possible contributing mechanisms to the cutaneous immunosuppression, using mice with deleted genes. Vehicle-exposed IFNg knockout mice displayed approximately a 22.1% depression in the ear swelling response as compared to control C57BL/6N mice, suggesting that this cytokine may be required for mounting a control-level hypersensitivity response. Ear swelling in cUCA-exposed IFNg knockout mice displayed a 21.4% depressed response as compared to cUCA-exposed wild-type C57BL/6N mice, again suggesting that IFNg is an important cytokine in the contact hypersensitivity (CH) response. TNFaR knockout mice exposed to cUCA displayed 33.9% greater ear swelling than cUCA-exposed wild-type C57BL/6N mice, suggesting that increased TNFa may be involved in inhibited CH by cUCA. TNFaR knockout mice exposed to permethrin displayed 33.9% greater ear swelling than permethrin-exposed C57BL/6N mice, suggesting that increased TNFa may also be involved in inhibited CH by permethrin. C57BL/6N mice exposed to cUCA + permethrin displayed severe reduction of the CH response to 8.7% of the control level. IFNg knockout mice exposed to permethrin + cUCA showed essentially identical depression of the CH response as IFNg knockout mice exposed to either permethrin or cUCA alone. These results suggest that IFNg is required for the greater than additive immunotoxic effect that occurred when these two agents were co-administered. TNFaR knockout mice exposed to cUCA + permethrin displayed 8.7 fold greater ear swelling than similarly exposed C57BL/6N mice, again suggesting that increased TNFa is involved in inhibited CH by both cUCA and permethrin.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:42:30Z (GMT). No. of bitstreams: 1  RPrater.pdf: 358079 bytes, checksum: bffede99bb077680a301a0ba33d014a1 (MD5)    Previous issue date: 2002-03-08",
    "Author Email: mrprater@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: hbender@vt.edu",
    "Advisor Email: rgogal@vt.edu",
    "Advisor Email: holladay@vt.edu",
    "Advisor Email: ansrahmd@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11047",
  "identifier_other": "etd-03222002-143857",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03222002-143857",
  "identifier_uri": "http://hdl.handle.net/10919/11047",
  "publisher": "Virginia Tech",
  "relation_haspart": "RPrater.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Thymus",
    "Skin",
    "Ultraviolet irradiation",
    "CD1a",
    "Contact hypersensitivity",
    "IFNg",
    "Mouse",
    "TNFa",
    "Spleen",
    "Cis-urocanic acid",
    "Permethrin",
    "Immunotoxicity"
  ],
  "title": "Immunotoxicity of Dermal Permethrin and Cis-Urocanic Acid:  Effects of Chemical Mixtures in Environmental Health",
  "type": "Dissertation"
}