{
  "contributor_author": "Torrence, Vera D.",
  "contributor_committeechair": "Krill, Cecelia W.",
  "contributor_committeemember": [
    "Parson, Stephen R.",
    "Belli, Gabriella M.",
    "Salmon, Richard G.",
    "Sweeney, Francis"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2011-08-22T18:46:19Z",
  "date_adate": "2002-04-25",
  "date_available": "2011-08-22T18:46:19Z",
  "date_issued": "2002-04-09",
  "date_rdate": "2003-04-30",
  "date_sdate": "2002-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The traditional role of America's principals is changing. The educational reform movement defines principals as instructional leaders responsible for creating professional learning communities in which learning and quality instruction are priorities. National standards for school leaders include the use of data as a resource for instructional leadership. Additionally, new principals are entering the field rapidly. Previous research on the use of data by principals is twenty years or older. This study updates prior research and contributes to a national perspective of the use of data by principals. This study presents two research questions that guide (a) a description of how principals vary in their use of data and (b) the determination of the relationship(s) between predictor variables and principals' use of data. The method used was survey research and included both descriptive and correlational statistics. A national sample of principals randomly selected by the National Association of Elementary School Principals (NAESP) responded to a questionnaire developed for this study. Findings of the survey showed that principals are embracing the role of instructional leader and are using data in various ways. Additionally, this study determined that principals' attitudes, self perceptions, professional development experiences, characteristics of their school districts, and personal competencies with data proved statistically significant with influencing their use of data. However, characteristics of their individual schools where principals worked were not found to be statistically significant. This study is important because it provides useful information for planning both principal preparation programs that target aspiring principals and for planning continual staff development for practicing principals.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:46:19Z (GMT). No. of bitstreams: 2  Dissertation_Correction.pdf: 4778 bytes, checksum: 0275a7ce1bc3682c5ac6b19c3967547e (MD5)  DissertationVer10.pdf: 1029581 bytes, checksum: 424b508b8955a89c526e10ab09eefeef (MD5)    Previous issue date: 2002-04-09",
    "Author Email: vera_torrence@fc.mcps.k12.md.us",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: ckrill@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: Sweeney@Hood.edu"
  ],
  "format_medium": "ETD",
  "handle": "11048",
  "identifier_other": "etd-04202002-124945",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202002-124945",
  "identifier_uri": "http://hdl.handle.net/10919/11048",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "DissertationVer10.pdf",
    "Dissertation_Correction.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Educational Reform",
    "Data",
    "Educational Leadership"
  ],
  "title": "Principals' Use of Data: A National Perspective",
  "type": "Dissertation"
}