{
  "contributor_author": "Smallwood, Zenobia Whichard",
  "contributor_committeecochair": [
    "Burge, Penny L.",
    "Twiford, Travis W."
  ],
  "contributor_committeemember": [
    "Crockett, Jean B.",
    "Wilkins, May",
    "Parson, Stephen R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2011-08-22T18:50:31Z",
  "date_adate": "2003-11-21",
  "date_available": "2011-08-22T18:50:31Z",
  "date_issued": "2003-04-03",
  "date_rdate": "2004-11-21",
  "date_sdate": "2003-11-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "The purpose of this qualitative study was to describe overarching themes that were significant in helping a selected elementary school reach the standards for School of Distinction status. A descriptive case study design was used to identify answers to the overall guiding research question and subordinate questions formulated from the review of literature. A carefully planned sequence of questions was developed for each set of participants aimed at getting a detailed description of the school. Data collection procedures consisted of interviews, classroom observations, and review of school documents. Participants consisted of the principal, nine teachers and nine students from grades, 3, 4, 5 and a total of three parents who have children in these grades.  Data from this study were used to compare and analyze key words, phrases, and/or direct quotes in order to identify and describe emerging, overarching, and supporting themes from the following domains: principal's leadership, teacher involvement, class size, student achievement, and parental involvement. Based on literature reviews, these domains were considered to be characteristics that contributed to promoting high student achievement and successful schools. Findings provided supporting themes that were organized around the study's domains. The supporting themes emerged from data triangulation on each of the domains. Based on the data collected and analyzed, the following nine conclusions were identified as contributing to the school's success: (1) a successful school staff maintains an instructional focus; (2) in a successful school, communication occurs among all stakeholders; (3) collaboration among teachers, parents, and the principal occur often in schools; (4) a successful school has a class size below twenty students; (5) a variety of complimentary programs led to school success; (6) a successful school has strong parental involvement; (7) a successful school has a nurturing staff; (8) a successful school has a stable staff; and (9) students perceive a successful school differently than the adults. Implications and recommendations for practice are provided for consideration for school districts with similar demographics to this study. Finally, recommendations for further studies are provided.",
  "description_degree": "EDD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:50:31Z (GMT). No. of bitstreams: 3  frontmatter.pdf: 184590 bytes, checksum: 1c6c5d4ace41a00fdd4402adf5102289 (MD5)  bodymatter.pdf: 475287 bytes, checksum: 1106f805c8b6bc4d5ed69fd67cddbcc4 (MD5)  backmatter.pdf: 201253 bytes, checksum: a3e241447d51cea6218fc34a018c3ddf (MD5)    Previous issue date: 2003-04-03",
    "Author Email: smallwoodzw@gatescountyschools.net",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: mwilkins@washingtonco.k12.nc.us",
    "Advisor Email: parson@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11058",
  "identifier_other": "etd-11112003-083457",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11112003-083457",
  "identifier_uri": "http://hdl.handle.net/10919/11058",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "bodymatter.pdf",
    "frontmatter.pdf",
    "backmatter.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Student Achievement",
    "Elementary Schools",
    "Leadership",
    "High Performing"
  ],
  "title": "One Rural Elementary School's Experience in Becoming A School of Distinction",
  "type": "Dissertation"
}