{
  "contributor_author": "Cahill, Kerri Lynn",
  "contributor_committeechair": "Marion, Jeffrey L.",
  "contributor_committeemember": [
    "Mortimer, Michael J.",
    "McMullin, Steve L.",
    "Randolph, John",
    "Roggenbuck, Joseph W."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2011-08-22T18:50:30Z",
  "date_adate": "2003-11-18",
  "date_available": "2011-08-22T18:50:30Z",
  "date_issued": "2003-09-12",
  "date_rdate": "2004-11-18",
  "date_sdate": "2003-10-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Management prescriptions that describe desired conditions for resources and visitor experiences have become widely accepted as an important component of public land management plans.  However, very little effort is spent on evaluating and learning about this part of the planning process.   This research identifies and addresses the need to explore opportunities for additional guidance on the development of management prescriptions, by (1) evaluating the current perception of the purpose of management prescriptions; (2) developing criteria and other tools to guide the development of management prescriptions based on the experiences of public land management professionals; and (3) testing an alternative method for collecting visitor preference data regarding social, resource and management conditions to inform development of management prescriptions.   The first two papers report the results of a visitor preference study, using the stated choice method, conducted in Acadia National Park.  The purpose of the first paper is to identify visitor preferences for tradeoffs among social, resource and related management conditions of the recreation setting.  The purpose of the second paper is to identify differences among visitor preferences for social, resource and management conditions in various recreation settings.  By considering the integrative nature of these attributes and the relative importance to visitors across recreation settings, the definition of management prescriptions can be better informed.  To further investigate the results of the stated choice method and ensure the validity of the data, a verbal protocol assessment was applied to a sample of the stated choice survey respondents.   The purpose of the third paper is to reexamine the role of management prescriptions for park management planning and investigate tools for facilitating development of management prescriptions.  The study included in-depth interviews, participant observation of a three-day planning workshop and a written survey.  All of the participants in the various components of the study were National Park Service land management professionals.  The study resulted in a list of the purpose and criteria for management prescriptions and a related menu of desired condition topics, which will be integrated into planning guidance to aid the development of unique and effective management prescriptions for national parks.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:50:30Z (GMT). No. of bitstreams: 1 kerricahill_dissertation2.pdf: 945832 bytes, checksum: a839658a4fb740f3959624df1f4f99b0 (MD5)   Previous issue date: 2003-09-12",
    "Author Email: kcahill@vt.edu",
    "Advisor Email: jmarion@vt.edu",
    "Advisor Email: mmortim@vt.edu",
    "Advisor Email: smcmulli@vt.edu",
    "Advisor Email: energy@vt.edu",
    "Advisor Email: jroggenb@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11055",
  "identifier_other": "etd-10172003-193831",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10172003-193831",
  "identifier_uri": "http://hdl.handle.net/10919/11055",
  "publisher": "Virginia Tech",
  "relation_haspart": "kerricahill_dissertation2.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "public lands planning",
    "carrying capacity",
    "visitor capacity",
    "desired conditions",
    "management prescriptions",
    "National Park Service planning"
  ],
  "title": "Exploring the Structure and Development of Management Prescriptions for Public Lands",
  "type": "Dissertation"
}