{
  "contributor_author": "Bailie, Samuel Todd",
  "contributor_committeechair": "Ng, Fai",
  "contributor_committeecochair": "Copenhaver, William W.",
  "contributor_committeemember": [
    "Dancey, Clinton L.",
    "Burdisso, Ricardo A.",
    "Wicks, Alfred L.",
    "O'Brien, Walter F. Jr."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2011-08-22T18:50:31Z",
  "date_adate": "2003-11-20",
  "date_available": "2011-08-22T18:50:31Z",
  "date_issued": "2003-10-21",
  "date_rdate": "2003-11-20",
  "date_sdate": "2003-11-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The main contributor to the high-cycle fatigue of compressor blades is the response to aerodynamic forcing functions generated by an upstream row of stators or inlet guide vanes.  Resonant response to engine order excitation at certain rotor speeds is especially damaging.  Studies have shown that flow control by trailing edge blowing (TEB) can reduce stator wake strength and the amplitude of the downstream rotor blade vibrations generated by the unsteady stator-rotor interaction.  In the present study, the effectiveness of TEB to reduce forced blade vibrations was evaluated in a modern single-stage transonic compressor rig.  A row of wake generator (WG) vanes with TEB capability was installed upstream of the fan blisk, the blades of which were instrumented with strain gages.  Data was collected for varied TEB conditions over a range of rotor speed which included one fundamental and multiple harmonic resonance crossings.  Sensitivity of resonant response amplitude to full-span TEB flowrate, as well as optimal TEB flowrates, are documented for multiple modes.  Resonant response sensitivity was generally characterized by a robust region of substantial attenuation, such that less-than-optimal TEB flowrates could prove to be an appropriate design tradeoff.  The fundamental crossing amplitude of the first torsion mode was reduced by as much as 85% with full-span TEB at 1.1% of the total rig inlet flow.  Similar reductions were achieved for the various harmonic crossings, including as much as 94% reduction of the second leading edge bending mode resonant response using 0.74% of the rig flow for full-span TEB.  At least 32% reduction was achieved for all modal crossings over the broad flow range of 0.5 to 0.9% of the rig flow.  Thus the results demonstrate the modal- and flowrate-robustness of full-span TEB for reducing forced response in a modern, closely-spaced transonic compressor.  Reduced spanwise TEB coverage was generally found to provide less peak reduction.  Widely varying sensitivities of the vibration modes to the spanwise TEB distribution were also noted.  While the second chordwise mode experienced roughly the same maximum response reduction of 80% for all of the spanwise TEB configurations, some other modes were amplified from the baseline case under part-span TEB conditions.  Part-span TEB was thus found to be less modally-robust than full-span TEB.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:50:31Z (GMT). No. of bitstreams: 1 Bailie2003.pdf: 9629789 bytes, checksum: 70eb1e1eeed61f6f8721d7f5558a6512 (MD5)   Previous issue date: 2003-10-21",
    "Author Email: sbailie@vt.edu",
    "Advisor Email: wng@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11056",
  "identifier_other": "etd-11072003-000400",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11072003-000400",
  "identifier_uri": "http://hdl.handle.net/10919/11056",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bailie2003.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "trailing edge blowing",
    "blade vibration",
    "flow control",
    "compressor",
    "transonic",
    "forced response"
  ],
  "title": "Effects of Inlet Guide Vane Flow Control on Forced Response of a Transonic Fan",
  "type": "Dissertation"
}