{
  "contributor_author": "Bradley, Kevin Michael",
  "contributor_committeechair": "Hauenstein, Neil M. A.",
  "contributor_committeemember": [
    "Finney, Jack W.",
    "Donovan, John J.",
    "Foti, Roseanne J.",
    "Carlson, Kevin D."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2011-08-22T18:46:40Z",
  "date_adate": "2003-10-30",
  "date_available": "2011-08-22T18:46:40Z",
  "date_issued": "2003-08-28",
  "date_rdate": "2004-10-30",
  "date_sdate": "2003-10-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In an effort to demonstrate the usefulness of personality tests as predictors of job performance, it is common practice to draw a validation sample consisting of individuals who are currently employed on the job in question. It has long been assumed that the results of such a study are appropriately generalized to the setting wherein job candidates respond to personality inventories as an application requirement. The purpose of this manuscript was to critically evaluate the evidence supporting the presumed interchangeability of present-employees and job applicants. Existing research on the use of personality tests in occupational settings is reviewed. Theoretical reasons to anticipate differential response processes and self-report personality profiles according to test-taking status (present employees versus job applicants) are reviewed, as is empirical research examining relevant issues. The question of sample type substitutability is further probed via a quantitative review (meta-analysis) of the criterion-related validity of seven personality constructs (Neuroticism, Extraversion, Openness to Experience, Agreeableness, Conscientiousness, Optimism, and Ambition). Further, the meta-analytic correlations among these personality constructs are estimated. Test-taking status is examined as a moderator of the criterion-related validities as well as the personality construct inter-correlations. Meta-analytic correlation matrices are then constructed on the basis of the job incumbent and the job applicant subgroup results. These correlation matrices are utilized in a simulation study designed to estimate the potential degree of error when job incumbents are used in place of job applicants in a validation study for personality tests.  The results of the meta-analyses and the subsequent simulation study suggest that the moderating effect of sample type on criterion-related validity estimates is generally small. Sample type does appear to moderate the criterion-related validity of some personality constructs, but the direction of the effect is inconsistent: in some cases, incumbent validities are larger than applicant validities. Alternatively, incumbent validities sometimes are smaller than applicant validities. Personality construct inter-correlations yield almost no evidence of moderation by sample type. Further, where there are between group differences in the personality construct inter-correlations, these differences have little bearing on the regression equation relating personality to job performance. Despite a few caveats that are discussed, the results are supportive of the use of incumbent samples in personality-test validation research.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:46:40Z (GMT). No. of bitstreams: 1  bradley_dissertation_final.pdf: 361199 bytes, checksum: d5ec23d9ed470e9f7e748176d52de71e (MD5)    Previous issue date: 2003-08-28",
    "Author Email: kbradley@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: donovan@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: kevinc@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11052",
  "identifier_other": "etd-10222003-114117",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10222003-114117",
  "identifier_uri": "http://hdl.handle.net/10919/11052",
  "publisher": "Virginia Tech",
  "relation_haspart": "bradley_dissertation_final.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Validation Research",
    "Personality",
    "Employee-selection",
    "Testing and Assessment"
  ],
  "title": "Personality Test Validation Research: Present-employee and job applicant samples",
  "type": "Dissertation"
}