{
  "contributor_author": "Adams, Susan H.",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Pearson, Judy",
    "Lichtman, Marilyn V.",
    "Jarvis, John P.",
    "Morris, Linda E."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2011-08-22T18:50:31Z",
  "date_adate": "2002-05-01",
  "date_available": "2011-08-22T18:50:31Z",
  "date_issued": "2002-04-03",
  "date_rdate": "2003-05-01",
  "date_sdate": "2002-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This exploratory study examines linguistic and structural features of written narratives for predictive value in determining the likelihood of veracity or deception.  Sixty narratives written by suspects and victims identified through the investigation of criminal incidents provided the database.  The law enforcement context allowed for the examination of communication under stress.  Using a retrospective approach, the veracity or deception of the narratives had already been determined; therefore, the study was able to focus on the degree to which selected linguistic and structural attributes were able to predict veracity and deception.    Six research questions guided the study, drawn from theoretical works and research in psychology, linguistics, and criminal justice.  Three questions asked whether a positive relationship exists between deception of the narratives and the narrative attributes of equivocation, negation, and relative length of the prologue partition.  Three questions asked whether a positive relationship exists between veracity of the narratives and unique sensory details, emotions in the conclusion partition, and quoted discourse.  Support was found for the three questions relating to deception and for a relationship between veracity and unique sensory details.  Weak support was found for a relationship between veracity and emotions in the conclusion partition.  No relationship was found with veracity and the general category of quoted discourse.  When quoted discourse without quotation marks was examined separately, a weak relationship with veracity was found.  An additional finding was a relationship between relative length of the criminal incident partition and veracity. A logistic regression model was developed to predict veracity or deception using the six predictors from the research questions.  The resulting model correctly classified the examined narratives at an 82.1% classification level.  The most significant predictor of veracity was unique sensory details; the most significant predictor of deception was length of the prologue partition.    The analysis of the examined narratives written by suspects and victims suggests that linguistic and structural features of written narratives are predictive of the likelihood of veracity and deception.  These results lend support to the Undeutsch Hypothesis (1989) that truthful narratives differ from fabricated narratives in structure and content.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:50:31Z (GMT). No. of bitstreams: 1 adams1.pdf: 380275 bytes, checksum: b7fd118888847f5c200402df6a7fa1be (MD5)   Previous issue date: 2002-04-03",
    "Author Email: sadams@fbiacademy.edu"
  ],
  "format_medium": "ETD",
  "handle": "11057",
  "identifier_other": "etd-04262002-164813",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262002-164813",
  "identifier_uri": "http://hdl.handle.net/10919/11057",
  "publisher": "Virginia Tech",
  "relation_haspart": "adams1.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "narrative analysis",
    "deception",
    "statement analysis",
    "veracity"
  ],
  "title": "Communication Under Stress: Indicators of Veracity and Deception in Written Narratives",
  "type": "Dissertation"
}