{
  "contributor_author": "Wynn, Thomas Cleveland",
  "contributor_committeechair": "Read, James Fredrick",
  "contributor_committeemember": [
    "Bambach, Richard K.",
    "Dennison, John M.",
    "Eriksson, Kenneth A.",
    "Law, Richard D.",
    "Coruh, Cahit"
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2011-08-22T18:50:45Z",
  "date_adate": "2003-12-02",
  "date_available": "2011-08-22T18:50:45Z",
  "date_issued": "2003-11-11",
  "date_rdate": "2004-12-02",
  "date_sdate": "2003-11-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Well-cuttings data and wireline logs in conjunction with limited core and outcrop data are used to generate a regional, three dimensional  high resolution sequence framework for Upper Mississippian (Chesterian), Big Lime carbonates, West Virginia, U.S.A.. The analysis was done using the washed coarse fraction (1-2 mm) of cuttings for each sample interval, which were separated into Dunham rock types, counted to determine relative abundance and the data presented  as percent lithology plotted against depth for each well. Digitized wireline logs and the cuttings-percent logs were slipped to take into account drilling lag and lithologic columns produced from the combined data.  Sequence stratigraphic cross sections through the basin and into the outcrop belt, with a resolution of 10 feet were then produced. Sequence stratigraphic time slices were generated as isopachs maps of the sequences, and of lowstand-transgressive, and highstand tracts with major facies shown. This data was then used to document the stratigraphic response of the foreland basin to tectonics and, with isotope data from the slope section, evaluates evidence for glacio-eustasy during the transition into ice-house times.  The major mappable sequences are fourth-order sequences, a few meters to over 90 meters (300 feet) thick.  They consist of updip red beds and eolianites, lagoonal muddy carbonates, ooid grainstone and skeletal grainstone-packstone shoal complexes, deeper ramp and slope wackestone-mudstone, and laminated argillaceous lime mudstone. Maximum flooding surfaces on the ramp slope occur at the base of deeper water facies that overlie lowstand- to transgressive siliciclastic or carbonate complexes, whereas on the ramp, maximum flooding surfaces cap near-shore shale or lime mudstone beneath widespread grainstones. The highstand systems tracts contain significant grainstone units, interlayered with extensive lagoonal lime mudstones.  In spite of differential subsidence rates across the foreland, fourth-order eustatic sea level changes documented by isotopic signals in basinal facies, controlled regional  sequence development.  Thrust-load induced differential subsidence of fault-blocks of the foreland basement controlled the rapid basinward thickening of the depositional wedge while subtle structures such as arches at high angles as well as parallel to the margin, affected thicknesses and facies development.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:50:45Z (GMT). No. of bitstreams: 1 WynnETD.pdf: 22982156 bytes, checksum: 0097a8eae035f31c76945c1647e3a0a2 (MD5)   Previous issue date: 2003-11-11",
    "Author Email: twynn@vt.edu",
    "Advisor Email: jread@vt.edu",
    "Advisor Email: kaeson@vt.edu",
    "Advisor Email: rdlaw@vt.edu",
    "Advisor Email: coruh@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11060",
  "identifier_other": "etd-11232003-214905",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11232003-214905",
  "identifier_uri": "http://hdl.handle.net/10919/11060",
  "publisher": "Virginia Tech",
  "relation_haspart": "WynnETD.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Big Lime",
    "Mississippian",
    "sequence stratigraphy",
    "well-cuttings",
    "Greenbrier"
  ],
  "title": "State-Wide Sequence Framework of Mixed Carbonate-Siliciclastic Ramp Reservoirs:  Mississippian Big Lime, West Virginia, USA",
  "type": "Dissertation"
}