{
  "contributor_author": "McKinney, Arlise P",
  "contributor_committeechair": "Bonham, Thirwall W.",
  "contributor_committeecochair": "Singh, Kusum",
  "contributor_committeemember": [
    "Donovan, John J.",
    "Smith, Wanda J.",
    "Cobb, Anthony Terry"
  ],
  "contributor_department": "Management",
  "date_accessioned": "2011-08-22T18:52:41Z",
  "date_adate": "2003-12-11",
  "date_available": "2011-08-22T18:52:41Z",
  "date_issued": "2003-10-31",
  "date_rdate": "2004-12-11",
  "date_sdate": "2003-12-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research examined the validity of the 2-factor (e.g., Button, Mathieu, and Zajac, 1996) and 3-factor (e.g., VandeWalle, 1997) models of goal orientation. These models differ in specifying the dimensionality, measurement, and nomological network for learning goal orientation and performance goal orientation constructs. This study specifically tested the factorial and nomological validity of each model of goal orientation. The factorial validity was examined through a series of nested models and evaluating model fit parameters. The nomological validity of goal orientation was examined testing theoretically-derived relationships with the self-concept traits (e.g., core self-evaluations) of self-esteem, internal locus of control, generalized self-efficacy, and emotional stability. In addition, goal orientation relationships with need for achievement, fear of negative evaluation, and social desirability were also examined.  Results of this study yielded mixed findings for the a priori models. Data from a student sample (N=314) and an employee sample (N=114) resulted in mixed findings across models and across samples. Although there was general support for both factor structures, several psychometric weaknesses were noted in the scales including low factor loadings, low factor variances, and low inter-item correlations. Additionally, results of the test-retest stability of goal orientation constructs were lower than desired across both models. Results of the hypothesized relationships found consistent support for learning goal orientation relationships, while the results for performance goal orientation were mixed. Learning goal orientation reflected positive and moderate levels of associations (i.e., r >.20) with self-esteem, internal locus of control, generalized self-efficacy, emotional stability, need for achievement and negatively related to fear of negative evaluation. Learning goal orientation also reflected positive but smaller levels of association with social desirability. Hypothesized relationships were supported for VandeWalle's (1997) performance avoid goal orientation reflecting negative relationships with the same correlates, except for a positive association with fear of negative evaluation. In general, the hypothesized relationships for Button et al.'s (1996) performance goal orientation and VandeWalle's (1997) performance prove goal orientation were not supported. These relationships resulted in near zero-correlations. Implications for future research addressing the conceptual framework, measurement and nomological relationships for goal orientation are discussed.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:52:41Z (GMT). No. of bitstreams: 1  GoalOrientation_AtestofCompetingModels.pdf: 329556 bytes, checksum: 1cbac496fa3d851c56889bd38176615b (MD5)    Previous issue date: 2003-10-31",
    "Author Email: amckinne@vt.edu",
    "Advisor Email: bonham@vt.edu",
    "Advisor Email: donovan@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: wjsmith@vt.edu",
    "Advisor Email: tcobb@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11074",
  "identifier_other": "etd-12082003-110313",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-12082003-110313",
  "identifier_uri": "http://hdl.handle.net/10919/11074",
  "publisher": "Virginia Tech",
  "relation_haspart": "GoalOrientation_AtestofCompetingModels.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "goal orientation",
    "confirmatory factor analysis",
    "core self-evaluations",
    "validity"
  ],
  "title": "Goal Orientation: A test of competing models",
  "type": "Dissertation"
}