{
  "contributor_author": "Fayad, Amer C.",
  "contributor_committeechair": "Tolin, Sue A.",
  "contributor_committeemember": [
    "Stromberg, Erik L.",
    "Winkel, Brenda S. J.",
    "Veilleux, Richard E.",
    "Maroof, M. A. Saghai",
    "Cramer, Carole L."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2011-08-22T18:52:43Z",
  "date_adate": "2003-12-18",
  "date_available": "2011-08-22T18:52:43Z",
  "date_issued": "2003-12-16",
  "date_rdate": "2004-12-18",
  "date_sdate": "2003-12-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Soybean mosaic virus (SMV; Genus Potyvirus; Family Potyviridae) is one of the most widespread viruses in soybean (Glycine max [L.] Merr.). Hutcheson, a cultivar developed in Virginia, is resistant to the common strains of SMV. However, new resistance-breaking (RB) isolates of SMV have emerged in natural infections to break the resistance of Hutcheson containing the Rsv1y allele. These RB isolates are SMV-G5 and G6-like based on the differential reactions on soybean cultivars with the Rsv1 locus, and are more G6-like based on the amino acid sequence of the coat protein (CP). The CP of the RB isolates is diverse at the amino and carboxy termini and highly conserved in the core region. RB isolates reduce the yield of susceptible cultivars and cause mottling of the seed coat. Dual infection of soybeans with SMV and BPMV increased the severity of symptoms, including plant stunting and SMV titer in comparison to single SMV inoculations. The reactions of Hutcheson and herbicide-tolerant Hutcheson RR were similar with or without herbicide application. Resistance to SMV is controlled by single dominant genes at three distinct loci, Rsv1, Rsv3 and Rsv4. The mechanisms of resistance at the Rsv3 and Rsv4 loci were investigated by tracking virus accumulation and movement over time using leaf immunoprints. The mechanisms of Rsv3 resistance include extreme resistance, hypersensitive response, or restriction to virus replication and movement, which are strain specific. The Rsv4 gene was found to function in a non-strain specific and non-necrotic manner. The mechanisms of Rsv4 resistance involve restricting both cell-to-cell and long distance movement of SMV. The Rsv1, Rsv3 and Rsv4 resistance genes exhibit a continuum of SMV-soybean interactions, and include complete susceptibility, local and systemic necrosis, restriction of virus movement (both cell-to-cell and long distance), reduction in virus accumulation, and extreme resistance with no detectable virus. Cultivars containing two genes for resistance, Rsv1 and Rsv3 or Rsv1 and Rsv4, were resistant to multiple strains of SMV tested and show great potential for gene pyramiding efforts to ensure a wider and more durable resistance to SMV in soybeans.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:52:43Z (GMT). No. of bitstreams: 8  Vitae.pdf: 53793 bytes, checksum: 8ab44b059461f44e05c1d3786aac7b58 (MD5)  FrontMatter.pdf: 313353 bytes, checksum: e44e83b2443881fd3facfab6de55a99e (MD5)  Chapter6.pdf: 112732 bytes, checksum: 2af83828d1a9c6e62aaf97528f003237 (MD5)  Chapter5.pdf: 618819 bytes, checksum: d25eb3e35bfca6d2f435a11728286979 (MD5)  Chapter4.pdf: 910761 bytes, checksum: 54c4eb197ed93832a0e8808346611fe3 (MD5)  Chapter3.pdf: 486873 bytes, checksum: c019c6c565fdbd723e37d1ed44819875 (MD5)  Chapter1.pdf: 341455 bytes, checksum: dd7fd35bdb38144353113e140e98a6bf (MD5)  Chapt2.pdf: 620464 bytes, checksum: bf71fffc9d6032513d201926f95334dc (MD5)    Previous issue date: 2003-12-16",
    "Author Email: afayad@vt.edu",
    "Advisor Email: elstrom@vt.edu",
    "Advisor Email: winkel@vt.edu",
    "Advisor Email: stolin@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: ccramer@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11081",
  "identifier_other": "etd-12182003-093547",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-12182003-093547",
  "identifier_uri": "http://hdl.handle.net/10919/11081",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter1.pdf",
    "Chapt2.pdf",
    "Chapter3.pdf",
    "Chapter4.pdf",
    "Chapter5.pdf",
    "Chapter6.pdf",
    "FrontMatter.pdf",
    "Vitae.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Resistance-Breaking",
    "Virus evolution",
    "Virus Resistance",
    "Virus Movement",
    "SMV"
  ],
  "title": "Interactions of soybean Rsv genes and Soybean mosaic virus",
  "type": "Dissertation"
}