{
  "contributor_author": "Baker, David",
  "contributor_committeecochair": [
    "Burton, John K.",
    "Magliaro, Susan G."
  ],
  "contributor_committeemember": [
    "Moore, David Michael",
    "Cennamo, Kathy",
    "Cross, Lawrence H."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2011-08-22T18:52:43Z",
  "date_adate": "2003-12-31",
  "date_available": "2011-08-22T18:52:43Z",
  "date_issued": "2003-12-05",
  "date_rdate": "2003-12-31",
  "date_sdate": "2003-12-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigates how four urban school districts, serving low socioeconomic status (SES) student populations, define, prepare teachers for, and implement integration of computer technology into the K-12 classroom in response to a Virginia state mandate.  Factors influencing computer integration into the curriculum were also studied.  Semi-structured interviews were conducted with 50 educators representing 2 state-level administrators, 12 district level-administrators, 8 school-level administrators, 23 classroom teachers, and 5 school-level technology specialists.  Interviews were supplemented by classroom observations, teacher lesson plans, and district technology plans to provide data for an in-depth, multi-case study.  Based on the access provided, one to two weeks were spent in each setting conducting interviews and recording the availability and use of computer technology in the classroom and its integration into instruction.  All four districts met the mandate as stated and used similar definitions of integration and approaches to teacher preparation and implementation.  Results indicate, however, that computer technology use within these schools is still confined primarily to laboratory settings and that students' technology experiences are not directly integrated into daily classroom instruction or lesson planning.  Leadership, planning, funding, access to resources, time, training, and support were identified as factors when integrating technology into daily instruction.  The mandate required a level of accountability, which served as a device to encourage and motivate more reluctant users of computer technology to gain necessary technical skills and adopt technology as a tool to support instruction.  Response to the mandate has (1) increased dialogue between administrators, support staff, and teachers regarding technology and its integration; (2) provided an impetus for districts to use funds to purchase computers and other technology resources; and (3) provided an impetus for districts to begin to look at and monitor, if not evaluate teachers' use of technology for instruction.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:52:43Z (GMT). No. of bitstreams: 1  ETD.pdf: 4906670 bytes, checksum: 92153a7acfe336e351247bbe6d6e2a01 (MD5)    Previous issue date: 2003-12-05",
    "Author Email: dabaker4@hotmail.com",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: cennamo@vt.edu",
    "Advisor Email: sumags@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11082",
  "identifier_other": "etd-12182003-131500",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-12182003-131500",
  "identifier_uri": "http://hdl.handle.net/10919/11082",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Teacher Preparation",
    "Computer Integration",
    "State Mandates"
  ],
  "title": "Make it so: How low-resourced school districts implement a Virginia state mandate to prepare K-12 teachers to integrate technology into the classroom",
  "type": "Dissertation"
}