{
  "contributor_author": "Whitaker, Darroch M.",
  "contributor_committeechair": "Stauffer, Dean F.",
  "contributor_committeemember": [
    "Oderwald, Richard G.",
    "Walters, Jeffery R.",
    "Kirkpatrick, Roy L.",
    "Norman, Gary W.",
    "Haas, Carola A."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2011-08-22T18:53:08Z",
  "date_adate": "2004-01-15",
  "date_available": "2011-08-22T18:53:08Z",
  "date_issued": "2003-12-15",
  "date_rdate": "2004-01-15",
  "date_sdate": "2004-01-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Ruffed grouse populations are low in Appalachian forests, possibly because low habitat quality negatively affects survival, condition, and reproduction. Through the Appalachian Cooperative Grouse Research Project (ACGRP) researchers tracked >1500 radioed grouse at 10 study sites (1996__2002). To improve our understanding of Appalachian grouse habitat ecology, I carried out two primary analyses of this database. First, grouse should be under selective pressure to minimize movements, so I studied factors associated with variation in home range size. Second, importance of a habitat is affected by an individual's resource needs, and I investigated factors associated with variation in selection of \"preferred\" habitats. Both approaches yielded important insights into the species' regional habitat ecology.    As elsewhere, clearcuts, which afford escape cover, formed the cornerstone of grouse habitat in the region. However, a number of other factors were also important. At the root of this was a divergence in habitat ecology between grouse inhabiting the two major forest types in the region. In oak-hickory forests nutritional constraint strongly influenced habitat use. Grouse home ranges increased 2.5x following poor hard mast crops, and at these times grouse increased use of alternate foraging habitats. Grouse, especially females and broods, made extensive use of mesic bottomlands and forest edges, which in oak-hickory forests support relatively abundant soft mast and herbaceous forages. In contrast, grouse inhabiting mixed mesophytic forests were insensitive to hard mast, did not select bottomlands, reduced use of forest edges, and increased use of clearcuts. I feel that greater abundance of birch, cherry, and aspen, buds of which are a high quality winter food, relieves nutritional stress on grouse inhabiting mesophytic forests. A general inference was that grouse attempted to balance competing strategies of maximizing either survival or condition, and the expression of this tradeoff was mediated by forest composition.   Also presented here were studies of radiotelemetry error, roost site selection, and suitability of prescribed burning as a habitat improvement technique. In the closing chapter I make recommendations for managing Appalachian forests for grouse, which focus on improving winter foraging habitat, brood habitat, and escape cover, all of which are limiting in Appalachian forests.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:08Z (GMT). No. of bitstreams: 1  FINAL.pdf: 6413122 bytes, checksum: 4b9532fb4ff49c86d92eedd28d3512cc (MD5)    Previous issue date: 2003-12-15",
    "Author Email: dwhitake@vt.edu",
    "Advisor Email: oderwald@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: rlkirk@vt.edu",
    "Advisor Email: gnorman@dgif.state.va.us",
    "Advisor Email: cahaas@vt.edu",
    "Advisor Email: dstauffe@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11089",
  "identifier_other": "etd-01082004-180058",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01082004-180058",
  "identifier_uri": "http://hdl.handle.net/10919/11089",
  "publisher": "Virginia Tech",
  "relation_haspart": "FINAL.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "habitat ecology",
    "forest management",
    "Appalachian Mountains",
    "radiotelemetry",
    "Bonasa umbellus",
    "Ruffed Grouse"
  ],
  "title": "Ruffed grouse (Bonasa umbellus) habitat ecology in the central and southern Appalachians",
  "type": "Dissertation"
}