{
  "contributor_author": "Morton, Siyuan Chen",
  "contributor_committeechair": "Edwards, Marc A.",
  "contributor_committeemember": [
    "Corcoran, Sean Gerald",
    "Little, John C.",
    "Love, Nancy G.",
    "Rimstidt, james Donald"
  ],
  "contributor_department": "Environmental Engineering",
  "date_accessioned": "2011-08-22T18:52:43Z",
  "date_adate": "2004-01-06",
  "date_available": "2011-08-22T18:52:43Z",
  "date_issued": "2003-11-19",
  "date_rdate": "2005-01-06",
  "date_sdate": "2003-12-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Phosphorus chemistry controls key aspects of eutrophication, microbial nutrition, corrosion and other environmental processes.  It is commonly assumed that phosphorus occurs exclusively as phosphate (+5) in nature.  In fact, although phosphate is undoubtedly dominant in many systems, phosphorus compounds with lower oxidation states (reduced phosphorus) can also be present in the environment and could be of practical importance in many circumstances.  Most reduced phosphorus compounds are likely to originate in steel-making or thermal phosphorus plants.  It was determined that reduced phosphorus would not be detected in routine environmental analyses even if they were present.  A new method was developed to detect these compounds, and in a preliminary survey reduced phosphorus was proven to be present in water that contacts corroding iron pipes, steel slag samples, phosphorus plant wastewater, phosphite fertilizers, and in sewage treatment plant effluent.  However, no evidence could be obtained for massive bio-reduction of phosphates that has been proposed by some researchers.  Given that phosphorus is often a limiting nutrient, and phosphorus compounds sometimes inhibit and sometimes catalyze practically important reactions (e.g. iron corrosion), future work should examine reduced phosphorus occurrence and chemistry in greater detail.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:52:43Z (GMT). No. of bitstreams: 1 dissertation-2.pdf: 1739538 bytes, checksum: e1d016dbb3a325107f533c35e2e3295e (MD5)   Previous issue date: 2003-11-19",
    "Author Email: sichen@vt.edu",
    "Advisor Email: edwardsm@vt.edu",
    "Advisor Email: sgc@mse.vt.edu",
    "Advisor Email: jcl@vt.edu",
    "Advisor Email: nlove@VT.EDU",
    "Advisor Email: jdr02@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11083",
  "identifier_other": "etd-12212003-204524",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-12212003-204524",
  "identifier_uri": "http://hdl.handle.net/10919/11083",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation-2.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Reduced Phosphorus",
    "Phosphorus Analysis",
    "Anaerobic Iron Corrosion"
  ],
  "title": "Phosphorus in the Environment and its Role in Anaerobic Iron Corrosion",
  "type": "Dissertation"
}