{
  "contributor_author": "Dursun, Aziz",
  "contributor_committeechair": "Corcoran, Sean Gerald",
  "contributor_committeecochair": "Reynolds, William T. Jr.",
  "contributor_committeemember": [
    "Kampe, Stephen L.",
    "Marand, Hervé L.",
    "Farkas, Diana"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2011-08-22T18:53:09Z",
  "date_adate": "2004-01-21",
  "date_available": "2011-08-22T18:53:09Z",
  "date_issued": "2003-05-13",
  "date_rdate": "2004-01-21",
  "date_sdate": "2003-10-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Selective dissolution also known as dealloying is a corrosion process in which one component of a binary alloy system is selectively removed through an electrochemically controlled process which leads to the formation of a porous metal \"sponge\" with a porosity that is completely interconnected and random in direction.  Nanoporous metals are desirable since they have larger surface areas than an equal volume of non-porous material. Because of their enormous surface area per volume, these highly porous metal electrodes are superior materials for high surface area applications such as in biomedical devices, microfilters and catalysts.           Understanding the kinetic processes governing the development of porosity during dealloying and having ability to change the electrochemical conditions will allow us to better control over the average ligament size and distribution in porosity. The basic kinetic processes involved in the formation of these structures are related to such issues as environmental effects and electrochemical conditions on diffusion, microscopic coarsening phenomenon at room temperature and elevated temperatures, alloy passivation, and Gibbs-Thomson effects.    The average pore size and distribution was found to depend on the electrolyte composition, dealloying rate, applied potential and time. The porosity was found to significantly coarsen at room temperature during the dealloying process and this coarsening was highly dependent on the applied potential.  It is showed that the commonly accepted measurement of the critical potential for alloy dissolution calculated based on extrapolation of anodic polarization data results in an overestimation of this quantity. A series of constant applied potential experiments prove to be a more accurate method for critical potential determination.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:09Z (GMT). No. of bitstreams: 1  thesis_aziz.pdf: 7244183 bytes, checksum: 493cd2edd69a122955df1cb87012c95a (MD5)    Previous issue date: 2003-05-13",
    "Author Email: adursun@vt.edu",
    "Advisor Email: kampe@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: hmarand@vt.edu",
    "Advisor Email: diana@vt.edu",
    "Advisor Email: sgc@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11093",
  "identifier_other": "etd-10262003-200453",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10262003-200453",
  "identifier_uri": "http://hdl.handle.net/10919/11093",
  "publisher": "Virginia Tech",
  "relation_haspart": "thesis_aziz.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "small angle neutron scattering",
    "dealloying critical potential",
    "porous metals",
    "selective dissolution",
    "coarsening",
    "surface diffusion"
  ],
  "title": "Nanoporosity Formation in Ag-Au Alloys",
  "type": "Dissertation"
}