{
  "contributor_author": "Iridiastadi, Hardianto",
  "contributor_committeechair": "Nussbaum, Maury A.",
  "contributor_committeemember": [
    "Wojcik, Laura A.",
    "Babski-Reeves, Kari L.",
    "Madigan, Michael L.",
    "Lockhart, Thurmon E.",
    "van Dieën, Jaap H."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2011-08-22T18:53:09Z",
  "date_adate": "2004-01-21",
  "date_available": "2011-08-22T18:53:09Z",
  "date_issued": "2003-12-10",
  "date_rdate": "2004-01-21",
  "date_sdate": "2003-12-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Work-related musculoskeletal disorders (WMSDs) are prevalent in the workplace, and epidemiology studies show that these problems do not tend to diminish.  While the use of new and advanced technology has substantially reduced the amount of physical workload, repetitive manual activities are still typically observed in various work settings.  Despite their fairly low workload intensity, prolonged repetitive tasks have been associated with the development of musculoskeletal complaints and problems.  Research on localized muscle fatigue (LMF) has been viewed as a viable endeavor toward understanding the processes and mechanisms associated with WMSDs.  A mounting of evidence on local fatigue during sustained static work has been presented, but much less is known with respect to muscle fatigue during more complex activities.   A study was conducted with the primary objectives of determining the repeatability of several commonly used fatigue measures, and to evaluate the presence of long-lasting effects of fatigue from different recovery periods.  Based on low-level intermittent arm abductions, findings from this study demonstrated that the use of perceptions of muscular discomfort and muscle strength as fatigue measures was satisfactory.  In contrast, electromyography (EMG)-based measures were characterized by a fairly low repeatability.  The study also suggested that, whenever practical, two days of recovery should be allotted in studies involving multiple exposures to fatiguing protocols.  Long lasting effects of fatigue could be present when shorter amounts of recovery period were assigned.   A second study was also carried out to investigate the effects of work parameters (force-level, work-rest ratio, and work cycle) on muscular fatigue during intermittent static efforts.  It was suggested that work conditions with muscular contraction level less than 12% MVE was non-fatiguing, irrespective of the values of the work parameters selected.  Intermittent work with higher levels of muscle contraction might be acceptable, but it was dependent upon interactions of the other two parameters.   The effects of dynamic work conditions on muscle fatigue were investigated in another study.  Findings from this third study suggested that muscles responded differently under dynamic conditions and the use of typical EMG measures (dynamic EMG) could be less sensitive.  This study further demonstrated that fatigue evaluations during such conditions were difficult, and only a limited number of EMG-based measures could be potentially employed.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:09Z (GMT). No. of bitstreams: 1  Iridiastadi_Dissertation.pdf: 1949198 bytes, checksum: e9d35e72d379680140beac87bfa49de5 (MD5)    Previous issue date: 2003-12-10",
    "Author Email: dadi@vt.edu",
    "Advisor Email: law@packereng.com",
    "Advisor Email: kbabski@vt.edu",
    "Advisor Email: mimadiga@vt.edu",
    "Advisor Email: lockhart@vt.edu",
    "Advisor Email: nussbaum@vt.edu",
    "Advisor Email: j_h_van_dieen@fbw.vu.nl"
  ],
  "format_medium": "ETD",
  "handle": "11095",
  "identifier_other": "etd-12222003-171305",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-12222003-171305",
  "identifier_uri": "http://hdl.handle.net/10919/11095",
  "publisher": "Virginia Tech",
  "relation_haspart": "Iridiastadi_Dissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "muscular endurance",
    "EMG",
    "EVA",
    "CPDE",
    "isometric-nonisotonic effort",
    "localized muscle fatigue",
    "isometric-isotonic work"
  ],
  "title": "Localized muscle fatigue during isotonic and nonisotonic isometric efforts",
  "type": "Dissertation"
}