{
  "contributor_author": "Prateapusanond, Apirath",
  "contributor_committeecochair": "Lefter, James",
  "contributor_committeemember": [
    "Lowe, James K. Jr.",
    "Martinez, Julio C.",
    "Vorster, Michael C.",
    "de la Garza, Jesus M."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2011-08-22T18:53:09Z",
  "date_adate": "2004-01-21",
  "date_available": "2011-08-22T18:53:09Z",
  "date_issued": "2003-12-05",
  "date_rdate": "2004-01-21",
  "date_sdate": "2004-01-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Many construction contracts require contractors to use the Critical Path Method (CPM) scheduling technique as a management tool.  In such projects, many participating parties commonly attempt to appropriate float time shown in the CPM schedules in order to advance their own interests.  Under current scheduling practices, float time is considered \"free\" and therefore does not belong to any one party in the construction process.  As a result of this conception, when a project delay occurs, float ownership and its utilization can become a major source of dispute.    This ambiguous interpretation of total float ownership can be clarified by improving contract language with regard to scheduling specifications in the area of total float management.  The purpose of this research dissertation is to introduce a comprehensive practice of float pre-allocation and management terms, for the application of scheduling specifications in the CPM-based construction contract.  The proposed concept for managing \"total float\" involves pre-allocating a set amount of total float on the same non-critical path of activities to the two contractual parties -   owner and contractor.  For the sake of equity, this research adopts an equal (50-50) allocation concept, which allocates to each party one-half of the total float.    This new concept for pre-allocating and managing \"total float\" involves recommending contract clauses to direct its use and to explain the manner in which responsibility for any resulting delay will be assigned.   Six examples of factual situations are provided to illustrate the assigning of responsibility for delays.   The features of proposed concept are then compared to those of other theories presently being used.  Such a comparison provides insight as to which features have not worked well in the past - and how those of the proposed concept can change this.    A Delphi survey is used to validate the total float pre-allocation concept of equal allocation.  The survey shows that the concept could significantly increase involved parties' awareness of total float consumption and thus help resolve any potential disputes regarding it. This dissertation considers suggestions obtained from the survey and recommends them for future study.  The simple step of inserting new scheduling language into the construction contract documents assures that all participants will become more aware of the fact that when they consume floats, they introduce the potential of increasing project completion times.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:09Z (GMT). No. of bitstreams: 1  ApirathDissertation120503Rev2.pdf: 2787875 bytes, checksum: 429c308a7ee9c600af11c65b5ddb50b6 (MD5)    Previous issue date: 2003-12-05",
    "Author Email: apirathp@hillintl.com, apirath_mew@hotmail.com",
    "Advisor Email: jkyiasemides@msn.com",
    "Advisor Email: lefter@vt.edu",
    "Advisor Email: julio@vt.edu",
    "Advisor Email: mikev@vt.edu",
    "Advisor Email: chema@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11094",
  "identifier_other": "etd-01062004-103309",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01062004-103309",
  "identifier_uri": "http://hdl.handle.net/10919/11094",
  "publisher": "Virginia Tech",
  "relation_haspart": "ApirathDissertation120503Rev2.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Contract",
    "Total Float Ownership",
    "Delay Analysis",
    "CPM",
    "Construction Law",
    "Scheduling",
    "Construction Management"
  ],
  "title": "A Comprehensive Practice of Total Float Pre-Allocation and Management for the Application of A CPM-Based Construction Contract",
  "type": "Dissertation"
}