{
  "contributor_author": "O'Reilly, Susan Erin",
  "contributor_committeechair": "Hochella, Michael F. Jr.",
  "contributor_committeemember": [
    "Rimstidt, james Donald",
    "Cox, David F.",
    "Eick, Matthew J.",
    "Zelazny, Lucian W."
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2011-08-22T18:53:08Z",
  "date_adate": "2002-10-04",
  "date_available": "2011-08-22T18:53:08Z",
  "date_issued": "2002-09-27",
  "date_rdate": "2003-10-04",
  "date_sdate": "2002-10-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Lead sorption efficiencies (sorption per surface area) were measured for a number of natural and synthetic Mn and Fe-oxides using a flow through reactor.  The Mn-oxide phases examined included synthetic birnessite, natural and synthetic cryptomelane, and natural and synthetic pyrolusite; the Fe-oxides studied were synthetic akaganeite, synthetic ferrihydrite, natural and synthetic goethite, and natural and synthetic hematite.  The sorption flow study experiments were conducted with 10 ppm Pb with an ionic strength of either 0.01 M NaNO3 or 0.01 M KNO3 both at pH 5.5.  The experimental effluent solution was analyzed using aqueous spectroscopic methods and the reacted solids were analyzed using microscopy (field emission scanning electron microscopy, FE-SEM), structure analysis (powder X-ray diffraction, XRD), bulk chemical spectroscopy (energy dispersive spectroscopy, EDS), and surface sensitive spectroscopy (X-ray photoelectron spectroscopy, XPS).  Overall, the synthetic Mn-oxides did have higher sorption efficiencies than the natural Mn-oxides, which in turn were higher than the natural and synthetic Fe-oxides.  Only natural pyrolusite had a sorption efficiency as low as the Fe-oxides.  Most of the natural and synthetic Fe-oxides examined in this study removed about the same amount of Pb from solution once normalized to surface area, although synthetic akaganeite and hematite were significantly less reactive than the rest.  The observed efficiency of Mn-oxides for Pb sorption is directly related to internal reactive sites in the structures that contain them (birnessite and cryptomelane, in the case of this study).  Comparisons of solution data to XPS data indicated that Pb went into the interlayer of the birnessite, which was supported by XRD; similarly some Pb may go into the tunnels of the cryptomelane structure. Layer structures such as birnessite have the highest Pb sorption efficiency, while the 2 x 2 tunnel structure of cryptomelane has lower efficiencies than birnessite, but higher efficiencies than other Mn- or Fe-oxide structures without internal reactive sites.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:08Z (GMT). No. of bitstreams: 1  oreillyETD.pdf: 3346436 bytes, checksum: 2a3ad1f8d5fc62c810bc30d8ad0e9c0c (MD5)    Previous issue date: 2002-09-27",
    "Author Email: soreilly@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Advisor Email: eick@vt.edu",
    "Advisor Email: zelazny@vt.edu",
    "Advisor Email: hochella@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11090",
  "identifier_other": "etd-10042002-115408",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10042002-115408",
  "identifier_uri": "http://hdl.handle.net/10919/11090",
  "publisher": "Virginia Tech",
  "relation_haspart": "oreillyETD.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "lead",
    "manganese oxide",
    "adsorption",
    "microscopy",
    "spectroscopy",
    "iron oxide",
    "sorption"
  ],
  "title": "Lead Sorption Efficiencies of Natural and Sunthetic Mn and Fe-oxides",
  "type": "Dissertation"
}