{
  "contributor_author": "Littleton, Heather Leigh",
  "contributor_committeechair": "Axsom, Daniel K.",
  "contributor_committeemember": [
    "Ollendick, Thomas M.",
    "Cooper, Lee D.",
    "Clum, George A. Jr.",
    "Stephens, Robert S."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2011-08-22T18:53:10Z",
  "date_adate": "2004-01-22",
  "date_available": "2011-08-22T18:53:10Z",
  "date_issued": "2003-10-24",
  "date_rdate": "2005-01-22",
  "date_sdate": "2003-11-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Unacknowledged rape- having an experience that, if true, legally would be considered rape, but not conceptualizing it as rape, or sometimes even a victimization, is a common and understudied phenomenon.  The present study sought to examine a coping model regarding unacknowledged rape.  In this model, not acknowledging rape is viewed, in part, as a response to experiencing a number of negative consequences as a result of the assault, such as negative social reactions and feelings of responsibility.  In addition, it is hypothesized that unacknowledged victims may turn to maladaptive coping techniques to cope with this assault, and not acknowledging the rape may aid in facilitating and justifying these attempts at coping, once initiated.  Therefore, it was hypothesized that unacknowledged victims, compared to acknowledged victims, would suffer more negative consequences after the assault and they would use more maladaptive, avoidance coping.  To test these hypotheses, an online survey was developed.  A total of 1,253 university women drawn from the psychology department participant pool over three semesters, completed the survey.  Of these, 256, or 20.4% of the sample reported having an experience consistent with a legal definition of rape.  Sixty percent did not consider this experience to be a victimization and thus were classified as unacknowledged rape victims.  Replicating previous research, unacknowledged victims suffered less violent assaults and also had consumed more alcohol during the assault.  However, the results overall did not support the proposed  model.  There were few differences in the amount of negative consequences experienced by acknowledged and unacknowledged victims.  In addition, the results suggested that being an unacknowledged victim was not associated with increased reliance on avoidance coping.  Instead, acknowledged victims engaged in more of all coping strategies, perhaps because acknowledged assaults tended to produce slightly more severe posttraumatic symptoms.  Several possible future directions were therefore proposed including a focus on cognitive and memory variables in rape acknowledgment as well as a focus on what leads women to acknowledge an assault, given that not acknowledging rape is the normative response to this type of victimization.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:10Z (GMT). No. of bitstreams: 1  heatherlittletondissertation3.pdf: 314499 bytes, checksum: 645f37623ea1c70af149db924523558a (MD5)    Previous issue date: 2003-10-24",
    "Author Email: hlittlet@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Advisor Email: stephens@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11097",
  "identifier_other": "etd-11062003-190640",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11062003-190640",
  "identifier_uri": "http://hdl.handle.net/10919/11097",
  "publisher": "Virginia Tech",
  "relation_haspart": "heatherlittletondissertation3.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "coping",
    "rape",
    "sexual assault",
    "unacknowledged rape"
  ],
  "title": "The coping process of the unacknowledged rape victim",
  "type": "Dissertation"
}