{
  "contributor_author": "Sukkariyah, Beshr",
  "contributor_committeecochair": [
    "Zelazny, Lucian W.",
    "Evanylo, Gregory K."
  ],
  "contributor_committeemember": [
    "Chaney, Rufus L.",
    "Reneau, Raymond B. Jr.",
    "Eick, Matthew J."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2011-08-22T18:53:10Z",
  "date_adate": "2004-01-22",
  "date_available": "2011-08-22T18:53:10Z",
  "date_issued": "2003-12-18",
  "date_rdate": "2005-01-22",
  "date_sdate": "2004-01-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The long-term mobility and availability of trace metals has been cited as a potential hazard by critics of EPA 503 rule governing the land application of biosolids. The purpose of this research was to investigate the long-term effects of biosolids application on trace metals distribution and mobility. A single application of aerobically digested biosolids was applied to 1.5 x 2.3 m confined plots of a Davidson clay loam (clayey, kaolinitic, thermic, Rhodic Paleudult) in 1984 at 0, 42, 84, 126, 168, and 210 Mg/ha. The highest biosolids application supplied 4.5, 760, 43, and 620 kg ha-1 of Cd, Cu, Ni, and Zn, respectively. Radish (Raphanus sativus L.), lettuce (Lactuca sativa Var longifolia) and barley (Hordeum vulgare) were planted at the site. Soils were sampled to a depth of 0.9 m and sectioned into 5 cm increments after separating the Ap horizon. Total (EPA 3050B), available (Mehlich-I), sequential extraction, and dispersible clay analyses were performed on samples from the control, 126 Mg/ha and 210 Mg/ha treatments. Extractable (0.005 DTPA, 0.01 M CaCl2, and Mehlich-1) Cd, Cu, Ni, and Zn were measured on 15 cm-depth samples from each plot. Simple linear regression between plant metal concentration and biosolids-added trace metals were computed to determine uptake coefficients (UC) of crops for each metal as outlined by USEPA Part 503 Rule.  Results indicated that more than 80% of the applied Cu and Zn are still found in the topsoil where biosolids were incorporated with slight enrichment down to 0.3 m. Biosolids application increased the concentration of trace metals in all the extracted fractions, with a large proportion of Zn and Cd present in the available forms. The major portion of Cu, Zn and Ni was associated with the metal-oxides fraction. Biosolids treatments had no significant effect on the yield of the crops. Plant uptake of trace metals differed among crops. Plant tissue metal concentrations increased with biosolids rate but were within the normal range for these crops. Trace metals concentration in plants generally correlated well with their concentrations extracted with 0.005 M DTPA, 0.01 M CaCl2 and Mehlich-1. Mehlich-1 gave the highest correlation coefficients for Cu and Zn and, therefore, was the most reliable in predicting their availability and uptake by the crops grown. Availability of trace metals as measured by Mehlich-I, DTPA, and CaCl2 extraction were higher in amended plots as compared to the control and increased linearly in response to biosolids addition. Metal concentration in the plants exhibited a plateau response in most cases. Several linear increases were observed in some cases in 2003 when the soil pH decreased below 5.5. The uptake coefficients values generated for the different crops were in agreement with the values set by the Part 503 Rule.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:10Z (GMT). No. of bitstreams: 2  Frontmatter.pdf: 95478 bytes, checksum: 2f48dc9e6bd2c4648b34ca075f23b8ab (MD5)  Dissertation.pdf: 461639 bytes, checksum: 0e25e5174f7d2e9cc43b20a22beb8860 (MD5)    Previous issue date: 2003-12-18",
    "Author Email: bsukkari@vt.edu",
    "Advisor Email: chaneyr@ba.ars.usda.gov",
    "Advisor Email: reneau@vt.edu",
    "Advisor Email: eick@vt.edu",
    "Advisor Email: zelazny@vt.edu",
    "Advisor Email: gevanylo@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11098",
  "identifier_other": "etd-01092004-124303",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01092004-124303",
  "identifier_uri": "http://hdl.handle.net/10919/11098",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Frontmatter.pdf",
    "Dissertation.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Mobility",
    "Availability",
    "Trace metals",
    "Biosolids"
  ],
  "title": "Trace Metals Mobility in Soils and Availability to Plants from a Long-Term Biosolids Amended Soil",
  "type": "Dissertation"
}