{
  "contributor_author": "Williams, Carl David",
  "contributor_committeechair": "Stephens, Robert S.",
  "contributor_committeemember": [
    "Winett, Richard A.",
    "Clum, George A. Jr.",
    "Cooper, Lee D.",
    "Finney, Jack W."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2011-08-22T18:53:10Z",
  "date_adate": "2004-01-21",
  "date_available": "2011-08-22T18:53:10Z",
  "date_issued": "2003-06-27",
  "date_rdate": "2005-01-21",
  "date_sdate": "2003-12-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "College students drink at high rates. More than 80% of college students drink alcohol and about 40% engage in occasions of heavy drinking. Heavy episodic drinking among college students is associated with multiple negative consequences, such as verbal confrontations, physical fights, unprotected sex, vandalism, and driving while under the influence. Goals constitute a broad cognitive context in which behaviors occur. As an established technology for studying goal constructs, personal projects (Little, 1983; 1989; 1998) assess both long-term and short-term goals, as well perceptions about the goals assessed. Aided by the assessment of personal projects, the present study examined the ability of goal constructs to explain variability in drinking among college students within an integrated social cognitive theory model. In prospective analyses, results indicated that alcohol self-efficacy, negative outcome expectancies, and drinking self-regulation strategies were shown to be significant predictors of drinking. In addition, the goal attribute variables of Involvement and Efficacy, incongruence, and avoidance accounted for unique variance in drinking after controlling for gender, self-efficacy, outcome expectancies and drinking self-regulation. Results add to the understanding of motivational forces potentially important to drinking decisions, highlighting the contributions of goal variables.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:10Z (GMT). No. of bitstreams: 2  CDWETD2.pdf: 670285 bytes, checksum: 689779389237f359e34944139389b0dc (MD5)  CDWETD1.PDF: 89767 bytes, checksum: 49e5ce68b356f24091ccabb280e3fe71 (MD5)    Previous issue date: 2003-06-27",
    "Author Email: cawilli6@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: finney@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11096",
  "identifier_other": "etd-12302003-173124",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-12302003-173124",
  "identifier_uri": "http://hdl.handle.net/10919/11096",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CDWETD1.PDF",
    "CDWETD2.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Alcohol",
    "College Students",
    "Goals",
    "Social Cognitive Theory"
  ],
  "title": "Personal goals systems and social cognitive theory: A motivational model of college student alcohol use",
  "type": "Dissertation"
}