{
  "contributor_author": "Jang, Chang-Hyun",
  "contributor_committeechair": "Ducker, William A.",
  "contributor_committeemember": [
    "Anderson, Mark R.",
    "Esker, Alan R.",
    "Morris, John R.",
    "Tissue, Brian M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2011-08-22T18:53:12Z",
  "date_adate": "2004-02-10",
  "date_available": "2011-08-22T18:53:12Z",
  "date_issued": "2003-12-19",
  "date_rdate": "2005-02-10",
  "date_sdate": "2004-01-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study describes the covalent and the electrostatic attachment of molecules, nano-particles, and proteins to patterned self-assembled monolayers. A scanning probe nanografting technique was employed to produce patterns of various sizes, down to 10 nm. Thus, we are able to demonstrate a degree of surface patterning which is an order of magnitude smaller than that used in the semiconductor industry. One efficient strategy for creating chemically specific nanostructures is to use the extraordinary catalytic properties of enzymes. However, as the dimension of a catalyst patch is reduced down to nanometer scale, it is difficult to detect the very low concentration of product. This study resolves the problem by developing a new strategy: the surface trapping of a product generated by a nanometer-scale patch of surface-bound enzyme. An array of proteins finds use when the array contains a number of different proteins. Toward this end, a new and convenient method for immobilizing enzymes is developed, which will allow the preparation of thin films containing several different catalytically-active enzymes on the nanoscale. The disadvantage of scanning probe nanografting technique is that the AFM tip loses resolution through wear during the patterning procedure. This study examines the possibility of developing a new AFM lithographic method to avoid wear: the use of enzymes covalently attached to a tip as a site-specific catalyst.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:12Z (GMT). No. of bitstreams: 1 ETD-correct.pdf: 3593337 bytes, checksum: 3b7ca024623545e4d5dfa0e6da0ef86f (MD5)   Previous issue date: 2003-12-19",
    "Author Email: chjang@vt.edu",
    "Advisor Email: wducker@vt.edu",
    "Advisor Email: mark.anderson@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: jrmorris@vt.edu",
    "Advisor Email: tissue@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11103",
  "identifier_other": "etd-01242004-013030",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01242004-013030",
  "identifier_uri": "http://hdl.handle.net/10919/11103",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD-correct.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Atomic Force Microscopy",
    "Nanofabrication",
    "Self-Assembled Monolayer",
    "Lithography",
    "Acetylcholinestrase"
  ],
  "title": "AFM-Assisted Nanofabrication using Self-Assembled Monolayers",
  "type": "Dissertation"
}