{
  "contributor_author": "West, Patricia A.",
  "contributor_committeecochair": [
    "Crockett, Jean B.",
    "Sughrue, Jennifer A."
  ],
  "contributor_committeemember": [
    "Curcio, Claire Cole Vaught",
    "Parson, Stephen R.",
    "Twiford, Travis W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2011-08-22T18:53:12Z",
  "date_adate": "2002-12-12",
  "date_available": "2011-08-22T18:53:12Z",
  "date_issued": "2002-12-02",
  "date_rdate": "2003-12-12",
  "date_sdate": "2002-12-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "There is increasing recognition of an impending shortage of educational leaders to fill vacant administrative positions. Consequently, interest in finding ways to support, guide, and retain novice principals has emerged. Mentoring is a popular and effective means of transferring knowledge from an experienced principal to a newly appointed one. Little attention, however, has been given to the process of formal administrative mentorships and how they can be shaped to meet the varied needs of new school principals. The purpose of this study was to explore the personal experiences of novice and veteran principals and the underpinnings of the formal administrative mentoring program in one local school district in Virginia. Seventeen principals were interviewed as participants in this case study. The study was implemented through the use of qualitative research methods of inquiry, including interviews with an administrator of the mentoring program, in-depth interviews with principals, and examination of available documents. This research presents the perspectives of both novice and veteran principals regarding the extent to which their formal mentoring experiences helped them. The data that emerged from this study demonstrated that the formal administrative mentoring experience provided the participants with a greater clarity of role, developed their understanding of the organization, thus facilitating their socialization into it, and helped with diminishing their feelings of isolation. The participants reported that mentoring helped increase their understanding of three major roles of the contemporary principal: (a) instructional leader; (b) school visionary; and (c) team builder. According to the novices, mentors helped them learn how to integrate into the school system through interaction with their communities and how to negotiate their needs within the school division. Novice principals' responses reflected ambivalence about this particular area of their mentoring experience and the help it afforded, however; their responses appeared to be related to their years of experience and the positions they had previously held in the division. Mentees and mentors alike reported that mentoring helped reduce their feelings of isolation through the development of camaraderie with one another as well as a network of colleagues. Most of the participants in the study reflected overall positive perceptions related to their formal administrative mentoring experiences.",
  "description_degree": "EDD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:12Z (GMT). No. of bitstreams: 1  WestPat.pdf: 1402996 bytes, checksum: 8123903aa530ff64b83a1051cce90a29 (MD5)    Previous issue date: 2002-12-02",
    "Author Email: pawest@henrico.k12.va.us, pwest@erols.com",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: jsugh@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: ttwiford@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11102",
  "identifier_other": "etd-12082002-223705",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-12082002-223705",
  "identifier_uri": "http://hdl.handle.net/10919/11102",
  "publisher": "Virginia Tech",
  "relation_haspart": "WestPat.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Mentoring Programs",
    "Mentors",
    "Principal Preparation Programs"
  ],
  "title": "A Case Study of: The Formal Mentorships of Novice Principals in One School District",
  "type": "Dissertation"
}