{
  "contributor_author": "Munshaw, Gregg C.",
  "contributor_committeechair": "Ervin, Erik H.",
  "contributor_committeecochair": "Parrish, David J.",
  "contributor_committeemember": [
    "Abaye, Azenegashe Ozzie",
    "Askew, Shawn D.",
    "Chevone, Boris I."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2011-08-22T18:53:13Z",
  "date_adate": "2004-02-17",
  "date_available": "2011-08-22T18:53:13Z",
  "date_issued": "2003-07-30",
  "date_rdate": "2005-02-17",
  "date_sdate": "2004-01-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Winter injury of bermudagrass (Cynodon spp.) continues to be a problem across the transition zone.  In an attempt to delay or induce winter dormancy while maintaining cold hardiness, applications of seaweed extract (SWE) (0.54 kg ha-1), ethephon (16 L ha-1), Fe (1 kg ha-1), and N (49 kg ha-1) took place every three weeks during the fall of 2001 and 2002.  Cultivars examined included 'Riviera', 'Midiron', 'Princess', and 'Tifway'.  Tifway exhibited greatest fall color retention in both years of the study.  Ethephon promoted early senescence and turfgrass quality during fall ratings in both years of the study while N, Fe, and SWE increased quality over the control in 2001 and only N showed better quality and color retention over the control in 2002.  Samples removed from cold acclimated plots were artificially frozen as a measure of cold hardiness.  Treatments did not have an effect on post freeze regrowth, however, cultivar was significant in both years.  Midiron showed best regrowth followed by Riviera, Tifway, and Princess.  In both years Riviera and Midiron displayed the quickest and greatest amount of spring greenup followed by Tifway and then Princess.  Ethephon reduced greenup in both years and SWE, Fe, and N showed no differences from the control in 2001 and Fe showed significantly better greenup in 2002.  Proline and Linolenic acid levels were highest in Midiron, followed by Riviera, Tifway, and Princess.  Nitrogen, SWE, and Fe generally did not have an effect on linolenic acid and no consistent effects were noted on proline concentration.  Ethephon treatments did not have an effect on linolenic acid levels, however, there was a negative effect on proline concentrations.  The results of this study indicate that judicial N applications during the fall can promote color retention and do not have a negative effect on bermudagrass cold-tolerance.  Linolenic acid and proline findings also help to explain differences in cold-tolerance between different bermudagrass cultivars.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:13Z (GMT). No. of bitstreams: 4  front.pdf: 66185 bytes, checksum: 29df3951c828bbd59ee183de29849cd6 (MD5)  cover_page_and_abstract.pdf: 58646 bytes, checksum: 447a97fe13511612731f524e0f596d31 (MD5)  bermuda.pdf: 446179 bytes, checksum: 04042994abda680091264b61b86b42bf (MD5)  Vita.pdf: 25271 bytes, checksum: b281ab65624fc594f365f39a404ddff9 (MD5)    Previous issue date: 2003-07-30",
    "Author Email: gmunshaw@vt.edu",
    "Advisor Email: cotton@vt.edu",
    "Advisor Email: dparrish@vt.edu",
    "Advisor Email: ervin@vt.edu",
    "Advisor Email: saskew@vt.edu",
    "Advisor Email: bchevone@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11106",
  "identifier_other": "etd-01162004-171301",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01162004-171301",
  "identifier_uri": "http://hdl.handle.net/10919/11106",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "bermuda.pdf",
    "cover_page_and_abstract.pdf",
    "Vita.pdf",
    "front.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "proline",
    "fatty acids",
    "cold-tolerance",
    "bermudagrass"
  ],
  "title": "Nutritional and PGR effects on lipid unsaturation, osmoregulant content, and relation to bermudagrass cold hardiness.",
  "type": "Dissertation"
}