{
  "contributor_author": "Olgun, Selen",
  "contributor_committeechair": "Misra, Hara P.",
  "contributor_committeecochair": "Ehrich, Marion F.",
  "contributor_committeemember": [
    "Gregory, Eugene M.",
    "Buechner-Maxwell, Virginia A.",
    "Gogal, Robert M. Jr.",
    "Holladay, Steven D."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2011-08-22T18:53:17Z",
  "date_adate": "2004-03-18",
  "date_available": "2011-08-22T18:53:17Z",
  "date_issued": "1998-08-04",
  "date_rdate": "2008-03-18",
  "date_sdate": "2004-02-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The immunotoxic effects of multiple pesticide exposure were evaluated. C57BL/6 mouse thymocytes were exposed to lindane, malathion, and permethrin, either separately or in mixtures of two pesticides, in concentrations ranging from 37.5 uM to 1mM. These exposures caused both apoptotic and necrotic cell death in thymocytes as evaluated by 7-aminoactinomycin-D, Annexin-V/PI, and lactate dehydrogenase release assays. When cells were exposed to lindane+malathion, or lindane+permethrin, a significantly greater-than-additive cytotoxicity was observed. The pesticide exposure caused DNA ladder formation with increased laddering in mixtures. Further, the effect of these pesticides on thymocyte oxidative stress was investigated. Thymocytes treated with any of these pesticides generated superoxide and H2O2. The lindane + malathion caused more-than-additive increase in superoxide production compared to single treatments of these pesticides. However, the effect of the lindane + permethrin was not significantly different from individual components of this mixture. The effects of pesticides on antioxidant enzymes were also investigated and only mixtures were found to have significant effects. Alteration in transcription factor NFkB level was measured as an indicator of oxidative stress in thymocytes following 12 h pesticide exposure, in vitro. Only lindane + malathion was found to increase the protein level. Furthermore, the effects of pesticides and their mixtures on immune functions of mice were studied in vivo. Animals (8-12 week old, male mice) were randomly divided into groups of six and injected intraperitoneally with three different doses (one-half, one-third, one-fourth, or one-eight of LD50) of individual pesticides. Exposure to individual pesticides did not alter the thymus/body or spleen/body weight ratios, thymic or splenic cell counts, or CD4/CD8 or CD45/CD90 ratios. However, anti-sRBC plaque forming cell (PFC) counts were significantly lowered with all treatments. Two other groups of animals were injected with lindane + malathion or lindane + permethrin at one-third of the LD50 of each pesticide. Exposure to pesticide mixtures did not alter the CD4/CD8 or CD45/CD90 ratios. However, the thymus/ and spleen/body weight ratios, thymic and splenic cell counts, and PFC counts were significantly lowered. These data indicate that lindane, malathion, and permethrin are immunotoxic and their mixtures can cause higher toxicity compared to individual exposures. In addition, these data support the hypothesis that oxidative stress were induced in thymocytes by exposure to these pesticides in vitro.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:17Z (GMT). No. of bitstreams: 2  VITA.pdf: 4664 bytes, checksum: 018f16621c6beb5cd48cfd1f45adedfd (MD5)  Olgun-Dissertation.pdf: 3333191 bytes, checksum: 8f72c6ab761e9bf7384828bb891a80d3 (MD5)    Previous issue date: 1998-08-04",
    "Author Email: solgun@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Advisor Email: bmax@vt.edu",
    "Advisor Email: rgogal@vt.edu",
    "Advisor Email: hmisra@vcom.vt.edu",
    "Advisor Email: marion@vt.edu",
    "Advisor Email: holladay@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11114",
  "identifier_other": "etd-02252004-121940",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02252004-121940",
  "identifier_uri": "http://hdl.handle.net/10919/11114",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Olgun-Dissertation.pdf",
    "VITA.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "cytotoxicity",
    "oxidative stress",
    "lindane",
    "malathion",
    "pesticide mixtures",
    "permethrin"
  ],
  "title": "Immunotoxicity of Pesticide Mixtures and the Role of Oxidative Stress",
  "type": "Dissertation"
}