{
  "contributor_author": "Walker, Anitra D.",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Melvin, Joseph",
    "Yakimowski-Srebnick, Mary E.",
    "Parson, Stephen R.",
    "Crockett, Jean B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2011-08-22T18:53:35Z",
  "date_adate": "2004-03-26",
  "date_available": "2011-08-22T18:53:35Z",
  "date_issued": "1997-12-10",
  "date_rdate": "2005-03-26",
  "date_sdate": "2004-03-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "Riley (1998) indicated that our nation창  s neediest communities, those with high rates of poverty and all too often large minority populations, suffer most from shortages of qualified teachers. Schools with these characteristics are often our Title 1 schools. Staffing these schools can be a very difficult task. Haberman (1987) attributed the shortage of qualified urban educators to factors such as racism, fear, a generally negative perception of what teaching in an urban setting is like, and the low percentage (5%) of faculty in schools of education who have urban teaching experience, which affects their ability to prepare teachers for urban settings. With the passage of the No Child Left Behind Act (NCLB), a new federal regulation, this task becomes even more arduous. This act requires that, effective the first day of the 2002-2003 school year, new teachers hired to teach in Title 1 schools be 창  highly qualified창   (U. S. Department of Ed., 2002). This study was designed to determine why teachers choose to remain in the urban setting. The researcher surveyed experienced teachers (minimum of 10 years) in the Norfolk Public Schools District, a large southeastern urban school district, to determine the reasons why teachers stay in this urban district. The sample included all current teachers in this district with a hire date of August 1991 or before. The survey instrument used was designed to gather the following information: (1) why do teachers select urban school districts?, (2) why do teachers remain in this urban school district?, (3) what professional development activities are important in urban districts?, (4) what is the level of commitment of teachers who remain?, and (5) what is the relationship between reasons why teachers remain and their level of teacher commitment?  Distributions of frequencies, mean scores, and standard deviations revealed survey results as they related to (a) gender of teacher, (b) race/ethnicity of teacher, (c) grade level assignment, (d) number of years of teaching experience in an urban district, (e) age of teacher, and (f) education level of teacher. A composite score was calculated for the teacher commitment section of the survey instrument. Also, a correlation matrix was conducted to determine the significance of the relationship between reasons why teachers choose to remain in this district and levels of teacher commitment. Other statistical analyses used were t-tests, ANOVAs, and Tukey post-hoc tests. The results of the study revealed that teachers choose to remain in this urban school district because they feel they have been effective in working with urban children; they have developed good collegial relationships within the district; and they have gained a sense of self satisfaction from working in this district. These reasons and several others were found to have statistical significance in teachers창   levels of commitment. Also, teachers who were female, African-American, middle school teachers, with greater years of experience proved more likely to remain in this urban district.  The findings of this study reveal significant implications to this and other urban school districts. Teachers have to feel some intrinsic motivation to remain in urban districts. Districts should use the results of this study to assist in developing opportunities for teachers to enhance their levels of self-satisfaction and to improve their hiring practices. Attention to these issues will increase teacher retention rates in urban districts. This study provides a foundation for future study in the areas of teacher retention, commitment, teacher certification and retention, and teacher quality.",
  "description_degree": "EDD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:35Z (GMT). No. of bitstreams: 1  Dissertation.pdf: 766891 bytes, checksum: 5bdad725b7ce92274784a1caca8847bc (MD5)    Previous issue date: 1997-12-10",
    "Author Email: awalker1@nps.k12.va.us",
    "Advisor Email: jmelvin@nps.k12.va.us",
    "Advisor Email: parsons@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: yakimowski@aol.com"
  ],
  "format_medium": "ETD",
  "handle": "11119",
  "identifier_other": "etd-03072004-174929",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03072004-174929",
  "identifier_uri": "http://hdl.handle.net/10919/11119",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "teacher retention",
    "teacher commitment",
    "urban education"
  ],
  "title": "A Case Study of Why Teachers Choose to Remain in One Urban School District",
  "type": "Dissertation"
}