{
  "contributor_author": "Staley, Thomas William",
  "contributor_committeechair": "Pitt, Joseph C.",
  "contributor_committeemember": [
    "Burian, Richard M.",
    "Feingold, Mordechai",
    "Fuhrman, Ellsworth R.",
    "La Berge, Ann F."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2011-08-22T18:53:34Z",
  "date_adate": "2004-03-30",
  "date_available": "2011-08-22T18:53:34Z",
  "date_issued": "2003-08-29",
  "date_rdate": "2007-03-30",
  "date_sdate": "2004-03-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This work examines British inquiry into the human mind in the early nineteenth century using a multivalent structural analysis of ideas and practices within traditions established by Hume, Hartley, and Reid. While these traditions were propagated into the nineteenth century by such figures as Thomas Brown, James Mill, Sir William Hamilton, and Alexander Bain, this later period has received a dearth of attention in the history of psychology, the history of philosophy, and the history of ideas in general.  This conspicuous lacuna forms the basis for two simple questions:  What was the situated significance of work on the human mind in nineteenth century Britain?  What was it supposed to accomplish, or be about? In particular, I focus on the differentiation of science from philosophy as a particular kind of non-science, investigating a set of existing formulations of the respective characters of the two.  Using this historiographic survey as a springboard, I establish an analytical apparatus based upon four structural dimensions that I term conceptual, expository, iconic, and genealogical.  Taken together, these four elements form an historical problematic, a set of persistent features and issues that structured work on mental subjects.  With respect to conceptual structure, I propose a set of a dozen persistently central, but fluid, concept clusters involved in the study of mind.  Regarding texts themselves, I situate my subject in terms of specific audience groups, patterns of expository development, and topical scope.  I also examine the limiting influence of authorial and editorial practices on the appearance of the conceptual systems these texts convey.  Iconic structural patterns focus even more closely on textual content, demonstrating shifts in the density, nature, and extent of citation within the intellectual community.  These four dimensions interact significantly, reflecting the complex character of an active community of intellectual discussion. Having established this analytical space, I return to the basic terminological distinction between science and philosophy to investigate what was at stake in distinguishing these two fields in the nineteenth century.  The dichotomy was far from definitive: British mental inquiry from the time of Humeâ  s Treatise to that of Bainâ  s first two major works never established a firm division of science from philosophy, but the evidence suggests several directions of tension along which this split would subsequently emerge.  As demonstrated by evidence from the first volume of the journal, Mind, founded by Bain in 1876, discussions among students of the human mind in the nineteenth century established a position for mental philosophy itself as arbiter of the new science-philosophy dipole.  In this light, the establishment of Mind can be viewed as the creation of a boundary-object that itself constituted this distinction in psychological terms.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:34Z (GMT). No. of bitstreams: 8  TWS.Diss.Title.pdf: 5669 bytes, checksum: 303711250eaca4b536fe32dfb1ff0a99 (MD5)  TWS.Diss.FrontMatter.pdf: 17918 bytes, checksum: 1b553d76988435d2ef36779f09033d72 (MD5)  TWS.Diss.Ch5.pdf: 18586 bytes, checksum: 9371f744248c0a1a9ca5921cb9ad731e (MD5)  TWS.Diss.Ch4.pdf: 108750 bytes, checksum: 4f912db7c18fc2205220349729cc450c (MD5)  TWS.Diss.Ch3.pdf: 394102 bytes, checksum: 55455c90eb2fea47bb9dd7d157c57356 (MD5)  TWS.Diss.Ch2.pdf: 202955 bytes, checksum: 2253dd716103f7ddb7a24920d90eb706 (MD5)  TWS.Diss.Ch1.pdf: 89208 bytes, checksum: 0af60e57cb2633ec0e1bfdb77f91927a (MD5)  TWS.Diss.BackMatter.pdf: 53152 bytes, checksum: 0d38ae3000702a2b7d51b2cedc30c0cc (MD5)    Previous issue date: 2003-08-29",
    "Author Email: tstaley@vt.edu",
    "Advisor Email: rmburian@vt.edu",
    "Advisor Email: feingold@hss.caltech.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Advisor Email: jcpitt@vt.edu",
    "Advisor Email: alaberge@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11118",
  "identifier_other": "etd-03182004-145515",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03182004-145515",
  "identifier_uri": "http://hdl.handle.net/10919/11118",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "TWS.Diss.Ch3.pdf",
    "TWS.Diss.FrontMatter.pdf",
    "TWS.Diss.Ch1.pdf",
    "TWS.Diss.Title.pdf",
    "TWS.Diss.Ch2.pdf",
    "TWS.Diss.Ch5.pdf",
    "TWS.Diss.BackMatter.pdf",
    "TWS.Diss.Ch4.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "History of Philosophy of Mind",
    "History of Psychology",
    "Associationism",
    "Common Sense Philosophy",
    "Alexander Bain",
    "Sir William Hamilton",
    "Thomas Brown",
    "James Mill"
  ],
  "title": "Making Sense in Nineteenth Century Britain: Affinities of the Philosophy of Mind, c.1820-1860",
  "type": "Dissertation"
}