{
  "contributor_author": "Shute, Max",
  "contributor_committeechair": "Rankin, Janet L. Walberg",
  "contributor_committeemember": [
    "Saker, Korinn E.",
    "Houston, Michael E.",
    "Gwazdauskas, Francis C.",
    "Bassaganya-Riera, Josep"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2011-08-22T18:53:16Z",
  "date_adate": "2004-03-17",
  "date_available": "2011-08-22T18:53:16Z",
  "date_issued": "2004-03-04",
  "date_rdate": "2005-03-17",
  "date_sdate": "2004-03-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to evaluate the effectiveness of a whey protein isolate (WPI), a reported glutathione (GSH) booster, on exercise performance, immune function, and antioxidant status during weight maintenance and energy restriction in humans. Twenty well-trained, college age, male cyclists performed a cycling exercise test for 45 min, the first 7 min at 70% of VO2peak and the remaining 38 min at 55% VO2peak immediately followed by a performance test set at 90% VO2peak until exhaustion. Blood samples were collected prior to the exercise test, after 45 min of exercise, within 5 min of exhaustion, and 1 h after exercise. Blood samples were analyzed for GSH, GSH/GSSG ratio, glutathione peroxidase (GPx), lipid hydroperoxides (LPO), phagocytosis, oxidative burst, peripheral blood mononuclear cell (PBMC) proliferation, and PBMC phenotyping. Subjects consumed 40g/day of WPI or casein placebo (P) along with their normal diet for 2 wk, repeated the exercise test, and then began a low energy period continuing the same supplementation for 4 d before the final exercise test. WPI was not associated with superior exercise performance or antioxidant status following exercise or weight loss. WPI supplementation did result in 33% greater lymphocyte proliferation capacity following exercise. Following exhaustive exercise for all trials, tGSH and GPx increased 7% and 11%, respectively, while WBCGSH decreased 13%. For WPI, GPx activity was 10% lower than P following exhaustive exercise for all trials combined. Weight loss (2.67 Â± 0.26 kg) resulted in increases in phagocytosis (65%), white blood cell (WBC) GSH (40%), and GPx (35%) while decreasing the GSH/GSSG ratio (55%) and LPO (16%). Exhaustive exercise caused a 28% increase in CD8+ PBMCs and decreased CD4+ (34%), CD3+ (15%), the CD4+/8+ ratio (45%), and phagocytosis (8%) with all values returning to baseline after 1 h recovery. Supplementation with WPI did not enhance GSH status or exercise performance in trained cyclists, during weight maintenance or energy restriction. Following exercise, WPI is associated with greater lymphocyte proliferation of PBMCs which may help maintain an athleteâ  s health during heavy training or competition.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:16Z (GMT). No. of bitstreams: 1  Dissertation.pdf: 849010 bytes, checksum: 20d8367fa221cf9cef21312a4151befc (MD5)    Previous issue date: 2004-03-04",
    "Author Email: mshute@vt.edu",
    "Advisor Email: jrankin@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11113",
  "identifier_other": "etd-03032004-002411",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03032004-002411",
  "identifier_uri": "http://hdl.handle.net/10919/11113",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Whey Protein Isolate",
    "Antioxidants",
    "Immune Function",
    "Weight Loss"
  ],
  "title": "Effect of Whey Protein Isolate on Oxidative Stress, Exercise Performance, and Immunity",
  "type": "Dissertation"
}