{
  "contributor_author": "Assar, Nandini Narain",
  "contributor_committeechair": "Calasanti, Toni M.",
  "contributor_committeemember": [
    "Wimberley, Dale W.",
    "Bayer, Alan E.",
    "Glenn, E. Nakano",
    "Fuller, Theodore D."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2011-08-22T18:53:17Z",
  "date_adate": "2000-04-30",
  "date_available": "2011-08-22T18:53:17Z",
  "date_issued": "2004-02-05",
  "date_rdate": "2001-04-30",
  "date_sdate": "2000-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Immigration policy and tradition dovetail in their impact on the social organization of immigrant communities, linking the material and non-material aspects of gender.  I focus on Asian Indian Patels, who dominate the budget motel business in the United States.  I conducted semi-structured interviews with Patel men, women, and teenagers.  I stayed overnight in the motels to observe families at work.  I was almost always invited to prepare and share a meal, so I observed families at home.  My analysis is based on transcribed interviews with participants, fieldnotes, observations, community publications, and information from three key contacts.  Most Patels enter the U.S. under family reunification rules in a chain migration.  These rules do not recognize families as labor; therefore a majority of documented immigrants are exempt from labor certification.  Traditions define Patel women as housewives.  The nature of motel work allows women to contribute their labor full-time and still remain housewives: they are not recognized as workers.  Community financing and family labor, both escapes from the market economy, allow for the economic success of Patels.  When families take on subsequent links in the chain migration, they must meet the costs of migration for new immigrants, and maintain traditional gender hierarchy.  When they are the last link in the chain, there is a challenge to this hierarchy.  In the second generation, when they remain in the motel business, Patels maintain traditional gender hierarchy.  When either partner is linked to the labor market, there is a challenge to traditional gender hierarchy.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:17Z (GMT). No. of bitstreams: 2  cv-nandini.pdf: 12431 bytes, checksum: 491a7211a1e870c64fbc4c3934485a5a (MD5)  Patels4.4.3.6.pdf: 445476 bytes, checksum: 979979747e8d0fda9b5f351397ca21f5 (MD5)    Previous issue date: 2004-02-05",
    "Author Email: nassar@vt.edu",
    "Advisor Email: dale.wimberley@vt.edu",
    "Advisor Email: toni@vt.edu",
    "Advisor Email: yogib@vt.edu",
    "Advisor Email: englenn@socrates.berkeley.edu",
    "Advisor Email: ted.fuller@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11115",
  "identifier_other": "etd-04262000-18590048",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262000-18590048",
  "identifier_uri": "http://hdl.handle.net/10919/11115",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "cv-nandini.pdf",
    "Patels4.4.3.6.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Housewife",
    "Work",
    "Indian-American",
    "Immigration Rules",
    "Motels",
    "Hierarchy",
    "Gender",
    "Patidar",
    "Patel",
    "Ethnic Norms"
  ],
  "title": "Gender Hierarchy Among Gujarati Immigrants: Linking Immigration Rules and Ethnic Norns",
  "type": "Dissertation"
}