{
  "contributor_author": "Mehrotra, Meeta",
  "contributor_committeechair": "Calasanti, Toni M.",
  "contributor_committeemember": [
    "Kiecolt, K. Jill",
    "Seitz, Virginia Rinaldo",
    "Ryan, John W.",
    "Parker-Gwin, Rachel",
    "Edwards, John N."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2011-08-22T18:53:17Z",
  "date_adate": "2004-03-22",
  "date_available": "2011-08-22T18:53:17Z",
  "date_issued": "2000-04-12",
  "date_rdate": "2007-03-22",
  "date_sdate": "2004-03-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study uses literature on identity work to examine the gender similarities and differences in the ethnic identity work that Asian Indian immigrants to the United States do.  It also looks at the changes Indian immigrants' understanding of themselves as Indian men/women due to migration.  Interviews with thirty-eight first generation Asian Indian immigrants reveal that while food, clothing, language, and family roles are significant means of expressing ethnic identity, men and women differ in the kind of identity work they perform.  Migration also changes men and women's family and work responsibilities, and thereby their social networks.  This impacts their identity as Indian men and women in the United States.  The study uses these findings to critique the ethnicity paradigm, especially the perspectives of assimilation, which calls for immigrants to adopt the ways of the dominant group, and pluralism, which advocates that immigrants retain their cultural practices and ethnic identities but treats ethnic groups as monoliths.  Both the assimilationist and the pluralist models assume that men and women experience the process of migration and adaptation to the new context in similar ways.  However, adaptation is a process that occurs differently by gender, and gender relations can create obstacles to assimilation.  These models therefore need to be revised to pay greater attention to the varied experiences within groups, based on gender, and other identities such as age and social class.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:17Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 572337 bytes, checksum: adf8062fbcde5dccec234fdfa443dfa9 (MD5)   Previous issue date: 2000-04-12",
    "Author Email: mehrotra@roanoke.edu",
    "Advisor Email: toni@vt.edu",
    "Advisor Email: kiecolt@vt.edu",
    "Advisor Email: johnryan@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11117",
  "identifier_other": "etd-03142004-210752",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03142004-210752",
  "identifier_uri": "http://hdl.handle.net/10919/11117",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "assimilation",
    "Identity work",
    "pluralism"
  ],
  "title": "Triple Outsiders: Gender and Ethnic Identity Among Asian Indian Immigrants",
  "type": "Dissertation"
}