{
  "contributor_author": "Eppard, Randy G.",
  "contributor_committeechair": "Wiswell, Albert K.",
  "contributor_committeemember": [
    "Cline, Marvin Gerald",
    "Boucouvalas, Marcie",
    "Brown, B.",
    "Hardy, Christopher R."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2011-08-22T18:53:16Z",
  "date_adate": "2004-03-11",
  "date_available": "2011-08-22T18:53:16Z",
  "date_issued": "2003-06-11",
  "date_rdate": "2005-03-11",
  "date_sdate": "2004-02-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to test a predictive model of several components of organizational and leadership Culture in a large sample of municipal employees using three sets of predictors: demographic/employment status of employees, measures of employeesâ   judgments of their supervisorâ  s transactional leadership styles, and measures of employeesâ   judgments of their supervisorâ  s transformational leadership style. To what extent does transformational and transactional leadership (both individually and as an interaction) predict Constructive Culture and Defensive Culture? The research utilized two concepts: leadership theory (transformational and transactional leadership) and organizational culture (constructive culture and defensive culture) to analyze the relationship of organizational culture to leadership styles. The research significantly determined how much the relationship of transformational and transactional leadership predicts the criterion variables, constructive culture, and defensive culture, within an organizationâ  s culture.  First, descriptive and correlational analyses were performed to identify the zero order relationships among demographic variables, leadership styles, and organizational culture variables. Demographic variables included gender, age, level of education, race (Caucasian, or African-American), type of employee (supervisor or non-supervisor), and length of employment.   Next, the researcher factor (principal components with an orthogonal varimax rotation) analyzed the interrelationships among the items of each of the two instruments (Multifactor Leadership Questionnaire and the Organizational Culture Inventory Questionnaire). Three separate factor analysis studies were performed for the: (a) 12 OCI scales; (b) twenty transformational leadership items; and (c) 12 transactional leadership items. Factor analysis was used as a means of understanding the underlying structure of the data and determining whether â  local factorsâ   (that is, derived solely on the current sample of data) needed to be used instead of the structure suggested by the authors of the published scales. As reported above, the structure suggested by the test authors was deemed appropriate for the study. Stage 3: Multiple Regressions: Next, to answer the hypotheses, the researcher utilized multiple regression equations. Five significant findings were suggested from this research study: 1.Transformational Leadership factored scores were positively and significantly correlated with Constructive Culture factored scores and therefore Transformational Leadership added significant variance in predicting Constructive Culture. 2.Transactional Leadership factored scores were positively and significantly correlated with Defensive Culture factored scores and therefore Transactional Leadership added significant variance in predicting Defensive Culture. 3.Organizations have subcultures that display the personality of the individual departments or units.  4.The type of work performed or provided influences the type of leadership style. 5.The MLQ instrument was found to be a weak measurement of leadership. Perhaps the most important finding was the weakness of the MLQ instrument. As a result, this research revealed the need to develop an instrument that represent a more reliable and valid measure of Transformational Leadership and Transactional Leadership behaviors. This research suggested that the measures could be improved.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:16Z (GMT). No. of bitstreams: 2  TitlePageAbstactContent.pdf: 51421 bytes, checksum: fe5bdcaf1f0d7114fa21c8f045c29530 (MD5)  DissertationFinalDocument.pdf: 724591 bytes, checksum: 9ee3d33a133adc755228fc627c605f9e (MD5)    Previous issue date: 2003-06-11",
    "Author Email: reppard@jcacdc.org",
    "Advisor Email: awiswell@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11112",
  "identifier_other": "etd-02182004-165946",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02182004-165946",
  "identifier_uri": "http://hdl.handle.net/10919/11112",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "TitlePageAbstactContent.pdf",
    "DissertationFinalDocument.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Connie Eppard",
    "Jim Eppard",
    "Will Eppard",
    "Margo Eppard",
    "Alex Eppard",
    "Bill Halbert"
  ],
  "title": "Transformational and Transactional Leadership Styles as They Predict Constructive Culture and Defensive Culture",
  "type": "Dissertation"
}