{
  "contributor_author": "Keuhl, David",
  "contributor_committeechair": "Randolph, John",
  "contributor_committeemember": [
    "Bohland, James R.",
    "Rich, Richard C.",
    "Stephenson, Max O. Jr.",
    "Ebrahim, Alnoor S."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2011-08-22T18:53:36Z",
  "date_adate": "2001-12-11",
  "date_available": "2011-08-22T18:53:36Z",
  "date_issued": "1998-06-25",
  "date_rdate": "2002-12-11",
  "date_sdate": "2001-12-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The goal of planning is to use knowledge to determine action. Planning theory has focused specifically on how the process of achieving this occurs. Two dominant theories prevail: rational comprehensive and communicative planning theory. The former relies heavily on the scientific method as a model for acquiring knowledge from which the correct action can be determined. The latter suggests that collaborative processes that engage stakeholders in decision-making offer distinct advantages to achieving both knowledge and action through consensus processes. This study looks at how knowledge is developed in collaborative planning processes used in ecosystem management. Knowledge is defined as more than simply data and information. It includes the tacit elements that underlie and give meaning to the data and information. As such, it requires processes that are more communicative in nature. At the same time, ecosystem management practices are rooted in the natural sciences and rely heavily on rational, instrumental reasoning to determine management plans. This combination of rational and communicative approaches provides for an interesting setting in which to understand the interaction of the two and to determine if there are advantages to conceptualizing planning in one way or the other. The study targets the remedial action planning done in the Great Lakes since 1987. Forty-three Areas of Concern were established throughout the basin, and in each, a stakeholder planning committee established. The committee was charged with developing a plan for remediating the water quality of the area. Over the past fourteen years, they have struggled through many circumstances to accomplish this with varying degrees of success. As each utilized slightly different procedural approaches and faced different obstacles, they provide an excellent laboratory for comparison.  The study offers an analysis of the elements of the process and the implications of the different ways of approaching the various steps and stages. The analysis focuses on revealing what needs to be intact prior to collaborating, how information is collected, shared, and utilized, and how decisions are made and formalized in these processes. It focuses specifically on the information itself, communication issues, structural elements, and factors outside the process and how these all work together to enhance or inhibit collaboration. Following a detailed analysis of the process, a model for doing ecosystem management based on knowledge is developed and the basic principles of the model suggested.    Collaboration is often theorized to accomplish far more than simply improved knowledge for decision-making. Some believe it will improve democracy, equality, and accountability. The study concludes with a brief reflection on these possibilities.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:36Z (GMT). No. of bitstreams: 1 collaboration.pdf: 983151 bytes, checksum: 0f3eb0994dcddf4134e82b12a66c4250 (MD5)   Previous issue date: 1998-06-25",
    "Author Email: dckeuhl@bsu.edu",
    "Advisor Email: jayjon@vt.edu",
    "Advisor Email: urban@vt.edu",
    "Advisor Email: mstephen@vt.edu",
    "Advisor Email: aebrahim@vt.edu",
    "Advisor Email: energy@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11126",
  "identifier_other": "etd-12102001-175113",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-12102001-175113",
  "identifier_uri": "http://hdl.handle.net/10919/11126",
  "publisher": "Virginia Tech",
  "relation_haspart": "collaboration.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "ecosystem managment",
    "environmental planning",
    "knowledge"
  ],
  "title": "From Collaboration to Knowledge: Planning for Remedial Action in the Great LAkes",
  "type": "Dissertation"
}