{
  "contributor_author": "Quillen, Mary Addington",
  "contributor_committeechair": "Burton, John K.",
  "contributor_committeecochair": "Lloyd, Gwendolyn M.",
  "contributor_committeemember": [
    "Lockee, Barbara B.",
    "Wilson, Melvin Skip",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2011-08-22T18:53:35Z",
  "date_adate": "2004-03-31",
  "date_available": "2011-08-22T18:53:35Z",
  "date_issued": "1998-08-22",
  "date_rdate": "2005-03-31",
  "date_sdate": "2004-03-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The problem this study addresses is the relationship among the constructs content knowledge, beliefs, and previous experiences of prospective elementary teachers. The 36 participants in the study, 35 females and one male, were recent graduates from a five-year Elementary Education licensure program at a major university located in the Mid-Atlantic region. A correlational research design was used to investigate the relationships that might exist among the three constructs using Praxis I Pre-professional Math test scores, Beliefs Survey scores, and Previous Mathematics Experience Questionnaire [PMEQ] scores. Scores from the Praxis I Pre-professional Math test were self-reported and verified by the Licensure Coordinator in the Center for Teacher Education [CTE]. Scores for the Beliefs Survey and Previous Mathematics Experience Questionnaire [PMEQ] were collected from the survey and questionnaire completed by each participant and the data were analyzed using SPSS software. A frequency distribution was constructed for the Praxis I Math Test scores, the Beliefs Survey scores, and the PMEQ scores. A Pearson correlation was constructed to analyze the relationship among the following variables: Praxis I Math Test, beliefs, and previous mathematics experiences (feelings, teaching tools, and quantity of math courses taken). An alpha level of .05 was used for all statistical tests.  A significant positive correlation was found to exist between Praxis I Math Test scores and feelings about mathematics using a two-tailed test indicating that prospective elementary math teachers who have higher Praxis I math test scores tend to report having more positive feelings about mathematics.  A significant negative correlation was found to exist between beliefs and teaching tools using a two-tailed test. This indicates a tendency by prospective teachers to favor more relational beliefs when their previous experiences included the use of a wide variety of teaching tools. The prospective teachers' responses to the essay question and interview questions support their stated beliefs about the importance of teachers emphasizing relational understanding. On their essay responses, all 36 participants indicated a desire to provide a relational oriented learning-environment in their future classrooms.  The findings in the study support the notion that the prospective teachers in this group with stronger content knowledge tended to report more positive feelings about mathematics. They also tended to favor a relational teaching/learning environment if they had experiences using a wide variety of teaching tools. No significant correlation was found to exist between any of the other variables that were tested.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:35Z (GMT). No. of bitstreams: 1  Quillen_Dissertation.pdf: 346114 bytes, checksum: 0517fb0615678faf1200d0dd2c95ba96 (MD5)    Previous issue date: 1998-08-22",
    "Author Email: mquillen@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: skipw@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: lloyd@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11120",
  "identifier_other": "etd-03252004-144145",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03252004-144145",
  "identifier_uri": "http://hdl.handle.net/10919/11120",
  "publisher": "Virginia Tech",
  "relation_haspart": "Quillen_Dissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "their content knowledge",
    "Prospective elementary teachers' beliefs about mat",
    "previous experiences",
    "and how they might relate to classroom practices"
  ],
  "title": "Relationships Among Prospective Elementary Teachers' Beliefs About Mathematics, Mathematics Content Knowledge, and Previous Mathematics Course Experiences",
  "type": "Dissertation"
}