{
  "contributor_author": "DeBusk, Gerald Kenneth",
  "contributor_committeechair": "Brown, Robert M.",
  "contributor_committeemember": [
    "Killough, Larry N.",
    "Brozovsky, John A.",
    "Stephens, Robert S.",
    "Maher, John J."
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2011-08-22T18:53:39Z",
  "date_adate": "2004-04-12",
  "date_available": "2011-08-22T18:53:39Z",
  "date_issued": "2003-12-17",
  "date_rdate": "2007-04-12",
  "date_sdate": "2004-04-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation provides results of three studies, which examine the utilization of organizational performance measurement systems. Evidence gathered in the first study provides insight into the number of perspectives or components found in the evaluation of an organization's performance and the relative weight placed on those components. The evidence suggests that the number of performance measurement components and their relative composition is situational. Components depend heavily on the strategies selected by the organization. Bottom-line financial measures like return on invested capital and net profit, while perceived as more important than their nonfinancial counterparts, were not part of the extracted components suggesting that they were viewed as outcomes to be achieved by controlling key nonfinancial measures.    The second study examines potential cognitive difficulties inherent in the use of performance measurement systems.  Results suggest that whether performance was better than target, worse than target, or equal to target does not affect the perceived importance of the measures. Results also suggest an emphasis on historical financial measures and a lack of emphasis on more forward-looking nonfinancial measures. In addition, there is evidence of a halo effect in that an organization's performance on financial measures appears to influence an individual's perception of the organization's performance on nonfinancial measures.   The third study uses structural equation modeling and other related procedures to examine the relationships surrounding an executive's use of performance measurement information. Results suggest that a personality characteristic of executives, specifically their intolerance of ambiguity, affects the amount of information perceived to be important in a performance measurement system. The results further suggest that the amount of information perceived to be important affects the evaluation of organizational performance with perceived risk serving as a mediating variable.    Overall, these three studies add to our knowledge of organizational performance measurement system utilization by examining the relative weightings of performance measures, the judgmental effects from utilization of performance measurement systems, and the impact of intolerance of ambiguity on the importance of performance measurement data. In addition, this dissertation examines the link between performance measurement data and the perception of risk in the evaluation of organizational performance.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T18:53:39Z (GMT). No. of bitstreams: 1 DeBuskDissertation2004.pdf: 2619580 bytes, checksum: 04b10a544b4cf62e1a83c421d27e15d3 (MD5)   Previous issue date: 2003-12-17",
    "Author Email: gdebusk@vt.edu",
    "Advisor Email: larry@vt.edu",
    "Advisor Email: jbrozovs@vt.edu",
    "Advisor Email: moren@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Advisor Email: jmaher@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11130",
  "identifier_other": "etd-04082004-155503",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04082004-155503",
  "identifier_uri": "http://hdl.handle.net/10919/11130",
  "publisher": "Virginia Tech",
  "relation_haspart": "DeBuskDissertation2004.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Tolerance for Ambiguity",
    "Balanced Scorecard",
    "Performance Measurement"
  ],
  "title": "An Examination of Organizatinal Performance Measurement System Utilization",
  "type": "Dissertation"
}