{
  "contributor_author": "Gong, Caiguo",
  "contributor_committeechair": "Gibson, Harry W.",
  "contributor_committeemember": [
    "Hanson, Brian E.",
    "Marand, Hervé L.",
    "McGrath, James E.",
    "Tanko, James M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2011-08-22T19:00:01Z",
  "date_adate": "1997-12-01",
  "date_available": "2011-08-22T19:00:01Z",
  "date_issued": "1999-07-28",
  "date_rdate": "1998-12-01",
  "date_sdate": "1997-11-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As new family of composite materials, polyrotaxanes, polymers containing rotaxane units, have interested scientists world wide in last few decades because of their new properties.  Crown ethers have been widely used as the cyclic component in various polyrotaxanes.  However, due to significant loss of threaded cyclic during polymerization, the driving force for threading remains unidentified. To prevent threaded cyclics from slipping off the backbone during polycondensation, a diol blocking group (BG) and a diacid chloride BG were prepared and incorporated into polyesters as monomers or comonomers.  Using these BG's effectively reduced or prevented dethreading and thus indeed increased threading efficiency (m/n, average number of cyclics per repeat unit).  The study also brought about new evidences for the formation of the polyrotaxanes, i.e., the hydrolytic recovery of threaded crown ether, different chemical shift of the threaded cyclic from the free species and nuclear Overhauser effect spectroscopy (NOESY) correlation.  The threading efficiencies increased with lower polymerization temperature and increasing feed ratio of the cyclic vs. diol monomer.  H-bonding between the crown ether and the OH groups of the diol monomers was identified as the driving force for threading and detailed threading and dethreading mechanisms were revealed. Co-polyurethane rotaxanes were also prepared by polymerization of diol BG, tetra(ethylene glycol) and 4,4'-methylenebis(p-phenyl isocyanate) (MDI) using 30C10 as solvent.  Compared to that with the polyester backbone, dethreading was slower with the polyurethane because of H-bonding of the threaded cyclics with the in-chain NH groups.  Interestingly, as proved by proton NMR spectra, the cyclics were locked at the NH sites in chloroform but pushed away from the site in DMSO.  Thus these polyurethane rotaxanes were solvent switchable molecular shuttles with controlled microstructures.  Based on H-bonding theory, a new method for the preparation of polyrotaxanes, a melt threading process, was demonstrated by threading \"42C14\" onto a preformed polyurethanes.  The properties of the resulting polyurethane rotaxanes depended on threading efficiency (m/n): the higher m/n was, the lower the Tg was but the higher the intrinsic viscosity was. Novel topological polymers, mechanically-linked branched and crosslinked poly(methyl methacrylate)s were synthesized by pendant group modification of a preformed poly(methacryloyl chloride) with 5-hydroxymethyl-1,3-phenylene-1,3-phenylene-32-crown-10 (hydroxymethyl BMP32C10).  The rotaxane structure was directly proved by NOESY.  The polycondensation of di(hydroxymethyl)-BMP32C10, tetra(ethylene glycol) and MDI afforded similar mechanically-linked polyurethanes.  The branching points were manifested by the complexation of the polyurethane with paraquat.  The polydispersities (PDI) and topologies (linear, branched and crosslinked) of these polymers were simply controlled by the polymerization conditions; this will ultimately afford polymers with different processibility (melt viscosity) and mechanical properties, e.g., the slippage of the cyclics along the backbone ensures a higher elongation. The complexation between a preformed polymeric crown ether and paraquat afforded a novel class of main chain polyrotaxanes.  The continuous titration method afforded accurate estimates of the equilibrium constant, enthalpy and entropy changes and thus polyrotaxanes with certain m/n can be simply designed.  Compared to the starting polymers, polyrotaxanes had higher viscosity, higher glass transition temperature and different solubilities.  A concept for the preparation of reversible branched and/or crosslinked homo- or co-polymers was invented, which was demonstrated by preparation of a reversibly branched polymer by self-assembly of a preformed polymeric crown ether and a polyurethane bearing paraquat moieties.  This concept can be applied to increase the compatibility and the interfacial interaction for polymer blends and construct reversible networks. The present work is supported by the Division of Materials Research, National Science Foundation, through individual investigator grant DMR-93-20196.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:01Z (GMT). No. of bitstreams: 4  front_matters.PDF: 51517 bytes, checksum: 91c0a61b436c5dc45dd051b1fd9f42b6 (MD5)  ch8-10_vita.PDF: 923206 bytes, checksum: 2a9b1ddb52ab1e8350e3f34e979c0b84 (MD5)  ch5-7.PDF: 969701 bytes, checksum: 9dba53a4eff5c28978512b060b9179af (MD5)  ch1-4.PDF: 1076098 bytes, checksum: 880ecf82927764c6df85b24373c238c8 (MD5)    Previous issue date: 1999-07-28",
    "Author Email: cgong@vt.edu",
    "Advisor Email: hwgibson@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11134",
  "identifier_other": "etd-11197-54645",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11197-54645",
  "identifier_uri": "http://hdl.handle.net/10919/11134",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "front_matters.PDF",
    "ch1-4.PDF",
    "ch5-7.PDF",
    "ch8-10_vita.PDF"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Polyurethane",
    "Polyester",
    "Polymethacrylate",
    "Polyrotaxane"
  ],
  "title": "Linear, Branched and Crosslinked Polymers, Polyesters, Polyurethanes and Polymethacrylates Derived From Rotaxane Formation:   Syntheses and Properties",
  "type": "Dissertation"
}