{
  "contributor_author": "Skinner, Ned Thomas",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Lepczyk, Billie F.",
    "Eschenmann, Konrad Kurt",
    "Redican, Kerry J.",
    "Johnson, Jack B."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2011-08-22T19:00:01Z",
  "date_adate": "2004-04-21",
  "date_available": "2011-08-22T19:00:01Z",
  "date_issued": "2000-02-10",
  "date_rdate": "2004-04-21",
  "date_sdate": "2004-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The transition from high school to college can be a difficult and stressful experience for a student-athlete.  University athletic departments across the country, in conjunction with the office of student life, implement transition programs in an attempt to assist freshmen with their new environment.  The purpose of this study was to determine a head coach's role in the transition process between high school and college of a freshman student-athlete.  Furthermore, the study sought to address to what extent a student-athlete could benefit from evaluating the effectiveness of the transition process.   Fifteen participants from a large NCAA Division I swim program took part in this study in the fall of 2003.  Each participant was officially recruited to attend the institution and was entering college for the first time.  A two phase approach was utilized to obtain data on the swimmers' first three weeks in college and also their first semester in college.   Each swimmer was interviewed after his or her first three weeks in school in a semi-structured environment.  Each participant was asked the same series of questions.  Each participant was also interviewed near the conclusion of his or her first semester and was asked a series of follow up questions.  The data was analyzed utilizing qualitative methods.   The results of the study indicated that a head coach has a critical role in assisting freshmen student-athletes in their program with the transition from high school to college.  Student-athletes look to their head coach as a mentor who can affect the new environment, and thus the head coach is a significant factor in their transition experience.  Further, a head coach should know the components of the transition programs offered by both the university and athletic department, and develop his or her own transition model to increase the chances of a well adjusted freshman student-athlete.   The results of the study also indicated that a student-athlete can benefit from evaluating the effectiveness of a transition program annually.  Universities, athletic departments, and coaches should make needed changes each year to address the specific needs of freshmen student-athletes entering college for the first time.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:01Z (GMT). No. of bitstreams: 1  Disseration.pdf: 243352 bytes, checksum: 115c8f0e06fa0fcc3e0935cf7a45133b (MD5)    Previous issue date: 2000-02-10",
    "Author Email: nskinner@vt.edu",
    "Advisor Email: rstratto@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11136",
  "identifier_other": "etd-04202004-163316",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202004-163316",
  "identifier_uri": "http://hdl.handle.net/10919/11136",
  "publisher": "Virginia Tech",
  "relation_haspart": "Disseration.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "student-athletes",
    "freshmen",
    "Transitions"
  ],
  "title": "A Case Study of Freshmen Swimmers' College Transition Experiences",
  "type": "Dissertation"
}