{
  "contributor_author": "Maza Duerto, Aristides",
  "contributor_committeechair": "Creamer, Donald G.",
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "Hirt, Joan B.",
    "Janosik, Steven M.",
    "Dika, Sandra L."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2011-08-22T19:00:19Z",
  "date_adate": "2004-04-21",
  "date_available": "2011-08-22T19:00:19Z",
  "date_issued": "2000-11-03",
  "date_rdate": "2004-04-21",
  "date_sdate": "2004-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study had three main purposes: (a) to determine whether there is a linear relationship between international undergraduate (IU) students' adaptation and time at Virginia Polytechnic Institute and State University (Virginia Tech), (b) to examine the effects of IU students' combined economic and linguistic backgrounds on their adaptation experience at Virginia Tech, (c) to determine the u-shaped curve model's effectiveness in explaining the adaptation experience of IU students from different backgrounds.  The findings of this study could not be used to justify either a linear or a curvilinear relationship between time and IU students' adaptation. A difference in adaptation was found between IU students with two and four years at Virginia Tech based on their linguistic background differences, but no differences were found in regard to their economic background differences. A correlation analysis suggested a relationship between adaptation and the support IU students received while at Virginia Tech. Nevertheless, the most important finding is the fact that the existing models of IU students' adaptation do not adequately explain their adaptation experience. This study suggests that future research should concentrate on determining the relationship between IU students' adaptation and the adequacy of support they received.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:19Z (GMT). No. of bitstreams: 1  Final-Dissertation-EDT.pdf: 727825 bytes, checksum: a7bff89d8e7a8002374a66a398ff7d89 (MD5)    Previous issue date: 2000-11-03",
    "Author Email: aduerto@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: sdika@uprm.edu"
  ],
  "format_medium": "ETD",
  "handle": "11138",
  "identifier_other": "etd-04192004-135531",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192004-135531",
  "identifier_uri": "http://hdl.handle.net/10919/11138",
  "publisher": "Virginia Tech",
  "relation_haspart": "Final-Dissertation-EDT.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "International Undergraduate Students",
    "Ajudment Experience",
    "Support",
    "College",
    "U-Shape Curve Model",
    "Adaptation"
  ],
  "title": "Effects of Combined Economic and Linguistic Backgrounds on the Adjustment Process of International Undergraduate Students at Virginia Polytechnic Institute and State University",
  "type": "Dissertation"
}