{
  "contributor_author": "Phipps, Brandy Ellen",
  "contributor_committeechair": "Saker, Korinn E.",
  "contributor_committeemember": [
    "Huckle, William R.",
    "Plaut, Karen I.",
    "Herbein, Joseph H. Jr.",
    "Robertson, John L."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2011-08-22T19:00:18Z",
  "date_adate": "2004-04-21",
  "date_available": "2011-08-22T19:00:18Z",
  "date_issued": "2004-04-08",
  "date_rdate": "2004-04-21",
  "date_sdate": "2004-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Mammary cancer is one of the leading causes of death in both the human and companion animal population.  There are many histological and pathophysiological similarities between human and feline mammary cancer, therefore investigating the molecular pathways of disease progression in one species may provide useful information for both.  The EGFR/MAPK signal transduction pathway is upregulated in many human breast tumors, and both EGFR and MAPK have been implicated as independent prognostic indicators for decreased survival times in human breast cancer patients.  We report here that active MAPK levels can be detected in both peripheral white blood cells (WBC) and mammary adipose tissue in cats.  Adipose tissue levels of active MAPK were similar to those observed in peripheral WBC, suggesting that WBC MAPK might serve as a useful biomarker in the diagnosis or follow-up treatment of disease.  PUFA have been reported to influence breast cancer risk in humans, and may modulate the EGFR/MAPK pathway through a variety of mechanisms.  Dietary PUFA n-6-to-n-3 ratio in cats was reflected in mammary adipose tissue and resulted in altered active MAPK levels in both adipose tissue and peripheral white blood cells, suggesting that PUFA may have similar effects on the feline and human MAPK pathway.  In human breast tumor cell line studies, rather than having opposing effects, as was hypothesized, it was demonstrated that n-6 and n-3 PUFA exerted similar effects on EGFR+ breast tumor cell proliferation and activity of the EGFR/MAPK pathway.     Slightly more than twice the concentration of n-3 PUFA was needed to elicit the same response as n-6 in cells.  These results indicate n-6 and n-3 PUFA can modulate proliferation of EGFR+ tumor cells similarly and may be exerting their effects, in part, through the EGFR/MAPK pathway.  Decreasing total PUFA intake, while increasing the n-3-to-n-6 PUFA ratio, may be practical as preventative or adjuvant therapy for breast cancer.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:18Z (GMT). No. of bitstreams: 1 bep_FINAL_dissertation_Nolines.pdf: 662292 bytes, checksum: a4543b22b7613a3a31857832a26f88a3 (MD5)   Previous issue date: 2004-04-08",
    "Author Email: bphipps@cedarville.edu",
    "Advisor Email: kesaker@vt.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: kplaut@uvm.edu",
    "Advisor Email: herbeinj@vt.edu",
    "Advisor Email: drbob@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11137",
  "identifier_other": "etd-04132004-144716",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132004-144716",
  "identifier_uri": "http://hdl.handle.net/10919/11137",
  "publisher": "Virginia Tech",
  "relation_haspart": "bep_FINAL_dissertation_Nolines.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Breast Cancer",
    "PUFA",
    "Linoleic",
    "Docosahexanoic",
    "EGFR",
    "MAPK",
    "Mammary"
  ],
  "title": "Polyunsaturated Fatty Acids and the Epidermal Growth Factor Receptor/ Mitogen- Activated Protein Kinase Signal Transduction Cascade in Mammary Cancer",
  "type": "Dissertation"
}