{
  "contributor_author": "Goodwin, Paul Joshua",
  "contributor_committeechair": "Dean, Dennis R.",
  "contributor_committeemember": [
    "Claus, G. William",
    "Newton, William E.",
    "Bevan, David R.",
    "Chen, Jiann-Shin"
  ],
  "contributor_department": "Biochemistry and Anaerobic Microbiology",
  "date_accessioned": "2011-08-22T19:00:01Z",
  "date_adate": "1999-05-28",
  "date_available": "2011-08-22T19:00:01Z",
  "date_issued": "1999-10-25",
  "date_rdate": "2000-05-28",
  "date_sdate": "1999-05-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The iron-molybdenum cofactor (FeMo-cofactor) of nitrogenase is the subject of one the most intensive biochemical/genetic detective cases of modern science.  At the active site of nitrogenase, the FeMo-cofactor not only represents the heart of biological nitrogen fixation, but its synthesis also serves as a model for complex metallocluster biosynthesis.  Research in the Dean Lab is focused on furthering the understanding of Fe-S cluster biosynthesis in the nitrogenase enzyme system.   Throughout the years, scientists from a broad range of disciplines have focused their intellectual might on deciphering not only the chemistry of the FeMo-cofactor, but also the biosynthesis of this unique metallocluster.  Recent advances in the study of FeMo-cofactor biosynthesis have produced considerable insight regarding the complex series of biological reactions necessary for the synthesis of this metallocluster.  The work contained within this dissertation represents my efforts to further the understanding of FeMo-cofactor biosynthesis.   The concept of a molecular scaffold in FeMo-cofactor biosynthesis is generally accepted in the field of nitrogenase.  Previous work has implicated the products of nifE and nifN as providing the assembly site for FeMo-cofactor synthesis.  Researchers were able to purify this molecular scaffold, commonly referred to as the NifEN complex, however, detailed characterization was precluded by the inability to obtain sufficient quantities of NifEN.  In an effort to fully characterize the NifEN complex, we initiated a gene fusion approach for the high level production NifEN.  In addition to gene fusion, a poly-histidine tag was incorporated into NifEN, allowing purification through the application of immobilized metal-affinity chromatography (IMAC).  NifEN obtained in this way was characterized using a variety of biophysical techniques and found to contain two [4Fe-4S] clusters in each NifEN tetramer.  These clusters were also shown to be completely ligated by cysteine residues.  With the information obtained from this study, it is concluded that the [4Fe-4S] clusters of the NifEN complex are likely to play either a structural or a redox role rather than being transferred and becoming incorporated into the FeMo-cofactor.   In addition to the biophysical characterization of the NifEN complex, a separate study was started to characterize the apo-MoFe protein.  In this study we used IMAC to purify a poly-histidine-tagged apo-MoFe protein produced by a nifB-deletion mutant of A. vinelandii.  Using the poly-histidine fusion approach, apo-MoFe protein was obtained in sufficient quantities for detailed catalytic, kinetic and spectroscopic analyses.  This multidisciplinary approach confirmed that apo-MoFe protein contained intact P clusters and P cluster environments, as well as the ability to interact with the Fe protein.  It was also shown for the first time that this tetrameric form of purified apo-MoFe protein could be activated by the addition of preformed FeMo-cofactor.     The NifEN complex was further characterized to investigate the presence of bound FeMo-cofactor intermediates.  NifEN purified by IMAC is produced in the absence of the nitrogenase structural genes (nifHDK).  In this genetic background, it is believed that the FeMo-cofactor biosynthetic machinery will become obstructed with unprocessed FeMo-cofactor intermediates, such as the Fe-S precursors of FeMo-cofactor, NifB-cofactor.  Previous work indicated that NifEN can exist in either a charged or discharged form, based on the presence or absence of the FeMo-cofactor precursor, NifB-cofactor.  EPR and VTMCD spectroscopies showed the presence of a new paramagnetic signal associated with NifEN that is believed to be in the charged or precursor bound state.  This represents the first spectroscopic evidence for a precursor to the FeMo-cofactor.  Furthermore, an interaction of NifEN and NifX was examined by size exclusion chromatography.  From this study, NifX exhibited the capacity to bind a chromophore, presumably an FeMo-cofactor precursor, from the NifEN complex.  NifX was also capable of binding to isolated FeMo-cofactor and the FeMo-cofactor precursor, NifB-cofactor. Finally, preliminary investigations involving interaction between the Fe protein and NifEN were initiated.  Recent findings indicate that NifEN and the Fe protein have the capacity to interact specifically with one another.  The interaction of NifEN and Fe protein appears to be dependent on the association of FeMo-cofactor precursor with NifEN.  The NifEN complex also has the capacity to accept electrons from the Fe protein in a MgATP dependent manner.  The ability of NifEN to accept electrons from the Fe protein may be involved in the role of Fe protein in FeMo-cofactor biosynthesis.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:01Z (GMT). No. of bitstreams: 1  PAULGOODWINETD.PDF: 986923 bytes, checksum: d2c8a99b56739571e49423fab7fb1eab (MD5)    Previous issue date: 1999-10-25",
    "Author Email: pjg18@vt.edu",
    "Advisor Email: clausgw@vt.edu",
    "Advisor Email: wenewton@vt.edu",
    "Advisor Email: drbevan@vt.edu",
    "Advisor Email: chenjs@vt.edu",
    "Advisor Email: deandr@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11135",
  "identifier_other": "etd-052599-144040",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-052599-144040",
  "identifier_uri": "http://hdl.handle.net/10919/11135",
  "publisher": "Virginia Tech",
  "relation_haspart": "PAULGOODWINETD.PDF",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "NifEN complex",
    "biosynthesis",
    "FeMo-cofactor",
    "nitrogenase"
  ],
  "title": "Biosynthesis of the Nitrogenase FeMo-cofactor from Azotobacter vinelandii:  Involvement of the NifEN complex, NifX and the Fe protein",
  "type": "Dissertation"
}