{
  "contributor_author": "Foster, Paul Stephen",
  "contributor_committeechair": "Harrison, David W.",
  "contributor_committeemember": [
    "Eisler, Richard M.",
    "Friedman, Bruce H.",
    "Crawford, Helen J.",
    "Clum, George A. Jr."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2011-08-22T19:00:21Z",
  "date_adate": "2004-04-27",
  "date_available": "2011-08-22T19:00:21Z",
  "date_issued": "2004-04-21",
  "date_rdate": "2004-04-27",
  "date_sdate": "2004-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Research has indicated that the frontal and temporal lobes are involved in the mediation of heart rate and blood pressure.  However, whereas these regions of the brain have been identified in the mediation of heart rate and blood pressure, the specific cerebral processes involved in determining the direction and magnitude of change in heart rate and blood pressure has not been adequately addressed.  The present paper proposes that changes in the magnitude of cerebral activation between the left and right frontal and temporal lobes is partly that which determines the direction and magnitude of changes in heart rate and blood pressure.  The present investigation sought to test part of this proposition, namely, that increasing magnitude of cerebral activity within the right anterior temporal region generates increasing levels of sympathetic control of heart rate and blood pressure and that the right lateral frontal region acts to inhibit sympathetic activity.  A total of 45 right handed men, with no history of significant head injury, were exposed to 55 dB, 75 dB, and 90 dB white noise presentations.  Right frontal lobe functioning was assessed by performance on the Ruff Figural Fluency Test (RFFT), with the participants scoring in the lower one-third classified as Low Fluency.  Those scoring in the upper one-third were classified as High Fluency.  Quantitative electroencephalography, measured at 19 electrodes sites arranged according to the International 10/20 System, as well as heart rate and blood pressure responses to white noise presentation were measured.  Although the results failed to support any of the hypotheses concerning the effects of varying intensity of white noise on   cardiovascular activity, partial support was found for the hypotheses that varying intensity of white noise would generate differential changes in high beta magnitude between the Low and High Fluency groups.  The results are discussed in terms of support for the model being tested.  Alternative explanations of the findings are also provided that demonstrate correspondence between the QEEG and cardiovascular data.  Finally, limitations of the model and the methods of the present investigation are discussed and suggestions for improvement are provided.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:21Z (GMT). No. of bitstreams: 1 DissCompletePDF.pdf: 906210 bytes, checksum: a799bad8412a91a51eca76662593a7a8 (MD5)   Previous issue date: 2004-04-21",
    "Author Email: pfoster@vt.edu",
    "Advisor Email: eilser@adelphia.net",
    "Advisor Email: bhfriedm@vt.edu",
    "Advisor Email: hjc@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: dwh@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11146",
  "identifier_other": "etd-04252004-223240",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252004-223240",
  "identifier_uri": "http://hdl.handle.net/10919/11146",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissCompletePDF.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Parasympathetic Nervous System",
    "Heart Rate",
    "Blood Pressure",
    "Sympathetic Nervous System",
    "Autonomic Nervous System",
    "EEG",
    "Quantitative Electroencephalography",
    "Cerebral Laterality"
  ],
  "title": "Graded Cerebral Activation to Noise: Behavioral and Cardiovascular Effects",
  "type": "Dissertation"
}