{
  "contributor_author": "Papero, Anna L.",
  "contributor_committeecochair": [
    "Bell, Martha Ann",
    "Stremmel, Andrew J."
  ],
  "contributor_committeemember": [
    "Sawyers, Janet K.",
    "Benson, Mark J.",
    "McWey, Lenore M."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2011-08-22T19:00:20Z",
  "date_adate": "2004-04-23",
  "date_available": "2011-08-22T19:00:20Z",
  "date_issued": "2004-03-22",
  "date_rdate": "2007-04-23",
  "date_sdate": "2004-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study tested a mediated-moderator model that was developed to explore whether age of entry into a Head Start Program moderated the relationship between maternal depressive symptomology and child cognitive and social outcome.  In addition, the mediating role of maternal social support was examined.    The study sample included 43 low-income mothers and their pre-school aged children who were enrolled in a large Head Start program in Southwest Virginia.  Maternal depressive symptomology was measured using the CES-D and perceived social support was measured using the Perceived Social Support Scale (PSS).  Child cognitive data included scores on two working memory tasks and the PPVT.  Child social outcomes were assessed using the Social Skills Scale and the Classroom Conduct Scale developed for use with Head Start Populations.  Results of the study did not support a moderating role for age of entry to Head Start.  Level of maternal education was found to predict both child working memory skill and receptive language ability, and high levels of maternal depressive symptomology were found to predict child social skills. In addition, exploratory analyses were conducted to examine gender differences in the relations between variables when girls and boys were analyzed separately.  A significant interaction effect was found for gender and maternal education in predicting preschool receptive language ability.  Preliminary data suggests that boys may be more highly impacted by maternal factors than are girls.  Policy implications and directions for future research are discussed.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:20Z (GMT). No. of bitstreams: 5  title.pdf: 36105 bytes, checksum: 5618c13753024c704d4ded3e225f9c38 (MD5)  dissertation.pdf: 729892 bytes, checksum: 9c90e0a199b324a89f85c405276be0b7 (MD5)  AppendixesDEFGHIJKLM.pdf: 152267 bytes, checksum: 07ecb9c9660ecbd46524625553b8652e (MD5)  AppendixC.pdf: 33270 bytes, checksum: 1794bf4ae7b5de756939fae7e108b277 (MD5)  AppendixB.pdf: 108717 bytes, checksum: e154f91f46b99b8512fbc809d8c45cab (MD5)    Previous issue date: 2004-03-22",
    "Author Email: papero@vt.edu",
    "Advisor Email: sawyers@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: astremme@vt.edu",
    "Advisor Email: mbenson@vt.edu",
    "Advisor Email: lmcwey@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11143",
  "identifier_other": "etd-04202004-115746",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202004-115746",
  "identifier_uri": "http://hdl.handle.net/10919/11143",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "dissertation.pdf",
    "AppendixB.pdf",
    "AppendixC.pdf",
    "AppendixesDEFGHIJKLM.pdf",
    "title.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "social development",
    "cognitive development",
    "poverty",
    "early intervention",
    "maternal depression"
  ],
  "title": "Developmental outcome in preschoolers:  Interrelations among maternal depression, perceived social support, and child's age of entry into Head Start",
  "type": "Dissertation"
}