{
  "contributor_author": "Poff-Reichow, Sherry Ann",
  "contributor_committeechair": "Boyle, Stephen M.",
  "contributor_committeemember": [
    "Popham, David L.",
    "Purswell, Beverly J.",
    "Schurig, Gerhardt G.",
    "Sriranganathan, Nammalwar"
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2011-08-22T19:00:20Z",
  "date_adate": "2004-04-26",
  "date_available": "2011-08-22T19:00:20Z",
  "date_issued": "1999-01-14",
  "date_rdate": "2004-04-26",
  "date_sdate": "2004-04-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Bacillus anthracis is a facultative extracellular bacterial pathogen that causes cutaneous, gastrointestinal or respiratory disease in many vertebrates, including humans.  Commercially available anthrax vaccines for immunization of humans are known to provide protection of limited duration and may not protect against the respiratory form of the disease.  Commercially available live vaccines for animals have been shown to cause disease in certain species.  Brucella abortus is a facultative intracellular bacterium that causes chronic infection in animals and humans.  As with other intracellular pathogens, cell mediated immune responses (CMI) are crucial in affording protection against brucellosis.  B. abortus strain RB51 has been shown to be useful in eliciting protective CMI and antibody responses against Brucella in cattle and other animal species.  Since the protective antigen (PA) of B. anthracis is known to induce antibodies, the pag gene encoding PA was expressed in B. abortus RB51, producing a dual vaccine to protect against both brucellosis and anthrax.  In a previous study, the entire pag gene was expressed in strain RB51 and following immunization the vaccine induced antibodies against PA in A/J mice.  However, PA stability and protective efficacy were less than desirable as only 1/6 were protected.  The studies in this dissertation involved synthesizing a gene corresponding to domain 4 (PA4) of the pag gene utilizing the native codon usage of Brucella.  The PA4 domain was fused to Brucella signal sequences of Brucella 18kDa protein, superoxide dismutase or no signal sequence to localize the PA4 to the outside cell envelope, periplasmic space or cytosol respectively.  Comparisons of the expression level and stability of the native and synthetic PA4 in B. abortus strain RB51 were assessed by immunoblot.  The protective efficacy of PA4 expressed in Brucella was assessed by immunization and protection studies in A/J mice against a live challenge with either B. abortus or B. anthracis Sterne spores.  ELISA and western blot indicate the induction of PA specific antibodies by these recombinant strain RB51 vaccine constructs.  Results based on subisotype antibody ELISA (IgG, IgG1, IgG2a and IgM) and CMI assays (cytokine ELISA of IL-4 and INF-g, and LPA) suggest a Th1 based immune response to strain RB51 and PA.  B. abortus strain RB51 expressing PA4 fused to the signal sequence of Brucella 18kDa protein was able to induce 50% protection, while strain RB51 expressing PA4 with no signal sequence gave 17% protection against B. anthracis Stern spore challenge.  Mice were boosted with an intraperitoneal injection of purified PA after an initial immunization with Brucella vaccine candidates, sterile saline or pure PA.  Protection assessed by live challenge with B. anthracis Sterne spores increased following boosting with PA in 4 cases.  Immunization with purified PA, and 3 strain RB51/PA vaccines and a PA boost gave protection against a spore challenge ranging from partial to full.  This study suggests that additional work is needed to define the antigens of B. anthracis involved in the induction of specific CMI.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:20Z (GMT). No. of bitstreams: 3  titlepage.pdf: 78225 bytes, checksum: 4471a8a8223482db3634559a5083b5f1 (MD5)  TableofContents1.pdf: 125469 bytes, checksum: 6284a832186b768ead5c0a0a0a9d5afa (MD5)  1PoffDissertation2.pdf: 2354516 bytes, checksum: cd3e69737ebe57a78dbe594b4480acb7 (MD5)    Previous issue date: 1999-01-14",
    "Author Email: shpoff@vt.edu",
    "Advisor Email: dpopham@vt.edu",
    "Advisor Email: purswell@vt.edu",
    "Advisor Email: gschurig@vt.edu",
    "Advisor Email: nathans@vt.edu",
    "Advisor Email: smboyle@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11144",
  "identifier_other": "etd-04062004-173902",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04062004-173902",
  "identifier_uri": "http://hdl.handle.net/10919/11144",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "1PoffDissertation2.pdf",
    "TableofContents1.pdf",
    "titlepage.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "immunity",
    "vaccine",
    "Bacillus anthracis",
    "Brucella"
  ],
  "title": "Development of Brucella abortus RB51 as a Vaccine to Protect Against Brucellosis and Anthrax",
  "type": "Dissertation"
}