{
  "contributor_author": "Morozov, Ivan Vladimirovitch",
  "contributor_committeechair": "Hagood, Edward Scott Jr.",
  "contributor_committeemember": [
    "Hipkins, Perry Lloyd",
    "Brann, Daniel E.",
    "Wilson, Henry P.",
    "Nessler, Craig L."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2011-08-22T19:00:56Z",
  "date_adate": "2004-04-30",
  "date_available": "2011-08-22T19:00:56Z",
  "date_issued": "2004-03-29",
  "date_rdate": "2007-04-30",
  "date_sdate": "2004-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Italian ryegrass (Lolium multiflorum Lam.) is a competitive weed in small grain production areas throughout the northwestern and southeastern US.  In small grains, Italian ryegrass has generally been controlled with postemergence treatments of diclofop, or diclofop-methyl, a member of the subfamily of the aromatic carboxylic acid family, the aryloxyphenoxypropionates. The first incidence of diclofop resistance in Italian ryegrass was reported in Virginia in 1995.  Experiments to characterize diclofop resistance in several Virginia biotypes of Italian ryegrass included the following objectives: (1) evaluation of the presence of diclofop resistance in several Italian ryegrass biotypes collected across Virginia, (2) evaluation of alternative herbicide efficacy for diclofop resistant Italian ryegrass control, and (3) characterization of the aryloxyphenoxypropionate (APP) resistance mechanism in resistant Italian ryegrass biotypes. The response of 32 biotypes to diclofop collected from various locations statewide with varying histories of diclofop applications confirmed diclofop resistance in Virginian Italian ryegrass populations.  At 4-times the label-recommended application rate, only 50% of biotypes previously exposed to diclofop in a cropping situation were adequately controlled versus 94% of the biotypes not previously treated with diclofop.  Tralkoxydim provided the most effective control of four of the biotypes.  No postemergence treatment effectively controlled one biotype previously exposed to diclofop applications.  Effective preemergence herbicide treatments for Italian ryegrass control in the greenhouse included acetochlor (two formulations) and flufenacet plus metribuzin.  In the field, flufenacet plus metribuzin resulted in excellent Italian ryegrass control, little crop injury, and acceptable barley yields. Acetyl-coenzyme A carboxylase (ACCase) assays and herbicide absorption, translocation, and metabolism studies were conducted to investigate resistant mechanism(s) to two APP herbicides, diclofop and quizalofop.  ACCase assays indicated no differences in enzyme activity between the two biotypes of Italian ryegrass evaluated.  Furthermore, no significant differences in the specific activity of ACCase were detected between the two biotypes in the absence of diclofop.  [14C]Quizalofop-P absorption, translocation, and metabolism did not differ between resistant and susceptible Italian ryegrass biotypes.  Lack of a significant biotype effect suggests that differential metabolism does not explain the differential response to diclofop treatments observed in the herbicide dose-plant response experiment.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:56Z (GMT). No. of bitstreams: 8 part8_Vita.pdf: 274145 bytes, checksum: e691ba124164921ce5e21982a7c668da (MD5) part7_Chapter_5.pdf: 247274 bytes, checksum: 50eae28a66d81468d49a80b59bacefd8 (MD5) part6_Chapter_4.pdf: 354209 bytes, checksum: 7493bf713304ac92aba849ea4ad85cf7 (MD5) part5_Chapter_3.pdf: 417267 bytes, checksum: 730ce6d39c48847db6db26e3722e4b74 (MD5) part4_Chapter_2.pdf: 346067 bytes, checksum: 9a8c19347d8825b560be5886bff1db12 (MD5) part3_Chapter_1.pdf: 367109 bytes, checksum: ab547e7a223561cde43ee616af17cc6d (MD5) part2_TableofContents.pdf: 237954 bytes, checksum: feb007bd87a5c989bf3e80e49b10b9bc (MD5) part1_TitleAbstract.pdf: 239628 bytes, checksum: 1deaa4cfe45ba391e49582d2f50264cb (MD5)   Previous issue date: 2004-03-29",
    "Author Email: imorozov@vt.edu",
    "Advisor Email: shagood@vt.edu",
    "Advisor Email: lhipkins@vt.edu",
    "Advisor Email: dbrann@vt.edu",
    "Advisor Email: hwilson@vt.edu",
    "Advisor Email: cnessler@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11154",
  "identifier_other": "etd-04282004-221543",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282004-221543",
  "identifier_uri": "http://hdl.handle.net/10919/11154",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "part7_Chapter_5.pdf",
    "part2_TableofContents.pdf",
    "part5_Chapter_3.pdf",
    "part8_Vita.pdf",
    "part3_Chapter_1.pdf",
    "part4_Chapter_2.pdf",
    "part6_Chapter_4.pdf",
    "part1_TitleAbstract.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "herbicide resistance",
    "Italian ryegrass",
    "lolium",
    "preemergence",
    "translocation",
    "postemergence",
    "metabolism",
    "diclofop",
    "ACCase",
    "absorption"
  ],
  "title": "Evaluation And Characterization of Herbicide Resistance In Italian Ryegrass (Lolium multiflorum Lam.) Biotypes To Diclofop-methyl And Alternative Management Options",
  "type": "Dissertation"
}