{
  "contributor_author": "Friedline, Robert Alan",
  "contributor_committeechair": "Tanko, James M.",
  "contributor_committeemember": [
    "Esker, Alan R.",
    "Long, Timothy E.",
    "Mahaney, James M.",
    "Stevenson, J. Paige"
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2011-08-22T19:00:57Z",
  "date_adate": "2004-04-30",
  "date_available": "2011-08-22T19:00:57Z",
  "date_issued": "2004-04-16",
  "date_rdate": "2007-04-30",
  "date_sdate": "2004-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "t-Butoxyl radical has been used as a chemical model for hydrogen abstractions in many enzymatic and biological systems.  However, the question has arisen as to how well this reactive intermediate mimics these systems.  In addressing this concern, absolute rate constants and Arrhenius parameters for hydrogen abstraction by t-butoxyl radical were measured for a broad class of substrates including amines, hydrocarbons, and alcohols using laser flash photolysis.  Initially, no obvious reactivity relationship between rate constant and substrate structure was observed for these homolytic reactions.  However, by closely examining the Arrhenius parameters for hydrogen abstraction, a pattern was revealed.  For substrates with C-H bond dissociation energy (BDE) > 92 kcal/mole, activation energy increases with increasing BDE (as expected).  However, for substrates with a lower BDE, the activation energy levels out at approximately 2 kcal/mole, essentially independent of structure.  Viscosity studies with various solvents were conducted, ruling out the possibility of diffusion-controlled reactions.  Entropy rather than enthalpy appears to be the dominating factor at 25°C, contributing to the free energy barrier for these reactions.  Laser flash photolysis was also used to study radical anions.  Using an indirect photoexcitation method, the properties of radical anions, generated from aryl ketones, were investigated.  These radical anions, such as t-butyl phenyl ketone and cyclopropyl phenyl ketone, measured to have decay rate constants of 1.0 x 106 s-1, although they are known to be persistent when studied electrochemically.  They also had measured activation energies around 6.0 kcal/mole and log A values close to 9.5.  By extending the molecules's conjugation, the decay rate constants increased to greater than 107 s-1, decreased their activation energy by half, and lowered the log A values to 8.0.  This trend was observed in aryl ketones such as trans-1-benzoyl-3-phenyl cyclopropane.  It is believed that the generation of a benzyl radical during the decay that facilitates the enhancement of the unimolecular decays.  These unimolecular decays were also observed with the previously studied hypersensitive SET probes, 5,7-di-tert-butylspiro[2.5]octa-4,7-dien-6-one and 1,1,-dimethyl-5,7-di-tert-butylspiro[2.5]octa-4,7-dien-6-one.  The decay rate constants for these radical anions were measured to be greater than 108 s-1, driven by the formation of an aromatic ring.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:57Z (GMT). No. of bitstreams: 1  CompleteThesisFinal.pdf: 916068 bytes, checksum: 4d8a3f602a46e1f6d9657f708684a7ed (MD5)    Previous issue date: 2004-04-16",
    "Author Email: rfriedli@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: jmahaney@vcom.vt.edu",
    "Advisor Email: stevensonp@lunainnovations.com"
  ],
  "format_medium": "ETD",
  "handle": "11157",
  "identifier_other": "etd-04282004-231632",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282004-231632",
  "identifier_uri": "http://hdl.handle.net/10919/11157",
  "publisher": "Virginia Tech",
  "relation_haspart": "CompleteThesisFinal.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "radical anion",
    "t-butoxyl",
    "alkoxyl",
    "free radical",
    "laser flash photolysis"
  ],
  "title": "The Reaction Kinetics of Neutral Free Radicals and Radical Ions Studied by Laser Flash Photolysis",
  "type": "Dissertation"
}