{
  "contributor_author": "Reigle, Karen E.",
  "contributor_committeechair": "Stremmel, Andrew J.",
  "contributor_committeemember": [
    "Benson, Mark J.",
    "Fu, Victoria R.",
    "McWey, Lenore M.",
    "Verdu, Mary Ellen"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2011-08-22T19:00:31Z",
  "date_adate": "2004-04-29",
  "date_available": "2011-08-22T19:00:31Z",
  "date_issued": "2004-04-05",
  "date_rdate": "2007-04-29",
  "date_sdate": "2004-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Children' s relationships with their childcare teachers and its effects on their subsequent behaviors, attachments, and outcomes have been an interest in the last two or three decades primarily due to the significant increase of young children in full-time childcare. Attachment Theory, and its identifying behaviors in children categorized by the Strange Situation or the Attachment Q-Sort, has been the main focus of previous research. The purpose of my study, using an ethnographic approach, was to understand and describe the varied and multiple relationships between children (approximate ages 12 to 24 months) and their childcare teacher in their day-to-day interactions.  Observations were my primary source of data, supported by videotaped sessions, and parent and teacher interviews. My focus was on secondary caregiver-child dyads, their relationships, and the parameters and identifying behaviors characterizing each pair. Data collection took place over an eight-week period in one toddler center classroom where I was a passive participant observer.  Results indicated the children had warm, nurturing relationships, often with multiple caregivers, without the prevailing attachment behaviors. My research did not support the customary categorization of childcare relationships using the attachment paradigm, nor an increase in the insecure-avoidant category among children in full-time childcare. Evidence suggested, instead, a broader base of relationship descriptions, and a future development of a multiple caregiver model analogous to the extended family for understanding the varied relationships within a childcare center setting.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:31Z (GMT). No. of bitstreams: 2 DissertationKER.pdf: 752381 bytes, checksum: 3f09ec9b15be9f23666c06fae8b7d134 (MD5) Contents.pdf: 19414 bytes, checksum: 59db2dbef0af0a305693debf5d1dbf64 (MD5)   Previous issue date: 2004-04-05",
    "Author Email: kreigle@vt.edu",
    "Advisor Email: mbenson@vt.edu",
    "Advisor Email: vfu@vt.edu",
    "Advisor Email: astremme@vt.edu",
    "Advisor Email: lmcwey@vt.edu",
    "Advisor Email: mverdu@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11150",
  "identifier_other": "etd-04252004-163957",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252004-163957",
  "identifier_uri": "http://hdl.handle.net/10919/11150",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "DissertationKER.pdf",
    "Contents.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Secondary Caregivers",
    "Young Children",
    "Relationship Behaviors",
    "Childcare"
  ],
  "title": "The Nature of Relationships Between Young Children and Their Secondary Caregiver In a Childcare Center Classroom",
  "type": "Dissertation"
}