{
  "contributor_author": "Hahn, Daniel Robert",
  "contributor_committeechair": "Ward, Thomas C.",
  "contributor_committeemember": [
    "Marand, Hervé L.",
    "Wilkes, Garth L.",
    "Wightman, James P.",
    "McGrath, James E."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2011-08-22T19:01:17Z",
  "date_adate": "2004-04-30",
  "date_available": "2011-08-22T19:01:17Z",
  "date_issued": "2004-04-06",
  "date_rdate": "2004-04-30",
  "date_sdate": "2004-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Cyanate ester thermosetting resins are a novel family of materials for high technology and aerospace applications. The high glass transition temperatures available from cured cyanate ester networks and subsequently, their resistances to corrosive materials make these resins attractive for harsh environmental applications. These features of cyanate ester resins presented a threefold opportunity for investigation, namely:  1) establish a characterization technique for the long term mechanical properties of the cured resins, 2) develop a method for determining the effect of physical and chemical aging on these mechanical properties, and 3) evaluate the AroCy® B-10 cyanate ester resin from Ciba-Geigy for use in applications where temperatures could easily reach 177°C (300°F).    Dynamic mechanical analysis used in a step isothermal mode was developed to characterize the mechanical properties of the cured resin and a family of isothermal modulus curves was established. These data were then shifted, following WLF theory, to create a master curve of storage modulus with respect to measurement frequency. The resultant master curves allowed the prediction of long term mechanical behavior of the resin networks via short duration, accelerated experimental tests. The test methodology and experimental procedures were especially useful in determining the effects of physical and chemical aging on the mechanical properties of the resin.   Cured resins were aged in oxidative and inert atmospheres (air and nitrogen, respectively) for varying time and temperature to study the suitability of cyanate ester resins for harsh environmental applications. After aging, the samples were tested by DMA, DSC and TGA and master curves of their mechanical behavior were generated. The results were then grouped to form a family of master curves as a function of atmosphere, time and temperature. This approach allowed for the separation of the competing chemical and physical degradation processes and established the practical application conditions for this class of cross-linked polymers.   Using the techniques established above, a model cyanate ester resin was selected based upon its chemical simplicity and availability. AroCy® B-10 cyanate ester resin manufactured commercially by Ciba-Geigy was evaluated for its application where temperatures could easily reach 177C. While this material was clearly unacceptable for the stated application conditions (especially in an oxygen rich atmosphere), its investigation provided experimental confirmation of the techniques developed. The test procedures and performance evaluation techniques described allow for the systematic assessment of not only the cyanate ester class of networking polymers, but any glass forming material, and a separation methodology for their concomitant chemical and physical degradation pathways.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:17Z (GMT). No. of bitstreams: 3  FrontMatter.pdf: 62091 bytes, checksum: a3d5a875c594cf0c0bbc8191349d98d6 (MD5)  BodyMatter.pdf: 1944066 bytes, checksum: 604b763277837e78530218c4154b5688 (MD5)  BackMatter.pdf: 636439 bytes, checksum: 012204dcc27d4029ddc6e63f8e3f5858 (MD5)    Previous issue date: 2004-04-06",
    "Author Email: daniel.r.hahn@office.xerox.com",
    "Advisor Email: hmarand@vt.edu",
    "Advisor Email: gwilkes @vt.edu",
    "Advisor Email: wightman@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: tward@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11158",
  "identifier_other": "etd-04192004-134529",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192004-134529",
  "identifier_uri": "http://hdl.handle.net/10919/11158",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "FrontMatter.pdf",
    "BodyMatter.pdf",
    "BackMatter.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Physical Aging",
    "Thermal Degradation",
    "Cyanate Esters"
  ],
  "title": "Examination of the Aging Properties of Novel Cyanate Ester Thermosets and the Subsequent Evaluation of the Material under Application Conditions",
  "type": "Dissertation"
}