{
  "contributor_author": "Franklin, Kellee Michelle",
  "contributor_committeechair": "Wiswell, Albert K.",
  "contributor_committeemember": [
    "Hillman, Larry W.",
    "Combs, Bill",
    "Boucouvalas, Marcie",
    "Tucker, N. Clyde",
    "Schulman, Robert S."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2011-08-22T19:00:46Z",
  "date_adate": "2004-04-29",
  "date_available": "2011-08-22T19:00:46Z",
  "date_issued": "2004-03-31",
  "date_rdate": "2004-04-29",
  "date_sdate": "2004-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The concept of trust in human relationship has gained much attention over the past decade.  The majority of the trust literature focuses on the definition of trust and the development and maintenance of trust.  Most scholars agree that trust is developed and maintained through dialogue and socialization, including verbal and nonverbal social cues.  The literature suggests that individuals share information and build communities with persons they trust.  Within an organizational environment, higher degrees of trust enhance the discovering processes and, ultimately, the ability of groups and organizations to fully function.   A 창  sense of community창   is created in environments that encourage open and honest communication among their members.  Despite the research supporting a link between socialization, communication, and trust, there is almost no research that specifically addresses the relationship between communication technologies that eliminate face-to-face interaction and organizational trust and sense of community.  E-mail, a tool that enables members of an organization to communicate with one another despite differences in time and location, is used by a vast majority of corporations to communicate with its organizational members.  While e-mail communication provides many advantages, the literature in this area suggests that this tool may limit the amount of 창  human moments창   at work, which may relate to decreased levels of trust and feelings of community in the workplace.   This study was aimed at learning more about this phenomenon.  Using a questionnaire developed that included three valid and reliable instruments of trust and sense of community, responses were collected from members of selected teams within a large, international organization to examine the relationships between trust, community, and e-mail communication.  Other demographic and organizational data was also collected.  Although no relationship was found between e-mail use, organizational trust, and psychological sense of community in the workplace, the results suggest that factors other than communication medium influence feelings of trust and community.  Implications of the findings as well as recommendations for practice and future research are provided.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:00:46Z (GMT). No. of bitstreams: 10 TitlePageTOC_FRANKLINK.pdf: 109592 bytes, checksum: 36ba04e33d3ce2958ee14b5ad2eef11b (MD5) References_FRANKLINK.pdf: 125345 bytes, checksum: 82d52efcfb98232a3d6e6d431ee46bf3 (MD5) Chapter5_FRANKLINK.pdf: 135030 bytes, checksum: 10997581d5f94e1711187f065249c905 (MD5) Chapter4_FRANKLINK.pdf: 380731 bytes, checksum: 1bbc34d7b57ffaced0ce5119b528efad (MD5) Chapter3_FRANKLINK.pdf: 159860 bytes, checksum: 8b8fc66185ad52681faf012ac29f4231 (MD5) Chapter2_FRANKLINK.pdf: 492097 bytes, checksum: 9fdc1782c5c4add766cd0867228e45b0 (MD5) Chapter1_FRANKLINK.pdf: 124456 bytes, checksum: d970e698aa44cba89ce9a6e3eb9c2607 (MD5) AppendixC_FRANKLINK.pdf: 92269 bytes, checksum: dd8a876956e9954818b0986cabc7b78d (MD5) AppendixB_FRANKLINK.pdf: 128563 bytes, checksum: 0871a4ce0bba8e3e37f15aeaf06ce9f2 (MD5) AppendixA_FRANKLINK.pdf: 143175 bytes, checksum: a78d946faf69d9347b24f3268af060f7 (MD5)   Previous issue date: 2004-03-31",
    "Author Email: kelleefranklin@cox.net",
    "Advisor Email: awiswell@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11152",
  "identifier_other": "etd-04262004-143613",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262004-143613",
  "identifier_uri": "http://hdl.handle.net/10919/11152",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter1_FRANKLINK.pdf",
    "TitlePageTOC_FRANKLINK.pdf",
    "References_FRANKLINK.pdf",
    "AppendixA_FRANKLINK.pdf",
    "Chapter2_FRANKLINK.pdf",
    "AppendixB_FRANKLINK.pdf",
    "Chapter3_FRANKLINK.pdf",
    "AppendixC_FRANKLINK.pdf",
    "Chapter5_FRANKLINK.pdf",
    "Chapter4_FRANKLINK.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "organizational trust",
    "organizational behavior",
    "e-mail",
    "psychological sense of community"
  ],
  "title": "Disconnected: An Examination of Organizational Trust and Psychological Sense of Community in a Networked Environment",
  "type": "Dissertation"
}