{
  "contributor_author": "Allen, April Diane",
  "contributor_committeecochair": [
    "Casto, Marilyn D.",
    "McLain-Kark, Joan H."
  ],
  "contributor_committeemember": [
    "Green, William R.",
    "Fine, Elizabeth C.",
    "Beamish, Julia O."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2011-08-22T19:01:19Z",
  "date_adate": "2004-05-04",
  "date_available": "2011-08-22T19:01:19Z",
  "date_issued": "1999-11-01",
  "date_rdate": "2004-05-04",
  "date_sdate": "2004-04-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to discover the various meanings that the Pulaski Theatre held for the residents of Pulaski and the theatreâ  s social importance to the town.  The following research objectives directed this study:  1) to document the theatreâ  s history from the time it was built in 1911 until the present day, 2) to uncover memories or feelings associated with the theatre, and 3) to determine if design features of the theatre building influenced those feelings/memories.  In documenting the history of the theatre, design features of the original 1911 building were examined as well as changes over time.  To determine if design features of the building influenced the feelings/memories that were associated with the structure it was important first to discover which architectural and design features people remembered, if any, and then to determine if these design features reflected a meaningful association, i.e. sense of place to participants.   Also of interest was whether this association or sense of place would be similar or different for all. Participants were fifteen males and females aged 43 to 82 who had attended the theatre over time.  All participants grew up in Pulaski and six had lived there their entire lives.  Both African Americans and Caucasians participated. Subjects were asked to draw a picture of the theatre that expressed their experience of the space.  After the drawing, they were asked to discuss the picture and its meaning to them.  Clare Cooper Marcus and others used this environmental autobiography technique as a method to bring a personâ  s experiences of a place to a conscious level.  Tape-recorded interviews were conducted and transcribed by the researcher to discover memories of the theatre and the meaning of the theatre to the participants.   Data were analyzed by coding to look for emerging themes or categories that relate to the research question.  Of interest was whether or not the Pulaski Theatre represented a sense of place to residents and if that sense of place varied for different participants.   Document research was conducted through old newspapers and artifacts in the Raymond Ratcliffe Museum (the historic museum in Pulaski), documents from scrapbooks, architectural plans, and the files of the Town of Pulaski. Themes that were identified from the research were (1) the structure was an integral part of the community, (2) the theatre was a reflection of the communityâ  s social norms and roles, such as segregation, and (3) the theatre interior contributed to the social atmosphere of the space.  The theatre building, while transformed over time, retained a presence in the town and memories associated with it across time were significant in creating a sense of place in the community.  The theatre was remembered as a setting that brought excitement and stimulation to children and adults for many years.  Participants felt â  at homeâ   in the theatre, having favored sections of the theatre where they routinely sat. School children attending the weekly matinees in the summer and African Americans sitting in their special section of the balcony developed a special identity with that particular space within the theatre.  Even after segregation, many African Americans continued to sit in the balcony where they had sat for many years and felt at home.  The unique characteristics of these spaces were dependent on the people that frequented them rather than the architecture of the building.  The sense of place was one of personal relationships and emotional attachments rather than of bricks and mortar.  Memories of the theatre were stories of groups or individuals and their interactions in the space.  The building represented these individuals and what they brought to this place and time.  The Pulaski Theatre played a great role in interactions with friends and neighbors and was significant in reflecting a sense of place in this community.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:19Z (GMT). No. of bitstreams: 5 frontmatter.pdf: 30103 bytes, checksum: ea37312d7bc58ea8d587c34b3fef2688 (MD5) backmatter.pdf: 908069 bytes, checksum: d2490685e2cb330ab58e454180e5868b (MD5) CHAPTERV.pdf: 18142 bytes, checksum: 6de854a840ef79c515af3fdbfc27320b (MD5) CHAPTERSIandII.pdf: 2059832 bytes, checksum: ac866fcc0a7c6dc71532fce4d631b051 (MD5) CHAPTERSIIIandIV.pdf: 3576780 bytes, checksum: 32d4156f234265d60914103029dfe0a0 (MD5)   Previous issue date: 1999-11-01",
    "Author Email: apallen@vt.edu",
    "Advisor Email: wigreen4@vt.edu",
    "Advisor Email: bfine@vt.edu",
    "Advisor Email: jbeamish@vt.edu",
    "Advisor Email: mcasto@vt.edu",
    "Advisor Email: jmkark@pemtel.net"
  ],
  "format_medium": "ETD",
  "handle": "11164",
  "identifier_other": "etd-04302004-150744",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04302004-150744",
  "identifier_uri": "http://hdl.handle.net/10919/11164",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAPTERSIIIandIV.pdf",
    "CHAPTERSIandII.pdf",
    "CHAPTERV.pdf",
    "frontmatter.pdf",
    "backmatter.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Small-town",
    "Theater",
    "Sense of Place",
    "Social importance",
    "Pulaski"
  ],
  "title": "The Social Importance of a Small-town Theater: A Case Study of the Pulaski Theatre, Pulaski, Virginia",
  "type": "Dissertation"
}