{
  "contributor_author": "Chelf, Carole Melisa",
  "contributor_committeechair": "Axsom, Daniel K.",
  "contributor_committeemember": [
    "Cooper, Lee D.",
    "Finney, Jack W.",
    "Jones, Russell T.",
    "Ollendick, Thomas M."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2011-08-22T19:01:18Z",
  "date_adate": "2004-04-30",
  "date_available": "2011-08-22T19:01:18Z",
  "date_issued": "1999-05-12",
  "date_rdate": "2007-04-30",
  "date_sdate": "2004-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The percentage of rape victims who do not seek social support after rape is alarming, particularly given the potential consequences of not seeking help. The present study attempts to address the dilemma of rape and attempted rape victims' lack of support seeking through a two-phase online intervention designed to encourage them to seek treatment. The study manipulates factors involved in characterizing oneself as a rape victim and in seeking help for problems resulting from rape. It was hypothesized that victims who received the intervention would seek counseling more than victims in a wait-list control group. Participants were 1322 women ranging in age from 17 to 39 from a large, southeastern university. Of these women, 344, or 26% of the sample, reported an experience consistent with a legal definition of rape or attempted rape. Unfortunately, it was not possible to fully examine the proposed model in this study, as hypothesized differences between intervention and control subjects did not exist. However, interesting trends developed collapsing across treatment groups. While few participants sought formal help, almost three-fourths sought informal help and almost half sought information about counseling. These findings are made even more salient by the large number of non-recent victims who sought help for the first time. Taking part in the study itself appeared to encourage victims who had gone without help for some time to actually seek help. In addition, higher levels of distress were associated with seeking help, as were higher levels of negative social reactions, stigma, and self-blame. Perceived need for help was found to mediate the relationship between distress and intent to seek help. Limitations and suggestions for future research are discussed.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:18Z (GMT). No. of bitstreams: 1  CMChelfdissertation.pdf: 812859 bytes, checksum: 68936c974240feda2f75dd57514e3fa4 (MD5)    Previous issue date: 1999-05-12",
    "Author Email: cchelf@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: rtjones@vt.edu",
    "Advisor Email: tho@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11160",
  "identifier_other": "etd-04292004-032414",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04292004-032414",
  "identifier_uri": "http://hdl.handle.net/10919/11160",
  "publisher": "Virginia Tech",
  "relation_haspart": "CMChelfdissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "treatment",
    "sexual assault",
    "rape",
    "social support"
  ],
  "title": "An Intervention Model for Recruiting Rape Victims into Treatment",
  "type": "Dissertation"
}