{
  "contributor_author": "Sharma, Vivek",
  "contributor_committeecochair": [
    "Kumar, Raman",
    "Easterwood, John C."
  ],
  "contributor_committeemember": [
    "Patterson, Douglas M.",
    "Gulen, Huseyin",
    "Chance, Donald M."
  ],
  "contributor_department": "Finance, Insurance, and Business Law",
  "date_accessioned": "2011-08-22T19:01:18Z",
  "date_adate": "2004-04-30",
  "date_available": "2011-08-22T19:01:18Z",
  "date_issued": "2004-01-19",
  "date_rdate": "2004-04-30",
  "date_sdate": "2004-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The dissertation consists of two essays. In the first essay, we measure herding by institutional investors in the new economy (internet) stocks during 1998-2001 by examining the changes in the quarterly institutional holdings of internet stocks relative to an average stock. More than 95% of the stocks that are examined are listed on NASDAQ. The second essay attempts to detect intra-day herding using two new measures in an average NYSE stock during 1998-2001. In the second essay, rather than asking whether institutional investors herd in a specific segment of the market, we endeavor to ask if herding occurs in an average stock across all categories of investors.    The first essay analyzes herding in one of the largest bull runs in the history of U.S. equity markets. Instead of providing a corrective stabilizing force, banks, insurance firms, investment companies, investment advisors, university endowments, hedge funds, and internally managed pension funds participated in herds in the rise and to a lesser extent in the fall of new economy stocks. In contrast to previous research, we find strong evidence of herding by all categories of institutional investors across stocks of all sizes of companies, including the stocks of large companies, which are their preferred holdings. We present evidence that institutional investors herded into all performance categories of new economy stocks, and thus the documented herding cannot be explained by simple momentum-based trading. Institutional investors' buying exerted upward price pressure, and the reversal of excess returns in the subsequent quarter provides evidence that the herding was destabilizing and not based on information.   The second essay attempts to detect herding in financial markets using a set of two methodologies based on runs test and dependence between interarrival trade times. Our first and the most important finding is that markets function efficiently and show no evidence of any meaningful herding in general. Second, herding seems to be confined to very small subset of small stocks. Third, dispersion of opinion among investors does not have much of impact on herding. Fourth, analysts' recommendations do not contribute to herding. Last, the limited amount of herding on price increase days seems to be destabilizing but on the price decrease days, the herding helps impound fundamental information into security prices thus making markets more efficient. Our results are consistent with Avery and Zemsky (1998) prediction that flexible financial asset prices prevent herding from arising.    The seemingly contradictory results of the two essays can be reconciled based on the different sample of stocks, and the different methodologies of the two essays which are designed to detect different types of herding. In the first essay, herding is measured for NASDAQ-listed (primarily) internet stocks relative to an average stock, while the second essay documents herding for an average stock. In the first essay, we document herding in more volatile internet stocks, but we do not find any evidence of herding in more established NYSE stocks. The first essay examines herding by institutional investors, while the second essay examines herding, irrespective of the investor type. Consequently, in the first essay, we find that a subset of investors herd but in the second essay market as a whole does not exhibit any herding. Moreover, the first essay measures herding by examining the quarterly institutional holdings of internet stocks, while the second essay measures herding by examining the intra-day trading patterns for stocks. This suggests that it takes a while for investors to find out what others are doing leading to herding at quarterly interval but no herding is observed at intra-day level. The evidence presented in the two essays suggests that while institutional investors herded in the internet stocks during 1998-2001, there was very little herding by all investors in an average stock during this period.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:18Z (GMT). No. of bitstreams: 1  Dissertation.pdf: 1181731 bytes, checksum: ff104ed1cacc58bbefc2850ba1af16b4 (MD5)    Previous issue date: 2004-01-19",
    "Author Email: vsharma@vt.edu",
    "Advisor Email: amex@vt.edu",
    "Advisor Email: hgulen@vt.edu",
    "Advisor Email: dchance@lsu.edu",
    "Advisor Email: rkumar@vt.edu",
    "Advisor Email: jceast@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11161",
  "identifier_other": "etd-04292004-124545",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04292004-124545",
  "identifier_uri": "http://hdl.handle.net/10919/11161",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Market Efficiency",
    "Intra-Day Trading",
    "Institutional Investors",
    "Behavioral Finance",
    "Herding"
  ],
  "title": "Two Essays on Herding in Financial Markets",
  "type": "Dissertation"
}