{
  "contributor_author": "Simeone, Ann Elizabeth",
  "contributor_committeechair": "Rohr, John A.",
  "contributor_committeemember": [
    "Wolf, James F.",
    "Wamsley, Gary L.",
    "Rees, Joseph V.",
    "Dudley, Larkin S."
  ],
  "contributor_department": "Public Administration/Public Affairs",
  "date_accessioned": "2011-08-22T19:01:18Z",
  "date_adate": "2004-05-03",
  "date_available": "2011-08-22T19:01:18Z",
  "date_issued": "2004-04-27",
  "date_rdate": "2004-05-03",
  "date_sdate": "2004-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study is to discuss the ideal of public service, what it is and what it should be and how it has evolved in American history.  I am concerned that the ideal of public service, a guiding principle for public administrators and government, has been diminished by the emphasis in American public administration on economy, efficiency, and effectiveness.  If public sector leaders, such as presidents, over time have changed their focus from discussions of the Constitution or republican principles to other ideas such as taxes and specific government programs, then has the ideal or vision of public service changed?  The topic of service, aligned with duty and the responsibility of the citizen, while prevalent in the political theory literature, has been pushed to the back of the public administration literature shelves.  Without the ideal of service as a vibrant element of the public administration discourse, the public administration community will have given way to those who see public administration as merely a modified business model. The primary research question posed in this study was:  Has the emphasis on economy, efficiency, and effectiveness diminished the ideal of public service?  The texts of presidential inaugural addresses were analyzed and reviewed for insights into the ideal of public service by the use of content analysis, using nine criteria that exemplify the ideals of public service.  One of the secondary questions posed here was:  Has the ideal or vision of public service changed?  Discussion of the different criteria illustrated that there has been a change resulting in a different concept of the ideal of public service today.  The final question of how and when the ideal of public service changed is answered in the dissertation also, as the results, criterion by criterion, are explained.  This study shows that the inaugural addresses captured the ideal of public service dynamically and often eloquently over the course of American history.  The changing nature of the role of government, issues of importance to government, and nature of the ideal of public service are on the historical record as set forth in these inaugural addresses.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:18Z (GMT). No. of bitstreams: 1 asimeone.pdf: 3340908 bytes, checksum: 9dbbfc4866fa4c931f91577ba6919c58 (MD5)   Previous issue date: 2004-04-27",
    "Author Email: ANNSIM@aol.com; ann.simeone@dhs.gov"
  ],
  "format_medium": "ETD",
  "handle": "11162",
  "identifier_other": "etd-04282004-214442",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282004-214442",
  "identifier_uri": "http://hdl.handle.net/10919/11162",
  "publisher": "Virginia Tech",
  "relation_haspart": "asimeone.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "public service",
    "inaugural addresses",
    "public administration",
    "ideals"
  ],
  "title": "The Ideal of Public Service:  The Reality of the Rhetoric",
  "type": "Dissertation"
}