{
  "contributor_author": "Faridi, Rushad",
  "contributor_committeechair": "Yang, Dennis T.",
  "contributor_committeemember": [
    "Ashley, Richard A.",
    "Murphy, Russell D.",
    "Peterson, Everett B.",
    "Salehi-Isfahani, Djavad"
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2011-08-22T19:01:19Z",
  "date_adate": "2004-05-05",
  "date_available": "2011-08-22T19:01:19Z",
  "date_issued": "2004-04-16",
  "date_rdate": "2006-05-05",
  "date_sdate": "2004-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Microcredit programs are of great interest to economists and policymakers because of their potential for reducing poverty, particularly among women. The first chapter mainly investigates the effectiveness aspect of microcredit programs. Using program evaluation methods, we find significant improvement in women's economic condition after participating in these programs. This study also corrects for the self-selection bias that might arise due to the fact that women decide on whether to participate in the programs or not.      The second chapter studies the determinants of women's economic performance in microcredit programs. These determinants are in the form of different types of characteristics of women: their own characteristics, such as age or schooling or the characteristics of the household or village they live in. One obstacle to measure the effect of observed characteristics is the problem of omitted variable bias, typically caused by unavailability of data on unobserved ability of individuals. In the absence of suitable instruments, this study finds information about unobserved ability from the marriage market. It is found that incorporating estimates of women's unobserved characteristics significantly changes the estimated effect of women's observed characteristics and substantially removes the omitted variable bias.    Microcredit programs originated from Bangladesh and now three major microcredit programs  are  operating: Grameen Bank, BRAC and RD-12. The third chapter investigates how these different microcredit programs have been performing relative to each other. Using similar program evaluation technique as in chapter 1, we measure program impact on women's economic welfare for these programs separately. We find that BRAC outperforms Grameen Bank and RD-12 significantly. This result is interesting since it contradicts the popular notion that Grameen Bank is the most successful microcredit program. This study also tries to find the determinants of economic success of women participating in these programs, separately for each program. These results provide more insights into different aspects of microcredit program.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:19Z (GMT). No. of bitstreams: 1  DissertationETD.pdf: 530456 bytes, checksum: 2476bfd98af17b323261b0c8136c3f97 (MD5)    Previous issue date: 2004-04-16",
    "Author Email: rfaridi@vt.edu",
    "Advisor Email: ashleyr@vt.edu",
    "Advisor Email: rdmurphy@vt.edu",
    "Advisor Email: petrsone@vt.edu",
    "Advisor Email: salehi@vt.edu",
    "Advisor Email: deyang@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11167",
  "identifier_other": "etd-04292004-191805",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04292004-191805",
  "identifier_uri": "http://hdl.handle.net/10919/11167",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationETD.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "microcredit",
    "program evaluation",
    "unobserved ability",
    "selection bias"
  ],
  "title": "Microcredit Programs and Evaluation of Women's Success",
  "type": "Dissertation"
}