{
  "contributor_author": "Corderman, David Sandt",
  "contributor_committeechair": "Wiswell, Albert W.",
  "contributor_committeemember": [
    "Combs, Letitia A.",
    "Boucouvalas, Marcie",
    "Jarvis, John P.",
    "McCollum, Eric E."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2011-08-22T19:01:19Z",
  "date_adate": "2004-05-04",
  "date_available": "2011-08-22T19:01:19Z",
  "date_issued": "2003-04-07",
  "date_rdate": "2004-05-04",
  "date_sdate": "2004-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The use of multi-rater feedback as a way to analyze perceptions within the context of job performance and leadership in the Federal Bureau of Investigation (FBI) was examined.  Research in this domain is notable as this type of evaluation is now being done with regularity in the private sector and is starting to be utilized more extensively in the public sector, but is still being used to a limited extent in law enforcement.  The path of this research examined differences between self-assessments and assessments of others (peers and subordinates) in dimensions of leadership as measured by the same multi-rater instrument at two points in time.  This research effort made use of a multi-rater survey instrument called the \"Leadership Commitments and Credibility Inventory System (LCCIS),\" designed by Keilty, Goldsmith, and Company, which is used in multiple industries and was expanded to capture characteristics considered important to FBI leaders.  Results showed high ratings on a five point Likert scale as indicated by mean averages of self and others.  Additionally, Z scores, t tests and ANCOVA indicated that FBI supervisors did not overestimate their leadership, as indicated by (1) an overall leadership measure at time two compared to time one, (2) a greater perceptual agreement between others and self existing on second multi-rater assessments than on the initial assessments, and (3) any statistical differences of means in all measured categories at time two versus time one.  Various subcategories of the assessment showed a mixture of non-statistically significant results and that subordinates and peers perceived leaders differently.  Further, analysis of two unique dimensions of the LCCIS, \"Manage Diversity\" and \"Build Public Trust\" showed exceptionally high results.  The implications of the present research are that leadership in the FBI, as measured by different dimensions, is strong.  Yet, there is no evidence that leaders or others in this organization change their perceptions over time.  These findings may point to the need for multi-rater instruments to be used in concert with personal development plans in order to improve the perception of leadership.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:19Z (GMT). No. of bitstreams: 1  CordermanDissertation.pdf: 1178304 bytes, checksum: cd8d5306fd7e8e3429e54266cf09475e (MD5)    Previous issue date: 2003-04-07",
    "Author Email: dcorderman@fbiacademy.edu",
    "Advisor Email: awiswell@vt.edu",
    "Advisor Email: lcombs@vt.edu",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: jjarvis@fbiacademy.edu",
    "Advisor Email: emccollu@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11165",
  "identifier_other": "etd-04222004-182651",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222004-182651",
  "identifier_uri": "http://hdl.handle.net/10919/11165",
  "publisher": "Virginia Tech",
  "relation_haspart": "CordermanDissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Multi-rater Feedback",
    "Leadership Development"
  ],
  "title": "Perceptual Agreement Between Multi-rater Feedback Sources in the Federal Bureau of Investigation",
  "type": "Dissertation"
}