{
  "contributor_author": "Sheng, Shibin",
  "contributor_committeecochair": [
    "Parker, Andrew M.",
    "Nakamoto, Kent"
  ],
  "contributor_committeemember": [
    "Klein, Noreen M.",
    "Coupey, Eloise",
    "Poppo, Laura"
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2011-08-22T19:01:18Z",
  "date_adate": "2004-05-03",
  "date_available": "2011-08-22T19:01:18Z",
  "date_issued": "2004-04-12",
  "date_rdate": "2007-05-03",
  "date_sdate": "2004-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Drawing from mental accounting, reference price, attribution and categorization theories, we propose that bundle price discounts will influence perceived prices and quality of the individual bundle components, thus influence purchase intentions. Meanwhile, we investigate how these bundling effects interplay with the forms of bundling, complementarity and brand images of bundle components. The empirical results indicate that the impact of bundle price discount on evaluations of individual bundle components varies across bundling forms. In a mixed-joint bundle, the price discount increases consumer perceptions of the regular price of bundle components, but does not change quality perceptions. In a mixed-leader bundle, the price discount hurt consumer price and quality evaluations of the discounted product, but increased the undiscounted product's perceived quality. These effects are moderated by complementarity and the brand images of bundle components. Implications of these findings for marketing researchers and managers are presented along with suggestions for further research.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:18Z (GMT). No. of bitstreams: 1 dissertation.pdf: 1978119 bytes, checksum: bccf816cd124f0f30883280f9934141b (MD5)   Previous issue date: 2004-04-12",
    "Author Email: ssheng@vt.edu",
    "Advisor Email: anparker@vt.edu",
    "Advisor Email: nakamoto@vt.edu",
    "Advisor Email: nklein@vt.edu",
    "Advisor Email: ecoupey@vt.edu",
    "Advisor Email: lpoppo@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11163",
  "identifier_other": "etd-04292004-222257",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04292004-222257",
  "identifier_uri": "http://hdl.handle.net/10919/11163",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Bundling Product Evaluation",
    "Brand Image",
    "Mental Accounting"
  ],
  "title": "Bundling and Consumer Evaluations of Individual Bundle Components",
  "type": "Dissertation"
}