{
  "contributor_author": "Jordan, Brian Robert",
  "contributor_committeechair": "Potts, Malcolm",
  "contributor_committeecochair": "Helm, Richard Frederick",
  "contributor_committeemember": [
    "Kennelly, Peter J.",
    "Dessy, Raymond E.",
    "Van Cott, Kevin E.",
    "Newton, William E."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2011-08-22T19:01:36Z",
  "date_adate": "2004-05-18",
  "date_available": "2011-08-22T19:01:36Z",
  "date_issued": "2004-05-05",
  "date_rdate": "2004-05-18",
  "date_sdate": "2004-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Cyanobacteria of the Nostoc genus are known for the thick, mucilaginous carbohydrate coatings that they produce.  In this work, two examples of cyanobacterial glycobiology are considered, each of which involves a cyanobacterium of the Nostoc genus. The first portion of this work details attempts to obtain amino acid sequence information from the enzymes (glycosyltransferases) that are responsible for producing the extracellular polysaccharide (EPS) of Nostoc commune DRH1, ultimately to allow the transfer of this capacity to another organism.  Two artificial substrates were synthesized for use in a capillary electrophoresis-based enzyme assay, which was used to look for glycosyltransferase activity in Nostoc commune DRH1 cell extracts.  Glucuronosyltransferase activity was detected in association with Nostoc commune membrane material.  The active enzyme displayed a divalent cation metal dependence (Mg+2) that is typical of glycosyltransferase enzymes purified from other organisms.  Because the enzyme responsible for this activity held the potential to be EPS-related, its purification was attempted. The capillary electrophoresis-based enzyme assay and a 32P-labeled affinity tag were utilized to follow the glucuronosyltransferase enzyme through successive purification steps.  The active enzyme was extracted from Nostoc commune membrane material using Triton X-100, and then purified by anion exchange chromatography.  The active detergent extract was extremely unstable, and consequently, other purification techniques tested were unsuccessful in enriching activity.  Affinity-labeling experiments indicated that the active enzyme was forming protein aggregates during these procedures, which were not amenable to in-gel protease digestion and peptide analysis by tandem mass spectrometry. The second portion of this work describes an investigation of an Anabaena (Nostoc) PCC 7120 soluble cell extract.  Upon separation by sodium dodecyl sulfate ¡V polyacrylamide gel electrophoresis (SDS-PAGE) and subsequent periodic acid-Schiff (PAS) staining of the resulting gel, the components of this cellular fraction produce a ladder-like pattern, which suggests that the extract may contain glycosylated protein.  Analyses of several samples that were taken from within the PAS-staining region of such a gel revealed surface layer homology (SLH) domain-containing proteins, likely candidates to be covalently attached to or non-covalently interacting with carbohydrate. Various protein sequence analyses indicated that the detected SLH domain containing proteins belong to a family of (putative) cyanobacterial porins.  Proteins in this family possess features that include a N-terminal signal sequence, a single SLH domain motif, followed by a coiled-coil region, and a C-terminal region that is homologous to the b-barrel-forming region of bacterial porins.  All of these features were identified in the detected Anabaena (Nostoc) PCC 7120 SLH domain-containing proteins.  Smith degradation was performed on a sample that was electroeluted from the PAS-staining region of a preparative-scale SDS-PAGE gel of the soluble cell extract.  Subsequent analyses of the resulting sample by SDS-PAGE and mass spectrometry indicated that at least two SLH domain-containing proteins, encoded by all4499 and alr4550, were non-covalently interacting with the PAS-staining material.  Following degradation, the PAS-staining material was still of sufficient size to detected by gel electrophoresis, and it continued to migrate in the absence of an interacting protein component.  Protease digestion of a similarly prepared sample, and then subsequent analysis by SDS-PAGE and mass spectrometry, revealed that the region between amino acid residues #504 and #536, in the protein encoded by the alr4550 open reading frame, was interacting with the PAS-staining material.  Monosaccharide composition analyses of this material revealed more carbohydrate constituents than are found in cyanobacterial primary (peptidoglycan) cell wall polymer alone, indicating that it contained a significant secondary cell wall polymer component as well.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:36Z (GMT). No. of bitstreams: 1  BrianJordanDissertation052004.pdf: 5830264 bytes, checksum: a14d06081f9a643b2734f2c5472b6f0b (MD5)    Previous issue date: 2004-05-05",
    "Author Email: brjordan@vt.edu",
    "Advisor Email: pjkennel@vt.edu",
    "Advisor Email: dessyre@vt.edu",
    "Advisor Email: helmrf@vt.edu",
    "Advisor Email: geordie@vt.edu",
    "Advisor Email: kvancott@vt.edu",
    "Advisor Email: wenewton@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11177",
  "identifier_other": "etd-04242004-203124",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242004-203124",
  "identifier_uri": "http://hdl.handle.net/10919/11177",
  "publisher": "Virginia Tech",
  "relation_haspart": "BrianJordanDissertation052004.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "porin",
    "cyanobacteria",
    "carbohydrate",
    "glycosyltransferase"
  ],
  "title": "Carbohydrate-Interacting Proteins from Two Nostoc (Cyanobacteria) Species",
  "type": "Dissertation"
}