{
  "contributor_author": "Bishop, Lou Don",
  "contributor_committeechair": "Heath-Camp, Betty A.",
  "contributor_committeemember": [
    "Moore, Patrick K.",
    "Camp, William G.",
    "Eschenmann, Konrad Kurt",
    "Stewart, Daisy L."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2011-08-22T19:01:37Z",
  "date_adate": "2003-01-08",
  "date_available": "2011-08-22T19:01:37Z",
  "date_issued": "2003-04-15",
  "date_rdate": "2004-01-08",
  "date_sdate": "2002-12-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study addresses the paralegal occupation and how it is defined within the context of licensure, control, and regulation in the United States.  Drawing upon social theories of the emergence of professions and the concept of degree of professionalization, the author discusses how the organization of occupations into the modern professions has directly influenced governmental regulation.  Paralegalism is presented in terms of its status as an emerging occupation.  The model of the professional (attorney) regulating the paraprofessional (paralegal) and controlling the legal knowledge base is explored.   The study identifies measures taken by legislatures, courts, and bar associations and reports each state s definition of paralegal, provides the corresponding citation, and advises if mandatory paralegal licensure or certification has been attempted within that state.  If attempted, the form of the mandate, licensure or certification, by whom it was attempted, and the status of the action is provided.  Primary data sources employed in this qualitative content-analytic study consisted of state legislative and judicial materials.  Secondary data sources consisted of selected documents published by professional organizations.  The database was constructed using on-line legal resources and data were analyzed within states across the two variables, definition and mandate attempted.   Although attorneys have embraced the concept of the paralegal paraprofessional and various state entities have attempted to define it, the results of this study indicate that there is little evidence of uniformity in form of definition across the states.  Paralegals are defined by statute in 7 states, court rule in 9 states, court ruling in 6 states, and bar association in 15 states.  Thirteen states have no formal definition.  No state has adopted mandatory requirements for paralegals even though formal attempts have been made in four.  In three of the four states, the action was proposed as mandatory certification rather than licensure.  In each state, the actions were brought by different entities.  Discussions for proposals continue in several states.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:37Z (GMT). No. of bitstreams: 1  Dissertation.pdf: 758938 bytes, checksum: b41bde255e38eadd39c6aff148e2abae (MD5)    Previous issue date: 2003-04-15",
    "Author Email: lbishop@vt.edu",
    "Advisor Email: wgcamp@vt.edu",
    "Advisor Email: heathb@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Advisor Email: daisys@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11179",
  "identifier_other": "etd-12192002-132757",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-12192002-132757",
  "identifier_uri": "http://hdl.handle.net/10919/11179",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "regulation of paralegals",
    "licensure of paralegals",
    "definition  of paralegal"
  ],
  "title": "Definition, Regulation, and Licensure of Paralegals in the United States",
  "type": "Dissertation"
}