{
  "contributor_author": "Hoffman, Brian Jeffrey",
  "contributor_committeechair": "Taylor, Larry T.",
  "contributor_committeemember": [
    "McNair, Harold M.",
    "Kingston, David G. I.",
    "Long, Gary L.",
    "Wolfe, James F."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2011-08-22T19:01:35Z",
  "date_adate": "2004-05-12",
  "date_available": "2011-08-22T19:01:35Z",
  "date_issued": "2004-05-03",
  "date_rdate": "2004-05-12",
  "date_sdate": "2004-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Alkylphenol ethoxylates (APEOs), alcohol ethoxylates (AEOs), and alcohol propoxylates (APOs) are non-ionic surfactants used in daily care products and detergents.  They are formed as an oligomeric series with a varying distribution, which determines their commercial application.  The goal of the research performed was the development of sample characterization methods for non-ionic surfactants utilizing supercritical fluid chromatography (SFC) under mild instrument operating conditions.  The aryl group present in APEOs allowed ultraviolet (UV) detection, with an equal molar response for oligomers, allowing average molar oligomer values to be calculated.  APEOs were separated by ethoxylate unit via SFC-UV as well as normal phase HPLC-UV employing packed columns.  Stationary phase and column length were varied in the SFC setup to produce the most favorable separation conditions.  Fractions from SFC runs of APEOs were collected and analyzed by flow injection analysis electrospray ionization mass spectrometry (FIA-ESI-MS) to identify fraction composition.  SFC provided shorter retention times with similar resolution as HPLC for separation of APEOs and consumed a smaller amount of organic solvent.  AEOs and APOs lack functionality capable of absorbing UV light outside the UV cut-off of normal organic solvents.  SFC was able to separate AEOs and APOs derivatized as trimethylsilyl ethers (TMS) with pure CO2 with detection at 195 nm.  The instrumental conditions, however, needed for separation necessitated high temperature and high CO2 pressure.  Derivatization of alcohol polyether samples with an UV absorbing agent was achieved with phenylated disilazane-chlorosilane mixtures forming phenylsilylethers detected at 215 nm.  Use of an organic solvent-modified CO2 mobile phase afforded lower pressure and temperature conditions for oligomer separation.    The use of polar embedded alkyl phases combined with use of organic modified CO2 produced good resolution between oligomers.  Better peak shape and shorter retention times were realized with methanol-modified CO2 than acetonitrile-modified CO2.   Peak assignments were made via SFC coupled with ESI-MS detection in the positive ion mode.  SFC-UV and SFC-ESI-MS data were jointly used for calculation of average molar oligomer values.  Proton nuclear magnetic resonance (1H-NMR) analysis of non-derivatized samples was performed to determine average molar oligomer values and was used for comparison with values calculated from SFC-UV data.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:35Z (GMT). No. of bitstreams: 4  Brian4.pdf: 3407277 bytes, checksum: 1be3752fefcd34a6aa463e1a56fbb5d1 (MD5)  Brian3.pdf: 947998 bytes, checksum: a5b3c28ac33f9afe3752d886d19fb863 (MD5)  Brian2.pdf: 856467 bytes, checksum: b93fad86d6717a2ca8977612d2542b62 (MD5)  Brian1.pdf: 93248 bytes, checksum: 8789419ff84b12ecd918b2e9b68eb3dc (MD5)    Previous issue date: 2004-05-03",
    "Author Email: bhoffman@vt.edu",
    "Advisor Email: hmcnair@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: long@vt.edu",
    "Advisor Email: wolfe@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11174",
  "identifier_other": "etd-05112004-170001",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112004-170001",
  "identifier_uri": "http://hdl.handle.net/10919/11174",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Brian1.pdf",
    "Brian2.pdf",
    "Brian3.pdf",
    "Brian4.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Mass Spectrometry",
    "Supercritical Fluid Chromatography",
    "Derivatization"
  ],
  "title": "Analysis of Alcohol and Alkylphenol Polyethers via Packed Column Supercritical Fluid Chromatography",
  "type": "Dissertation"
}