{
  "contributor_author": "Tang, Genglin",
  "contributor_committeechair": "Simpson, Roger L.",
  "contributor_committeemember": [
    "Mason, William H.",
    "Devenport, William J.",
    "Ragab, Saad A.",
    "Wang, Joseph J."
  ],
  "contributor_department": "Aerospace and Ocean Engineering",
  "date_accessioned": "2011-08-22T19:01:37Z",
  "date_adate": "2004-05-18",
  "date_available": "2011-08-22T19:01:37Z",
  "date_issued": "2003-09-03",
  "date_rdate": "2004-05-18",
  "date_sdate": "2004-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation presents results from a thorough study of the tip-gap turbulent flow structure in a low-speed linear compressor cascade wind tunnel at Virginia Tech that includes a moving belt system to simulate the relative motion between the tip and the casing. The endwall pressure measurements and the surface oil flow visualizations were made on a stationary endwall to obtain the flow features and to determine the measurement profiles of interest. A custom-made miniature 3-orthogonal-velocity-component fiber-optic laser-Doppler velocimetry (LDV) system was used to measure all three components of velocity within a 50 mm spherical measurement volume within the gap between the endwall and the blade tip, mainly for the stationary wall with 1.65% and 3.30% tip gaps as well as some initial experiments for the moving wall.   Since all of the vorticity in a flow originates from the surfaces under the action of strong pressure gradient, it was very important to measure the nearest-wall flow on the endwall and around the blade tip. The surface skin friction velocity was measured by using viscous sublayer velocity profiles, which verified the presence of an intense lateral shear layer that was observed from surface oil flow visualizations. All second- and third-order turbulence quantities were measured to provide detailed data for any parallel CFD efforts.   The most complete data sets were acquired for 1.65% and 3.30% tip gap/chord ratios in a low-speed linear compressor cascade. This study found that tip gap flows are complex pressure-driven, unsteady three-dimensional turbulent flows. The crossflow velocity normal to the blade chord is nearly uniform in the mid tip-gap and changes substantially from the pressure to suction side. The crossflow velocity relies on the local tip pressure loading that is different from the mid-span pressure loading because of tip leakage vortex influence. The tip gap flow is highly skewed three-dimensional flow throughout the full gap. Normalized circulation within the tip gap is independent of the gap size. The tip gap flow interacts with the primary flow, separates from the endwall, and rolls up on the suction side to form the tip leakage vortex. The tip leakage vortex is unsteady from the observation of the TKE transport vector and oil flow visualizations. The reattachment of tip separation vortex on the pressure side strongly depends on the blade thickness-to-gap height ratio after the origin of tip leakage vortex but is weakly related to it before the origin of tip leakage vortex for a moderate tip gap. Other than the nearest endwall and blade tip regions, the TKE does not vary much in tip gap. The tip leakage vortex produces high turbulence intensities. The tip gap flow correlations of streamwise and wall normal velocity fluctuations decrease significantly from the leading edge to the trailing edge of the blade due to flow skewing. The tip gap flow is a strongly anisotropic turbulent flow. Rapid distortion ideas can not apply to it. A turbulence model based on stress transport equations and experimental data is necessary to reflect the tip gap flow physics. For the moving endwall, relative motion skews the inner region flow and is decorrelated with the outer layer flow. Hence, the TKE and correlations of streamwise and wall normal velocity fluctuations decrease.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:37Z (GMT). No. of bitstreams: 1  Tang.pdf: 40376764 bytes, checksum: 62d59ba5718b343b67c35009e220d5e1 (MD5)    Previous issue date: 2003-09-03",
    "Author Email: getang@vt.edu",
    "Advisor Email: whmason@vt.edu",
    "Advisor Email: simpson@aoe.vt.edu",
    "Advisor Email: wdevenpo@vt.edu",
    "Advisor Email: ragab@vt.edu",
    "Advisor Email: jowang@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11178",
  "identifier_other": "etd-05122004-161722",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05122004-161722",
  "identifier_uri": "http://hdl.handle.net/10919/11178",
  "publisher": "Virginia Tech",
  "relation_haspart": "Tang.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Reynolds stress",
    "triple product",
    "viscous sublayer",
    "compressor cascade",
    "mean velocity",
    "turbulence modeling",
    "flow structure",
    "tip leakage vortex",
    "tip gap flow",
    "laser Doppler velocimetry",
    "relative motion"
  ],
  "title": "Measurements of the Tip-gap Turbulent Flow Structure in a Low-speed Compressor Cascade",
  "type": "Dissertation"
}