{
  "contributor_author": "Beam, Joshua Bart",
  "contributor_committeechair": "Askew, Shawn D.",
  "contributor_committeemember": [
    "Hipkins, Perry Lloyd",
    "Stipes, R. Jay",
    "Westwood, James H.",
    "Ervin, Erik H."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2011-08-22T19:01:36Z",
  "date_adate": "2004-05-13",
  "date_available": "2011-08-22T19:01:36Z",
  "date_issued": "2004-04-27",
  "date_rdate": "2004-05-13",
  "date_sdate": "2004-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Managing turf for high aesthetic value is costly.  Such management usually involves mowing, disease prevention, insect control, and weed control.  Mowing is the most expensive practice on golf courses and annual bluegrass (Poa annua L) is the most challenging weed problem in professional turf.  The plant growth regulators trinexapac-ethyl and paclobutrazol are commonly used in VA for these two costly and challenging jobs.  Prohexadione calcium (PC) is an experimental chemical that inhibits the same enzyme (3ß-hydroxyalase) as trinexapac-ethyl and may selectively suppress annual bluegrass.  Experiments were conducted at the Virginia Tech Turfgrass Research Center and Glade Road Research Facility to determine the PC rate required to reduce clipping biomass of four turfgrass species as effectively as trinexapac-ethyl.  Prohexadione calcium reduced clipping biomass of bermudagrass (Cynodon dactylon (L.) Pers.), Kentucky bluegrass (Poa pratenis L.), perennial ryegrass (Lolium perenne L.), and zoysiagrass (Zoysia japonica Steud.) equivalent to trinexapac-ethyl at 0.70, 0.22, 0.60, and 0.27 kg a.i./ha -1, respectively.  Further experiments conducted at three locations across Virginia determined that PC was comparable to paclobutrazol for annual bluegrass suppression.  Since turfgrass response to PC was different between annual bluegrass, Kentucky bluegrass, and perennial ryegrass, 14C labeled PC was used to assess absorption, translocation, and metabolism of PC between annual and Kentucky bluegrass, creeping bentgrass (Agrostis stolonifera L.), and perennial ryegrass.  Annual and Kentucky bluegrass absorbed more PC than creeping bentgrass or perennial ryegrass and partially explained the selectivity between these species.  Translocation and metabolism of PC did not differ between species.  Our final objective launched experiments characterizing possible resistance to acetolactate synthase (ALS) inhibiting herbicides in annual bluegrass.  Several selective herbicides for annual bluegrass control inhibit ALS.  Since many weeds have developed resistance to ALS-inhibiting herbicides, the ALS gene in annual bluegrass was sequenced and derived amino acid sequences were at least 87% similar to other previously sequenced grass species.  This sequencing data will be used in future experiments to predict the likelihood of ALS resistance in annual bluegrass.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:36Z (GMT). No. of bitstreams: 1  etd.pdf: 574808 bytes, checksum: aeccb7cbb1753e5520b26add63032164 (MD5)    Previous issue date: 2004-04-27",
    "Author Email: jbeam@vt.edu",
    "Advisor Email: lhipkins@vt.edu",
    "Advisor Email: treedr@vt.edu",
    "Advisor Email: saskew@vt.edu",
    "Advisor Email: westwood@vt.edu",
    "Advisor Email: ervin@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11176",
  "identifier_other": "etd-05112004-101527",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112004-101527",
  "identifier_uri": "http://hdl.handle.net/10919/11176",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "radioactive assay",
    "and weed control",
    "turfgrass growth regulation",
    "Gene sequencing"
  ],
  "title": "Prohexadione Calcium for Turfgrass Management and Poa annua Control and Molecular Assessment of the Acetolactate Synthase Gene in Poa annua",
  "type": "Dissertation"
}