{
  "contributor_author": "Takeshita, Chikako",
  "contributor_committeechair": "Luke, Timothy W.",
  "contributor_committeemember": [
    "Halfon, Saul E.",
    "Toal, Gerard",
    "La Berge, Ann F.",
    "Hausman, Bernice L."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2011-08-22T19:01:59Z",
  "date_adate": "2004-05-25",
  "date_available": "2011-08-22T19:01:59Z",
  "date_issued": "2004-04-30",
  "date_rdate": "2007-05-25",
  "date_sdate": "2004-05-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this dissertation, I deconstruct the commonly held assumption that the intrauterine device (IUD) is an unsafe and/or obsolete contraceptive method that has been used mostly to impose population control on women in developing countries.  Simultaneously, I explore the changing meaning of the device over the last 40 years in varying socio-historical contexts.  Capitalizing on the analytical tradition of science and technology studies that regards technology as socially constructed, I analyze the IUD as a technology that transformed through a series of material and discursive negotiations.  Negotiations over the IUD took place in multiple layers, most notably in the social and political domains that defined the meaning of the contraceptive technology, but also in the domain of science, in which claims about the device's technical features and its relationship with the biological body were made.  This work is divided into the examination of four major domains  –  global population politics, American contraceptive market, American antiabortion politics, and scientific research  –  within which the IUD took shape both materially and discursively.  The historical development of the scientific research and discourse of IUDs are juxtaposed with the prevailing socio-political background to illustrate the intricate relationship between scientific research of contraceptive technology and the politics of fertility control.  The final chapter addresses the agency of IUD users, introducing the ways in which women in developing countries have manipulated the IUD to achieve reproductive self-determination.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:59Z (GMT). No. of bitstreams: 1  IUD.pdf: 552783 bytes, checksum: 83cebc3e9e21d36a9885f72a1c9a8356 (MD5)    Previous issue date: 2004-04-30",
    "Author Email: ctakeshita@womst.ucsb.edu",
    "Advisor Email: shalfon@vt.edu",
    "Advisor Email: toalg@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Advisor Email: alaberge@vt.edu",
    "Advisor Email: bhausman@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11182",
  "identifier_other": "etd-05182004-114108",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05182004-114108",
  "identifier_uri": "http://hdl.handle.net/10919/11182",
  "publisher": "Virginia Tech",
  "relation_haspart": "IUD.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Population Council",
    "science and politics",
    "science and culture",
    "reproductive rights",
    "population control"
  ],
  "title": "Negotiating Acceptability of the IUD: Contraceptive Technology, Women's Bodies, and Reproductive Politics",
  "type": "Dissertation"
}