{
  "contributor_author": "Liu, Changhui",
  "contributor_committeechair": "Kingston, David G. I.",
  "contributor_committeemember": [
    "Tanko, James M.",
    "Hanson, Brian E.",
    "Gibson, Harry W.",
    "Gandour, Richard D."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2011-08-22T19:02:11Z",
  "date_adate": "2004-06-01",
  "date_available": "2011-08-22T19:02:11Z",
  "date_issued": "2004-05-10",
  "date_rdate": "2004-06-01",
  "date_sdate": "2004-05-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Taxol (1) was first isolated from the bark of the Pacific yew about 35 years ago by Drs. Wall and Wani. Although its development as an anticancer agent was delayed by numerous reasons, including its scarcity and insolubility, the discovery of its tubulin-assembly activity and other factors motivated oncologists to overcome these problems. It has since become one of the most important current drugs for the treatment of several cancers, including breast and ovarian cancers.   Like almost all anticancer drugs taxol does have some toxic side effects and many tumors also show significant resistance to therapy with taxol. Drug targeting studies aimed at improving its selectivity and efficacy is described. Two targeting methods, the estrogen receptor (ER) directed targeting and colloidal gold (cAu)directed targeting, were used in our research. In this dissertation, a series of estradiol-taxol conjugates (ETCs) were synthesized. They were active in four cytotoxicity assays and tubulin polymerization assay, but less active than taxol. One of them showed the desired selectivity for ER positive cancer cells.   Recently, several studies have attempted to elucidate the bioactive binding conformation of taxol on microtubules. Three models have been proposed for this conformation. The T-taxol conformation was proposed by Dr. Snyder based on electron crystallographic density and molecular modeling. In this dessertation, a series of cyclopropyl-containing taxol analogs and macrocyclic taxol lactones were synthesized. The bioassay results showed they are less active than taxol. The molecular modeling studies suggested that the cyclopropyl-containing taxol analogs could not adopt the T-taxol conformation, which would result in the loss of bioactivities. It is an indirect evidence to support T-taxol conformation. As for macrocyclic taxol lactones, it is proposed that they would have a close contact between the ester moiety on the C-3' phenyl ring and Phe272 of the β-tubulin protein when they adopt T-taxol conformation. It will push the macrocyclics out of the binding pocket and lead to the lost of bioactivities.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:11Z (GMT). No. of bitstreams: 3  thesis.pdf: 44441 bytes, checksum: 343a16d00070dd7057be95c1193ec8cf (MD5)  maintext-1.pdf: 879543 bytes, checksum: a6f4a542d74ae549a47f06b7f19afe21 (MD5)  APPENDIX1.pdf: 918790 bytes, checksum: 286298b963ebff5714f154ee4f607664 (MD5)    Previous issue date: 2004-05-10",
    "Author Email: chliu3@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: hanson@vt.edu",
    "Advisor Email: hwgibson@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: gandour@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11186",
  "identifier_other": "etd-05182004-172743",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05182004-172743",
  "identifier_uri": "http://hdl.handle.net/10919/11186",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "APPENDIX1.pdf",
    "maintext-1.pdf",
    "thesis.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "tubulin-binding conformation",
    "thio-taxol",
    "ER",
    "estradiol",
    "drug targeting",
    "Taxol",
    "cyclopropyl-taxol",
    "T-taxol conformation",
    "macrocyclic taxoids"
  ],
  "title": "Syntheses and Bioactivities of Targeted and Conformationally Restrained Taxol Analogs",
  "type": "Dissertation"
}