{
  "contributor_author": "Tabor, Kimberly Lane",
  "contributor_committeecochair": [
    "Brewster, Carlyle C.",
    "Fell, Richard D."
  ],
  "contributor_committeemember": [
    "Stone, Nicholas D.",
    "Byrd, Jason H.",
    "Mullins, Donald E."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2011-08-22T19:02:12Z",
  "date_adate": "2004-06-04",
  "date_available": "2011-08-22T19:02:12Z",
  "date_issued": "2004-05-11",
  "date_rdate": "2007-06-04",
  "date_sdate": "2004-05-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Forensic entomological field and laboratory studies were conducted to obtain data currently missing or conflicting in the literature.  The first goal of this project was to identify and qualitatively assess the major taxa of forensic importance in southwest Virginia.  Carcasses of the domestic pig, Sus scrofa L., were placed in field conditions and allowed to decompose until they reached the advanced stage of decay.  Over 50 taxa were collected and identified, with Phormia regina, Phaenicia coeruleiviridis, Phaenicia sericata, Calliphora spp., Sarcophaga utilis, Musca domestica, Hydrotaea leucostoma, Stearibia nigriceps, Prochyliza xanthostoma, and Meroplius minutus among the most commonly observed fly species, and Creophilis maxillosus, Platydracus maculosus, Aleochara lata, Oiceoptoma noveboracense, Necrodes surinamensis, and Necrophila americana among the most commonly observed beetle species. The second objective of this study was to analyze successional patterns of taxa collected and identified in the carrion-insect succession studies.  Occurrence matrices were constructed for the successional patterns of insect taxa during 21 sampling intervals in the spring and eight intervals in the summer studies.  Permutation analyses of the occurrence matrices showed that the successional patterns of insect taxa were similar between spring 2001 and 2002 (P = 0.001) and between summer 2001 and 2002 (P = 0.007).  Results indicated that the successional patterns appear to be typical for the seasonal periods. The third objective of this study was to analyze the effects of antemortem ingestion of ethanol by pigs on insect successional patterns and development rates.  Pigs were dosed with a mixture of 95% ethanol and saline.  Blood samples were collected immediately prior to euthanasia.  The carcasses then were placed at an open  field site and allowed to decompose.  Insect samples were collected from carcasses for ten days post-mortem and the collected data were used to develop occurrence matrices.  Permutation analysis to test the null hypothesis of no similarity between successional patterns of taxa from treated and untreated pigs showed that the successional patterns were similar.  Loin meat from the carcasses was used as a rearing medium for field development studies of the black blow fly, Phormia regina. Development rates of 3rd instar P. regina maggots feeding on meat from treated pigs were significantly different from development rates of maggots feeding on meat from untreated pigs.  No significant differences were detected in 1st and 2nd instars. Finally, the effect of relative humidity (RH) on egg hatch time and percent hatch rate of Phormia regina and Phaenicia coeruleiviridis was tested using saturated salt solutions.  The global ANOVA of mean hatch times and percent hatch was found to be significant for P. regina at 20°C and 30°C and P. coerulieviridis at 20°C among RH levels at á = 0.05.  T-test (LSD comparisons) results detected significant differences between some but not all RH levels within all three data series tested.  Percent hatch observed varied widely, depending on the RH level.  Of the levels tested, the lowest RH where hatch rate was observed was 53% (20°C) for P. coeruleiviridis, where only 1% of the eggs hatched.  At 90+% RH, almost all of the eggs hatched for both species.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:12Z (GMT). No. of bitstreams: 1  FinalDissertation.pdf: 1466856 bytes, checksum: b6e8ba9ff9b18aeb2d2b2206af6397cb (MD5)    Previous issue date: 2004-05-11",
    "Author Email: kitabor@vt.edu",
    "Advisor Email: carlyleb@vt.edu",
    "Advisor Email: rfell@vt.edu",
    "Advisor Email: nick.stone@vt.edu",
    "Advisor Email: jhbyrd@forensic-entomology.com",
    "Advisor Email: mullinsd@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11188",
  "identifier_other": "etd-05182004-171852",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05182004-171852",
  "identifier_uri": "http://hdl.handle.net/10919/11188",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalDissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Entomotoxicology",
    "Successional Pattern",
    "Relative Humidity",
    "Forensic Entomology"
  ],
  "title": "Succession and Development Studies on Carrion Insects of Forensic Importance",
  "type": "Dissertation"
}