{
  "contributor_author": "Lichtenberger, Eric",
  "contributor_committeechair": "Eschenmann, Konrad Kurt",
  "contributor_committeemember": [
    "Price, William T. Jr.",
    "Budzisz, Christopher",
    "Stewart, Daisy L.",
    "O'Reilly, Patrick A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2011-08-22T19:01:58Z",
  "date_adate": "2004-05-25",
  "date_available": "2011-08-22T19:01:58Z",
  "date_issued": "2004-05-04",
  "date_rdate": "2007-05-25",
  "date_sdate": "2004-05-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study identified the accuracy with which local career and technical education (CTE) administrators perceive the stereotypes of CTE students, teachers, and programs held by Virginia Department of Education administrators.  In order to measure the aforementioned meta-accuracy: (a) the stereotypes of CTE students, teachers, and programs held by (VDOE) administrators were determined, (b) the meta-stereotypes of local CTE administrators regarding the stereotypes of CTE programs, students, and teachers held by VDOE administrators were established, and (c) the stereotypes and the meta-stereotypes were compared.   Data analyzed revealed that some of the traditional stereotypical descriptors of CTE teachers, students, and programs were held by VDOE administrators.  Some stereotypes of note were: (a) CTE students do not plan to go to college, (b) CTE students are good with concrete concepts, (c) CTE students enjoy nonacademic classes more than academic ones, (d) CTE students are not from middle to upper socioeconomic class, (e) CTE teachers have lots of on-the-job experience, and (f) CTE programs are isolated from the rest of the school.   Local CTE administrators possessed meta-stereotypes that indicated that VDOE administrators would stereotype CTE students as: (a) not being leaders in school, (b) not having college-educated parents, (c) being motivated by material rewards, (d) enjoying nonacademic classes more than academic ones, (e) being easily influenced by peers, and (f) not being from middle to upper socio-economic class. Local CTE administrators had meta-stereotypes that indicated VDOE administrators would stereotype CTE teachers as: (a) being more of a practitioner than a theorist, (b) being good with concrete concepts, and (c) not possessing masterâ  s degrees.  Local CTE administrators had meta-stereotypes that indicated VDOE administrators would stereotype CTE programs as: (a) being a good return on investment, (b) providing for the education of the whole person, (c) being beneficial to all students, (d) being expensive to maintain, (e) having enrollment typically of students from blue-collar or agriculture background, and (f) being for students who work better with their hands. Local CTE administrators were accurately able to predict the way VDOE administrators would respond to the statements depicting stereotypes of CTE students, teachers, and programs for 45 of the 62 items.  Conversely, they were not able to accurately predict 17 out of the 62 statements. Overall, the accuracy of the meta-stereotypes (meta-accuracy) of local CTE administrators varied depending upon what was being measured.  The meta-accuracy in relation to CTE teachers was highest (11 out of the 12 items) and the meta-accuracy was lowest in relation to CTE programs (10 out of 17 items).  In relation to CTE students, local CTE administrators were accurate in predicting 24 out of the 33 items.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:01:58Z (GMT). No. of bitstreams: 1  Lichtenberger.pdf: 1516176 bytes, checksum: 457a7ba492bcc5664aa92f4992f4def0 (MD5)    Previous issue date: 2004-05-04",
    "Author Email: elichten@vt.edu",
    "Advisor Email: wprice@vt.edu",
    "Advisor Email: cbudzisz@loras.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Advisor Email: oreilly@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11180",
  "identifier_other": "etd-05192004-094019",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05192004-094019",
  "identifier_uri": "http://hdl.handle.net/10919/11180",
  "publisher": "Virginia Tech",
  "relation_haspart": "Lichtenberger.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "career and technical education",
    "meta-accuracy",
    "metastereotypes",
    "meta-stereotypes",
    "Stereotypes",
    "vocational education"
  ],
  "title": "The Accuracy of Meta-Stereotypes Applied to Career and Technical Education.",
  "type": "Dissertation"
}