{
  "contributor_author": "Wynn, Theresa M.",
  "contributor_committeechair": "Mostaghimi, Saied",
  "contributor_committeemember": [
    "Heatwole, Conrad D.",
    "Diplas, Panayiotis",
    "Burger, James A.",
    "Dillaha, Theo A. III"
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2011-08-22T19:02:24Z",
  "date_adate": "2004-06-17",
  "date_available": "2011-08-22T19:02:24Z",
  "date_issued": "2004-05-24",
  "date_rdate": "2004-06-17",
  "date_sdate": "2004-05-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Riparian buffers are promoted for water quality improvement, habitat restoration, and stream bank stabilization.  While considerable research has been conducted on the effects of riparian buffers on water quality and aquatic habitat, little is known about the influence of riparian vegetation on stream bank erosion.  The overall goal of this research was to evaluate the effects of woody and herbaceous riparian buffers on stream bank erosion.  This goal was addressed by measuring the erodibility and critical shear stress of rooted bank soils in situ using a submerged jet test device.  Additionally, several soil, vegetation, and stream chemistry factors that could potentially impact the fluvial entrainment of soils were measured. A total of 25 field sites in the Blacksburg, Virginia area were tested.  Each field site consisted of a 2nd-4th order stream with a relatively homogeneous vegetated riparian buffer over a 30 m reach.  Riparian vegetation ranged from short turfgrass to mature riparian forest.  Multiple linear regression analysis was conducted to determine those factors that most influence stream bank erodibility and the relative impact of riparian vegetation.   Results of this research indicated woody riparian vegetation reduced the susceptibility of stream bank soils to erosion by fluvial entrainment.  Riparian forests had a greater density of larger diameter roots, particularly at the bank toe where the hydraulic stresses are the greatest.  These larger roots (diameters > 0.5 mm) provided more resistance to erosion than the very fine roots of herbaceous plants.  Due to limitations in the root sampling methodology, these results are primarily applicable to steep banks with little herbaceous vegetation on the bank face, such as those found on the outside of meander bends.   In addition to reinforcing the stream banks, riparian vegetation also affected soil moisture and altered the local microclimate.  While summer soil desiccation was reduced under deciduous riparian forests, as compared to herbaceous vegetation, winter freeze-thaw cycling was greater.  As a result, in silty soils that were susceptible to freeze-thaw cycling, the beneficial effects of root reinforcement by woody vegetation were offset by increased freeze-thaw cycling.  Using the study results in an example application, it was shown that converting a predominately herbaceous riparian buffer to a forested buffer could reduce soil erodibility by as much as 39% in soils with low silt contents.  Conversely, for a stream composed primarily of silt soils that are prone to freeze-thaw cycling, afforestation could lead to localized increases in soil erodibility of as much as 38%.  It should be emphasized that the riparian forests in this study were deciduous;  similar results would not be expected under coniferous forests that maintain a dense canopy throughout the year.  Additionally, because dense herbaceous vegetation would likely not develop in the outside of meander bends where hydraulic shear stresses are greatest, the reductions in soil erodibility afforded by the herbaceous vegetation would be limited to areas of low shear stress, such as on gently sloping banks along the inside of meander bends.  As the first testing of this type, this study provided quantitative information on the effects of vegetation on subaerial processes and stream bank erosion.  It also represents the first measurements of the soil erosion parameters, soil erodibility and critical shear stress, for vegetated stream banks.  These parameters are crucial for modeling the effects of riparian vegetation for stream restoration design and for water quality simulation modeling.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:24Z (GMT). No. of bitstreams: 7  Chapters5-6.pdf: 1151706 bytes, checksum: 81e028c8309bc135c19a85b4ece38e70 (MD5)  Chapters3-4.pdf: 2119943 bytes, checksum: d2e2892f1493fcf3cfa66576998852ae (MD5)  Chapters1-2.pdf: 521263 bytes, checksum: 29e5a9d06c1478260d7c42a75a613754 (MD5)  AppendixH.pdf: 1307066 bytes, checksum: 887cef885074545c651295dfb1368102 (MD5)  AppendicesE-G.pdf: 1677795 bytes, checksum: 016b66e1bd3333005f383fb29570a6e5 (MD5)  AppendicesC-D.pdf: 63657 bytes, checksum: 5c6d97523d8466789af2b6f0d593cc07 (MD5)  AppendicesA-B.pdf: 3002716 bytes, checksum: da1a27a6d90afff1e043587d1fd67c79 (MD5)    Previous issue date: 2004-05-24",
    "Author Email: tesswynn@vt.edu",
    "Advisor Email: heatwole@vt.edu",
    "Advisor Email: pdiplas@vt.edu",
    "Advisor Email: jaburger@vt.edu",
    "Advisor Email: smostagh@vt.edu",
    "Advisor Email: dillaha@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11191",
  "identifier_other": "etd-05282004-115640",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05282004-115640",
  "identifier_uri": "http://hdl.handle.net/10919/11191",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapters1-2.pdf",
    "AppendixH.pdf",
    "AppendicesA-B.pdf",
    "AppendicesC-D.pdf",
    "AppendicesE-G.pdf",
    "Chapters3-4.pdf",
    "Chapters5-6.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "root length density",
    "erodibility",
    "critical shear stress",
    "subaerial processes",
    "submerged jet test device",
    "desiccation cracking",
    "freeze-thaw cycling",
    "stream bank erosion",
    "riparian buffer"
  ],
  "title": "The Effects of Vegetation on Stream Bank Erosion",
  "type": "Dissertation"
}