{
  "contributor_author": "Komai, Mana",
  "contributor_committeechair": "Eckel, Catherine C.",
  "contributor_committeemember": "Lutz, Nancy A.",
  "contributor_department": "Economics",
  "date_accessioned": "2011-08-22T19:02:25Z",
  "date_adate": "2004-06-30",
  "date_available": "2011-08-22T19:02:25Z",
  "date_issued": "2003-12-05",
  "date_rdate": "2007-06-30",
  "date_sdate": "2004-06-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation develops an economic theory of leadership based on assignment of information. Common theories assume that organizations exist to reduce transaction costs by replacing imperfect markets with incomplete long term contracts that give managers the power to command subordinates. This view reverses all of these premises: I study an organization in which it is costless to transmit and process information, contracts exist in the backgound if at all, and agents are not bound to the organization. The organization is held together by economies of scale in generating information and by the advantages of controlling access to that information. The minimalist model of organizations produces a minimalist theory of leadership: leaders have no special talent but are leaders simply because they are given exclusive access to certain information. A single leader induces a first best outcome if his incentives are aligned with his subordinates. If a single leader is not credible, then diluting the power of leadership by appointing multiple informed leaders can ensure credibility and improve e.ciency but can not produce the first best. If agents are di.erentiated by their costs of cooperation the most cooperative player is not necessarily the best leader. In this scenario, the ability of the group to sustain fully cooperative outcomes may depend on the player with the least propensity to cooperate. Therefore, to maximize e.ciency (i.e., to maximize the range of circumstances in which e.cient cooperation is sustainable), the group should sometimes promote less cooperative people. Here, \"less cooperative\" means lazy or busy rather than disagreeable. This dissertation also applies the idea of leadership (endorsement) to voluntary provision of public goods. I show that when the leader is unable to fully reveal his information expected contributions, ex-ante, are unambigeously higher in the leader-follower setting. That is partial revelation of information induces more contribution compared to full revelation or complete information. I also show that if the utility functions are linear then ex-ante welfare is unambigeously higher in the presence of an informed endorser.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:25Z (GMT). No. of bitstreams: 1  komaithesis.pdf: 617776 bytes, checksum: 10f68c897fee7adde1a342c377fb8df1 (MD5)    Previous issue date: 2003-12-05",
    "Author Email: mkomai@vt.edu",
    "Advisor Email: eckelc@vt.edu",
    "Advisor Email: nlutz@vt.edu, haller@vt.edu, ashleyr@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11194",
  "identifier_other": "etd-06162004-123403",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06162004-123403",
  "identifier_uri": "http://hdl.handle.net/10919/11194",
  "publisher": "Virginia Tech",
  "relation_haspart": "komaithesis.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Efficiency",
    "Organization",
    "Power",
    "Leadership",
    "Information"
  ],
  "title": "An Economic Theory of Leadership",
  "type": "Dissertation"
}