{
  "contributor_author": "Crabtree, Aaron Dwight",
  "contributor_committeechair": "Maher, John J.",
  "contributor_committeemember": [
    "Brown, Robert M.",
    "Brozovsky, John A.",
    "Kumar, Raman",
    "Richardson, Frederick M."
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2011-08-22T19:02:26Z",
  "date_adate": "2004-07-06",
  "date_available": "2011-08-22T19:02:26Z",
  "date_issued": "2003-01-29",
  "date_rdate": "2004-07-06",
  "date_sdate": "2004-06-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation explores three current issues relevant to the accounting and business communities by empirically examining the effect these issues have on the bond credit market. The first study examines the effect earnings predictability has on both the initial bond rating and the initial pricing of the issue. Earnings predictability is measured as (1) the annual earnings surprise (actual minus analyst forecast) and (2) the dispersion of initial analyst forecasts. The results indicate a negative association between a lack of earnings predictability and both bond ratings and initial bond price. The results are consistent with creditors interpreting greater earnings variability as a dimension of default risk incremental to the benchmark model. These results add to the existing literature by documenting a favorable benefit in the credit arena for firms that have predictable earnings. The second study investigates the effect perceived auditor independence has on the rating assigned to newly issued bonds. The magnitude of non-audit service fees is utilized as a proxy for auditor independence. The results of the study document a consistent negative relationship between the level of non-audit fees provided by the external auditor and the bond rating received by the client for new issues. Several non-audit fee measures are used in the study (raw measure, log scaled, asset scaled, unexpected) and each possess a significant negative association with a firmâ  s bond rating. Importantly, no economic effect was discernable in a classification accuracy analysis.  The third study examines what effect, if any, longer auditor tenure has on the clientâ  s bond rating. There is some contention that longer auditor tenure can lead to substandard audits either through the auditorâ  s excessive desire to retain the client or through general auditor complacency. However, the issue of auditor tenure is far from one-sided. An alternative view asserts that longer auditor tenure increases client-specific knowledge and, thus, results in increased audit quality. Results indicate a positive association between auditor tenure and the clientâ  s bond rating on new issues suggesting that longer auditor tenure is perceived to be beneficial by bond rating analysts. This is consistent with financial statement users perceiving longer tenured auditors to have more client specific knowledge thus increasing auditor competency and a better audit. Overall, these results contribute to the existing knowledge-base in accounting by empirically demonstrating how several important issues of interest to the accounting profession are impounded into a firmâ  s bond rating. This research provides a detailed look at how one important group of knowledgeable financial statement users, i.e. bond rating analysts, incorporate several issues that are relevant and important to the professional community.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:26Z (GMT). No. of bitstreams: 1  CrabtreeDissertation.pdf: 419658 bytes, checksum: ceb51a0ee1a422e5f0c34e9679919db4 (MD5)    Previous issue date: 2003-01-29",
    "Author Email: acrabtre@vt.edu",
    "Advisor Email: moren@vt.edu",
    "Advisor Email: jbrozovs@vt.edu",
    "Advisor Email: rkumar@vt.edu",
    "Advisor Email: frich@vt.edu",
    "Advisor Email: jmaher@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11198",
  "identifier_other": "etd-06232004-151830",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06232004-151830",
  "identifier_uri": "http://hdl.handle.net/10919/11198",
  "publisher": "Virginia Tech",
  "relation_haspart": "CrabtreeDissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Bond Ratings",
    "Auditor Independence",
    "Earnings Surprise",
    "Bond Yields"
  ],
  "title": "An Empirical Investigation of the Effects of Earnings Predictability and Auditor-Client Relationships on the Bond Credit Market",
  "type": "Dissertation"
}