{
  "contributor_author": "Perugini, Saverio",
  "contributor_committeechair": "Ramakrishnan, Naren",
  "contributor_committeemember": [
    "Abbott, A. Lynn",
    "Rosson, Mary Beth",
    "Pérez-Quiñones, Manuel A.",
    "Fox, Edward Alan"
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2011-08-22T19:02:26Z",
  "date_adate": "2004-07-01",
  "date_available": "2011-08-22T19:02:26Z",
  "date_issued": "2004-05-28",
  "date_rdate": "2004-07-01",
  "date_sdate": "2004-06-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Personalization constitutes the mechanisms and technologies necessary to customize information access to the end-user. It can be defined as the automatic adjustment of information content, structure, and presentation.  The central thesis of this dissertation is that modeling interaction explicitly in a representation, and studying how partial information can be harnessed in it by program transformations to direct the flow of the interaction, can provide insight into, reveal opportunities for, and define a model for personalized interaction.  To evaluate this thesis, a formal modeling methodology is developed for personalizing interactions with information systems, especially hierarchical hypermedia, based on program transformations.  The predominant form of personalized interaction developed in this thesis is out-of-turn interaction, a technique which empowers the user to take the initiative in a user--system dialog by providing unsolicited, but relevant, information out-of-turn.  Out-of-turn interaction helps flexibly bridge any mismatch between the user's model of information seeking and the system's hardwired hyperlink structure in a manner fundamentally different from extant solutions, such as multiple faceted browsing classifications and search tools.  This capability is showcased through two interaction interfaces using alternate modalities to capture and communicate out-of-turn information to the underlying system: a toolbar embedded into a traditional browser for out-of-turn textual input and voice-enabled content pages for out-of-turn speech input.  The specific research issues addressed involve identifying and developing representations and transformations suitable for general classes of hierarchical hypermedia, providing supplemental interactions for improving the personalized experience, and studying user's (out-of-turn) interactions with resulting systems.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:26Z (GMT). No. of bitstreams: 1  thesis-sperugin.pdf: 2978784 bytes, checksum: b4cb7777b19dceaf3ae5767165ea30bc (MD5)    Previous issue date: 2004-05-28",
    "Author Email: sperugin@cs.vt.edu",
    "Advisor Email: abbott@vt.edu",
    "Advisor Email: mrosson@psu.edu",
    "Advisor Email: perez@cs.vt.edu",
    "Advisor Email: naren@cs.vt.edu",
    "Advisor Email: fox@cs.vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11196",
  "identifier_other": "etd-06252004-162449",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06252004-162449",
  "identifier_uri": "http://hdl.handle.net/10919/11196",
  "publisher": "Virginia Tech",
  "relation_haspart": "thesis-sperugin.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Hierarchical Hypermedia",
    "Information Retrieval",
    "Out-of-turn Interaction",
    "Personalization",
    "Program Transformations",
    "Partial Evaluation",
    "Program Slicing",
    "Web Mining",
    "Web Modeling"
  ],
  "title": "Program Transformations for Information Personalization",
  "type": "Dissertation"
}