{
  "contributor_author": "Ahn, Mira",
  "contributor_committeechair": "Goss, Rosemary Carucci",
  "contributor_committeemember": [
    "Meszaros, Peggy S.",
    "Parrott, Kathleen R.",
    "Emmel, JoAnn",
    "Beamish, Julia O."
  ],
  "contributor_department": "Housing, Interior Design and Resource Management",
  "date_accessioned": "2011-08-22T19:02:12Z",
  "date_adate": "2004-06-08",
  "date_available": "2011-08-22T19:02:12Z",
  "date_issued": "2004-02-09",
  "date_rdate": "2004-06-08",
  "date_sdate": "2004-05-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Recently, technology and its impact on aging has become an expanding field of inquiry among marketers, designers, and housing professionals. A major reason for this interest is that the use of technology can help older people who experience deteriorating health to live independently. Another reason stems from an increase in the elderly population. The purpose of this study was to investigate older people's attitudes toward adopting technology as it relates to homes that could improve the quality of life and assist in aging in place. Attitudes were examined in terms of perception and acceptance of residential technology. Data for this study were gathered by an online survey. Online questionnaires were distributed to the potential sample of 9,789 e-mail addresses through the Virginia Tech alumni list serve on February 2004. The response rate was 15.8% with 1,546 eligible responses returned by February 27. The majority of the sample for this study can be described as Caucasian, married men, age 55 to 64 with good or excellent health and a post graduate college education living in owned single-family detached homes. Chi-square, ANOVA, Pearson's correlations, and path analysis were employed to test hypothesized relationships. Nine hypotheses were proposed to examine the relationships of variables based on the research framework. Results from this study cannot be generalized to a national population because of the limitations of the sampling frame. Results, however, are significant in terms of the investigation of early computer adopters who are age 55 and older living independently. Their desire to age in place was not very different from the national population. Findings about the attitudes toward computer and Internet technology indicated that respondents had surprisingly similar attitudes. Age was revealed as an important factor for both the desire to age in place and attitudes toward residential technology as a direct effect. Future research should include people with various demographic backgrounds. In addition, the results of this study imply that differentiated marketing strategies should be recommended to reach older consumers.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:12Z (GMT). No. of bitstreams: 1  MIRA_AHN.pdf: 1454763 bytes, checksum: 7d5ea50dc3264b63bc3920d494126f94 (MD5)    Previous issue date: 2004-02-09",
    "Author Email: mahn@vt.edu",
    "Advisor Email: rgoss@vt.edu",
    "Advisor Email: meszaros@vt.edu",
    "Advisor Email: homes@vt.edu",
    "Advisor Email: jemmel@vt.edu",
    "Advisor Email: jbeamish@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11190",
  "identifier_other": "etd-05262004-213623",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05262004-213623",
  "identifier_uri": "http://hdl.handle.net/10919/11190",
  "publisher": "Virginia Tech",
  "relation_haspart": "MIRA_AHN.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "elderly population",
    "residential technology",
    "diffusion of innovations",
    "age in place",
    "online surveys"
  ],
  "title": "Older People's Attitudes toward Residential Technology: The Role of Technology in Aging in Place",
  "type": "Dissertation"
}