{
  "contributor_author": "Eisenbies, Mark Hale",
  "contributor_committeechair": "Burger, James A.",
  "contributor_committeemember": [
    "Aust, Wallace Michael",
    "Fox, Thomas R.",
    "Prisley, Stephen P.",
    "Galbraith, John M."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2011-08-22T19:02:28Z",
  "date_adate": "2004-07-12",
  "date_available": "2011-08-22T19:02:28Z",
  "date_issued": "2004-06-21",
  "date_rdate": "2004-07-12",
  "date_sdate": "2004-07-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Intensively managed forests of the Southern United States are among the most important sources of wood fiber and timber in this country.  There is a great deal of concern that disturbances associated with trafficking by heavy machinery might diminish long-term soil-site productivity.  However, determining the effect of harvesting disturbance and silvicultural treatments on the long-term productivity of pine plantations is difficult because, in addition to harvesting effects, growth distributions are affected by changes in climate, silviculture, and genetics.  The primary objectives of this study were to determine (1) whether logging disturbances under operationally realistic circumstances affect soil quality, hydrologic function, and loblolly pine (Pinus taeda L.) productivity on wet pine flats, and (2) whether intensive forest management practices mitigate disturbance effects if they exist.  Three 20-ha loblolly pine plantations located on wet pine flats in South Carolina were subjected to combinations of wet- and dry-weather harvesting and mechanical site preparations.  Changes in soil-site productivity after five years were evaluated using a new rank method.  The key advantage of the rank change method is that it is largely independent of the confounding factors (e.g. genetics, silvicultural practices, and climate) that affect comparisons of tree growth and soil quality between growth cycles.  After five years, loblolly pine site indexes (base age 25) ranged between 13 and 33 m, and production ranged between 0.5 and 95 Mg ha-1.  Soil bulk densities increased from 1.15 to as high as 1.44 g cm-3 after harvesting; by age 7 years it had decreased to approximately 1.25 g cm-3.  At the sub-stand scale (0.008 ha), visually assessed soil physical and harvesting residue disturbances had little influence on relative changes in soil-site productivity after five years.  Factors that specifically reflect site drainage were the most influential on changes in productivity.  At the operational scale (3.3 ha), there were no differences between wet- and dry- harvested sites as long as bedding was applied as a site treatment.  These results indicate that when standard site preparation is employed, fertile, wet pine flats such as these are resilient in that they recover from severe, but operationally realistic, harvesting disturbances.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:28Z (GMT). No. of bitstreams: 2 FrontMatter.pdf: 11147 bytes, checksum: ef39971bfcb3058b1d251989dd605399 (MD5) Body.pdf: 3284251 bytes, checksum: f9b1debd90d2f973e049767221a2771b (MD5)   Previous issue date: 2004-06-21",
    "Author Email: meisenbi@vt.edu",
    "Advisor Email: waust@vt.edu",
    "Advisor Email: trfox@vt.edu",
    "Advisor Email: prisley@vt.edu",
    "Advisor Email: ttcf@vt.edu",
    "Advisor Email: jaburger@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11203",
  "identifier_other": "etd-07012004-140400",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07012004-140400",
  "identifier_uri": "http://hdl.handle.net/10919/11203",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "FrontMatter.pdf",
    "Body.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "forest harvesting",
    "best management practices",
    "soil quality",
    "site preparation",
    "site quality",
    "long term productivity",
    "bioassays"
  ],
  "title": "Loblolly Pine and Soil-Site Responses to Harvesting Disturbance and Site Preparation at Stand Closure",
  "type": "Dissertation"
}