{
  "contributor_author": "Slotta, Tracey Ann Bodo",
  "contributor_committeechair": "Porter, Duncan M.",
  "contributor_committeemember": [
    "Opell, Brent D.",
    "Jones, Robert H.",
    "Winkel, Brenda S. J.",
    "Small, Randall"
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2011-08-22T19:02:28Z",
  "date_adate": "2004-07-15",
  "date_available": "2011-08-22T19:02:28Z",
  "date_issued": "2004-07-01",
  "date_rdate": "2004-07-15",
  "date_sdate": "2004-07-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Malacothamnus alliance consists of three genera, Iliamna, Malacothamnus, and  Phymosia.  The genera are considered taxonomically complex since hybridization freely occurs, polyploidy levels vary, and there is a lack of distinct morphological characters to  delineate taxa.  Several taxonomic treatments have been prepared for each genus, but relationships within the genera and the relationship of the Malacothamnus alliance to others in  the Malvaceae remains unknown. This multifaceted study aimed to (a) examine the monophyly of the Malacothamnus alliance and its position in the Malvaceae, (b) determine  the relationships between genera in the alliance, (c) compare variation of nuclear and chloroplast genes in the alliance, (d) prepare revised taxonomic treatments for Iliamna and  Malacothamnus, and (e) examine the probability of successful hybridization in Iliamna.   The monophyly of the Malacothamnus alliance was not confirmed using DNA sequences of both nuclear and chloroplast regions.  In Iliamna, little sequence variation was  detected among taxa in the Rocky Mountains; however, the nuclear and chloroplast regions conflicted with regard to the relationships of the western and eastern taxa.  An ancestral copy  of the chloroplast genome is shared between the two eastern U.S. Iliamna species and Phymosia (Bahamas and Mexico).  The nuclear ITS sequences indicated the western U.S.  Iliamna species were more closely related to Phymosia and Malacothamnus than to other species in Iliamna.  Neither data set provided sufficient variation to resolve relationships of species in Malacothamnus.   Genetic variation and the feasibility of hybridization in Iliamna supported the results  of the broader phylogenetic studies.  Iliamna corei and I. remota are recently derived from I. rivularis.  Hybrid offspring of I. corei and I. remota had higher viability and fecundity than  did hybrids between crosses of either species and I. rivularis.  The Virginia populations of I. corei and I. remota are more genetically similar than either is to Illinois populations of I.  remota.  However, the species are morphologically distinct and can easily be distinguished from others in the genus.  Revised taxonomic treatments for Iliamna and Malacothamnus  based on surveys of herbarium material are presented.  Taxonomic revisions include the new combinations of Iliamna grandiflora subsp. grandiflora and I. grandiflora supsp. crandallii  and the resurrection of Malacothamnus hallii and M. orbiculatus.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:28Z (GMT). No. of bitstreams: 1  TBSdiss.pdf: 8718010 bytes, checksum: f695158f8b14fd78daa00a1b584422a9 (MD5)    Previous issue date: 2004-07-01",
    "Author Email: tslotta@vt.edu",
    "Advisor Email: bopell@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: duporter@vt.edu",
    "Advisor Email: winkel@vt.edu",
    "Advisor Email: rsmall@utk.edu"
  ],
  "format_medium": "ETD",
  "handle": "11204",
  "identifier_other": "etd-07052004-222328",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07052004-222328",
  "identifier_uri": "http://hdl.handle.net/10919/11204",
  "publisher": "Virginia Tech",
  "relation_haspart": "TBSdiss.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Malvaceae",
    "Iliamna",
    "Malacothamnus",
    "Phymosia",
    "ITS",
    "trnL-F",
    "rpL16",
    "hybridization",
    "GBSSI-1",
    "and taxonomic revision",
    "ISSR"
  ],
  "title": "Phylogenetics of the Malacothamnus alliance (Malvaceae): Assessing the role of hybridization and molecular and morphological variation in species delineation",
  "type": "Dissertation"
}