{
  "contributor_author": "Dougherty, Mark",
  "contributor_committeechair": "Dymond, Randel L.",
  "contributor_committeemember": [
    "Grizzard, Thomas J.",
    "Godrej, Adil N.",
    "Zipper, Carl E.",
    "Randolph, John"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2011-08-22T19:02:27Z",
  "date_adate": "2004-07-07",
  "date_available": "2011-08-22T19:02:27Z",
  "date_issued": "2004-06-03",
  "date_rdate": "2004-07-07",
  "date_sdate": "2004-05-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Long-term hydrologic and nonpoint source (NPS) pollutant response is quantified for four headwater basins of the Occoquan River in northern Virginia using 24 years of observed rainfall, basin discharge, water chemistry, and derived land use/land cover (LULC) data.  Long-term summaries document that several hydrologic and NPS pollutant delivery characteristics in the urbanizing Cub Run basin are significantly different from adjacent non-urban basins.  Higher annual NPS fluxes of total suspended solids (TSS), phosphorus (P), and nitrogen (N) in Cub Run are identified with periods of increased soil disturbance from urban land development and significantly increased storm volumes resulting from higher mean impervious cover.  Long-term summaries of nutrient flux are consistent with literature documenting increased ratios of particulate to soluble nutrients with increased discharge.  Storm fluxes of NPS particulate P, soluble P, particulate N, and soluble N make up 92, 67, 89, and 50 percent, respectively, of total NPS nutrient fluxes from all headwater basins, with between 88 and 98 percent of mean annual TSS fluxes delivered by storm flow.  Higher sediment and nutrient fluxes observed in Cub Run basin during the summer and fall growing season after 1983 demonstrate the impact of replacing vegetated cover with urban impervious surface (IS).   Annual regression models indicate that mean IS above 10 percent and precipitation are significantly associated with total basin discharge (r2=0.65).  The positive association of annual storm soluble phosphorus flux with cumulative mean IS suggests the need for continued evaluation of urban NPS soluble phosphorus strategies.  Urban soil disturbance is indicated by measuring the annual change in mean IS (delta IS).  Regression models show that urban soil disturbance is a significant source of TSS flux in all seasons.  Long-term total soluble phosphorus and nitrogen fluxes are significantly and positively associated with precipitation, delta IS, and agricultural land use (r2=0.50 and 0.58, respectively).  The significant impact of urbanization on hydrologic and NPS pollutant flux, especially during the growing season, is a major finding of this study.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:27Z (GMT). No. of bitstreams: 6  090_Vita.pdf: 63616 bytes, checksum: 6b191d51f41bef1e0a1f5f955bb4c6a3 (MD5)  080_Appendix.pdf: 11311017 bytes, checksum: 3ef33821a2fde09828ddd2f978b11dc6 (MD5)  057_Chp5-7.pdf: 849966 bytes, checksum: fcf1e7f715a537d993019514fd8fa75d (MD5)  034_Chp3-4.pdf: 996441 bytes, checksum: ae4e4737b045f1b2bbed8973a3cc6923 (MD5)  012_Chp1-2.pdf: 5302967 bytes, checksum: 02c5b2263a305c8d782e53a887b8db26 (MD5)  000_FrontMatter.pdf: 209788 bytes, checksum: d625053afe11421c06f2f87c61db09cf (MD5)    Previous issue date: 2004-06-03",
    "Author Email: mdougher@vt.edu",
    "Advisor Email: dymond@vt.edu",
    "Advisor Email: tgrizzar@vt.edu",
    "Advisor Email: agodrej@vt.edu",
    "Advisor Email: czip@vt.edu",
    "Advisor Email: energy@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11200",
  "identifier_other": "etd-05242004-085649",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05242004-085649",
  "identifier_uri": "http://hdl.handle.net/10919/11200",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "080_Appendix.pdf",
    "012_Chp1-2.pdf",
    "057_Chp5-7.pdf",
    "000_FrontMatter.pdf",
    "090_Vita.pdf",
    "034_Chp3-4.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "diffuse pollution",
    "land use change",
    "stormwater management",
    "remote sensing",
    "historic mapping"
  ],
  "title": "Quantifying Long-Term Hydrologic and NPS Pollutant Response in an Urbanizing Watershed",
  "type": "Dissertation"
}