{
  "contributor_author": "Broyles, Thomas W.",
  "contributor_committeechair": "Burke, Stanley S.",
  "contributor_committeemember": [
    "Hillison, John H.",
    "Stewart, Daisy L.",
    "Anderson, Glenn A.",
    "Duncan, Dennis W."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2011-08-22T19:02:29Z",
  "date_adate": "2004-07-21",
  "date_available": "2011-08-22T19:02:29Z",
  "date_issued": "2004-07-06",
  "date_rdate": "2004-07-21",
  "date_sdate": "2004-07-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Agricultural education has changed its curriculum, its focus, and its mission. The early days of agricultural education prepared pupils to enter the workforce by training for specific jobs. The emphasis in agricultural education has shifted to the integration of academics with career and technical education. This paradigm shift is called agriscience. The concept of agriscience is delivered utilizing classroom teaching, supervised agricultural experiences, and laboratory learning. Facilities are the linking point from classroom instruction to problem solving and hands-on experience. Facilities must be furnished with equipment and modules that are highly correlated with the curriculum being implemented. Laboratory experiences must be modernized to reflect the integration of academics with agricultural education. A facility problem being encountered is that agricultural educators do not know the essential components needed for a functional agriscience facility. The purpose of this study was to ascertain essential components needed for a functional agriscience course taught in Virginia entitled Biological Applications in Agriculture. Specific objectives of the investigation were to determine the essential agriscience laboratory and classroom components needed to implement the Virginia course entitled Biological Applications in Agriculture. Identifying essential components of a functional agriscience facility was achieved using the modified Delphi methodology. The panel for this investigation was comprised of 17 adult individuals representing three constituency groups. The groups were categorized as agricultural educators, local school administrators, and career and technical education directors. The respondents completed questionnaires spread over two rounds. The Round I included an initial list of 49 pieces of equipment and components from similar courses taught in Georgia, North Carolina, and New York. The expert panel added an additional 41 pieces of equipment and components to the Round I questionnaire. The Round II questionnaire sought to obtain consensus of the list of essential equipment and components for an agriscience laboratory and classroom. The expert panel reached a consensus on the 90 items essential to implementing the course Biological Applications in Agriculture.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:29Z (GMT). No. of bitstreams: 2  irb.pdf: 21245 bytes, checksum: eb4dafea6ad0efe25f1daedae795dfc4 (MD5)  01facilitiesforaged.pdf: 423993 bytes, checksum: 13e9554b72942af288dd7c16dfe134de (MD5)    Previous issue date: 2004-07-06",
    "Author Email: tbroyles@vt.edu",
    "Advisor Email: hillison@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: burkesr@vt.edu",
    "Advisor Email: ganderso@pen.k12.va.us",
    "Advisor Email: duncand@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11207",
  "identifier_other": "etd-07022004-162749",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07022004-162749",
  "identifier_uri": "http://hdl.handle.net/10919/11207",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01facilitiesforaged.pdf",
    "irb.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "facilities",
    "agricultural education"
  ],
  "title": "Curriculum and Facilities for Agricultural Education: An Agriscience Approach",
  "type": "Dissertation"
}