{
  "contributor_author": "Chatterjee, Prateep",
  "contributor_committeechair": "Vandsburger, Uri",
  "contributor_committeemember": [
    "Saunders, William R.",
    "Tafti, Danesh K.",
    "Godfrey, Andrew G.",
    "West, Robert L. Jr.",
    "Baumann, William T."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2011-08-22T19:02:29Z",
  "date_adate": "2004-07-26",
  "date_available": "2011-08-22T19:02:29Z",
  "date_issued": "2004-07-06",
  "date_rdate": "2004-07-26",
  "date_sdate": "2004-07-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Lean premixed combustors have been designed to lower NOx and other pollutant levels in land based gas turbines. These combustors are often susceptible to thermo-acoustic instabilities, which manifest as pressure and heat release oscillations in the combustor. To be able to predict and control these instabilities, it is required that both the acoustics of the system, and a frequency-resolved response of the combustion process to incoming perturbations be understood. Currently, a system-level approach is being used widely to predict the thermoacoustic instabilities. This approach requires simple, yet accurate models which would describe the behavior of each dynamic block within the loop. The present study is directed toward using computational fluid dynamics (CFD) as a tool in developing reduced order models for the dynamics of laminar flat flames and swirl stabilized turbulent flames. A finite-volume based approach is being used to simulate reacting flows in both laminar and turbulent combustors. The study has been divided into three parts -- the first part involves the modeling of a self-excited combustor (the acoustics of the combustor are coupled with the unsteady heat release); the second part of the research aims to study the effect of velocity perturbations on the unsteady heat release rate from a burner stabilized laminar flat flame; the third and final part of work involves an extension of the laminar flat flame study to turbulent reacting flows in a swirl stabilized combustor, and study the effects on the turbulent heat release due to the velocity  perturbations.  A Rijke tube combustor was selected to study self-excited combustion phenomenon. A laminar premixed methane-air flat flame was stabilized on a honeycomb flame-stabilizer. The flame stabilizer was placed at the center of the 5 feet vertical tube. The position of the flame at the center of the tube leads to a thermoacoustic instability of the 2nd acoustic mode. The fundamental thermoacoustic frequency was predicted accurately by the CFD model and the amplitude was reasonably matched (for a flow rate of Q = 120 cc/s and equivalence ratio phi = 1.0). Other characteristics of the pressure power spectrum were captured to a good degree of accuracy. This included the amplitude modulation of the fundamental and the harmonics due to a subsonic pulsating instability.  The flat flame study has been being conducted for Q = 200 cc/s and equivalence ratio phi = 0.75. The objective has been to obtain a frequency response function (FRF) of the unsteady heat release rate (output) due to incoming velocity perturbations (input). A range of frequencies (15 Hz - 500 Hz) have been selected for generating the FRF. The aim of this part of the study has been to validate the computational model against the experimental results and propose a physics based interpretation of the flame response. Detailed heat transfer modeling (including radiation heat transfer) and two-step chemistry models have been implemented in the model. The FRF generated has been able to reproduce the experimentally observed phenomena, like the low frequency pulsating instability occurring at 30 Hz. A heat transfer study has been conducted to explain the pulsating instability and a fuel variability study has been performed. Both the heat transfer study and the fuel variability study proved the role of heat transfer in creating the pulsating instability. The final part of the study involves simulation of reacting flow in a turbulent swirl stabilized combustor. The effect of velocity perturbations on the unsteady heat release has been studied by creating an FRF between the unsteady velocity and the unsteady heat release rate. A Large Eddy Simulation (LES) approach has been selected. A swirl number of S = 1.19 corresponding to a flow rate of Q = 20 SCFM with an equivalence ratio of phi = 0.75 have been implemented. Reduced reaction chemistry modeling, turbulence-chemistry interaction and heat transfer modeling have been incorporated in the model. The LES of reacting flow has shown vortex-flame interaction occurring inside the combustor. This interaction has been shown to occur at 255 Hz. The FRF obtained between unsteady velocity and unsteady heat release rate shows good comparison with the experimentally obtained FRF.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:29Z (GMT). No. of bitstreams: 11 10_Bibliography_Appendices_Vita.pdf: 1116311 bytes, checksum: 1d2f2c911ac31b7fd93650182a6251ab (MD5) 09_Conclusions_Future_Work.pdf: 57331 bytes, checksum: 7c4917fb7cfbbe6d1f5e03abc0b4052d (MD5) 08_LES_Turbulent_Swirl_Combustor.pdf: 873543 bytes, checksum: 129212b3e2d850e0dc6cd8c53289d75a (MD5) 07_RANS_Turbulent_Swirl_Combustor.pdf: 253676 bytes, checksum: c822b66f2ee7e4f4b7af0de3ab31b6b0 (MD5) 06_Forced_Response_Flat_Flame_Single_Channel.pdf: 447006 bytes, checksum: c4f97973e90e0cd60c28b14ea49c7134 (MD5) 05_Forced_Response_Flat_Flame_Burner.pdf: 314645 bytes, checksum: 2133e7d7c097861af25f3b095adc7e12 (MD5) 04_Self_Excited_Combustion_Rijke.pdf: 623966 bytes, checksum: 74d1e1469debdedd3841da88d7ce2c55 (MD5) 03_Thermoacoustic_Instabilities_Research.pdf: 53578 bytes, checksum: d7c292eb0df33e255ddca65deaca50c7 (MD5) 02_CFD_Reacting_Flow.pdf: 245093 bytes, checksum: 34929bbca5196f668082ed64fc0e20ce (MD5) 01_Background_Motivation_Objectives.pdf: 63609 bytes, checksum: 7f6a291be4b28501982b1c1fb4d86a7e (MD5) 00_Front_Matter.pdf: 101893 bytes, checksum: 96da5d716d6fd9fcdc80c1fbd6b435f5 (MD5)   Previous issue date: 2004-07-06",
    "Author Email: prateep@vt.edu",
    "Advisor Email: wills@vt.edu",
    "Advisor Email: dtafti@vt.edu",
    "Advisor Email: godfrey@aerosft.com",
    "Advisor Email: westrl@vt.edu",
    "Advisor Email: baumann@vt.edu",
    "Advisor Email: uri@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11209",
  "identifier_other": "etd-07142004-165910",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07142004-165910",
  "identifier_uri": "http://hdl.handle.net/10919/11209",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "02_CFD_Reacting_Flow.pdf",
    "09_Conclusions_Future_Work.pdf",
    "07_RANS_Turbulent_Swirl_Combustor.pdf",
    "08_LES_Turbulent_Swirl_Combustor.pdf",
    "05_Forced_Response_Flat_Flame_Burner.pdf",
    "06_Forced_Response_Flat_Flame_Single_Channel.pdf",
    "03_Thermoacoustic_Instabilities_Research.pdf",
    "04_Self_Excited_Combustion_Rijke.pdf",
    "10_Bibliography_Appendices_Vita.pdf",
    "00_Front_Matter.pdf",
    "01_Background_Motivation_Objectives.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "frequency response function",
    "CFD",
    "thermoacoustic instability",
    "vortex-flame interaction",
    "flame dynamics"
  ],
  "title": "A Computational Fluid Dynamics Investigation of Thermoacoustic Instabilities in Premixed Laminar and Turbulent Combustion Systems",
  "type": "Dissertation"
}