{
  "contributor_author": "McCann, Brandy Renee",
  "contributor_committeechair": "Allen, Katherine R.",
  "contributor_committeemember": [
    "Meszaros, Peggy S.",
    "Roberto, Karen A.",
    "Few-Demo, April L."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2011-08-22T19:02:27Z",
  "date_adate": "2010-10-26",
  "date_available": "2011-08-22T19:02:27Z",
  "date_issued": "2004-06-10",
  "date_rdate": "2010-10-26",
  "date_sdate": "2010-09-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "With people living longer and coming into old age with more diverse relational experiences than previous cohorts (e.g., divorce, cohabitation), researchers anticipate that the so-called baby boomers will be more interested in pursuing romantic relationships in later life than their predecessors. On the other hand, we know that the experience of aging varies among people on the basis of their social locations (e.g., racial, gender, class). As central Appalachia is a place characterized by persistent poverty, I interviewed single, midlife White women from a community in West Virginia (N=11) to investigate (a) their experiences with family life and (b) their expectations for romantic relationships in later life. I used grounded theory methodology to develop a theory of intimacy and family life in central Appalachia. I found that the women who were more integrated into their families of origin had little or no interest in romantic relationships, regardless of their past relationship history. Women who perceived their childhoods as traumatic were less integrated into their families of origin and had a weaker sense of place, but had more interest in finding a romantic partner in later life. I concluded for those with a strong sense of place the importance of the family of origin persisted through midlife and into old age.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:27Z (GMT). No. of bitstreams: 1  McCann_BR_D_2010.pdf: 1903448 bytes, checksum: 937aaeb65b70d0d0859cc3311cfe3927 (MD5)    Previous issue date: 2004-06-10",
    "Author Email: bmccann@vt.edu",
    "Advisor Email: meszaros@vt.edu",
    "Advisor Email: kroberto@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: alfew@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11201",
  "identifier_other": "etd-09132010-185930",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09132010-185930",
  "identifier_uri": "http://hdl.handle.net/10919/11201",
  "publisher": "Virginia Tech",
  "relation_haspart": "McCann_BR_D_2010.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Single Women",
    "Family",
    "Grounded Theory",
    "Appalachia",
    "Midlife"
  ],
  "title": "Intimacy and Family Among Single, Working-Class Women: A Focus on Rural Appalachia",
  "type": "Dissertation"
}