{
  "contributor_author": "Carter, Sadie Johnson",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Dawson, Christina M.",
    "Niles, Jerome A.",
    "Twiford, Travis W.",
    "Stamm, Neil A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2011-08-22T19:02:56Z",
  "date_adate": "2003-04-30",
  "date_available": "2011-08-22T19:02:56Z",
  "date_issued": "1998-06-11",
  "date_rdate": "2004-04-30",
  "date_sdate": "2003-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "The perceptions of how well the mentor teacher program meets the needs of the beginning teacher, the mentor teacher, and the school division were examined in this study. There were three populations: 100 beginning teachers employed in the Newport News Public Schools with an initial employment date of August 1998, 56 mentor teachers, and 31 program administrators. Three surveys, utilizing Likert scales, were developed to collect data. Descriptive statistics were applied to the data. Data from the three populations were analyzed separately. Each set of data was disaggregated by age, gender, ethnicity, years of experience, position, educational level, and career status. Means were compared to identify differences in the perceptions of the program's effectiveness.    The overall conclusion was that the program is only modestly meeting the needs of beginning teachers and mentors. In the perception of administrators, the program is meeting the needs of the school division.  The data are quite clear that the closer one is to the classroom (the beginning teacher) the lower one rates the mentoring program. The beginning teachers rated the program the lowest, with mentors rating it next lowest and administrators rating it the highest.   Numerous strengths and areas needing improvement were identified in the assessment. Among the strengths were sufficient emotional support from mentors, assistance with policies and procedures of the school and division, help with instructional methods, and training for mentors. Among the areas needing improvement were sufficient time for mentoring and receiving assistance; support for such activities as stimulating student learning, conducting home visits, organizing the classroom, and achieving the Virginia Standards of Learning; compensating mentors adequately; and assigning mentors to beginning teachers who teach the same grade or content.   The data may be useful in guiding modifications in the mentoring program of the Newport News Public Schools or in developing an effective mentoring program in any school system.",
  "description_degree": "EDD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:56Z (GMT). No. of bitstreams: 4  Title.pdf: 4418 bytes, checksum: 0e6f577b0d72b28988234bec84e01e4f (MD5)  DEDICATION1.pdf: 16777 bytes, checksum: b325f17efd810b8d92536a2775d2e8b6 (MD5)  CHAPTER1.pdf: 438124 bytes, checksum: b057174190996fe4c52417e2a9af16a2 (MD5)  Abstract.pdf: 7034 bytes, checksum: 404dec9dca263aa1546815afbbf2498e (MD5)    Previous issue date: 1998-06-11",
    "Author Email: sacarter51@aol.com",
    "Advisor Email: parks@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11218",
  "identifier_other": "etd-04252003-154916",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252003-154916",
  "identifier_uri": "http://hdl.handle.net/10919/11218",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAPTER1.pdf",
    "Abstract.pdf",
    "Title.pdf",
    "DEDICATION1.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Mentoring",
    "Beginning Teacher",
    "Collegiality"
  ],
  "title": "An Assessment of the Newport News Teacher Mentoring Program",
  "type": "Dissertation"
}