{
  "contributor_author": "McTammany, Matthew E",
  "contributor_committeechair": "Benfield, Ernest Fredrick",
  "contributor_committeemember": [
    "Voshell, J. Reese Jr.",
    "Valett, H. Maurice",
    "Webster, Jackson R.",
    "Wynne, Randolph H."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2011-08-22T19:02:30Z",
  "date_adate": "2004-07-27",
  "date_available": "2011-08-22T19:02:30Z",
  "date_issued": "2004-04-30",
  "date_rdate": "2004-07-27",
  "date_sdate": "2004-07-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Stream ecosystems are influenced by the surrounding landscape, and agriculture within their catchments has changed many characteristics of streams.  Agriculture has been a prominent land use activity in the southern Appalachian Mountains of the eastern United States for over 500 years.  However, recent socioeconomic changes in the region have caused many farmers to abandon agriculture leading to widespread reforestation of historical farmland.  I investigated the influence of agriculture on the physical, chemical, and biological structure and ecosystem processes of streams in the southern Appalachians.  In addition, I studied streams in watersheds previously agricultural but currently reforested to determine how historic agriculture generates long-term effects on streams.  Stream draining agricultural catchments (i.e., agricultural streams) had higher temperatures, light inputs, nutrients, and suspended sediments than forested streams and contained smaller substrate, dominated by sand and silt.  Temperature and light regimes recovered in streams of reforested catchments, but the other aspects of stream physicochemistry remained elevated or changed due to historical agriculture.  I expected biological community structure and ecosystem processes to reflect these altered conditions in streams with current and historical agriculture.  Higher chlorophyll, lower macroinvertebrate biodiversity, fewer shredder-detritivore invertebrates, and more pollution-tolerant organisms characterized agricultural streams compared to forested streams, but each of these biological features was similar in long-term forested streams and streams with reforested catchments but with agricultural histories.  Agricultural streams had higher rates of gross primary production (GPP) and GPP to respiration (P/R) ratios than forested streams, indicating that agriculture enhances autotrophic metabolism in streams.  Agriculture did not have a significant effect on wood breakdown or microbial biofilm development on wood substrates.  Together, these data suggest that agriculture causes many different changes in stream physical and chemical properties and that many of these properties do not recover following reforestation of catchments over the past 50 years.  However, biological community structure and ecosystem processes appear to respond to physical aspects of streams that do recover from historic agriculture including light, temperature, and organic matter supply and type.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:30Z (GMT). No. of bitstreams: 1  McTDiss_23July2004.pdf: 841852 bytes, checksum: 559fe9fcc6c0af432b060ed3fc9f51be (MD5)    Previous issue date: 2004-04-30",
    "Author Email: mmctamma@bucknell.edu",
    "Advisor Email: rvoshell@vt.edu",
    "Advisor Email: mvalett@vt.edu",
    "Advisor Email: benfield@vt.edu",
    "Advisor Email: jwebster@vt.edu",
    "Advisor Email: wynne@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11210",
  "identifier_other": "etd-07202004-131659",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07202004-131659",
  "identifier_uri": "http://hdl.handle.net/10919/11210",
  "publisher": "Virginia Tech",
  "relation_haspart": "McTDiss_23July2004.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "respiration",
    "primary production",
    "invertebrates",
    "stream",
    "agriculture",
    "wood"
  ],
  "title": "Recovery of southern Appalachian streams from historical agriculture",
  "type": "Dissertation"
}