{
  "contributor_author": "Ratcliffe, R. Samuel",
  "contributor_committeechair": "Creamer, Donald G.",
  "contributor_committeemember": [
    "Carretta, Patricia J.",
    "Janosik, Steven M.",
    "Muffo, John A.",
    "Spencer, Edward F. D."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2011-08-22T19:02:32Z",
  "date_adate": "2004-07-29",
  "date_available": "2011-08-22T19:02:32Z",
  "date_issued": "2004-03-18",
  "date_rdate": "2004-07-29",
  "date_sdate": "2004-07-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The general purpose of this national study was to document career services director use of the CAS professional standards by institutional size, career services experience level, director experience level, director degree level, CAS standards  awareness, CAS standards possession, and barriers to use. Also considered were the types of CAS standards use and satisfaction from use. There were significant differences in CAS standards awareness by years of experience in career services and by years of experience as career services director. No differences were found with regard to perceived barriers to CAS standards use. Significant differences were discovered by institutional size, as well as by director degree level, regarding the extent of use and satisfaction from use of the CAS standards. Finally, key factors identified with regard to predicting CAS standards use included level of awareness, and the degree to which both previous CAS standards use had not been helpful and fear of finding non-compliance were perceived as barriers. This study suggests that future research should concentrate on the reasons why practitioners are either satisfied or dissatisfied with use of the CAS standards and how the self-assessment guide is perceived and used. Additionally, an examination of how the different types of use influence perceived barriers merits consideration.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:02:32Z (GMT). No. of bitstreams: 1 RatcliffeDiss.pdf: 961944 bytes, checksum: 15b146084bc5e0fbdecfd10acb474985 (MD5)   Previous issue date: 2004-03-18",
    "Author Email: sratcliffe@vmi.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: pcarrett@gmu.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: muffo@vt.edu",
    "Advisor Email: espencer@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11211",
  "identifier_other": "etd-07262004-150008",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07262004-150008",
  "identifier_uri": "http://hdl.handle.net/10919/11211",
  "publisher": "Virginia Tech",
  "relation_haspart": "RatcliffeDiss.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "career services",
    "professional standards",
    "higher education",
    "NACE",
    "CAS"
  ],
  "title": "Use of the CAS Standards by Career Services Directors at Four-year Public Colleges and Universities",
  "type": "Dissertation"
}