{
  "contributor_author": "Cooper, Jamie S.",
  "contributor_committeechair": "Cooper, Robin K. Panneton",
  "contributor_committeemember": [
    "Lickliter, Robert E.",
    "Finney, Jack W.",
    "Bell, Martha Ann",
    "Marshall-Baker, Anna"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2011-08-22T19:03:16Z",
  "date_adate": "2001-03-20",
  "date_available": "2011-08-22T19:03:16Z",
  "date_issued": "1999-12-03",
  "date_rdate": "2002-03-20",
  "date_sdate": "2001-03-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Past research has found that infants between 1- and 4-months of age prefer extremely slow infant-directed (ID) speech to normal ID speech. Given that previous studies have paired the speech with a visual display, it was thought that perhaps the characteristics of the visual display affected infant preferences for rate of speaking. The present investigation was an attempt to explore this possibility. In Experiment 1, 3- to 4-month old infants were presented with ID-normal and ID-slow speech samples paired with displays of higher and lower complexity. Here, the results showed that infants preferred ID-slow to ID-normal speech regardless of display complexity. The purpose of Experiment 2 was to determine whether infant preference for speaking rate could be affected by structural differences in the visual displays. The same ID-normal and ID-slow speech samples used in Experiment 1 were paired with visual displays that either had components in a face-like or scrambled arrangement. The results of Experiment 2 showed that infants preferred the face-like display over the scrambled display regardless of what speech type was presented (i.e., there was not preference for ID-slow speech). The results of the study as a whole indicate that young infants prefer ID-slow to ID-normal speech, but that the presence of a face-like image may overshadow this preference. The study as a whole indicates that assertions about the power of ID-slow speech, as well as any auditory event in general, should not fail to address the potential influence of other sensory factors, particularly visual.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:03:16Z (GMT). No. of bitstreams: 3  Diss3.pdf: 510502 bytes, checksum: e331fa318fcb6916d80a8c0fb19fa1dd (MD5)  Diss2.pdf: 5635 bytes, checksum: d9b1445ebd89686a9882ad35cda29d64 (MD5)  Diss1.pdf: 5296 bytes, checksum: c9935bd9ae1e466362d69930f18c69e1 (MD5)    Previous issue date: 1999-12-03",
    "Author Email: jscooper@smcm.edu",
    "Advisor Email: duckling@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: rpcooper@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: annamb@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11223",
  "identifier_other": "etd-03162001-134726",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03162001-134726",
  "identifier_uri": "http://hdl.handle.net/10919/11223",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Diss1.pdf",
    "Diss2.pdf",
    "Diss3.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "rate of speaking",
    "Infants",
    "visual displays",
    "attention"
  ],
  "title": "Infant attention to rate of infant directed speech in the context of varying levels of visual stimulation",
  "type": "Dissertation"
}