{
  "contributor_author": "Rosario, Astrid Christa",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "Long, Timothy E.",
    "Shultz, Allan R.",
    "Davis, Richey M.",
    "McGrath, James E."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2011-08-22T19:03:38Z",
  "date_adate": "2002-12-12",
  "date_available": "2011-08-22T19:03:38Z",
  "date_issued": "2004-08-02",
  "date_rdate": "2007-08-20",
  "date_sdate": "2002-11-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "One of the major classes of polymer matrix resins under consideration for structural composite applications in the infrastructure and construction industries is vinyl ester resin.  Vinyl ester resin is comprised of low molecular weight poly(hydroxyether) oligomers with methacrylate endgroups diluted with styrene monomer. The methacrylate endgroups cure with styrene via free radical copolymerization to yield thermoset networks.  The copolymerization behavior of these networks was monitored by Fourier Transform Infrared Spectroscopy (FTIR) at various cure conditions.  Reactions of the carbon-carbon double bonds of the methacrylate (943 cm-1) and styrene (910 cm-1) were followed independently.  Oligomers possessing number average molecular weights of 700 g/mole were studied with systematically increasing levels of styrene. The Mortimer-Tidwell reactivity ratios indicated that at low conversion more styrene was incorporated into the network at lower cure temperatures. The experimental vinyl ester-styrene network compositions deviated significantly from those predicted by the Meyer-Lowry integrated copolymer equation at higher conversion, implying that the reactivity ratios for these networks may change with conversion.  The kinetic data were used to provide additional insight into the physical and mechanical properties of these materials.  In addition to establishing the copolymerization kinetics of these materials, the development of halogen free fiber reinforced vinyl ester composites exhibiting good flame properties was of interest.  Flame retardant vinyl ester resins are used by many industries for applications requiring good thermal resistance.  The current flame-retardant technology is dependent on brominated vinyl esters, which generate high levels of smoke and carbon monoxide.  A series of halogen free binder systems has been developed and dispersed in the vinyl ester to improve flame retardance.  The binder approach enables the vinyl ester resin to maintain its low temperature viscosity so that fabrication of composites via Vacuum Assisted Resin Transfer Molding (VARTM) is possible.  The first binder system investigated was a polycaprolactone layered silicate nanocomposite, which was prepared via intercalative polymerization.  Transmission Electron Microscopy (TEM) and X-ray Diffraction (XRD) data indicated a mixed morphology of exfoliated and intercalated structures.  The mechanical properties and the normalized peak heat release rates were comparable to the neat vinyl ester resin.     Alternative binder systems possessing inherent flame retardance were also investigated.  A series of binders comprised of novolac, bisphenol A diphosphate, and montmorillonite clay were developed and dispersed into the vinyl ester matrix.  Cone calorimetry showed reductions in the peak heat release rate comparable to the brominated resin.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:03:38Z (GMT). No. of bitstreams: 1  Rosario_Dissertation.pdf: 4085078 bytes, checksum: 8e9080b8849847b17872a3524ed79f2d (MD5)    Previous issue date: 2004-08-02",
    "Author Email: littleprofessora@aol.com",
    "Advisor Email: tlong@vt.edu",
    "Advisor Email: ashultz@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: judyriffle@aol.com"
  ],
  "format_medium": "ETD",
  "handle": "11228",
  "identifier_other": "etd-11132002-175555",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11132002-175555",
  "identifier_uri": "http://hdl.handle.net/10919/11228",
  "publisher": "Virginia Tech",
  "relation_haspart": "Rosario_Dissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "vinyl ester",
    "dimethacrylate",
    "flame retardant",
    "exfoliated",
    "nanocomposites",
    "thermoset matrix resin",
    "layered silicates",
    "reactivity ratios",
    "network"
  ],
  "title": "The Chemistry of Dimethacrylate-Styrene Networks and Development of Flame Retardant, Halogen-Free Fiber Reinforced Vinyl Ester Composites",
  "type": "Dissertation"
}