{
  "contributor_author": "Crozier, James Brooks",
  "contributor_committeechair": "Stromberg, Erik L.",
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2011-08-22T19:03:16Z",
  "date_adate": "1999-12-21",
  "date_available": "2011-08-22T19:03:16Z",
  "date_issued": "2004-06-17",
  "date_rdate": "2000-12-21",
  "date_sdate": "1999-12-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Take-all of wheat, caused by Gaeumannomyces graminis var. tritici (Ggt ) is a problem wherever wheat is grown.  Crop rotation is currently the only method for control.  Our objectives were to develop a greenhouse bioassay and to evaluate the efficacy of mineral, chemical, and or biological agents for control, test promising agents in the field, and characterize Ggt isolates collected in Virginia.  'Jackson' soft red winter wheat seeds were planted in a Kempsville loam containing millet seed infested with Ggt  or sterile millet seed in the greenhouse.  Root necrosis ratings, and root and shoot weight were determined as a measure of disease severity.  In the field, plots were set up with or without addition of Ggt  inoculum.  Effectiveness of nitrogen source, reduced manganese, and fungicide seed treatments to control take-all was determined.  In greenhouse tests and in field trials plants did not yield better, significantly gain root and shoot weight due to either ammonium ions or reduced manganese, and the severity of root necrosis was not affected.  Fungicide seed treatments did not significantly control take-all in the field.  MON 65500, an experimental chemical, fungicides, and biological agents were tested either alone or in combination in the presence and absence of Ggt.  Plants from seeds treated with MON 65500 alone or in combination with difenoconazole gained significantly greater root and shoot weight and in field trials had significantly greater grain yield over control plots.  In greenhouse tests, two Bacillus spp. and a fluorescent pseudomonad were tested.  Plants from bacteria-treated seeds gained root and shoot weight in only one of several tests. USDA-maintained bacterial isolates did not perform well in greenhouse bioassays or in the field, and plants from Gustafson-product-treated seed, including biological agents yielded poorly over two seasons in field trials.  Little information is available on the variability of Ggt, with most information coming from Britain and Australia. Virginia and Montana Ggt, and Gga and Ggg  (British isolates) were tested for virulence against 'Jackson' wheat in the greenhouse.  Seeds were planted with two Ggt  mycelial plugs or two sterile PDA plugs.  Colony morphology, growth rates, and vegetative compatibility groups were determined.  Growth rate per day and total growth was related to disease severity in greenhouse assays.  For the first time, bacterial Rep primers were used to amplify Ggt DNA.  Molecular techniques as well as chemical markers were used to study anastomosis between \"incompatible\" strains.  A useful technique was developed to quickly induce perithecial formation on soybean pods which lead to ecological and agricultural concerns.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:03:16Z (GMT). No. of bitstreams: 3  contents.PDF: 23083 bytes, checksum: 1f8bae3a934bff8226ad48f535888307 (MD5)  abstract.PDF: 13988 bytes, checksum: 4190fbe60747aca9d6cabadff4b3d598 (MD5)  Dissertation.PDF: 1501618 bytes, checksum: b22a6699af1208855e64d9456a5556cf (MD5)    Previous issue date: 2004-06-17",
    "Author Email: jacrozie@vt.edu",
    "Advisor Email: elstrom@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11222",
  "identifier_other": "etd-121899-112200",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-121899-112200",
  "identifier_uri": "http://hdl.handle.net/10919/11222",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation.PDF",
    "abstract.PDF",
    "contents.PDF"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Biological",
    "Take-all",
    "REP",
    "Chemical"
  ],
  "title": "Evaluation of Agents for the Suppression of Take-all of Wheat in Virginia in Greenhouse and Field Studies, and Characterization of Isolates of Gaeumannomyces graminis varieties",
  "type": "Dissertation"
}