{
  "contributor_author": "Rowland, Amy Lee",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Poole, Jon R.",
    "Krouscas, James A. Jr.",
    "Moore, David Michael",
    "Redican, Kerry J."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2011-08-22T19:03:17Z",
  "date_adate": "2004-08-19",
  "date_available": "2011-08-22T19:03:17Z",
  "date_issued": "2004-07-27",
  "date_rdate": "2004-08-19",
  "date_sdate": "2004-08-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to investigate the use of videotaped modeling of a tennis skill with and without verbal cues. Eighteen female players from two NCAA Division III colleges served as the subjects for the study. The players were randomly assigned to one of two groups. Both of the groups viewed a modeling videotape which contained a 56-second clip of a female professional hitting forehand groundstrokes looped seven times. Group One'­s tape included verbal cues on balance, posture, and contact point. Group Two'­s tape did not contain verbal cues. Both of the groups were pre-tested on power, performance, trait confidence, and state confidence before viewing the modeling tape six times. Then they were post-tested on the same measures and given a qualitative questionnaire. They were also asked a follow-up question in interview format. The qualitative analyses revealed that Group 2 subjects were unable to articulate the concepts of balance, posture and contact point as well as Group 1. Group 1 was better able to articulate these concepts with a higher percentage of participants answering the qualitative questionnaire consistent with the relevant verbal cues for balance, posture, and contact point. The results of this study indicate that tennis coaches should consider adding verbal cues when using videotaped modeling to enhance its effectiveness.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:03:17Z (GMT). No. of bitstreams: 2  alrowlandetd.pdf: 70630 bytes, checksum: 394d68d2559bcfacd1ab083a3d30172c (MD5)  alrowlandetd.2.pdf: 246953 bytes, checksum: a3c1e0c6f6abd0190469bb29dc98b967 (MD5)    Previous issue date: 2004-07-27",
    "Author Email: arowland@allvantage.com",
    "Advisor Email: jpoole@vt.edu",
    "Advisor Email: jkrousca@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: kredican@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11226",
  "identifier_other": "etd-08162004-193008",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08162004-193008",
  "identifier_uri": "http://hdl.handle.net/10919/11226",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "alrowlandetd.pdf",
    "alrowlandetd.2.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Modeling",
    "Tennis",
    "Cues"
  ],
  "title": "Videotaped Modeling with and without Verbal Cues",
  "type": "Dissertation"
}