{
  "contributor_author": "Renneckar, Scott Harold",
  "contributor_committeecochair": [
    "Zink-Sharp, Audrey G.",
    "Glasser, Wolfgang G."
  ],
  "contributor_committeemember": [
    "Ducker, William A.",
    "Frazier, Charles E.",
    "Gatenholm, Paul",
    "Ifju, Geza",
    "Rials, Timothy"
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2011-08-22T19:04:15Z",
  "date_adate": "2004-08-26",
  "date_available": "2011-08-22T19:04:15Z",
  "date_issued": "2004-07-16",
  "date_rdate": "2004-08-26",
  "date_sdate": "2004-08-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "For the first time, a novel processing method of co-refining wood and polyolefin (PO) by steam-explosion was scientifically explored for wood-thermoplastic composites without a coupling agent.  Traditional studies have addressed the improvement of adhesion between components of wood thermoplastic composites through the use of coupling agents such as maleated PO.  The objective of this study was to increase adhesion between wood and PO through reactive processing conditions of steam-explosion.  PO characteristics, such as type (polyethylene or polypropylene), form (pellet, fiber, or powder) and melt viscosity were studied along with oxygen gas content of the steam-explosion reactor vessel.  Modification of co-processed wood fiber was characterized in four studies: microscopy analysis of dispersion of PO with wood fiber, sorption properties of co-processed material, chemical analysis of fractionated components, and morphological investigation of co-processed material.  Two additional studies are listed in the appendices that relate to adsorption of amphiphilic polymers to the cellulose fiber surface, which is one hypothesis of fiber surface modification by co-steam-explosion.  Microscopy studies revealed that PO melt viscosity was found to influence the degree of dispersion and uniformity of the steam-exploded material.  The hygroscopic nature of the co-processed fiber declined as shown by sorption isotherm data.  Furthermore, a water vapor kinetics study found that all co-refined material had increased initial diffusion coefficients compared to the control fiber.  Chemical changes in fractionated components were PO-type dependent.  Lignin extracted from co-processed wood and polyethylene showed PO enrichment determined from an increase of methylene stretching in the Fourier Transform infrared subtraction spectra, while lignin from co-processed wood and polypropylene did not.  Additionally, extracted PO showed indirect signs of oxidation as reflected by fluorescence studies.  Solid state nuclear magnetic resonance spectroscopy revealed a number of differences in the co-processed materials such as increased cellulose crystallinity, new covalent linkages and an alternative distribution of components on the nanoscale reflected in the T1Ï  relaxation parameter.  Steam-explosion was shown to modify wood fiber through the addition of \"non-reactive\" polyolefins without the need for coupling agents.  In light of these findings, co-refining by steam-explosion should be viewed as a new reactive processing method for wood thermoplastic composites.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:04:15Z (GMT). No. of bitstreams: 9  vitae.pdf: 3920 bytes, checksum: f5587b3a6cc8deb13fa82f4f695e65b1 (MD5)  Dissertation_front.pdf: 772360 bytes, checksum: d240a0c07fcffdc56fd18bcb675b6f31 (MD5)  Chapter_8_Conclusions.pdf: 12938 bytes, checksum: ba94f026c842cb0fecb6e103fa312558 (MD5)  Chapter_7_Morphological_Changes.pdf: 290060 bytes, checksum: da0e0e0079edc702fe42b7465c55c8e0 (MD5)  Chapter_5_Sorption_Studies.pdf: 1986966 bytes, checksum: fc8150b21c185ab951122b72b05cabdd (MD5)  Chapter_4_Microscopic_Analysis.pdf: 8452324 bytes, checksum: e0425d25ef6b155cce08db22402887d1 (MD5)  Chapter_3_Compositional_Analysis.pdf: 172482 bytes, checksum: 1025ad27aeb4f3683abd8d4deb6d0b2d (MD5)  CHAPTER_6_Chemical_Changes.pdf: 2616482 bytes, checksum: 21e9ec95838097ec644e7551701cc4af (MD5)  Appendices.pdf: 1021052 bytes, checksum: 276d0e6c6d0715212c6032c10904bb3a (MD5)    Previous issue date: 2004-07-16",
    "Author Email: srenneck@vt.edu",
    "Advisor Email: wducker@vt.edu",
    "Advisor Email: cfrazier@vt.edu",
    "Advisor Email: agzink@vt.edu",
    "Advisor Email: wglasser@vt.edu",
    "Advisor Email: pg@pol.chalmers.se",
    "Advisor Email: ifju@vt.edu",
    "Advisor Email: trials@utk.edu"
  ],
  "format_medium": "ETD",
  "handle": "11239",
  "identifier_other": "etd-08232004-164234",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08232004-164234",
  "identifier_uri": "http://hdl.handle.net/10919/11239",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter_7_Morphological_Changes.pdf",
    "Dissertation_front.pdf",
    "CHAPTER_6_Chemical_Changes.pdf",
    "Chapter_3_Compositional_Analysis.pdf",
    "Chapter_4_Microscopic_Analysis.pdf",
    "Chapter_5_Sorption_Studies.pdf",
    "Chapter_8_Conclusions.pdf",
    "Appendices.pdf",
    "vitae.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "confocal laser scanning microscopy",
    "13C NMR",
    "fractionation",
    "thermogravimetric analysis",
    "biopolymer",
    "cellulose"
  ],
  "title": "Modification of Wood Fiber with Thermoplastics by Reactive Steam-Explosion",
  "type": "Dissertation"
}