{
  "contributor_author": "Robinson, Tammy Renee'",
  "contributor_committeechair": "Giddings, Valerie L.",
  "contributor_committeemember": [
    "Bailey, Carol A.",
    "Schulman, Robert S.",
    "Kincade, Doris H.",
    "Schofield-Tomschin, Sherry"
  ],
  "contributor_department": "Clothing and Textiles",
  "date_accessioned": "2011-08-22T19:04:11Z",
  "date_adate": "2003-08-14",
  "date_available": "2011-08-22T19:04:11Z",
  "date_issued": "2003-05-09",
  "date_rdate": "2004-08-14",
  "date_sdate": "2003-08-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to determine the relationship between appearance management, created appearance, body cathexis, and clothing behavior for a group of women enrolled in a commercial weight loss program. Subjects were 171 females enrolled in Weight Watchers® programs in Christiansburg, Virginia. No previous research had investigated clothing behavior, appearance management, created appearance, and body cathexis of women in a weight loss program. Because clothing is such an integral part of the self, it was important to examine the influences and contributions of this variable to weight loss. The proposed research model hypothesized that the following variables would be related: appearance management and created appearance, created appearance and body cathexis, body cathexis and current clothing behavior, and created appearance and current clothing behavior. Other hypotheses tested the relationships between current clothing behavior and prior clothing and between demographics and the following variables: appearance management, created appearance, body cathexis, and current clothing behavior.  Results indicated that a greater percentage of weight loss was related to a higher average body cathexis score. Respondents wore clothing that emphasized body parts with which they were more satisfied, and wore clothing that did not emphasize body parts with which they were less satisfied. Results indicated that after weight loss, respondents wore clothing that would emphasize their body with more frequency and also wore clothing that would hide or camouflage their body with less frequency. Current clothing behavior also seemed to be influenced by age and marital status. Findings from the present study provide new information about how women choose clothing based on the level of satisfaction with their bodies and where they have experienced a weight loss. The findings also provide information about the types and styles of clothing that women choose as a result of losing weight. Women in weight loss programs can use clothing to enhance their appearance and improve their body image. By increasing body satisfaction and feeling better about their bodies as they are going through the weight loss program, they may be more likely to continue with their efforts and be more successful in their weight loss.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:04:11Z (GMT). No. of bitstreams: 1 TR-ETD.pdf: 1541974 bytes, checksum: 92170082970bc788e34b0491104351f2 (MD5)   Previous issue date: 2003-05-09",
    "Author Email: tarobins@vt.edu",
    "Advisor Email: vgidding@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11230",
  "identifier_other": "etd-08012003-155510",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08012003-155510",
  "identifier_uri": "http://hdl.handle.net/10919/11230",
  "publisher": "Virginia Tech",
  "relation_haspart": "TR-ETD.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "weight loss",
    "clothing behavior",
    "body cathexis"
  ],
  "title": "Clothing behavior, body cathexis, and appearance management of women enrolled in a commercial weight loss program",
  "type": "Dissertation"
}