{
  "contributor_author": "Liu, Sixin",
  "contributor_committeecochair": [
    "Griffey, Carl A.",
    "Maroof, M. A. Saghai"
  ],
  "contributor_committeemember": [
    "Wilkinson, Carol A.",
    "Veilleux, Richard E.",
    "Stromberg, Erik L."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2011-08-22T19:04:14Z",
  "date_adate": "2000-01-05",
  "date_available": "2011-08-22T19:04:14Z",
  "date_issued": "2000-05-02",
  "date_rdate": "2001-01-05",
  "date_sdate": "1999-12-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Powdery mildew, caused by Blumeria graminis (DC.) E.O. Speer f. sp. tritici E'm. Marchal (syn. Erysiphe graminis f. sp. tritici), is one of the major diseases of wheat (Triticum aestivum L.) worldwide.  The use of cultivars with resistance to powdery mildew is an efficient, economical and environmentally safe way to control powdery mildew.  Race-specific resistance has been extensively used in breeding programs; however, it is ephemeral.  Adult plant resistance (APR) to powdery mildew is more durable as demonstrated by the cultivar Massey, which has maintained its APR to powdery mildew since its release in 1981.  To develop an efficient breeding strategy, it is essential to understand the genetic basis of APR.  The objectives of this study were to identify molecular markers associated with APR to powdery mildew in common wheat Massey and to verify their association using recombinant inbred (RI) lines. A cross was made between the powdery mildew susceptible cultivar Becker and Massey.  One hundred and eighty F2:3 lines were rated for disease severity under natural pressure of powdery mildew in field.  Using both restriction fragment length polymorphism (RFLP) and microsatellite markers, three quantitative trait loci (QTL), designated as QPm.vt-1B, QPm.vt-2A and QPm.vt-2B, were identified in the Becker x Massey F2:3 generation.  These loci are located on chromosomes 1B, 2A and 2B, respectively, and explained 17%, 29% and 11% of the total variation among F2:3 lines for powdery mildew resistance, respectively.  Cumulatively, the three QTLs explained 50% of the phenotypic variation among F2:3 lines in a multi-QTL model.  The three QTLs associated with APR to powdery mildew were derived from Massey and displayed additive gene action. QPm.vt-2B also fits a recessive model for APR to powdery mildew. In the second part of this study, 97 RI lines were developed from the Becker x Massey cross.  The RI lines were evaluated for APR to powdery mildew under natural disease pressure for three years.  Both single marker analysis and interval mapping confirmed the presence of the three QTLs identified in the F2:3 generation.  The three QTLs, QPm.vt-1B, QPm.vt-2A and QPm.vt-2B, accounted for 15%, 26% and 15% of the variation of mean powdery mildew severity of the RI lines over three years.  In a multi-QTL model, the three QTLs explained 44% of the phenotypic variation of the RI lines. The RI lines were grouped according to the genotype of the three QTLs, represented by markers GWM304a, KSUD22 and PSP3100, respectively.  The RI lines with Massey alleles at all three loci had a mean disease severity of 3.4%, whereas the RI lines with Becker alleles at all three loci had a mean disease severity of 22.3%.  These severity values are similar to those of the corresponding parents. The molecular markers identified and verified as to their association with APR to powdery mildew in Massey have the potential for use in marker-assisted selection for resistance to powdery mildew and in pyramiding powdery mildew resistance genes, as well as facilitating a better understanding of the molecular basis of APR to powdery mildew.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:04:14Z (GMT). No. of bitstreams: 1  etd-powdery.pdf: 272454 bytes, checksum: 9a3a3c193887df29d56a3b846986ff58 (MD5)    Previous issue date: 2000-05-02",
    "Author Email: siliu@vt.edu",
    "Advisor Email: wilki@vt.edu",
    "Advisor Email: cgriffey@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: elstrom@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11236",
  "identifier_other": "etd-121999-232244",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-121999-232244",
  "identifier_uri": "http://hdl.handle.net/10919/11236",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd-powdery.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Blumeria graminis f. sp. tritici",
    "Erysiphe graminis f. sp. tritici",
    "wheat",
    "RFLP",
    "SSR",
    "QTL",
    "adult plant resistance"
  ],
  "title": "Molecular marker analysis of adult plant resistance to powdery mildew in common wheat",
  "type": "Dissertation"
}