{
  "contributor_author": "Gough, Christopher Michael",
  "contributor_committeechair": "Seiler, John R.",
  "contributor_committeemember": [
    "Fox, Thomas R.",
    "Parrish, David J.",
    "Maier, Christopher A.",
    "Aust, Wallace Michael"
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2011-08-22T19:04:12Z",
  "date_adate": "2003-07-15",
  "date_available": "2011-08-22T19:04:12Z",
  "date_issued": "2003-07-28",
  "date_rdate": "2004-07-15",
  "date_sdate": "2003-07-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Loblolly pine (Pinus taeda L.) occupies 13 million hectares in the United States and represents a critical component of the global carbon (C) cycle.  Forest management alters C dynamics, affecting the C sequestration capacity of a site.  Identifying drivers that influence C cycling, quantifying C fluxes, and determining how management alters processes involved in C cycling will allow for an understanding of C sequestration capacity in managed forests.  Objectives of the first study included (1) investigating environmental, soil C, root, and stand influences on soil CO2 efflux on the South Carolina coastal plain and (2) quantifying soil CO2 efflux over a rotation in loblolly pine stands located on the South Carolina coastal plain and the Virginia piedmont.  In relation to the first objective, temporal variation in soil CO2 efflux was most highly related to soil temperature.  Spatial and temporal variability in soil CO2 efflux was weakly related to soil C and root biomass, and not related to coarse woody debris, stand age, stand volume, or site index [Chapter 2].  Soil CO2 efflux was not related to stand age on the South Carolina sites while efflux was positively related to age on the Virginia sites.  Cumulative soil C efflux on the South Carolina sites over 20 years is an estimated 278.6 Mg C/ha compared with an estimated 210.9 Mg C/ha on the Virginia sites [Chapter 3].  Objectives of the second study were (1) to investigate short-term effects of fertilization on processes permitting enhanced growth in loblolly pine and (2) to determine the short-term effects of fertilization on autotrophic, heterotrophic, and soil respiration.  Major results from the study include the finding that fertilization caused a transient rise in photosynthetic capacity, which paralleled changes in foliar nitrogen.  Leaf area accumulation and enhanced growth following fertilization was partly due to enhanced C fixation capacity [Chapter 4].  Fertilization altered the contribution of autotrophic and heterotrophic respiration to total soil CO2 efflux.  Enhanced specific root respiration was short-lived while suppressed microbial respiration following fertilization was maintained over the course of the nearly 200-day study.  Respiring root biomass growth increased total soil respiration over time [Chapter 5].",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:04:12Z (GMT). No. of bitstreams: 1  Christopher_M_Gough_Dissertation_corrected.pdf: 1014287 bytes, checksum: 216436f5cc421a71813554beb1ed7fdb (MD5)    Previous issue date: 2003-07-28",
    "Author Email: chgough@vt.edu",
    "Advisor Email: jseiler@vt.edu",
    "Advisor Email: trfox@vt.edu",
    "Advisor Email: dparrish@vt.edu",
    "Advisor Email: cmaier@fs.fed.us",
    "Advisor Email: waust@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11232",
  "identifier_other": "etd-07112003-091151",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07112003-091151",
  "identifier_uri": "http://hdl.handle.net/10919/11232",
  "publisher": "Virginia Tech",
  "relation_haspart": "Christopher_M_Gough_Dissertation_corrected.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "carbon",
    "soil respiration",
    "photosynthesis",
    "fertilization",
    "soil CO2 efflux",
    "nitrogen"
  ],
  "title": "Quantification and Physiology of Carbon Dynamics in Intensively Managed Loblolly Pine (Pinus taeda L.)",
  "type": "Dissertation"
}