{
  "contributor_author": "Lee, Yuri",
  "contributor_committeechair": "Kincade, Doris H.",
  "contributor_committeemember": [
    "Giddings, Valerie L.",
    "Singh, Kusum",
    "Badinelli, Ralph D.",
    "Chen-Yu, Jessie H."
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2011-08-22T19:04:13Z",
  "date_adate": "2000-05-05",
  "date_available": "2011-08-22T19:04:13Z",
  "date_issued": "1999-04-14",
  "date_rdate": "2001-05-05",
  "date_sdate": "2000-05-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study is to examine apparel manufacturers' inventory performance, which is one of the major performance indicators of supply chain management (SCM) with the consideration of company characteristics. The objectives of the study are (a) to identify the level of SCM activities of apparel manufacturers, (b) to examine the differences of apparel manufacturers' characteristics (i.e., product characteristic, production system, fabric suppliers, retail customers) according to the level of SCM activities, and (c) to illustrate how the SCM activities and apparel manufacturers' characteristics relate to the inventory management performance in terms of levels within the type (i.e., raw material, work-in-process, finished goods). Through an intensive literature review six SCM dimensions and 26 SCM activities were identified and four company characteristics selected for the study were found to influence the company performance. Inventory levels within the type were compared as a result of levels of SCM activities and company characteristics. Data were collected via a self-administered mail questionnaire sent to a random proportional stratified sample of 1,195 US apparel manufacturers in SIC 231 to 234. In the data analyses, 93 returned surveys were used with the adjusted response rate of 9.49%. Cluster analysis was used to identify the SCM activity groups who showed different levels of SCM activities. Factor analysis was used to determine the number of SCM dimensions and SCM activity scales, and to identify the SCM activity level of each cluster. ANOVA, Chi-square, Tukey-test, matched sample t-test, t-test, regression, and correlation were employed to determine the relationships between SCM activity level, company characteristics and inventory levels within the type.   Statistical analyses supported the research hypotheses. Apparel manufacturers' SCM activity level differs and company characteristics are significantly related with the SCM activity level. Company characteristics and SCM activity level are significantly related with the inventory performance. Findings imply that basic goods manufacturers are more likely to see the benefits of SCM activity implementation in inventory performance. Lead-time for fashion goods procurement, production, and delivery takes longer than basic goods and is hard to be shortened. Limitations of the study and suggestions for future study were discussed.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:04:13Z (GMT). No. of bitstreams: 8  Title.pdf: 47458 bytes, checksum: 7ec2aaad5eb36b41fddf4d7fddc692f8 (MD5)  TOC.pdf: 68230 bytes, checksum: 1234f0a5d8480caee863d3efa42b77a0 (MD5)  Chapter5-Ref-vita.pdf: 157672 bytes, checksum: 1543be60dda6183a878f53ba82697862 (MD5)  Chapter4.pdf: 350936 bytes, checksum: 358a6960434918659d7ce21767d51552 (MD5)  Chapter3.pdf: 145804 bytes, checksum: 0ba08699af5136e186e57e06b470b476 (MD5)  Chapter2.pdf: 233870 bytes, checksum: 5d5924ecbf18f583ec3e85739184012f (MD5)  Chapter1.pdf: 102369 bytes, checksum: 8fef7290a10259a5a401e0ed60bd9bf1 (MD5)  Abstract.pdf: 60161 bytes, checksum: ab7a8eff6b3fe049044a34b72b2cbc42 (MD5)    Previous issue date: 1999-04-14",
    "Author Email: yulee3@krc-ri.com",
    "Advisor Email: vgidding@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: ralphb@vt.edu",
    "Advisor Email: kincade@vt.edu",
    "Advisor Email: chenyu@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11234",
  "identifier_other": "etd-05042000-23110007",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05042000-23110007",
  "identifier_uri": "http://hdl.handle.net/10919/11234",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter1.pdf",
    "Abstract.pdf",
    "Title.pdf",
    "TOC.pdf",
    "Chapter2.pdf",
    "Chapter5-Ref-vita.pdf",
    "Chapter4.pdf",
    "Chapter3.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Inventoy Performance",
    "Apparel manufacturer",
    "Supply Chain Management"
  ],
  "title": "Study of Relationships between Apparel Manufacturers' Supply Chain Management, Company Characteristics, and Inventory Performance",
  "type": "Dissertation"
}