{
  "contributor_author": "Perry, Elizabeth A.",
  "contributor_committeechair": "Salehi-Isfahani, Djavad",
  "contributor_committeemember": [
    "Mills, Bradford F.",
    "Spanos, Aris",
    "Lutz, Nancy A.",
    "Murphy, Russell D."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2011-08-22T19:04:16Z",
  "date_adate": "2004-08-26",
  "date_available": "2011-08-22T19:04:16Z",
  "date_issued": "2004-06-18",
  "date_rdate": "2006-08-26",
  "date_sdate": "2004-08-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In 1992, Georgia voters approved the Georgia Lottery for Education Act, which established the Helping Outstanding Pupils Educationally (HOPE) Scholarship program, a state-supported merit-based aid program that provides renewable full scholarships to qualifying Georgia residents who enroll in any of the State'­s public postsecondary institutions or scholarships of comparable monetary value for those choosing a private in-state institution.  The principal objectives of HOPE are to promote increased achievement in high school and college and to provide an incentive for the State'­s brightest residents to stay in the state.  HOPE has been the inspiration for similar programs in over a dozen states.  This thesis provides a broad exploration of economic questions regarding the nature and consequences of HOPE and similar programs and performs difference-in-differences analysis on data from two non-Georgia institutions to determine if HOPE has succeeded in motivating high achieving Georgia residents to attend college in the state rather than out of the state.  At the public institution, relative to various control groups, the mean GPA and class rank of Georgia residents is lower post-HOPE, although their mean SAT score is higher post-HOPE.  At the private institution, the HOPE effect is positive for all achievement measures used, meaning that the average achievement of Georgia residents is higher post-HOPE relative to that of other students at the institution.  These conflicting results suggest the need for further exploration of the differences between public and private institutions and of the differences between the students choosing to attend them.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:04:16Z (GMT). No. of bitstreams: 2  EPerry_Title_and_Abstract.pdf: 44019 bytes, checksum: c447ae997aaa73db60ed391031e3a28a (MD5)  EPerry_Dissertation.pdf: 785514 bytes, checksum: ee5e1f6d435b1ab8db02e44c1d8da295 (MD5)    Previous issue date: 2004-06-18",
    "Advisor Email: bfmills@vt.edu",
    "Advisor Email: aris@vt.edu",
    "Advisor Email: nlutz@vt.edu",
    "Advisor Email: Russell.Murphy@LibertyMutual.com",
    "Advisor Email: salehi@vt.edu",
    "Author Email: eperry@rmwc.edu"
  ],
  "format_medium": "ETD",
  "handle": "11240",
  "identifier_other": "etd-08092004-172731",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08092004-172731",
  "identifier_uri": "http://hdl.handle.net/10919/11240",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "EPerry_Dissertation.pdf",
    "EPerry_Title_and_Abstract.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "state lotteries",
    "student achievement",
    "scholarships",
    "higher education",
    "HOPE",
    "merit aid"
  ],
  "title": "State-Supported Postsecondary Merit Aid:  Georgia's Helping Outstanding Pupils Educationally (HOPE) Scholarship and Its Effects on Student Schooling Decisions",
  "type": "Dissertation"
}