{
  "contributor_author": "Moye, Letecia Nicole",
  "contributor_committeechair": "Kincade, Doris H.",
  "contributor_committeemember": [
    "Chen-Yu, Jessie H.",
    "Weaver, Pamela A.",
    "Schofield-Tomschin, Sherry",
    "Scott-Webber, Lennie"
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2011-08-22T19:05:34Z",
  "date_adate": "2000-03-07",
  "date_available": "2011-08-22T19:05:34Z",
  "date_issued": "2000-10-12",
  "date_rdate": "2001-03-07",
  "date_sdate": "2000-03-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The decision to patronize a particular store usually starts with a set of characteristics or attributes that consumers consider important. Consumers then use these attributes to make decisions regarding what store or stores can cater to their particular needs. Past retail and marketing studies have identified several consumer-oriented store attributes such as price, quality, variety, discounts, store reputation and their relationship to store patronage, but these studies overlooked how the physical environment affects retail store patronage. In addition, very few studies have addressed the issue of shopping scenarios and how they affect store patronage. The purpose of this study was to examine the influence of selected environmental dimensions on store patronage using specific apparel shopping scenarios. Data were collected using a random sample of women age 18 and over throughout the United States. The final sample consisted of 151 women. Four hypotheses were formulated and tested using factor analysis, cluster analysis, MANOVA, and Chi-square. The hypotheses tested for differences in (a) importance of environmental dimensions relative to three shopping scenarios, (b) importance of environmental dimensions relative to shopping orientations, (c) perceptions of first store choice relative to shopping orientations, and (d) attitude toward first store choice. Results revealed no difference in importance ratings of two environmental dimension factors, Sensory/Layout (Factor 1) and Music/Aesthetics (Factor 2), for three shopping scenarios (i.e., a dress for a formal social gathering, family gathering, work or community activity). Significant differences were found in the importance ratings of the Sensory/Layout and Music Aesthetics dimension factors across shopping orientation clusters. The clusters were named Decisive Apparel Shoppers (Cluster 1), Confident Apparel Shoppers (Cluster 2), Bargain   Apparel Shoppers (Cluster 3), and Appearance Conscious Apparel Shoppers. The Bargain Apparel Shoppers had higher mean scores on the environmental factors than the other shopper groups. With regard to first store choice, the department store was chosen most often as first store choice. Furthermore, differences were found in perception of the environment for first store choice across the shopping orientation clusters. No differences were found for the Ventilation/Sensory factor; however, differences were found for the Signs perception factor. Respondents expressed relatively unfavorable attitudes toward their first store choice. However, of those that expressed an unfavorable attitude, several respondents indicated they were likely to visit their first store choice again.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:05:34Z (GMT). No. of bitstreams: 5  vita.pdf: 6419 bytes, checksum: 12551fb534f6027bb6f2a920834503aa (MD5)  references.pdf: 23485 bytes, checksum: 9d84819ace3cae2d7aee5b344357a3f4 (MD5)  part5-6.pdf: 215449 bytes, checksum: afbfaa3acb4ee953f9fc3a85ba71098b (MD5)  part3-4.pdf: 61988 bytes, checksum: 026e177c27fd334edc89989234def27d (MD5)  part12.pdf: 164409 bytes, checksum: 1c4dcc45d75690f42042e8c3b600f6aa (MD5)    Previous issue date: 2000-10-12",
    "Author Email: lemoye@vt.edu",
    "Advisor Email: kincade@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11249",
  "identifier_other": "etd-03022000-13200029",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03022000-13200029",
  "identifier_uri": "http://hdl.handle.net/10919/11249",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "references.pdf",
    "vita.pdf",
    "part3-4.pdf",
    "part12.pdf",
    "part5-6.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Attitude",
    "Environmental Dimensions",
    "Shopping Orientations",
    "Store Patronage",
    "Shopping Scenarios",
    "Female Consumers"
  ],
  "title": "Influence of Shopping Orientations, Selected Environmental Dimensions with Apparel Shopping Scenarios, and Attitude on Store Patronage for Female Consumers",
  "type": "Dissertation"
}