{
  "contributor_author": "Chakrabarti, Subhadip",
  "contributor_committeecochair": [
    "Gilles, Robert P.",
    "Haller, Hans H."
  ],
  "contributor_committeemember": [
    "Lutz, Nancy A.",
    "Sarangi, Sudipta",
    "Stegeman, Mark",
    "Eckel, Catherine C."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2011-08-22T19:06:47Z",
  "date_adate": "2004-09-29",
  "date_available": "2011-08-22T19:06:47Z",
  "date_issued": "2004-09-14",
  "date_rdate": "2004-09-29",
  "date_sdate": "2004-09-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Networks, generically, refer to any application of graph theory in economics. Consider an undirected graph where nodes represent players and links represent relationships between them. Players can both form and delete links by which we mean that they can both form new relationships and terminate existing ones. A stable network is one in which no incentives exist to change the network structure. There can be various forms of stability depending on how many links players are allowed to form or delete at a time. Under strong pairwise stability, each player is allowed to delete any number of links at a time while any pair of players can form one link at a time.  We introduce a network-value function, which assigns to each possible network a certain value. The value is allocated according to the component-wise egalitarian allocation rule, which divides the value generated by a component equally among members of the component (where a component refers to a maximally connected subgraph). An efficient network is one that maximizes the network value function. We show that there is an underlying conflict between strong pairwise stability and efficiency. Efficient networks are not necessarily strongly pairwise stable. This conflict can be resolved only if value functions satisfy a certain property called \"middlemen-security\". We further find that there is a broad class of networks called \"middlemen-free networks\" for which the above condition is automatically satisfied under all possible value functions. We also look at three network applications. A peering contract is an arrangement between Internet Service Providers under which they exchange traffic with one another free of cost. We analyze incentives for peering contracts among Internet service providers using the notion of pairwise stability.  A hierarchy is a directed graph with an explicit top-down structure where each pair of linked agents have a superior-subordinate relationship with each other. We apply the notion of conjunctive permission value to demonstrate the formation of hierarchical firms in a competitive labor market. Comparative or targeted advertising is defined as any form of advertising where a firm directly or indirectly names a competitor. We also examine a model of targeted advertising between oligopolistic firms using non-cooperative game theoretic tools.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:06:47Z (GMT). No. of bitstreams: 1 dissertation24.pdf: 1634338 bytes, checksum: c2223d121bf1ccd5cd88a5302ff0f1aa (MD5)   Previous issue date: 2004-09-14",
    "Author Email: schakrab@vt.edu",
    "Advisor Email: nlutz@vt.edu",
    "Advisor Email: sarangi@lsu.edu",
    "Advisor Email: stegeman@vt.edu",
    "Advisor Email: rgilles@vt.edu",
    "Advisor Email: haller@vt.edu",
    "Advisor Email: eckelc@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11256",
  "identifier_other": "etd-09202004-142218",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09202004-142218",
  "identifier_uri": "http://hdl.handle.net/10919/11256",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation24.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Comparative Advertising",
    "Nash Equilibrium",
    "Strong Pairwise Stability",
    "Private Peering",
    "Permission Value"
  ],
  "title": "Network Formation and Economic Applications",
  "type": "Dissertation"
}