{
  "contributor_author": "Scribben, Eric Christopher",
  "contributor_committeechair": "Baird, Donald G.",
  "contributor_committeemember": [
    "Wapperom, Peter",
    "Case, Scott W.",
    "Davis, Richey M.",
    "Wilkes, Garth L.",
    "Rogers, Martin"
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2011-08-22T19:06:44Z",
  "date_adate": "2004-09-17",
  "date_available": "2011-08-22T19:06:44Z",
  "date_issued": "2004-09-02",
  "date_rdate": "2004-09-17",
  "date_sdate": "2004-08-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Thermotropic liquid crystalline polymers (TLCPs) possess a number of physical and mechanical properties such as: excellent chemical resistance, low permeability, low coefficient of thermal expansion, high tensile strength and modulus, and good impact resistance, which make them desirable for use in the storage of cryogenic fluids.  Rotational molding was selected as the processing method for these containers because it is convenient for manufacturing large storage vessels from thermoplastics.  Unfortunately, there are no reports of successful TLCP rotational molding in the technical literature.  The only related work reported involved the static coalescence of two TLCP powders, where three key results were reported that were expected to present problems that preclude the rotational molding process.  The first result was that conventional grinding methods produced powders that were composed of high aspect ratio particles.  Secondly, coalescence was observed to be either slow or incomplete and speculated that the observed difficulties with coalescence may be due to large values of the shear viscosity at low deformation rates.  Finally, complete densification was not observed for the high aspect ratio particles.  However, the nature of these problems were not evaluated to determine if they did, in fact, create processing difficulties for rotational molding or if it was possible to develop solutions to the problems to achieve successful rotational molding. This work is concerned with developing a resin selection method to identify viable TLCP candidates and establish processing conditions for successful rotational molding.  This was accomplished by individually investigating each of the phenomenological steps of rotational molding to determine the requirements for acceptable performance in, or successful completion of, each step.  The fundamental steps were: the characteristics and behavior of the powder in solids flow, the coalescence behavior of isolated particles, and the coalescence behavior of the bulk powder.  The conditions identified in each step were then evaluated in a single-axis, laboratory scale, rotational molding unit.  Finally, the rotationally molded product was evaluated by measuring several physical and mechanical properties to establish the effectiveness of the selection method. In addition to the development and verification of the proposed TLCP selection method, several significant results that pertain to the storage of cryogenic fluids were identified as the result of this work.  The first, and argueably the most significant, was that the selection method led to the successful extension of the rotational molding process to include TLCPs.  Also, the established mechanical properties were found to be similar to rotationally molded flexible chain polymers.  The biaxial rotationally molded container was capable of performing to the specified requirements for cryogenic storage: withstand pressures up to 34 psi at both cryogenic and room temperatures, retain nitrogen as a gas and as a cryogenic liquid, the mechanical preform retaining nitrogen, as both a gas and as a cryogenic liquid, and resist the development of micro-cracks during thermal cycling to cryogenic conditions.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:06:44Z (GMT). No. of bitstreams: 1 Selection_of_Thermotropic_Liquid_Crystalline_Polymers_for_Rotational_Molding.pdf: 8334796 bytes, checksum: 039a77dad240a7801bd5d9cbf4ffb337 (MD5)   Previous issue date: 2004-09-02",
    "Author Email: scribben@vt.edu",
    "Advisor Email: wapperom@math.vt.edu",
    "Advisor Email: scase@exchange.vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: rogersm@lunainnovations.com"
  ],
  "format_medium": "ETD",
  "handle": "11251",
  "identifier_other": "etd-08012004-122651",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08012004-122651",
  "identifier_uri": "http://hdl.handle.net/10919/11251",
  "publisher": "Virginia Tech",
  "relation_haspart": "Selection_of_Thermotropic_Liquid_Crystalline_Polymers_for_Rotational_Molding.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "TLCP",
    "LCP",
    "coalescence",
    "sintering",
    "Rotational Molding"
  ],
  "title": "Selection of Thermotropic Liquid Crystalline Polymers for Rotational Molding",
  "type": "Dissertation"
}