{
  "contributor_author": "Son, Youngsoo",
  "contributor_committeechair": "Lewis, Edwin E.",
  "contributor_committeemember": [
    "Kok, Loke T.",
    "Luckhart, Shirley",
    "Bloomquist, Jeffrey R.",
    "Pfeiffer, Douglas G."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2011-08-22T19:08:27Z",
  "date_adate": "2004-10-05",
  "date_available": "2011-08-22T19:08:27Z",
  "date_issued": "2004-09-15",
  "date_rdate": "2007-10-05",
  "date_sdate": "2004-09-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Otiorhynchus sulcatus (Fabricius) is a serious pest of various horticultural crops in the United States.  Despite its economic importance, this pest remains very challenging to manage.  Integrated Pest Management Program for O. sulcatus has not yet been implemented due to lack of accurate information on its ecology. Investigation of temperature-dependent development and reproduction of O. sulcatus was conducted to enable the prediction of stage emergence more accurately.  Immature-development study at constant temperatures 11-30 oC showed that there was the difference in optimal temperature regime among immature stages, which suggests that temperature can play a role to adapt each stage to the different temperature condition of the season.  By applying mathematical models, optimum temperature for the fastest development was estimated to be 27.5, 25.1, and 24.1 oC for eggs, larvae, and pupae, respectively.  Temperature also significantly influenced the adult reproductive life history traits, including preovipositional period, ovipositional period, longevity, per capita egg production, and egg viability.  At 27 oC or above, reproductive success of O. sulcatus was substantially impaired due to shortened longevity, delayed reproduction, and lowered egg viability.   Endosymbiont bacteria Wolbachia infect many arthropod species and they may alter the reproduction of their hosts.  I first documented that Wolbachia is highly prevalent in O. sulcatus populations in the United States.  Given that two antibiotics (tetracycline and gentamicin) differing only in their efficacy against Wolbachia, results strongly support the hypothesis that Wolbachia may be required for normal egg development of O. sulcatus.   Despite intensive insecticide application, O. sulcatus populations often remain at unacceptable levels.  I ask whether sublethal dosages of newer insecticides, imidacloprid and thiamethoxam, influence offspring production of O. sulcatus adults and its progeny under laboratory conditions.  Weevils that survived short-term exposure to sublethal dosages of imidacloprid and thiamethoxam produce viable offspring when they have access to insecticide-free leaves after the exposure.  Toxicity test showed the potential of imidacloprid and thiamethoxam for the control of first-instars but not for the control of eggs.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:08:27Z (GMT). No. of bitstreams: 9  09Chapter6.pdf: 83862 bytes, checksum: 18cbd7d63a76c60c0bab7ae23f8f06b3 (MD5)  08Chapter5.pdf: 270817 bytes, checksum: 3746051a6d076b7bb3e55f07367adeef (MD5)  07Chapter4.pdf: 319311 bytes, checksum: 7deb2812899fce8377ed410a70cc3310 (MD5)  06Chapter3.pdf: 457766 bytes, checksum: d9b392aabecaf111027486301cf6c88d (MD5)  05Chapter2.pdf: 497096 bytes, checksum: b16e2c2b24d08232b72819f01734da65 (MD5)  04Chapter1.pdf: 424574 bytes, checksum: fb0505d5ba3dc1a51846f2ee0a6e1e48 (MD5)  03TOC.pdf: 115013 bytes, checksum: eeb92fa54a7c0c1acfb21bbe5bfe3c2b (MD5)  02Abstract.pdf: 54903 bytes, checksum: 3b89d00168e06b631c224106e429463c (MD5)  01Title.pdf: 71250 bytes, checksum: 51e6e2f21ee9d63fe3e14adf12a78b0d (MD5)    Previous issue date: 2004-09-15",
    "Author Email: yson@vt.edu",
    "Advisor Email: lewise@vt.edu",
    "Advisor Email: ltkok@vt.edu",
    "Advisor Email: luckhart@vt.edu",
    "Advisor Email: jbquist@vt.edu",
    "Advisor Email: dgpfeiff@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11257",
  "identifier_other": "etd-09172004-145521",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09172004-145521",
  "identifier_uri": "http://hdl.handle.net/10919/11257",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01Title.pdf",
    "02Abstract.pdf",
    "08Chapter5.pdf",
    "07Chapter4.pdf",
    "05Chapter2.pdf",
    "06Chapter3.pdf",
    "09Chapter6.pdf",
    "03TOC.pdf",
    "04Chapter1.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "reproduction",
    "Otiorhynchus sulcatus",
    "development"
  ],
  "title": "Reproduction and development of the black vine weevil  (Coleoptera: Curculionidae) in relation to environmental factors",
  "type": "Dissertation"
}