{
  "contributor_author": "Vichitphan, Kanit",
  "contributor_committeechair": "Newton, William E.",
  "contributor_committeemember": [
    "Chen, Jiann-Shin",
    "Gregory, Eugene M.",
    "White, Robert H.",
    "Larson, Timothy J."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2011-08-22T19:08:29Z",
  "date_adate": "2001-12-28",
  "date_available": "2011-08-22T19:08:29Z",
  "date_issued": "2003-09-17",
  "date_rdate": "2004-02-25",
  "date_sdate": "2001-12-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The FeMo cofactor is one of two types of prosthetic group found in the larger of the two nitrogenase component proteins, called the MoFe protein, and it is strongly implicated as the substrate binding and reduction site.  The glutamine-191 residue in the Alpha-subunit of the MoFe protein of A. vinelandii nitrogenase was targeted for substitution because its side chain is involved in a hydrogen-bond network from one of the terminal carboxylates of the homocitrate component of FeMo cofactor through to the backbone NH of Alpha Gly-61, which is adjacent to Alpha Cys-62, which ligates to the P cluster (the second type of prosthetic group in the MoFe protein).     A variety of altered MoFe proteins produced by the A. vinelandii mutant strains, namely the Alpha Pro-191, Alpha Ser-191, Alpha Thr-191, Alpha His-191, Alpha Glu-191, and Alpha Arg-191 altered MoFe proteins, have been purified to homogeneity and the catalytic properties of these altered MoFe proteins have been compared to those of wild type MoFe protein.  Unlike wild type, the six altered MoFe proteins have decreased catalytic activity on substrate reduction and exhibited H2 evolution that was partially inhibited by added CO.  Moreover, some of altered MoFe proteins with lower specific activity for the C2H4 production can produce C2H6 from C2H2. The results from the pH and activity studies indicate that the substitutions on the MoFe protein have an effect on the contribution of the responsible acid-base group(s) involved in proton transfer for H+- and C2H2-reduction.  Furthermore, the inhibition by CO of hydrogen evolution by these altered MoFe proteins is likely from a lowering of the rate of both electron and proton transfer to the H+- reduction site(s).   Some altered MoFe proteins but not wild type MoFe protein can produce C2H6 from C2H2.  This observation suggested a lower apparent binding affinity for C2H2 and a slower proton transfer to C2H2 reduction with these altered MoFe proteins, which allow the intermediate to stay at the site longer and be further reduced by two electrons and two protons to give C2H6.   These changes in the biochemical properties of these altered MoFe proteins indicate that the Alpha Gln-191 residue is intimately involved in substrate binding and reduction including proton delivery to substrate.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:08:29Z (GMT). No. of bitstreams: 1 KD.pdf: 2562053 bytes, checksum: 139e3e4b672014ffb9c6107fc1fd6b39 (MD5)   Previous issue date: 2003-09-17",
    "Author Email: kanvic@vt.edu",
    "Advisor Email: chenjs@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Advisor Email: wenewton@vt.edu",
    "Advisor Email: rhwhite@vt.edu",
    "Advisor Email: tilarson@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11266",
  "identifier_other": "etd-12272001-160607",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-12272001-160607",
  "identifier_uri": "http://hdl.handle.net/10919/11266",
  "publisher": "Virginia Tech",
  "relation_haspart": "KD.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "MoFe protein",
    "Mo-nitrogenase",
    "Amino acid substitution",
    "Azotobacter vinelandii",
    "Alpha Glutamine-191 residue"
  ],
  "title": "Azotobacter vinelandii Nitrogenase: Effect of Amino-Acid Substitutions at the Alpha Gln-191 Residue of the MoFe Protein on Substrate Reduction and CO Inhibition",
  "type": "Dissertation"
}