{
  "contributor_author": "Thorne, Catherine B.",
  "contributor_committeechair": "Johnson, Scott W.",
  "contributor_committeemember": [
    "Sporakowski, Michael J.",
    "Benson, Mark J.",
    "Piercy, Fred P.",
    "Seidel, Richard W."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2011-08-22T19:08:28Z",
  "date_adate": "2003-10-03",
  "date_available": "2011-08-22T19:08:28Z",
  "date_issued": "2002-04-02",
  "date_rdate": "2004-10-03",
  "date_sdate": "2003-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This qualitative research study was designed to follow-up with ten participants in a relapse prevention program at an inpatient psychiatric unit with a diagnosis of major depression for the purpose of determining their experiences post-discharge in practicing relapse prevention and in pursuing and maintaining wellness in their mental health.  It relied upon narrative theory, theories of self-efficacy, and theories of depression to guide the research process as well as the field of knowledge about rehospitalization, relapse prevention, depression, and self-efficacy.   Participants described depression associated with loss, feeling helpless, powerless, overwhelmed and suicidal.  They increased in their confidence of depression management as their depression got better and they actively managed it.   During the interviews participants expressed themes of connection, with participants feeling disconnected from themselves and others, wanting to be listened to, but feeling unheard or hiding their own voice, a loss of self with healing occurring through use of self, learning cognitively and experientially to manage their depression using specific self-efficacy skills and identifying the things that interfered with depression management.  A relational theory of depression management, based on attachment theory is proposed and several suggestions for research and treatment are made.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:08:28Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 1203534 bytes, checksum: bca9b9c5a031e6f8128747b4b26d8f77 (MD5)   Previous issue date: 2002-04-02",
    "Author Email: cthorne@vt.edu",
    "Advisor Email: eagle1@vt.edu",
    "Advisor Email: mbenson@vt.edu",
    "Advisor Email: swj@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: rseidel@carilion.com"
  ],
  "format_medium": "ETD",
  "handle": "11264",
  "identifier_other": "etd-09262003-124826",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09262003-124826",
  "identifier_uri": "http://hdl.handle.net/10919/11264",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "self-efficacy",
    "self",
    "attachment theory",
    "connection",
    "knowing",
    "depression management",
    "internal family systems theory"
  ],
  "title": "Managing Depression:  Stories of Patients and Their Families Pursuing Mental Health after Psychiatric Hospitalization",
  "type": "Dissertation"
}