{
  "contributor_author": "Thomas, Jay Bradley",
  "contributor_committeechair": "Bodnar, Robert J.",
  "contributor_committeemember": [
    "Tracy, Robert J.",
    "Beard, James S.",
    "Shimizu, Nobu",
    "Sinha, A. Krishna"
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2011-08-22T19:08:28Z",
  "date_adate": "2003-10-02",
  "date_available": "2011-08-22T19:08:28Z",
  "date_issued": "2004-09-15",
  "date_rdate": "2004-10-02",
  "date_sdate": "2003-09-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Silicate melt inclusions (MI) are small samples of melt that are trapped during crystal growth at magmatic pressures and temperatures.  The MI represent a sample of the melt that was isolated from the magma during host crystal growth.   Thus, MI provide a valuable tool for constraining the magmatic history of igneous systems because they provide an unambiguous method to directly determine compositions of melts from which the host crystal grew.  As such, coupled petrographic examination and geochemical analyses of MI and host crystals can reveal information about crystal/melt processes in igneous systems that are difficult (or impossible) to assess through conventional methods.  Many studies have used MI to monitor large scale petrogenetic processes such as partial melting and fractional crystallization.  The research presented below focuses on using MI to constrain processes that operate at the crystal/melt interface because MI are samples of melt that resided adjacent to the host crystal prior to entrapment as an inclusion.  Chapter one addresses challenges associated with preparing small crystals containing MI for geochemical analysis.  In chapter two trace element analyses of MI and the immediately adjacent host zircon crystals are used to determine zircon/melt partition coefficients.  In chapter 3 the significance of boundary layer development adjacent to growing crystals is evaluated by comparing the trace element compositions of MI host crystals that have significantly different trace element mineral/melt partitioning behavior.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:08:28Z (GMT). No. of bitstreams: 1 JThomas.pdf: 1424390 bytes, checksum: cdee2d38d34fbe4cf3648032773349a2 (MD5)   Previous issue date: 2004-09-15",
    "Author Email: jathoma2@vt.edu",
    "Advisor Email: rtracy@vt.edu",
    "Advisor Email: nshimizu@whoi.edu",
    "Advisor Email: pitlab@vt.edu",
    "Advisor Email: bubbles@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11262",
  "identifier_other": "etd-09172003-151229",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09172003-151229",
  "identifier_uri": "http://hdl.handle.net/10919/11262",
  "publisher": "Virginia Tech",
  "relation_haspart": "JThomas.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "boundary layer",
    "geochemistry",
    "melt inclusion",
    "chemical gradient",
    "melt",
    "rare earth element",
    "magma",
    "crystal growth",
    "partition coefficient",
    "trace element"
  ],
  "title": "Melt Inclusion Geochemistry",
  "type": "Dissertation"
}