{
  "contributor_author": "He, Yongqun",
  "contributor_committeechair": "Schurig, Gerhardt G.",
  "contributor_committeemember": [
    "Nagarkatti, Prakash S.",
    "Boyle, Stephen M.",
    "Ahmed, S. Ansar",
    "Sriranganathan, Nammalwar"
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2011-08-22T19:09:11Z",
  "date_adate": "2000-08-09",
  "date_available": "2011-08-22T19:09:11Z",
  "date_issued": "1999-04-08",
  "date_rdate": "2001-08-09",
  "date_sdate": "2000-08-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Although it is known that cell-mediated immunity (CMI) plays a key role in protection against brucellosis, the exact immune mechanisms leading to protection are still not fully understood. Better understanding of the mechanisms would help in the development of a human Brucella vaccine and help in improving animal vaccines. In this research, B. abortus strain RB51 and a closely-related, nonpathogenic Ochrobactrum anthropi (strain 49237) bacterium were used to study the immune response against brucellosis in mice. Both O. anthropi strain 49237 and recombinant strain 49237 expressing Brucella protective antigen copper-zinc superoxide dismutase (Cu/Zn SOD) induced a mix of Th1 and Th2 type immune responses but failed to provide protection against virulent Brucella challenge. After changing the immune response to a predominantly Th1 type of response using CpG oligonucleotides as an adjuvant, both strains provided protection with the recombinant strain inducing significantly higher protection. It was also demonstrated that vaccination with strain RB51 induced Th1 immune responses characterized by high interferon-gamma (IFN-g) production with no interleukin-4 (IL-4) secretion as well as high IgG2a and minimal IgG1 production. A colorimetric cytotoxic T lymphocytes (CTL) assay was developed to demonstrate that strain RB51 induced an antigen-specific CTL reaction that probably plays an important role in protection. The results suggest that optimal protection against brucellosis requires IFN-g-secreting T cells and antigen-specific CTLs. Recombinant strain RB51 overexpressing Brucella Cu/Zn SOD and simultaneously expressing mycobacterial 85A antigen induced higher IFN-g production and CTL activity than the parent RB51 strain. The combined results suggest that the recombinant O. anthropi strain could be used as a human vaccine against brucellosis and that the recombinant RB51 strain could be used as an effective vaccine against both brucellosis and tuberculosis in animals.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:09:11Z (GMT). No. of bitstreams: 1 YHETD.PDF: 1494231 bytes, checksum: e952459e156b85f174b3873557e8a5d7 (MD5)   Previous issue date: 1999-04-08",
    "Author Email: yohe@vt.edu",
    "Advisor Email: pnagarka@vt.edu",
    "Advisor Email: smboyle@vt.edu",
    "Advisor Email: ansrahmd@vt.edu",
    "Advisor Email: nathans@vt.edu",
    "Advisor Email: gschurig@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11276",
  "identifier_other": "etd-08082000-22050059",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08082000-22050059",
  "identifier_uri": "http://hdl.handle.net/10919/11276",
  "publisher": "Virginia Tech",
  "relation_haspart": "YHETD.PDF",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "vaccine",
    "Ochrobactrum anthropi",
    "immune response",
    "Brucella abortus"
  ],
  "title": "Induction of Protection, Antibodies and Cell Mediated Immune Responses by Brucella Abortus Strain RB51, Ochrobactrum Anthropi and Recombinants Thereof",
  "type": "Dissertation"
}