{
  "contributor_author": "Hoover, Carole J.",
  "contributor_committeechair": "Paritzky, Richard S.",
  "contributor_committeemember": [
    "Burge, Penny L.",
    "Lynch, Sherry K.",
    "Murray, Walter",
    "Stewart, Daisy L."
  ],
  "contributor_department": "Education",
  "date_accessioned": "2011-08-22T19:09:12Z",
  "date_adate": "1998-11-19",
  "date_available": "2011-08-22T19:09:12Z",
  "date_issued": "1999-05-05",
  "date_rdate": "1999-11-19",
  "date_sdate": "1998-09-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "This study was conducted to determine the significant factors that affected career aspirations for high school seniors in a suburban school.  It also analyzed differences in females' and minorities' college plans, diploma type, and changes in career aspirations from 1986 to 1996. The research design was a causal comparative statistical analysis replicating a 1986 study at the same school.  In-depth investigations into female and minority aspirations were also expanded in this 1996 study.  The population (N = 577) was 81% Caucasian, 9.5% Asian, 4.5% African American, 4% Hispanic and 1% American Indian. A preliminary survey established the ratings of the occupations based on societal prestige.  Data on career aspiration, ethnicity, gender, parents' education, grade-point average, diploma type and college plans were collected from the seniors using the Harrington-O'Shea career cluster form and two other surveys.  The researcher operationally defined student aspiration levels by assigning the mean occupational rank from the preliminary survey to each student's choice of career.  The seniors' aspiration data were analyzed using Chi-square Tests of Association, One-Way Analyses of Variance, Pearson Correlation and Scheffe comparisons. There was a significant correlation between the 1996 seniors' career aspirations and two variables:  grade-point average (p=.000) and fathers' education (p=.003).  There was a significant relationship between the female seniors' career aspiration and their graduation years, 1986 and 1996 (p=.000); the 1996 females had higher career aspirations.  Both the 1996 female and minority seniors achieved significantly higher percentages of Advanced Studies Diplomas with the Governor's seal (p=.000) and significantly higher percentages of aspirations for college (p=.000) than their 1986 peers.  Another important finding was that the means of female seniors' career aspirations were just as high as their 1996 male counterparts; this was not true in 1986.  Also, the 1996 minority seniors had slightly higher career aspiration means than their Caucasian peers. This study suggests that educators can reflect on what has been done during the last decade to empower females and minorities.  It also challenges educators to continue to seek better curriculum and career opportunity programs to overcome the institutional sexism and racism that may interfere with students' aspirations.",
  "description_degree": "EDD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:09:12Z (GMT). No. of bitstreams: 2  Dissertation.pdf: 791307 bytes, checksum: 5d728d31c6087475902182f32cf9af15 (MD5)  CHabstract.pdf: 24762 bytes, checksum: 73607e81dd2cd460c9ba97c379fe5069 (MD5)    Previous issue date: 1999-05-05",
    "Author Email: choover@robnsonsec.fcps.k12.va.us",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: rparitzk@vt.edu",
    "Advisor Email: sklynch@vt.edu",
    "Advisor Email: daisys@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11279",
  "identifier_other": "etd-92998-8112",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-92998-8112",
  "identifier_uri": "http://hdl.handle.net/10919/11279",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHabstract.pdf",
    "Dissertation.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "gender equity",
    "minority achievement"
  ],
  "title": "Sociological Factors Affecting Career Aspiration Level of High School Seniors",
  "type": "Dissertation"
}