{
  "contributor_author": "Formica, Sandro",
  "contributor_committeechair": "Uysal, Muzaffer S.",
  "contributor_committeemember": [
    "Murrmann, Suzanne K.",
    "McCleary, Ken W.",
    "Littlefield, James E.",
    "Sirgy, M. Joseph"
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2011-08-22T19:08:47Z",
  "date_adate": "2000-11-14",
  "date_available": "2011-08-22T19:08:47Z",
  "date_issued": "2004-09-13",
  "date_rdate": "2001-11-14",
  "date_sdate": "2000-11-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The driving force of the tourism industry is represented by the attractions at destination. Travelers have no reason to visit destinations that have nothing to offer. Tourism research has demonstrated that attraction studies are necessary in the understanding of the elements that encourage people to travel. Achieving the goal of measuring destination attractiveness requires the understanding of its components and their relationships. There are two ways of examining attractiveness: by studying the attractions or by exploring the attractiveness perceptions of those who are attracted by them. As competition among tourism destinations increases and tourist funding decreases, it is of vital importance to understand how the inventory of existing attractions at destination relates to the perceptions that travelers have of those attractions.  Tourism literature provides only a limited number of studies addressing destination attractiveness. Those studies focus exclusively on the measurement aspect of attractiveness and ignore the analysis of its components. The purpose of this study was to generate a new measurement tool for destination attractiveness and to examine the relationship between its elements. The principles of regional analysis, tourism planning, and tourism attraction research provided the foundation for a measurement and hypothesis testing model. This model is based on the assumption that tourism is a system, which is a function of supply and demand interaction. Four attraction dimensions - tourism services and facilities, cultural/historical, rural lodging, and outdoor recreation - were found to represent the attractiveness portfolio of the destination. According to the findings, no correlations were found between demand and supply importance of the four dimensions. Among demand representatives, market segments perceive and value attractions in different ways. The study explored the attractiveness evaluation of eight tourist regions and discovered correlations between demand and supply indicators. Additionally, it was established that the overall regional measures of demand and supply destination attractiveness explain the economic benefits of tourism in the same region. Among the contributions of this study is the development of a model that allows the simultaneous empirical assessment of demand and supply indicators of destination attractiveness. The findings of this study provided important implications for the development of robust tourism plans, promotional strategies, and resource allocation policies.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:08:47Z (GMT). No. of bitstreams: 2  FrontMatterDissertationDefense.pdf: 31823 bytes, checksum: cc60195a095f91da1a0f92620e8c7921 (MD5)  DissertationDefense.pdf: 535241 bytes, checksum: 24cecfaa7ce475c215896b9037224fa3 (MD5)    Previous issue date: 2004-09-13"
  ],
  "format_medium": "ETD",
  "handle": "11273",
  "identifier_other": "etd-11142000-15560052",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11142000-15560052",
  "identifier_uri": "http://hdl.handle.net/10919/11273",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "FrontMatterDissertationDefense.pdf",
    "DissertationDefense.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "tourist attraction",
    "Destination attractiveness",
    "measurement",
    "regional analysis"
  ],
  "title": "Destination Attractiveness As A Function Of Supply And Demand Interaction",
  "type": "Dissertation"
}