{
  "contributor_author": "Hayes, Alec Johnson",
  "contributor_committeechair": "Maroof, M. A. Saghai",
  "contributor_committeemember": [
    "Wilkinson, Carol A.",
    "Buss, Glenn R.",
    "Veilleux, Richard E.",
    "Tolin, Sue A."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2011-08-22T19:09:10Z",
  "date_adate": "1998-08-11",
  "date_available": "2011-08-22T19:09:10Z",
  "date_issued": "2003-08-01",
  "date_rdate": "1999-08-11",
  "date_sdate": "1998-12-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Soybean mosaic virus (SMV), has been the cause of numerous and often devastating disease epidemics, causing reduction in both the quality and quantity of soybeans worldwide.  Two important genes for resistance to SMV are Rsv1 and Rsv4.  Alleles at the Rsv1 locus have been shown to control resistance to all but the most virulent strain of SMV.  This locus has been mapped previously to the soybean F linkage group.  Rsv4 is an SMV resistance locus independent of Rsv1 and confers resistance to all strains of SMV.  This locus has not been mapped previously.  The purpose of this study is to investigate the two genomic regions that contain these vitally important resistance genes. A population of 281 F2 individuals that had previously been genotyped for reaction to SMV was evaluated in a mapping study which combined bulk segregant analysis with Amplified Fragment Length Polymorphism (AFLP).  A Rsv4-linked marker, R4-1, was identified that mapped to soybean linkage group D1b using a reference mapping population.  More than 40 markers were mapped in the Rsv4 segregating population including eleven markers surrounding Rsv4.  This will provide the necessary framework for the fine mapping of this important genetic locus. Previous work has located Rsv1 to a genomic region containing several important resistance genes including Rps3, Rpg1, and Rpv.  An RFLP probe, NBS5, whose sequence closely resembles that of several cloned plant disease resistance genes has been mapped to this chromosomal region.  The efficacy of using this sequence to identify potential disease resistance genes was assessed by screening a cDNA library to uncover a candidate disease resistance gene which corresponds to this NBS5 sequence.  Two related sequence classes were identified that correspond to NBS5.  Interestingly, one class corresponds to a full length gene closely resembling other previously cloned disease resistance genes offering evidence that this NBS5-derived clone is a candidate disease resistance gene. A new marker technique was developed by combining the speed and efficiency of AFLP with DNA sequence information from cloned disease resistance genes. Using this strategy, three new markers tightly linked to Rsv1 were identified.  One of these markers, which maps 0.6 cM away from Rsv1, has motifs consistent with other cloned disease resistance genes, providing evidence that this approach is an efficient method for targeting genomic regions where disease resistance genes are located.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:09:10Z (GMT). No. of bitstreams: 1  Etd2.pdf: 604067 bytes, checksum: 5c44efb6981f1d593175253fa3a6400c (MD5)    Previous issue date: 2003-08-01",
    "Author Email: alhayes@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: Wilki@vt.edu",
    "Advisor Email: gbuss@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: stolin@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11275",
  "identifier_other": "etd-110498-111357",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110498-111357",
  "identifier_uri": "http://hdl.handle.net/10919/11275",
  "publisher": "Virginia Tech",
  "relation_haspart": "Etd2.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "gene cloning",
    "gene mapping",
    "plant disease resistance",
    "AFLP",
    "nucleotide binding site (NBS)",
    "leucine rich repeat (LRR)"
  ],
  "title": "Characterization of the soybean genome in regions surrounding two loci for resistance to soybean mosaic virus",
  "type": "Dissertation"
}