{
  "contributor_author": "Groenke, Susan Lee",
  "contributor_committeechair": "Kelly, Patricia Proudfoot",
  "contributor_committeemember": [
    "Dannenberg, Clare",
    "Bailey, Carol A.",
    "Carico, Kathleen M.",
    "Dubinsky, James M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2011-08-22T19:08:58Z",
  "date_adate": "2003-09-02",
  "date_available": "2011-08-22T19:08:58Z",
  "date_issued": "2000-11-10",
  "date_rdate": "2004-09-02",
  "date_sdate": "2003-08-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examines how multiple, hybridized literacy practices exist in the \"contact zone\" of the classroom, a \"social space where cultures meet, clash, and grapple, with each other, often in contexts of highly asymmetrical relations of power, such as colonialism, slavery, or their aftermaths as they are lived out in many parts of the world today\" (Pratt, 2002, p. 4). The rural high school English class under study here operates as such a \"contact zone,\" as the teacher and students engage in conflicted negotiation, rather than assimilation or acculturation, when multiple literacy practices vie for recognition.  Fieldnotes collected during two months of participant observation, collected artifacts in the form of student written texts, teacher syllabi and school documents, i.e., student handbooks, as well as interviews with three male students, one female student, one teacher, one special education aide, and a school principal provided the data for this study.  Findings make problematic the beliefs that 1) literacy is a homogenous, static, singular either/or phenomenon, i.e., official school literacy or unofficial, and that 2) classrooms represent homogeneous, unified communities of obedient students who share literacy practices. Rather, classrooms, as \"contact zones,\" can represent heterogeneous groups of students whose literacy practices are hybrid and intercultural, grafting together often reactionary, oppressive sociopolitical intentions with officially sanctioned literacy goals.  This inquiry raises questions about literacy as only a local social practice, as well as literacy pedagogical discourses that students do not simply assimilate or acculturate, but contest, appropriate, resist, and use to harass and oppress others, even as they accomplish school literacy assignments.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:08:58Z (GMT). No. of bitstreams: 4 titlepageandabstract.pdf: 59254 bytes, checksum: e4735feacae7547569c1c516082641ac (MD5) Vita.pdf: 180848 bytes, checksum: a60c8a39e58b3c2dbde8d06d9877152e (MD5) DedicationandTableofContents.pdf: 88283 bytes, checksum: ce6c6bcdc23341539303fd4ebee7a436 (MD5) DISSERTATION.pdf: 1069127 bytes, checksum: 2a8a1421977d1dc9d66afcb294166160 (MD5)   Previous issue date: 2000-11-10",
    "Author Email: sgroenke@vt.edu",
    "Advisor Email: cjdannen@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: kcarico@vt.edu",
    "Advisor Email: dubinsky@vt.edu",
    "Advisor Email: kellyp@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11274",
  "identifier_other": "etd-08172003-150141",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08172003-150141",
  "identifier_uri": "http://hdl.handle.net/10919/11274",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Vita.pdf",
    "DedicationandTableofContents.pdf",
    "DISSERTATION.pdf",
    "titlepageandabstract.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "contact zones",
    "rural",
    "literacy",
    "qualitative",
    "secondary"
  ],
  "title": "Troubling Literacy in the \"Contact Zone\" of a Rural High School English Class",
  "type": "Dissertation"
}