{
  "contributor_author": "Sandu, Simonel Ioan",
  "contributor_committeechair": "Hallerman, Eric M.",
  "contributor_committeemember": [
    "McLean, Ewen W.",
    "Helfrich, Louis A.",
    "Brazil, Brian L.",
    "Boardman, Gregory D.",
    "Love, Nancy C."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2011-08-22T19:08:45Z",
  "date_adate": "2004-10-12",
  "date_available": "2011-08-22T19:08:45Z",
  "date_issued": "2003-04-04",
  "date_rdate": "2007-10-12",
  "date_sdate": "2004-10-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Sustainable tilapia production at Blue Ridge Aquaculture (BRA) is constrained by  availability of high quality replacement water. I developed a pilot-scale wastewater treatment system to treat and reuse effluent presently discharged. An initial study was conducted to determine the response of the BRA waste stream to ozone application. Dosages of 6.9, 4.8 and 2.4 g O3 were applied for 30 minutes to 35 L of settled effluent. Optimum ozone dosage and reaction time, ozone transfer efficiency, ozone yield coefficient, degree of pollutant removal, and other ozone and water quality parameters were determined. Most results suggested that the maximum process feasibility limit for ozone contact time was approximately 9 minutes at an applied ozone concentration of 23g/m3 (6.9 g O3 dose). Formation of foam increased solids and COD removal up to three times. Poor removal or accumulation of DOC and TAN was observed, indicating the need for biological treatment following ozonation.  Next, I evaluated a pilot station treatment train including sedimentation, microscreen filtration, fluidized bed denitrification, ozonation, aerobic biological oxidation in a trickling filter, and jar-test chemical flocculation. Significant improvements were found regarding solids, COD, cBOD5, NO3--N, TKN, and turbidity. Removal of foam after ozonation improved ozonation efficacy and pollutant removal.  A nitrogen budget for the BRA facility was derived, indicating that 35% of the nitrogen applied in feed was assimilated in fish. I evaluated the possible impact of residual inorganic nitrogen forms from treated effluent upon fish in the recirculating systems. I found that less than 1% of the TAN produced would return the recovered stream, and that the existing biological contactors can remove it. Evaluation of TAN fate indicated that 84% was oxidized in biofilters, 14% was oxidized by passive nitrification, and 1% was removed by water exchange. For NO3-N, I determined that 56% was removed by passive denitrification and 44% by daily water exchange.  The pilot station design was effective for removing organics and nutrients, and can serve as the basis for scale-up for treating and reusing the entire BRA effluent stream.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:08:45Z (GMT). No. of bitstreams: 1  SimonelSanduDiss.pdf: 1438042 bytes, checksum: 20fde82c7d1b2143fd127b17d3989f21 (MD5)    Previous issue date: 2003-04-04",
    "Author Email: ssandu@vt.edu",
    "Advisor Email: emclean@vt.edu",
    "Advisor Email: lhelfric@vt.edu",
    "Advisor Email: bbrazil@ncccwa.ars.usda.gov",
    "Advisor Email: ehallerm@vt.edu",
    "Advisor Email: gboard@vt.edu",
    "Advisor Email: nlove@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11271",
  "identifier_other": "etd-10042004-145832",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10042004-145832",
  "identifier_uri": "http://hdl.handle.net/10919/11271",
  "publisher": "Virginia Tech",
  "relation_haspart": "SimonelSanduDiss.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "aquaculture",
    "recirculating aquaculture systems",
    "wastewater treatment",
    "pilot plant",
    "ozone",
    "nitrogen budget"
  ],
  "title": "Evaluation of ozone treatment, pilot-scale wastewater treatment plant, and nitrogen budget for Blue Ridge Aquaculture",
  "type": "Dissertation"
}