{
  "contributor_author": "Holley, Barbara Carstarphen",
  "contributor_committeechair": "Curcio, Joan L.",
  "contributor_committeemember": [
    "Parson, Stephen R.",
    "Hoerner, James L.",
    "Lichtman, Marilyn V.",
    "Browning, Susan"
  ],
  "contributor_department": "Educational Administration",
  "date_accessioned": "2011-08-22T19:09:11Z",
  "date_adate": "1998-05-06",
  "date_available": "2011-08-22T19:09:11Z",
  "date_issued": "2000-07-28",
  "date_rdate": "1999-05-06",
  "date_sdate": "1998-04-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "School/business partnerships have become prevalent in our society. There is, however, limited research on why some partnerships at the elementary school level are successful while others are not. This study examined one elementary school's program which was deemed successful to determine how school/business partnerships work in an elementary school.  The factors that make an elementary school/business partnership successful were identified.  The study also examined the source of leadership in the selected partnership program to determine how the leadership impacted the effectiveness of the program.  For the purposes of this study, a successful partnership was one in which the school and business had worked together for at least three years and had documented improvement in student achievement during the partnership years. This school was selected based on the longevity of the partnership and the positive impact the collaborative effort between the school and business has had on the school's program.  An in-depth case study was conducted in the elementary school to determine why the program worked.  Participants were interviewed through qualitative inquiry to gather the factors that led to the successful implementation of the school/business partnership program.  Prior to studying the school's program, a review of the literature was conducted to compare the literature-based success factors to the factors determined in this study. The informants identified several factors that contributed to the success of the partnership. They were: (1)Having a strong steering committee that met on a regular basis; (2) Communicating consistently with group members and encouraging members to express themselves openly; (3) Having the principal actively participate in the partnership; (4) Securing adequate human and financial resources; (5) Gaining support from top level leadership in the business; (6) Providing opportunities for volunteers to work directly with the students; (7) Having the partnership well organized and structured for efficiency; (8) Obtaining committed and dedicated people in both the school and the business; ( 9) Sharing a vision with identified goals; (10) Giving recognition to volunteers, school staff  and the corporation (11) Evaluating the partnership on a regular basis. There was congruency between success factors from the informants and the success factors identified in the literature",
  "description_degree": "EDD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:09:11Z (GMT). No. of bitstreams: 2  frontmatter.pdf: 17603 bytes, checksum: a58117077d9f00cde8eb8a98e945ec54 (MD5)  chapters1-5.pdf: 415841 bytes, checksum: 0cbb8b5acfac0173a6e80c0bf9e72e9e (MD5)    Previous issue date: 2000-07-28",
    "Author Email: baholley@aol.com",
    "Advisor Email: jcurcio@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11278",
  "identifier_other": "etd-32598-141033",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-32598-141033",
  "identifier_uri": "http://hdl.handle.net/10919/11278",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "frontmatter.pdf",
    "chapters1-5.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Elemetary School Partnerships",
    "School-Business Partnerships"
  ],
  "title": "School Business Partnership: a Case Study of an Elementary School Partnership to Determine Factors for Success",
  "type": "Dissertation"
}