{
  "contributor_author": "Williams, Eric Garnell",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "Bardwell, Rebecca",
    "Creamer, Donald G.",
    "Dixon, Benjamin"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2011-08-22T19:09:29Z",
  "date_adate": "2004-11-03",
  "date_available": "2011-08-22T19:09:29Z",
  "date_issued": "2004-10-25",
  "date_rdate": "2004-11-03",
  "date_sdate": "2004-10-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "College enrollment and graduation rates for African Americans remain lower than enrollment and graduation rates for middle and upper-class White students. The lower enrollment and graduation rates have an effect on the number of African American students who pursue the Ph.D. and other research doctorate degrees. In order to increase the number of African Americans and other underrepresented students in the Ph.D. pipeline, the United States Congress passed legislation that created the Ronald E. McNair Postbaccalaureate Achievement Program (McNair Scholars Program) in the mid-1980s. The purpose of the McNair Scholars Program is to prepare college students for doctoral studies and careers in academia through involvement in summer research internships and other scholarly activities. One way in which this program may prepare students is through the development of students' academic, research and social self-efficacy. To date, however little research has been conducted to see if the McNair Scholars Program has an effect on African American students' levels of self-efficacy. The purpose of this study was to compare levels of academic, research and social self-efficacy among African American pre- and post-McNair Scholar participants. Levels of self-efficacy were analyzed by McNair participant status (pre-McNair and post-McNair), gender, college and grade point average. The study employed a national sample of African American pre- and post McNair Scholar Program participants. Data were collected using the Graduate Education Self-Efficacy Scale (GESES), a 57-item instrument designed specifically for this study. Items for the survey were developed utilizing existing literature on academic, research and social self-efficacy. Results revealed significant differences in academic, research and social self-efficacy between African American pre- and post-McNair Scholar Program participants. There were no significant differences by gender on academic, research or social self-efficacy. Neither were significant differences found by college grade level on academic or social self-efficacy. There were, however, significant differences based on college grade level on research self-efficacy. There were also significant interaction effects between gender and college grade level on academic, research and social self-efficacy. The results suggest that participating in the McNair Scholars Program raises levels of academic, research and social self-efficacy among African American college students.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:09:29Z (GMT). No. of bitstreams: 3  Front_Matter.pdf: 19318 bytes, checksum: ec8b470891a2646f7766d346704b1566 (MD5)  Body_Matter.pdf: 173374 bytes, checksum: 9a92df840bf5394a20ee63b5e66a71a1 (MD5)  Appendices.pdf: 53657 bytes, checksum: 38549ac23604a1c91bc7563380d2bfed (MD5)    Previous issue date: 2004-10-25",
    "Author Email: eric.williams@mu.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: rebecca.bardwell@mu.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: bdixon@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11286",
  "identifier_other": "etd-10152004-155400",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10152004-155400",
  "identifier_uri": "http://hdl.handle.net/10919/11286",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Appendices.pdf",
    "Body_Matter.pdf",
    "Front_Matter.pdf"
  ],
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "McNair Scholars Program",
    "Social Self-Efficacy",
    "Research Self-Efficacy",
    "Academic Self-Efficacy",
    "Self-Efficacy",
    "African American Students"
  ],
  "title": "Academic, Research, and Social Self-Efficacy among African American Pre-McNair Scholar Participants and African American Post-McNair Scholar Participants",
  "type": "Dissertation"
}