{
  "contributor_author": "Karabay, Arzu",
  "contributor_committeechair": "Walker, Richard A.",
  "contributor_committeemember": [
    "Esen, Asim",
    "Wong, Eric A.",
    "Rutherford, Charles L.",
    "Winkel, Brenda S. J."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2011-08-22T19:09:12Z",
  "date_adate": "2000-04-17",
  "date_available": "2011-08-22T19:09:12Z",
  "date_issued": "1998-04-06",
  "date_rdate": "2004-04-03",
  "date_sdate": "2000-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Drosophila nonclaret disjunctional (Ncd) is a kinesin-like C-terminal motor protein that is involved in spindle assembly in oocytes during meiosis and in spindle maintenance in early embryos during mitosis.  Ncd interacts with both \"highway\" and \"cargo\" microtubules (MTs) in meiotic and mitotic spindles through the action of ATP-dependent and ATP-independent MT binding sites in the head and tail domains, respectively.  Through the action of these binding sites, Ncd bundles and, perhaps, slides MTs relative to each other.  These functions are important for the in vivo role of Ncd in the formation of the bipolar spindle and maintenance of the spindle assembly.   Despite the high homology of the Ncd head domain to the kinesin head domain, the Ncd tail domain is unique among kinesin-like motor proteins.  Characterization of ATP-independent interactions of Ncd with cargo MTs and identification of MT binding sites (located in amino acid residues 83-100 and 115-187) in the tail region by MT co-sedimentation assays revealed that the Ncd tail has functional similarities to microtubule-associated proteins, especially to tau and MAP2, that regulate MT assembly.  Like tau MT binding motifs, MT binding sites of the tail domain are rich in basic amino acids that are flanked by proline residues.  Cross-linking and MT co-sedimentation assays with subtilisin-digested MTs demonstrated that Ncd tail binding sites (located at the extreme C-terminus and in the H11-H12 loop / H12 helix of each tubulin monomer) on tubulin correspond to tau binding sites.  Further, the Ncd tail domain, like tau, can promote and stabilize MT assembly   under conditions that induce MT disassembly.   Taken together, these results suggest that the Ncd tail functions both in the transport of cargo MTs to spindle poles for the formation of the spindle assembly during meiosis, and in maintenance of spindle assembly during mitosis.  How these different functions of Ncd are regulated still remains unknown, however further understanding of the regulation of Ncd function should contribute to our knowledge of cell cycle regulation in both meiotic and mitotic cells.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:09:12Z (GMT). No. of bitstreams: 1  ETD.pdf: 565557 bytes, checksum: ddfb1416cd1af6ea364f28ceca03fb19 (MD5)    Previous issue date: 1998-04-06",
    "Author Email: akarabay@vt.edu",
    "Advisor Email: aevatan@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: rawalker@vt.edu",
    "Advisor Email: rutherfo@vt.edu",
    "Advisor Email: shirley@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11280",
  "identifier_other": "etd-04132000-19160016",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132000-19160016",
  "identifier_uri": "http://hdl.handle.net/10919/11280",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "MICROTUBULES",
    "KINESIN",
    "NCD",
    "TUBULIN",
    "SUBTILISIN"
  ],
  "title": "Ncd Motor Tail Domain Interactions With Microtubules",
  "type": "Dissertation"
}