{
  "contributor_author": "Rieser, Christian James",
  "contributor_committeechair": "Bostian, Charles W.",
  "contributor_committeemember": [
    "Woerner, Brain D.",
    "Sweeney, Dennis G.",
    "Martin, Thomas L.",
    "Morgan, George E.",
    "Midkiff, Scott F."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2011-08-22T19:09:13Z",
  "date_adate": "2004-10-22",
  "date_available": "2011-08-22T19:09:13Z",
  "date_issued": "2004-09-29",
  "date_rdate": "2004-10-22",
  "date_sdate": "2004-10-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research focuses on developing a cognitive radio that could operate reliably in unforeseen communications environments like those faced by the disaster and emergency response communities. Cognitive radios may also offer the potential to open up secondary or complimentary spectrum markets, effectively easing the perceived spectrum crunch while providing new competitive wireless services to the consumer. A structure and process for embedding cognition in a radio is presented, including discussion of how the mechanism was derived from the human learning process and mapped to a mathematical formalism called the BioCR. Results from the implementation and testing of the model in a hardware test bed and simulation test bench are presented, with a focus on rapidly deployable disaster communications. Research contributions include developing a biologically inspired model of cognition in a radio architecture, proposing that genetic algorithm operations could be used to realize this model, developing an algorithmic framework to realize the cognition mechanism, developing a cognitive radio simulation toolset for evaluating the behavior the cognitive engine, and using this toolset to analyze the cognitive engineÃ Â­s performance in different operational scenarios. Specifically, this research proposes and details how the chaotic meta-knowledge search, optimization, and machine learning properties of distributed genetic algorithm operations could be used to map this model to a computable mathematical framework in conjunction with dynamic multi-stage distributed memories. The system formalism is contrasted with existing cognitive radio approaches, including traditionally brittle artificial intelligence approaches. The cognitive engine architecture and algorithmic framework is developed and introduced, including the Wireless Channel Genetic Algorithm (WCGA), Wireless System Genetic Algorithm (WSGA), and Cognitive System Monitor (CSM). Experimental results show that the cognitive engine finds the best tradeoff between a host radio's operational parameters in changing wireless conditions, while the baseline adaptive controller only increases or decreases its data rate based on a threshold, often wasting usable bandwidth or excess power when it is not needed due its inability to learn. Limitations of this approach include some situations where the engine did not respond properly due to sensitivity in algorithm parameters, exhibiting ghosting of answers, bouncing back and forth between solutions. Future research could be pursued to probe the limits of the engineÃ Â­s operation and investigate opportunities for improvement, including how best to configure the genetic algorithms and engine mathematics to avoid engine solution errors. Future research also could include extending the cognitive engine to a cognitive radio network and investigating implications for secure communications.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:09:13Z (GMT). No. of bitstreams: 1  CJRieserVTPhDEEDissertation101804.pdf: 1870818 bytes, checksum: cd0046c016ea13c8ea7649bf146c3eca (MD5)    Previous issue date: 2004-09-29",
    "Author Email: cjrieser@ieee.org",
    "Advisor Email: woerner@vt.edu",
    "Advisor Email: dsweeney@vt.edu",
    "Advisor Email: tlmartin@vt.edu",
    "Advisor Email: gmorgan@vt.edu",
    "Advisor Email: midkiff@vt.edu",
    "Advisor Email: bostian@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11283",
  "identifier_other": "etd-10142004-023653",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10142004-023653",
  "identifier_uri": "http://hdl.handle.net/10919/11283",
  "publisher": "Virginia Tech",
  "relation_haspart": "CJRieserVTPhDEEDissertation101804.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Distributed",
    "Cognitive Radio",
    "Biologically Inspired",
    "Rapidly Deployable",
    "Communications",
    "Networking",
    "Secure",
    "Robust",
    "Genetic Algorithms",
    "Disaster Response"
  ],
  "title": "Biologically Inspired Cognitive Radio Engine Model Utilizing Distributed Genetic Algorithms for Secure and Robust Wireless Communications and Networking",
  "type": "Dissertation"
}