{
  "contributor_author": "Earl, Stevan Ross",
  "contributor_committeechair": "Valett, H. Maurice",
  "contributor_committeemember": [
    "Dillaha, Theo A. III",
    "Benfield, Ernest Fredrick",
    "Peterson, C. G.",
    "Webster, Jackson R."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2011-08-22T19:09:13Z",
  "date_adate": "2004-10-26",
  "date_available": "2011-08-22T19:09:13Z",
  "date_issued": "2004-09-06",
  "date_rdate": "2006-10-26",
  "date_sdate": "2004-10-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is a study of the relationships between nitrogen (N) availability and spiraling (the paired processes of nutrient cycling and advective transport) in stream ecosystems.  Anthropogenic activities have greatly increased rates of N loading to aquatic ecosystems.  However, streams may be important sites for retention, removal, and transformation of N.  In order to identify controls on NO3-N spiraling in anthropogenically impacted streams, I examined relationships among NO3-N spiraling and a suite of chemical, physical, and biological variables in streams spanning a gradient of N concentration.  Across all streams, gross primary production (GPP) accounted for most NO3-N demand.  Uptake of NO3-N was also related to GPP but was limited by N availability when N concentrations were low.  A combination of GPP and NO3-N explained 80% of the variance in uptake.  In chapter 3, I conducted a series of short-term nutrient releases in which streamwater NO3-N concentration was incrementally elevated to identify conditions leading to saturation of uptake capacity.  Four of six study streams showed signs of N limitation whereas there was no significant change in uptake with increasing NO3-N amendment in two streams, suggesting N saturation.  Proximity to saturation was generally correlated to N concentration but was also predicted by the ratio of N:P.  My results suggest complex relationships between N spiraling and availability that depend on resident biota and other limiting factors.  In chapter 4, I examined nutrient spiraling methodology by comparing differences between ambient and amendment-derived NO3-N spiraling metrics.  I quantified spiraling metrics during a short-term NO3-N amendment and under ambient conditions using a stable isotope (15NO3-N) tracer.  Uptake lengths measured during amendments were consistently longer than ambient uptake lengths.  Amendment-derived NO3-N uptake velocity and uptake were underestimated relative to ambient conditions.  Using a technique to estimate ambient uptake length extrapolated from the relationship between uptake length and nutrient amendment concentration for a series of amendments at different concentrations, I found that extrapolated uptake lengths were generally better predictors of ambient uptake lengths than amendment-derived uptake lengths but the technique was less effective in high N streams that showed signs of weak N limitation.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:09:13Z (GMT). No. of bitstreams: 1  etd.pdf: 1095794 bytes, checksum: d21a84a7e364178897ad7d3a3596142e (MD5)    Previous issue date: 2004-09-06",
    "Author Email: searl@vt.edu",
    "Advisor Email: dillaha@vt.edu",
    "Advisor Email: benfield@vt.edu",
    "Advisor Email: mvalett@vt.edu",
    "Advisor Email: cpeters@wpo.it.luc.edu",
    "Advisor Email: jwebster@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11284",
  "identifier_other": "etd-10182004-182304",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10182004-182304",
  "identifier_uri": "http://hdl.handle.net/10919/11284",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "stream structure and function",
    "nitrogen",
    "spiraling",
    "stream biogeochemistry"
  ],
  "title": "Nitrogen spiraling in stream ecosystems spanning a gradient of chronic nitrogen loading",
  "type": "Dissertation"
}