{
  "contributor_author": "Draper, Sonya R.",
  "contributor_committeechair": "Sanders, Mark E.",
  "contributor_committeecochair": "Driscoll, Lisa G.",
  "contributor_committeemember": [
    "Scales, Glenda Rose",
    "Pendergrass, Barbara J.",
    "Dixon, Benjamin"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2011-08-22T19:09:29Z",
  "date_adate": "2004-10-29",
  "date_available": "2011-08-22T19:09:29Z",
  "date_issued": "2004-09-15",
  "date_rdate": "2004-10-29",
  "date_sdate": "2004-09-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated whether in a modular technology education (MTE) classroom, gender groupings and learning styles predicted degree of curiosity. Based on the assumption that gender grouping and learning style are factors that influence the degree of curiosity of both individuals and teams, it was hypothesized that a student's learning style (i.e., Accommodating, Converging, Diverging, and Assimilating) and gender grouping (girl/girl, boy/boy, and girl/boy) at the module would be essential elements to consider when measuring the degree of curiosity of learners in MTE classrooms.  During a meeting with the deputy superintendent and the technology education supervisor in a mid-sized, suburban public school district in Virginia, three MTE teachers from different schools were identified to participate in this study in the spring of 2004. The sample for this study consisted of middle school students (n = 116; 22 girls and 94 boys, grades 6-8) enrolled in technology education classes using Synergistic SystemsTM modules. Students completed three consecutive MTE activities. This study was conducted in the technology education classroom in three different middle schools. Schools were classified as School A, B or C.  Students selected technology education as an elective subject. Kolb's Learning Style Inventory (LSI), Version 3 was used to identify students' preferred learning style. The My Point of View (MyPOV) instrument adapted by Brusic and based on Leherissey's instrument, the State Epistemic Curiosity Scale (SECS), was used to measure individual degree of curiosity. The MyPOV instrument was administered three times; once after each module. Data was analyzed using a multiple linear regression analysis.  Descriptive statistical analysis revealed that boys (81%; n = 94) continue to outnumber girls (19%; n = 22) in technology education classrooms. Participants (n = 101) preferred the following learning styles as identified by the LSI: Accommodating (35%), learning from \"hands-on\" experience, followed by Diverging (25%), preferring to brainstorm ideas, Assimilating (24%), interested in abstract ideas and concepts, and Converging (17%), rather deal with technical tasks and problems.         Mean curiosity scores for students were analyzed by school. Results revealed scores from School B were lower than students at Schools A and C as measured by the MyPOV instrument. Mean curiosity scores for students were also analyzed by gender, learning style, and gender grouping. Statistics revealed that scores for girls were higher than boys. An independent-samples t-test was done to evaluate the difference between the means of the genders. According to the analyses, the tests were not significant, t(108) = .932, p = .353 (Score 1), t(110) = 1.282, p = .202 (Score 2), and t(104) = 1.564, p = .121 (Score 3). Overall scores for girl/girl groupings were higher than girl/boy and boy/boy groupings, and scores for girl/boy groupings were higher than boy/boy groupings. A one-way analysis of variance was conducted to evaluate whether the gender grouping means differed significantly from each other. According to the analyses, the F-tests revealed no significant differences in gender groupings, F(2, 97) = 1.65, p = .198 (Score 1), F(2, 95) = .50, p = .608 (Score 2), and F(2, 92) = 1.84, p = .165 (Score 3). Additionally, curiosity scores for students by learning styles showed that participants that preferred to deal with technical tasks and problems or Converging had the highest scores followed by Assimilating, Accommodating and Diverging. A multiple regression analysis was conducted to test if there was a significant relationship between the pairing of students of different gender groupings and different learning styles in the prediction of degree of curiosity. The F-tests revealed that the linear combination of gender groupings and learning styles for the three schools were not significantly related to degree of curiosity, R2 = .09, adjusted R2 = .04, F(5, 86) = 1.65, p = .155 (Score 1), R2 = .09, adjusted R2 = .04, F(4, 79) = 1.84 , p = .130 (Score 2), and R2 = .02, adjusted R2 = -.03, F(4, 73) = .382, p = .821 (Score 3). The t-tests analyses indicated that the Converging learning style, t(79) = 2.06, p =.043, in Score 2 was the only significant predictor variable with this sample. Although it seems that learning style and gender grouping might predict degree of curiosity in MTE laboratories, this assumption was not supported by this study.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:09:29Z (GMT). No. of bitstreams: 1  DraperSonya.pdf: 521729 bytes, checksum: cfd4db7ecf2148071e5e6879e183aa0b (MD5)    Previous issue date: 2004-09-15",
    "Author Email: sdraper@vt.edu",
    "Advisor Email: gscales@vt.edu",
    "Advisor Email: bpender@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: msanders@vt.edu",
    "Advisor Email: bdixon@vt.edu"
  ],
  "format_medium": "ETD",
  "handle": "11285",
  "identifier_other": "etd-09272004-141026",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09272004-141026",
  "identifier_uri": "http://hdl.handle.net/10919/11285",
  "publisher": "Virginia Tech",
  "relation_haspart": "DraperSonya.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "middle school",
    "gender",
    "learning style",
    "curiosity",
    "module",
    "technology education"
  ],
  "title": "The Effects of Gender Grouping and Learning Style on Student Curiosity in Modular Technology Education Laboratories",
  "type": "Dissertation"
}