{
  "contributor_author": "Chin, George",
  "contributor_committeechair": "Rosson, Mary Beth",
  "contributor_committeemember": [
    "Burton, John K.",
    "Kafura, Dennis G.",
    "Carroll, John M.",
    "Fox, Edward Alan"
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2011-08-22T19:09:12Z",
  "date_adate": "2004-10-22",
  "date_available": "2011-08-22T19:09:12Z",
  "date_issued": "2004-08-02",
  "date_rdate": "2004-10-22",
  "date_sdate": "2004-09-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Educational technology research studies have found computer and software technologies to be underutilized in U.S. classrooms.  In general, many teachers have had difficulty integrating computer and software technologies into learning activities and classroom curricula because specific technologies are ill-suited to their needs, or they lack the ability to make effective use of these technologies.  In the development of commercial and business applications, participatory design approaches have been applied to facilitate the direct participation of users in system analysis and design.  Among the benefits of participatory design include mutual learning between users and developers, envisionment of software products and their use contexts, empowerment of users in analysis and design, grounding of design in the practices of users, and growth of users as designers and champions of technology.  In the context of educational technology development, these similar consequences of participatory design may lead to more appropriate and effective education systems as well as greater capacities by teachers to apply and integrate educational systems into their teaching and classroom practices. We present a case study of a participatory design project that took place over a period of two and one half years, and in which teachers and developers engaged in the participatory analysis and design of a collaborative science learning environment. A significant aspect of the project was the development methodology we followed - Progressive Design.  Progressive Design evolved as an integration of methods for participatory design, ethnography, and scenario-based design.  In this dissertation, we describe the Progressive Design approach, how it was used, and its specific impacts and effects on the development of educational systems and the social and cognitive growth of teachers.",
  "description_degree": "PhD",
  "description_provenance": [
    "ETDs_20110726_kdweeks",
    "unrestricted",
    "Made available in DSpace on 2011-08-22T19:09:12Z (GMT). No. of bitstreams: 1  01full_diss.pdf: 6670029 bytes, checksum: f958c01b934e7a4bfe5bd2b565e34f82 (MD5)    Previous issue date: 2004-08-02",
    "Author Email: gchin_1@charter.net",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: kafura@cs.vt.edu",
    "Advisor Email: jcarroll@ist.psu.edu",
    "Advisor Email: fox@cs.vt.edu",
    "Advisor Email: mrosson@psu.edu"
  ],
  "format_medium": "ETD",
  "handle": "11281",
  "identifier_other": "etd-09222004-130239",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09222004-130239",
  "identifier_uri": "http://hdl.handle.net/10919/11281",
  "publisher": "Virginia Tech",
  "relation_haspart": "01full_diss.pdf",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "ethnography",
    "collaborative learning",
    "scenario-based design",
    "educational technology",
    "participatory design",
    "collaborative learning environments"
  ],
  "title": "A Case Study in the Participatory Design of a Collaborative Science-Based Learning Environment",
  "type": "Dissertation"
}