{
  "contributor_author": "Liu, Zhen",
  "contributor_committeechair": "Cao, Yang",
  "contributor_committeemember": [
    "Xing, Jianhua",
    "Murali, T M",
    "Sandu, Adrian",
    "Shaffer, Clifford A"
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2013-02-19T22:31:37Z",
  "date_available": "2013-02-19T22:31:37Z",
  "date_issued": "2012-11-13",
  "degree_discipline": "Computer Science and Applications",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "In this thesis we study stochastic modeling and simulation methods for biochemical systems. The thesis is focused on systems with multi-state and multi-scale features and divided into two parts. In the first part, we propose new algorithms that improve existing multi-state simulation methods. We first compare the well known Gillespie\\\\\\'s stochastic simulation algorithm (SSA) with the StochSim, an agent-based simulation method. Based on the analysis, we propose a hybrid method that possesses the advantages of both methods. Then we propose two new methods that extend the Network-Free Algorithm (NFA) for rule-based models. Numerical results are provided to show the performance improvement by our new methods. In the second part, we investigate two simulation schemes for the multi-scale feature: Haseltine and Rawlings\\\\\\' hybrid method and the quasi-steady-state stochastic simulation method. We first propose an efficient partitioning strategy for the hybrid method and an efficient way of building stochastic cell cycle models with this new partitioning strategy. Then, to understand conditions where the two simulation methods can be applied, we develop a way to estimate the relaxation time of the fast sub-network, and compare it with the firing interval of the slow sub-network. Our analysis are verified by numerical experiments on different realistic biochemical models.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:31:37Z (GMT). No. of bitstreams: 1 Liu_Z_D_2012.pdf: 1470178 bytes, checksum: 3dbbc176b1f090daabc7114167901be2 (MD5)   Previous issue date: 2012-11-13",
  "format_medium": "ETD",
  "handle": "19191",
  "identifier_other": "vt_gsexam:102",
  "identifier_uri": "http://hdl.handle.net/10919/19191",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "SSA",
    "Stochsim",
    "rule-based modeling",
    "QSSA",
    "hybrid method"
  ],
  "title": "Stochastic Simulation Methods for Biochemical Systems with Multi-state and Multi-scale Features",
  "type": "Dissertation"
}