{
  "contributor_author": "Ghoston, Michelle Renee",
  "contributor_committeechair": "Lawson, Gerard Francis",
  "contributor_committeemember": [
    "Chang, Mido",
    "Flynn, Christopher",
    "Welfare, Laura Everhart"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-02-19T22:35:06Z",
  "date_available": "2013-02-19T22:35:06Z",
  "date_issued": "2012-12-10",
  "degree_discipline": "Counselor Education",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Community colleges across the country have continued to expand since the inception of Joliet<br />Junior College in 1901. The American Association of Community Colleges (AACC, 2010) reported that there are 1,173 community colleges in America, of which 987 are public institutions of higher learning. Additional statistics indicate that there are almost twelve million students enrolled in the community college system (AACC, 2010). Over the years many changes have occurred that affect who attends community college, no change more<br />significant than the focus on meeting the needs of a diverse population. Many unique characteristics, such as being of minority status, being financially disadvantaged, and being a first- generation American make up this diverse new student population. Another unique characteristic of the new student population is being of non-traditional age, which is defined as 25 years old or older (Bean & Metzner, 1985; Cohen & Brawer, 1989; Crosta, Calcagno, Jenkins, & Bailey 2006). Little empirical research has been conducted examining this new population of non-traditional students\\' ability to complete their goals when selecting to attend community college, especially in the state of Virginia (Sorey, 2006). Through quantitative methodology, utilizing a cross-sectional design, the purpose of this study was to identify non-academic social and emotional factors that are related to the ability of nontraditional<br />students to persist towards their academic goals within the Virginia Community College System (VCCS). This study included a sample of 1694 students. Their responses to an<br />electronic survey questionnaire of non-traditional students within the VCCS were analyzed to provide descriptive data, correlations, and mean differences. The findings indicate that<br />participants in this study are dealing with multiple non-academic social and emotional factors<br />that may require readjustment in their lives. Further participants in this study perceived<br />themselves as being stressed. Finally, 12.9% of participants endorsed a moderate level of<br />psychological distress and 4.2% of participants endorsed a serious level of psychological distress. The positive correlation between perceived stress and psychological distress supports the need of additional resources, for non-traditional students at the community college level within the Commonwealth of Virginia.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:35:06Z (GMT). No. of bitstreams: 1 Ghoston_MR_D_2012.pdf: 902114 bytes, checksum: bb0de92a9a16985ffcf5d76ce8c39cad (MD5)   Previous issue date: 2012-12-10",
  "format_medium": "ETD",
  "handle": "19195",
  "identifier_other": "vt_gsexam:57",
  "identifier_uri": "http://hdl.handle.net/10919/19195",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Non-traditional students",
    "Persistence",
    "Community College"
  ],
  "title": "NON- ACADEMIC FACTORS THAT PREDICT PERSISTENCE OF NON-TRADITIONAL STUDENTS ATTENDING COMMUNITY COLLEGE IN THE  COMMONWEALTH OF VIRGINIA",
  "type": "Dissertation"
}