{
  "contributor_author": "Poudyal, Niraj",
  "contributor_committeechair": "Spanos, Aris",
  "contributor_committeemember": [
    "Tsang, Kwok Ping",
    "Haller, Hans H",
    "Ashley, Richard A"
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2013-02-19T22:35:15Z",
  "date_available": "2013-02-19T22:35:15Z",
  "date_issued": "2012-12-07",
  "degree_discipline": "Economics, Science",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The primary objective of this is to confront the DSGE model (Ireland, 2011) with data in an attempt to evaluate its empirical adequacy. The perspective used for this evaluation is based on unveiling the statistical model (structural VAR) behind the DSGE model, with a view to test its probabilistic assumptions vis-a-vis the data. It is shown that the implicit statistical model is seriously misspecified and the information from mis-specification (M-S) testing is then used to respecify the original structural VAR in an attempt to achieve statistical adequacy. The latter provides a precondition for the reliability of any inference based on the statistical model. Once the statistical adequacy of the respecified model is secured through thorough M-S testing, inferences like the likelihood-ratio test for the overidentifying restrictions, forecasting, impulse response analysis are applied to the original DSGE model to evaluate its empirical adequacy. At the end, the same inferential procedure is applied to the CAPM model.     <br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:35:15Z (GMT). No. of bitstreams: 1 Poudyal_N_D_2012.pdf: 1257423 bytes, checksum: b141b415234e7f56101158dc5188d1f3 (MD5)   Previous issue date: 2012-12-07",
  "format_medium": "ETD",
  "handle": "19197",
  "identifier_other": "vt_gsexam:101",
  "identifier_uri": "http://hdl.handle.net/10919/19197",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "DSGE model",
    "statistical adequacy",
    "VAR",
    "Student's t VAR",
    "misspecification testing"
  ],
  "title": "Confronting Theory with Data: the Case of DSGE Modeling",
  "type": "Dissertation"
}