{
  "contributor_author": "Jennings, Samuel Raymond",
  "contributor_committeechair": "Cennamo, Katherine S",
  "contributor_committeemember": [
    "Potter, Kenneth R",
    "Moore, David M",
    "Lockee, Barbara B"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2013-02-19T22:35:49Z",
  "date_available": "2013-02-19T22:35:49Z",
  "date_issued": "2012-12-20",
  "degree_discipline": "Curriculum and Instruction",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Social psychologists believe that attitudes occur both implicitly and explicitly suggesting that people can think, feel, and behave in ways that are counter to their outward views. Researchers within the field of instructional technology have proposed treatments for explicit attitude manipulation within an instructional situation but have yet to implement strategies that encompass implicit attitudes. Researchers from both fields concur that attitudes are malleable and can be manipulated with appropriate intervention strategies (Bertrand et al., 2005; Dasgupta & Greenwald, 2001; Dick & Carey, 1996; Gagné, Briggs, & Wager, 1988; Kamradt & Kamradt, 1999; Krathwohl, Bloom, & Masia, 1964).<br />The purpose of this study was to investigate  the effectiveness of instructional design strategies intended to influence implicit and explicit attitudes in the direction of a  target attitude. The predominant strategies for attitude manipulation prescribed in the instructional design and technology literature were combined and adapted for online delivery. In addition, proven strategies from social psychology research were integrated into the existing instructional design strategies for implicit attitude manipulation. The independent variable for this experimental study consisted of the prescribed instructional strategies for influencing both implicit and explicit attitudes. For the purpose of this study, the attitude that the instruction was designed to address was the reduction of biased-based policing, thus, the dependent variables were implicit attitudes as measured by the Race Implicit Association Test (IAT), and explicit attitudes as measured by the Symbolic Racism Test 2000 (SR2K).<br />Fifty volunteers were randomly assigned to one of two instructional modules. One module served as a control for 25 of the participants. The second module served as a treatment for the remaining 25 participants. The treatment was based on the incorporation of the recommended strategies for attitudinal instruction found in the literature.  <br />Implicit attitude assessment revealed that there was no statistically significant difference between the control and treatment groups as measured by the Race Implicit Association Test (Race IAT). Furthermore, explicit attitude assessment also revealed that that there was no statistically significant difference between the control and treatment groups as measured by the Symbolic Racism Test 2000 (SR2K).<br />However, there were several limitations that may have affected the study. As a result, we still do not know for certain how the incorporation of attitudinal strategies within web-based instruction influence implicit and explicit attitudes.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:35:49Z (GMT). No. of bitstreams: 3 Jennings_SR_D_2012.pdf: 1918822 bytes, checksum: db123854ccc3f5910311fc103cee5ac7 (MD5) Jennings_SR_D_2012_support_1.pdf: 421194 bytes, checksum: ebad6a9df1ba726c7180f278b6dca96e (MD5) Jennings_SR_D_2012_support_2.pdf: 135823 bytes, checksum: da1544a77c5303cb7bc49f91b035b735 (MD5)   Previous issue date: 2012-12-20",
  "format_medium": "ETD",
  "handle": "19204",
  "identifier_other": "vt_gsexam:32",
  "identifier_uri": "http://hdl.handle.net/10919/19204",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "attitudinal instruction",
    "attitudes",
    "attitudinal strategies"
  ],
  "title": "Structured Design Strategies for Attitude Instruction",
  "type": "Dissertation"
}