{
  "contributor_author": "Hightower, Lisa Sarah",
  "contributor_committeechair": "Niewolny, Kimberly Lee",
  "contributor_committeemember": [
    "Lambur, Michael T",
    "Brennan, Mark A.",
    "Hull, Robert B"
  ],
  "contributor_department": "Agricultural and Extension Education",
  "date_accessioned": "2013-02-19T22:36:10Z",
  "date_available": "2013-02-19T22:36:10Z",
  "date_issued": "2012-12-06",
  "degree_discipline": "Agricultural and Extension Education",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "African immigrants in the United States (U.S.) experience immense challenges in the form of poverty, unemployment, and underemployment. One strategy used by community development organizations to address these challenges is the development of farm entry programs that assist immigrants in beginning and sustaining farm operations in the United States. Organizations such as Cooperative Extension, resettlement agencies, and African mutual aid associations have developed beginning farmer programs that provide a supportive foundation for immigrant farmers to gain access to farmland, technical training, and markets.  Returning to farming provides African immigrants with a series of benefits including supplemental income, food security, and social integration. Drawing upon social capital theory, this study offers a novel approach to measure the community and economic development outcomes of immigrant farming programs. In this mixed-method program evaluation, immigrant farming programs are analyzed as social networks that connect immigrants to technical training, farming resources, and community members who can provide access to markets. Data were collected through a survey of 112 agricultural educators working with immigrant farming programs across the United States. Data were also collected through case studies of a Midwestern program and a Southern program. The case studies include two focus groups and 20 interviews with individuals associated with the programs as participants, agricultural educators, and community partners. Regression tests were conducted to determine the social capital factors associated with well-being outcomes occurring through the programs. The models show that interaction outside of the program, and access to information are positively associated with well-being outcomes. Analysis of variance tests show differences between programs with African immigrant participants and programs with participants from other world regions. Programs with African immigrants tend to have more requirements to use farming resources compared to programs with immigrants from other world regions. Qualitative analysis found that female African immigrant participants have a lower levels of agency compared to male African immigrant participants. The study concludes with a discussion of recommendations for implementing and evaluating immigrant farming programs, as well as applying social capital theory to the field of agricultural education.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:36:10Z (GMT). No. of bitstreams: 2 Hightower_LS_D_2012.pdf: 7208642 bytes, checksum: 249dc3cfae9e7badc7db8dfa6699509c (MD5) Hightower_LS_D_2012_support_1.pdf: 779624 bytes, checksum: a40b8a5006adb40bc241cabdcbaa0072 (MD5)   Previous issue date: 2012-12-06",
  "format_medium": "ETD",
  "handle": "19208",
  "identifier_other": "vt_gsexam:168",
  "identifier_uri": "http://hdl.handle.net/10919/19208",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "African immigrants",
    "social capital",
    "social networks",
    "community development",
    "immigrant farming programs"
  ],
  "title": "Exploring Immigrant Farming Programs and Social Capital: A Mixed Method Approach to Program Evaluation",
  "type": "Dissertation"
}