{
  "contributor_author": "Witrick, Katherine Amy Thompson",
  "contributor_committeechair": "O'Keefe, Sean F",
  "contributor_committeemember": [
    "Eigel, William N",
    "Tanko, James M",
    "Duncan, Susan E"
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2013-02-19T22:35:45Z",
  "date_available": "2013-02-19T22:35:45Z",
  "date_issued": "2012-12-10",
  "degree_discipline": "Food Science and Technology",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Lambic beer is one of the oldest beer styles still being brewed in the western world today and the only beer that is still brewed through spontaneous fermentation. Lambic beers are only produced within a 500 km radius of Brussels because of the natural microflora found within the air in that region. Little is known about the chemical composition of lambic beers. The objective of this research were (1) to compare SPME and SAFE for the isolation of flavor and aroma compounds,  (2) determine the volatile composition and acids of commercially available lambic gueuze using SPME/GC-MS and HPLC, and (3) determine the major aroma compounds of aging lambic beer using GC-O.  Comparing the two extraction methods, both SPME and SAFE were able to identify a similar number of chemical compounds, however SAFE identified a greater number of acid compounds. A total of 50 compounds were identified within nine commercial brands of lambic beer. HPLC was used in the identification and quantification of acetic and lactic acids. The concentration of acetic acid in the commercial products ranged from 723 mg/L â \" 1624 mg/L and lactic acid ranged from 995 â \" 2557 mg/L. GC-O was used in the analysis of aged (3-28 months) lambic beer samples. As the samples increased in age, the number of aroma compounds detected by the panelists also increased. Panelists were detected nine aroma compounds in the 3 month old sample, while 17 compounds were detected in the 28 month old sample. The research conduct increased the number of volatile and semi-volatile compounds identified in lambic beer from 27 to 50.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:35:45Z (GMT). No. of bitstreams: 2 Witrick_KA_D_2012.pdf: 1901850 bytes, checksum: c5121c6500b7feb2e3c4aec01fbfd6bd (MD5) Witrick_KA_D_2012_support_1.pdf: 260183 bytes, checksum: 04dfa46563de68c2cedf24c1ae3481c7 (MD5)   Previous issue date: 2012-12-10",
  "format_medium": "ETD",
  "handle": "19203",
  "identifier_other": "vt_gsexam:43",
  "identifier_uri": "http://hdl.handle.net/10919/19203",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "gueuze",
    "GC-MS",
    "GC-O",
    "SPME",
    "SDE-SAFE"
  ],
  "title": "Characterization of aroma and flavor compounds present in lambic (gueuze) beer",
  "type": "Dissertation"
}