{
  "contributor_author": "Cao, Zhenwei",
  "contributor_committeechair": "Elgart, Alexander",
  "contributor_committeemember": [
    "Tauber, Uwe C",
    "Hagedorn, George A",
    "Stolz, Gunter"
  ],
  "contributor_department": "Mathematics",
  "date_accessioned": "2013-02-19T22:35:52Z",
  "date_available": "2013-02-19T22:35:52Z",
  "date_issued": "2012-12-11",
  "degree_discipline": "Mathematics",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Over the years, people have found Quantum Mechanics to be extremely useful in explaining various physical phenomena from a microscopic point of view. Anderson localization, named after physicist P. W. Anderson, states that disorder in a crystal can cause non-spreading of wave packets, which is one possible mechanism (at single electron level) to explain metalinsulator transitions. The theory of quantum computation promises to bring greater computational power over classical computers by making use of some special features of Quantum Mechanics. The first part of this dissertation considers a 3D alloy-type model, where the Hamiltonian is the sum of the finite difference Laplacian corresponding to free motion of an electron and a random potential generated by a sign-indefinite single-site potential. The result shows that localization occurs in the weak disorder regime, i.e., when the coupling parameter λ is very small, for energies E ≤ −Cλ² . The second part of this dissertation considers adiabatic quantum computing (AQC) algorithms for the unstructured search problem to the case when the number of marked items is unknown. In an ideal situation, an explicit quantum algorithm together with a counting subroutine are given that achieve the optimal Grover speedup over classical algorithms, i.e., roughly speaking, reduce O(2n ) to O(2n/2 ), where n is the size of the problem. However, if one considers more realistic settings, the result shows this quantum speedup is achievable only under a very rigid control precision requirement (e.g., exponentially small control error).",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:35:52Z (GMT). No. of bitstreams: 1  Cao_Z_D_2012.pdf: 761003 bytes, checksum: 6ebe67b9323add103697c690eb222d8d (MD5)    Previous issue date: 2012-12-11",
  "format_medium": "ETD",
  "handle": "19205",
  "identifier_other": "vt_gsexam:98",
  "identifier_uri": "http://hdl.handle.net/10919/19205",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Quantum Mechanics",
    "Random Schrödinger Operator"
  ],
  "title": "Quantum evolution: The case of weak localization for a 3D alloy-type Anderson model and application to Hamiltonian based quantum computation",
  "type": "Dissertation"
}