{
  "contributor_author": "Comu, Semra",
  "contributor_committeechair": "Taylor, John E",
  "contributor_committeemember": [
    "de la Garza, Jesus M",
    "Dossick, Carrie Sturts",
    "Golparvar-Fard, Mani"
  ],
  "contributor_department": "Civil and Environmental Engineering",
  "date_accessioned": "2013-02-19T22:36:16Z",
  "date_available": "2013-02-19T22:36:16Z",
  "date_issued": "2012-12-14",
  "degree_discipline": "Civil Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Globalization impacts the Architecture, Engineering and Construction (AEC) industry; customers in the AEC industry are seeking lower costs, faster construction schedules and higher quality services. In order to keep up with the changing demand and to stay competitive in the global AEC industry, firms are forming joint ventures and outsourcing design and services work.  As a result, these new trends in the AEC industry require the collaboration of widely dispersed and diverse project workers and companies.  Accordingly, it becomes increasingly important to understand the impact of diversity on performance.  In this sense, the initial aim of this study was to find empirical evidence on how differences in national culture and language may affect performance in Global Project Networks (GPNs).  According to the results of the first experiment comparing the performance of multi-cultural versus mono-cultural simulated project networks over time, I found cultural and linguistic diversity to have a negative impact on initial performance. However, culturally and linguistically diverse project networks studied achieved better adaptation performance that has long term advantages. Even though GPNs have long term performance benefits, bringing the widely dispersed project participants together is costly.  Therefore, firms are seeking ways to employ collaboration technologies to bring together the project participants.  Little research exists to examine how to increase the efficiency of GPNs that collaborate using technologies such as virtual workspaces to perform design work.  In order to examine collaboration in GPNs utilizing virtual workspaces, I conducted two experiments.  In the first study, I investigated the formation and the maintenance of Transactive Memory Systems (TMSs) and cohesive subgroups as a proxy for performance in two facilitated and two non-facilitated global virtual project networks.  I found a negative impact on collaboration effectiveness when process facilitators engaged in content facilitation in virtual project networks, which restricts the establishment of TMSs. The findings of the first study revealed inappropriate ways of facilitating GPNs collaborating in virtual workspaces, which motivated the second study.  In the second experiment, I observed two global and two domestic virtual project networks that were appropriately facilitated.  I examined the interactions between network members in order to identify whether significant differences between the collaboration approaches of global and domestic virtual project networks exist. Facilitators were utilized more frequently in global networks, particularly in the early stages of collaboration. Boundary spanning visualization technologies within the virtual workspace were also utilized more frequently by the global network members; however, this was due more to the spatial richness of the task than the maturity of the collaboration. The overall findings have significant implications in improving the effectiveness of global project network collaborations in virtual workspaces.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:36:16Z (GMT). No. of bitstreams: 2 Comu_S_D_2012.pdf: 1287873 bytes, checksum: 326be12d2719cd951c7d4a75dc59face (MD5) Comu_S_D_2012_support_1.pdf: 557083 bytes, checksum: 75a3f74d14591851b40cc490210bdf5b (MD5)   Previous issue date: 2012-12-14",
  "format_medium": "ETD",
  "handle": "19209",
  "identifier_other": "vt_gsexam:69",
  "identifier_uri": "http://hdl.handle.net/10919/19209",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Culture",
    "Facilitation",
    "Globalization",
    "Networks",
    "Project Networks",
    "Social Network Analysis",
    "Technology",
    "Virtual Teams",
    "Virtual Wo"
  ],
  "title": "Examining the Impact of Facilitation on the Performance of Global Project Networks Collaborating in Virtual Workspaces",
  "type": "Dissertation"
}