{
  "contributor_author": "Leblanc, Christopher N",
  "contributor_committeechair": "Ekkad, Srinath",
  "contributor_committeemember": [
    "Roy, Christopher John",
    "Tafti, Danesh K",
    "Diller, Thomas E",
    "Ng, Wing Fai"
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2013-02-19T22:36:00Z",
  "date_available": "2013-02-19T22:36:00Z",
  "date_issued": "2012-12-17",
  "degree_discipline": "Mechanical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This research has a small portion focused on interior serpentine channels, with the primary focus on improving the effectiveness of the film cooling technique through the use of a new approach to film cooling. This new approach uses a set of three holes sharing the same inlet and diverging from the central hole to form a three-legged, or tripod, design. The tripod design is examined in depth, in terms of geometric variations, through the use of flat plate and cascade rigs, with both transient and steady-state experiments. The flat plate tests provide a simplified setting in which to test the design in comparison to other geometries, and establish a baseline performance in a simple flow field that does not have the complications of surface curvature or mainstream pressure gradients. Cascade tests allow for testing of the design in a more realistic setting with curved surfaces and mainstream pressure gradients, providing important information about the performance of the design on suction and pressure surfaces of airfoils. Additionally, the cascade tests allow for an investigation into the aerodynamic penalties associated with the injection hole designs at various flow rates. Through this procedure the current state of film cooling technology may be improved, with more effective surface coverage achieved with reduced coolant usage, and with reduced performance penalties for the engine as a whole. This research has developed a new film hole design that is manufacturable and durable, and provides a detailed analysis of its performance under a variety of flow conditions. This cooling hole design provides 40% higher cooling effectiveness while using 50% less coolant mass flow. The interior serpentine channel research provides comparisons between correlations and experiments for internal passages with realistic cross sections.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:36:00Z (GMT). No. of bitstreams: 1 Leblanc_CN_D_2012.pdf: 11033063 bytes, checksum: 803bf1ff1fb16859d0457df5d8e99e90 (MD5)   Previous issue date: 2012-12-17",
  "format_medium": "ETD",
  "handle": "19206",
  "identifier_other": "vt_gsexam:46",
  "identifier_uri": "http://hdl.handle.net/10919/19206",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Heat Transfer",
    "Gas Turbine Cooling",
    "Film Cooling"
  ],
  "title": "Design, Analysis, and Development of a Tripod Film Cooling Hole Design for Reduced Coolant Usage",
  "type": "Dissertation"
}