{
  "contributor_author": "Fournillier, Jandelle Lu-Ann",
  "contributor_committeechair": [
    "Redican, Kerry J.",
    "Kilkelly, Ann G."
  ],
  "contributor_committeemember": [
    "DePauw, Karen P.",
    "Tilley-Lubbs, Gresilda A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2013-02-19T22:38:25Z",
  "date_available": "2013-02-19T22:38:25Z",
  "date_issued": "2013-01-11",
  "degree_discipline": "Curriculum and Instruction",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Looking for ways that dance could be used as a tool for health promotion, I sought to explore dance choreography and performance as an alternative medium for educating and increasing awareness about college student suicide. Suicide is the second leading cause of death amongst college students and while research suggests that suicide is decreasing, in terms of attempted suicides, the problem may be increasing. While attempts to understand, predict and prevent the loss of lives have resulted in extensive literature, there has been very little systematic research completed. Compounded by limited proposed models for addressing college student suicide, and lack of evidence there remains a growing need to find effective health communication practices and best health promotion practices.    This research study is an autobiographical case study that explores my embodied experience of choreographing and performing a dance about college student suicide. As a health promotion professional and a trained dance artist, I assumed the role of researcher and dance choreographer and I and my experience became the subject of this research study. I launched and conducted a six-week project on my university campus called \"Dance For Life\" and worked with a small group of three female undergraduate dancers to make the new dance piece. This dance project was the case under investigation out of which I presented an autobiographical narrative in the findings and discussion section of this paper.     Reviewed health information, research findings, and data, as well as knowledge extracted from the dance group became in part material used to make the dance. As the choreographer, my role in the choreographic process spanned from expert to collaborator and rested on my vision for the story told that would be told through the dance. I collected m data in the form of:- video recordings; audio recordings; pictures; journal entries; field/ observational notes; video diaries; drawings; interviews with community-based artists; and memory recall. I then worked to sort, label, group, and analyze the data, piecing together my findings to write an autobiography that answered my research questions.    My exploration highlighted the importance of community involvement in community-based health programming.Through participation in this project the dancers\\' knowledge and awareness of college student suicide increased and positively affected their empathetic response toward members of the community. Using non professional dancers with varied dance skill levels did not inhibit creativity or diminish the quality of work produced. Instead it brought together real life people with diverse perspectives, creative solutions, and a passion for dance to produce a piece of art effective in its ability to \\'touch\\' the audience and draw them in to a place of greater awareness.     Stigmas, and the lack of  education and visibility about this particular health challenge, have resulted in a low community response to affecting change. The post performance discussion, brought the greatest gains, in terms of educating the audience. They interacted with the project, asked questions, gave feedback and provided comments about what they experienced, learned, and understood. The overall success of the project, points toward the possibility of dance as an art form playing a more significant role in educating communities about sensitive, and difficult to talk about, health challenges. Being able to affect the knowledge, attitudes, and empathetic response of communities is a beginning step  towards overcoming the health challenge of college student suicide. Future research needs to focus on best choreographing techniques as it relates to audience interpretation.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:38:25Z (GMT). No. of bitstreams: 2  Fournillier_JL_D_2013.pdf: 8396799 bytes, checksum: 19c73b930f74a05ff601c5082c6437af (MD5)  Fournillier_JL_D_2013_support_1.pdf: 983798 bytes, checksum: 9ba713f2023df5a6ec5a39d22bb880a3 (MD5)    Previous issue date: 2013-01-11",
  "format_medium": "ETD",
  "handle": "19216",
  "identifier_other": "vt_gsexam:283",
  "identifier_uri": "http://hdl.handle.net/10919/19216",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "College Student Suicide",
    "Dance Choreography",
    "Dance Performance",
    "Health Promotion",
    "Suicide Prevention"
  ],
  "title": "Dance For Life: Exploring Dance Choreography and Performance as a tool for Educating the University Community about College Student Suicide",
  "type": "Dissertation"
}