{
  "contributor_author": "Villasenor Aguilar, Jose Maria",
  "contributor_committeechair": "Hindman, Daniel P",
  "contributor_committeemember": [
    "Loferski, Joseph R",
    "Thangjitham, Surot",
    "Dowling, Norman E",
    "Nussbaum, Maury A"
  ],
  "contributor_department": "Forest Resources and Environmental Conservation",
  "date_accessioned": "2013-02-19T22:38:10Z",
  "date_available": "2013-02-19T22:38:10Z",
  "date_issued": "2013-01-14",
  "degree_discipline": "Forest Products",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Recent research has shown that a significant number of the falls from elevation occur when laborers are working on unfinished structures. Workers walking on wood I-joists on roofs and floors are prone to fall hazards. Wood I-joists have been replacing dimension lumber for many floor systems and a substantial number of roof systems in light-frame construction. Wood I-joists are designed to resist axial stresses on the flanges and shear stresses on the web while minimizing material used. However, wood I-joists have poor resistance to applied lateral and torsional loads and are susceptible to lateral-torsional buckling instability. Workers walking on unbraced or partially braced wood I-joists can induce axial and lateral forces as well as twist. Experimental testing demonstrated that workers cause lateral-torsional buckling instability in wood I-joists. However, no research was found related to the lateral-torsional buckling instability induced by individuals walking on the wood I-joists. Furthermore, no research was found considering the effects of the supported end conditions and partial bracing in the lateral-torsional buckling instability of wood I-joists.<br />The goal of this research was to derive mathematical models to predict the dynamic lateral-torsional buckling instability of wood composite I-joists loaded by individuals walking considering different supported end conditions and bracing system configurations. The dynamic lateral-torsional buckling instability was analyzed by linearly combining the static lateral-torsional buckling instability with the lateral bending motion of the wood I-joists. Mathematical models were derived to calculate the static critical loads for the simply supported end condition and four wood I-joist hanger supported end conditions. Additionally, mathematical models were derived to calculate the dynamic maximum lateral displacements and positions of the individual walking on the wood I-joists for the same five different supported end conditions. Three different lean-on bracing systems were investigated, non-bracing, one-bracing, and two-bracing systems. Mathematical models were derived to calculate the amount of constraint due to the lean-on bracing system. The derived mathematical models were validated by comparison to data from testing for all supported end conditions and bracing systems.<br />The predicted critical loads using the static buckling theoretical models for the non-bracing system and the static buckling theoretical models combined with the bracing theoretical models for the simply and hanger supported end conditions agreed well with the critical loads obtained from testing for the two wood I-joist sizes investigated. The predicted maximum lateral displacements and individual positions using the bending motion theoretical models for the simply and hanger supported end conditions agreed well with the corresponding maximum lateral displacements and individual positions obtained from testing for both wood I-joist sizes. Results showed that; a) the supported end condition influenced the critical loads, maximum lateral displacements and individual positions, b) the bracing system increased the critical loads and reduced the maximum lateral displacements, c) the critical load increased as the load position displaced away from the wood I-joist mid-span, d) the critical load reduced as the initial lateral displacement of the wood I-joist increased and e) the wood I-joist mid-span was the critical point in the dynamic lateral-torsional buckling instability.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:38:10Z (GMT). No. of bitstreams: 1 Villasenor_Aguilar_J_D_2013.pdf: 7695116 bytes, checksum: 9549430900cc6f0646dcb5eb471aa3b2 (MD5)   Previous issue date: 2013-01-14",
  "format_medium": "ETD",
  "handle": "19212",
  "identifier_other": "vt_gsexam:228",
  "identifier_uri": "http://hdl.handle.net/10919/19212",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Falls from Elevation",
    "Wood Composite I-Joist",
    "Lateral Bending Stiffness",
    "Torsional Rigidity",
    "Lateral Hanger Stiffness",
    "Lean-on B"
  ],
  "title": "Lateral-Torsional Buckling Instability Caused by Individuals Walking on Wood Composite I-Joists",
  "type": "Dissertation"
}