{
  "contributor_author": "Wang, Yunjing",
  "contributor_committeechair": [
    "Pickrell, Gary R",
    "Wang, Anbo"
  ],
  "contributor_committeemember": [
    "Xu, Yong",
    "Poon, Ting Chung",
    "Heflin, James R"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2013-02-19T22:38:45Z",
  "date_available": "2013-02-19T22:38:45Z",
  "date_issued": "2013-01-21",
  "degree_discipline": "Electrical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Distributed sensing is highly desirable in a wide range of civil, industrial and military applications. The current technologies for distributed sensing are mainly based on the detection of optical signals resulted from different elastic or non-elastic light-matter interactions including Rayleigh, Raman and Brillouin scattering. However, they can measure temperature or strain only to date. Therefore, there is a need for technologies that can further expand measurement parameters even to chemical and biological stimuli to fulfill different application needs. <br />This dissertation presents a fully-distributed fiber-optic sensing technique based on a traveling long-period grating (T-LPG) in a single-mode fiber. The T-LPG is generated by pulsed acoustic waves that propagate along the fiber. When there are changes in the fiber surrounding medium or in the fiber surface coating, induced by various physical, chemical or biological stimuli, the optical transmission spectrum of the T-LPG may shift. Therefore, by measuring the T-LPG resonance wavelength at different locations along the fiber, distributed measurement can be realized for a number of parameters beyond temperature and strain. <br />Based on this platform, fully-distributed temperature measurement in a 2.5m fiber was demonstrated. Then by coating the fiber with functional coatings, fully-distributed biological and chemical sensing was also demonstrated. In the biological sensing experiment, immunoglobulin G (IgG) was immobilized onto the fiber surface, and the experimental results show that only specific antigen-antibody binding can introduce a measurable shift in the transmission optical spectrum of the T-LPG when it passes through the pretreated fiber segment. In the hydrogen sensing experiment, the fiber was coated with a platinum (Pt) catalyst layer, which is heated by the thermal energy released from Pt-assisted combustion of H2 and O2, and the resulted temperature change gives rise to a measurable T-LPG wavelength shift when the T-LPG passes through. Hydrogen concentration from 1% to 3.8% was detected in the experiment. This technique may also permit measurement of other quantities by changing the functional coating on the fiber; therefore it is expected to be capable of other fully-distributed sensing applications.   <br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:38:45Z (GMT). No. of bitstreams: 1 Wang_Y_D_2013.pdf: 4224083 bytes, checksum: 2497501ee0e065cb8c67d2cb32042497 (MD5)   Previous issue date: 2013-01-21",
  "format_medium": "ETD",
  "handle": "19222",
  "identifier_other": "vt_gsexam:202",
  "identifier_uri": "http://hdl.handle.net/10919/19222",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Fiber-optic",
    "Distributed Sensing",
    "Long Period Grating",
    "Acousto-Opotics"
  ],
  "title": "Fiber-Optic Sensors for Fully-Distributed Physical, Chemical and Biological Measurement",
  "type": "Dissertation"
}