{
  "contributor_author": "Tamami, Mana",
  "contributor_committeechair": "Long, Timothy E",
  "contributor_committeemember": [
    "Turner, Sam Richard",
    "Wilkes, Garth L",
    "Duncan, Susan E"
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2013-02-19T22:39:32Z",
  "date_available": "2013-02-19T22:39:32Z",
  "date_issued": "2013-01-16",
  "degree_discipline": "Chemistry",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Ammonium ionenes are polycations that have quaternary nitrogens in their macromolecular backbone and are synthesized via step-growth polymerization technique. They offer interesting coulombic properties, and the synthetic design provides control over charge density. Non-covalent interactions including nucleobase hydrogen bonding and electrostatics were studied in ammonium ionenes. The non-covalent interactions are expected to increase the effective molecular weight of polymeric precursors and induce microphase separation due to intermolecular associations. The influence of non-covalent interactions on structure-property relationships of ammonium ionenes were studied regarding mechanical (tensile, DMA), thermal (DSC, TGA), and morphological (AFM, SAXS) properties. <br />Hydrogen bonding interaction (10-40 kJ/mol) was introduced using DNA nucleobase pairs such as adenine and thymine. Novel adenine and thymine functionalized segmented and non-segmented ammonium ionenes were successfully synthesized using Michael addition chemistry. In non-segmented systems, we investigated the influence of spacer length on homoassociation and heteroassociation of complementary nucleobase-containing ionenes. Based on DSC analyses, complementary non-segmented ionenes made miscible blends. The Tgs of ionene blends with shorter spacer length (4 bonds between the nucleobase and secondary amine in the polymer backbone) followed the Fox equation, which indicated no intermolecular interactions. The longer alkyl spacer (9 bonds between nucleobase and secondary amine in the polymer backbone) provided efficient flexibility for the self-assembly process to occur. Thus, increasing the spacer length from 4-bonds to 9-bonds, the Tgs of the blends deviated from both Fox and Gordon-Taylor equations and demonstrated the presence of hydrogen bonding interactions.<br />In segmented systems, we investigated the association between nucleobase-containing ionenes and their complementary guest molecules. Job\\'s method revealed a 1:1 stoichiometry for the hydrogen-bonded complexes. These association constants for the 1:1 complexes, based on the Benesi-Hildebrand model were 94 and 130 M-1 respectively, which were in agreement with literature values for adenine and thymine nucleobase pairs (10-100 M-1). DSC thermograms confirmed no macrophase separation for 1:1 [ionene-A/T]:[guest molecule] complexes based on the disappearance of the melting peak of the guest molecule. Morphological studies including atomic force microscopy (AFM) demonstrated a reduced degree of microphase separation for the 1:1 complexes due to the disruption of adenine-adenine or thymine-thymine interactions.<br />Poly(dimethyl siloxane)-based ammonium ionenes having various hard segment contents were synthesized. The charge density or hard segment content was tuned for appropriate application using low molecular weight monomer. The change in hard segment content had a profound effect on thermal, mechanical, rheological, and gas permeability. Microphase separation was confirmed using DSC and DMA in these systems. DMA showed that the rubbery plateau modulus extended to higher temperatures with increasing hard segment content. Tensile analysis demonstrated systematic increase in modulus of PDMS-ionenes with increasing hard segment content. Oxygen transmission rates decreased linearly as the wt% hard segment increased.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:39:32Z (GMT). No. of bitstreams: 1 Tamami_M_D_2013.pdf: 3532446 bytes, checksum: 4e39873c4eab36e687066515e0d881ef (MD5)   Previous issue date: 2013-01-16",
  "format_medium": "ETD",
  "handle": "19234",
  "identifier_other": "vt_gsexam:201",
  "identifier_uri": "http://hdl.handle.net/10919/19234",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Segmented ionenes",
    "non-segmented ionenes",
    "nucleobase",
    "hydrogen bonding",
    "Michael addition",
    "self-healing",
    "bio-adhesion",
    "molecular"
  ],
  "title": "Synthesis and characterization of ammonium ionenes containing hydrogen bonding functionalities",
  "type": "Dissertation"
}