{
  "contributor_author": "Mahmoudian, Alireza",
  "contributor_committeechair": "Scales, Wayne A",
  "contributor_committeemember": [
    "Pratt, Timothy",
    "Earle, Gregory D",
    "Roy, Christopher John",
    "Bailey, Scott M"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2013-02-19T22:39:55Z",
  "date_available": "2013-02-19T22:39:55Z",
  "date_issued": "2013-01-25",
  "degree_discipline": "Electrical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Recently, experimental observations have shown that radar echoes from the irregularity<br />source region associated with mesospheric dusty space plasmas may be modulated by radio wave heating with ground-based ionospheric heating facilities. These experiments show great promise as a diagnostic for the associated dusty plasma in the Near-Earth Space Environment which is believed to have links to global change. This provides an alternative to more complicated and costly space-based observational approaches to investigating these layers. This dissertation seeks to develop new analytical and computational models to investigate fundamental physics of the associated dusty plasmas as well as utilize experimental observations during High Frequency HF ground-based heating experiments to develop practical techniques for diagnosing these dusty plasma layers.<br />The dependency of the backscattered signal strength (i.e. Polar Mesospheric Summer Echoes PMSEs) after the turn-on and turn-off of the radio wave heating on the radar frequency is an unique phenomenon that can shed light on the unresolved issues associated with the basic physics of the natural charged mesospheric dust layer. The physical process after turn-on and turn-off of radio wave heating is explained by competing ambipolar diffusion and dust charging processes. The threshold radar frequency and dust parameters for the enhancement or suppression of radar echoes after radio wave heating turn-on are investigated for measured mesospheric plasma parameters. The effect of parameters such as the electron temperature enhancement during radiowave heating, dust density, dust charge polarity, ion-neutral collision frequency, electron density and dust radius<br />on the temporal evolution of electron irregularities associated with PMSE is investigated.<br />The possibility of observing the turn-on overshoot (enhancement of radar echoes after the<br />radiowave turn-on) in the high frequency HF radar band is discussed based on typical mesospheric<br />parameters. It has been shown that predicted enhancement of electron irregularity<br />amplitude after heater turn-on at HF band is the direct manifestation of the dust charging<br />process in the space. Therefore further active experiments of PMSEs should be pursued<br />at HF band to illuminate the fundamental charging physics in the space environment to<br />provide more insight on this unique medium. Preliminary observation results of HF PMSE<br />heating experiment with the new 7.9 MHz radar at the European Incoherent Scatter EISCAT<br />facility appear promising for the existence of PMSE turn-on overshoot. Therefore, future<br />experimental campaigns are planned to validate these predictions.<br />Computational results are used to make predictions for PMSE active modification experiments at 7.9, 56, 139, 224 and 930MHz corresponding to existing ionospheric heating facilities. Data from a 2009 very high frequency VHF (224 MHz) experiment at EISCAT<br />is compared with the computational model to obtain dust parameters in the PMSE. The<br />estimated dust parameters as a result of these comparison show very reasonable agreement to dust radius and density at PMSE altitudes measured during a recent rocket experiment providing validation to the computational model.<br /><br />The first comprehensive analytical model for the temporal evolution of PMSE after heater<br />turn-on is developed and compared to a more accurate computational model as a reference.<br />It is shown that active PMSE heating experiments involving multiple observing frequencies<br />at 7.9 (HF), 56, and 224 MHz (VHF) may contribute further diagnostic capabilities since<br />the temporal evolution of radar echoes is substantially different for these frequency ranges.<br />It is shown that conducting PMSE active experiments at HF and VHF band simultaneously<br />may allow estimation of the dust density altitude profile, dust charge state variation during<br />the heating cycle, and ratio of electron temperature enhancement in the irregularity source<br />region. These theoretical and computational models are extended to study basic physics of the evolution of relevant dusty plasma instabilities thought to play an important role in irregularity production in mesospheric dust layers. A key focus is the boundary layer of these charged dust clouds. Several aspects of the cloud\\'s structure (thickness of boundary layer, average particle size and density, collisional processes, and cloud expansion speed) and the ambient plasma are varied to determine the effect of these quantities on the resulting irregularities.<br />It was shown that for high collision frequencies, the waves may be very weakly excited (or<br />even quenched) and confined to the boundary layer. The excited dust acoustic waves inside<br />the dust cloud with frequency range of 7-15Hz and in the presence of electron bite-outs is<br />consistent with measured low frequency waves near 10 Hz by sounding rocket experiments<br />over the past decade. The observed radar echoes associated with the artificially created dust<br />clouds at higher altitudes in the ionosphere including space shuttle exhaust and upcoming<br />active space experiments in which localized dust layers will be created by sounding rockets<br />could be related to the excited acoustic waves predicted.<br />Finally, variation of spatial structures of plasma and dust (ice) irregularities in the PMSE<br />source region in the presence of positively charged dust particles is investigated. The correlation and anti-correlation of fluctuations in the electron and ion densities in the background plasma are studied considering the presence of positive dust particle formation. Recent rocket payloads have studied the properties of aerosol particles within the ambient plasma environment in the polar mesopause region and measured the signature of the positively charged particles with number densities of (2000 cm\"3) for particles of 0.5-1 nm in radius.<br />The measurement of significant numbers of positively charged aerosol particles is unexpected from the standard theory of aerosol charging in plasma. Nucleation on the cluster ions is one of the most probable hypotheses for the positive charge on the smallest particles. The utility being that it may provide a test for determining the presence of positive dust particles.<br />The results of the model described show good agreement with observed rocket data. As an<br />application, the model is also applied to investigate the electron irregularity behavior during<br />radiowave heating assuming the presence of positive dust particles. It is shown that the<br />positive dust produces important changes in the behavior during Polar Mesospheric Summer Echo PMSE heating experiments that can be described by the fluctuation correlation and anti-correlation properties.<br />The second part of this dissertation is dedicated to Stimulated Electromagnetic Emissions SEEs produced by interaction of high power electromagnetic waves in the ionosphere. Nearearth ionospheric plasma presets a neutral laboratory for investigation of nonlinear wave phenomena in plasma which can not be studied in the laboratory environment due to the effect of physical boundary conditions. This process has been of great interest due to the<br />important diagnostic possibilities involving ability to determine mass of constitutive ions in<br />the interaction region through measurements of various gyro-frequencies. Objectives include<br />the consideration of the variation of the spectral behavior under pump power, proximity to<br />the gyro-harmonic frequency, and beam angle. Also, the relationship between such spectral<br />features and electron acceleration and creation of plasma irregularities was an important<br />focus.<br />Secondary electromagnetic waves excited by high power electromagnetic waves transmitted<br />into the ionosphere, commonly know as Stimulated Electromagnetic Emissions SEEs,<br />produced through Magnetized Stimulated Brillouin Scatter MSBS are investigated. Data<br />from two recent research campaigns at the High Frequency Active Auroral Research Program<br />facility HAARP is presented in this work. These experiments have provided additional<br />quantitative interpretation of the SEE spectrum produced by MSBS to yield diagnostic measurements of the electron temperature in the heated ionosphere. SEE spectral emission lines corresponding to ion acoustic IA and electrostatic ion cyclotron EIC modes were observed with a shift in frequency up to a few tens of Hz from radio waves transmitted near the third harmonic of the electron gyro-frequency 3fce. The threshold of each emission line has been measured by changing the pump wave amplitude. The experimental results aimed to show the threshold for transmitter power to excite IA waves propagating along the magnetic field lines as well as for EIC waves excited at oblique angles relative to the background magnetic field. A full wave solution has been used to estimate the amplitude of the electric field at the interaction altitude. The estimated growth rate using the theoretical model is compared with the threshold of MSBS lines in the experiment and possible diagnostic information for the background ionospheric plasmas is discussed. Simultaneous formation of artificial field aligned irregularities FAIs and suppression of the MSBS process is investigated. Recently, there has been significant interest in ion gyro-harmonic structuring the Stimulated Electromagnetic Emission SEE spectrum due to the potential for new diagnostic information available about the heated volume and ancillary processes such as creation of artificial ionization layers. These relatively recently discovered emission lines have almost exclusively been studied for second electron gyro-harmonic heating. The first extensive systematic investigations of the possibility of these spectral features for third electron gyro-harmonic heating are provided here. Discrete spectral features shifted from the transmit frequency ordered by harmonics of the ion gyro-frequency were observed for third electron gyro-harmonic heating for the first time at a recent campaign at a High Frequency Active Auroral Research Program Facility HAARP. These features were also closely correlated with a broader band feature at a larger frequency shift from the transmit frequency known as the Downshifted Peak DP. The power threshold of these spectral features was measured, as well as their behavior with heater<br />beam angle, and proximity of the transmit frequency to the third electron gyro-harmonic frequency. Comparisons were also made with similar spectral features observed during 2nd<br />electron gyro-harmonic heating during the same campaign. A theoretical model is provided<br />that interprets these spectral features as resulting from parametric decay instabilities in<br />which the pump field ultimately decays into high frequency upper hybrid/electron Bernstein<br />and low frequency neutralized ion Bernstein IB and/or obliquely propagating ion acoustic<br />waves at the upper hybrid interaction altitude. Coordinated optical and SEE observations<br />were carried out in order to provide a better understanding of electron acceleration and precipitation<br />processes. Optical emissions were observed associated with SEE gyro-harmonic<br />features for pump heating near the second electron gyro-harmonic during the campaign. The<br />observations affirm strong correlation between the gyro-structures and the airglow.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:39:55Z (GMT). No. of bitstreams: 2 Mahmoudian_A_D_2013.pdf: 19442858 bytes, checksum: c783f6d6713daaf81301740ff2dea67d (MD5) Mahmoudian_A_D_2013_support_1.pdf: 904783 bytes, checksum: 81ba409541a78e5290208edf820f4b92 (MD5)   Previous issue date: 2013-01-25",
  "format_medium": "ETD",
  "handle": "19239",
  "identifier_other": "vt_gsexam:148",
  "identifier_uri": "http://hdl.handle.net/10919/19239",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Ionospheric Modification",
    "Plasma",
    "Numerical Simulations",
    "Analytical model"
  ],
  "title": "New-Measurement Techniques to Diagnose Charged Dust and Plasma Layers in the Near-Earth Space Environment Using Ground-Based Ionospheric Heating Facilities",
  "type": "Dissertation"
}