{
  "contributor_author": "Zeitzmann, Hanko Kalle",
  "contributor_committeechair": "Hatfield, Donald E",
  "contributor_committeemember": [
    "Tucci, Christopher L.",
    "Wokutch, Richard E",
    "Gnyawali, Devi R",
    "Bruyaka, Olga"
  ],
  "contributor_department": "Management",
  "date_accessioned": "2013-02-19T22:39:44Z",
  "date_available": "2013-02-19T22:39:44Z",
  "date_issued": "2013-01-07",
  "degree_discipline": "Business, Management",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Combining Cyert and March\\'s (1963) model of search with foundational concepts from evolutionary theory (Nelson & Winter, 1982), this dissertation scrutinizes the expansion of search and develops a refined framework for organizational search behavior.  Special emphasis is put on the aspect of search in organizationally vulnerable areas (Cyert & March, 1963).  Considering pressure to innovate as a potential driver, the dissertation develops a conceptual model based on open innovation (Chesbrough, 2003a).  Three pre-studies and two main studies illuminate broadcast search in the pharmaceutical industry and test the theoretical model.  <br />The pre-studies elucidate the use of broadcast search in the pharmaceutical industry from various angles.  One investigation uses public data from an intermediary to test for the uniqueness of pharma-related broadcast search.  Findings indicate that pharma-related challenges are frequented less by solvers.  Another pre-study administered surveys to managers from pharmaceutical firms interested in open innovation for R&D.  Results indicate alignment between the academic literature and practice.  The tenor of the pre-studies is that broadcast search in the pharmaceutical industry deserves legitimate consideration.  Also, anecdotal evidence supports the notion that broadcast search, at current, is used after other attempts have failed\"as a search mechanism at the margin.   <br />The two main studies test the theoretically developed ideas.  Building on prior work, study 1 singles out the breadth of the knowledge base as the defining factor for forming strategic knowledge groups.  Study 2 supports the notion that innovation pressure is associated with changes in organizational search behavior.  Since study 2 does not find a direct link between innovation pressure and broadcast search engagement, a post-hoc analysis follows which combines study 1 findings with study 2 data.  Results support the idea that a broad knowledge base precedes broadcast search.<br />Theory development benefits from this dissertation by emphasizing on a better understanding of organizational search processes and setting a foundation for future investigations.  For practitioners the dissertation cautions of blind adoption of broadcast search while at the same time pointing to its potential.  Having supplemental capabilities becomes crucial.  The nature of these capabilities requires further scientific investigation.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:39:44Z (GMT). No. of bitstreams: 1 Zeitzmann_HK_D_2013.pdf: 6182855 bytes, checksum: 43c367ab13dbe39dba04e166e9df420f (MD5)   Previous issue date: 2013-01-07",
  "format_medium": "ETD",
  "handle": "19237",
  "identifier_other": "vt_gsexam:227",
  "identifier_uri": "http://hdl.handle.net/10919/19237",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "behavioral theory",
    "evolutionary theory",
    "organizational routines",
    "problemistic search",
    "search in organizationally vulnerable area"
  ],
  "title": "A Model of Non-Routine Organizational Search: Broadcast Search as an Alternative Knowledge-Sourcing Mechanism in the Pharmaceutical Industry.",
  "type": "Dissertation"
}