{
  "contributor_author": "Fu, Haiyang",
  "contributor_committeechair": "Scales, Wayne A",
  "contributor_committeemember": [
    "Pratt, Timothy",
    "Ruohoniemi, John Michael",
    "Clauer, C Robert",
    "Tafti, Danesh K",
    "Berdhardt, Paul"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2013-02-19T22:40:34Z",
  "date_available": "2013-02-19T22:40:34Z",
  "date_issued": "2013-01-22",
  "degree_discipline": "Electrical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Plasma turbulence associated with the creation of an artificial dust layer in the earth\\'s ionosphere is investigated. The Charged Aerosol Release Experiment (CARE) aims to understand the mechanisms for enhanced radar scatter from plasma irregularities embedded in dusty plasmas in space. Plasma irregularities embedded in a artificial dusty plasma in space may shed light on understanding the mechanism for enhanced radar scatter in Noctilucent Clouds (NLCs) and Polar Mesospheric Summer Echoes (PMSEs) in the earth\\'s mesosphere. Artificially created, charged-particulate layers also have strong impact on radar scatter as well as radio signal propagation in communication and surveillance systems. The sounding rocket experiment was designed to develop theories of radar scatter from artificially created plasma turbulence in charged dust particle environment. Understanding plasma irregularities embedded in a artificial dusty plasma in space will also contribute to addressing possible effects of combustion products in rocket/space shuttle exhaust in the ionosphere.<br /><br />In dusty space plasmas, plasma irregularities and instabilities can be generated during active dust aerosol release experiments. Small scale irregularities (several tens of centimeter to meters) and low frequency waves (in the ion/dust scale time in the order of second) are studied in this work, which can be measured by High Frequency (HF), Very High Frequency (VHF) and Ultra High Frequency (UHF) radars. The existence of dust aerosol particles makes computational modeling of plasma irregularities extremely challenging not only because of multiple spatial and temporal scale issue but also due to complexity of dust aerosol particles.<br /><br />This work will provide theoretical and computational models to study plasma irregularities driven by dust aerosol release for the purpose of designing future experiments with combined ground radar, optical and in-situ measurement. In accordance with linear analysis, feasible hybrid computational models are developed to study nonlinear evolution of plasma instabilities in artificially created dusty space plasmas. First of all, the ion acoustic (IA) instability and dust acoustic (DA) instability in homogenous unmagnetized plasmas are investigated by a computational model using a Boltzmann electron assumption. Such acoustic-type instabilities are attributed to the charged dust and ion streaming along the geomagnetic field. Secondly, in a homogenous magnetized dusty plasma, lower-hybrid (LH) streaming instability will be generated by dust streaming perpendicular to the background geomagnetic field. The magnetic field effect on lower-hybrid streaming instabilities is investigated by including the ratio of electron plasma frequency and electron gyro frequency in this model. The instability in weakly magnetized circumstances agree well with that for the ion acoustic (IA) instability by a Boltzmann model. Finally, in an inhomogeneous unmagnetized/magnetized dust boundary layer, possible instabilities will be addressed, including dust acoustic (DA) wave due to flow along the boundary and lower-hybrid (LH) sheared instability due to flow cross the boundary.<br /><br />With applications to active rocket experiments, plasma irregularity features in a linear/nonlinear saturated stage are characterized and predicted. Important parameters of the dust aerosol clouds that impact the evolution of waves will be also discussed for upcoming dust payload generator design. These computational models, with the advantage of following nonlinear wave-particle interaction, could be used for space dusty plasmas as well as laboratory dusty plasmas.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:40:34Z (GMT). No. of bitstreams: 1 Fu_H_D_2013.pdf: 7729699 bytes, checksum: 07f3b1f24f0b48c0d824130ee1cdd60b (MD5)   Previous issue date: 2013-01-22",
  "format_medium": "ETD",
  "handle": "19248",
  "identifier_other": "vt_gsexam:77",
  "identifier_uri": "http://hdl.handle.net/10919/19248",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Space Plasma Physics",
    "Ionospheric Irregularities",
    "Active Space Experiment",
    "Hybrid Computational Model",
    "Dust Aerosol Charging"
  ],
  "title": "Modeling of Plasma Irregularities Associated with Artificially Created Dusty Plasmas in the Near-Earth Space Environment",
  "type": "Dissertation"
}