{
  "contributor_author": "Lee, Jung Yong",
  "contributor_committeechair": "Nussbaum, Maury A",
  "contributor_committeemember": [
    "Agnew, Michael J",
    "Babski-Reeves, Kari L",
    "Madigan, Michael L"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2013-02-19T22:40:10Z",
  "date_available": "2013-02-19T22:40:10Z",
  "date_issued": "2013-01-04",
  "degree_discipline": "Industrial and Systems Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Work-related low back disorders (WRLBDs) are common and costly in the U.S. and numerous interventions aiming to reduce WRLBD risk have been developed.  In one approach, training programs incorporating the work strategies (or work methods) of experienced workers have often been proposed as a training model or a behavior target of training.  However, both the specific role of work experience in contributing to WRLBDs and the effectiveness of such an intervention approach are not well understood.  In the current research, differential work strategies of experienced workers and associated WRLBD risk were identified, in the context of several common occupational activities.  Three experiments were completed, in which both experienced workers and matched novices participated.  These experiments involved relatively short duration repetitive lifts/lowers, more prolonged lifts/lowers that induced fatigue, and dynamic pushes/pulls.  Diverse aspects of work strategies were quantified, emphasizing torso kinematics/kinetics, balance maintenance, and/or torso movement stability.  During short-term repetitive lifts/lowers, experienced workers exhibited higher torso kinematics and kinetics, suggestive of a higher risk for WRLBDs, though better balance maintenance and torso stability were evident in this group.  Thus, experienced workers may trade off an increased risk for WRLBDs to achieve better balance and torso stability.  Fatigue modified work methods during repetitive lifts/lowers in both the novice and experienced groups, though the associated contribution to WRLBDs was unclear due to opposite changes in torso kinematics vs. kinetics.  More consistently, fatigue decreased balance maintenance during lifts/lowers.  Fatigue also modified work methods adopted by experienced workers, leading to higher torso kinetics, that were suggestive of a higher risk for WRLBDs during lifts/lowers.  For dynamic pushes/pulls, experienced workers used lower torso kinematics and kinetics, suggestive of a lower risk for WRLBDs.  As a whole, these results suggest that work methods are distinct between novices and experienced workers.  Further, work experience may not consistently reduce WRLBD risk, and the influences of experience may be task specific.  Such findings can help guide the development of future interventions, particularly training, targeting the control of WRLBDs.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:40:10Z (GMT). No. of bitstreams: 2 Lee_J_D_2013.pdf: 1556870 bytes, checksum: 1cfd7e4d09cb74a97225cdf7899ee26c (MD5) Lee_J_D_2013_support_1.pdf: 4617 bytes, checksum: 4b3cb6c9e4b9d944ddd63ca303119649 (MD5)   Previous issue date: 2013-01-04",
  "format_medium": "ETD",
  "handle": "19243",
  "identifier_other": "vt_gsexam:134",
  "identifier_uri": "http://hdl.handle.net/10919/19243",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Experience",
    "Biomechanics",
    "Lifting/Lowering",
    "Fatigue",
    "Pushing/Pulling"
  ],
  "title": "Quantifying the effects of experience on motor behaviors during simulated occupational tasks",
  "type": "Dissertation"
}