{
  "contributor_author": "Joshi, Keyur Bhanuprasad",
  "contributor_committeechair": "Priya, Shashank",
  "contributor_committeemember": [
    "Tafti, Danesh K",
    "Costello, John Henry",
    "West, Robert L",
    "O'Brien, Walter F"
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2013-02-19T22:41:06Z",
  "date_available": "2013-02-19T22:41:06Z",
  "date_issued": "2013-01-08",
  "degree_discipline": "Mechanical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Jellyfish have inhabited this planet for millions of years and are the oldest known metazoans that swim using muscles. They are found in freshwater sources and in oceans all over the world. Over millions of years of evolution, they have adapted to survive in a given environment. They are considered as one of the most energy efficient swimmers. Owing to these characteristics, jellyfish has attracted a lot of attention for developing energy efficient unmanned undersea vehicles (UUVs).<br /> The goal of this thesis is to provide understanding of the different physical mechanisms that jellyfish employs to achieve efficient swimming by using analytical and computational models. The models were validated by using the experimental data from literature. Based upon these models refinements and changes to engineering vehicles was proposed that could lead to significant enhancement in propulsion efficiency. In addition to the propulsion, the thesis addresses the practical aspects of deploying a jellyfish-inspired robotic vehicle by providing insights into buoyancy control and energy generation. The thesis is structured in a manner such that propulsive and structural models inspired from the natural animal were systematically combined with the practical aspects related to ionic diffusion driven buoyancy control system and thermal -- magnetic energy harvesting system. Jellyfish morphology, swimming mechanism and muscle architecture were critically reviewed to accurately describe the natural behavior and material properties. We provide full understanding of mesoglea, which plays most significant role towards swimming performance, in terms of composition, mechanical properties and nonlinear dynamics. Different jellyfish species exhibit different microstructure of mesoglea and thus there is a wide variety of soft materials. Mechanical properties of collagen fibers that form the main constituent toward imparting elasticity to mesoglea were reviewed and analyzed. The thesis discusses the theoretical models describing the role of structure of mesoglea towards its mechanical properties and explains the variation occurring in stiffness under given experimental environment. Muscle architecture found in jellyfish, nerve nets and its interconnection with the muscles were investigated to develop comprehensive understanding of jellyfish propulsion and its reaction to external stimuli.<br />Different muscle arrangements were studied including radial, coronal muscle, and coronal-muscles-with-breaks in-between them as observed in Cyanea capillata. We modeled these muscle arrangements through finite element modeling (FEM) to determine their deformation and stroke characteristics and their overall role in bell contraction. We found that location and arrangement of coronal muscle rings plays an important role in determining their efficient utilization.<br />Once the understanding of natural jellyfish was achieved, we translated the findings onto artificial jellyfish vehicle designed using Bio-inspired Shape Memory Alloy Composite (BISMAC) actuators. Detailed structural modeling was conducted to demonstrate deformation similar to that of jellyfish bell. FEM model incorporated hyperelastic behavior of artificial mesoglea (Ecoflex-0010 RTV, room temperature vulcanizing silicone with shore hardness (0010)), experimentally measured SMA temperature transformation, gravity and buoyancy forces. The model uses the actual control cycle that was optimized for driving the artificial jellyfish vehicle \"robojelly\". Using a comparative analysis approach, fundamental understanding of the jellyfish bell deformation, thrust generation, and mechanical efficiency were provided. <br />Meeting energy needs of artificial vehicle is of prime importance for the UUVs. Some jellyfish species are known to use photosynthesis process indirectly by growing algae on their exumbrella and thereby utilizing the sunlight to generate energy. Inspired by this concept, an extensive model was developed for harvesting solar energy in underwater environment from the jellyfish bell structure. Three different species were modeled for solar energy harvesting, namely A.aurita, C.capillata and Mastigia sp., using the amorphous silicon solar cell and taking into account effect of fineness ratio, bell diameter, turbidity, depth in water and incidence angle. The models shows that in shallow water with low turbidity a large diameter vehicle may actually generate enough energy as required for meeting the demand of low duty cycle propulsion. In future, when the solar energy harvesting technology based upon artificial photosynthesis, referred to as \"dye-sensitized solar cells\", matures the model presented here can be easily extended to determine its performance in underwater conditions.<br />In order to supplement the energy demand, a novel concept of thermal -- magnetic energy harvesting was developed and extensively modeled. The proposed harvester design allows capturing of even small temperature differences which are difficult for the thermoelectrics.  A systematic step-by-step model of thermo-magnetic energy harvester was presented and validated against the experimental data available in literature. The multi-physics model incorporates heat transfer, magnetostatic forces, mechanical vibrations, interface contact behavior, and piezoelectric based energy converter. We estimated natural frequency of the harvester, operating temperature regimes, and electromechanical efficiency as a function of dimensional and physical variables. The model provided limit cycle operation regimes which can be tuned using physical variables to meet the specific environment.<br />Buoyancy control is used in aquatic animals in order to maintain their vertical trajectory and travel in water column with minimum energy expense. Some crustaceans employ selective ion replacement of heavy or lighter ions in their dorsal carapace. A model of a buoyancy chamber was developed to achieve similar buoyancy control using electro-osmosis. The model captures all the essential ionic transport and electrochemistry to provide practical operating cycle for the buoyancy engine in the ocean environment.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:41:06Z (GMT). No. of bitstreams: 3 Joshi_KB_D_2013.pdf: 6001014 bytes, checksum: a914194db547bc7e60b1ea141ab815af (MD5) Joshi_KB_D_2013_support_1.pdf: 832163 bytes, checksum: 2299dd8dd41802d0fb817db3b0847b88 (MD5) Joshi_KB_D_2013_support_2.pdf: 528444 bytes, checksum: 1b880aa9dcb24e9e5e088e4073a334a4 (MD5)   Previous issue date: 2013-01-08",
  "format_medium": "ETD",
  "handle": "19256",
  "identifier_other": "vt_gsexam:297",
  "identifier_uri": "http://hdl.handle.net/10919/19256",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Bio-inspiration",
    "Energy efficiency",
    "Jellyfish",
    "Buoyancy engine",
    "Solar energy harvesting",
    "Thermo-magnetic energy harvester",
    "Finit"
  ],
  "title": "Modeling of Bio-inspired Jellyfish Vehicle for Energy Efficient Propulsion",
  "type": "Dissertation"
}