{
  "contributor_author": "Monroe, Herbert Thomas",
  "contributor_committeechair": "Craig, James Richard",
  "contributor_committeemember": [
    "Baskerville, Jane Jiggetts",
    "Cash, Carol S",
    "Price, Ted S"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-02-19T22:44:18Z",
  "date_available": "2013-02-19T22:44:18Z",
  "date_issued": "2013-02-01",
  "degree_discipline": "Educational Leadership and Policy Studies",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "A review of the available research indicates that relatively little is known about how districts employ Academic Achievement Teams or similar mechanisms to reduce declines in student achievement and sustain increased student achievement at the elementary school level (Kutash, Nico, Gorin, Rahmatullah, & Tallant, 2010).   Turning around chronically low-performing schools is challenging work requiring a systemic rather than school-by-school approach (Robinson & Buntrock, 2011). The most successful turnaround efforts have both high-impact leaders and the district capacity to initiate, support, and enhance transformational change through the use of data. Educational leaders on all levels are realizing meaningful information can only be acquired through a proper analysis of data and good decisions are based on this thoughtful process of inquiry and analysis (Creighton, 2007).  The intent of this study was to identify practices of Academic Achievement Teams that facilitated student achievement.  Interviews were conducted with principals, directors of elementary education, a teacher, and district liaison representing the Virginia Department of Education\\'s Office of School Improvement to gain insight into the operational and organizational structures of the Academic Achievement Teams. A qualitative design was selected to conduct this descriptive cross case study. In addition to the one-on-one interviews, observations of the Academic Achievement Team meetings and review of documents from each of the two study schools were examined to gain additional perspective regarding how the Academic Achievement Team operated to increase student achievement.  The interviews, observations, and document reviews were analyzed using the Constant Comparative Method to understand the specific practices employed by Academic Achievement Teams that increased student achievement at two elementary schools (Maykut & Morehouse, 1994).",
  "description_degree": "EDD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:44:18Z (GMT). No. of bitstreams: 1 Monroe_HT_T_2013.pdf: 1948338 bytes, checksum: b3c5ada6e2bc3cdb5dcc1df3f246f85a (MD5)   Previous issue date: 2013-02-01",
  "format_medium": "ETD",
  "handle": "19266",
  "identifier_other": "vt_gsexam:230",
  "identifier_uri": "http://hdl.handle.net/10919/19266",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Instructional Leadership",
    "Low Performing Schools",
    "At-Risk Schools",
    "Leadership Qualities and Practices",
    "Monitoring Data",
    "and Enha"
  ],
  "title": "District Leadership Practices that Enhance and Sustain Student Achievement at the Elementary School Level Through the Use of the Academic Achievement Team",
  "type": "Dissertation"
}