{
  "contributor_author": "Pandy, Susan M",
  "contributor_committeechair": "Khademian, Anne M",
  "contributor_committeemember": [
    "Wolf, James F",
    "Ponemon, Larry",
    "Hult, Karen M"
  ],
  "contributor_department": "School of Public and International Affairs",
  "date_accessioned": "2013-02-19T22:44:03Z",
  "date_available": "2013-02-19T22:44:03Z",
  "date_issued": "2013-02-13",
  "degree_discipline": "Public Administration/Public Affairs",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The Privacy Act of 1974 was designed to protect personal privacy captured in the records held by government agencies.  However, the scope of privacy protection has expanded in light of advances in technology, heightened security, ubiquitous threats, and the value of information. This environment has raised the expectations for public sector management of sensitive personal information and enhanced privacy protections.  While the expanse of privacy policy implementation is broad, this study focuses specifically on how agencies implement privacy impact assessments (PIAs) as required under Section 208 of the E-Government Act of 2002.  An enhanced understanding of the PIA implementation process serves as a portal into the strategic considerations and management challenges associated with broader privacy policy implementation efforts.  <br />A case study of how the U.S. Postal Service and the U.S. Department of Veterans Affairs have implemented PIAs provides rich insights into privacy policy implementation and outcomes.  Elite interviews enriched by process data and document analysis show how each organization undertook different approaches to PIA implementation over time.  This study introduces the sociology of law literature using Lauren Edelman\\'s conceptual framework to understand how organizations respond to and interpret law from within the organization, or endogenously.  Building upon Edelman\\'s model, certain characteristics of the PIA implementation are analyzed to provide rich description of the factors that influence the implementation process and lead to different policy outcomes.  <br />    The findings reflect valuable insights into the privacy policy implementation process and introduce the sociology of law literature to the field of public administration.  This literature furthers our understanding of how organizations enact policy over time, how the implementation process unfolds and is impacted by critical factors, and for identifying emergent patterns in organizations.  This study furthers our understanding how privacy policy, in particular, is implemented over time by examining the administrative capacities and levels of professionalism that are utilized to accomplish this effort.  This research comes at a critical time in the context of the emerging legal and political environment for privacy that is characterized by new expectations by the public and the expanding role of government to manage and protect sensitive information.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:44:03Z (GMT). No. of bitstreams: 1 Pandy_SM_D_2013.pdf: 1774103 bytes, checksum: b9b81087f68d7a58919b52cdb109cb94 (MD5)   Previous issue date: 2013-02-13",
  "format_medium": "ETD",
  "handle": "19262",
  "identifier_other": "vt_gsexam:211",
  "identifier_uri": "http://hdl.handle.net/10919/19262",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "privacy",
    "privacy impact assessment",
    "privacy policy",
    "data breach",
    "e-government"
  ],
  "title": "An Examination of the Privacy Impact Assessment as a Vehicle for Privacy Policy  Implementation in U.S. Federal Agencies",
  "type": "Dissertation"
}