{
  "contributor_author": "Whited, Bryce Matthew",
  "contributor_committeechair": "Rylander, M Nichole",
  "contributor_committeemember": [
    "Xu, Yong",
    "Wang, Ge",
    "Rylander, Christopher G",
    "Soker, Shay",
    "Goldstein, Aaron S"
  ],
  "contributor_department": "Biomedical Engineering",
  "date_accessioned": "2013-02-19T22:43:54Z",
  "date_available": "2013-02-19T22:43:54Z",
  "date_issued": "2013-02-01",
  "degree_discipline": "Biomedical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Cardiovascular disease is currently the leading cause of death in the U.S. that frequently requires bypass surgery using vascular grafts for treatment. Current limitations with fully synthetic grafts have led researchers to bioengineered alternatives that consist of a combination of vascular scaffolds and cells. A major challenge in creating a functional bioengineered vascular graft is development of a confluent endothelium on the lumen that is able to resist detachment under physiologic fluid flow. In addition, methodologies used to assess the growth and maturation of the endothelium in a noninvasive and dynamic manner are severely lacking. Therefore, the overall goal of this research is to advance the field of vascular tissue engineering by 1) creating methodologies to enhance EC adherence to a vascular graft and 2) development of a noninvasive and real-time imaging system capable of assessing the graft endothelium.  To achieve these objectives, three separate studies were performed. In the first study, electrospun scaffold fiber diameter and alignment were systematically varied to determine their effect on endothelial cell (EC) morphology and adherence under fluid flow. ECs on uniaxially aligned nanofibers displayed elongated and aligned morphologies leading to higher adherence to the scaffolds under physiologic levels of fluid flow as compared to those on randomly oriented scaffolds. In the second study, a fiber optic based (FOB) imaging system was developed to image fluorescent ECs through a thick electrospun scaffold.  Results demonstrated that the FOB imaging system was able to accurately visualize fluorescent ECs in a noninvasive manner through the thick and highly opaque scaffold. In the final study, the FOB imaging system was used to noninvasively quantify vascular graft endothelialization, EC detachment, and apoptosis through the vessel wall with greater imaging penetration depth than two-photon microscopy. Additionally, the FOB method was capable of continuously tracking EC migration and endothelialization of a bioengineered graft in a bioreactor. Overall, these results demonstrate that aligned scaffold topographies enhance EC adherence under fluid flow and the FOB imaging system is a promising tool to monitor endothelium development and response to fluid flow in a manner that has not previously been afforded using conventional imaging methods.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:43:54Z (GMT). No. of bitstreams: 2 Whited_BM_D_2013.pdf: 41769799 bytes, checksum: be91a4b9c8a9389f80d83d224955709b (MD5) Whited_BM_D_2013_support_1.pdf: 83724 bytes, checksum: 74d85c3e8ff7add4fec6bd002e549681 (MD5)   Previous issue date: 2013-02-01",
  "format_medium": "ETD",
  "handle": "19260",
  "identifier_other": "vt_gsexam:140",
  "identifier_uri": "http://hdl.handle.net/10919/19260",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Tissue engineering",
    "vascular graft",
    "nondestructive imaging",
    "electrospinning",
    "endothelial cells"
  ],
  "title": "Design and nondestructive imaging of a bioengineered vascular graft endothelium",
  "type": "Dissertation"
}