{
  "contributor_author": "Ashry, Islam Ahmed Ibrahim Youssef",
  "contributor_committeechair": "Xu, Yong",
  "contributor_committeemember": [
    "Heflin, James R",
    "Wang, Anbo",
    "Okaz, Ali Mohamed",
    "Riad, Sedki Mohamed",
    "Pickrell, Gary R"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2013-02-19T22:44:32Z",
  "date_available": "2013-02-19T22:44:32Z",
  "date_issued": "2013-02-04",
  "degree_discipline": "Electrical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The process of spontaneous emission can be dramatically modified by optical micro- and nanostructures. We studied the modification of fluorescence dynamics using a polymer spacer layer fabricated through layer-by-layer (LbL) self-assembly. The advantages of this method are numerous: The self-assembled spacers can possess exceptional smooth surface morphology; The thickness of the spacer can be controlled with nanometer accuracy; And depending on fabrication conditions, the spacer layer is stimuli responsive and its thickness can be dynamically tuned.<br />This thesis contains three interlinked components. First, we vary LbL spacer layer thickness and explore the change in fluorescence lifetime induced by the modified photonic density of states (PDOS), i.e., Purcell effects. Our experimental results agree well with theoretical predictions based on a classical dipole model, which also yields consistent values for the fluorophores\\' intrinsic fluorescence lifetime and quantum yield near a dielectric as well as a plasmonic interface. Based on this observation, we further demonstrate that self-assembled fluorophores can be used to probe the modified PDOS near optical micro- and nano-structures. <br />These results naturally lead to the second component of our research. In particularly, based on the PDOS-induced changes in fluorescent lifetime, we develop a non-contact method that can measure morphological changes with nanoscale resolution. Our method relies on quantitatively linking fluorophore position with PDOS, and is validated through direct comparison with ellipsometry and atomic force microscopy (AFM) measurements. To demonstrate the potential application of this method, we investigated the swelling/deswelling of LbL films induced by pH changes. Our results indicate significant difference between a LbL film composed of a single polymer monolayer and a LbL film with 3 monolayers. Such stimuli-responsive polymers can be used to construct active and tunable plasmonic nano-devices. As a proof-of-principle demonstration, we experimentally confirm that it is possible to utilize the swelling/deswelling behavior of stimuli-responsive films to dynamically control the separation between Au nanoparticles and Texas Red (TR) dyes. This result is based on the strong correlation of TR fluorescence lifetime and nanoparticles-TR separation. <br />Finally, we investigate the impact of different lithography processes on the fluorescence properties of self-assembled fluorophores. We consider three methods: direct fluorophore patterning through ultraviolet (UV) ablation, focused ion beam (FIB) milling of self-assembled fluorophores, and self-assembly of fluorescent materials over plasmonic nano-patterns. <br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-02-19T22:44:32Z (GMT). No. of bitstreams: 1 Ashry_IA_D_2013.pdf: 2011668 bytes, checksum: 059aaa315fe06d7e9643314bbbe2c899 (MD5)   Previous issue date: 2013-02-04",
  "format_medium": "ETD",
  "handle": "19270",
  "identifier_other": "vt_gsexam:119",
  "identifier_uri": "http://hdl.handle.net/10919/19270",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Spontaneous Emission",
    "Fluorescence Lifetime",
    "Photonic Density of States (PDOS)",
    "Plasmonic Structures",
    "Self-Assembly",
    "Patterning"
  ],
  "title": "Investigating the Modification of Spontaneous Emission using Layer-by-Layer Self-Assembly",
  "type": "Dissertation"
}