{
  "contributor_author": "Lewis, Zachary Evan",
  "contributor_committeechair": "Takeuchi, Tatsu",
  "contributor_committeemember": [
    "Pitt, Mark L",
    "Brown, Ezra A",
    "Sharpe, Eric R"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2013-03-06T09:00:16Z",
  "date_available": "2013-03-06T09:00:16Z",
  "date_issued": "2013-03-05",
  "degree_discipline": "Physics",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "In this work, the consequences of several modifications to quantum mechanics are examined. These modifications, motivated by string theory, fall into two categories: ones in which the canonical commutation relations between position and momentum are deformed and ones in which the space of states used are vector spaces over Galois fields instead of complex Hilbert spaces. The particular deformation of the canonical commutation relations used leads to a minimum value of the uncertainty in position which is interpreted as a minimum length scale. Both harmonic and anharmonic oscillators are studied in this framework with normalizable, positive energy eigenstates found in both cases. The quantum uncertainty relations and classical counterparts to these states are discussed. Creating modified quantum theories by replacing the Hilbert spaces of canonical quantum mechanics with vector spaces defined over several finite, Galois fields is accomplished. Correlation functions are calculated in these theories and the maximum values are shown to not behave as would be expected by the standard, Bell-like, bounding inequality theorems. The interpretations and implications of these theories are discussed.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-03-06T09:00:16Z (GMT). No. of bitstreams: 1 Lewis_ZE_D_2013.pdf: 1981704 bytes, checksum: c46c6ae64510faad787047a8c145b4dc (MD5)   Previous issue date: 2013-03-05",
  "format_medium": "ETD",
  "handle": "19277",
  "identifier_other": "vt_gsexam:364",
  "identifier_uri": "http://hdl.handle.net/10919/19277",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Physics",
    "Quantum Mechanics",
    "Foundations of Quantum Mechanics"
  ],
  "title": "A Study of Modifications to Quantum Mechanics",
  "type": "Dissertation"
}