{
  "contributor_author": "Toosizadeh, Nima",
  "contributor_committeechair": "Nussbaum, Maury A",
  "contributor_committeemember": [
    "Madigan, Michael L",
    "West, Robert L",
    "Agnew, Michael J",
    "Sturges, Robert H"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2013-03-02T09:00:10Z",
  "date_available": "2013-03-02T09:00:10Z",
  "date_issued": "2013-03-01",
  "degree_discipline": "Industrial and Systems Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Among several work-related injuries, low back disorders (LBDs) are the leading cause of lost<br />workdays, and with annual treatment costs in excess of $10 billion in the US. Epidemiological<br />evidence has indicated that prolonged and/or repetitive non-neutral postures, such as trunk<br />flexion, are commonly associated with an increased risk of LBDs. Trunk flexion can result in<br />viscoelastic deformations of soft tissues and subsequent mechanical and neuromuscular<br />alterations of the trunk, and may thereby increase LBD risk. While viscoelastic behaviors of<br />isolated spinal motion segments and muscles have been extensively investigated, in vivo<br />viscoelastic responses of the trunk have not, particularly in response to flexion exposures.<br />Further, most biomechanical efforts at understanding occupational LBDS have not considered the influence of flexion exposures on spine loads.<br /><br />Four studies were completed to characterize viscoelastic deformation of the trunk in response<br />several flexion exposures and to develop and evaluate a computational model of the human trunk that accounts for time-dependent characteristics of soft tissues. Participants were exposed to prolonged flexion at different trunk angles and external moments, and repetitive trunk flexion with different external moments and flexion rates. Viscoelastic properties were quantified using laboratory experiments and viscoelastic models. A multi-segment model of the upper body was developed and evaluated, and then used to estimate muscle forces and spine loads during simulated lifting tasks before and after prolonged trunk flexion at a constant angle and constant external moment. Material properties from the earlier experiments were used to evaluate/calibrate the model.<br /><br />Experimental results indicated important effects of flexion angle, external moment, and flexion<br />rate on trunk viscoelastic behaviors. Material properties from fitted Kelvin-solid models differed with flexion angle and external moment. Nonlinear viscoelastic behavior of the trunk tissues was evident, and predictive performance was enhanced using Kelvin-solid models with \"2 retardation/relaxation time constants. Predictions using the multi-segment model suggested increases in spine loads following prolonged flexion exposures, primarily as a consequence of additional muscle activity. As a whole, these results help to characterize the effects of trunk flexion exposures on trunk biomechanics, contribute to more effective estimates of load distribution among passive and active components, enhance our understanding of LBD etiology, and may facilitate future controls/interventions.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-03-02T09:00:10Z (GMT). No. of bitstreams: 1 Toosizadeh_N_D_2013.pdf: 1525557 bytes, checksum: 1be75d2c2a9ebaafa784f08c9270064d (MD5)   Previous issue date: 2013-03-01",
  "format_medium": "ETD",
  "handle": "19274",
  "identifier_other": "vt_gsexam:409",
  "identifier_uri": "http://hdl.handle.net/10919/19274",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Lumbar spine",
    "Prolonged flexion",
    "Repetitive flexion",
    "Viscoelastic modeling",
    "Biomechanics"
  ],
  "title": "Time-dependent assessment of the human lumbar spine in response to flexion exposures: in vivo measurement and modeling",
  "type": "Dissertation"
}