{
  "contributor_author": "Childress, Toni Leigh Pardue",
  "contributor_committeechair": "Cash, Carol S",
  "contributor_committeemember": [
    "Twiford, Travis W",
    "Mallory, Walter D",
    "Bond, Eric Weston"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-03-15T08:00:12Z",
  "date_available": "2013-03-15T08:00:12Z",
  "date_issued": "2013-03-14",
  "degree_discipline": "Educational Leadership and Policy Studies",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "Concerns over the academic success of first-time ninth-grade students transitioning into the high school setting continue to stimulate substantial interest in identifying the various factors that cause the ninth-grade bottleneck.  Extensive research shows that when ninth-grade students transition into the high school setting, students have a difficult time navigating the more academically rigorous, less nurturing, usually larger and anonymous high school setting.  Studies have shown that transition practices to help ninth-grade students are successful in making this transition smoother and more successful for incoming freshmen, thereby leading to more credits and a stronger chance for students to earn a diploma.<br />This dissertation is a replication of a previous Virginia Tech study completed by Henry Johnson titled High School Transition Practices for Ninth Graders: A Descriptive Study of Maryland Public High Schools, but it focuses on public schools in the Commonwealth of Virginia.  The primary data collection method was a survey that was sent to all Virginia principals.  First, results from the survey were analyzed to develop a description of the various transition practices existing in Virginia\\'s public high schools in relation to school size, demographics, and community type.  Second, the survey data were analyzed to determine the various perceptions of school officials concerning the effectiveness of reported transition practices.  The data provide a description of the transition practices in Virginia\\'s public schools.  Results from this study give administrators and policymakers an idea of what type of transition practices exist in the various public schools in Virginia as well as the perceived effectiveness of the practices in place.<br />",
  "description_degree": "EDD",
  "description_provenance": "Made available in DSpace on 2013-03-15T08:00:12Z (GMT). No. of bitstreams: 1 Childress_TL_T_2013.pdf: 3008287 bytes, checksum: 8cc1f5e6464273888291efa86bfaaf0d (MD5)   Previous issue date: 2013-03-14",
  "format_medium": "ETD",
  "handle": "19285",
  "identifier_other": "vt_gsexam:372",
  "identifier_uri": "http://hdl.handle.net/10919/19285",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "high school dropout rates",
    "ninth-grade academy",
    "ninth-grade dropouts",
    "ninth-grade discipline",
    "junior high school",
    "school-within-"
  ],
  "title": "A Study of Ninth-Grade Transition Practices Across the Commonwealth of Virginia",
  "type": "Dissertation"
}