{
  "contributor_author": "Fleming, Catherine Stephanie",
  "contributor_committeechair": "Reiter, Mark S",
  "contributor_committeemember": [
    "Maguire, Rory Owen",
    "Freeman, Joshua Herbert",
    "Alley, Marcus M"
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2013-03-21T08:00:06Z",
  "date_available": "2013-03-21T08:00:06Z",
  "date_issued": "2013-03-20",
  "degree_discipline": "Crop and Soil Environmental Sciences",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Managing nitrogen (N) and phosphorus (P) in agricultural systems in the Mid-Atlantic is an important practice due to environmental and economic concerns. The objectives of the experiments reported in this dissertation were: (1) evaluate irrigation via evapotranspiration (ET) calculations for fresh market tomatoes grown using polyethylene mulch; (2) determine optimum N application method and rate for fresh market tomatoes; and (3) evaluate changes of soil P pools from applications of poultry litter (PL), PL amended with alum (PLA), triple super phosphate (TSP), and no P fertilizer in a long-term no-till corn-wheat-soybean rotation. A calculated irrigation rate, based on 30-year average historical weather data, of 0.5ET provided sufficient irrigation for optimum tomato yields in near average climactic seasons. Utilizing a tensiometer in a warmer and drier season than average protected against under-irrigation rates for fresh market tomatoes. Nitrogen applications ranging from 200 to 242 kg N ha-1 using a combination of a banded method, incorporation, and fertigation produced optimum tomato yields while significantly reducing residual post-harvest inorganic soil N compared to higher N fertilizer rates. The incorporated only method resulted in crop loss and reduced yields with N fertilizer rates greater than 224 kg N ha-1 in the unseasonably hot and dry season. Applications of PL and PLA to no-till land on a N basis significantly increased Mehlich-1 extractable P and 1 M NH4Cl extractable P (loosely bound P) in shallow (0-5 cm) soil samples compared to 0-P control and TSP treatments. However, alum additions in PLA significantly reduced loosely bound P compared to soils fertilized with non-amended PL in shallow soil samples. Overall, results from these studies offer insight into production practices that increase profitability and environmental stewardship in fresh market tomatoes by optimizing fertilizer and irrigation use while maintaining marketable tomato yields. Additionally, PLA reduced the amount of loosely bound P in 0-5 cm soil samples that could potentially move to surface water in these coarse textured soils.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-03-21T08:00:06Z (GMT). No. of bitstreams: 1 Fleming_CS_D_2013.pdf: 849560 bytes, checksum: d527a86df3fe854e67924666a21f4a23 (MD5)   Previous issue date: 2013-03-20",
  "format_medium": "ETD",
  "handle": "19292",
  "identifier_other": "vt_gsexam:332",
  "identifier_uri": "http://hdl.handle.net/10919/19292",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "nutrient management",
    "nitrogen",
    "phosphorus",
    "tomato",
    "no-till",
    "irrigation"
  ],
  "title": "Nitrogen and Phosphorus Management in the Mid-Atlantic",
  "type": "Dissertation"
}