{
  "contributor_author": "Wang, Hong",
  "contributor_committeechair": "Pruden-Bagchi, Amy Jill",
  "contributor_committeemember": [
    "Falkinham, Joseph O.",
    "Dietrich, Andrea M",
    "Edwards, Marc A",
    "Reardon, Kenneth F."
  ],
  "contributor_department": "Civil and Environmental Engineering",
  "date_accessioned": "2013-03-29T08:00:21Z",
  "date_available": "2013-03-29T08:00:21Z",
  "date_issued": "2013-03-28",
  "degree_discipline": "Civil Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Opportunistic pathogens (e.g., Legionella pneumophila, Mycobacterium avium complex, Acanthamoeba polyphaga, Pseudomonas aeruginosa) residing in human-made water systems, particularly premise plumbing, are now the primary source of water-borne disease in developed countries. The prevention and control of opportunistic pathogens is a new challenge in premise plumbing due to the limited knowledge concerning the factors driving their occurrence and regrowth mechanisms, and also the complexity of premise plumbing conditions. The goal of this study is to identify key factors governing occurrence of opportunistic pathogens in drinking water distribution systems, particularly premise plumbing, via field investigations and lab-scale experiments. <br /><br />A molecular survey of three opportunistic pathogens (L. pneumophila, M. avium, P. aeruginosa), related groups (Legionella and mycobacteria) and two amoeba hosts (Acanthamoeba spp. and Hartmanella vermiformis) was performed in two real-word chloraminated drinking water distribution systems using quantitative polymerase chain reaction (q-PCR). A high occurrence of Legionella (\" 69.0%) and mycobacteria (100%), lower occurrence of L. pneumophila (\" 20%) and M. avium (\" 33.3%), and rare detection of Pseudomonas aeruginosa (\" 13.3%) was observed in both systems. Hartmanella vermiformis was more prevalent than Acanthamoeba. Three-minute flushing resulted in reduced gene copies of Legionella, mycobacteria, H. vermiformis and 16S rRNA genes (P<0.05) and distinct microbial community structure in postflushing water, implying strong regrowth potential of opportunistic pathogens in premise pluming. <br /><br />In order to examine the influence of pipe material, disinfectant type, and water age on occurrence and persistence of the target microorganisms, triplicate simulated distribution systems (SDSs) comparing iron, cement and PVC pipe materials were fed either chlorinated or chloraminated tap water, and were sampled at water ages ranging from 1d to 5.7d. q-PCR quantification of target microorganisms in both biofilm and bulk water revealed that Legionella, mycobacteria, P. aeruginosa and both amoebas naturally colonized the six SDSs, but L. pneumophila and M. avium were not detected. Disinfectant type and dose have the strongest influence on the microbiota. Disinfectant decay was noted with water age, particularly in chloraminated SDSs (due to nitrification), generally resulting in increased microbial detection frequencies and densities with water age. Influence of pipe material became apparent at water ages corresponding to low disinfectant residual. <br /><br />Natural colonization of Legionella spp., Mycobacterium spp., Acanthamoeba spp., H. vermiformis and M. avium was also observed in biofilms from five annular reactors, which were used to investigate effects of prior granular activated carbon (GAC) biofiltration and disinfectant type (chlorine, chloramine) on opportunistic pathogens under premise plumbing conditions. GAC pre-treatment effectively reduced total organic carbon (TOC). In most cases, total bacteria and opportunistic pathogens were higher in undisinfected annular reactors, but the levels were not proportional to the level of GAC pre-treatment/TOC. Chlorine was more effective for controlling mycobacteria and Acanthamoeba, whereas chloramine was more effective for controlling Legionella. Both chlorine and chloramine effectively reduced M. avium and H. vermiformis numbers. Pyrosequencing of 16S rRNA genes in biofilms revealed a significant effect of GAC pre-treatment and disinfectant type on the microbial community structure.<br /><br />Overall, the study provides insights to critical factors triggering proliferation of opportunistic pathogens in drinking water systems. Knowledge gained from this study can assist in formulating practical guidance for drinking water utilities and water consumers in terms of opportunistic pathogen prevention and control. \"<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-03-29T08:00:21Z (GMT). No. of bitstreams: 1 Wang_H_D_2013.pdf: 2661076 bytes, checksum: 5db2fb3fabff2035c40506c2bde258be (MD5)   Previous issue date: 2013-03-28",
  "format_medium": "ETD",
  "handle": "19305",
  "identifier_other": "vt_gsexam:369",
  "identifier_uri": "http://hdl.handle.net/10919/19305",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Legionella",
    "mycobacteria",
    "Pseudomonas aeruginosa",
    "amoeba"
  ],
  "title": "Critical factors controlling regrowth of opportunistic pathogens in premise plumbing",
  "type": "Dissertation"
}