{
  "contributor_author": "Frank, Tara Elizabeth",
  "contributor_committeechair": "Hirt, Joan B",
  "contributor_committeemember": [
    "Arminio, Jan L.",
    "Janosik, Steven M",
    "Burge, Penny L"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-03-30T08:00:07Z",
  "date_available": "2013-03-30T08:00:07Z",
  "date_issued": "2013-03-29",
  "degree_discipline": "Educational Leadership and Policy Studies",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Departure among student affairs administrators in higher education has been an issue for decades (Evans, 1988; Lorden, 1998; Tull, 2006). Rates of departure from student affairs within the first five years of experience are estimated at 50% to 60% (Holmes, Verrier, & Chisholm, 1983; Lorden, 1998; Tull, 2006). However, there is very little research that examines the reasons that student affairs professionals leave the field.<br />I conducted a qualitative study, using purposeful sampling, to determine what factors were most salient in new student affairs professionals\\' departure. The conceptual framework was a modified version of Daly and Dee\\'s (2006) model that described how psychological, structural, and environmental variables affect intent to stay with an organization. Participants included 24 former student affairs professionals who earned a master\\'s degree in student affairs administration or a related field between 2004 and 2010 and who left the field between 2009 and 2011. Data were analyzed using a constant comparative method.<br />Findings suggest that new professionals depart student affairs for both Institutional and Individual reasons. Institutionally, professionals want to believe they are valued and supported, particularly by those in management positions. They want stable and supportive supervisors. They also seek stable organizational environments. Many feel they work too many hours for too little money and find few opportunities to advance. Individually, professionals seek a personal connection to their institution and job and leave the profession if those expectations are unmet. Additionally, some professionals find it difficult to obtain work/life balance. When they are left feeling unfulfilled in their jobs, they seek satisfaction outside of the field, pursuing other positions that more fully meet their wants and needs more. Future research could explore whether the rate of new student affairs professional departure is unusual when compared to other professions (e.g., teachers, social workers, nurses) or whether it is endemic to the student affairs profession.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-03-30T08:00:07Z (GMT). No. of bitstreams: 2 Frank_TE_D_2013.pdf: 926363 bytes, checksum: ff76959a51bb793cf29e4a822c6e77f0 (MD5) Frank_TE_D_2013_support_1.pdf: 200912 bytes, checksum: 07f035485e4f4ace50f71909d6f0bba5 (MD5)   Previous issue date: 2013-03-29",
  "format_medium": "ETD",
  "handle": "19306",
  "identifier_other": "vt_gsexam:417",
  "identifier_uri": "http://hdl.handle.net/10919/19306",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "departure",
    "student affairs",
    "new student affairs professionals",
    "turnover"
  ],
  "title": "Why Do They Leave?  The Departure of Student Affairs Professionals",
  "type": "Dissertation"
}