{
  "contributor_author": "Outlaw, Minnie Ruth",
  "contributor_committeechair": "Twiford, Travis W",
  "contributor_committeemember": [
    "Cash, Carol S",
    "Earthman, Glen I",
    "Melton, David Glenn"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-03-29T08:00:17Z",
  "date_available": "2013-03-29T08:00:17Z",
  "date_issued": "2013-03-28",
  "degree_discipline": "Educational Leadership and Policy Studies",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The purpose of this historical case study was to document the history of the Louisa Training School. The study focused on the period from 1926, when the Louisa County School Board established the Louisa Training School as a county-owned and operated school, through 1953, when the division\\'s school consolidation plan was implemented (Despot, 1963). Subsequently, the building was used as an elementary school from 1953 to 1970.<br /><br />The history of Louisa Training School was documented primarily through an analytical inquiry into the experiences and perceptions of former students, teachers, and others familiar with establishment, operation, and closure of the school. The study participants were initially identified through gatekeepers who were associated with the school during its operation. The participants were interviewed as primary sources. Their personal experiences and perceptions formed the basis of oral histories upon which this study was framed. Their recollections not only provided basic information, but also added rich meaning and depth to the study. <br /><br />Other primary sources were used to triangulate, verify, and augment the participants\\' accounts. Primary sources included minutes from the Louisa County School Board and the Louisa County Board of Supervisors, the Virginia Board of Education, newspapers, artifacts, and personal possessions. Secondary sources included general histories, commentaries, and documents used to situate the study in historical context. <br /><br />The major findings of this historical study present the challenges that Louisa County faced trying to provide an education for its Negro citizenry in a dual segregated school system. These challenges included but were not limited to any transportation, textbooks, and facilities. <br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-03-29T08:00:17Z (GMT). No. of bitstreams: 1 Outlaw_MR_D_2013.pdf: 3775524 bytes, checksum: 2c3331a1cfc180e53b4d40b6e6438e6b (MD5)   Previous issue date: 2013-03-28",
  "format_medium": "ETD",
  "handle": "19304",
  "identifier_other": "vt_gsexam:394",
  "identifier_uri": "http://hdl.handle.net/10919/19304",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Louisa",
    "Training Schools",
    "History of Education",
    "African-Americans",
    "Blacks",
    "Negroes"
  ],
  "title": "A History of The Louisa Training School in Louisa County, Virginia, 1926-1953",
  "type": "Dissertation"
}