{
  "contributor_author": "Johnson, Paula",
  "contributor_committeechair": "Cash, Carol S",
  "contributor_committeemember": [
    "Twiford, Travis W",
    "Earthman, Glen I",
    "Rogers, Catherine Spain"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-04-04T08:00:07Z",
  "date_available": "2013-04-04T08:00:07Z",
  "date_issued": "2013-04-03",
  "degree_discipline": "Educational Leadership and Policy Studies",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "With just a click of a button, individuals from across the world can communicate and share information with ease and efficiency through the internet. Employing similar technology, schools are implementing student information systems with a parent portal component to provide parents, students, teachers and guidance counselors with anytime, real-time avenues of communication regarding attendance, grades and standardized test scores in an effort to increase parental involvement and student achievement. Schools must collect and review data to make sound decisions to guide practice (Mann & Shakeshaft, 2003). Therefore, utilization of parent portals should be evaluated along with the strategies employed to increase parental use. This study is an investigation of the perceptions of high school teachers and guidance counselors on the impact of a parent portal on parental involvement and strategies used to increase parental use. Through descriptive and inferential analyses of survey data, key findings were revealed. Overall, guidance counselors perceived the impact of the parent portal to be positive and indicated more strategies were used in their schools differing from the teachers\\' perception. However, both indicated a need to partner with the community to improve parental use of the parent portal.  Publishing an annual user guide on the parent portal for all stakeholders (teachers, guidance counselors, administrators, students, parents and the community) was one major implication. Centralizing information distributed regarding the parent portal will strengthen the overall intent of the program and the division\\'s goal of providing opportunities for all to actively engage in student achievement (Longfellow, 2004).",
  "description_degree": "EDD",
  "description_provenance": "Made available in DSpace on 2013-04-04T08:00:07Z (GMT). No. of bitstreams: 1 Johnson_P_T_2013.pdf: 1538899 bytes, checksum: 443599c3ec500640b84fa110efaa9197 (MD5)   Previous issue date: 2013-04-03",
  "format_medium": "ETD",
  "handle": "19310",
  "identifier_other": "vt_gsexam:478",
  "identifier_uri": "http://hdl.handle.net/10919/19310",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Parental Involvement",
    "Parent-teacher Communication",
    "Student Information Systems",
    "Secondary Schools and Technology"
  ],
  "title": "The Impact of Technology on Parental Involvement:  Perceptions of teachers and guidance counselors regarding the impact of a parent portal component of a student information system on parental involvement at the high school level",
  "type": "Dissertation"
}