{
  "contributor_author": "Overton Stanard, Stephanie V",
  "contributor_committeechair": "Klunk, Clare D",
  "contributor_committeemember": [
    "Boucouvalas, Marcie",
    "Hinson, Kenneth Earl",
    "Morris, Linda E",
    "Renard, Paul D"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2013-04-12T08:00:25Z",
  "date_available": "2013-04-12T08:00:25Z",
  "date_issued": "2013-04-11",
  "degree_discipline": "Human Development",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Organizations can incur extensive costs to fund training typically available to employees free of charge. However, some employees do not participate. The body of research reviewed in adult education focused on relevant studies and models of contributing factors for participation in academia, the workplace, and the community. No studies were found that investigated the motivation of adults who participate and do not participate in the Intelligence Community (IC). <br /><br />This study empirically examined the factors that influence adult participation in IC workplace training. The survey instrument was an adapted version of the Education Participation Scale-Alternate (EPS-A) and the Deterrents to Participation Scale-General (DPS-G) with seven open-ended questions to identify factors of adult participation and non-participation in the IC. Respondents (111) were participants and non-participants of leadership development training and consisted of African-American 75 (68%), Caucasian 21 (19%), Multi-Cultural 9 (8%), other 3 (3%), and 81 (75%) women and 27 (25%) men between the age of 21 and 80. Most respondents possessed a bachelor\\'s degree or higher 78 (72%), worked in the IC for more than 10 years 36 (33%), and earned an annual family income of more than $130,000 63 (60%). Statistically significant results showed that lack of course relevance and time constraints were perceived deterrents to participation. Communication improvement was identified as a perceived enabler for non-participants. Additional findings of this study revealed four factors\"to meet new people, to achieve an occupational goal, to increase my job competence, and to expand my mind-that influenced participation in leadership development training in the IC. <br /><br />Major themes such as leader or supervisor support, association, encouragement, selection, career advancement, personal growth, and availability of time were highlighted as enablers and deterrents of adult participation in workplace training. These findings enhance the current body of research in adult participation by providing information on participation in the IC that was previously not available in the literature and increase practitioners\\' knowledge of contributing factors that might affect the development of future leaders.<br /> <br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-04-12T08:00:25Z (GMT). No. of bitstreams: 1 Overton_Stanard_SV_D_2013.pdf: 1918434 bytes, checksum: d306b9edae65e10b0e0084e9cd189e9f (MD5)   Previous issue date: 2013-04-11",
  "format_medium": "ETD",
  "handle": "19318",
  "identifier_other": "vt_gsexam:379",
  "identifier_uri": "http://hdl.handle.net/10919/19318",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Adult Participation",
    "Motivation",
    "Adult Learner",
    "Training",
    "Leadership Development",
    "Workplace",
    "Government"
  ],
  "title": "Motivation to Participate in Workplace Training Within the Intelligence Community and Beyond:  A Study of Contributing Factors",
  "type": "Dissertation"
}