{
  "contributor_author": "Scott, Brigitte Condon",
  "contributor_committeechair": "Garrison, James W.",
  "contributor_committeemember": [
    "Kelly, Patricia Proudfoot",
    "Hausman, Bernice L.",
    "Brandt, Carol Beth"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2013-04-04T08:00:13Z",
  "date_available": "2013-04-04T08:00:13Z",
  "date_issued": "2013-04-03",
  "degree_discipline": "Curriculum and Instruction",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This dissertation is an examination of the ways English teachers may be complicit in reproducing an abstinence-based sex education discourse in their own classroom practices and discussions of literature. Working from disciplinary research in sex education, sociology, English education, anthropology, and public health, I explore English teachers\\' experiences in negotiating the effects of, reactions to, and expectations for discussing sexuality, intimacy, and gender in a school community. Using feminist positioning theory and Bakhtin\\'s concepts of dialogism and ventriloquism, I explore how teachers approach, grapple with, contribute to, and leverage dominant institutional discourses in their practices, thereby mediating knowledge, possibilities for conversations, and institutional norms. An amalgam of teaching philosophies, methodologies, and political ideologies underscores teachers\\' voicing patterns and discursive positions, helping to further inform an understanding of how contentious social issues are negotiated in the classroom. The agentic discursive positions teachers take up provide insights into teachers as mediating agents within institutional discourses, but not necessarily as change agents of institutional norms.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-04-04T08:00:13Z (GMT). No. of bitstreams: 1  Scott_BC_D_2013.pdf: 1217934 bytes, checksum: 78b392f285848576aca8356cdc1de9a0 (MD5)    Previous issue date: 2013-04-03",
  "format_medium": "ETD",
  "handle": "19311",
  "identifier_other": "vt_gsexam:328",
  "identifier_uri": "http://hdl.handle.net/10919/19311",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "English teachers",
    "sexuality",
    "Bakhtin",
    "positioning theory",
    "ethnography"
  ],
  "title": "Discussing Sexuality in the English Classroom: Using Bakhtinian Analyses and Positioning Theory to Explore Teacher Talk",
  "type": "Dissertation"
}