{
  "contributor_author": "Burrows, Timothy",
  "contributor_committeechair": "Creamer, Elizabeth G",
  "contributor_committeemember": [
    "Burge, Penny L",
    "Culver, Steven M",
    "Skaggs, Gary E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-04-13T08:00:25Z",
  "date_available": "2013-04-13T08:00:25Z",
  "date_issued": "2013-04-12",
  "degree_discipline": "Educational Research and Evaluation",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "With the increase in frequency of the use of mixed methods, both in research publications and in externally funded grants there are increasing calls for a set of standards to assess the quality of mixed methods research. The purpose of this mixed methods study was to conduct a multi-phase analysis to create a preliminary rubric to evaluate mixed methods research articles. This study included four research questions:<br />1. What are the common evaluation criteria found in the contemporary methodological literature pertaining to the design of mixed methods research?<br />2. What evaluation criteria do experts in the field of mixed methods research perceive as the most important when distinguishing top-quality research in mixed methods?<br />3. What differences are there in the outcome of the rubric for evaluating mixed methods research identified from the literature compared to those advocated most uniformly by a panel of mixed methods research experts?<br />4. What are disciplinary differences between the use of mixed methods and views about evaluating it, including the role of paradigms in mixed methods research?<br />    In the first phase of this multi-phase mixed methods study I used an inductive qualitative process to identify the quality criteria endorsed by 12 methodologists with a long-term involvement in mixed methods research. In the second phase of this study I conducted a quantitative analysis to pilot test a set of criteria identified in the qualitative phases. The sample for both phases of this study was comprised of the same eight males  <br />and four females from multiple nationalities. Respondents to the on-line survey rated all 14 items as being important, with 11 of the 14 items being rated as very important or higher.<br />    When considered together, findings from the two phases of this study provide a interesting view of attitudes about the use and application of quality standards to the mixed methods literature. While there was agreement about what elements were important to evaluate, there was not an agreement about the idea that one set of standards could be applied to all mixed methods studies.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-04-13T08:00:25Z (GMT). No. of bitstreams: 1 Burrows_T_D_2013.pdf: 966691 bytes, checksum: edf62f84c7d4d3ca8472fdda338767c7 (MD5)   Previous issue date: 2013-04-12",
  "format_medium": "ETD",
  "handle": "19324",
  "identifier_other": "vt_gsexam:529",
  "identifier_uri": "http://hdl.handle.net/10919/19324",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Mixed Methods",
    "Evaluation",
    "Rubric",
    "Quality"
  ],
  "title": "A Preliminary Rubric Design to Evaluate Mixed Methods Research",
  "type": "Dissertation"
}