{
  "contributor_author": "Alukwe, Isaac A",
  "contributor_committeechair": "Dillaha, Theo A",
  "contributor_committeemember": [
    "Wolfe, Mary Leigh",
    "Hession, William Cully",
    "Godrej, Adil N"
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2013-04-24T08:00:24Z",
  "date_available": "2013-04-24T08:00:24Z",
  "date_issued": "2013-04-23",
  "degree_discipline": "Biological Systems Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Preventing impairment of waterbodies requires control, reduction and interception of contaminant losses at the field and subwatershed level. Three specific research objectives were accomplished in this study: 1) compare the HSPF-predicted flow, sediment, total nitrogen (TN) and total phosphorus (TP) loads resulting from simulation of spatially distributed site-specific and county-level disaggregated land use data at subwatershed and watershed levels, 2) evaluate the effects of site-specific and county-level disaggregated BMP data on modeled BMP responses in HSPF-predicted flow, sediment, TN and TP loads at the watershed level, and 3) analyze the long-term effects of the two spatial BMP datasets on achieving the Chesapeake Bay Total Maximum Daily Load (TMDL) goals for sediment, TN and TP. Site-specific data are derived from the local watershed inventory while disaggregated data are based on county-level aggregated data that are distributed to portions of river segments that intersect each county. The study site was the Upper Opequon Watershed in northern Virginia. Results for each research objective are as follows: (1) HSPF-predicted flow, sediment, TN and TP were higher using disaggregated land use data in subwatersheds at monthly and annual time-steps. (2) Predicted load reductions were higher with site-specific BMP data than with disaggregated data for the study watershed. (3) Current levels of cost-shared BMP implementation in the Upper Opequon Watershed using either site-specific or county-level disaggregated BMP datasets do not meet the Chesapeake Bay TMDL goals. Increasing BMP implementation level to 100% of the available land also failed to meet TMDL target goals. Generally, use of disaggregated land use data does not accurately represent the existing watershed conditions. Further, for the study watershed, use of disaggregated county-level BMP data poorly represented actual watershed conditions, which resulted in higher pollutant yields and higher levels of BMPs needed to meet water quality goals. The study suggests that site-specific land use and BMP data must be used during TMDL implementation planning to maintain credibility with local stakeholders and improve the accuracy of the developed implementation plans.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-04-24T08:00:24Z (GMT). No. of bitstreams: 1 Alukwe_IA_D_2013.pdf: 2746439 bytes, checksum: fcb75917dd081b0adfb18d5bc72b952d (MD5)   Previous issue date: 2013-04-23",
  "format_medium": "ETD",
  "handle": "19339",
  "identifier_other": "vt_gsexam:506",
  "identifier_uri": "http://hdl.handle.net/10919/19339",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Best Management Practices",
    "BMP Reduction",
    "TMDL",
    "Target Goals",
    "Water Quality"
  ],
  "title": "Evaluating the Effects of Watershed Land Use Distribution and BMP Data on HSPF  Water Quality Predictions",
  "type": "Dissertation"
}