{
  "contributor_author": "Ko, Jaekwon",
  "contributor_committeechair": "Cook, Brian J",
  "contributor_committeemember": [
    "Willis-Walton, Susan M",
    "Hult, Karen M",
    "Roberts, Patrick S"
  ],
  "contributor_department": "School of Public and International Affairs",
  "date_accessioned": "2013-04-23T08:00:17Z",
  "date_available": "2013-04-23T08:00:17Z",
  "date_issued": "2013-04-22",
  "degree_discipline": "Public Administration/Public Affairs",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Over the past several decades, local governments have provided public services through a dynamic process including direct public delivery and market contracts. These public service delivery modes have been influenced by the dominant paradigms in contemporary public administration such as New Public Management (NPM) and Public Value Management (PVM). This study aims to examine factors influential in choosing public service delivery modes in local governments. Influential factors are divided into three main categories. The first category is public values as perceived by public managers. The second category is related to organizational environments. The third category is associated with characteristics of public services. This study focuses on public service delivery in County and City governments in Virginia. In order to test hypotheses, I use two sets of data: a survey and the U.S. Census. First, the survey measures public values, organizational environments, and public service characteristics. The survey population consists of 95 Counties and 39 Independent Cities in Virginia. The total number of County Administrators and City Managers who responded to the survey was 70. Second, the U.S. Census provides demographic information. In analyzing data to address research questions, I use descriptive analysis and a binary logistical regression model. Findings indicate that the more County Administrators and City Managers perceive the importance of efficiency and customer orientation values from New Public Management in determining public service delivery modes, the more local governments choose contracting out. In contrast, the more County Administrators and City Managers perceive the importance of fairness, political accountability, and employee safety values from Public Value Management in determining public service delivery modes, the more local governments choose delivery by public.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-04-23T08:00:17Z (GMT). No. of bitstreams: 2 Ko_J_D_2013.pdf: 1102156 bytes, checksum: 4a0b5daf8f1a415760695b88fb31ee27 (MD5) Ko_J_D_2013_support_1.pdf: 419333 bytes, checksum: 9b70169f2f3cac9eb192686659d1e8a9 (MD5)   Previous issue date: 2013-04-22",
  "format_medium": "ETD",
  "handle": "19330",
  "identifier_other": "vt_gsexam:465",
  "identifier_uri": "http://hdl.handle.net/10919/19330",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "New Public Management",
    "Public Value Management",
    "contract",
    "public values"
  ],
  "title": "Values Public Managers Hold, Organizational Environments, and Public Service Characteristics in Explaining the Choice of Public Service Delivery Modes: Focused on County and City Governments in Virginia",
  "type": "Dissertation"
}