{
  "contributor_author": "Fuhrer, Timothy J",
  "contributor_committeechair": "Dorn, Harry C.",
  "contributor_committeemember": [
    "Tanko, James M",
    "Madsen, Louis A",
    "Crawford, Daniel",
    "Valeyev, Eduard Faritovich"
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2013-04-24T08:00:44Z",
  "date_available": "2013-04-24T08:00:44Z",
  "date_issued": "2013-04-23",
  "degree_discipline": "Chemistry",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The chemistry of fullerenes, which are a class of carbon allotropes that can be prepared by vaporization of graphite in an electric arc in a low pressure atmosphere,1 has become a topic of much experimental and theoretical study over the past 25 years.  Herein we present a series of theoretical studies related to recently discovered or studied endohedral metallofullerenes (EMF) and a theory as to the selective stability of certain isomers of EMFs.<br /><br />Computational treatments of the anions of C80 and C94 are presented and compared in an effort to gain an understanding and predictive model for which isomers of each cage size EMF will be most stable.  A model is proposed in which the pentagons of fullerene anions are seen as charge localization centers that repel one another, making the pyracyclene bonding motif much more unstable for fullerene anions than for fullerene neutral cages.<br /><br />Computational treatments are also presented for two newly discovered EMFs, Y2C2@C92 and Gd2@C79N.  Y2C2@C92 is reported to exhibit a previously undiscovered mode of internal cluster rotation, while Gd2@C79N is shown to have unusual stability for an azofullerene with a large spin quantum number (15/2).  <br /><br />Finally, computational techniques are employed to predict the thermodynamic feasibility of a chemical reaction replacing one metal atom in a trimetallic-nitride template (TNT) endohedral metallofullerene with different metal atom.  At least two of these are predicted to be thermodynamically practical.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-04-24T08:00:44Z (GMT). No. of bitstreams: 1 Fuhrer_TJ_D_2013.pdf: 3002605 bytes, checksum: e35a665f4e7f89e27ef0312b13014001 (MD5)   Previous issue date: 2013-04-23",
  "format_medium": "ETD",
  "handle": "19344",
  "identifier_other": "vt_gsexam:736",
  "identifier_uri": "http://hdl.handle.net/10919/19344",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Fullerenes",
    "Endohedral",
    "Metallofullerenes",
    "Density Functional Theory"
  ],
  "title": "Computational Study of the Properties and Stabilities of Endohedral Metallofullerenes",
  "type": "Dissertation"
}