{
  "contributor_author": "Marcu, Amber Diane",
  "contributor_committeechair": "Cennamo, Katherine S",
  "contributor_committeemember": [
    "Evans, Michael A",
    "Doolittle, Peter E",
    "Moore, David M"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2013-04-24T08:00:28Z",
  "date_available": "2013-04-24T08:00:28Z",
  "date_issued": "2013-04-23",
  "degree_discipline": "Curriculum and Instruction",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "In this research, it was proposed that self-efficacy is the missing underlying psychological factor in innovation diffusion models of higher education. This is based upon research conducted in the fields of innovation-diffusion in higher education, technology adoption, self-efficacy, health and behavioral change. It was theorized that if self-efficacy is related to adoption, it could provide a quick-scoring method for adoption efficiency and effectiveness that would be easy to administer. The innovation-diffusion model used in this study was Hall and Hord\\'s (1987) Concerns Based Adoption Model (CBAM) and it\\'s Seven Stages of Concern (SoC) About an Innovation. The SoC measures a user\\'s perception of\"and concerns about\"an innovation over time.  The self-efficacies under study were general, teaching, and technology.  The scales used in this research instrument were Chen\\'s New General Self-Efficacy (NGSE), Prieto\\'s College Teaching Self-Efficacy Scale (CTSES), and Lichty\\'s Teaching with Technology Self-efficacy scale (MUTEBI), respectively.  This research hoped to uncover a relationship between self-efficacies and a Stage of Concern in the adoption of an instructional technology innovation, Google Apps for Education, at a large university institution.  Over 150 quantitative responses were collected from a pool of 1,713 instructional faculty between late Fall 2012 and early Spring 2013 semesters.  The response group was not representative of the larger population. Forty-six percent represented non-tenure track faculty compared to the expected 19 percent.  Analysis using nominal logistic regression between self-efficacy and Stages of Concern revealed that no statistically significant relationship was found.  Of note is that nearly all participants could be classified as being in the early-stages of an innovation adoption, possibly skewing the overall results.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-04-24T08:00:28Z (GMT). No. of bitstreams: 4 Marcu_AD_D_2013.pdf: 2625067 bytes, checksum: 84484c4e42680802abe56753cd4a650d (MD5) Marcu_AD_D_2013_support_1.pdf: 332120 bytes, checksum: 2b6d3e4b408849187d89f0c9ee12e69d (MD5) Marcu_AD_D_2013_support_3.pdf: 658064 bytes, checksum: 7a25c0286ff8ebf47ec36a58df2e8a3f (MD5) Marcu_AD_D_2013_support_4.pdf: 99943 bytes, checksum: c1103ba937ca5fed4e4e9fec81b43277 (MD5)   Previous issue date: 2013-04-23",
  "format_medium": "ETD",
  "handle": "19340",
  "identifier_other": "vt_gsexam:611",
  "identifier_uri": "http://hdl.handle.net/10919/19340",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "adoption",
    "behavior",
    "diffusion of innovations",
    "self-efficacy",
    "change"
  ],
  "title": "Relationship of Self-Efficacy to the Stages of Concern in the Adoption of an Innovation in Higher Education",
  "type": "Dissertation"
}