{
  "contributor_author": "Davis, Derick Francis",
  "contributor_committeechair": "Herr, Paul Michael",
  "contributor_committeemember": [
    "Nakamoto, Kent",
    "Brinberg, David L",
    "Chakravarti, Dipankar"
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2013-04-28T08:00:24Z",
  "date_available": "2013-04-28T08:00:24Z",
  "date_issued": "2013-04-27",
  "degree_discipline": "Business, Marketing",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "I investigate how reading a homophone (e.g. \"bye\")\"a word that sounds the same as another but has different spelling and meaning\"can prime judgments and behaviors related to the complementary homophone (e.g. \"buy\"). Initial reading processes use word sound, not word spelling, to activate word meaning stored in memory. I theorize homophone priming occurs when consumers encounter and process homophones and a secondary, relatively controlled process fails to suppress meanings associated with the incorrect homophone. Additionally, this effect is more likely to occur when consumers experience cognitive load, which reduces ability to suppress the alternate homophone meanings. In this dissertation I document homophone behavioral and perceptual priming, investigate the process underlying the effects, and contribute to the priming literature in general. More specifically, this dissertation contributes to the understanding of the role of phonology (word sound) in behavioral and perceptual priming in general and in consumer contexts.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-04-28T08:00:24Z (GMT). No. of bitstreams: 1 Davis_DF_D_2013.pdf: 2462962 bytes, checksum: b0d09d2735ae56dd010ffa04b200c964 (MD5)   Previous issue date: 2013-04-27",
  "format_medium": "ETD",
  "handle": "19366",
  "identifier_other": "vt_gsexam:407",
  "identifier_uri": "http://hdl.handle.net/10919/19366",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Marketing",
    "Priming",
    "Phonology",
    "Suppression"
  ],
  "title": "Priming consequences of Homophone Confusion",
  "type": "Dissertation"
}