{
  "contributor_author": "Kim, Kahyun",
  "contributor_committeechair": [
    "Kleiner, Brian M",
    "McNair, Elizabeth D"
  ],
  "contributor_committeemember": [
    "Winchester, Woodrow W",
    "Smith-Jackson, Tonya L"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2013-04-26T08:00:11Z",
  "date_available": "2013-04-26T08:00:11Z",
  "date_issued": "2013-04-25",
  "degree_discipline": "Industrial and Systems Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Communication deficiencies within interdisciplinary teams are known to reduce the effectiveness of those teams by causing erroneous behaviors (Alvarez & Coiera, 2006; Reader, Flin, & Cuthbertson, 2007). Also, many design defects have been attributed to communication breakdowns across disciplines (Chen & Lin, 2004). As the number of interdisciplinary teams in industry grows in order to adapt to dynamic business environments of the twenty-first century, providing an appropriate environment to improve interdisciplinary team effectiveness is critical for many organizations. In spite of its importance, little is known about what kind of environments support interdisciplinary team interactions.<br />There were three objectives of this dissertation: 1) to investigate the influence of physical environment on the effectiveness of interdisciplinary engineering design teams, 2) to investigate the influence of interaction strategy design support on the effectiveness of interdisciplinary engineering design teams, 3) to construct behavioral indicators of successful interdisciplinary teamwork to design testing and design guidelines for interdisciplinary team collaboration spaces.<br />To achieve these goals, the study was conducted in two phases. In Phase 1, the researcher conducted a direct observation of industry teams operating in the novel design space, the Kiva, at a design-consulting firm based in Pittsburgh, PA. The observation data provided 1) a list of significant participant behaviors to be examined and 2) interaction strategy design support (ISDS) procedures to be used during phase 2. Phase 2 was a laboratory-based 2x2 experimental study with physical room condition (Kiva vs. conference room) and interaction strategy design support (present vs. absent) as independent variables. The dependent variables were categorized as team process and output that measured team effectiveness. Overall, a significant interaction effect between the physical conditions and interaction strategy design support was found from all dependent measurements except for product evaluation. A significant main effect of physical conditions and interaction strategy support were found to a lesser extent. Based on the findings, testing methodology guidelines and design guidelines were developed.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-04-26T08:00:11Z (GMT). No. of bitstreams: 2 Kim_K_D_2013.pdf: 13361855 bytes, checksum: c75eae0730c7199aaff582e4b3b138ea (MD5) Kim_K_D_2013_support_1.pdf: 202033 bytes, checksum: e9adbbfae6a993fc2cc86a14ef0796d1 (MD5)   Previous issue date: 2013-04-25",
  "format_medium": "ETD",
  "handle": "19361",
  "identifier_other": "vt_gsexam:679",
  "identifier_uri": "http://hdl.handle.net/10919/19361",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "interdisciplinary team",
    "team effectiveness",
    "collaborative space"
  ],
  "title": "Developing Guidelines for Collaborative Spaces Supporting Interdisciplinary Engineering Design Teams",
  "type": "Dissertation"
}