{
  "contributor_author": "Lucas, Joanne Harris",
  "contributor_committeechair": [
    "Twiford, Travis W",
    "Tripp, Norman Wayne"
  ],
  "contributor_committeemember": [
    "Cash, Carol S",
    "Hoyle, Violet Johnson"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-04-28T08:00:29Z",
  "date_available": "2013-04-28T08:00:29Z",
  "date_issued": "2013-04-27",
  "degree_discipline": "Educational Leadership and Policy Studies",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The primary purpose of this study was to investigate the history of Princess Anne County Training School and Union Kempsville High School in Princess Anne County/Virginia Beach, Virginia. The method of inquiry was qualitative, historical research that relied on oral histories to provide a cultural understanding of the school from the perspectives of its students, administrators, teachers, and staff. The school\\'s history was reconstructed through direct engagement with individuals whose interviews recounted the establishment, growth, operation, and demise of Princess Anne County Training School/Union Kempsville High School. In order to minimize the nostalgic influence and bring greater validity to the oral histories, data were also collected from historical accounts, school board and community organization minutes, local periodicals, and school artifacts.   <br />Segregation cultivated legally separate-but-equal schools for Blacks and Whites, with little or no attention given to actual equality. In 1925, the Black community in Princess Anne County, Virginia, mobilized to build a high school for their children who were denied an education beyond seventh grade. Princess Anne County Training School opened for Black students in 1938 and initially utilized a curriculum based on industrial education. It was the first and only Black high school in Princess Anne County/Virginia Beach, Virginia. As Princess Anne County Training School progressed, the Black community eventually repudiated the term, training school. The school\\'s name was changed to Union Kempsville High School in the fall of 1961. Gradual desegregation inaugurated by the Brown v. Board of Education decisions led to a decline in student enrollment, and Union Kempsville High School closed in 1969.  <br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-04-28T08:00:29Z (GMT). No. of bitstreams: 2 Lucas_JH_D_2013.pdf: 9596898 bytes, checksum: b52e3917322cba21e90e9e854f0652e4 (MD5) Lucas_JH_D_2013_support_3.pdf: 421000 bytes, checksum: 6c5d9cb0de28f26703fe097919bcaa76 (MD5)   Previous issue date: 2013-04-27",
  "format_medium": "ETD",
  "handle": "19367",
  "identifier_other": "vt_gsexam:367",
  "identifier_uri": "http://hdl.handle.net/10919/19367",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Black",
    "County Training School",
    "Desegregation",
    "Industrial Education",
    "Massive Resistance",
    "Segregation",
    "Separate-But-Equal"
  ],
  "title": "The History of Princess Anne County Training School and Union Kempsville High School Princess Anne County/Virginia Beach, Virginia 1925-1969",
  "type": "Dissertation"
}