{
  "contributor_author": "Nassry, Michael Quinn",
  "contributor_committeechair": "Scott, Durelle T",
  "contributor_committeemember": [
    "Hession, William Cully",
    "Wolfe, Mary Leigh",
    "McGuire, Kevin J",
    "Hood, Eran W."
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2013-05-05T08:00:09Z",
  "date_available": "2013-05-05T08:00:09Z",
  "date_issued": "2013-05-04",
  "degree_discipline": "Biological Systems Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The unique landscape controls and meltwater contributions associated with glacial landcover along the coast of southeast Alaska were examined to better understand in-stream processing of dissolved organic matter (DOM) and nutrients during downstream transport. Specifically, this study paired glacial streams with nearby non-glacial streams and compared differences in landscape controls to: 1) evaluate the impact of glacial landcover and meltwater contributions on in-stream metabolism and uptake potential of proglacial streams; 2) quantify changes in DOM composition and concentration in glacial runoff during precipitation-driven flushing of a glaciated landscape; and 3) characterize the impact of glacial landcover and meltwater contributions on longitudinal trends in the physical and chemical signature of streamwater through changing watershed landscapes.<br />    Stream metabolism estimates suggested glacial streams receive little DOM from landscape sources and have the potential to function as net autotrophic systems under low flow regimes with unobstructed sunlight. Unlike most watersheds, shallow organic soils and low in-stream respiration rates associated with glacial systems resulted in near equilibrium dissolved CO2 concentrations, with little flux to the atmosphere. Longitudinal stream analyses concluded low-elevation landscape discharge contributions had little influence on glacial streams compared to non-glacial streams. High specific discharge from glacial landscapes controlled streamwater chemistry throughout proglacial watersheds suggesting meltwater was delivered from the terminus of coastal glaciers downstream to the Gulf of Alaska (GOA) with little dilution or in-stream processing. Uniform concentrations of DOM and nutrients were found during increased discharge driven by precipitation on the glaciated watershed. This was in contrast to the non-glacial watershed, where streamwater DOM concentrations were largely controlled by connections to DOM-rich landscape sources during storm flows. Results from this study enhance the understanding of in-stream processes and landscape controls in watersheds that deliver freshwater to an ecologically productive marine zone and valuable commercial fishery. Furthermore, this study provides information about watersheds undergoing glacial recession to GOA basin-wide estimates of DOM export and future research initiatives focusing on in-stream DOM processing.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-05T08:00:09Z (GMT). No. of bitstreams: 1 Nassry_MQ_D_2013.pdf: 4964227 bytes, checksum: 192beae69b16340843480a2b7beee790 (MD5)   Previous issue date: 2013-05-04",
  "format_medium": "ETD",
  "handle": "20379",
  "identifier_other": "vt_gsexam:652",
  "identifier_uri": "http://hdl.handle.net/10919/20379",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Dissolved Organic Matter",
    "In-Stream Metabolism",
    "Landscape Control",
    "Glacier Meltwater",
    "Climate Change"
  ],
  "title": "In-Stream Reactivity of Dissolved Organic Matter and Nutrients in Proglacial Watersheds",
  "type": "Dissertation"
}