{
  "contributor_author": "Cutler, Stephanie Leigh",
  "contributor_committeechair": "Borrego, Maura Jenkins",
  "contributor_committeemember": [
    "McNair, Elizabeth D",
    "Adams, Stephanie G",
    "Kleiner, Brian M"
  ],
  "contributor_department": "Engineering Education",
  "date_accessioned": "2013-05-04T08:00:28Z",
  "date_available": "2013-05-04T08:00:28Z",
  "date_issued": "2013-05-03",
  "degree_discipline": "Engineering Education",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The purpose of this dissertation is to investigate how educational research, specifically Research-Based Instructional Strategies (RBIS), is adopted by education practice, specifically within the engineering Statics classroom. Using a systematic approach, changes in classroom teaching practices were investigated from the instructors\\' perspective. Both researchers and practitioners are included in the process, combining efforts to improve student learning, which is a critical goal for engineering education. The study is divided into 3 stages and each is discussed in an individual manuscript. Manuscript 1 provides an assessment of current teaching practices; Manuscript 2 explores RBIS use by Statics instructors and perceived barriers of adoption; and Manuscript 3 evaluates adoption using Fidelity of Implementation. <br /><br />A common set of concurrent mixed methods was used for each stage of this study. A quantitative national survey of Statics instructors (n =166) and 18 qualitative interviews were conducted to examine activities used in the Statics classroom and familiarity with nine RBIS. <br /><br />The results of this study show that lecturing is the most common activity throughout Statics classrooms, but is not the only activity. Other common activities included working examples and students working on problems individually and in groups. As discussed by the interview participants, each of Rogers\\' characteristics influenced adoption for different reasons. For example, Complexity (level of difficulty with implementation of an RBIS) was most commonly identified as a barrier. His study also evaluated the Fidelity of Implementation for each RBIS and found it to be higher for RBIS that were less complex (in terms of the number of critical components). Many of the critical components (i.e. activities required for implementation, as described in the literature) were found to statistically distinguish RBIS users and non-users. <br /><br />This dissertation offers four contributions: (1) an understanding of current ractices in Statics; (2) the instructor perspective of the barriers to using RBIS in the classroom; (3) the use of Fidelity of Implementation as a unique evaluation of RBIS adoption, which can be used by future engineering education researchers; and (4) a systematic approach of exploring change in the classroom, which offers new perspectives and approaches to accelerate the adoption process.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-04T08:00:28Z (GMT). No. of bitstreams: 1 Cutler_SL_D_2013.pdf: 3124271 bytes, checksum: 1e5255da7f14be3ce8d9ca2632f7e850 (MD5)   Previous issue date: 2013-05-03",
  "format_medium": "ETD",
  "handle": "20376",
  "identifier_other": "vt_gsexam:525",
  "identifier_uri": "http://hdl.handle.net/10919/20376",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Research-Based Instructional Strategies",
    "Diffusion of Innovation",
    "Fidelity of Implementation",
    "Statics"
  ],
  "title": "How Static is the Statics Classroom? An investigation into how innovations, specifically Research-Based Instructional Strategies, are adopted into the Statics classroom",
  "type": "Dissertation"
}