{
  "contributor_author": "Scanlon, Molly Jane",
  "contributor_committeechair": "George, Diana L",
  "contributor_committeemember": [
    "Vollmer, James M",
    "Powell, Katrina M",
    "Pender, Kelly Elizabeth"
  ],
  "contributor_department": "English",
  "date_accessioned": "2013-05-02T08:00:23Z",
  "date_available": "2013-05-02T08:00:23Z",
  "date_issued": "2013-05-01",
  "degree_discipline": "Rhetoric and Writing",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The field of writing studies has long inquired about how writers engage in individualized writing processes. As an extension of this inquiry, contemporary scholarship in writing studies began to study collaborative writing through the understanding of writing as a social act. Our understanding of writing processes and collaborative writing has expanded through studies of writing as it occurs in the academy, the workplace, and extracurricular settings. Still, to a large extent, inquiries about writing processes and collaborative writing activity centered on alphabetic texts and focused on writers. Rarely do studies engage\"in addition to writers\"artists and designers as authors in the collaborative writing process. Composing, as understood by scholars and teachers of writing, is changing due to technological shifts in media and yet, as a field, we have failed to question multimodal composing as an individual or collaborative process.<br />    To extend previous writing studies scholarship, this dissertation engages qualitative case study methodology to explore three unique multimodal collaborations of comics authors. As a visual rhetoric scholar with a personal focus on teaching students about composing in all media, I am drawn to asking questions about how arguments are composed using multimodal means. My personal and scholarly interest in comics led to inquiries about how comics are composed and initial research found that comics are often composed in collaboration, with writers and artists who with them carry multiple and varying literacies (alphabetic text, visual, spatial, etc.). Comics provide a rich subject of study to address this inquiry because of their inherently multimodal nature as a medium that incorporates both word and picture in diverse combinations and for a variety of rhetorical purposes. For this study, I have chosen to focus on comics texts that differ in terms of subject matter, genre, and collaborative makeup in order to examine multimodal collaborations and create distinct cases. Through three cases of multimodal collaboration\"Understanding Rhetoric, the Cheo comics, and Brotherman: Dictator of Discipline\"this study argues for a further complication of our field\\'s understanding of writing processes and collaborative composing.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-02T08:00:23Z (GMT). No. of bitstreams: 2 Scanlon_MJ_D_2013.pdf: 15764381 bytes, checksum: c6b27e812d1f2f09cdc8c35b866e01fc (MD5) Scanlon_MJ_D_2013_support_1.pdf: 3225272 bytes, checksum: 47ae363fdb70161837afffae470020fe (MD5)   Previous issue date: 2013-05-01",
  "format_medium": "ETD",
  "handle": "20370",
  "identifier_other": "vt_gsexam:396",
  "identifier_uri": "http://hdl.handle.net/10919/20370",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "rhetoric",
    "collaborative writing",
    "writing process",
    "multimodal",
    "comics"
  ],
  "title": "Multimodal Composition and the Rhetoric of Comics: A Study of Comics Teams in Collaboration",
  "type": "Dissertation"
}