{
  "contributor_author": "Saunders, Lance Walter",
  "contributor_committeechair": "Kleiner, Brian M",
  "contributor_committeemember": [
    "Wernz, Christian",
    "Ellis, Kimberly P",
    "Smith-Jackson, Tonya L",
    "McCoy, Andrew Patton"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2013-05-04T08:00:35Z",
  "date_available": "2013-05-04T08:00:35Z",
  "date_issued": "2013-05-03",
  "degree_discipline": "Industrial and Systems Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Construction worker safety is normally a construction activity in the United States, even though there is an emerging body of literature discussing the positive effects of considering safety earlier in the construction lifecycle.  This literature has discussed the fragmentation in terms of safety attitudes between owners and designers and those carrying out the construction of a project.  Quantitatively identifying the specific areas that the differences exist in terms of safety attitudes between common roles on a construction project could be a step toward reducing the fragmentation that currently exists in the work system and promoting safety to be more of a consideration earlier in the project lifecycle.  One common technique for measuring safety attitudes is the use of safety climate survey instruments, but in the construction industry these have historically focused on just construction personnel.  This research will discuss the development of a survey instrument to measure differences in safety attitudes between typical members of the entire construction project work system in order to identify specific areas that gaps exist.  Phase I of the research include the development of an instrument using Mohammed\\'s (2002) survey as a base, validation of the measurement model using Confirmatory Factor Analysis, and using applied nonparametric statistics to analyze the data and identify significant differences.  These results will be used in Phase II to develop a training tool to educate relevant project personnel on differences that were identified in Phase I, and to determine the best mediums for conveying this type of information.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-04T08:00:35Z (GMT). No. of bitstreams: 1 Saunders_LW_D_2013.pdf: 4437060 bytes, checksum: dcda45bfddfec50c54de8f13fb0424af (MD5)   Previous issue date: 2013-05-03",
  "format_medium": "ETD",
  "handle": "20378",
  "identifier_other": "vt_gsexam:635",
  "identifier_uri": "http://hdl.handle.net/10919/20378",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "construction safety",
    "occupational safety and health",
    "systems safety",
    "socio-technical systems",
    "macroergonomics"
  ],
  "title": "Measuring Safety Attitude Differences in the Construction Supply Chain",
  "type": "Dissertation"
}