{
  "contributor_author": "Hameed, Faisal",
  "contributor_committeechair": [
    "Hancock, Kathleen",
    "Grizzard, Thomas J"
  ],
  "contributor_committeemember": [
    "Roper, William E.",
    "Godrej, Adil N"
  ],
  "contributor_department": "Civil and Environmental Engineering",
  "date_accessioned": "2013-05-05T08:00:21Z",
  "date_available": "2013-05-05T08:00:21Z",
  "date_issued": "2013-05-04",
  "degree_discipline": "Civil Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Ensuring sustainability is important for balancing economic viability, the environment and the social system. Because transportation infrastructure projects have direct and indirect impacts associated with this balance, it is important for transportation agencies to consider sustainability and environmental impacts in transportation investment decision making.  These decisions typically occur during the planning and programming phase. <br /><br />Life Cycle Assessment (LCA) is an accepted method for quantifying life cycle environmental impacts. Within the transportation sector, current LCA practices are primarily limited to roadway pavements and the determination of greenhouse gas (GHG) emissions or a carbon footprint.  An urban roadway facility consists of several additional elements including sidewalks, street lights, traffic signals, lane striping and drainage which also have environmental impacts. In addition to the carbon footprint, roadway life cycle impacts include waste materials and storm water runoff. These life cycle impacts have associated costs.<br /><br />Life Cycle Cost Analysis (LCCA) is a commonly used methodology which analyzes life cycle costs of projects. However, this methodology does not include costs associated with environmental impacts. When integrated with LCA, the quantification of life cycle environmental impacts and costs for an urban roadway that includes construction, resurfacing and reconstruction as well as impacts related with managing the facility provides important information for making decisions that support sustainability related to transportation infrastructure. <br /><br />By establishing a reasonable life cycle time frame, representative elements, mostly homogeneous transportation facility types with representative cross sections, and accepted construction, maintenance and rehabilitation practices, a life cycle analysis approach which integrates LCA and LCCA is developed called Integrated Life Cycle Analysis Approach (ILCA2). Because decisions are made during the planning and programming stage, the approach is designed to use a standard cross section with standard materials for a transportation facility -- an urban roadway -- and three readily available project-specific inputs: length of roadway, number of travel lanes, and number of bicycle lanes.  The methodology quantifies life cycle environmental impacts for carbon footprint of the materials in CO2 eq, quantity of wasted materials, quantity of storm water runoff and then estimates the costs associated with these impacts. <br /><br />This research demonstrated the use of ILCA2 for a case study section of an urban roadway and for a sample transportation State Transportation Improvement Program (STIP).  Using this approach to evaluate transportation projects provides several opportunities to enhance information used for decision making.  Life cycle environmental impact costs can represent a quarter of the total integrated life cycle costs of a transportation program. The case studies showed that the initial costs represent approximately half of life cycle costs for a single project and nearly a twentieth for the sample STIP. Environmental impact costs were higher than direct operation costs, energy costs, and resurfacing costs of an urban roadway.  Approximately 90% of material used in construction and rehabilitation of a roadway are removed in the rehabilitation and disposed of in landfills. This shows the potential for recovering, reclaiming, reusing and recycling these materials, potentially resulting in reduced life cycle environmental impacts.  Storm water runoff over the life cycle from the roadway was also substantial and the associated cost represents a significant portion of life cycle costs. When used over the life cycle of a transportation program, Low Impact Development (LID) strategies for roadways can result in economic benefits with higher cost savings than traditional drainage practices. <br /><br />When ILCA2 is applied to an individual project, decision makers have a better understanding of the expected costs and impacts associated with that project.  Applying ILCA2 to a program enables decision makers to evaluate the larger impacts of the transportation investments as well as consideration of programmatic changes to practices that support sustainability.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-05T08:00:21Z (GMT). No. of bitstreams: 2 Hameed_F_D_2013.pdf: 2919228 bytes, checksum: 4233236edd0e1523ba1bf106b7772c34 (MD5) Hameed_F_D_2013_support_1.pdf: 366925 bytes, checksum: 636b03f7775aa120f484e82584435a28 (MD5)   Previous issue date: 2013-05-04",
  "format_medium": "ETD",
  "handle": "20382",
  "identifier_other": "vt_gsexam:712",
  "identifier_uri": "http://hdl.handle.net/10919/20382",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Sustainability",
    "environment",
    "transportation",
    "infrastructure",
    "programming",
    "ILCA2",
    "Integrated Life Cycle Analysis Approach"
  ],
  "title": "Integrated Life Cycle Analysis Approach (ILCA2) for Transportation Project and Program Development",
  "type": "Dissertation"
}