{
  "contributor_author": "Daniello, Allison Louise",
  "contributor_committeechair": "Gabler, Hampton C.",
  "contributor_committeemember": [
    "McLaughlin, Shane B",
    "Stitzel, Joel D.",
    "Duma, Stefan M.",
    "Madigan, Michael L"
  ],
  "contributor_department": "Biomedical Engineering",
  "date_accessioned": "2013-05-05T08:00:16Z",
  "date_available": "2013-05-05T08:00:16Z",
  "date_issued": "2013-05-04",
  "degree_discipline": "Biomedical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "More motorcyclists are fatally injured each year in guardrail crashes than passengers of any other vehicle, while only accounting for three percent of the vehicle fleet. Since motorcyclists account for a high percentage of these fatalities, the goal of zero deaths on the road cannot be achieved without addressing the safety of motorcyclists. The objective of this research was to determine the factors that lead to serious or fatal injury in motorcycle barrier crashes, given that a crash occurred. <br /><br />The likelihood of serious or fatal injury in barrier crashes was significantly influenced by both barrier type and rider trajectory after striking the barrier. A national study of motorcyclist fatality risk using the Fatality Analysis Reporting System (FARS) and General Estimates System (GES) showed that crashes with guardrail than crashes were about 7 times more likely to be fatal than those with the ground, based on the most harmful event reported. An analysis of 1,000 riders in barrier crashes in three states showed that the odds of serious injury were 1.4 times greater in guardrail crashes than in concrete barrier crashes. These analyses did not take into account the trajectory of the rider after striking the barrier, since this was unknown. The police accident report for 350 barrier crashes in New Jersey was used to determine the rider trajectory in those crashes. Being ejected from the motorcycle after impacting the barrier significantly increased the odds of serious injury over crashes where the rider was not ejected.<br /><br />While providing insight into factors influencing injury severity, these analyses do not provide an understanding of the nature of injuries incurred in these crashes. To further understand how injuries were caused in motorcycle-barrier crashes, we developed a methodology for determining injury mechanisms in motorcycle-barrier collisions. Using this methodology, we investigated 9 serious motorcycle-to-barrier crashes. In these crashes, as well as in an analysis of 106 barrier crashes in Maryland, the thorax and lower extremities most commonly suffered serious injury. Of particular concern are the posts and top of the rail, both of which can lead to lacerations and blunt trauma.  <br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-05T08:00:16Z (GMT). No. of bitstreams: 1 Daniello_AL_D_2013.pdf: 3378011 bytes, checksum: 1363f0f15c155ecdd15ea3f412bcc0e4 (MD5)   Previous issue date: 2013-05-04",
  "format_medium": "ETD",
  "handle": "20381",
  "identifier_other": "vt_gsexam:587",
  "identifier_uri": "http://hdl.handle.net/10919/20381",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Motorcycle Safety",
    "Roadside Barrier",
    "Roadside Object",
    "Injury Risk"
  ],
  "title": "Injury Mechanisms in Roadside Motorcycle Collisions",
  "type": "Dissertation"
}