{
  "contributor_author": "Schurr, Kelly Laural",
  "contributor_committeechair": "Wells, John Gaulden",
  "contributor_committeemember": [
    "Doolittle, Peter E",
    "Parkes, Kelly A",
    "Williams, Thomas O"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2013-05-07T08:00:18Z",
  "date_available": "2013-05-07T08:00:18Z",
  "date_issued": "2013-05-06",
  "degree_discipline": "Curriculum and Instruction",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "With increasing challenges from international competition and domestic demands for a technologically literate workforce, pressure is growing on the educational system to produce students that are literate in science, technology, engineering, and mathematics (STEM). Integrative STEM education utilizes design-based pedagogical approaches to teach science/math content and practices concurrently with technology/engineering content and practices (Wells & Ernst, 2012, para. 2). The discipline of technology education has traditionally implemented design-based pedagogical approaches. However, the discipline has not demonstrated through empirical research that its existence and pedagogies are beneficial to student learning and cognition (Lewis, 1999, 2006; Petrina, 1998; Wells, 2008, 2010; Zuga, 1994, 1997, 2001).<br />The purpose of this study was to demonstrate that the technological design-based approach to teaching biotechnology literacy supports students\\' connections of science and technology concepts. Grounded in Ausubel\\'s (1968) theory on meaningful learning and Novak\\'s (1980) advanced organizer of concept mapping, this study examined evidence of high school students\\' cognitive structural change throughout the technological design-based approach to instruction. At three key intervals throughout the technological design process, students developed concept maps to document their understanding of the biology and technology concepts presented within the instructional materials. Data for this study included the students\\' constructed concept maps. To analyze the concept maps, the researcher used Hay et al.\\'s (2008) three-method analysis for measuring the quality of students\\' learning, and a qualitative analysis.<br />Data analysis across all four methods indicated that all participants experienced a varying degree of growth in biology, technology, and integrative concepts and connections. Collectively this study supports the notion that the technological design-based approach to instruction does indeed (1) encourage meaningful learning, and (2) increase students\\' use of higher order thinking indicated by their abilities to demonstrate their use of schematic and strategic knowledge within their concept maps. The results of this study have direct implications within the areas of Technology Education, Science Education, classroom practice, and concept mapping. The discussion and implications suggest the need to expand the research conducted within this study, and to improve the methods for concept mapping analysis.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-07T08:00:18Z (GMT). No. of bitstreams: 1 Schurr_KL_D_2013.pdf: 4154425 bytes, checksum: c141f0d0b05913432cbae01ba732468d (MD5)   Previous issue date: 2013-05-06",
  "format_medium": "ETD",
  "handle": "22014",
  "identifier_other": "vt_gsexam:714",
  "identifier_uri": "http://hdl.handle.net/10919/22014",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "concept map",
    "meaningful learning",
    "technological design",
    "cognitive structure",
    "assessment"
  ],
  "title": "Cognitive Structural Change and the Technological Design Process",
  "type": "Dissertation"
}