{
  "contributor_author": "Lampi, Evans",
  "contributor_committeechair": "Price, William T",
  "contributor_committeemember": [
    "Lockee, Barbara B",
    "Burton, John Knox",
    "Cartwright, Daisy Louise"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2013-05-07T08:00:14Z",
  "date_available": "2013-05-07T08:00:14Z",
  "date_issued": "2013-05-06",
  "degree_discipline": "Career and Technical Education",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The effectiveness of using virtual labs to train students in computer networking skills, when real equipment is limited or unavailable, is uncertain. The purpose of this study was to determine the effectiveness of using virtual labs to train students in the acquisition of computer network configuration and troubleshooting skills. The study was conducted in the developing country of Zambia, where there is an acute shortage of network lab equipment. Effectiveness was determined by the transfer of skills learned in a virtual lab to a real lab. A two stage true experimental design, that compared the proficiency of randomly assigned experimental (virtual-lab) and control (no-virtual-lab) groups, was used to determine effectiveness (N = 56). In the first stage, the virtual-lab group practiced in a virtual lab while the no-virtual-lab group did not. Both groups were subjected to a lab test where the speed and accuracy of network configuration and troubleshooting of real equipment was measured, prior and after treatment. In the second stage, both groups practiced using real equipment and the speed and accuracy was again measured. An independent t-test was used to determine if there was a significant difference in the final performance between the two groups. It was found that there were significant differences between the groups in the configuration time (p = 0.011) and troubleshooting time (p = 0.03), favoring the virtual-lab group. On the other hand, there were no significant difference in configuration accuracy (p = 0.06) and troubleshooting accuracy (p = 0.440) between the two groups. In addition, there was positive transfer of training from the virtual lab to the real lab for configuration accuracy, configuration speed, troubleshooting accuracy and troubleshooting speed. There was also evidence that students showed performance gains both in using virtual and real labs by comparing their pre-test and post-test results. From the results, there is evidence that the use of virtual labs contributes positively to the transfer of practical computer networking skills from the virtual to the real lab environment. Hence, virtual labs were found to be effective in the teaching of computer networking skills relating to configuration and troubleshooting.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-07T08:00:14Z (GMT). No. of bitstreams: 2 Lampi_E_D_2013.pdf: 1761711 bytes, checksum: 5ff7bb29c9c7a1f0efbeffa32fe6cb9d (MD5) Lampi_E_D_2013_support_1.pdf: 117760 bytes, checksum: 4fe183e2f5fd70b7ec4d9e7e93f852fb (MD5)   Previous issue date: 2013-05-06",
  "format_medium": "ETD",
  "handle": "22013",
  "identifier_other": "vt_gsexam:419",
  "identifier_uri": "http://hdl.handle.net/10919/22013",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Virtual",
    "Labs",
    "Training",
    "Simulations",
    "Computer Networks",
    "Skills training",
    "Transfer of learning",
    "Configuration",
    "Troubleshooting"
  ],
  "title": "The Effectiveness of Using Virtual Laboratories to Teach Computer Networking Skills  in Zambia",
  "type": "Dissertation"
}