{
  "contributor_author": "Lubin, Melissa Maybury",
  "contributor_committeechair": [
    "Renard, Paul D",
    "Boucouvalas, Marcie"
  ],
  "contributor_committeemember": [
    "Henschke, John A",
    "Lambur, Michael T"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2013-05-07T08:00:29Z",
  "date_available": "2013-05-07T08:00:29Z",
  "date_issued": "2013-05-06",
  "degree_discipline": "Human Development",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Coaching is an actionable way for adults to learn. For purposes of this study, learning was conceptualized  by UNESCO\\'s five pillars of learning to know, do, live together, be, and learning to transform oneself and society. The practice of coaching was defined as a social enterprise where, through a process of inquiry and reflection, coaches help coachees achieve their personal and professional goals through learning, self-awareness and behavior change. <br />As an application of learning for adults, coaching may be considered a reflection of andragogy \"the art and science of helping adults learn\" a la Knowles. The following questions guided the inquiry: <br />1.    To what extent is there a relationship between andragogy in practice and coaching in practice as demonstrated by coaches?<br />2.    Specifically, which principles and processes of andragogy are reflected in the practice of coaching? <br />3.    What are the best practices of coaches who use andragogy in their practice? <br /><br />Using a mixed method, sequential explanatory strategy, business and life coaches were surveyed, with follow-up interviews to high scorers, to see which principles and processes of andragogy informed their coaching practices. An instrument, originally developed by Henschke (1989) for teachers, was modified for use with coaches, and measured the extent to which coaches used the philosophy of andragogy in their practices. Knowles\\' six principles and eight processes of andragogy formed the operational framework. Findings indicated that 98% of the coaches reported using andragogy on an average or above basis, with 48% of the group at above average or high above average levels. Andragogical elements of empathy, trust and accommodating coachee uniqueness were revealed at above average or high above average levels. Of those interviewed, 100% of the coaches reported using the principles and processes of andragogy in their practices. Based on their stories, best practices (88) for engaging andragogy in the practice of coaching were developed. The overarching themes from the study were: Andragogy is a way of being in coaching; the processes of andragogy go beyond the context of coaching; and an emergence of a conceptual framework that embraced the pillars of learning, andragogy and the practice of coaching.  <br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-07T08:00:29Z (GMT). No. of bitstreams: 2 Lubin_MM_D_2013.pdf: 2040385 bytes, checksum: c283e84d8b982846a7ed5f24b0852e55 (MD5) Lubin_MM_D_2013_support_1.pdf: 101517 bytes, checksum: 39bd3131af179adbca4750bf5601417c (MD5)   Previous issue date: 2013-05-06",
  "format_medium": "ETD",
  "handle": "22017",
  "identifier_other": "vt_gsexam:710",
  "identifier_uri": "http://hdl.handle.net/10919/22017",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "21st century learning",
    "adult learning",
    "adult development",
    "andragogy",
    "applied learning",
    "best practices",
    "business coach",
    "coach dev"
  ],
  "title": "Coaching the Adult Learner: A Framework for Engaging the Principles and Processes of Andragogy for Best Practices in Coaching",
  "type": "Dissertation"
}