{
  "contributor_author": "Carrico, Cheryl Ann",
  "contributor_committeechair": "Matusovich, Holly",
  "contributor_committeemember": [
    "Watson, Charles Edward",
    "Paretti, Marie C",
    "McNair, Elizabeth D"
  ],
  "contributor_department": "Engineering Education",
  "date_accessioned": "2013-05-09T08:00:19Z",
  "date_available": "2013-05-09T08:00:19Z",
  "date_issued": "2013-05-08",
  "degree_discipline": "Engineering Education",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Though some research exists related to career choices among Appalachian youth, and literature exists which broadly examines choices to pursue engineering degrees, information specifically related to Appalachian students\\' career choice toward engineering is limited. Engineering typically represents high paying, stable jobs so it is particularly important to understand what attracts students to, or deters them from, engineering careers in the Appalachian region, which is beset by poverty and low representation in higher education. The purpose of this research was to explore what influences students from the Central Appalachian region of Virginia in choosing their career goals, in particular, relative to engineering careers. Therefore, the overarching research question was: How are Central Appalachian high school students influenced as they choose their career goals, especially with respect to engineering? <br />In this qualitative study, I used semi-structured interviews and case study methods, guided by Lent and Brown\\'s Social Cognitive Career Theory, to explore career choice goals of high school participants in Southwest Virginia. The twenty-four high school participants and twelve college engineering student participants represented a diverse sample with respect to school and county demographics. Through thematic coding, the data revealed patterns relative to 1) reasons students chose their career goals, and 2) variation in factors contributing to career goals. Specifically, I identified six high school categories of reasons and only three reasons for college engineering students. High school students\\' career choice reasons, while related to interests, were largely influenced by critical life events. Additionally, patterns emerged based on whether or not the student was a continuing generation Appalachian (CGA), parent/guardian educational attainment and place of employment, and the location of the high school relative to college resources. This is consistent with previous literature, which points to the importance of parental education and student interests as factors for determining a student\\'s career choice, and STEM literature, which often links interests in math, science, or engineering activities as key influencers. However, this research also revealed that critical life events, a student\\'s family background (First Generation College and CGA), and parental job location are patterned with career goals.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-09T08:00:19Z (GMT). No. of bitstreams: 2 Carrico_CA_D_2013.pdf: 1874395 bytes, checksum: 93ca9ebdf94442b44528ca2bdc5689be (MD5) Carrico_CA_D_2013_support_1.pdf: 118005 bytes, checksum: 88f12f39a93b04aa10e3c0d1fac64c10 (MD5)   Previous issue date: 2013-05-08",
  "format_medium": "ETD",
  "handle": "22028",
  "identifier_other": "vt_gsexam:657",
  "identifier_uri": "http://hdl.handle.net/10919/22028",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Engineering",
    "Appalachia",
    "Career Choices",
    "High School"
  ],
  "title": "Voices in the Mountains: A Qualitative Study Exploring Factors Influencing Appalachian High School Students\\' Engineering Career Goals",
  "type": "Dissertation"
}