{
  "contributor_author": "Haupt, Robert A",
  "contributor_committeechair": "Renneckar, Scott Harold",
  "contributor_committeemember": [
    "Marand, Herve",
    "Turner, Sam Richard",
    "Edgar, Kevin J"
  ],
  "contributor_department": "Learning Sciences and Technologies",
  "date_accessioned": "2013-05-08T08:00:13Z",
  "date_available": "2013-05-08T08:00:13Z",
  "date_issued": "2013-05-07",
  "degree_discipline": "Macromolecular Science and Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This work reports the elucidation of the structure of a copolymer generated by the cross- catalyzed reactions of PF and pMDI prepolymers.  The electronic behavior of phenolic monomers as perturbed by alkali metal hydroxides in an aqueous environment was studied with 1H and 13C NMR.  Changes in electronic structure and thus reactivity were related to solvated ionic radius, solvent dielectric constant, and their effect on ion generated electric field strength. NMR chemical shifts were used to predict order of reactivity for phenolic model compounds with phenyl isocyanate with good success.  As predicted, 2-HMP hydroxymethyl groups were more reactive than 4-HMP in forming urethane bonds under neutral conditions and 2-HMP hydroxymethyl groups were more reactive than 4-HMP in forming urethane bonds under alkaline conditions.<br />The structure of the reaction products of phenol, benzyl alcohol, 2-HMP, and 4-HMP with phenyl isocyanate were studied using 1H and 13C NMR under neutral organic and aqueous alkaline conditions.  Reactions in THF-d8 under neutral conditions, without catalyst, were relatively slow, resulting in residual monomer and the precipitation of 1,3-diphenyl urea from the carbamic acid reaction.  The reactions of phenol, 2-HMP, and 4-HMP in the presence of TEA catalyst favored the formation of phenyl urethanes (PU). Reactions with benzyl alcohol, 2-HMP, and 4-HMP in the presence of DBTL catalyst favored the formation of benzyl urethanes (BU).  Reactions of 2-HMP and 4-HMP led to formation of benzylphenyldiurethane (BPDU).  DBTL catalysts favored formation of BDPU strictly by a benzyl urethane pathway, while TEA favored its formation mostly via phenyl urethane, although some BU was also present.  Under aqueous alkaline conditions, 2-HMP was more reactive than 4-HMP, exhibiting an enhanced reactivity that was attributed to intramolecular hydrogen bonding and a resulting resonance stabilization of the phenolic aromatic ring.  <br />ATR-FTIR spectroscopic studies generated real time structural information for model compound reactions of the cross-catalyzed system, differentiating among reaction peaks generated by the carbamic acid reaction, PU and BU formation.  ATR-FTIR also permitted monitoring of propylene carbonate hydrolysis and accelerated alkaline PF resole condensation.  ATR-FTIR data also showed that the overall reaction stoichiometry between the PF and pMDI components drove copolymer formation.  Benzyl urethane formation predominated under balanced stoichiometric conditions in the presence of ammonium hydroxide, while phenyl urethane formation was favored in its absence.  Accelerated phenolic methylene bridge formation became more important when the PF component was in excess in the presence of sufficient accelerator.  A high percentage of free isocyanate was present in solid copolymer formed at ambient temperature. The combination of ammonium hydroxide and tin (II) chloride synergistically enhanced the reactivity of the materials, reducing the residual isocyanate.<br />From 13C CP/MAS NMR of the copolymer, the presence of ammonium hydroxide and tin (II) chloride and the higher PF concentration resulted in substantial urethane formation.  Ammonium hydroxide favored formation of benzyl urethane from the 2-hydroxymethyl groups, while phenyl urethane formed in its absence.  The low alkalinity PF resole with ammonium hydroxide favored benzyl urethane formation.  Comparison of these results with the 13C NMR model compound reactions with phenyl isocyanate under alkaline conditions confirmed high and low alkalinity should favor phenyl and benzyl urethane formation respectively.  These cross catalyzed systems are tunable by formulation for type of co-polymer linkages, reactivity, and cost.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-08T08:00:13Z (GMT). No. of bitstreams: 1 Haupt_RA_D_2013.pdf: 4349595 bytes, checksum: e5fc1644dca0b602fa8845017031984b (MD5)   Previous issue date: 2013-05-07",
  "format_medium": "ETD",
  "handle": "22025",
  "identifier_other": "vt_gsexam:484",
  "identifier_uri": "http://hdl.handle.net/10919/22025",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "phenol-formaldehyde",
    "PF",
    "polymeric MDI",
    "pMDI",
    "propylene carbonate",
    "polyurethane",
    "acceleration",
    "reactivity",
    "NMR",
    "FTIR",
    "ATR-FTIR"
  ],
  "title": "Structural Determination of Copolymers from the Cross-catalyzed Reactions of Phenol-formaldehyde and Polymeric Methylenediphenyl Diisocyanate",
  "type": "Dissertation"
}