{
  "contributor_author": "Kiosoglous, Cameron Michael",
  "contributor_committeechair": "Renard, Paul D",
  "contributor_committeemember": [
    "Boucouvalas, Marcie",
    "Klunk, Clare D",
    "Belli, Gabriella M"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2013-05-09T08:00:26Z",
  "date_available": "2013-05-09T08:00:26Z",
  "date_issued": "2013-05-08",
  "degree_discipline": "Human Development",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Coaching effectiveness is a result of a coach getting the best out of the people and resources in their environment. For coaches, learning from experience is vital in a role that is a complex, dynamic and multifaceted process of balancing fun and winning where one cannot be sure if results will go according to plan. At the Olympic level, due to commercialization more money is being spent than ever before on developing more professional and effective training systems to maximize athletic performances. Medals won determine how a coach is evaluated and with more nations competition at a higher level, success is becoming even more competitive. More qualified and adaptable coaches are required to cope with the demands of international competition. The literature has been extensively examined based on the research question: to what extent is coaching success predicted by a coaches\\' ability to self-reflect on past experiences? The purpose of this study was to demonstrate that if coaches who are highly self-reflective and have successful athletic and coaching experiences would be more likely to have future coaching success than those who either were not self-reflective or had less success in the past.<br />Coaching knowledge is acquired though experience and the process of learning and self-reflection is an activity that facilitates this process. This study showed that rowing coaching experience and rowing athletic experience are positive predictors of coaching success, albeit weakly so. While self-reflective activities are not predictors of coaching success, self-reflection is an activity that coaches engage in. This study also identified the challenges in measuring coaching success. But like any domain, deliberate practice, which is a known pathway to developing expertise, is an activity that contributes to the professionalization of sports coaching and its advancement as a profession.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-09T08:00:26Z (GMT). No. of bitstreams: 1 Kiosoglous_CM_D_2013.pdf: 5497914 bytes, checksum: 596fd71769ed7d346bc9c548c49b18af (MD5)   Previous issue date: 2013-05-08",
  "format_medium": "ETD",
  "handle": "22029",
  "identifier_other": "vt_gsexam:919",
  "identifier_uri": "http://hdl.handle.net/10919/22029",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Professionalization of sport",
    "Sports coaching effectiveness and expertise",
    "Sports coaching development",
    "Evaluating sport coachin"
  ],
  "title": "Sports Coaching Through the Ages with an Empirical Study of Predictors of Rowing Coaching Effectiveness",
  "type": "Dissertation"
}