{
  "contributor_author": "Steele-MacInnis, Matthew Joseph",
  "contributor_committeechair": "Bodnar, Robert J",
  "contributor_committeemember": [
    "Lowell, Robert P",
    "Rimstidt, James D",
    "Dove, Patricia M."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2013-05-08T08:00:18Z",
  "date_available": "2013-05-08T08:00:18Z",
  "date_issued": "2013-05-07",
  "degree_discipline": "Geosciences",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Fluids play a vital role in essentially all geologic environments and processes, and are the<br />principal media of heat and mass transfer in the Earth. The properties of geologic fluids<br />can be diverse, as fluids occur at conditions ranging from ambient temperatures and<br />pressures at Earth\\'s surface, to extreme temperatures and pressures in Earth\\'s deep<br />interior. Regardless the wide ranges of conditions at which geologic fluids occur, fluid<br />properties are described and governed by the same fundamental thermodynamic<br />relationships. Thus, application of thermodynamic principles and methods allows us to<br />decipher the properties and roles of geologic fluids, to help understand geologic<br />processes.<br />Fluid inclusions in minerals provide one of the best available tools to study the<br />compositions of geological fluids. Compositions of fluid inclusions can be determined<br />from microthermometric measurements, based on the vapor-saturated liquidus conditions<br />of model chemical systems, or by various microanalytical techniques. The vaporsaturated<br />liquidus relations of the system H2O-NaCl-CaCl2 have been modeled to allow<br />estimation of fluid inclusion compositions by either microthermometric or<br />microanalytical methods.<br />Carbon capture and storage (CCS) in deep saline formations represents one option<br />for reducing anthropogenic CO2 emissions into Earth\\'s atmosphere. Availability of<br />storage volume in deep saline formations is a significant component of injection and<br />storage planning. Investigation of the volumetric properties of CO2, brine and CO2-<br />saturated brine reveals that storage volume requirements are minimized when CO2<br />dissolves into brine. These results suggest that a protocol involving brine extraction, CO2<br />dissolution and re-injection may optimize CCS in deep saline formations.<br />Numerical modeling of quartz dissolution and precipitation in a sub-seafloor<br />hydrothermal system was used to understand the role of fluid-phase immiscibility<br />(\"boiling\") on quartz-fluid interactions, and to predict where in the system quartz could<br />deposit and trap fluid inclusions. The spatial distribution of zones of quartz dissolution<br />and precipitation is complex, owing to the many inter-related factors controlling quartz<br />solubility. Immiscibility exerts a strong control over the occurrence of quartz<br />precipitation in the deeper regions of fluid circulation.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-08T08:00:18Z (GMT). No. of bitstreams: 2 Steele-MacInnis_MJ_D_2013.pdf: 16499879 bytes, checksum: 4cd8e84533c5863e39a542dbac7fd2e4 (MD5) Steele-MacInnis_MJ_D_2013_support_1.pdf: 236415 bytes, checksum: 3ec50d1d915bf5cfaac3f2df72913336 (MD5)   Previous issue date: 2013-05-07",
  "format_medium": "ETD",
  "handle": "22026",
  "identifier_other": "vt_gsexam:533",
  "identifier_uri": "http://hdl.handle.net/10919/22026",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "hydrothermal fluids",
    "fluid inclusions",
    "silica",
    "quartz",
    "carbon capture and storage",
    "fluid-mineral interaction",
    "ore deposits"
  ],
  "title": "Thermodynamics of geologic fluids",
  "type": "Dissertation"
}