{
  "contributor_author": "Northington, Robert M",
  "contributor_committeechair": "Webster, Jackson R",
  "contributor_committeemember": [
    "Scott, Durelle T",
    "Barrett, John E",
    "Benfield, Ernest F",
    "Hession, William Cully"
  ],
  "contributor_department": "Biological Sciences",
  "date_accessioned": "2013-05-11T08:00:23Z",
  "date_available": "2013-05-11T08:00:23Z",
  "date_issued": "2013-05-03",
  "degree_discipline": "Biological Sciences",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Forested headwater stream ecosystems are important integrators of terrestrial and aquatic systems and their function depends greatly on water availability. In the southern Appalachians, models of future climate change predict alterations to the timing and intensity of storms such that most precipitation may be relegated to winter and spring. During the summer and fall, relatively less precipitation will translate to lower stream flows in systems that rarely experience such a lack of water. Given these predicted changes to the hydrologic cycle, I experimentally reduced flow to downstream sections of three streams at the Coweeta Hydrologic Laboratory in NC to assess changes to function in perennial ecosystems. The questions that I addressed included: 1) How is organic matter decomposition regulated by changes to the availability of water? and 2) How does the relationship between nutrient uptake and metabolism change under conditions of varying water availability? The availability of water (as discharge) was shown to be a major control of ecosystem function throughout these studies. Rates of leaf decomposition varied between red maple (Acer rubrum L.) and white oak (Quercus alba L.) with lower discharge in the early autumn regulating the breakdown trajectories of leaves through facilitation of colonization by microbes and macroinvertebrates. The return of water during the winter accelerated decomposition rates in the diverted sites such that mass of leaves remaining were similar to those in upstream sections. Colonization of decomposing organic matter by heterotrophic microbes (especially fungi) increased N immobilization leading to an increase in respiration per unit leaf standing stocks during the fall. Nitrification was detectable during summer low flows when leaf standing stocks were low. Changes in the timing and intensity of precipitation and thus discharge may in turn alter the temporal dynamics of ecosystem function. Leaves may remain in the stream unprocessed which will change the availability of food for macroinvertebrates, the production of which provides nutrition to higher trophic levels. Local-scale differences in organic matter processing and nutrient immobilization may translate to regional differences in food availability over both time and space. Hydrology not only acts as a local control of endogenous processes but acts also regionally through the transport of resources and nutrients to downstream reaches.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-11T08:00:23Z (GMT). No. of bitstreams: 2 Northington_RM_D_2013.pdf: 792520 bytes, checksum: 1980fc5cbe919f6ba5249a9a1dd8a749 (MD5) Northington_RM_D_2013_support_1.pdf: 206243 bytes, checksum: b84d4039f551dbea4be19c9118828dd4 (MD5)   Previous issue date: 2013-05-03",
  "format_medium": "ETD",
  "handle": "22038",
  "identifier_other": "vt_gsexam:393",
  "identifier_uri": "http://hdl.handle.net/10919/22038",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "ecosystem function",
    "experimental flow reduction",
    "net ecosystem production",
    "nitrogen cycling",
    "organic matter decomposition"
  ],
  "title": "Effects of experimentally-altered hydrology on ecosystem function in headwater streams",
  "type": "Dissertation"
}