{
  "contributor_author": "Benoit, Kristy E.",
  "contributor_committeechair": "Ollendick, Thomas H.",
  "contributor_committeemember": [
    "Bell, Martha Ann",
    "Kim-Spoon, Jungmeen",
    "Axsom, Danny K.",
    "Clum, George A."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2013-05-10T08:00:36Z",
  "date_available": "2013-05-10T08:00:36Z",
  "date_issued": "2013-05-09",
  "degree_discipline": "Psychology",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "A currently burgeoning area of research has demonstrated that interpretation biases play a causal role in the onset of anxiety, and by training interpretation biases towards benign interpretations of ambiguity, experimental paradigms can be used to decrease levels of clinical and trait anxiety in both adults and children. Drawing on this well-documented experimental literature, and recently growing treatment literature, training anxious mothers to more benign interpretations of ambiguity in their children\\'s environment may not only lessen their own anxious cognitions, but also reduce the anxious cognitions they transmit to their children. The primary objective of the current study was to determine whether a uniquely interpersonal interpretation modification paradigm (IMP) could alter the transmission of an anxious information processing style from clinically anxious mothers to their children. Results suggest that the IMP, compared to a control condition, resulted in fewer child-referent anxious cognitions in mothers and warmer maternal behavior directed to children during preparation for an anxiety-provoking speech task; however, child self-referent anxious cognitions, child behavior, and child physiological arousal during the speech task were not differentially affected. Mother and child general interpretation biases decreased over time in both groups. The current study is discussed as a pivotal step towards assessing the feasibility of modifying anxious mothers\\' interpretation biases concerning their children in real-life clinical settings.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-10T08:00:36Z (GMT). No. of bitstreams: 2  Benoit_KE_D_2013.pdf: 696548 bytes, checksum: 8376e6180334314f819312917eb240df (MD5)  Benoit_KE_D_2013_support_1.pdf: 245371 bytes, checksum: c12e3f4c0191c87f65f55dedd4f75ce5 (MD5)    Previous issue date: 2013-05-09",
  "format_medium": "ETD",
  "handle": "22035",
  "identifier_other": "vt_gsexam:404",
  "identifier_uri": "http://hdl.handle.net/10919/22035",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Interpretation Modification",
    "Anxiety",
    "Mother",
    "Child"
  ],
  "title": "Interpretation Bias in Anxious Mothers and Their Children: Can Interpretation Modification Affect the Intergenerational Transmission of Anxiety?",
  "type": "Dissertation"
}