{
  "contributor_author": "Barlow, Angela Michelle",
  "contributor_committeechair": "Hawdon, James E",
  "contributor_committeemember": [
    "Bailey, Carol A",
    "Fuller, Theodore D",
    "Ryan, John W."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2013-05-10T08:00:31Z",
  "date_available": "2013-05-10T08:00:31Z",
  "date_issued": "2013-05-09",
  "degree_discipline": "Sociology",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This dissertation provides an empirical test of the relational dimension of Donald Black\\'s theory of moral time. In Moral Time, Black (2011) aims to explain the causal mechanism of conflict within and across cultures, over time, and within macro, meso, and micro level interactions. According to Black (2011), the movement of social time within three dimensions of social life, relational, vertical, and cultural, is the root of all conflict. In this study, I test the relationship between movements of intimacy, the relational dimension of social life, and conflict, using judgments of offensiveness of sexualized interaction between coworkers depicted in vignettes. An online survey was administered to 1,936 undergraduate and graduate students at a large, public university in the Southeastern United States, who judged the offensiveness of movements of intimacy between coworkers. Findings provide strong support for the relational dimension of Black\\'s theory at the aggregate level, but also indicate that the theory provides a less robust explanation of interpersonal conflict when contextual factors, such as the level of previous intimacy, occupational rank, gender, and sexual orientation of the people involved, are included in analyses.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-10T08:00:31Z (GMT). No. of bitstreams: 2 Barlow_AM_D_2013.pdf: 793490 bytes, checksum: b824cb268f793398d2e7d31aecf50c73 (MD5) Barlow_AM_D_2013_support_3.pdf: 224909 bytes, checksum: 12051b0e510c36042d2493778498a303 (MD5)   Previous issue date: 2013-05-09",
  "format_medium": "ETD",
  "handle": "22034",
  "identifier_other": "vt_gsexam:906",
  "identifier_uri": "http://hdl.handle.net/10919/22034",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": "Moral Time; Deviance; Conflict; Intimacy; Sexuality",
  "title": "Sexualities and Conflicting Moralities at Work: An Empirical Test of Black\\'s Theory of Moral Time",
  "type": "Dissertation"
}