{
  "contributor_author": "Prussin II, Aaron Justin",
  "contributor_committeechair": [
    "Ross, Shane David",
    "Schmale, David Garner Burton"
  ],
  "contributor_committeemember": [
    "Barney, Jacob",
    "Baudoin, Antonius B",
    "Marr, Linsey C"
  ],
  "contributor_department": "Plant Pathology, Physiology and Weed Science",
  "date_accessioned": "2013-05-15T08:00:15Z",
  "date_available": "2013-05-15T08:00:15Z",
  "date_issued": "2013-05-14",
  "degree_discipline": "Plant Pathology, Physiology and Weed Science",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Fusarium head blight (FHB), caused by Fusarium graminearum, is a serious disease of wheat and barley that has caused several billion dollars in crop losses over the last decade in the United States. Spores of F. graminearum are released from corn and small grain residues left-over from the previous growing season and are transported long distances in the atmosphere before being deposited.  Current risk assessment tools consider environmental conditions favorable for disease development, but do not include spore transport. Long distance transport models have been proposed for a number of plant pathogens, but many of these models have not been experimentally validated. In order to predict the atmospheric transport of F. graminearum, the potential source strength (Qpot) of inoculum must be known.  We conducted a series of laboratory and field experiments to estimate Qpot from a field-scale source of inoculum of F. graminearum.  Perithecia were generated on artificial (carrot agar) and natural (corn stalk) substrates.  Artificial substrate (carrot agar) produced 15±0.4 perithecia cm-2, and natural substrate (corn stalk) produced 44±2 perithecia cm-2.  Individual perithecia were excised from both substrate types and allowed to release ascospores every 24 hours.  Perithecia generated from artificial (carrot agar) and natural (corn stalk) substrates released a mean of 104±5 and 276±16 ascospores, respectively.  A volumetric spore trap was placed inside a 3,716 m2 clonal source of inoculum in 2011 and 2012.  Results indicated that ascospores were released under field conditions predominantly (>90%) during the night (1900 to 0700 hours).  Estimates of Qpot for our field-scale sources of inoculum were approximately 4 billion ascospores per 3,716 m2.  Release-recapture studies were conducted from a clonal field-scale source of F. graminearum in 2011 and 2012. Microsatellites were used to identify the released clone of F. graminearum at distances up to 1 km from the source. Dispersal kernels for field observations were compared to results predicted by a Gaussian dispersal-based spore transport model.  In 2011 and 2012, dispersal kernel shape coefficients were similar for both results observed in the field and predicted by the model, with both being dictated by a power law function, indicating that turbulence was the dominant transport factor on the scale we studied (~ 1 km).  Model predictions had a stronger correlation with the number of spores being released when using a time varying q0 emission rate (r= 0.92 in 2011 and r= 0.84 in 2012) than an identical daily pattern q0 emission rate (r= 0.35 in 2011 and r= 0.32 in 2012).  The actual numbers of spores deposited were 3 and 2000 times lower than predicted if Qpot were equal to the actual number of spores released in 2011 and 2012, respectively. Future work should address estimating the actual number of spore released from an inoculated field during any given season, to improve prediction accuracy of the model.  This work should assist in improving current risk assessment tools for FHB and contribute to the development of early warning systems for the spread of F. graminearum.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-15T08:00:15Z (GMT). No. of bitstreams: 1 Prussin_AJ_D_2013.pdf: 3892527 bytes, checksum: edc1a7f2153a2ba8ef01c1800553c95d (MD5)   Previous issue date: 2013-05-14",
  "format_medium": "ETD",
  "handle": "22044",
  "identifier_other": "vt_gsexam:569",
  "identifier_uri": "http://hdl.handle.net/10919/22044",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Atmospheric transport Fusarium graminearum",
    "Fusarium head blight",
    "Gaussian plume model",
    "Microsatellite"
  ],
  "title": "Monitoring and Predicting the Long Distance Transport of Fusarium graminearum, Causal Agent of Fusarium Head Blight in Wheat and Barley",
  "type": "Dissertation"
}