{
  "contributor_author": "Smith, Ryan Christopher",
  "contributor_committeechair": "Geller, E. Scott",
  "contributor_committeemember": [
    "Perillo, Patricia A.",
    "Finney, Jack W.",
    "Foti, Roseanne J."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2013-05-15T08:00:26Z",
  "date_available": "2013-05-15T08:00:26Z",
  "date_issued": "2013-05-14",
  "degree_discipline": "Psychology",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Alcohol use and abuse among college/university students continues as a major public health concern.  One potential source of alcohol-related harm is the inability of students to estimate their current level of intoxication (gBAC).  The current four field studies use breathalyzers to investigate student gBAC and the efficacy of a variety of BAC-feedback tools at promoting greater awareness of driving risks while under the influence of alcohol.       The research was conducted across 89 nights spanning seven academic semesters from Fall 2009 to Fall 2012.  Research tables were setup between the hours of 6:00pm and 2:00am at three locations near downtown bar establishments and one on-campus location near a late-night dining facility.  Unique subject codes were created to track participants across multiple nights of participation.  In total, 12,432 blood alcohol concentration (BAC) readings were collected from 10,225 unique individuals.    Study 1 examined general epidemiology across all nights.  The average BAC of drinking participants was .100 mL/L.  Results revealed significant differences in BAC as a function of demographic and environmental factors.  Additionally, it was found the average student was incorrect in estimating his or her BAC by .034 mL/L.    Studies 2 and 3 examined the accuracy of BAC-estimation tools (i.e., nomograms, sobriety tests, and phone applications) and the efficacy of these tools to increase awareness of driving-related risks.  On average, both nomograms and BAC-estimation phone applications  <br />were incorrect in estimating BAC by over .05 mL/L.  Sobriety tests performed slightly better than chance at discriminating BACs of .08 mL/L.  <br />Participants receiving BAC-feedback had increased awareness of driving risk across levels of intoxication. Nomogram and breathalyzer feedback tended to promote healthier perceptions of external risk.  Sobriety testing shifted the internal perception of feeling less safe to drive.  No effect was observed for BAC-estimation phone applications.    Study 4 found individuals who received breathalyzer feedback across multiple nights of the research were significantly more accurate at estimating their BAC.  Specifically, individuals on the fifth night of participation were .017 mL/L more accurate at estimating their BAC as compared to the first night.  Future research areas and policy implications are discussed.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-15T08:00:26Z (GMT). No. of bitstreams: 2  Smith_RC_D_2013.pdf: 5634264 bytes, checksum: b8a1b2ac06acb6330743f5428324c04a (MD5)  Smith_RC_D_2013_support_3.pdf: 420890 bytes, checksum: 8e5234ab3dddde214d6651aabc65088c (MD5)    Previous issue date: 2013-05-14",
  "format_medium": "ETD",
  "handle": "22047",
  "identifier_other": "vt_gsexam:1181",
  "identifier_uri": "http://hdl.handle.net/10919/22047",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Alcohol",
    "BAC",
    "Breathalyzer",
    "Student",
    "University"
  ],
  "title": "A Multi-Year Investigation of Alcohol Consumption among University Students: Innovations in Assessing and Intervening to Reduce Alcohol-Related Harm",
  "type": "Dissertation"
}