{
  "contributor_author": "Ellis, Keyana Chamere",
  "contributor_committeechair": "Kaufman, Eric K.",
  "contributor_committeemember": [
    "Sanders, Karen Eley",
    "Alston, Antoine J",
    "Rudd, Rickie Duane"
  ],
  "contributor_department": "Agricultural and Extension Education",
  "date_accessioned": "2013-05-15T08:00:22Z",
  "date_available": "2013-05-15T08:00:22Z",
  "date_issued": "2013-05-14",
  "degree_discipline": "Agricultural and Extension Education",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The Virginia Tech Summer Academy (VTSA) Program, developed by through a collaborative partnership between faculty, administrators and staff concerned by attrition among-first year students, was introduced in summer 2012 as a campus initiative to assist first-year college students transition and acclimate to the academic and social systems of the campus environment. VTSA is a six-week intensive residential summer-bridge program that provides academic preparation, highly-individualized advising, learning communities, and the personal attention of faculty and peer mentorship through both academic engagement and structured activities. Although based on a substantive body of research concerning student retention, little is known about the empirical and influential value of this program. <br />A two-phase, sequential explanatory mixed-methods (QUAN\"\" QUAL) study was developed to assess the value of student academic engagement in a first-year experience program.  Specifically, this research investigated the outcomes of participation on cognitive, behavioral, and affective factors of motivation, taking into account demographic and academic performance variables. In the initial quantitative phase, data from 89 students were analyzed to assess engagement and academic motivation. Data from the Scale of Educationally Purposeful Activities (SEPA) were used to determine levels of student engagement among VTSA students, while the Motivation Subscale of the Learning and Study Strategies Inventory (LASSI) was used to investigate the change in student academic motivation before and after participation in VTSA. In the subsequent qualitative phase, 16 students participated in focus groups designed to explore student perceptions of engagement in the VTSA program and their connections to academic motivation. Both qualitative and quantitative data were assessed to provide an in-depth evaluation used to interpret and explain significant factors of student engagement that provide for internal and external academic motivation in college.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-15T08:00:22Z (GMT). No. of bitstreams: 2 Ellis_KC_D_2013.pdf: 2936186 bytes, checksum: 8697d495a364a40b9057079db6b9435d (MD5) Ellis_KC_D_2013_support_1.pdf: 413435 bytes, checksum: 08d1750628305858ed53957c27f402d3 (MD5)   Previous issue date: 2013-05-14",
  "format_medium": "ETD",
  "handle": "22046",
  "identifier_other": "vt_gsexam:353",
  "identifier_uri": "http://hdl.handle.net/10919/22046",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "First-Year Experience Program",
    "Student Engagement",
    "Student Academic Motivation",
    "Self-Regulated Learning",
    "Effective Learning Stra"
  ],
  "title": "Ready for College: Assessing the Influence of Student Engagement on Student Academic Motivation in a First-Year Experience Program",
  "type": "Dissertation"
}