{
  "contributor_author": "Moseley, Brian Isles",
  "contributor_committeechair": "Lockee, Barbara B",
  "contributor_committeemember": [
    "Potter, Kenneth R",
    "Burton, John Knox",
    "Cennamo, Katherine S"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2013-05-14T08:00:12Z",
  "date_available": "2013-05-14T08:00:12Z",
  "date_issued": "2013-05-13",
  "degree_discipline": "Curriculum and Instruction",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The present study used a case study approach to gather information about learning object usage from multiple instructional design contexts.  The study examined three case contexts: A non-profit organization, a corporate organization, and a military organization.  The research obtained information from two sources within each context -- interviews conducted with current instructional design practitioners and documentation used within the process of developing learning objects  -- to find out if, when, and how, instructional design processes are modified to accommodate learning objects as defined in publications reviewed in this study.   The interview of the practitioners identified issues of instructional design process structure, context, and methods that were used in the context of their professional practice, as well as solicited their opinions on learning object uses for their particular context. A document analysis approach was then used to identify issues and themes within learning object development.   Document analysis was also used to further explain and clarify the findings of the interview of the research participants.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-14T08:00:12Z (GMT). No. of bitstreams: 2 Moseley_BI_D_2013.pdf: 1073289 bytes, checksum: 24080a9badc066f1da78e269d3f5f0b8 (MD5) Moseley_BI_D_2013_support_3.pdf: 270471 bytes, checksum: 5334ca6be2724f0d72852b0c991ae791 (MD5)   Previous issue date: 2013-05-13",
  "format_medium": "ETD",
  "handle": "22040",
  "identifier_other": "vt_gsexam:346",
  "identifier_uri": "http://hdl.handle.net/10919/22040",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Instructional Design",
    "Learning Objects",
    "Framework",
    "Development",
    "Case Study"
  ],
  "title": "Description of Instructional Design Framework Usage in the Development of Learning Objects",
  "type": "Dissertation"
}