{
  "contributor_author": "Allen, Kacie Chanelle",
  "contributor_committeechair": "Estabrooks, Paul Andrew",
  "contributor_committeemember": [
    "Hill, Jennie L",
    "You, Wen",
    "Zoellner, Jamie M",
    "McCrickard, Donald Scott"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2013-05-15T08:00:38Z",
  "date_available": "2013-05-15T08:00:38Z",
  "date_issued": "2013-05-14",
  "degree_discipline": "Human Nutrition, Foods, and Exercise",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Though the benefits of physical activity are numerous and well-known, very few adolescents are meeting physical activity recommendations. Moreover, past research shows that physical activity declines with increasing age with this decline beginning in adolescence. One approach to promote physical activity is through mobile technology such as a mobile phone. Since mobile phone ownership is relatively high (77%) and there is no digital divide by race/ethnicity or socioeconomic status, mobile phones may be suitable for physical activity promotion. Few studies have promoted PA using a mobile phone and those studies showed increased physical activity outcomes. However, more research is needed to explore the effectiveness of mobile phone physical activity promotion especially in more health disparate populations. <br />    The purpose of this research was to develop and test smartphone game application for physical activity promotion in adolescents. The first study included various user-centered approaches (e.g. qualitative data, idea sessions) to get feedback on what was desired from the adolescents in terms of game development and design. The second study examined the degree to which mobile health studies reported on internal and external validity indicators. The last study evaluated the smartphone game applications through a mixed-methods approach. <br />    The results of this research showed that physical activity while playing smartphone game applications can yield moderate physical activity intensity. Moreover, adolescents had moderate perceptions of the games and recommended specific changes to the games. Likewise, the data suggest that smartphone physical activity game applications can be enjoyable if they are aesthetically appealing, easy to use, and foster social peer interactions. Overall, this research demonstrated that smartphone games that were developed and designed based on adolescents\\' preferences and persuasive technology design principles could increase physical activity in adolescents and provides a tool for further exploration.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-15T08:00:38Z (GMT). No. of bitstreams: 1 Allen_KC_D_2013.pdf: 3327663 bytes, checksum: 40ea6b8392115598642e3a2c55491ade (MD5)   Previous issue date: 2013-05-14",
  "format_medium": "ETD",
  "handle": "22050",
  "identifier_other": "vt_gsexam:799",
  "identifier_uri": "http://hdl.handle.net/10919/22050",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "physical activity",
    "adolescents",
    "smartphone games",
    "low socioeconomic status",
    "intervention"
  ],
  "title": "Developing and Testing Smartphone Game Applications for Physical Activity Promotion in Adolescents",
  "type": "Dissertation"
}