{
  "contributor_author": "Benson, Matthew Carl",
  "contributor_committeechair": "Niewolny, Kimberly Lee",
  "contributor_committeemember": [
    "Rudd, Rickie Duane",
    "Calhoun, David B.",
    "Richardson, Jesse James",
    "Brown, Cheryl"
  ],
  "contributor_department": "Agricultural and Extension Education",
  "date_accessioned": "2013-05-21T08:00:06Z",
  "date_available": "2013-05-21T08:00:06Z",
  "date_issued": "2013-05-20",
  "degree_discipline": "Agricultural and Extension Education",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Farm to School is a program that connects local and regional foods and other farm products to school meals, develops school gardens, and develops other types of Farm to School experiential learning programs for K-12 students. Since Farm to School began in the mid-1990\\'s, Farm to School programs have been developed in all 50 states and Washington D.C. The National Farm to School Network has estimated that almost 12,500 schools are involved with Farm to School, and that during the 2011-2012 school year, 5.7 million students were reached through Farm to School programs and activities. Research to date investigating Farm to School has primarily focused on food system and school system stakeholders including school nutrition directors, food distributors, farmers, school teachers, students, and principals. Not as much research has explored Cooperative Extension\\'s role in Farm to School. Farm to School programs are one method for Extension professionals to support community food system development while addressing pressing social concerns related to agricultural viability and public health. Drawing on reasoned action theory and social movement theory, the purpose of this study was to explore food system change through an analysis of Cooperative Extension\\'s role in the Farm to School movement. In this two-phase explanatory sequential mixed methods research study, the behavioral intentions/behaviors of Cooperative Extension professionals were analyzed. Additionally, the goals, strategies, and knowledge production of Cooperative Extension professionals participating in the Farm to School movement were explored. Data were collected through an online survey distributed to Extension professionals in eight states. A total of 931 Extension professionals completed the questionnaire resulting in a 48 percent response rate. Data were also collected through a state-based case study that explored Ohio State University (OSU) Extension involvement and leadership in the Ohio Farm to School Program. The case study included 21 interviews with OSU Extension professionals and Farm to School program partners. Regression models were developed to explore which behavioral intentions are statistically significant in explaining Extension participation in the Farm to School movement. Results show that past participation in a Farm to School training program, knowledge about Farm to School, attitude towards Farm to School, perceived social norms towards Farm to School, and perceived behavioral control towards Farm to School are positively associated with participation in the Farm to School movement. Drawing on Stevenson, Ruhf, Lezberg, and Clancy (2007), qualitative analysis found that OSU Extension professional\\'s goals for the Farm to School movement were primarily related to food system transformation and inclusion, and their strategies were primarily related to connection. Drawing on Eyerman and Jamison (1991), qualitative analysis also found that OSU Extension professionals were producing primarily organizational knowledge through participation in the Farm to School movement. Additionally, qualitative analysis found that Cooperative Extension Systems are home to several Farm to School movement intellectuals. This study concludes with a discussion of recommendations for Cooperative Extension participation in the Farm to School movement, recommendations for Farm to School program partners, and recommendations for future research in Farm to School.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-21T08:00:06Z (GMT). No. of bitstreams: 1 Benson_MC_D_2013.pdf: 3669800 bytes, checksum: f7441a52538830f7dad5a5d78b6f456f (MD5)   Previous issue date: 2013-05-20",
  "format_medium": "ETD",
  "handle": "22077",
  "identifier_other": "vt_gsexam:723",
  "identifier_uri": "http://hdl.handle.net/10919/22077",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Community Development",
    "Community Food Systems",
    "Cooperative Extension",
    "Farm to School",
    "Mixed Methods",
    "Social Movements"
  ],
  "title": "Exploring Food System Change through a Mixed Methods Analysis of Cooperative Extension\\'s Role in the Farm to School Movement",
  "type": "Dissertation"
}