{
  "contributor_author": "Stahr III, Donald William",
  "contributor_committeechair": "Law, Richard D",
  "contributor_committeemember": [
    "Spotila, James A",
    "Tracy, Robert J",
    "Searle, Michael P.",
    "Caddick, Mark James"
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2013-05-24T08:00:35Z",
  "date_available": "2013-05-24T08:00:35Z",
  "date_issued": "2013-05-23",
  "degree_discipline": "Geosciences",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The Himalayan orogen provides a natural laboratory to test models of orogenic development due to large-scale continental collision. The Greater Himalayan Series (GHS), a lithotectonic unit continuous along the entire length of the belt, comprises the metamorphic core of the Himalayan orogen and underlies the highest topography. GHS rocks are exposed as a moderately north-dipping slab bounded below by the Main Central Thrust (MCT) and above by the South Tibetan Detachment System (STDS) of normal faults. Coeval reverse- and normal-sense motion on the crustal-scale MCT and STDS ductile shear zones allows the GHS to be modeled as an extruded wedge or channel of mid-crustal material. Due to this unique tectonic setting, the deformation path of rocks within the bounding shear zones and throughout the core of the GHS profoundly influences the efficiency of extrusion and exhumation processes. Attempts to quantify GHS deformation and metamorphic evolution have provided significant insight into Himalayan orogenic development, but these structural and petrologic studies are often conducted in isolation. Penetrative deformation fabrics developed under mid-upper amphibolite facies conditions within the GHS argue that deformation and metamorphism were coupled, and this should be considered in studies aimed at quantifying GHS teconometamorphic evolution.<br /><br />This work focuses on two projects related to the coupled deformation, thermal and metamorphic evolution during extrusion and exhumation of the GHS, focused on the lower and upper margins of the slab. A detailed examination of the P--T history of a schist collected from within the MCT zone of the Sutlej River, NW India, provides insight into the path experienced by these rocks as they traveled through the crust in response to the extreme shortening related to India-Asia collision. Combined forward thermodynamic and diffusion modeling indicates compositional zoning preserved in garnet has remained unmodified since growth and can be related directly to the P--T--X evolution of rocks from this zone. Classic porphyroblast--matrix relationships coupled with the above models provide a structural framework within which to interpret the microstructures and provide additional constraints on the relative timing of metamorphic and deformation events.<br /><br />A combined microstructural and quartz petrofabric study of rocks from the highest structural levels of the GHS in the Zanskar region was completed. This work provides the first quantitative estimate of temperatures attending normal-sense shearing along the Zanskar Shear Zone, the westernmost strand of the STDS. Results indicate penetrative top-N (extensional) deformation occurred at elevated temperatures and resulted in the telescoping of isothermal surfaces present during shearing and extrusion of GHS rocks. Simple geometric models invoking heterogeneous simple shear parallel to the overlying detachment require dip-slip displacement magnitudes on the order of 15--40 km, identical to estimates derived from nearby barometric analyses.<br /><br />Finally, focus is given to the rotational behavior of rigid inclusions suspended in a flowing viscous matrix from a theoretical perspective. Predictions of clast rotational behavior have been used to construct several kinematic vorticity estimation techniques that have become widely adopted for quantitative studies of naturally deformed rocks. Despite the popularity of the techniques, however, basic questions regarding clast-based analyses remain open. Therefore a numerical model was constructed and a systematic investigation of 2- and 3D clasts suspended in steady and non-steady plane-strain flows was undertaken to determine likely sources of error and the intrinsic strengths and limitations of the techniques.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-24T08:00:35Z (GMT). No. of bitstreams: 2 Stahr_DW_D_2013.pdf: 28579792 bytes, checksum: 309016d8dde8899a1e16cae22e70e707 (MD5) Stahr_DW_D_2013_support_1.pdf: 17688 bytes, checksum: 36af816469d7e95398a9f93c5787d7fc (MD5)   Previous issue date: 2013-05-23",
  "format_medium": "ETD",
  "handle": "23081",
  "identifier_other": "vt_gsexam:988",
  "identifier_uri": "http://hdl.handle.net/10919/23081",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "kinematic vorticity",
    "P--T path analysis",
    "quartz crystallographic fabrics"
  ],
  "title": "Kinematic evolution, metamorphism, and exhumation of the Greater Himalayan Series, Sutlej River and Zanskar regions of NW India",
  "type": "Dissertation"
}