{
  "contributor_author": "Chen, Zheng",
  "contributor_committeechair": [
    "Miller, Patrick A.",
    "Clements, Terry L."
  ],
  "contributor_committeemember": [
    "Kim, Mintai",
    "Hirsh, Richard F."
  ],
  "contributor_department": "Architecture",
  "date_accessioned": "2013-05-25T08:00:28Z",
  "date_available": "2013-05-25T08:00:28Z",
  "date_issued": "2013-05-24",
  "degree_discipline": "Architecture and Design Research",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The profession of landscape architecture has not managed to sufficiently build a  body of solid knowledge through research, which weakens the profession in terms of justifying its practice. In order to investigate why the profession has not built its knowledge-base sufficiently, this dissertation collected first-hand empirical data on the use and need of research in current landscape architecture practice, as well as the perceptions about research among landscape architects. Four questions were asked in this study:  1) What are the concerns of landscape architecture practice? 2) What is the significance of research in landscape architecture? 3) How do landscape architects perceive the need of research? 4) How are research findings disseminated in landscape architecture? To answer the questions, an online survey was given to randomly sampled ASLA members (adjusted response rate = 31%, n=239). The data was then analyzed through descriptive statistics, comparative statistics, and dimension analysis.     Modern professions are expected not only to successfully perform professional actions, but also to justify these actions with rational explanations. To meet this expectation, the scope of landscape architecture knowledge has expanded from design knowledge into systems knowledge. While design knowledge concerns how to do design, systems knowledge concerns why certain design actions should be taken. Meanwhile, with expanding systems knowledge, research becomes more and more important to landscape architecture practice. Sixty-seven percent of landscape architects are using research findings often in making design decisions.     However, results indicates that landscape architects expect research to generate  rational solutions based on solid understanding of the phenomena and problems involved in design. Based on a review of literature, this expectation is unrealistic. The profession, if it expects to build a research-oriented practice, needs to change its perceptions about research, and advance its knowledge through studies and evaluations of built design work.    Despite the increasing use of research, this study also found that landscape architects today still make their design decisions largely based on a body of tacit knowledge, such as professional experience and intuition. This body of tacit knowledge is often learned in an apprentice manner between practitioners in their workplace, and is rarely shared in the whole profession. While practitioners do not share much beyond their workplace, educators primarily share within academia, which limits the profession from improving its work in a fast changing world. The profession should encourage practitioners to do research by promoting the examples of practicing researchers, and offer places to share knowledge. The profession should also encourage educators to share knowledge beyond academia and to be more aware of the potential implications of their research findings.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-05-25T08:00:28Z (GMT). No. of bitstreams: 2  Chen_Z_D_2013.pdf: 5421979 bytes, checksum: effe180453a6897e319a03a66ef19e81 (MD5)  Chen_Z_D_2013_support_1.pdf: 475957 bytes, checksum: 48bcf6817a5325cbf8535e30d43b9b26 (MD5)    Previous issue date: 2013-05-24",
  "format_medium": "ETD",
  "handle": "23095",
  "identifier_other": "vt_gsexam:925",
  "identifier_uri": "http://hdl.handle.net/10919/23095",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "landscape architecture",
    "research and practice",
    "professionalization",
    "knowledge"
  ],
  "title": "The Role of Research in Landscape Architecture Practice",
  "type": "Dissertation"
}