{
  "contributor_author": "Gao, Junqi",
  "contributor_committeechair": "Viehland, Dwight D",
  "contributor_committeemember": [
    "Li, Jie-Fang",
    "Clark, David E",
    "Lu, Guo Quan"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2013-06-04T08:01:01Z",
  "date_available": "2013-06-04T08:01:01Z",
  "date_issued": "2013-06-03",
  "degree_discipline": "Materials Science and Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Magnetoelectric (ME) effect, a cross-coupling effect between magnetic and electric orders, has stimulated lots of investigations due to the potential for applications as multifunctional devices. In this thesis, I have investigated and optimized the ME effect in Metglas/piezo-fibers ME composites with a multi-push pull configuration. Moreover, I have also proposed several devices based on such composites.<br />In this thesis, several methods for ME composites optimization have been investigated. (i)  the ME coefficients can be enhanced greatly by using single crystal fibers with high piezoelectric properties; (ii) the influence of volume ratio between Metglas and piezo-fibers on ME coefficients has been studied both experimentally and theoretically. Modulating the volume ratio can increase the ME coefficient greatly; and (iii) the annealing process can change the properties of Metglas, which can enhance the ME response as well. Moreover, one differential structure for ME composites has been proposed, which can reject the external vibration noise by a factor of 10 to 20 dB. This differential structure may allow for practical applications of such sensors in real-world environments.<br />Based on optimized ME composites, two types of AC magnetic sensor have been developed. The objective is to develop one alternative type of magnetic sensor with low noise, low cost and room-temperature operation; that makes the sensor competitive with the commercially available magnetic sensor, such as Fluxgate, GMR, SQUID, etc. Conventional passive sensors have been fully investigated, including the design of sensor working at specific frequency range, sensitivity, noise density characterization, etc. Furthermore, the extremely low frequency (< 10-3 Hz) magnetic sensor has undergone a redesign of the charge amplifier circuit. Additionally, the noise model has been established to simulate the noise density for this device which can predict the noise floor precisely. Based on theoretical noise analysis, the noise floor can be eliminated greatly. Moreover, another active magnetic senor based on nonlinear ME voltage coefficient is also developed. Such sensor is not required for external DC bias that can help the sensor for sensor arrays application.<br /> Inspired by the bio-behaviors in nature, the geomagnetic sensor is designed for sensing geomagnetic fields; it is also potentially used for positioning systems based on the geomagnetic field. In this section, some works for DC sensor optimization have been performed, including the different piezo-fibers, driving frequency and magnetic flux concentration. Meanwhile, the lock-in circuit is designed for the magnetic sensor to replace of the commercial instruments. Finally, the man-portable multi-axial geomagnetic sensor has been developed which has the highest resolution of 10 nT for DC magnetic field. Based on the geomagnetic sensor, some demonstrations have been finished, such as orientation monitor, magnetic field mapping, and geomagnetic sensing.<br /> Other devices have been also developed besides the magnetic sensor: (i) magnetic energy harvesters are developed under the resonant frequency condition. Especially, one 60 Hz magnetic harvester is designed which can harvester the magnetic energy source generated by instruments; and (ii) frequency multiplication tuned by geomagnetic field is investigated which potentially can be used for frequency multiplier or geomagnetic guidance devices.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-06-04T08:01:01Z (GMT). No. of bitstreams: 1 Gao_J_D_2013.pdf: 7713811 bytes, checksum: d27d231ed2f2fb37f70fb73cf80a3797 (MD5)   Previous issue date: 2013-06-03",
  "format_medium": "ETD",
  "handle": "23138",
  "identifier_other": "vt_gsexam:1129",
  "identifier_uri": "http://hdl.handle.net/10919/23138",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Magnetoelectric",
    "magnetic sensor",
    "low noise circuit",
    "noise modeling",
    "geomagnetic field sensing",
    "energy harvester"
  ],
  "title": "Magnetoelectric (ME) composites and functional devices based on ME effect",
  "type": "Dissertation"
}