{
  "contributor_author": "Wills, Sarah Forester",
  "contributor_committeechair": "Foti, Roseanne J.",
  "contributor_committeemember": [
    "Hauenstein, Neil M. A.",
    "Axsom, Daniel K.",
    "Geller, E. Scott"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2013-06-06T08:01:12Z",
  "date_available": "2013-06-06T08:01:12Z",
  "date_issued": "2013-06-05",
  "degree_discipline": "Psychology",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Although research in leadership perception tends to show males have an advantage over females as a result of gender stereotypes, researchers have theorized recently some of this gender-related cognitive bias may be offset by perceiver affect (Medvedeff & Lord, 2007). In this experiment, a between-participants factorial design was used to examine the impact of gender stereotypes (male or female) and perceiver affect (positive or negative) on participants\\' leader networks and dynamic perceptions of leadership. Participants were randomly assigned to a affect and leader gender condition with roughly 33 undergraduate students in each group. Leadership perceptions were assessed by examining connections between concepts in cognitive networks and repeated measurements of dynamic ratings. Data were analyzed using the Pathfinder and GEMCAT II (General Multivariate Methodology for Estimating Catastrophe Models) programs. Results suggested gender stereotypes and perceiver affect yield differential effects on leader networks. There was more stability in leader networks for a male leader than for a female, whereas there was more accuracy for perceivers in a neutral mood when compared to those in a negative mood condition. Furthermore, dynamic ratings showed the perceptual process in leadership emergence recognition was non-linear for both the male and female leader. Additionally, those in the negative mood condition were less resistant to changing their leadership perceptions when compared to those in the neutral mood condition. Potential interpretations for these findings are discussed and recommendations for future work in this area are provided.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-06-06T08:01:12Z (GMT). No. of bitstreams: 3  Wills_SF_D_2013.pdf: 2393155 bytes, checksum: 360eb03a098143f32b0bcd9f16721833 (MD5)  Wills_SF_D_2013_support_1.pdf: 180561 bytes, checksum: 93eaf8cc5ebd9d29e87f467d03d5ea78 (MD5)  Wills_SF_D_2013_support_3.pdf: 421025 bytes, checksum: e7dde34684a48877e4960003d576c645 (MD5)    Previous issue date: 2013-06-05",
  "format_medium": "ETD",
  "handle": "23162",
  "identifier_other": "vt_gsexam:1158",
  "identifier_uri": "http://hdl.handle.net/10919/23162",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Leadership perceptions",
    "Gender",
    "Affect",
    "Connectionist Models",
    "Dynamic Models"
  ],
  "title": "More Than a Feeling: The Impact of Affect and Gender as Contextual Constraints on Perceptions of Emerging Leaders",
  "type": "Dissertation"
}