{
  "contributor_author": "Zhu, Beibei",
  "contributor_committeechair": "Ge, Suqin",
  "contributor_committeemember": [
    "You, Wen",
    "Ashley, Richard A",
    "Salehi-Isfahani, Djavad"
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2013-06-07T08:00:31Z",
  "date_available": "2013-06-07T08:00:31Z",
  "date_issued": "2013-06-06",
  "degree_discipline": "Economics, Science",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This dissertation consists of three essays studying employer learning and statistical discrimination of young workers in the U.S. labor market. The first chapter outlines the dissertation by discussing the motivations, methods, and research findings.<br /><br />Chapter two develops a framework that nests both symmetric and asymmetric employer learning, and derives testable hypotheses on racial statistical discrimination under different processes of employer learning. Testing the model with data from the NLSY79, we find that employers statistically discriminate against black workers on the basis of both education and race in the high school market where learning appears to be mostly asymmetric. In the college market, employers directly observe most parts of the productivity of potential employees and learn very little over time.<br /><br />In chapter three, we investigate how the process of employer learning and statistical discrimination varies over time and across employers. The comparison between the NLSY79 and the NLSY97 cohorts reveals that employer learning and statistical discrimination has became stronger over the past decades. Using the NLSY97 data, we identify three employer- specific characteristics that influencing employer learning and statistical discrimination, the supervisor-worker race match, supervisor\\'s age, and firm size. Black high school graduates face weaker employer learning and statistical discrimination if they choose to work for a black supervisor, work for an old supervisor, or work in a firm of small size.<br /><br />In the last chapter, we are interested in the associations between verbal and quantitative skills and individual earnings as well as the employer learning process of these two specific types of skills. There exist significant differences in both the labor market rewards and employer learning process of verbal and quantitative skills between high school and college graduates. Verbal skills are more important than quantitative skills for high school graduates, whereas college-educated workers benefit greatly from having high quantitative skills but little from having high verbal skills. In addition, employers directly learn verbal skills and continuously learn quantitative skills in the high school market, but almost perfectly observe quantitative skills in the college market.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-06-07T08:00:31Z (GMT). No. of bitstreams: 1 Zhu_B_D_2013.pdf: 654611 bytes, checksum: c07cdce42d951885c0cc6f1f4260bf13 (MD5)   Previous issue date: 2013-06-06",
  "format_medium": "ETD",
  "handle": "23168",
  "identifier_other": "vt_gsexam:711",
  "identifier_uri": "http://hdl.handle.net/10919/23168",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Employer Learning",
    "Statistical Discrimination",
    "Symmetric Learning",
    "Asymmetric Learning",
    "Ability Revelation",
    "Racial Wage Gap"
  ],
  "title": "Three Essays on Employer Learning and Statistical Discrimination",
  "type": "Dissertation"
}