{
  "contributor_author": "Lin, Binbin",
  "contributor_committeechair": [
    "Schmale, David Garner Burton",
    "Ross, Shane David"
  ],
  "contributor_committeemember": [
    "Baudoin, Antonius B",
    "Vinatzer, Boris A"
  ],
  "contributor_department": "Plant Pathology, Physiology and Weed Science",
  "date_accessioned": "2013-06-12T08:00:50Z",
  "date_available": "2013-06-12T08:00:50Z",
  "date_issued": "2013-05-23",
  "degree_discipline": "Plant Pathology, Physiology and Weed Science",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Fusarium is one of the most important genera of fungi on earth. Many species of Fusarium are well-suited for atmospheric dispersal, yet little is known about their aerobiology. Previous research has shown that large-scale features known as atmospheric transport barriers (Lagrangian coherent structures) guide the transport and mixing of atmospheric populations of Fusarium. The overall goal of this work is to expand our knowledge on the movement and structure of atmospheric populations of Fusarium. The first objective was to monitor changes in colony forming units (CFUs) in atmospheric populations of Fusarium over small time intervals (10 min to several hours). We hypothesized that consecutive collections of Fusarium with unmanned aerial vehicles (UAVs) demonstrate small variations in colony counts. To test this hypothesis, sampling devices on UAVs were separated into two groups, four inner sampling devices opened during the first 10 minutes and four outer sampling devices opened during the second 10 minutes. Results indicated that (1) consecutive collections of Fusarium at 100 m demonstrated small variations in counts and (2) the similarity between collections decreased as the time between sampling intervals increased. The second objective was to determine the structure of atmospheric populations of Fusarium species and relate this to potential source regions. We hypothesized that diverse atmospheric populations of Fusarium are associated with multiple source regions. To test this hypothesis, Fusarium samples were collected with UAVs and identified to the level of species by sequencing a portion of the translation elongation factor 1-alpha gene (TEF-1•). Potential source regions were identified using the atmospheric transport model HYSPLIT. Results indicated that (1) diverse atmospheric populations of Fusarium appeared to be associated with multiple source regions, and (2) the number of Fusarium species collected with UAVs increased with back-trajectory distance of the sampled air. The third objective was to examine the associations between concentrations of populations of Fusarium at ground level (1 m) and in the lower atmosphere (100 m). We hypothesized that concentrations of Fusarium in the atmosphere vary between 1m and 100m. To test this hypothesis, Fusarium was collected with a Burkard volumetric sampler (BVS) and UAVs. Colony counts were converted to spore concentrations (spores per cubic meter of air). Sampling efficiency was used to correct spore concentrations. Results indicated that (1) the distribution of spore concentrations was similar for both samplers over different times of the day, (2) spore concentrations were generally higher in the fall, spring, and summer, and lower in the winter, and (3) spore concentrations were generally higher with BVS samplers than those with UAVs for both hourly and seasonal data. The fourth objective was to assess the ability of strains of Fusarium collected in the lower atmosphere to cause plant disease. We hypothesized that certain isolates of Fusarium collected with UAVs cause plant diseases. To test this hypothesis, we randomly selected isolates of three different species (F. circinatum, F. avenaceum, and F. sporotrichioides) of Fusarium collected with UAVs to inoculate three different hosts (wheat, corn, and pine). Known Fusarium strains were obtained from J. Leslie at Kansas State University as controls. Results indicated showed that the three different isolates tested were able to cause plant diseases in three different hosts (wheat, corn, and pine), confirming that these were potential agents of disease. This work sets the stage for future work examining potential source regions, transport distances, and seasonal patterns of Fusarium. An increased understanding of the dynamics and population structure of plant pathogenic Fusarium in the lower atmosphere is essential for predicting the spread of plant disease and optimizing disease management strategies in the future.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-06-12T08:00:50Z (GMT). No. of bitstreams: 1 Lin_B_D_2013.pdf: 4559939 bytes, checksum: 63373bacf7e22653da6782b333a40f54 (MD5)   Previous issue date: 2013-05-23",
  "format_medium": "ETD",
  "handle": "23203",
  "identifier_other": "vt_gsexam:813",
  "identifier_uri": "http://hdl.handle.net/10919/23203",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Fusarium",
    "plant pathogen",
    "aerobiology",
    "aerobiological sampling",
    "Burkard volumetric sampler",
    "BVS",
    "unmanned aerial vehicle",
    "UAV"
  ],
  "title": "Movement and Structure of Atmospheric Populations of Fusarium",
  "type": "Dissertation"
}