{
  "contributor_author": "Kraus, Vanieca Ilezabeth",
  "contributor_committeechair": "Dolbin-MacNab, Megan Leigh",
  "contributor_committeemember": [
    "Kaestle, Christine",
    "Piercy, Fred P",
    "Arditti, Joyce A"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2013-06-12T08:01:23Z",
  "date_available": "2013-06-12T08:01:23Z",
  "date_issued": "2013-06-11",
  "degree_discipline": "Human Development",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Adolescents commit between 30% and 50% of the sexual offenses against young children in the United States. Adolescents who complete specialized treatment for sexual offending, including family therapy, have lower rates of sexual recidivism. Despite the evidence that including families in adolescents\\' treatment may contribute to lower sexual recidivism rates, there are few descriptions of family therapy with adolescents who sexually offend. In particular, there are no conceptualizations or models of family involvement derived from parents and adolescents\\' perspectives on treatment. To address this need, this study examined adolescents\\' and their parents\\' experiences of participation in family therapy when the adolescent son had been required to complete treatment for sexual offending. In addition, the study explored how parent and adolescent participation in family therapy was associated with adolescents\\' progress in treatment for sexual offending. Using constructivist grounded theory methodology, a conceptualization of family therapy was developed through semi-structured interviews with ten adolescent boys who have sexually offended and their parents/caregivers. In addition, a focus group of seven family therapists who specialize in the treatment of adolescents who sexually offend reviewed the findings and offered input on refining the emerging clinical conceptualization. Findings suggest that youth have more successful outcomes when therapists foster hopefulness and use parents to help motivate youth and facilitate change. Positive outcomes of family therapy for youth included expressing himself more clearly, caring about people, thinking about his future and setting goals, having more confidence, following the rules, \"progressing in treatment, being accountable for his behavior, becoming more honest, developing life skills, and understanding and expressing regret for sexually offending. Positive outcomes of family therapy for families included changes in household rules, family roles, setting boundaries, and having respectful communication. Implications for how to best include families in adolescents\\' treatment of sexual offending are addressed.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-06-12T08:01:23Z (GMT). No. of bitstreams: 1 Kraus_VI_D_2013.pdf: 2963484 bytes, checksum: d64074fa2bdb0518d6b686553284c9fe (MD5)   Previous issue date: 2013-06-11",
  "format_medium": "ETD",
  "handle": "23212",
  "identifier_other": "vt_gsexam:862",
  "identifier_uri": "http://hdl.handle.net/10919/23212",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "adolescent sex offender",
    "juvenile offender",
    "sexual offense",
    "family therapy",
    "treatment"
  ],
  "title": "Parental Involvement in Family Therapy for Adolescents who Sexually Offend",
  "type": "Dissertation"
}