{
  "contributor_author": "Emrick III, Verl Roy",
  "contributor_committeechair": "Barrett, John E",
  "contributor_committeemember": [
    "Murphy, Brian R",
    "Jones, Robert H",
    "Webster, Jackson R"
  ],
  "contributor_department": "Biological Sciences",
  "date_accessioned": "2013-06-12T08:01:20Z",
  "date_available": "2013-06-12T08:01:20Z",
  "date_issued": "2013-05-24",
  "degree_discipline": "Biological Sciences",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The role of disturbance is widely recognized as a fundamental driver of ecological organization from individual species to entire landscapes. Anthropogenic disturbances from military training provide a unique opportunity to examine effects of disturbance on vegetation dynamics, physicochemical soil properties, and ecosystem processes. Additionally, plant functional diversity has been suggested as the key to ecosystem processes such as productivity and nutrient dynamics. I investigated how disturbance and functional composition both singly and in combination affect vegetation dynamics, soil physicochemical properties, and ecosystem processes. I conducted my research at Fort Pickett, Virginia, USA to take advantage of the spatially and temporally predictable disturbance regime. In order to investigate the effect of plant functional composition on ecosystem properties, I used functional groups comprised of species with similar physiology and effects on ecosystem processes (C4 grasses, C3 grasses, legumes, forbs, woody plants). My study showed that two distinct disturbances associated with military training, vehicle maneuvers, and fire; affect functional group abundance, within functional group richness, and total species richness. I found strong effects of vehicle maneuvers on soil physical properties including an increase in bulk density and reduction in soil porosity. Fire also influenced soil physical properties but more indirectly through the reduction of above ground litter inputs. Though many of the measured physicochemical soil properties at Fort Pickett exhibited statistically significant effects of disturbance, the strength of these relationships appears to be modulated by influences of previous land use. I found statistically significant (P < 0.05) effects of disturbance on chlorophyll fluorescence, and effect of functional composition on available soil N- NH4+. In addition, I detected a significant interactive effect of disturbance class and functional composition on soil CO2 flux. The interactive effects of disturbance and functional composition on soil CO2 flux demonstrated how the loss of functional diversity could lead to instability in ecosystem processes in disturbed ecosystems.    In a dynamic ecosystem, I demonstrated that the abundance and diversity of plant functional groups was significantly influenced by disturbance. By experimentally altering the abundance and diversity of these functional groups in a disturbance-mediated ecosystem, I showed that functional groups and presumably species influence key ecosystem processes.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-06-12T08:01:20Z (GMT). No. of bitstreams: 2 Emrick_VR_D_2013.pdf: 1386547 bytes, checksum: cf8c828ca93b23e44655a1d6d5bd0ee0 (MD5) Emrick_VR_D_2013_support_1.pdf: 613721 bytes, checksum: 4767b154f4606aac82db2b7add334078 (MD5)   Previous issue date: 2013-05-24",
  "format_medium": "ETD",
  "handle": "23211",
  "identifier_other": "vt_gsexam:738",
  "identifier_uri": "http://hdl.handle.net/10919/23211",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Plant Functional Groups",
    "Diversity",
    "Fort Pickett",
    "Disturbance",
    "Ecosystem Processes",
    "Soil CO2 Flux",
    "Chlorophyll Fluorescence"
  ],
  "title": "Disturbance, Functional Diversity and Ecosystem Processes: Does Species Identity Matter?",
  "type": "Dissertation"
}