{
  "contributor_author": "Wimer, Adam Francis",
  "contributor_committeechair": "Kuhar, Thomas P",
  "contributor_committeemember": [
    "Adams, James Cleveland",
    "Schultz, Peter B",
    "Brewster, Carlyle C",
    "Anderson, Troy D"
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2013-06-15T08:00:44Z",
  "date_available": "2013-06-15T08:00:44Z",
  "date_issued": "2013-06-14",
  "degree_discipline": "Entomology",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Leptinotarsa decemlineata (Say) is the most important defoliating pest of potato Solanum tuberosum L., in North America and Europe.  Management of this pest relies heavily on chemical control and insecticide resistance is a persistent problem.  This phenomenon has increased the need for developing novel insecticides, resistance evaluation, and the development of alternative control strategies regarding this insect pest.  From 2010 to 2013, field and lab experiments were conducted to evaluate the efficacy of a novel insecticide tolfenpyrad on L. decemlineata.  In leaf-dip assays, tolfenpyrad was highly toxic to L. decemlineata with LC50 values of 0.013 and 0.164 g ai/L for larvae and adults, respectively.  Tolfenpyrad was also toxic to eggs with 0% hatching after being dipped in a field rate concentration.  In field efficacy trials, potato plots treated with tolfenpyrad at rates as low as 153 g ai/ha effectively controlled L. decemlineata.  <br />    In 2012, populations of L. decemlineata were collected from the Eastern Shore of VA and subjected to toxicity assays to determine current susceptibility to permethrin and oxamyl.  The toxicity assays indicated an increase in toxicity to permethrin in L. decemlineata larvae (LC50 = 3.931 g ai/L) and an increase in toxicity to oxamyl in adult beetles (LC50 = 9.695 g ai/L) compared with LC50 values previously reported in 1990.  In 2012, populations of L. decemlineata from Cheriton, VA, New Church, VA, Painter, VA, and Plymouth, NC were also evaluated for enzyme activity after exposure to sub-lethal concentrations of permethrin, oxamyl, and tolfenpyrad.  Adult beetles were subjected to enzyme assays to measure the activity of cytochrome P450 mono-oxygenase (P450), glutathione-S-transferase (GST), general esterases, and protein content.  Results from the enzyme assays indicated significantly greater esterase activity in beetles from Painter, VA exposed to permethrin [±-naphthol (F= 11.66, df= 4, 20, P<0.0001) and \"-naphthol (F= 11.86, df= 4, 20, P<0.0001)], oxamyl [±- naphthol (F= 10.64, df= 4, 20, P<0.0001) and \"-naphthol (F= 6.94, df= 4, 20, P=0.0011)], tolfenpyrad [±- naphthol (F= 407.62, df= 1, 8, P<0.0001) and \"- naphthol (F= 28.15, df= 1, 8, P= 0.0007)], and the untreated control [±- naphthol (F= 28.14, df= 3, 16, P<0.0001) and \"- naphthol (F= 28.86; df= 3, 16, P<0.0001)] compared to most of the other populations tested.  GST activity was significantly greater in tolfenpyrad exposed beetles compared to the non-treated beetles from Painter VA (F= 17.66, df= 5, 24, P< 0.0001).  <br />    Through laboratory assays and field experiments in potato, the efficacy of a new bio-pesticide derived from the bacterium Chromobacterium subtsugae was evaluated for the control of L. decemlineata.  Results from the laboratory assays showed L. decemlineata feeding was inhibited by the bio-pesticide derived from C. subtsugae.  However, field efficacy trials in 2010, 2011, and 2012, indicated no control of L. decemlineata.<br />    Methyl salicylate is an organic compound produced by potato and other plants in response to insect herbivory.  Abundance of predatory arthropods and L. decemlineata life stages were measured in plots treated with and without 5 g slow-release packets of methyl salicylate (95% methyl salicylate (Predalure\")).  Methyl salicylate treatment had no impact on predator recruitment or cumulative mortality of L. decemlineata in potatoes.<br />    This research has provided us with a new tool for L. decemlineata management, as well as more information about resistance trends and alternative control strategies from which we can build on to reduce resistance development in L. decemlineata and ultimately formulate a stronger integrated pest management strategy for this insect pest.<br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-06-15T08:00:44Z (GMT). No. of bitstreams: 1 Wimer_AF_D_2013.pdf: 1635608 bytes, checksum: e51f174c0cb163537cf67355bff13724 (MD5)   Previous issue date: 2013-06-14",
  "format_medium": "ETD",
  "handle": "23232",
  "identifier_other": "vt_gsexam:944",
  "identifier_uri": "http://hdl.handle.net/10919/23232",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Leptinotarsa decemlineata",
    "toxicity",
    "resistance",
    "enzyme assays",
    "bio-pesticides",
    "methyl salicylate"
  ],
  "title": "Resistance evaluation and management of Colorado potato beetle, Leptinotarsa decemlineata (Say), using novel chemistries",
  "type": "Dissertation"
}