{
  "contributor_author": "Zhang, Musan",
  "contributor_committeechair": "Long, Timothy E",
  "contributor_committeemember": [
    "Turner, Sam Richard",
    "Whittington, Abby Rebecca",
    "Moore, Robert Bowen"
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2013-06-18T08:00:20Z",
  "date_available": "2013-06-18T08:00:20Z",
  "date_issued": "2013-06-17",
  "degree_discipline": "Chemistry",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Conventional melt transesterification successfully synthesized high molecular weight segmented copolyesters.  The cycloaliphatic monomers 2,2,4,4-tetramethyl-1,3-cyclobutanediol (CBDO) and dimethyl-1,4-cyclohexane dicarboxylate (DMCD) afforded sterically hindered, ester carbonyls in high-Tg polyester precursors.   Reaction between the polyester polyol precursor and a primary or secondary alcohol at melt polymerization temperatures revealed reduced transesterification of the polyester hard segment as a result of enhanced steric hindrance adjacent to the ester linkages.  Subsequent polymerization of a 4,000 g/mol polyol with monomers comprising the low-Tg block yielded high molecular weight polymers that exhibited enhanced mechanical properties compared to a non-segmented copolyester control.  Atomic force microscopy uncovered unique needle-like, interconnected, microphase separated surface morphologies, and small-angle X-ray scattering confirmed the presence of bulk microphase separation. <br />This new synthetic strategy enabled selective control of ionic charge placement into the hard segment or soft segment block of segmented copolyesters using melt transesterification.  The ionic placement impacted the microphase-separated morphology, which influenced its thermomechanical properties and resulting mechanical performance.  Melt transesterification of low-Tg, sodium sulfonated copolyesters achieved up to 15 mol% ionic content.  The 10 and 15 mol% sodium sulfonated copolyesters exhibited water-dispersibility, which enabled cation dialysis exchanges to divalent metal cations.  The sulfonated copolyesters containing divalent metal cations exhibited enhanced rubbery plateau moduli to higher temperatures.  <br />Novel trialkylphosphonium ionic liquids chain extenders enabled the successful synthesis of poly(ethylene glycol)-based, cationic polyurethanes with pendant phosphoniums in the hard segments (HS).  Aqueous size exclusion chromatography (SEC) confirmed the charged polyurethanes, which varied the phosphonium alkyl substituent length (ethyl and butyl) and cationic HS content (25, 50, 75 mol%), achieved high absolute molecular weights.  Dynamic mechanical analysis (DMA) demonstrated the triethylphosphonium (TEP) and tributylphosphonium (TBP) polyurethanes displayed similar thermomechanical properties, including increased rubbery plateau moduli and flow temperatures.  Fourier transform infrared spectroscopy (FTIR) emphasized the significance of ion-dipole interaction on hydrogen bonding. Atomic force microscopy (AFM), small-angle X-ray scattering (SAXS), and wide-angle X-ray diffraction (WAXD) supported microphase separated morphologies in the trialkylphosphonium polyurethanes, despite the presence of ionic interactions. Sorption isotherm experiments revealed TBP polyurethanes displayed similar water sorption profiles to the noncharged analogue and lower water absorptivity compared to TEP.  The phosphonium polyurethanes displayed significantly improved tensile strain; however, lower tensile stress of the TEP polyurethane was presumably due to absorbed water.  In addition, we also explored applications of the trialkylphosphonium polyurethanes as nucleic acid delivery vectors and demonstrated their abilities to form colloidally stable polyplexes in salt-containing media. <br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-06-18T08:00:20Z (GMT). No. of bitstreams: 2 Zhang_M_D_2013.pdf: 6527185 bytes, checksum: e30fabe276db92af5eb5ec8f880e04d9 (MD5) Zhang_M_D_2013_support_1.pdf: 450879 bytes, checksum: 0bedef2c104dc26aa571a2e7e12353d4 (MD5)   Previous issue date: 2013-06-17",
  "format_medium": "ETD",
  "handle": "23239",
  "identifier_other": "vt_gsexam:987",
  "identifier_uri": "http://hdl.handle.net/10919/23239",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Step-growth polymers",
    "polyesters",
    "ionomers",
    "polyurethanes",
    "morphology"
  ],
  "title": "Advancing Step-Growth Polymers:  Novel Macromolecular Design and Electrostatic Interactions in Polyesters and Polyurethanes",
  "type": "Dissertation"
}