{
  "contributor_author": "Manecki, Szymon M",
  "contributor_committeechair": "Vogelaar, Robert B",
  "contributor_committeemember": [
    "Link, Jonathan Marion",
    "Huber, Patrick",
    "Pitt, Mark L"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2013-06-21T08:00:16Z",
  "date_available": "2013-06-21T08:00:16Z",
  "date_issued": "2013-06-20",
  "degree_discipline": "Physics",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This work reports a first attempt to measure the solar neutrino annual<br />flux modulation due to Earth\\'s elliptical orbit with the Borexino detector. Borexino is a real-time calorimetric detector for low energy neutrino spectroscopy located in the underground laboratory of Gran Sasso, Italy. The experiment\\'s main focus is the direct measurement of the 7Be solar neutrino flux of all flavors via neutrino-electron scattering in an ultra-pure scintillation liquid. The original goal of this work was to quantify sensitivity of the Borexino detector to a 7% peak-to-peak signal variation over the course of a year and study background stability. A Monte-Carlo simulated sample of the expected variation was prepared in two phases of data acquisition, Phase I that spans from May-2007 to May-2010 and Phase II from October-2011 to September-2012. The data was then fitted in the time domain with a sinusoidal function and analyzed with the Lomb-Scargle fast Fourier transformation in the search for significant periodicities between periods of 0.5 and 1.5 years. The search was performed in the energy window dominated by 7Be, [210; 760] keV, and 60-day bins in the case of the fit and 10-bins for the Lomb-Scargle scan. This work also contains study of the post-purification data of Phase II beyond September-2012 with a prediction for the future sensitivity and justification of the achieved background levels.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-06-21T08:00:16Z (GMT). No. of bitstreams: 2 Manecki_SM_D_2013.pdf: 16889192 bytes, checksum: d471e9167fa8d4fcd2e879cec3be97df (MD5) Manecki_SM_D_2013_support_1.pdf: 19012 bytes, checksum: 5773cf964b4154e6984a43357e2f9266 (MD5)   Previous issue date: 2013-06-20",
  "format_medium": "ETD",
  "handle": "23250",
  "identifier_other": "vt_gsexam:1247",
  "identifier_uri": "http://hdl.handle.net/10919/23250",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Neutrino Physics",
    "Annual Modulation"
  ],
  "title": "Annual Modulation Measurement of the Low Energy Solar Neutrino Flux with the Borexino Detector",
  "type": "Dissertation"
}