{
  "contributor_author": "Griffin, Kenneth R",
  "contributor_committeechair": [
    "Luxbacher, Kramer Davis",
    "Karmis, Michael E"
  ],
  "contributor_committeemember": [
    "Westman, Erik Christian",
    "Suboleski, Stanley C",
    "Martikainen, Anu Leena",
    "Luttrell, Gerald H",
    "Agioutantis, Zacharias"
  ],
  "contributor_department": "Mining and Minerals Engineering",
  "date_accessioned": "2013-07-11T08:00:30Z",
  "date_available": "2013-07-11T08:00:30Z",
  "date_issued": "2013-07-10",
  "degree_discipline": "Mining Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Explosions of gas and dust continue to be recognized as an extreme danger in underground coal mines and still occur despite significant technological advances. Mining researchers have been attempting to accurately measure and quantify ventilation and gas properties since early mining; however basic monitoring attempts were limited by the available technologies. Recent advancements in monitoring and communication technologies enable comprehensive atmospheric monitoring to become feasible on a mine-wide scale. Atmospheric monitoring systems (AMS) allow operators to monitor conditions underground in real-time. Real-time monitoring enables operators to detect and identify developing high risk areas of the mine, as well as quickly alert mining personnel underground. Real-time monitoring also can determine whether conditions are safe for mining, to operate ventilation systems more efficiently, and to provide an additional layer of monitoring atmospheric conditions underground.<br /><br />AMS utilizes numerous monitoring technologies that will allow underground coal mines to comprehensively monitor gas and ventilation parameters. AMS are utilized worldwide as well as in the United States, and can be modified to cater to specific hazards at different mines. In the United States, AMS are primarily used to monitor belt lines and electrical installations for smoke, CO, and CH4, and to automatically alarm at set thresholds.<br /><br />The research in this study investigates and analyzed AMS across the world (specifically Australia, Canada, and United States). Two case studies presented in Chapter 5 focus on the utilization and implementation of AMS in two underground coal mines in the United States. These case studies identify challenges regarding installation, data management, and analysis of real-time atmospheric monitoring data. The second case study provides significant evidence that correlates mine ventilation fan outages and changes in barometric pressure to increases in methane from previous works. This research does not attempt to quantify data, but intends to provide engineers knowledge to utilize, design, and implement an AMS. Several incident scenarios are simulated using ventilation computer software, as well as the benefits of monitoring in past disasters are analyzed. This research does not intend to place blame, but intends to increase the understanding of utilizing and implementing AMS in underground coal mines.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-07-11T08:00:30Z (GMT). No. of bitstreams: 2 Griffin_KR_D_2013.pdf: 4141278 bytes, checksum: 5e3daca35648b5d64ad27ecc6bd1131b (MD5) Griffin_KR_D_2013_support_1.pdf: 263719 bytes, checksum: 43d1f8959b4e3284ccdec8c2b5425794 (MD5)   Previous issue date: 2013-07-10",
  "format_medium": "ETD",
  "handle": "23299",
  "identifier_other": "vt_gsexam:1317",
  "identifier_uri": "http://hdl.handle.net/10919/23299",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "mining atmospheric monitoring",
    "underground monitoring",
    "mine health and safety",
    "mine explosions"
  ],
  "title": "Utilization and Implementation of Atmospheric Monitoring Systems in United States Underground Coal Mines and Application of Risk Assessment",
  "type": "Dissertation"
}