{
  "contributor_author": "Werner, Timothy Jason",
  "contributor_committeechair": "Davy, Kevin P",
  "contributor_committeemember": [
    "Rivero, Jose M.",
    "Frisard, Madlyn Irene",
    "Davy, Brenda Mueller"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2013-07-25T08:00:07Z",
  "date_available": "2013-07-25T08:00:07Z",
  "date_issued": "2013-07-24",
  "degree_discipline": "Human Nutrition, Foods, and Exercise",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "For more than half a century cardiovascular disease has been the leading cause of death in the United States.  Aging, hypertension, and obesity are major risk factors for cardiovascular disease and clearly associated with arterial stiffness.  Arterial stiffness generates higher afterloads and diminishes coronary perfusion thereby causing ventricular hypertrophy and ischemia.  Importantly, arterial stiffness is an independent predictor of cardiovascular disease risk and all-cause mortality.   Current strategies such as inhibition of angiotensin II or angiotensin converting enzyme, reduction of smooth muscle tone, blood volume, or inflammatory mediators, and improving glucose homeostasis are effective destiffening options.  Nebivolol, a third generation beta-blocker, has unique vasodilatory characteristics and may be particularly efficacious as a destiffening agent.  Only a few studies have addressed this issue while relying on indirect, blood pressure-dependent stiffness indices precluding clear understanding of study outcomes.  There remains a need to determine the potential utility of nebivolol therapy as an arterial destiffening strategy.   Thus, we hypothesized that the combination of nebivolol and lifestyle modification would reduce central arterial stiffness in middle-aged and older hypertensive adults more than either intervention alone.  To test this hypothesis, we randomized 45 hypertensive adults to receive lifestyle modification, nebivolol, or combination for 12 weeks.  Î\"-stiffness index, pulse wave analysis, and arterial compliance were measured at baseline and following the intervention.  No baseline differences in variables of  <br />interest were observed between groups.  In contrast to our hypothesis, lifestyle modification, nebivolol, and combination groups had similar (P>0.05) reductions in beta-stiffness index (-1.87±0.83; -2.03±0.60; and -2.51±0.90 U), respectively, while carotid-femoral pulse wave velocity declined only in the nebivolol and combination groups.   Our findings suggest combination of nebivolol and lifestyle modification reduces arterial stiffness to a similar degree as either intervention alone in middle-aged and older hypertensive adults.  Further studies are needed to determine if the changes in arterial stiffness continue to occur or remain clinically significant over longer durations.<br /><br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-07-25T08:00:07Z (GMT). No. of bitstreams: 1 Werner_TJ_D_2013.pdf: 2516073 bytes, checksum: d274d18daedb324b21b14f02e317620a (MD5)   Previous issue date: 2013-07-24",
  "format_medium": "ETD",
  "handle": "23316",
  "identifier_other": "vt_gsexam:1408",
  "identifier_uri": "http://hdl.handle.net/10919/23316",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "anti-hypertensive",
    "arterial stiffness",
    "beta-blocker"
  ],
  "title": "Effect of Nebivolol and Lifestyle Modification on Large Artery Stiffness in Middle-Aged and Older Hypertensive Adults",
  "type": "Dissertation"
}