{
  "contributor_author": "Barrett, Scott M",
  "contributor_committeechair": [
    "Aust, Wallace M",
    "Bolding, Michael Chad"
  ],
  "contributor_committeemember": [
    "Munsell, John F",
    "Lakel, William A"
  ],
  "contributor_department": "Forest Resources and Environmental Conservation",
  "date_accessioned": "2013-08-02T08:00:09Z",
  "date_available": "2013-08-02T08:00:09Z",
  "date_issued": "2013-08-01",
  "degree_discipline": "Forestry",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Utilization of woody biomass for energy is expected to increase rapidly and logging<br />residues are a likely feedstock to meet increased demands. Potentials for increased biomass<br />utilization have created concerns regarding possible impacts of using logging residues for<br />energy. The overall goals of this project were to characterize biomass harvesting operations and<br />to evaluate potential impacts on soil erosion and implementation of Best Management Practices<br />(BMPs) for water quality on biomass harvesting sites. Results indicate that biomass harvesting<br />was integrated into a wide range of logging businesses. Existing biomass harvesting businesses<br />reported total production levels ranging from 6 to 250 loads per week. The majority (98%) of<br />biomass harvesting operations utilized integrated harvesting techniques where roundwood and<br />fuel chips were produced concurrently. Potential erosion rates and BMP implementation scores<br />were evaluated on ten biomass and ten conventional harvest sites in the Piedmont of Virginia.<br />This study of 20 sites found no significant differences in overall estimated erosion rates between<br />biomass harvests (0.7 tons ac-1 yr-1) and conventional harvests (0.8 tons ac-1 yr-1) (p=0.8282).<br />Additionally, there were no significant differences observed in overall BMP implementation<br />scores for biomass (85.2%) and conventional (81.3%) harvests (p=0.5930). A separate, but<br />related study evaluated BMP implementation over a three year period on 88 biomass and 284<br />conventional harvests in the Piedmont of Virginia. Within the seven logging related BMP categories, only the Streamside Management Zones (SMZs) category had significant differences between biomass (83.1%) and conventional harvests (91.4%) (p=0.0010). Implementation score differences were not caused by insufficient residues for stabilization of bare soil but were apparently the result of operational decisions which resulted in lower implementation of BMPs related to SMZs. Overall, these findings indicate that existing BMPs appear adequate to protect water quality on biomass harvesting operations in the Virginia Piedmont when appropriately implemented.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-08-02T08:00:09Z (GMT). No. of bitstreams: 2 Barrett_SM_D_2013.pdf: 2649986 bytes, checksum: 34c5b3d0e580932c54cc30684ebf3938 (MD5) Barrett_SM_D_2013_support_3.pdf: 492400 bytes, checksum: d149c70478ae79f1fc58f056a496c0aa (MD5)   Previous issue date: 2013-08-01",
  "format_medium": "ETD",
  "handle": "23676",
  "identifier_other": "vt_gsexam:1407",
  "identifier_uri": "http://hdl.handle.net/10919/23676",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "logging residues",
    "biomass harvesting",
    "renewable energy",
    "BMP implementation"
  ],
  "title": "Operational characteristics, erosion potential, and implementation of forestry best management practices on biomass harvesting operations",
  "type": "Dissertation"
}