{
  "contributor_author": "Rishel Elias, Nicole Marie",
  "contributor_committeechair": "Hult, Karen M",
  "contributor_committeemember": [
    "Wamsley, Gary L",
    "Khademian, Anne M",
    "Cook, Brian J"
  ],
  "contributor_department": "School of Public and International Affairs",
  "date_accessioned": "2013-08-02T08:00:15Z",
  "date_available": "2013-08-02T08:00:15Z",
  "date_issued": "2013-08-01",
  "degree_discipline": "Public Administration/Public Affairs",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "In 2013, the United States is becoming increasingly racially and ethnically diverse.  With these demographic changes, attitudes and approaches toward representation are likewise shifting. Public administration scholarship and practice can continue to contribute to this dynamic process of defining representation and crafting initiatives to meet the needs of the public. To do this, social injustices of the past must be addressed through the recognition and valuation of historically-underrepresented groups in public organizations. Yet, much public affairs discourse and numerous policy decisions are rooted in multiculturalism.  The central question this research explores is whether multiculturalism is detrimental to theorizing and to enacting a representative bureaucracy, and if so, why. To answer this question, the work begins with a critical review of the representative bureaucracy, affirmative action, and multiculturalism literatures.  Then, linking these reviews to practice, the study performs a critical discourse analysis of several executive orders and guidance documents from the U.S. Office of Personnel Management to trace how views of representation in U.S. national government agencies changed between 1998 and 2011.  This research finds that a shift from \"Affirmative Action\" to \"Multiculturalism\" occurred.  EOs 13078, 13163, and 13171 were heavily rooted in the Affirmative Action approach, while the 2000 OPM Agency Diversity Guide, EOs 13518 and 13583, and the Government-Wide Diversity and Inclusion Strategic Plan 2011 were anchored in the \"Multicultural\" approach.  Ultimately, this study concludes that multiculturalism poses significant challenges for representative bureaucracy as a result of its lack of clear and explicit definitions and its treatments of differences, especially group-identity classifications.  Rethinking the relationship between representative bureaucracy and multiculturalism and focusing on historically-underrepresented groups hold the potential to contribute to the further attainment of normative goals of bureaucratic representation.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-08-02T08:00:15Z (GMT). No. of bitstreams: 1 Rishel_Elias_NM_D_2013.pdf: 1212325 bytes, checksum: 6835f063f991592acbead7b5759b3eaf (MD5)   Previous issue date: 2013-08-01",
  "format_medium": "ETD",
  "handle": "23677",
  "identifier_other": "vt_gsexam:1464",
  "identifier_uri": "http://hdl.handle.net/10919/23677",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "representative bureaucracy",
    "representation",
    "diversity",
    "multiculturalism",
    "public administration"
  ],
  "title": "Promoting Diversity and Inclusion in the U.S. Federal Workforce: Representative  Bureaucracy and the Challenge of Multiculturalism",
  "type": "Dissertation"
}