{
  "contributor_author": "Kusano, Kristofer Darwin",
  "contributor_committeechair": "Gabler, Hampton C.",
  "contributor_committeemember": [
    "Perez, Miguel A",
    "Hardy, Warren Nelson",
    "Duma, Stefan M.",
    "Madigan, Michael L"
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2013-07-31T08:00:22Z",
  "date_available": "2013-07-31T08:00:22Z",
  "date_issued": "2013-07-30",
  "degree_discipline": "Mechanical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "In order to prevent or mitigate the negative consequences of traffic crashes, automakers are developing active safety systems, which aim to prevent or mitigate collisions.  These systems are expensive to develop and as a result automakers and regulators are motivated to forecast the potential benefits of a proposed safety system before it is widely deployed in the vehicle fleet. The objective of this dissertation was to develop a methodology for predicting fleet-wide benefits for emerging crash avoidance systems as if all vehicles were equipped with a system.  Forward Collision Avoidance Systems (FCAS) were used as an example application of this methodology.<br /><br />The methodology developed for this research includes the following components: 1) identification of the target population, 2) development and validation of a driver model, 3) development of injury risk functions, 4) development of a crash severity reduction model, and 5) computation of fleet-wide benefits.  This dissertation presents a general methodology for each of these components that could be used for any active safety system.  Then a specific model is constructed for FCAS.<br /><br />FCAS could potentially be applicable to 31% of all collisions, 6% of serious injury crashes, and 7% of fatal crashes.  Annually, this accounts for 3.3 million collisions and 18,367 fatal crashes.  We developed a model of driver braking in response to a forward collision warning. Next we used logistic regression to develop injury risk functions that predicted the probability of injury given the crash severity (\"V) and occupant characteristics.  Finally, we simulated 2,459 real-world rear-end collisions as if the driver had an FCAS with combinations of warnings, brake assist, and autonomous braking.  We found that between 3.4% and 7.2% of crashes could be prevented and that many more could be mitigated in severity.  These systems reduced the number of injured (MAIS2+) drivers in rear-end collisions between 32% and 55%.  In total, the systems could prevent between $184 and $338 million in economic costs associated with crashes per year.  <br />",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-07-31T08:00:22Z (GMT). No. of bitstreams: 1 Kusano_KD_D_2013.pdf: 2069272 bytes, checksum: d7d46ec045b7c0aa24ebf7aea9605136 (MD5)   Previous issue date: 2013-07-30",
  "format_medium": "ETD",
  "handle": "23672",
  "identifier_other": "vt_gsexam:1417",
  "identifier_uri": "http://hdl.handle.net/10919/23672",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Vehicle Safety",
    "Active Safety",
    "Crash Avoidance",
    "Crash Database",
    "Injury Risk"
  ],
  "title": "Methodology for Determining Crash and Injury Reduction from Emerging Crash Prevention Systems in the U.S.",
  "type": "Dissertation"
}