{
  "contributor_author": "Baral, Ranju",
  "contributor_committeechair": "Davis, George C",
  "contributor_committeemember": [
    "Serrano, Elena L",
    "Skaggs, Gary E.",
    "Mills, Bradford F",
    "You, Wen"
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2013-08-06T08:00:16Z",
  "date_available": "2013-08-06T08:00:16Z",
  "date_issued": "2013-08-05",
  "degree_discipline": "Economics, Agriculture and Life Sciences",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The Expanded Food and Nutrition Education Program (EFNEP) is one of the largest efforts of the US Department of Agriculture (USDA) to promote healthy dietary behavior practices among the low income adults and youths in the US. Although the program is shown to be effective in achieving its stated goals, the cost effectiveness of the money spent on EFNEP remains largely unknown. This dissertation analyzes the costs and effectiveness of the EFNEP, and is organized in three essays. The first essay investigates the effectiveness of the adult EFNEP and evaluates the returns to scale on the money spent in this program by utilizing an indirect production function approach. Results indicate that the program has increasing returns to scale at the National level, although a significant variation exists across the states. The second essay develops a framework for conducting the cost effectiveness analysis (CEA) for the youth EFNEP. The CEA framework is then applied to the data from Virginia youth EFNEP to estimate the cost effectiveness ratio (CER). The CER is estimated to be about $75 per behavior improvement. The third essay examines the outcomes and the attributes of the youth EFNEP program using the Rasch model type measurement model.  Findings suggest that the youth EFNEP is effective in achieving its stated program goals. In addition, the program related characteristics are found to be important attributes of effective programs. Overall, this dissertation has important policy implications for improving the (cost) effectiveness of nutrition education programs. \"",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-08-06T08:00:16Z (GMT). No. of bitstreams: 2 Baral_R_D_2013.pdf: 1778226 bytes, checksum: 30895a094ebab915ab17bcdd835ae6f4 (MD5) Baral_R_D_2013_support_1.pdf: 1477979 bytes, checksum: 44775f867bccce75a12126379c39472a (MD5)   Previous issue date: 2013-08-05",
  "format_medium": "ETD",
  "handle": "23686",
  "identifier_other": "vt_gsexam:1285",
  "identifier_uri": "http://hdl.handle.net/10919/23686",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Expanded Food and Nutrition Education Program",
    "cost effectiveness"
  ],
  "title": "Evaluating Cost Effectiveness of the USDA\\'s Expanded Food and Nutrition Education Program",
  "type": "Dissertation"
}