{
  "contributor_author": "Skelding-Dills, Kathleen Ann",
  "contributor_committeechair": "Tripp, Norman Wayne",
  "contributor_committeemember": [
    "Chisom, Jessica E.",
    "Cash, Carol S",
    "Sellers, James Louis"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-08-10T08:00:13Z",
  "date_available": "2013-08-10T08:00:13Z",
  "date_issued": "2013-08-09",
  "degree_discipline": "Educational Leadership and Policy Studies",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "Response to Intervention\\'s (RtI) original design was implemented as a kindergarten through third grade intervention for struggling readers. Therefore, it is difficult to conceptualize RtI as an intervention model to be used for high school students. Nevertheless, high schools have adopted RtI as an intervention model. <br />The purpose of the study was to investigate and describe how one high school implemented RtI. The researcher utilized qualitative research methods to conduct the study. The two overarching research questions for the study were: Were the essential components of Response to Intervention implemented in this high school? Was the Response to Intervention framework implemented with fidelity? <br />Research-based practices found in the literature that have influenced the implementation of RtI were (a) a structured focus on prevention for academic failures, (b) the use of the suggested RtI model consistently and with fidelity, and (c) a strong consideration for adoption of the suggested framework using the essential components of RtI (RtI Action Network, 2013).  The essential components of RtI found in the literature were universal screening, data collection, progress monitoring, a problem solving team, data-based decision making, and evidence-based interventions. The study attempted to determine if the high school implemented the essential components of RtI with fidelity, defined as \"implemented RtI as it was intended by the program developers\" (Mellard & Johnson, 2008, p. 240).  <br />The study found that not all essential components of RtI were implemented with fidelity in the high school. All participants interviewed stated that the screening tools that were being utilized were not screening tools that were described in the literature. Participants identified the use of data collection and progress monitoring, but did not express a consistency in the practices. Because these two components were not implemented consistently, participants noted that the three-tiered system lacked evidence-based practices and interventions. Based on the participants\\' responses, the researcher concluded that the high school\\'s implementation of RtI lacked fidelity. Through review of CHD High School\\'s historical records, it appeared that the implementation of RtI only provided a minimal amount of improvement in students\\' academic grades, dropout rate, and standard assessments scores. Implications and recommendations for practice and future research are offered in Chapter 5. <br />\"<br />",
  "description_degree": "EDD",
  "description_provenance": "Made available in DSpace on 2013-08-10T08:00:13Z (GMT). No. of bitstreams: 1 Skelding-Dills_KA_T_2013.pdf: 794829 bytes, checksum: 94c8110b2b78bdae64a071742b9de897 (MD5)   Previous issue date: 2013-08-09",
  "format_medium": "ETD",
  "handle": "23695",
  "identifier_other": "vt_gsexam:1352",
  "identifier_uri": "http://hdl.handle.net/10919/23695",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": "Secondary Response To Intervention (RtI)",
  "title": "Response to Intervention (RtI) in a High School: A Case Study of Implementation",
  "type": "Dissertation"
}