{
  "contributor_author": "Muslim, Khoirul",
  "contributor_committeechair": "Nussbaum, Maury A",
  "contributor_committeemember": [
    "Lockhart, Thurmon E.",
    "Madigan, Michael L",
    "Agnew, Michael J"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2013-08-28T08:00:20Z",
  "date_available": "2013-08-28T08:00:20Z",
  "date_issued": "2013-08-27",
  "degree_discipline": "Industrial and Systems Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "There is a high prevalence of musculoskeletal symptoms (MSS) among manual material handling (MMH) workers.  However, limited investigations have been undertaken among one large group of workers using a particular MMH method called traditional posterior load carriage (PLC).  Such load carriage is typically done without the use of an assistive device (e.g., backpack) in developing countries, and involves exposure to known risk factors for MSS such as heavy loads, non-neutral postures, and high levels of repetition.  The current work was completed to investigate the characteristics of the PLC task and physical effects on workers, and to evaluate a practical intervention that may help improve the task.  The first study investigated, through structured interviews with 108 workers, the types, prevalence, and impacts of MSS.  PLC workers incur a relatively high MSS burden, primarily in the lower back, but also in the feet, knees, shoulders, and neck.  These MSS were reported to interfere with daily activity, but only few workers sought medical treatment.  Workers suggested several task improvements including the use of a belt, hook, or backpack/frame, and changes in the carriage method.  The second and third study investigated, in a laboratory setting involving nine healthy males, the effects of load mass and size, and the use of a simple intervention, respectively, on factors related to low back pain risks during PLC.  Increasing load mass caused increased torso flexion, lumbosacral flexion moment, abdominal muscle activity, and torso movement stability in the frontal plane.  Increasing load size also caused higher torso flexion, peak torso angular velocity and acceleration, and abdominal muscle activity.  Complex interactive effects of load mass and size were found on paraspinal muscle activity and slip risk.  The intervention, involving a simple frame to support a load, and use with a higher load placement was found to be potentially beneficial as indicated by reduced lumbosacral moment and ratings of perceived discomfort in several anatomical regions compared to the traditional PLC.  Outcomes of this research can facilitate future ergonomic guidelines and interventions to improve working conditions and occupational health and safety for PLC workers.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-08-28T08:00:20Z (GMT). No. of bitstreams: 1 Muslim_K_D_2013.pdf: 6060612 bytes, checksum: 6dfbfa01a0267ad7d59fc2f0382c6069 (MD5)   Previous issue date: 2013-08-27",
  "format_medium": "ETD",
  "handle": "23726",
  "identifier_other": "vt_gsexam:1587",
  "identifier_uri": "http://hdl.handle.net/10919/23726",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": "Traditional load carriage; low back pain; spine; kinematics; kinetics; intervention",
  "title": "Traditional Posterior Load Carriage: Ergonomic Assessment and Intervention Efficacy",
  "type": "Dissertation"
}