{
  "contributor_author": "Webster, Courtney Ann",
  "contributor_committeechair": "Nussbaum, Maury A",
  "contributor_committeemember": [
    "Madigan, Michael L",
    "Agnew, Michael J",
    "Duma, Stefan M.",
    "Gabler, Hampton C."
  ],
  "contributor_department": "Biomedical Engineering",
  "date_accessioned": "2013-08-30T08:00:38Z",
  "date_available": "2013-08-30T08:00:38Z",
  "date_issued": "2013-08-29",
  "degree_discipline": "Biomedical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Ankle sprains are among the most common injuries for participants in running and jumping sports. Following an initial sprain injury, many (30-40%) will develop chronic ankle instability (CAI), characterized by a perception of instability and repeated sprain injuries. Quasi-static test methods indicate poor postural stability and joint position sense (JPS) as associated motor control deficits. Little research, though, has investigated ankle motor control under dynamic (simulated sport) or fatigue conditions. To better understand factors contributing to the increased sprain rate in adults with CAI, three studies were completed investigating the roles of running speed, fatigue, and ankle bracing on motor control in adults with CAI.  First, two groups with and without ankle instability performed dynamic athletic maneuvers at each of two running speeds. Joint kinematics and kinetics were measured to identify differences in motor control strategies. Participants also completed two quasi-static tests (JPS and single leg drop landings). The level of correspondence between quasi-static and dynamic test methods was of particular interest. A second study compared fatigue development and fatigue adaptations when executing single leg drop landings. Strength loss and ratings of perceived exertion measured fatigue development, and joint kinematics, kinetics, and muscle activation quantified drop landing performance. A final study examined whether ankle braces, a common treatment for ankle sprains, retained their effectiveness when an athlete was fatigued. JPS and ankle stiffness were measured before and after a fatigue protocol while using each of three brace conditions.  Overall, results indicated that adults with CAI exhibit distinct adaptations to changes in speed and to fatigue that may increase their risk for ankle reinjury. Specific changes, however, depended on the particular activity being performed. Single leg drop landing kinematics may be a good representation of kinematics during dynamic athletic performance. Neither test brace improved JPS following fatigue, but each may be effective in providing mechanical stiffness compared to an unbraced condition. The effectiveness of a particular test brace, however, may be gender-specific. Future work should focus on identifying the benefits of different braces under broader conditions to help inform brace selection.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-08-30T08:00:38Z (GMT). No. of bitstreams: 2 Webster_CA_D_2013.pdf: 2553700 bytes, checksum: 5408628caed0e1c27ccd1b2fa2b9d055 (MD5) Webster_CA_D_2013_support_1.pdf: 106839 bytes, checksum: d54b7528ebbfe20eaf8542f10ed6194d (MD5)   Previous issue date: 2013-08-29",
  "format_medium": "ETD",
  "handle": "23733",
  "identifier_other": "vt_gsexam:1498",
  "identifier_uri": "http://hdl.handle.net/10919/23733",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "chronic ankle instability",
    "fatigue",
    "bracing",
    "kinetics",
    "kinematics",
    "joint position sense",
    "stiffness"
  ],
  "title": "Effects of Running Speed, Fatigue, and Bracing on Motor Control of Chronically Unstable Ankles",
  "type": "Dissertation"
}