{
  "contributor_author": "Hwang, Kwang Seon",
  "contributor_committeechair": "Jensen, Laura Smietanka",
  "contributor_committeemember": [
    "Roberts, Patrick S",
    "Hult, Karen M",
    "Dull, Matthew Martin"
  ],
  "contributor_department": "School of Public and International Affairs",
  "date_accessioned": "2013-09-03T08:00:33Z",
  "date_available": "2013-09-03T08:00:33Z",
  "date_issued": "2013-09-02",
  "degree_discipline": "Public Administration/Public Affairs",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Performance management is prevalent in public organizations and public services, but the push for performance may harm genuine accountability. One critical reason for this is that little knowledge has developed about the scope and effect of actual accountability requirements in the public management field. This dissertation furthers our understanding of accountability and performance by distinguishing them as different dimensions of public management. Building on this distinction, the effect of accountability (A) on performance (P) and accountability management’s (M) mediating role in the relationship between accountability and performance were investigated empirically in child welfare services in Virginia. The study had two stages: interviews and a survey. The qualitative content analysis of the interviews provides several noteworthy findings. Accountability can be understood more with the terms: explanation, expectation, people/society, action/decision, and values. Conversely, performance can be considered more in line with the terms: productivity/outcome, timely work, team playing, learning, and strategy. The incompatible characteristics found between accountability and performance highlight problems behind performance-driven accountability. The survey portion of the study, built upon the interview data, also presents notable findings. (1) Accountability affects performance both directly and indirectly, and (2) accountability management matters in the relationship between accountability and performance. While the empirical literature on the A → P link focuses on the effects of competing accountability requirements, my study examines dimensions of the accountability requirements’ impact. Formal (e.g., legal) as well as informal (e.g., ethical) accountability requirements are critical for ensuring higher performance. Compliance strategies implicitly connect informal accountability requirements with work performance. The findings support the study’s argument that accountability should be stressed for better performance and highlight the need for the careful design of accountability mechanisms in social services. Ultimately, this study may serve as a foundation for future efforts to establish more appropriate accountability and performance arrangements.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-09-03T08:00:33Z (GMT). No. of bitstreams: 1  Hwang_K_D_2013.pdf: 3015159 bytes, checksum: a1a4bf19fed13a6fe17f4fe5bbddf951 (MD5)    Previous issue date: 2013-09-02",
  "format_medium": "ETD",
  "handle": "23743",
  "identifier_other": "vt_gsexam:1522",
  "identifier_uri": "http://hdl.handle.net/10919/23743",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Accountability",
    "Performance",
    "Accountability Management",
    "Public Organization",
    "Public Management",
    "Street-level Bureaucracy"
  ],
  "title": "The Impact of Accountability and Accountability Management on Performance at the Street Level",
  "type": "Dissertation"
}