{
  "contributor_author": "Edmonds, Bartlett D",
  "contributor_committeechair": "Arav, Nahum",
  "contributor_committeemember": [
    "Sharpe, Eric R",
    "Pitt, Mark L",
    "Simonetti, John H"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2013-09-11T08:00:21Z",
  "date_available": "2013-09-11T08:00:21Z",
  "date_issued": "2013-09-10",
  "degree_discipline": "Physics",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Active galactic nuclei (AGN) ubiquitously show outflows. It is now widely recognized that these outflows are key components in the evolution of super-massive black holes and their host galaxies. As important as these outflows are, we still lack sufficient understanding of their structure and energetics. The majority of the work presented in this thesis involved photoionization modeling of AGN outflows along with analysis of density diagnostics in order to determine the distances and energetics of observed outflows. The main findings of these analyses are that 1) outflows are often at distances of hundreds to thousands of parsecs from the central supermassive black hole and 2) quasars outflows can be sufficiently powerful to provide feedback in galactic evolution scenarios. We also find in some cases that the recombination timescales of metal ions are long compared with the flux variability timescales. The large distances we find provide a challenge to current outflow models. For example, these outflows cannot be connected with an accretion disk surrounding the supermassive black hole as assumed in some models. Furthermore, the outflows may be out of equilibrium as we find in Mrk 509. In this case, a thorough understanding of time-dependent photoionization effects is necessary. In this thesis, I include early steps toward understanding time-dependent photoionization as well as ionization studies of accretion disk winds. The main results of these theoretical studies is that 1) the appearance of multiple ionization components in an outflow can be an artifact of the incorrect assumption that the outflow is in ionization equilibrium and 2) the shielding gas required in accretion-disk-wind models should have a clear signature in UV spectra, but none has been observed to date.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-09-11T08:00:21Z (GMT). No. of bitstreams: 2 Edmonds_BD_D_2013.pdf: 2467142 bytes, checksum: 3e594ab1a14f58b88adefc2ebb312303 (MD5) Edmonds_BD_D_2013_support_1.pdf: 223845 bytes, checksum: ac9cc5115911244190ad3ae74424e0f5 (MD5)   Previous issue date: 2013-09-10",
  "format_medium": "ETD",
  "handle": "23767",
  "identifier_other": "vt_gsexam:1594",
  "identifier_uri": "http://hdl.handle.net/10919/23767",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Active galactic nuclei",
    "AGN outflows",
    "Quasar",
    "Quasar outflow",
    "Seyfert galaxies"
  ],
  "title": "On the Distances and Energetics of AGN Outflows",
  "type": "Dissertation"
}