{
  "contributor_author": "Jaramillo Sierra, Ana L",
  "contributor_committeechair": "Allen, Katherine R",
  "contributor_committeemember": [
    "Dolbin-MacNab, Megan Leigh",
    "Falconier, Mariana",
    "Kaestle, Christine"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2013-09-17T08:00:15Z",
  "date_available": "2013-09-17T08:00:15Z",
  "date_issued": "2013-09-16",
  "degree_discipline": "Human Development",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The present study investigated how young women \"do\" and \"undo\" gender in relation to their anger in romantic relationships.  With this aim, I conducted in-depth interviews with 24 young women between the ages of 18 and 25.  I interviewed participants about the characteristics of their current romantic relationships and their experiences of anger in this context.  I used a constructivist grounded theory methodology involving open, axial, and theoretical coding to analyze the data collected through the interviews.  My analysis suggested an emerging theory of young women\\'s anger in romantic relationships involving 5 categories, 16 sub-categories, and 4 types.  Overall, the findings suggest young women experience contradictions about their power in romantic relationships and variability across events in how they \"do\" and \"undo\" gender in relation to their anger in romantic relationships.  The findings also confirm that for most young women, their power in romantic relationships is associated with how women relate to, understand and express their anger.  The emerging theory of women\\'s anger in romantic relationships provides a tool for further research on anger in the context of romantic relationships and a set of guidelines for clinicians to assess young women\\'s anger in romantic relationships.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-09-17T08:00:15Z (GMT). No. of bitstreams: 4 Jaramillo_Sierra_AL_D_2013.pdf: 1101647 bytes, checksum: f7251d507f0982cf83da521e29d1896b (MD5) Jaramillo_Sierra_AL_D_2013_support_1.pdf: 3664 bytes, checksum: 465437294f6081e5d9e02371f4e17daf (MD5) Jaramillo_Sierra_AL_D_2013_support_3.pdf: 421506 bytes, checksum: 046d187f48d4c9cece536bd969fb0834 (MD5) Jaramillo_Sierra_AL_D_2013_support_4.pdf: 421774 bytes, checksum: ae1fa7a6a2d83d13d1cc42dac826299a (MD5)   Previous issue date: 2013-09-16",
  "format_medium": "ETD",
  "handle": "23793",
  "identifier_other": "vt_gsexam:1639",
  "identifier_uri": "http://hdl.handle.net/10919/23793",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "women's anger",
    "romantic relationships",
    "gender",
    "emerging adulthood"
  ],
  "title": "Young Women\\'s Anger in Romantic Relationships",
  "type": "Dissertation"
}