{
  "contributor_author": "Maiden, Brian Scott",
  "contributor_committeechair": "Brott, Pamelia E.",
  "contributor_committeemember": [
    "Day-Vines, Norma L.",
    "Murphy, Pamela F.",
    "Lambert, Simone F."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-10-04T08:00:08Z",
  "date_available": "2013-10-04T08:00:08Z",
  "date_issued": "2013-10-03",
  "degree_discipline": "Counselor Education",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The purpose of this qualitative study was to explore the lived experiences of adolescent fathers in a suburban environment in Northern Virginia. Specifically, phenomenological methods were used to capture the essence of these nine adolescent fathers\\' experiences surrounding their conceptualization and enactment of fatherhood. Participants included 5 Hispanic (56%), 2 African-American (22%), 1 Caucasian (11%), and 1 Asian (11%). They ranged in age from 16 to 19 years of age with an average age of 18. Their perspective adds to the current literature and assists counselors and policy makers in gaining a greater understanding of the needs and perceptions of this marginalized group. A transformative process best described the lived experience of these adolescent fathers. Fatherhood was described as a life-changing event, as they traversed a range of negative behaviors to become actively involved fathers. An eco- constructivist model provided an appropriate framework to better understand the subjective meanings the adolescent fathers attached to their lived experiences throughout the transformative process. While the results cannot be generalized, the narratives of these participants provide insight into this marginalized population. These participants define fatherhood in traditional terms (i.e., father as primary provider) and expressed enthusiasm about being actively involved in their children\\'s daily lives. Further, the majority expressed a renewed focus on educational attainment to provide a better future for themselves and their children. Although participants received assistance from their families, support was lacking from the educational system. This lack of support provides an avenue for communities, schools, and counselors to become advocates for adolescent fathers. School counselors are encouraged to reach out to community agencies, clinical mental heath counselors, and community college counselors as avenues for more complete services for adolescent fathers. There is a need for further research relating to the needs of adolescent fathers. Longitudinal research with these participants is necessary to ascertain how they enacted their conceptualization of fatherhood and the barriers they encountered.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-10-04T08:00:08Z (GMT). No. of bitstreams: 1  Maiden_BS_D_2013.pdf: 918163 bytes, checksum: 41b72f7f7e3af66ae5464b54684bce43 (MD5)    Previous issue date: 2013-10-03",
  "format_medium": "ETD",
  "handle": "23868",
  "identifier_other": "vt_gsexam:1636",
  "identifier_uri": "http://hdl.handle.net/10919/23868",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "adolescent fathers",
    "fatherhood",
    "phenomenology"
  ],
  "title": "The Lived Experiences of the Adolescent Father in Northern Virginia",
  "type": "Dissertation"
}