{
  "contributor_author": "Pereira, Junia M",
  "contributor_committeechair": "Edgar, Kevin J",
  "contributor_committeemember": [
    "Taylor, Lynne S.",
    "Roman, Maren",
    "Riffle, Judy S",
    "Sriranganathan, Nammalwar"
  ],
  "contributor_department": "Learning Sciences and Technologies",
  "date_accessioned": "2013-10-08T08:00:09Z",
  "date_available": "2013-10-08T08:00:09Z",
  "date_issued": "2013-10-07",
  "degree_discipline": "Macromolecular Science and Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Pullulan is a non-ionic water-soluble polysaccharide which is produced from starch by the yeast-like fungus Aureobasidium pullulans. Pullulan is known for its non-toxicity and biocompatibility. Most pullulan modifications are intended to reduce its water solubility or to introduce charged or reactive groups for functionality. Polysaccharides that have been hydrophobically modified and contain carboxyl groups are commonly used in drug delivery systems because of their ability to provide pH-controlled drug release. We demonstrated in this dissertation the regioselective synthesis of a range of 6-carboxypullulan ethers that are promising anionic derivatives for drug delivery applications. These compounds have also shown impressive surfactant properties. Another class of pullulan derivatives was synthesized by regioselective introduction of amine and amide groups to the pullulan backbone. These chemical groups are known to play a fundamental role in the biological activity of important polysaccharides, such as chitin and chitosan, therefore, the pullulan derivatives synthesized herein, which are structural isomers of those polymers, possess great potential for biomedical applications.  Clarithromycin (CLA) is an aminomacrolide antibiotic whose physical properties are fascinating and challenging. It has very poor solubility at neutral intestinal pH, but much higher solubility under acidic conditions. Therefore, CLA dissolves better in the stomach than in the small intestine; but CLA is also quite labile towards acid-catalyzed degradation. We report herein a study on amorphous solid dispersion (ASD) of CLA with promising carboxyl-containing cellulose derivatives, both as macro and nanoparticles. This approach was intended to improve CLA solubility in neutral media, to protect it from acid degradation, and thereby increase its uptake from the small intestine and ultimately its bioavailability.  We have also prepared ASDs of selected anti-HIV drugs, ritonavir (RTV), efavirenz (EFV) and etravirine (ETR) with the cellulosic derivative carboxymethyl cellulose acetate butyrate (CMCAB). This polymer was efficient in stabilizing RTV and EFV in their amorphous form in the solid phase and all ASDs provided significant enhancement of drug solution concentration.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-10-08T08:00:09Z (GMT). No. of bitstreams: 2  Pereira_JM_D_2013.pdf: 5223011 bytes, checksum: d4579ca18f5e7fddf5128eb6ce857fd4 (MD5)  Pereira_JM_D_2013_support_1.pdf: 129331 bytes, checksum: dd71e97df142487cc25974257f3130f9 (MD5)    Previous issue date: 2013-10-07",
  "format_medium": "ETD",
  "handle": "23884",
  "identifier_other": "vt_gsexam:1585",
  "identifier_uri": "http://hdl.handle.net/10919/23884",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "polysaccharides",
    "regioselective",
    "oxidation",
    "amphiphilic",
    "Staudinger reaction",
    "amorphous solid dispersion",
    "clarithromycin",
    "HIV drugs"
  ],
  "title": "Synthesis of New Pullulan Derivatives for Drug Delivery",
  "type": "Dissertation"
}