{
  "contributor_author": "Zhao, Xiaoping",
  "contributor_committeechair": [
    "Wokutch, Richard E",
    "Carlson, Kevin D"
  ],
  "contributor_committeemember": [
    "Gnyawali, Devi R",
    "Hatfield, Donald E"
  ],
  "contributor_department": "Management",
  "date_accessioned": "2013-10-09T08:00:16Z",
  "date_available": "2013-10-09T08:00:16Z",
  "date_issued": "2013-10-08",
  "degree_discipline": "Business, Management",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Building on the logic of issue selling, my dissertation explores the micro-processes of shareholder social activism through which shareholders interact with targeted firms and also addresses which micro-processes could affect the effectiveness and the success of shareholder social activism. To do this, my dissertation develops a theory with respect to the approaches of linguistically framing the contents of and of presenting shareholder social activism. Based on a qualitative (descriptive) analysis on 1,612 shareholder social proposals, my dissertation identifies six packaging strategies that are used by the proponents to linguistically frame the contents of their proposals and two selling strategies used by the proponents to present their proposals. Subsequently, a quantitative analysis demonstrates that the effectiveness of shareholder social proposals would be largely determined by the joint effects of opportunity framing, threat framing, coalition building, and repeated submitting and that other packaging strategies would have little unique contribution to the effectiveness and the success of shareholder social activism. I argue that my dissertation would make contributions to the understanding of shareholder social activism and also offer some theoretical considerations for future studies on issue selling, although my dissertation might not directly contribute to the body of work of issue selling.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-10-09T08:00:16Z (GMT). No. of bitstreams: 1  Zhao_X_D_2013.pdf: 1964431 bytes, checksum: 335ab36894050cf0142fc24de0d5d473 (MD5)    Previous issue date: 2013-10-08",
  "format_medium": "ETD",
  "handle": "23887",
  "identifier_other": "vt_gsexam:1645",
  "identifier_uri": "http://hdl.handle.net/10919/23887",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": "Shareholder social activism; shareholder social proposal; issue selling; issue packaging; issue framing; issue presenting.",
  "title": "Investigating Shareholder Social Activism From an Issue-Selling Perspective—Issues, Strategies, and Success",
  "type": "Dissertation"
}