{
  "contributor_author": "Grandelli, Heather Eilenfield",
  "contributor_committeechair": [
    "Kiran, Erdogan",
    "Whittington, Abby Rebecca"
  ],
  "contributor_committeemember": [
    "Martin, Stephen Michael",
    "Edgar, Kevin J",
    "Moore, Robert Bowen"
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2013-10-11T08:00:29Z",
  "date_available": "2013-10-11T08:00:29Z",
  "date_issued": "2013-10-10",
  "degree_discipline": "Chemical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "New methods for the preparation of porous biomedical scaffolds have been explored for applications in tissue engineering and drug delivery.  Scaffolds with controlled pore morphologies have been generated which incorporate cyclodextrin-drug inclusion complexes as the drug delivery component.  Supercritical CO2 was explored as the main processing fluid in the complex formation and in the foaming of the polymer scaffold.  The co-solvents, ethanol, ethyl acetate and acetone, were explored in each stage, as needed, to improve the solvent power of CO2.      The first goal was to promote cyclodextrin-drug complex formation.  Complex formation by traditional methods was compared with complex formation driven by processing in supercritical CO2.  Complex formation was promoted by melting the drug in supercritical CO2 or in CO2 + co-solvent mixtures while in the presence of cyclodextrin.  Some drugs, such as piroxicam, are prone to degradation near the drug's ambient melting temperature.  However, this approach using CO2 was found to circumvent drug thermal degradation, since drug melting temperatures were depressed in the presence of CO2.      The second goal was to produce porous polymeric matrices to serve as tissue engineering scaffolds.  Poly(lactide-<i>co</i>-glycolide) and poly(ε-caprolactone) were investigated for foaming, since these biomedical polymers are already commonly used and FDA approved.  Polymer foaming with CO2 is an alternative approach to conventional solvent-intensive methods for porosity generation.  However, two major limitations of polymer foaming using CO2 as the only processing fluid have been reported, including the formation of a non-porous outer skin upon depressurization and limited pore interconnectivity.  Approaches to circumvent these limitations include the use of a co-solvent and controlling depressurization rates.  The effect of processing parameters, including foaming temperatures and depressurization rate, as well as co-solvent addition, were examined in polymer foaming using CO2.  Drug release dynamics were compared for foams incorporated with either pure drug, cyclodextrin-drug physical mixture or cyclodextrin-drug complex.  Pore morphology, polymer choice and drug release compound choice were found to alter drug release profiles.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-10-11T08:00:29Z (GMT). No. of bitstreams: 4  Grandelli_HE_D_2013.pdf: 14243351 bytes, checksum: e5eaa12b238ce244e6b3dfbcc2f4eecb (MD5)  Grandelli_HE_D_2013_support_1.pdf: 231543 bytes, checksum: 2613668d4d0b92a4933eb1e4b9279cf9 (MD5)  Grandelli_HE_D_2013_support_3.pdf: 236818 bytes, checksum: 26afbca88f8f6846960a55f60ea30630 (MD5)  Grandelli_HE_D_2013_support_4.pdf: 225631 bytes, checksum: e7cdd079bf28e2356b9265a5d5276d46 (MD5)    Previous issue date: 2013-10-10",
  "format_medium": "ETD",
  "handle": "23891",
  "identifier_other": "vt_gsexam:1638",
  "identifier_uri": "http://hdl.handle.net/10919/23891",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Supercritical carbon dioxide",
    "cyclodextrin inclusion compounds",
    "poly(lactide-co-glycolide)",
    "polycaprolactone",
    "foaming"
  ],
  "title": "Formation of Cyclodextrin-Drug Inclusion Compounds and Polymeric Drug Delivery Systems using Supercritical Carbon Dioxide",
  "type": "Dissertation"
}