{
  "contributor_author": "Afzal, Nasrin",
  "contributor_committeechair": "Pleimling, Michel Jean",
  "contributor_committeemember": [
    "Sharpe, Eric R",
    "Robinson, Hans",
    "Khodaparast, Giti"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2013-10-17T15:19:38Z",
  "date_available": "2013-10-17T15:19:38Z",
  "date_issued": "2013-04-27",
  "degree_discipline": "Physics",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Recent years have seen remarkable progress in our understanding of physical aging in nondisordered systems with slow, i.e. glassy-like dynamics. In many systems a single dynamical length L(t), that grows as a power-law of time t or, in much more complicated cases, as a logarithmic function of t, governs the dynamics out of equilibrium. In the aging or dynamical scaling regime, these systems are best characterized by two-times quantities, like dynamical correlation and response functions, that transform in a specific way under a dynamical scale transformation. The resulting dynamical scaling functions and the associated non-equilibrium exponents are often found to be universal and to depend only on some global features of the system under investigation. We discuss three different types of systems with simple and complex aging properties, namely reaction diffusion systems with a power growth law, driven diffusive systems with a logarithmic growth law, and a non-equilibrium polymer network that is supposed to capture important properties of the cytoskeleton of living cells. For the reaction diffusion systems, our study focuses on systems with reversible reaction diffusion and we study two-times functions in systems with power law growth. For the driven diffusive systems, we focus on the ABC model and a related domain model and measure two- times quantities in systems undergoing logarithmic growth. For the polymer network model, we explain in some detail its relationship with the cytoskeleton, an organelle that is responsible for the shape and locomotion of cells. Our study of this system sheds new light on the non- equilibrium relaxation properties of the cytoskeleton by investigating through a power law growth of a coarse grained length in our system.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-10-17T15:19:38Z (GMT). No. of bitstreams: 6 Afzal_N_D_2013.pdf: 5710289 bytes, checksum: 4f78102dbed29d8c7a3a6d4589af33cf (MD5) Afzal_N_D_2013_support_1.pdf: 107556 bytes, checksum: 2ae28400f32861b15197c4101c551920 (MD5) Afzal_N_D_2013_support_3.pdf: 92637 bytes, checksum: f8b4c3cc3e0662a34ceddc4113a2d583 (MD5) Afzal_N_D_2013_support_4.pdf: 159880 bytes, checksum: c428673d58760da48109c88cce254b4b (MD5) Afzal_N_D_2013_support_5.pdf: 62907 bytes, checksum: 56953daf2452a63c74cb78730094db13 (MD5) Afzal_N_D_2013_support_6.pdf: 62907 bytes, checksum: 56953daf2452a63c74cb78730094db13 (MD5)   Previous issue date: 2013-04-27",
  "format_medium": "ETD",
  "handle": "23901",
  "identifier_other": "vt_gsexam:637",
  "identifier_uri": "http://hdl.handle.net/10919/23901",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Equilibrium and Non-Equilibrium Statistical Physics",
    "Soft Matter",
    "Polymer Physics",
    "Aging in Biophysics",
    "Driven Diffusive Systems"
  ],
  "title": "Aging processes in complex systems",
  "type": "Dissertation"
}