{
  "contributor_author": "Sheth, Swapnil Suhas",
  "contributor_committeechair": "Marand, Herve",
  "contributor_committeemember": [
    "Moore, Robert Bowen",
    "Esker, Alan R",
    "Turner, Sam Richard"
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2013-10-18T08:00:33Z",
  "date_available": "2013-10-18T08:00:33Z",
  "date_issued": "2013-10-17",
  "degree_discipline": "Chemistry",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Narrow molecular weight fractions of Poly(ε-caprolactone) were successfully obtained using the successive precipitation fractionation technique with toluene/n-heptane as a solvent/nonsolvent pair. Calorimetric studies of the melting behavior of fractions that were crystallized either isothermally or under constant cooling rate conditions suggested that the isothermal crystallization of the samples should be used for a proper evaluation of the molecular weight dependence of the observed melting temperature and degree of crystallinity in PCL. The molecular weight and temperature dependence of the spherulitic growth rate of fractions was studied in the context of the Lauritzen-Hoffman two-phase model and the Strobl three-phase model of polymer crystallization. The zero-growth rate temperatures, determined from spherulitic growth rates using four different methods, are consistent with each other and increase with chain length. The concomitant increase in the apparent secondary nucleation constant was attributed to two factors. First, for longer chains there is an increase in the probability that crystalline stems belong to loose chain-folds, hence, an increase in fold surface free energy. It is speculated that the increase in loose folding and resulting decrease in crystallinity with increasing chain length are associated with the ester group registration requirement in PCL crystals. The second contribution to the apparent nucleation constant arises    from chain friction associated with segmental transport across the melt/crystal interface. These factors were responsible for the much stronger chain length dependence of spherulitic growth rates at fixed undercooling observed here with PCL than previously reported for PE and PEO. In the case of PCL, the scaling exponent associated with the chain length dependence of spherulitic growth rates exceeds the upper theoretical bound of 2 predicted from the Brochard-DeGennes chain pullout model. Observation that zero-growth and equilibrium melting temperature values are identical with each other within the uncertainty of their determinations casts serious doubt on the validity of Strobl three-phase model.   A novel method is proposed to determine the Porod constant necessary to extrapolate the small angle X-ray scattering intensity data to large scattering vectors. The one-dimensional correlation function determined using this Porod constant yielded the values of lamellar crystal thickness, which were similar to these estimated using the Hosemann-Bagchi Paracrystalline Lattice model. The temperature dependence of the lamellar crystal thickness was consistent with both LH and the Strobl model of polymer crystallization. However, in contrast to the predictions of Strobl’s model, the value of the mesomorph-to-crystal equilibrium transition temperature was very close to the zero-growth temperature. Moreover, the lateral block sizes (obtained using wide angle X-ray diffraction) and the lamellar thicknesses were not found to be controlled by the mesomorph-to-crystal equilibrium transition temperature. Hence, we concluded that the crystallization of PCL is not mediated by a mesophase.  Metallocene-catalyzed linear low-density (m-LLDPE with 3.4 mol% 1-octene) and conventional low-density (LDPE) polyethylene blends of different compositions were investigated for their melt-state miscibility and concurrent crystallization tendency. Differential scanning calorimetric studies and morphological studies using atomic force microscopy confirm that these blends are miscible in the melt-state for all compositions. LDPE chains are found to crystallize concurrently with m-LLDPE chains during cooling in the m-LLDPE crystallization temperature range. While the extent of concurrent crystallization was found to be optimal in blends with highest m-LLDPE content studied, strong evidence was uncovered for the existence of a saturation effect in the concurrent crystallization behavior. This observation leads us to suggest that co-crystallization, rather than mere concurrent crystallization, of LDPE with m-LLDPE can indeed take place. Matching of the respective sequence length distributions in LDPE and m-LLDPE is suggested to control the extent of co-crystallization.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-10-18T08:00:33Z (GMT). No. of bitstreams: 2  Sheth_SS_D_2013.pdf: 23680074 bytes, checksum: 73b0b6d4a31dcfaa9c139c784eed6b08 (MD5)  Sheth_SS_D_2013_support_1.pdf: 331220 bytes, checksum: 8aa0aa4e921e7df25add6e00034e7e78 (MD5)    Previous issue date: 2013-10-17",
  "format_medium": "ETD",
  "handle": "23904",
  "identifier_other": "vt_gsexam:1737",
  "identifier_uri": "http://hdl.handle.net/10919/23904",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Polymer Crystallization",
    "Poly(ε-caprolactone)",
    "Lauritzen-Hoffman Model",
    "Strobl Model",
    "Fractionation",
    "Spherulite Growth Rate",
    "Brochard-deGennes Theory",
    "Lamellar Thickness",
    "X-ray Scattering",
    "Concurrent Crystallization",
    "Co-crystallization"
  ],
  "title": "Self-Consistency of the Lauritzen-Hoffman and Strobl Models of Polymer Crystallization Evaluated for Poly(ε-caprolactone) Fractions and Effect of Composition on the Phenomenon of Concurrent Crystallization in Polyethylene Blends",
  "type": "Dissertation"
}