{
  "contributor_author": "Mudd, James Edmund",
  "contributor_committeechair": "Brott, Pamelia E",
  "contributor_committeemember": [
    "Bayne, Hannah Barnhill",
    "Cannon, Edward P.",
    "Lawson, Gerard Francis"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-10-23T08:00:14Z",
  "date_available": "2013-10-23T08:00:14Z",
  "date_issued": "2013-10-22",
  "degree_discipline": "Counselor Education",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The purpose of the study was to explore the statistical relationships among selected variables related to gay divorced fathers in order to develop a better understanding of their gender role conflict and help-seeking behaviors.  Participants (N=105) self-identified as Caucasian (91%), resided in the United States (90%), holding a bachelor's degree or higher (80%), and annual incomes of less than $80,000 (52%).  The men ranged in age from 29 to 78 (M= 54), married from 1 to 38 years (M= 18), and divorced from 5 months to just under 37 years (M= 10).  Participants completed an on-line questionnaire that included (a) Gender Role Conflict Scale, (b) Attitudes Toward Seeking Professional Psychological Help Scale, (c) Intentions to Seeking Counseling Inventory, (d) Hopkins Symptom Checklist, (e) two open-ended prompts, and (f) demographic questions.  Participants who had received mental health services in the past were asked to report on what prompted them to seek services and the helpfulness of those services.  Analysis of Pearson r was used to answer each of the research questions related to (a) GRC and psychological distress (positive correlation); (b) GRC and attitudes and intentions towards seeking psychological help (negative correlation); and (c) years married and psychological distress (negative correlation).  Significance was not identified between time since divorce and any other variable.  Over 80% of the participants had used mental health services with the three main reasons being coming-out, depression, and sexual identity.  The most beneficial resources they had available to them and/or they would recommend to others were support groups, counseling/therapy, and general support.  Findings are limited by a lack of cultural and ethnic diversity among the sample.  Implications include using group counseling methods and/or a coaching model for service delivery.  An informed integrated approach that focuses on systems, role development, and strategic thinking is recommended.  Interventions should include depression and suicide assessments, brief solution focused methods, narrative work, social networking, and community resource guides.  Future research should seek to determine between group differences with regards to the impact GRC has on one's ability to adjust to change, establish and maintain relationships, and willingness to seek help.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-10-23T08:00:14Z (GMT). No. of bitstreams: 2 Mudd_JE_D_2013.pdf: 1391875 bytes, checksum: d48ed5c0d632769a17dc50b4d26a4023 (MD5) Mudd_JE_D_2013_support_1.pdf: 62420 bytes, checksum: 322b27b9458f21ed46a10c3399895abc (MD5)   Previous issue date: 2013-10-22",
  "format_medium": "ETD",
  "handle": "23919",
  "identifier_other": "vt_gsexam:1647",
  "identifier_uri": "http://hdl.handle.net/10919/23919",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Gender Role Conflict",
    "Help-Seeking",
    "Psychological Distress",
    "Divorced Gay Fathers"
  ],
  "title": "The Relationship Between Gender Role Conflict, Psychological Distress, and Attitudes and Intentions Toward Seeking Psychological Help in Divorced Gay Fathers",
  "type": "Dissertation"
}