{
  "contributor_author": "Kaul, Sapna",
  "contributor_committeechair": "Boyle, Kevin",
  "contributor_committeemember": [
    "Moeltner, Klaus",
    "Parmeter, Christopher F",
    "Kuminoff, Nicolai V",
    "Davis, George C"
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2013-10-25T08:00:28Z",
  "date_available": "2013-10-25T08:00:28Z",
  "date_issued": "2013-10-24",
  "degree_discipline": "Economics, Agriculture and Life Sciences",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Researchers often invoke strong assumptions in empirical analyses to identify significant statistical outcomes. Invoking assumptions that do not sufficiently reflect the occurrence of true phenomenon reduces the credibility of inferences. Literature suggests that the potential effects of assumptions on credibility of inferences can be mitigated by comparing and combining insights from alternative econometric models.  I use this recommendation to conduct robustness checks of commonly used methods in environmental and health economics. The first chapter proposes a novel nonparametric regression model to draw credible insights from meta-analyses. Existing literature on benefit-transfer validity is examined as an application. Nonparametric regression is found to be a viable approach for drawing robust policy insights. The second chapter proposes an alternative structural and simulations based framework to understand elicitation effects in survey response data. This analysis explains the structural mechanisms in which response anomalies occur and is important for building credible insights from survey data. The last chapter uses methods in program evaluation to investigate the impacts of institutional child deliveries on long-term maternal health in the context of developing countries. The outcomes of this analysis indicate that institutional deliveries positively affect maternal health in lower socio-economic states. Based on the findings of my three chapters, I recommend that researchers should combine insights from alternative models to mitigate the scope of specification bias in empirical outcomes and inform policy about the potential uncertainty that arises in uncovering the truth using statistical methods.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-10-25T08:00:28Z (GMT). No. of bitstreams: 2 Kaul_S_D_2013.pdf: 2311336 bytes, checksum: 192a152c4bc528521f31c7dc3e30247d (MD5) Kaul_S_D_2013_support_1.pdf: 209980 bytes, checksum: 20f31ff9c098829a8373a79de79b09b7 (MD5)   Previous issue date: 2013-10-24",
  "format_medium": "ETD",
  "handle": "23925",
  "identifier_other": "vt_gsexam:1674",
  "identifier_uri": "http://hdl.handle.net/10919/23925",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Benefit Transfer",
    "Meta-Analysis",
    "Survey Elicitation Effects",
    "Program Evaluation"
  ],
  "title": "Exploring Alternative Methodologies for Robust Inferences: Applications in Environmental and Health Economics",
  "type": "Dissertation"
}