{
  "contributor_author": "Milenkaya, Olga",
  "contributor_committeechair": "Walters, Jeffrey R.",
  "contributor_committeemember": [
    "Hawley, Dana Michelle",
    "Moore, Ignacio T.",
    "Hopkins, William A."
  ],
  "contributor_department": "Biological Sciences",
  "date_accessioned": "2013-11-06T09:00:13Z",
  "date_available": "2013-11-06T09:00:13Z",
  "date_issued": "2013-11-05",
  "degree_discipline": "Biological Sciences",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Body condition is expected to reflect individual quality because high quality individuals should be better at acquiring and using resources, resulting in higher fitness. However, the hypothesis that condition indices are meaningful indicators of individual quality has been questioned. I monitored a population of crimson finches (Neochmia phaeton) for reproductive success and survival over four breeding seasons. My study population is well suited for this research because individuals forage in common areas and do not hold territories such that variation in condition between individuals is not confounded by differences in habitat quality. Because little is known about crimson finches in the wild, I first describe their breeding biology and life-history traits (Chapter I). Next, I sampled them for commonly used condition indices including mass adjusted for body size, muscle and fat scores, packed cell volume, hemoglobin concentration, total plasma protein, and heterophil to lymphocyte ratio. I describe the variation in these indices and find that many vary by sex and breeding stage, and to a lesser extent by year, age and time of day, concluding that these covariates need to be controlled for when examining intraspecific variation in condition (Chapter II). If condition indices reflect inherent individual quality, then condition indices should be (a) repeatable within individuals, and (b) predictors of realized fitness. I test these two predictions in Chapters III and IV, respectively, and I find that condition indices are repeatable within individuals over short, but not long, time periods and that some indices predict reproductive success, while others do not, and that none predict survival. Both findings only partially support the hypothesis that condition indices are meaningful indicators of individual quality, raising concerns over this common interpretation. In Chapter V, I glean insights from the ecological and poultry science literature and discuss further complications with the use of condition indices as proxies for individual quality and fitness. I conclude that condition indices indicate how well an individual is currently acquiring resources as well as its likely physiological state over the next few months, but that they do not reflect individual quality and are not reliable proxies for fitness.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-11-06T09:00:13Z (GMT). No. of bitstreams: 2  Milenkaya_O_D_2013.pdf: 2059823 bytes, checksum: ca14738e7484d4e2ec7ed3955fa7b8de (MD5)  Milenkaya_O_D_2013_support_1.docx: 19398 bytes, checksum: df8c5b3b540c18a56b3d3648a4371563 (MD5)    Previous issue date: 2013-11-05",
  "format_medium": "ETD",
  "handle": "23937",
  "identifier_other": "vt_gsexam:1661",
  "identifier_uri": "http://hdl.handle.net/10919/23937",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "conservation",
    "fitness",
    "life-history theory",
    "physiology",
    "repeatability"
  ],
  "title": "VALIDATING BODY CONDITION INDICES AS INDICATORS OF INDIVIDUAL QUALITY: DOES CONDITION EXPLAIN INTRASPECIFIC VARIATION IN REPRODUCTIVE SUCCESS AND SURVIVAL AMONG CRIMSON FINCHES (NEOCHMIA PHAETON)?",
  "type": "Dissertation"
}