{
  "contributor_author": "Ni, Yanyan",
  "contributor_committeechair": "Meng, Xiang-Jin",
  "contributor_committeemember": [
    "Adelman, Zachary N",
    "LeRoith, Tanya",
    "Yuan, Lijuan",
    "Roberts, Paul Christopher"
  ],
  "contributor_department": "Veterinary Medicine",
  "date_accessioned": "2013-11-02T08:00:07Z",
  "date_available": "2013-11-02T08:00:07Z",
  "date_issued": "2013-11-01",
  "degree_discipline": "Biomedical and Veterinary Sciences",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Porcine reproductive and respiratory syndrome virus (PRRSV) is arguably the most economically-important swine pathogen.  As the emergences of novel virulent strains of PRRSV continue to occur worldwide, rapid vaccine development is the key for effective control of ongoing PRRSV outbreaks. With the availability of the PRRSV reverse genetics systems, rapid vaccine development against PRRSV through the manipulation of the reverse genetics becomes feasible. To facilitate the vaccine development effort and study of PRRSV genes, we first established a DNA-launched infectious clone of the passage 14 PRRSV strain VR2385, pIR-VR2385-CA, and identified a spontaneous 435-bp deletion in the nsp2 gene. To characterize the biological and pathological significance of this nsp2 deletion, we restored deleted nsp2 sequence back to pIR-VR2385-CA and constructed another clone pIR-VR2385-R. VR2385-CA and VR2385-R were successfully rescued in vitro. The results from this study indicates that the spontaneous nsp2 deletion plays a role for enhanced PRRSV replication in vitro but has no significant effect on the pathogenicity of the virus.  With the availability of the DNA-launched infectious clone of PRRSV, we successfully applied the molecular breeding approach to rapidly attenuate PRRSV. The GP5 envelope genes of 7 genetically divergent PRRSV strains and the GP5-M genes of 6 different PRRSV strains were molecularly bred. DS722 with shuffled GP5 genes and DS5M3 with shuffled GP5-M genes, were successfully rescued in vitro and shown to be attenuated both in vitro and in vivo. Furthermore, DS722, but not DS5M3, still elicit similar protection against PRRSV challenge as its parental virus. This study reveals a unique approach through DNA shuffling of viral envelope genes to attenuate a positive-strand RNA virus. We subsequently utilized the novel synthetic attenuated virus engineering (SAVE) approach to attenuate PRRSV. The GP5 and nsp9 genes of PRRSV were codon-pair deoptimized with the aid of a computer algorithm. SAVE5 and SAVE9 with deoptimized GP5 gene and SAVE9 with deoptimized nsp9 gene, were successfully rescued and shown to be attenuated in vitro. An in vivo pathogenicity study indicated the attenuation of SAVE5 virus in vivo. The results have important implications for rapid vaccine development against PRRSV and other important viruses.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-11-02T08:00:07Z (GMT). No. of bitstreams: 2 Ni_Y_D_2013.pdf: 3609306 bytes, checksum: 5dd90821d91ea1a261e2f6dc918d08ad (MD5) Ni_Y_D_2013_support_1.pdf: 757923 bytes, checksum: a32a8fb2178b5c73a9480fcf36989fdf (MD5)   Previous issue date: 2013-11-01",
  "format_medium": "ETD",
  "handle": "23935",
  "identifier_other": "vt_gsexam:1644",
  "identifier_uri": "http://hdl.handle.net/10919/23935",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "porcine reproductive and respiratory syndrome virus (PRRSV)",
    "reverse genetics",
    "attenuation",
    "infectious clones",
    "and vaccine"
  ],
  "title": "Reverse Genetics-based Approaches to Attenuate Porcine Reproductive and Respiratory Syndrome Virus (PRRSV)",
  "type": "Dissertation"
}