{
  "contributor_author": "Faas, Caitlin Suzanne",
  "contributor_committeechair": [
    "Benson, Mark J",
    "Kaestle, Christine"
  ],
  "contributor_committeemember": [
    "Bradburn, Isabel S",
    "Savla, Jyoti Shital"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2013-11-01T08:00:06Z",
  "date_available": "2013-11-01T08:00:06Z",
  "date_issued": "2013-10-31",
  "degree_discipline": "Human Development",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This dissertation is comprised of two studies that both aimed to understand the population of young adults who dropped out of college. Life course theory and the theory of emerging adulthood were used to create the theoretical foundation for the studies. The first study explored how students who dropped out of college were faring during young adulthood on multiple measures of well-being (personal income, job satisfaction, subjective socioeconomic success, mastery, happiness, depression, and stress). Five latent classes emerged from the data, which demonstrated the heterogeneity within the sample (N = 1,530). The second study then utilized the same sample to examine how transitions into adulthood predicted well-being during young adulthood while controlling for family of origin resources and developmental assets. The transitions to adulthood included timing of marriage, parenthood, and whether or not the young adult was living independently of their parents or not. The hypotheses based on theory were partially supported, with some differences existing between men and women. The discussion reviews the implications for practice and policy.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-11-01T08:00:06Z (GMT). No. of bitstreams: 1 Faas_CS_D_2013.pdf: 1344205 bytes, checksum: 0fee30ba96eb6064698c0a03d368e7ce (MD5)   Previous issue date: 2013-10-31",
  "format_medium": "ETD",
  "handle": "23934",
  "identifier_other": "vt_gsexam:1657",
  "identifier_uri": "http://hdl.handle.net/10919/23934",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "young adult",
    "socioeconomic success",
    "mental health",
    "college student"
  ],
  "title": "Predicting Socioeconomic Success and Mental Health Outcomes for Young Adults who Dropped out of College",
  "type": "Dissertation"
}