{
  "contributor_author": "Fotiyeva, Izolda S",
  "contributor_committeechair": "Burton, John Knox",
  "contributor_committeemember": [
    "Potter, Kenneth R",
    "Lockee, Barbara B",
    "Wells, John Gaulden"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2013-11-09T09:00:23Z",
  "date_available": "2013-11-09T09:00:23Z",
  "date_issued": "2013-11-08",
  "degree_discipline": "Curriculum and Instruction",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The construction of an instructional design framework that incorporates the re-purposing of popular media to enhance mathematics and science instruction    Izolda S. Fotiyeva    ABSTRACT    This study was an effort to construct and validate an instructional design framework for media content selection that incorporates re-purposing popular media to enhance mathematics and science instruction.  The study resulted in the development and validation of a framework that was applicable with novice and expert instructional designers to be used as a stand - alone model or as a supplement to widely-used instructional design models. The framework was developed based on the literature review of four constructs: instructional design models, re-purposing popular media, learning theories and the new generation learners' characteristics, and multidisciplinary or integrated approaches to instruction.  The findings of the literature review were used as the theoretical foundation for the construction of the framework for media content selection. During the final step of the study's Phase One, the researcher used the first iteration of the framework to develop a short instructional module that incorporated the re-purposing of popular media.  This instruction focused on early mathematics (K-2) and the re-purposing of full-feature children animated films.  The goal of this step was the development of documentation to record the process for media content selection that was later used to modify and revise the framework.  As the next step, the framework was validated by subject matter experts in the field of instructional design.   The framework was then further revised and modified.   The findings of this study have implications on the areas that pertain to (a) instructional design models, (b) media selection, (c) media content selection, and (d) curriculum integration. Based on the findings of this study, recommendations to practitioners choosing to use the framework for media content selection were suggested and suggestions for future research were provided.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-11-09T09:00:23Z (GMT). No. of bitstreams: 1  Fotiyeva_IS_D_2013.pdf: 13511559 bytes, checksum: 8242118383cbbc972e300b1bfe97f61f (MD5)    Previous issue date: 2013-11-08",
  "format_medium": "ETD",
  "handle": "23963",
  "identifier_other": "vt_gsexam:1716",
  "identifier_uri": "http://hdl.handle.net/10919/23963",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "instructional models",
    "repurposing popular media",
    "mathematics and science instruction",
    "integration",
    "framework",
    "media selection",
    "media content selection"
  ],
  "title": "Constructing an instructional design framework that incorporates re-purposing popular media to enhance mathematics and science instruction",
  "type": "Dissertation"
}