{
  "contributor_author": "Hudson, Robyn Lynn",
  "contributor_committeechair": "Asselin, Susan B",
  "contributor_committeemember": [
    "Weiss, Margaret P",
    "Culver, Steven M",
    "Williams, Thomas O"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2013-11-14T09:00:12Z",
  "date_available": "2013-11-14T09:00:12Z",
  "date_issued": "2013-11-13",
  "degree_discipline": "Curriculum and Instruction",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Previous studies on postsecondary graduation rates indicated that college students with disabilities have lower graduation rates than students without disabilities.  As many college students do not disclose their disability to their institution upon enrollment, the effect of the timing of disability disclosure on graduation rates warranted examination.  This study was a quantitative study of 14,401 undergraduate students at one large research university in the years 2002, 2003, and 2004, of which 423 had disabilities.  Quantitative methods were used to conduct an exploratory analysis of the effect of disability, disability disclosure, disability-type and gender on graduation rates.  A chi-square analysis revealed that students with disabilities had significantly lower six-year graduation rates than their peers. In addition, students with disabilities who disclosed their disability after their first year of enrollment had significantly lower six-year graduation rates than students with disabilities who disclosed within the first year of enrollment.  Results of a multiple regression analysis showed that disability disclosure, disability-type, and gender accounted for 38% of the variance in the length of time to graduation.  Finally, for every year that a student delayed disclosing a disability, the length of time to graduation increased by almost half a year.  The implications of the study were discussed and recommendations for future research were made.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-11-14T09:00:12Z (GMT). No. of bitstreams: 3 Hudson_RL_D_2013.pdf: 690246 bytes, checksum: 3ba83c39c62f42afea866ed0f34f91f7 (MD5) Hudson_RL_D_2013_support_3.pdf: 102876 bytes, checksum: 8c4e112a8c4d419b747c02be6ce73f93 (MD5) Hudson_RL_D_2013_support_4.pdf: 421815 bytes, checksum: 358f8df1b94f6013987aa3495a14eeb3 (MD5)   Previous issue date: 2013-11-13",
  "format_medium": "ETD",
  "handle": "24072",
  "identifier_other": "vt_gsexam:1780",
  "identifier_uri": "http://hdl.handle.net/10919/24072",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "college student",
    "postsecondary",
    "disability",
    "graduation",
    "disability disclosure"
  ],
  "title": "The effect of disability disclosure on the graduation rates of college students with disabilities",
  "type": "Dissertation"
}