{
  "contributor_author": "Kennington, Mathis Alan Vila",
  "contributor_committeechair": "Arditti, Joyce A",
  "contributor_committeemember": [
    "Few-Demo, April L",
    "Dolbin-MacNab, Megan Leigh",
    "Zvonkovic, Anisa"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2013-11-19T09:00:13Z",
  "date_available": "2013-11-19T09:00:13Z",
  "date_issued": "2013-11-18",
  "degree_discipline": "Human Development",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Prisonization refers to the idea that prisoners assimilate to prison society, import criminogenic characteristics, and are deprived by prison culture.  Post-carceral prisonization is the process by which excarcerated prisoners (EXP) are socialized by features of prisonization that persist after release, and which manifest under probation and parole.  Post-carceral prisonization occurs as a result of stigma and discrimination and a lack of access to crucial resources like employment, housing, and prosocial ties.  EXPs make a decision to change their lives during or immediately following release from prison or jail, usually accompanied by a spiritual or religious change.  EXPs seek to reform identities constructed both by years of incarceration and by their experiences with \"prison satellites\" which are prisonization agents that emerge after release.  Hindered by a loss of social, economic, and material assets, the threat of sudden and unexplainable incarceration, and lifelong criminal stigma, EXPs endeavor to positively reform their identities and their lives.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-11-19T09:00:13Z (GMT). No. of bitstreams: 2  Kennington_MA_D_2013.pdf: 403253 bytes, checksum: 3f1511a43c56a88b67a743d1920959f2 (MD5)  Kennington_MA_D_2013_support_1.pdf: 17627 bytes, checksum: 00e769e34830ee51511452eed8bc34a1 (MD5)    Previous issue date: 2013-11-18",
  "format_medium": "ETD",
  "handle": "24194",
  "identifier_other": "vt_gsexam:1774",
  "identifier_uri": "http://hdl.handle.net/10919/24194",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Post-carceral prisonization",
    "excarcerated prisoners",
    "ambiguous freedom"
  ],
  "title": "Ambiguous Freedom: A Grounded Theoretical Analysis of Life Outside Prison",
  "type": "Dissertation"
}