{
  "contributor_author": "Dai, Yumin",
  "contributor_committeechair": "Kingston, David G",
  "contributor_committeemember": [
    "Gibson, Harry W",
    "Gandour, Richard D",
    "Santos, Webster"
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2013-11-19T09:00:09Z",
  "date_available": "2013-11-19T09:00:09Z",
  "date_issued": "2013-11-18",
  "degree_discipline": "Chemistry",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The Kingston group's engagement in an International Cooperative Biodiversity Group (ICBG) program and a collaborative research project established between Virginia Tech and the Institute for Hepatitis and Virus Research (IHVR) has focused on the search for bioactive natural products from tropical forests in both Madagascar and South Africa. As a part of this research, a total of four antiproliferative extracts were studied, leading to the isolation of fourteen novel compounds with antiproliferative activity against the A2780 human ovarian cancer line. One extract with antimalarial activity was studied, which led to the isolation of two new natural products with antiplasmodial activity against a drug-resistant Dd2 strain of Plasmodium falciparum.  The plants and their secondary metabolites are discussed in the following order: two new antiproliferative acetogenins from a Uvaria sp.  (Annonaceae); two new antiproliferative calamenene-type sesquiterpenoids from Sterculia tavia (Malvaceae); two new antiproliferative triterpene  saponins from Nematostylis anthophylla (Rubiaceae); six new antiproliferative homoisoflavonoids and two new bufatrienolides from Urginea depressa (Asparagaceae); and two new antiplasmodial anthraquinones from Kniphofia ensifolia (Asphodelaceae).  The structures of all these compounds were determined by analysis of their mass spectrometric, 1D and 2D NMR, UV and IR spectroscopic and optical rotation data. Other than structural elucidation, this work also involved bioactivity evaluations of all the isolates, as well as total synthesis of the two antiproliferative sesquiterpenoids, and a structure-activity relationship (SAR) studies on the antiplasmodial anthroquinones.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-11-19T09:00:09Z (GMT). No. of bitstreams: 2 Dai_Y_D_2013.pdf: 3328058 bytes, checksum: 4bec0a1a13dc0237ba05fc236059dfa7 (MD5) Dai_Y_D_2013_support_1.pdf: 3361377 bytes, checksum: f8d3f4a83de63a25416c63023c2187a5 (MD5)   Previous issue date: 2013-11-18",
  "format_medium": "ETD",
  "handle": "24193",
  "identifier_other": "vt_gsexam:1658",
  "identifier_uri": "http://hdl.handle.net/10919/24193",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Natural Products",
    "Anticancer",
    "Antimalarial",
    "Bioassay Guided Separation"
  ],
  "title": "Isolation, Synthesis and Structure-Activity Relationship Study of Anticancer and Antimalarial Agents from Natural Products",
  "type": "Dissertation"
}