{
  "contributor_author": "Waters, Clarice Nhat-Hien",
  "contributor_committeechair": "Hill, Jennie L",
  "contributor_committeemember": [
    "Estabrooks, Paul Andrew",
    "Kolivras, Korine N",
    "Zoellner, Jamie M"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2013-11-20T09:00:14Z",
  "date_available": "2013-11-20T09:00:14Z",
  "date_issued": "2013-11-19",
  "degree_discipline": "Human Nutrition, Foods, and Exercise",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Using a community-based participatory research (CBPR) approach, community members, community stakeholders, and academic researchers from Virginia Tech formed a community-academic partnership in 2009.  In the formative months, the coalition decided to focus on reducing obesity in the region. The coalition adopted the name of The Dan River Partnership for a Healthy Community (DRPHC) with a mission to \"foster community partnerships to combat obesity in the Dan River Region through healthy lifestyle initiative\".  During a planning workshop, the DRPHC created six causal models for the root causes of obesity in the region. Two causal models that focused on geographic and environmental influences for obesity are the foundation for this series of research.  The focus of this dissertation is at the intersection of the food and physical activity environments and their characteristics that contribute to meeting fruit and vegetable intake and minutes of physical activity recommendations.  The food environment is one aspect of built environment research that examines food locations for procurement and the variety, availability, and quality of different food options.  To date, the vast majority of research on the food environment is based in urban, suburban, and metropolitan areas with high residential densities and populations. Rural areas are often understudied because of their dispersed and hard-to-reach populations; yet these individuals experience some of the worst health outcomes in the nation.  This is due, in part, to the large overlaps of rural regions and food deserts, resulting in poor food choices and poor diets.  The overall objective of this dissertation is to examine the associations of the food and physical activity environments with individual healthy behaviors.  Three studies were conducted within the broader research plan to meet the overall objective. The first study systematically examined the food environment using the Nutrition Environment Measures Survey (NEMS) for all food outlets in Danville, VA, a small regional city within the health disparate region, to compare differences in healthy available food options by block group race and income. The second study expanded NEMS methodology to encompass all food outlets in the three-county Dan River region to examine if food environment and availability of healthy options was predictive of meeting fruit and vegetable intake recommendations.  The last study examined the objective and perceived distance individuals must travel to reach a physical activity outlet and whether or not distance was a predictive factor of individual weekly minutes of moderate to vigorous physical activity and meeting physical activity recommendations.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-11-20T09:00:14Z (GMT). No. of bitstreams: 1 Waters_CN_D_2013.pdf: 2019216 bytes, checksum: 62a2c1f3338c355b4a099e20c43fc98a (MD5)   Previous issue date: 2013-11-19",
  "format_medium": "ETD",
  "handle": "24198",
  "identifier_other": "vt_gsexam:1729",
  "identifier_uri": "http://hdl.handle.net/10919/24198",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "community-based participatory research",
    "environment",
    "fruit and vegetable intake",
    "physical activity",
    "health disparate"
  ],
  "title": "Exploring the Food and Physical Activity Environments and Their Influence on Healthy Behaviors",
  "type": "Dissertation"
}