{
  "contributor_author": "Nkhata, Bentry",
  "contributor_committeechair": [
    "Price, William T",
    "Burge, Penny L"
  ],
  "contributor_committeemember": [
    "Lichtenberger, Eric Jon",
    "Wells, John Gaulden"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2013-11-26T09:00:06Z",
  "date_available": "2013-11-26T09:00:06Z",
  "date_issued": "2013-11-25",
  "degree_discipline": "Career and Technical Education",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "In spite of the large overlap in the goals of CTE and STEM education, there is little evidence of the role(s) CTE delivery systems, programs, curricula, or pedagogical strategies can play in advancing STEM education.  Because of their responsibilities, especially for organizational and instructional leadership, school district CTE directors could illuminate our understanding of linkages between CTE and STEM education. The purpose of this study was to analyze the experiences of school district CTE directors to better understand these linkages. The researcher used a qualitative research design to gain understanding of the local CTE directors' experiences. Data were collected using face-to-face semi-structured interviews with 13 participants. The data were analyzed using a continuous process of coding, recoding, memo-writing and making comparisons across the transcripts. Among the results of the study were that definitions of STEM education were varied, but all had aspects of an integrated approach and using real world applications. The data revealed a number of contributions made by CTE to assist in STEM education implementation. They include context for learning, multiple pathways; platform for program delivery, and administrative leadership and framework. It was also found that strategies for increasing the visibility of CTE's contributions in the advancement of STEM education could include marketing CTE, demonstrating the value of CTE, enhancing curriculum and instruction, and rebranding CTE. Conclusions made in the study include, but not limited to,  the fact that there are tremendous reciprocal benefits that CTE and STEM education can provide for one another, given there are strong, mutual, and intended linkage of the two; and that establishing a state-level STEM education coordinator position would result in providing much needed leadership at the local and state levels. Recommendations for practice that were made in the study include, but are not limited to, continuing to establish Virginia Governor's Academies throughout the Commonwealth of Virginia by aligning STEM education with CTE and continuing to support, at the highest level, intentional and mutual collaborative initiatives between STEM education and CTE. A recommendation for future research includes conducting a longitudinal study on the impact that Virginia Governor's Academies are having on student morale, growth, learning, and future endeavor.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-11-26T09:00:06Z (GMT). No. of bitstreams: 2 Nkhata_B_D_2013.pdf: 2235142 bytes, checksum: f3355f7691ee828c658ce8fca503cf35 (MD5) Nkhata_B_D_2013_support_1.pdf: 938231 bytes, checksum: 1f62d5309fb23f37e2339492c9f18b36 (MD5)   Previous issue date: 2013-11-25",
  "format_medium": "ETD",
  "handle": "24203",
  "identifier_other": "vt_gsexam:1790",
  "identifier_uri": "http://hdl.handle.net/10919/24203",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Career and Technical Education",
    "Science",
    "Technology",
    "Engineering",
    "and Math (STEM) Education; School District Directors of CTE; Curriculum Integration"
  ],
  "title": "Career and Technical Education (CTE) Directors' Experiences with CTE's Contributions to Science, Technology, Engineering, and Math (STEM) Education Implementation",
  "type": "Dissertation"
}