{
  "contributor_author": "Howes, Meghan K.",
  "contributor_committeechair": "Hardy, Warren Nelson",
  "contributor_committeemember": [
    "Stitzel, Joel D.",
    "Beillas, Philippe D.",
    "Duma, Stefan M.",
    "Gayzik, Francis S.",
    "Rouhana, Stephen W."
  ],
  "contributor_department": "Biomedical Engineering",
  "date_accessioned": "2013-12-04T09:00:10Z",
  "date_available": "2013-12-04T09:00:10Z",
  "date_issued": "2013-12-03",
  "degree_discipline": "Biomedical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Motor vehicle collisions (MVCs) are a leading cause of injuries and injury-related fatalities in the United States. The National Highway Traffic Safety Administration (NHTSA) reported over 21,250 vehicle occupant fatalities in 2011, with 1,240,000 injuries sustained by passenger car occupants alone. MVCs are a common cause of blunt abdominal injuries. It has been reported that approximately 9,000 front seat occupants sustain moderate to severe abdominal injuries in frontal MVCs in the United States each year. A detailed understanding of the occurrence and mechanisms of abdominal injuries, as well as knowledge of the biomechanical response and tolerance of the abdomen in crash-specific loading modes, could benefit the reduction of abdominal organ injury incidence in MVCs. Therefore, the objective of the research presented in this dissertation was to characterize abdominal injury mechanisms, tissue failure thresholds, and internal organ response to blunt impacts of the abdomen. Field accident data from the Crash Injury Research and Engineering Network (CIREN) database were analyzed to determine the occupant and crash characteristics associated with crash-induced hollow abdominal organ injuries. Dynamic equibiaxial tension tests were conducted on tissue samples obtained from the human post-mortem stomach, small intestine, and colon to characterize the material properties and failure tolerance of these tissues. The effects of cadaver orientation on the relative position of the abdominal organs of two cadavers were quantified, and high-speed biplane x-ray imaging was used to investigate the relative kinematics of the thoracic and abdominal organs of four cadavers in response to crash-specific loading modes. Test configurations included blunt abdominal and thoracic impacts and driver-shoulder seatbelt loading. The motivation for this research was to advance efforts toward abdominal organ injury mitigation in MVCs, with each aspect of this research generating novel injury biomechanics data with applications for future experimental testing and finite element modeling.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-12-04T09:00:10Z (GMT). No. of bitstreams: 1 Howes_MK_D_2013.pdf: 31881976 bytes, checksum: 68a235f86bfefd50700f2f52a403f3ac (MD5)   Previous issue date: 2013-12-03",
  "format_medium": "ETD",
  "handle": "24382",
  "identifier_other": "vt_gsexam:1820",
  "identifier_uri": "http://hdl.handle.net/10919/24382",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Abdomen",
    "Injury",
    "Biomechanics",
    "Cadaver",
    "Impact",
    "Stress",
    "Strain"
  ],
  "title": "INJURY MECHANISMS, TISSUE PROPERTIES, AND RESPONSE OF THE POST-MORTEM HUMAN ABDOMEN IN FRONTAL IMPACT",
  "type": "Dissertation"
}