{
  "contributor_author": "King Jr., Charles Lee",
  "contributor_committeechair": "Cennamo, Katherine S",
  "contributor_committeemember": [
    "Burton, John Knox",
    "Lockee, Barbara B",
    "Evans, Michael A"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2013-12-07T09:00:07Z",
  "date_available": "2013-12-07T09:00:07Z",
  "date_issued": "2013-12-06",
  "degree_discipline": "Curriculum and Instruction",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "Barriers to technology integration are not a new phenomenon for educators, however resolving the issues surrounding the barriers necessitates the use of appropriate methods to accurately identify them. The purpose of this study is to investigate (a) whether or not Gilberts Behavioral Engineering Model is an appropriate instrument for identifying barriers to technology integration in an educational setting, particularly a public school and (b) can Gilberts Behavioral Engineering model be used in a public school to identify barriers to technology integration. The research and design methods were conducted in two phases. In Phase I, a model usability study was conducted through an online Cause Analysis survey based on Chevalier's updated model.  The survey was administered to 80 teachers and four administrators in a public school.  In phase II, two expert reviewers validated the process used to implement the Behavior Engineering Model. The data from the Cause Analysis indicated that participants believed there was a lack of financial and non-financial incentives for integrating technology and that the management and reporting system did not adequately track the use of technology. The expert reviewers both agreed that Gilberts model was implemented correctly identified barriers to technology integration and revealed a performance gap.  They also agreed that Gilberts model is appropriate to use in a public school setting.",
  "description_degree": "EDD",
  "description_provenance": "Made available in DSpace on 2013-12-07T09:00:07Z (GMT). No. of bitstreams: 2 King_CL_T_2013.pdf: 3053576 bytes, checksum: 33793124ac55706c77da0759fa0bb7f3 (MD5) King_CL_T_2013_support_1.pdf: 151877 bytes, checksum: 8d13816d36dee2651666038640d7edef (MD5)   Previous issue date: 2013-12-06",
  "format_medium": "ETD",
  "handle": "24448",
  "identifier_other": "vt_gsexam:1678",
  "identifier_uri": "http://hdl.handle.net/10919/24448",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Human Performance Technology",
    "Gilberts Behavior Engineering Model"
  ],
  "title": "An exploration on the use of Gilberts behavior engineering model to identify barriers to technology integration in a public school",
  "type": "Dissertation"
}