{
  "contributor_author": "Blunt, Mechelle Savedge",
  "contributor_committeechair": [
    "Sun, Min",
    "Parks, David J"
  ],
  "contributor_committeemember": [
    "Giacometti, Karen S",
    "Alexander, Michael D"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2013-12-13T09:00:18Z",
  "date_available": "2013-12-13T09:00:18Z",
  "date_issued": "2013-12-12",
  "degree_discipline": "Educational Leadership and Policy Studies",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "The mobility rates within the Kindergarten--Grade 12 teacher workforce are distressing, and the teaching profession has a relatively high turnover rate compared to other occupations. The Commonwealth of Virginia encounters many challenges when attempting to retain highly qualified teachers in schools. Despite the state's efforts to staff all schools, high teacher turnover rates persist. Novice teacher attrition is more prevalent in schools identified as hard-to-staff. Turnover affects not only the composition of faculties at individual schools and the stability of these schools but the quality of the teacher workforce as well.  The factors that affect the retention of novice teachers in hard-to-staff high schools in Virginia were examined in this study. Similar to Giacometti's (2005) study, compensation, pre-service preparation, external forces, school culture, in-service training support, motivation to teach, and emotional factors were variables used in this investigation. Demographics, principal leadership actions, and economic conditions were added to Giacometti's original theory of novice teacher retention, and some of Giacometti's variables were refined to improve the theory and the quality of the measurements. Following descriptive and exploratory bivariate analyses, binary logistic regression was applied to predict teacher retention with two levels: planning to leave the school and planning to stay in the school. Results indicate that teachers who planned to leave were more likely to be minorities, to perceive less school cultural support, and to perceive less parental support than those who planned to stay. The results of the study have significant practical implications for school leaders, especially those who serve hard-to-staff high schools, in developing retention plans to keep their  highly qualified novice teachers.",
  "description_degree": "EDD",
  "description_provenance": "Made available in DSpace on 2013-12-13T09:00:18Z (GMT). No. of bitstreams: 2 Blunt_MS_T_2013.pdf: 1269147 bytes, checksum: 6031df38c279e2dac74d7f59f5155d6f (MD5) Blunt_MS_T_2013_support_1.pdf: 585612 bytes, checksum: 295d04e8583ef77d0d9b3adf43d6edb5 (MD5)   Previous issue date: 2013-12-12",
  "format_medium": "ETD",
  "handle": "24537",
  "identifier_other": "vt_gsexam:1662",
  "identifier_uri": "http://hdl.handle.net/10919/24537",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Teacher Retention",
    "Novice Teacher",
    "Hard-to-Staff High Schools",
    "Virginia"
  ],
  "title": "Factors that Affect Retention of Novice Teachers in Hard-to-Staff High Schools in Virginia",
  "type": "Dissertation"
}