{
  "contributor_author": "Zhang, Xiaoyue",
  "contributor_committeechair": "Lockhart, Thurmon E.",
  "contributor_committeemember": [
    "Bish, Douglas R",
    "Roberto, Karen A",
    "Agnew, Michael J"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2013-12-13T09:00:08Z",
  "date_available": "2013-12-13T09:00:08Z",
  "date_issued": "2013-12-12",
  "degree_discipline": "Industrial and Systems Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Fall accidents are one of the most serious problems leading to unintentional injuries and fatalities among older adults. However, it is difficult to assess individuals' fall risk and to determine who are at risk of falls and in need of fall interventions. Therefore, this study was motivated by a need to provide a cogent fall risk assessment strategy that may be conducive to various wireless platforms. It aimed at developing a fall risk assessment method for evaluating individuals' fall risk by providing diagnostic modalities associated with gait. In this study, a \"determinants of gait\" model was adopted to analyze gait characteristics and associate them with fall risk. As a proof of concept, this study concentrated on slip-induced falls and the slip initiation risks. Two important parameters of determinants of gait, i.e. the pelvic rotation and the knee flexion, were found to be associated with slip initiation severity. This relationship appeared to be capable of differentiating fallers and non-fallers within older adults, as well as differentiating normal walking conditions and constrained walking conditions. Furthermore, this study also leveraged portable wireless sensor techniques and investigated if miniature inertial measurement units could effectively measure the important parameters of determinants of gait, and therefore assess slip and fall risk. Results in this study suggested that pelvic rotation and knee flexion measured by the inertial measurement units can be used as a substitution of the traditional motion capture system and can assess slip and fall risk with fairly good accuracy. As a summary, findings of this study filled the knowledge gap about how critical gait characteristics can influence slip and fall risk, and demonstrated a new solution to assess slip and fall risk with low cost and high efficiency.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-12-13T09:00:08Z (GMT). No. of bitstreams: 1 Zhang_X_D_2013.pdf: 9356735 bytes, checksum: b8759a69a16f655fc3160520deb9a96f (MD5)   Previous issue date: 2013-12-12",
  "format_medium": "ETD",
  "handle": "24535",
  "identifier_other": "vt_gsexam:1793",
  "identifier_uri": "http://hdl.handle.net/10919/24535",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "fall risk",
    "gait study",
    "inertial measurement units"
  ],
  "title": "Fall Risk Assessment By Measuring Determinants Of Gait",
  "type": "Dissertation"
}