{
  "contributor_author": "Rollin, Joseph A",
  "contributor_committeechair": [
    "Zhang, Yi Heng Percival",
    "Barone, Justin Robert"
  ],
  "contributor_committeemember": [
    "Goldstein, Aaron S",
    "Winkel, Brenda Sophia J",
    "Senger, Ryan S"
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2013-12-14T09:00:13Z",
  "date_available": "2013-12-14T09:00:13Z",
  "date_issued": "2013-12-13",
  "degree_discipline": "Biological Systems Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "In order to meet the energy needs of a growing world in a sustainable manner, new high efficiency, carbon-neutral fuels and chemical feedstocks are required. An emerging approach that shows promise for high efficiency production of renewable fuels and chemicals is the use of purified enzymes combined in one pot to catalyze complex conversions: synthetic pathway biotransformations (SyPaB). An exemplary technology in this burgeoning field is the production of hydrogen from biomass sugars. Lignocellulosic biomass, which includes agricultural residues, energy crops, and industrial waste streams, is an ideal substrate for SyPaB conversion, as it is abundant and cheap, second only to untaxed coal on a $/energy content basis. But the structure of biomass is highly recalcitrant, making high-yield biological conversion difficult to achieve. In order to increase susceptibility to enzymatic digestion, thermochemical pretreatments are applied, with the goals of removing of lignin, the simplest example being soaking in aqueous ammonia (SAA); hemicellulose removal, most often using dilute acid (DA); and increasing cellulose accessibility by cellulose solvent-based pretreatments, such as cellulose solvent- and organic solvent-based lignocellulose fractionation (COSLIF). In a comparison of the lignin removal (SAA) and accessibility increase (COSLIF) approaches, we found that certain levels of lignin removal (~15%) were important, but further lignin removal was less effective at achieving digestibility gains than increasing cellulose accessibility. Pretreated biomass forms an excellent substrate for SyPaB hydrogen generation, due to low cost and high sugar content. Following experiments demonstrating the high yield conversion of sucrose to hydrogen (97%) and SyPaB generation of hydrogen at a rate commensurate with the best biological rates achieved, 157 mmol/L/h. SyPaB was combined with enzymatic hydrolysis to enable the direct conversion of cellulosic biomass, including untreated, DA, and COSLIF corn stover. In addition, an updated kinetic model of the system was used to rationally increase the maximum hydrogen production rate by 70% while minimizing total enzyme loading and without increasing substrate concentration. Together, these results demonstrate the high level of engineering control in cell-free systems, which can enable conversion of a variety of substrates to hydrogen at the highest possible yield and rates as high as any biohydrogen production method.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-12-14T09:00:13Z (GMT). No. of bitstreams: 2 Rollin_JA_D_2013.pdf: 14395134 bytes, checksum: b65c3f88e349fc58dceb1165b22602f9 (MD5) Rollin_JA_D_2013_support_1.pdf: 460137 bytes, checksum: 733341fb2c7a2789cf1e8abcd5139e40 (MD5)   Previous issue date: 2013-12-13",
  "format_medium": "ETD",
  "handle": "24698",
  "identifier_other": "vt_gsexam:1608",
  "identifier_uri": "http://hdl.handle.net/10919/24698",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "synthetic enzymatic pathway (SyPaB)",
    "biohydrogen",
    "cellulosic biofuel",
    "cellulose solvent- and organic solvent-based lignocellulose"
  ],
  "title": "Synthetic enzymatic pathway conversion of cellulosic biomass to hydrogen",
  "type": "Dissertation"
}