{
  "contributor_author": "Fraire, Maria G",
  "contributor_committeechair": "Ollendick, Thomas H",
  "contributor_committeemember": [
    "Dunsmore, Julie C",
    "Jones, Russell T",
    "White, Susan Williams"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2013-12-14T09:00:18Z",
  "date_available": "2013-12-14T09:00:18Z",
  "date_issued": "2013-12-13",
  "degree_discipline": "Psychology",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The purpose of this study was to develop, implement, and evaluate a psychosocial treatment specifically designed for families with a child who experiences a generalized anxiety disorder (GAD) and an oppositional defiant disorder (ODD). Research suggests emotion regulation and information processing in the child and parenting behaviors directed towards the child may contribute to, and maintain, generalized anxiety and oppositionality. A treatment protocol, integrating emotion focused cognitive-behavioral therapy and collaborative problem solving was designed. Five families participated in assessment, an average of 13 treatment sessions, and follow up. The hypothesis that both GAD and ODD could be treated within the same treatment plan was partially supported. All of the children experienced reductions in symptoms. Eighty percent of the children (4/5) had subclinical or no GAD diagnosis at post. At the 1 month follow-up, 3 children maintained these gains and 1 child showed more improvement at one month (compared to post). Forty percent of the children (2/5) had a subclinical ODD diagnosis at post, with 80% (4/5) subclinical at the 1 month follow-up. The study provided important considerations for future directions.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-12-14T09:00:18Z (GMT). No. of bitstreams: 1 Fraire_MG_D_2013.pdf: 695932 bytes, checksum: bd1c69d785dd73c40dfcf803d238ef66 (MD5)   Previous issue date: 2013-12-13",
  "format_medium": "ETD",
  "handle": "24699",
  "identifier_other": "vt_gsexam:1668",
  "identifier_uri": "http://hdl.handle.net/10919/24699",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Clinical",
    "Child",
    "Anxiety",
    "Oppositional",
    "Treatment"
  ],
  "title": "Treatment of Comorbid Anxiety and Oppositionality in Children: Targeting the Underlying Processes",
  "type": "Dissertation"
}