{
  "contributor_author": "James, Gregory Keith",
  "contributor_committeechair": [
    "Ducker, William A",
    "Walz, John Y"
  ],
  "contributor_committeemember": [
    "Davis, Richey M",
    "Martin, Stephen Michael"
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2013-12-20T09:00:14Z",
  "date_available": "2013-12-20T09:00:14Z",
  "date_issued": "2013-12-19",
  "degree_discipline": "Chemical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Within a colloidal dispersion, the presence of negatively adsorbing material can produce a variety of effects on the dispersion properties and interactions. With increasing concentration, the negatively adsorbing material induces both depletion and structural forces on the dispersion, which can dramatically affect both colloidal stability and near-contact hydrodynamics. This project focused on expanding our understanding of the effects of such negatively adsorbing materials on both equilibrium and dynamic interactions between particles. \tThe effects of charged, hard spheres (silica nanoparticle) on the hydrodynamic drag force a particle experiences as it approaches a flat plate were measured experimentally using colloid probe atomic force microscopy (CP-AFM). Deviation was found between the measured drag force and predictions for the drag force in a simple, Newtonian fluid. The measured drag force was always smaller than the predicted drag force as the particle approached contact with the plate. An effective viscosity, that approached the dispersing fluid viscosity at contact and the bulk viscosity at large separations, was determined for the system. This effective viscosity displayed similar characteristics to those predicted theoretically by Bhattacharya and Blawzdziewicz (J. Chem. Phys. 2008, 128, 214704.).  \tThe effects of both anionic and cationic micelles on the depletion and structural forces in a colloidal dispersion were studied both experimentally (with CP-AFM) and theoretically. The depletion and structural forces between a microparticle and a flat plate were measured and compared with the depletion force predicted by the force-balance model of Walz and Sharma (J. Colloid Interface Sci. 1994, 168, 485-496.). Consistent with previous work, the measured depletion force for both micelles was smaller in magnitude than that predicted by the Walz and Sharma model for hard, charged spheres. It is theorized that rearrangement of the micelle surfaces charges or physical deformation of the micelles may be responsible for the observed result. An effective surface potential for the micelles is proposed as a correction to the Walz and Sharma model. \tFinally, the stability of colloidal dispersions was studied macroscopically in solutions of ionic micelles. The colloidal dispersions displayed clear flocculation behavior in both cationic and anionic micelles. This flocculation behavior was compared with energy profiles determined from CP-AFM experiments between a single particle and a flat plate. A simple phase diagram was proposed for predicting the stability of colloidal dispersions based solely on the depth of the depletion energy well and the height of the repulsive energy barrier.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-12-20T09:00:14Z (GMT). No. of bitstreams: 2 James_GK_D_2013.pdf: 2329786 bytes, checksum: bea3ae3240b593922f96c03f8d317644 (MD5) James_GK_D_2013_support_1.pdf: 9683 bytes, checksum: 6710e732c98a9936abd76a2333bd4e95 (MD5)   Previous issue date: 2013-12-19",
  "format_medium": "ETD",
  "handle": "24764",
  "identifier_other": "vt_gsexam:1876",
  "identifier_uri": "http://hdl.handle.net/10919/24764",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Colloidal Dispersions",
    "Depletion and Structural Forces",
    "Colloidal Stability",
    "Atomic Force Microscopy"
  ],
  "title": "Investigation of Hydrodynamic and Depletion Interactions in Binary Colloidal Dispersions",
  "type": "Dissertation"
}