{
  "contributor_author": "Jarrett, Jordan Alesa",
  "contributor_committeechair": "Charney, Finley A",
  "contributor_committeemember": [
    "Eatherton, Matthew Roy",
    "Moen, Cristopher Dennis",
    "Rodriguez-Marek, Adrian"
  ],
  "contributor_department": "Civil and Environmental Engineering",
  "date_accessioned": "2013-12-31T09:00:21Z",
  "date_available": "2013-12-31T09:00:21Z",
  "date_issued": "2013-12-30",
  "degree_discipline": "Civil Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This work stems from two different studies related to this performance assessment of seismic resistant systems. The first study compares the performance of newly developed and traditional seismic resisting systems, and the second study investigates many of the assumptions made within provisions for nonlinear response history analyses.     In the first study, two innovative systems, which are hybrid buckling restrained braces and collapse prevention systems, are compared to their traditional counterparts using a combination of the FEMA P-695 and FEMA P-58 methodologies. Additionally, an innovative modeling assumption is investigated, where moment frames are evaluated with and without the lateral influence of the gravity system. Each system has a unique purpose from the perspective of performance-based earthquake engineering, and analyses focus on the all intensity levels of interest. The comparisons are presented in terms consequences, including repair costs, repair duration, number of casualties, and probability of receiving an unsafe placard, which are more meaningful to owners and other decision makers than traditional structural response parameters. The results show that these systems can significantly reduce the consequences, particularly the average repair costs, at the important intensity levels.     The second study focuses on the assumptions made during proposed updates to provisions for nonlinear response history analyses. The first assumption investigated is the modeling of the gravity system's lateral influence, which can have significant effect on the system behavior and should be modeled if a more accurate representation of the behavior is needed. The influence of residual drifts on the proximity to collapse is determined, and this work concludes that a residual drift check is unnecessary if the only limit state of interest is collapse prevention. This study also finds that spectrally matched ground motions should cautiously be used for near-field structures. The effects of nonlinear accidental torsion are also examined in detail and are determined to have a significant effect on the inelastic behavior of the analyzed structure. The final investigation in this study shows that even if a structure is designed per ASCE 7, it may not have the assumed probability of collapse under the maximum considered earthquake when analyzed using FEMA P-695.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-12-31T09:00:21Z (GMT). No. of bitstreams: 3  Jarrett_JA_D_2013.pdf: 5565477 bytes, checksum: d49326ac2f754b1b8240580c43fb07b6 (MD5)  Jarrett_JA_D_2013_support_3.pdf: 2142264 bytes, checksum: d74bdbbee8b64d7be34f831ca2ef786a (MD5)  Jarrett_JA_D_2013_support_4.pdf: 91510 bytes, checksum: cde7fc434520b82db11d8f20f0d30384 (MD5)    Previous issue date: 2013-12-30",
  "format_medium": "ETD",
  "handle": "24773",
  "identifier_other": "vt_gsexam:1879",
  "identifier_uri": "http://hdl.handle.net/10919/24773",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Nonlinear Response History Analysis",
    "FEMA P-58",
    "FEMA P-695",
    "ASCE 7",
    "Innovative Systems"
  ],
  "title": "Performance Assessment of Seismic Resistant Steel Structures",
  "type": "Dissertation"
}