{
  "contributor_author": "Kunduri, Bharat Simha Reddy",
  "contributor_committeechair": [
    "Baker, Joseph Benjamin",
    "Ruohoniemi, John Michael"
  ],
  "contributor_committeemember": [
    "Bailey, Scott M.",
    "Scales, Wayne A.",
    "Meehan, Kathleen",
    "Shinpaugh, Kevin A."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2013-12-31T09:00:13Z",
  "date_available": "2013-12-31T09:00:13Z",
  "date_issued": "2013-12-30",
  "degree_discipline": "Electrical Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Ionospheric convection dynamics is an important window for understanding the coupling of the solar wind and interplanetary magnetic field to the Earth's ionosphere and upper atmosphere. In this study, we use measurements of ionospheric convection made by the SuperDARN radars to investigate the role of interhemispheric magnetic conjugacy in magnetosphere-ionosphere coupling and study the large-scale interactions between the magnetosphere and ionosphere. SuperDARN radars cover large geographic regions in both hemispheres and have a dataset spanning more than a decade, making them ideal for such studies. We begin in chapter 2 with an analysis of the degree of interhemispheric conjugacy exhibited in a Sub-Auroral Polarization Stream (SAPS). We present simultaneous observations of a SAPS event in both hemispheres made by mid-latitude SuperDARN radars with magnetically conjugate fields-of-view. An interhemispheric comparison of the characteristics of the SAPS channel reveals that the channel was conjugate in terms of potential variations across the channel even though substantial differences in latitudinal width and electric fields were observed in the channel. In chapter 3, we use interhemispheric SuperDARN observations of high latitude ionospheric convection in the noon-dusk sector to investigate the effects of IMF By penetrating into the closed magnetic field line region. The observations support the existence of an IMF By associated interhemispheric potential difference and field-aligned current system resulting in the generation of the interhemispheric asymmetries in ionospheric convection. Four events are analyzed in this study and the strength of interhemispheric currents associated with IMF By are estimated. Moreover, the strength of the interhemispheric currents is found to depend on the magnitude of IMF By, proximity of the currents to open-closed field line boundary, ionospheric conductivity and magnetic local time. In chapter 4, we use data from the mid-latitude SuperDARN radars between Jan-2011 and Aug-2012 to compile a database of SAPS events spanning about six hours in magnetic local time. The event database is used to analyze the average spatial variations in the occurrence rate and velocities of the SAPS channel under different geomagnetic conditions. An empirical model based on Dst-index is then developed to estimate the occurrence rate of SAPS at a given latitude and magnetic local time.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-12-31T09:00:13Z (GMT). No. of bitstreams: 1  Kunduri_B_D_2013.pdf: 13241660 bytes, checksum: 051da24e9cbf51a10f4c9766992d0d85 (MD5)    Previous issue date: 2013-12-30",
  "format_medium": "ETD",
  "handle": "24772",
  "identifier_other": "vt_gsexam:1875",
  "identifier_uri": "http://hdl.handle.net/10919/24772",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "SuperDARN",
    "interhemispheric conjugacy",
    "magnetosphere",
    "ionosphere"
  ],
  "title": "A study of interhemispheric magnetic conjugacy and large scale magnetosphere-ionosphere coupling using SuperDARN radars",
  "type": "Dissertation"
}