{
  "contributor_author": "Marquez Betz, Gabriela Carolina",
  "contributor_committeechair": "Lewis, Ronald M",
  "contributor_committeemember": [
    "Haresign, William",
    "Siegel, Paul B",
    "Notter, David R",
    "Greiner, Scott P"
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2013-12-31T09:00:26Z",
  "date_available": "2013-12-31T09:00:26Z",
  "date_issued": "2013-12-30",
  "degree_discipline": "Animal and Poultry Sciences",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Using terminal sires for crossbreeding is standard practice in the UK sheep industry, where over 70% of market lambs have terminal sire breeding. Thus, selection focusing on terminal sires will translate to changes in the entire industry. Consumers perceive lamb meat as fatty and demand for it has decreased. A lean growth index was developed for terminal sire breeds to increase carcass lean content while keeping fat constant at a constant age end point. The purposes of this study were: to evaluate the effects of index selection of terminal sires on their crossbred offspring up to harvest; to evaluate the effectiveness of the index within the terminal sire breeds; to evaluate the presence and consequences of heterogeneous environmental variances and genetics by environment interactions (GxE) on genetic evaluation. The most widely used breeds of terminal sires in the UK are Charollais, Suffolk, and Texel. These breeds participated in sire referencing schemes from the early 1990s by sharing rams selected on the lean growth index. From 1999 to 2002 approximately 15 high and 15 low lean growth index score rams per breed were selected from their sire referencing schemes and mated to Welsh and Scottish Mule ewes. Their crossbred offspring were reared on 3 farms in the UK under commercial conditions. In total, 6,515 lambs were born between 2000 and 2003. Lambs were weighed at birth (BWT), 5 weeks (5WT), and 10 weeks (10WT). The average daily gain (ADG) from birth to 10 weeks was calculated. Lambs were finished to an estimated 11% subcutaneous fat by visual examination. At harvest, they were weighed (HWT), ultrasonically scanned for muscle (UMD) and fat (UFD) depth, and assessed for condition score and conformation. Lambs sired by high index rams were on average, across breeds, heavier at all ages (P < 0.01) with 0.07 ± 0.03, 0.3 ± 0.1, 0.4 ± 0.1, and 1.2 ± 0.2 kg greater BWT, 5WT, 10WT, and HWT respectively. Their ADG was 5.1 ± 1.9 g/d greater than low index sired lambs. They had thicker UMD (0.7 ± 0.2 mm) and thinner UFD (0.08 ± 0.01 mm). High vs. low index sired lambs took the same amount of days to reach harvest fatness. Suffolk-sired lambs were on average heavier, with greater ADG, whereas Charollais-sired lambs were lightest with smallest ADG. Texel-sired lambs had thicker UMD than Charollais (0.7 ± 0.2 mm; P < 0.001) but were not different than Suffolk. Charollais-sired lambs had greater UFD than both Texel- (0.098 ± 0.016 mm) and Suffolk- (0.061 ± 0.017 mm) sired lambs (P < 0.001). Texel-sired lambs reached harvest condition faster than the other breeds (P < 0.01). Index selection produced heavier and leaner lambs at finishing. Producers have flexibility in choosing the terminal sire that best fits their production system. Heteroscedascity and GxE were found to be more important for ultrasonic traits than weight traits. Fitting a farm by sire random interaction component improved model fit, but only accounted for less than 2% of the variation in weight traits. For ultrasonic traits, it accounted for at least 10% of the variation. When fitting traits as separate but correlated by farm, genetic correlations among traits were mostly above 0.8, indicating no GxE. Reactions norms for sires were fitted. For weight traits and UMD, sires had positive slopes (were environmentally sensitive) that were similar in value, thus performance improved with improving environments. For UFD, reaction norm slopes varied form negative to positive, indicating GxE. Consequences of heteroscedasticity are not large for these data, and any consequence of GxE on breeding goals should be evaluated before explicitly modeling it in genetic evaluation. There was evidence of genetic variation in sensitivity of sires; therefore, they could be selected to be more or less sensitive depending on economic considerations.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2013-12-31T09:00:26Z (GMT). No. of bitstreams: 1 Marquez_Betz_GC_D_2013.pdf: 5711788 bytes, checksum: 6a3a980bf8b8d42787239b87b7f5ba2d (MD5)   Previous issue date: 2013-12-30",
  "format_medium": "ETD",
  "handle": "24774",
  "identifier_other": "vt_gsexam:1942",
  "identifier_uri": "http://hdl.handle.net/10919/24774",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "crossbreeding",
    "genetics by environment interactions",
    "heteroscedasticity",
    "lean growth index",
    "sheep"
  ],
  "title": "Index selection in terminal sire sheep: implications for genetic improvement in a crossbreeding system",
  "type": "Dissertation"
}