{
  "contributor_author": "Emenheiser, Joseph Carl",
  "contributor_committeechair": "Lewis, Ronald M",
  "contributor_committeemember": [
    "Greiner, Scott P",
    "Tracy, Benjamin Franklin",
    "McCann, Mark A",
    "Groover, Gordon E",
    "D'Souza, Gerard E."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-01-07T09:00:14Z",
  "date_available": "2014-01-07T09:00:14Z",
  "date_issued": "2014-01-06",
  "degree_discipline": "Animal and Poultry Sciences",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Pasture-based beef production is well-suited for the Appalachian region of the United States. This research investigated pasture, beef cattle, and economics components within the cow-calf sector of pasture beef production, and presents implications of their interplay for the vitality of the whole system. Samples of forage DM mass and CP, ADF, NDF, and ash contents in each paddock of a rotational stocking system were collected monthly for 4 grazing seasons. Effects of month, stockpiling, hay feeding, temperature, precipitation, and durations of paddock grazing and rest on forage mass and quality measurements were investigated. The system was complex and dynamic; precipitation and rest days in particular showed clear interactions with both month and stockpiling when predicting forage mass and quality. Available DM, TDN, and CP were compared to nutrient density requirements for beef cows to conclude that the system met or exceeded requirements. Six years of production data from a spring-calving cow-calf enterprise that utilized rotational stocking and fall stockpiling were analyzed. Comparisons among 2 cow frame size and 2 calf creep system treatments for production efficiency (total weaning weight per land area), and net returns to the enterprise, were made. Pastures with medium frame cows and designated creep systems had the greatest production efficiency, but also had the highest costs and netted the least returns. Greatest net returns were achieved in large frame, forward creep systems, which had the lowest production efficiency but also the lowest costs. Provided the quality of calves produced is suitable for other phases of the production stream, we conclude that minimizing costs rather than maximizing productive outputs is a better focus for cow-calf enterprises faced with similar decisions among frame size and creep system treatments.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-07T09:00:14Z (GMT). No. of bitstreams: 1  Emenheiser_JC_D_2014.pdf: 1199517 bytes, checksum: 5e5a5c6c0767c11527b78b6f90b896b2 (MD5)    Previous issue date: 2014-01-06",
  "format_medium": "ETD",
  "handle": "24787",
  "identifier_other": "vt_gsexam:2161",
  "identifier_uri": "http://hdl.handle.net/10919/24787",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Appalachia",
    "beef",
    "cow-calf",
    "economics",
    "forage dynamics",
    "production"
  ],
  "title": "Economic Pasture-Based Cow-Calf Systems for Appalachia",
  "type": "Dissertation"
}