{
  "contributor_author": "Womack, Janet Leigh",
  "contributor_committeechair": "Tripp, Norman Wayne",
  "contributor_committeemember": [
    "Craig, James Richard",
    "Sellers, James Louis",
    "Whitaker, Carol E"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-01-14T09:00:23Z",
  "date_available": "2014-01-14T09:00:23Z",
  "date_issued": "2014-01-13",
  "degree_discipline": "Educational Leadership and Policy Studies",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "Since the inception of No Child Left Behind, particularly in the past few years, teacher accountability is at the forefront of educational debate. Taking in to account the many facets of teacher accountability, student performance is nearly half of teacher evaluation systems. Considering the value of a quality teacher, one would logically presume that the teacher was present in the classroom to ensure student achievement. However, teacher absenteeism is an overlooked issue in today’s accountability system. The relative dearth of evidence and a practitioner’s lens of logical reason prompted an interest to investigate the relationship further. The historical perspective in the literature that does exist related to teacher absenteeism revealed that teacher absences are expensive and negatively affects student achievement.   The purpose of the quantitative study was to determine if patterns exist among teacher absences and to determine the relationship between teacher absences and student achievement performance on state standardized tests in English, math, science, and social studies. A quantitative research design was employed using one-way analysis of variance (ANOVA) and sequential multiple regression as the primary analytical procedures. Using data from a single school division in Virginia, analyses were conducted to determine if there were patterns among teachers’ absences, if teacher absences predicted student achievement, and if teacher absences influenced certain student groups more than others. Although some evidence in the research literature indicates that student achievement decreased with increased teacher absenteeism, the current investigation did not reveal consequential evidence that teacher absenteeism negatively impacts student achievement. Implications from the findings, along with recommendations for future research, are presented in the final chapter.",
  "description_degree": "EDD",
  "description_provenance": "Made available in DSpace on 2014-01-14T09:00:23Z (GMT). No. of bitstreams: 1  Womack_JL_T_2014.pdf: 1066001 bytes, checksum: 8240d7c01f5c92928d82bb596df05a53 (MD5)    Previous issue date: 2014-01-13",
  "format_medium": "ETD",
  "handle": "24821",
  "identifier_other": "vt_gsexam:2054",
  "identifier_uri": "http://hdl.handle.net/10919/24821",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "absenteeism",
    "teachers",
    "teacher absenteeism",
    "teacher attendance",
    "student achievement"
  ],
  "title": "The Patterns and Possible Costs of Teacher Absenteeism: Are Teacher Absences an Indicator of Student Achievement?",
  "type": "Dissertation"
}