{
  "contributor_author": "Arriola Apelo, Sebastian Ignacio",
  "contributor_committeechair": "Hanigan, Mark Daniel",
  "contributor_committeemember": [
    "Kebreab, Ermias",
    "McGilliard, Michael L",
    "Akers, Robert M"
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-01-16T21:17:12Z",
  "date_available": "2014-01-16T21:17:12Z",
  "date_issued": "2013-05-24",
  "degree_discipline": "Animal Sciences, Dairy",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Specific AA have been demonstrated to activate signaling pathways that regulate<br />translation initiation and to stimulate protein synthesis in mammary tissue. The<br />objectives of this research were to determine the response to Ile, Leu, Met, and Thr in<br />cellular signaling and \"-S1 casein fractional synthesis rates (CFSR). An experiment was<br />developed as a composite design. The experiment was replicated in tissue corresponding<br />to 5 cows. Mammary tissue slices (0.12 ± 0.02 g) from lactating dairy cows were<br />incubated 4 h in treatment media enriched with 2H5 Phe. Following incubation, slices<br />were homogenized in lysis buffer and caseins were precipitated by acidification to pH<br />4.6. An aliquot of the pellet was trypsinized and 2H5 Phe enrichment in the 34-<br />NLLRFFVAPFPE-45 peptide of \"-S1 casein was measured by MALDI TOF-MS and<br />used to determine CFSR (%/h). Western immunoblotting was performed to identify total<br />and site-specific phosphorylated mammalian target of rapamycin (mTOR, Ser2448),<br />eukaryotic elongation factor (eEF) 2 (Thr56), ribosomal protein (rp) S6 (Ser235/236),<br />and eukaryotic initiation factor (eIF) 2\" (Ser51). Addition of Ile, Leu, Met, or Thr had<br />no effect on eIF2\" phosphorylation. Isoleucine positively affected mTOR, and rpS6, and<br />negatively affected eEF2 phosphorylation. Leu had a similar effect on eEF2, but not on<br />mTOR or rpS6, and these two AA inhibited each other. Thr negatively interacted with<br />Ile on mTOR and rpS6, and with Leu on eEF2. Increasing concentrations of Ile, Leu,<br />Met, and Thr caused curvilinear increases in CFSR. The maximum response to Ile, Leu,<br />iii<br />Met, and Thr was at 71, 49, 60, and 65% of DMEM concentrations, respectively. All<br />maximums were above plasma AA concentrations observed in lactating cows fed to meet<br />NRC requirements. The CFSR estimated at those maximums were similar between AA<br />(3.6 ± 0.6 %/h). Individual AA effects on CFSR did not correlate with mTOR signaling.<br />Independent CFSR responses to individual essential AA observed in this study contradict<br />the single-limiting AA theory assumed in current requirement systems. The saturable<br />responses of CFSR to these 4 AA also demonstrate the deficiencies of a fixed postabsorptive<br />AA efficiency approach for determining AA requirements for milk protein<br />synthesis.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-16T21:17:12Z (GMT). No. of bitstreams: 1 Arriola_Apelo_SI_D_2013.pdf: 2807301 bytes, checksum: 6c3ffa0e6e6eac9faa21288a71500065 (MD5)   Previous issue date: 2013-05-24",
  "format_medium": "ETD",
  "handle": "24866",
  "identifier_other": "vt_gsexam:990",
  "identifier_uri": "http://hdl.handle.net/10919/24866",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "essential amino acid",
    "mTOR",
    "casein",
    "protein synthesis"
  ],
  "title": "Essential Amino Acid Regulation of Cell Signaling and Casein Synthesis in Mammary Tissue",
  "type": "Dissertation"
}