{
  "contributor_author": "Celebi, Oguzhan",
  "contributor_committeechair": "Riffle, Judy S",
  "contributor_committeemember": [
    "Turner, Sam Richard",
    "McGrath, James E",
    "Davis, Richey M",
    "Esker, Alan R"
  ],
  "contributor_department": "Learning Sciences and Technologies",
  "date_accessioned": "2014-01-20T09:00:07Z",
  "date_available": "2014-01-20T09:00:07Z",
  "date_issued": "2014-01-19",
  "degree_discipline": "Macromolecular Science and Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This dissertation focuses on the synthesis and characterization of functional poly(2-ethyl-2-oxazoline) (PEtOx) containing homo- and block copolymers that are potential materials for membrane-based water purification and gas separation, drug delivery, magnetic resonance imaging and tissue engineering applications.  The polymerization of 2-ethyl-2-oxazoline (EtOx) was investigated with regard to the effects of initiator structures and reaction parameters such as polymerization time and temperature on molecular weight control and molecular weight distribution, endgroup functionality, living characteristics, and mechanism and kinetics. The structure of initiators was shown to significantly affect the molecular weight control and molecular weight distribution of PEtOx oligomers. Methyl triflate initiated polymerizations were found to result in oligomers with low polydispersity (PDI) values around 1.10-1.15 and symmetrical chromatograms were obtained via size exclusion chromatography (SEC) studies with the use of refractive index, light scattering and viscosity detectors. However, EtOx polymerizations initiated by halide containing initiators such as benzyl chloride, dibromo- and diiodo-p-xylene, and vinylsilylpropyl iodides yielded PEtOx oligomers with higher PDI values ~ 1.30-1.40. Higher molecular weight distributions can be attributed to the presence of covalent species during polymerization and slower initiation rate as evidenced by kinetic studies when compared to PEtOx prepared from methyl triflate initiators. In all cases, termination reactions with aliphatic cyclic amines were quantitative. Mono- and diamine functional PEtOx oligomers with controlled molecular weight and excellent end-group functionality may be used as prepolymers for incorporation into multiblock and graft copolymer and crosslinked structures for a variety of applications such as membranes and hydrogels for tissue engineering matrices. Poly(2-ethyl-2-oxazoline) containing block copolymers were prepared using the macroinitiator method. First, amphiphilic triblock copolymers with hydrophobic poly(arylene ether sulfone) (PSF) central block and hydrophilic PEtOx side blocks were synthesized via polymerization of EtOx sequences from tosylate functional telechelic PSF macroinitiators. PSFs are well-known engineering thermoplastics with excellent resistance to hydrolysis and oxidation, as well as displaying good mechanical properties, thermal stability and toughness. Phenol functional PSFs were prepared via step-growth polymerization of dichlorodiphenylsulfone and bisphenol-A (slight excess) monomers. Phenolic chain ends were then converted to aliphatic hydroxyethyl endgroups by reaction with ethylene carbonate. Upon treatment with p-toluenesulfonyl chloride, tosylate functional PSF macroinitiators were prepared. PEtOx-b-PSF-b-PEtOx triblock copolymers (pendent acyl groups of PEtOx side blocks) were partially hydrolyzed in an acidic medium to introduce random charged poly(ethylene imine) units to prepare ionomer structures that may show good salt rejection, water flux and antibacterial properties for membrane-based water purification applications.     Phosphonic acid modified poly(ethylene oxide)-b-poly(2-ethyl-2-oxazoline) (PEO-b-PEtOx) diblock copolymers were prepared via cationic ring opening polymerization of EtOx monomers from tosylate functional PEO macroinitiators and subsequent functionalization reactions on the polyoxazoline block. Post-modification reactions included controlled partial pendent acyl group hydrolysis under an acidic medium to form the random block copolymers of PEtOx and poly(ethyleneimine) (PEI), Michael addition of diethylvinyl phosphonate groups to PEI units and hydrolysis of the ethyl groups on the phosphonates to yield pendent phosphonic acid groups on the polyoxazoline block. After each step of functionalization reactions, structures and compositions were confirmed utilizing 1H NMR and the degree of phosphorylation was found to be > 95%. Both PEO and PEtOx are biocompatible polymers and the anionic quality of the phosphonic acid has the potential to be pH controllable and provide an environment where cationic drugs and contrast agents can be attached. Thus, these polymers have potential as drug carriers and contrast enhancement agents for magnetic resonance imaging applications.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-20T09:00:07Z (GMT). No. of bitstreams: 2 Celebi_O_D_2014.pdf: 4366041 bytes, checksum: 620405460b7550b4e7ba64762540da60 (MD5) Celebi_O_D_2014_support_1.pdf: 204790 bytes, checksum: d115bef6509735588c0888b7e652c72f (MD5)   Previous issue date: 2014-01-19",
  "format_medium": "ETD",
  "handle": "24908",
  "identifier_other": "vt_gsexam:1967",
  "identifier_uri": "http://hdl.handle.net/10919/24908",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Oxazoline",
    "membrane",
    "block copolymer",
    "2-ethyl-2-oxazoline",
    "prepolymer",
    "cationic ring opening polymerization",
    "size exclusion chromatography",
    "phosphonate"
  ],
  "title": "Synthesis and Characterization of Poly(2-Ethyl-2-Oxazoline) Functional  Prepolymers and Block Copolymers",
  "type": "Dissertation"
}