{
  "contributor_author": "Guan, Youliang",
  "contributor_committeechair": "Dillard, David A",
  "contributor_committeemember": [
    "West, Robert L",
    "Lesko, John J",
    "Dillard, John Gammons",
    "Batra, Romesh C"
  ],
  "contributor_department": "Engineering Science and Mechanics",
  "date_accessioned": "2014-01-18T09:00:07Z",
  "date_available": "2014-01-18T09:00:07Z",
  "date_issued": "2014-01-17",
  "degree_discipline": "Engineering Mechanics",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Structural adhesives are widely used with great success, and yet occasional failures can occur, often resulting from improper bonding procedures or joint design, overload or other detrimental service situations, or in response to a variety of environmental challenges.  In these situations, cracks can start within the adhesive layer or debonds can initiate near an interface.  The paths taken by propagating cracks can affect the resistance to failure and the subsequent service lives of the bonded structures.  The behavior of propagating cracks in adhesive joints remains of interest, including when some critical environments, complicated loading modes, or uncertainties in material/interfacial properties are involved. From a mechanics perspective, areas of current interest include understanding the growth of damage and cracks, loading rate dependency of crack propagation, and the effect of mixed mode fracture loading scenarios on crack path selection. This dissertation involves analytical, numerical, and experimental evaluations of crack propagation in several adhesive joint configurations.  The main objective is an investigation of crack path selection in adhesively bonded joints, focusing on in-plane fracture behavior (mode I, mode II, and their combination) of bonded joints with uniform bonding, and those with locally weakened interfaces.  When removing cured components from molds, interfacial debonds can sometimes initiate and propagate along both mold surfaces, resulting in the molded product partially bridging between the two molds and potentially being damaged or torn.  Debonds from both adherends can sometimes occur in weak adhesive bonds as well, potentially altering the apparent fracture behavior.  To avoid or control these multiple interfacial debonding, more understanding of these processes is required. An analytical model of 2D parallel bridging was developed and the interactions of interfacial debonds were investigated using Euler-Bernoulli beam theory. The numerical solutions to the analytical results described the propagation processes with multiple debonds, and demonstrated some common phenomena in several different joints corresponding to double cantilever beam configurations. The analytical approach and results obtained could prove useful in extensions to understanding and controlling debonding in such situations and optimization of loading scenarios. Numerical capabilities for predicting crack propagation, confirmed by experimental results, were initially evaluated for crack behavior in monolithic materials, which is also of interest in engineering design.  Several test cases were devised for modified forms of monolithic compact tension specimens (CT) were developed.  An asymmetric variant of the CT configuration, in which the initial crack was shifted to two thirds of the total height, was tested experimentally and numerically simulated in ABAQUS®, with good agreement.  Similar studies of elongated CT specimens with different specimen lengths also revealed good agreement, using the same material properties and cohesive zone model (CZM) parameters.  The critical specimen length when the crack propagation pattern abruptly switches was experimentally measured and accurately predicted, building confidence in the subsequent studies where the numerical method was applied to bonded joints.  In adhesively bonded joints, crack propagation and joint failure can potentially result from or involve interactions of a growing crack with a partially weakened interface, so numerical simulations were initiated to investigate such scenarios using ABAQUS®. Two different cohesive zone models (CZMs) are applied in these simulations: cohesive elements for strong and weak interfaces, and the extended finite element method (XFEM) for cracks propagating within the adhesive layer. When the main crack approaches a locally weakened interface, interfacial damage can occur, allowing for additional interfacial compliance and inducing shear stresses within the adhesive layer that direct the growing crack toward the weak interface. The maximum traction of the interfacial CZM appears to be the controlling parameter. Fracture energy of the weakened interface is shown to be of secondary importance, though can affect the results when particularly small (e.g. 1% that of the bulk adhesive). The length of the weakened interface also has some influence on the crack path. Under globally mixed mode loadings, the competition between the loading and the weakened interface affects the shear stress distribution and thus changes the crack path. Mixed mode loading in the opposite direction of the weakened interface is able to drive the crack away from the weakened interface, suggesting potential means to avoid failure within these regions or to design joints that fail in a particular manner.  In addition to the analytical and numerical studies of crack path selection in adhesively bonded joints, experimental investigations are also performed.  A dual actuator load frame (DALF) is used to test beam-like bonded joints in various mode mixity angles. Constant mode mixity angle tracking, as well as other versatile loading functions, are developed in LabVIEW® for use with a new controller system. The DALF is calibrated to minimize errors when calculating the compliance of beam-like bonded joints. After the corrections, the resulting fracture energies ( ) values are considered to be more accurate in representing the energy released in the crack propagation processes. Double cantilever beam (DCB) bonded joints consisting of 6061-T6 aluminum adherends bonded with commercial epoxy adhesives (J-B Weld, or LORD 320/322) are tested on the DALF. Profiles of the values for different constant mode mixity angles, as well as for continuously increasing mode mixity angle, are plotted to illustrate the behavior of the crack in these bonded joints. Finally, crack path selection in DCB specimens with one of the bonding surfaces weakened was studied experimentally, and rate-dependency of the crack path selection was found. Several contamination schemes are attempted, involving of graphite flakes, silicone tapes, or silane treatments on the aluminum oxide interfaces. In all these cases, tests involving more rapid crack propagation resulted in interfacial failures at the weakened areas, while slower tests showed cohesive failure throughout. One possible explanation of this phenomenon is presented using the rate-dependency of the yield stress (commonly considered to be corresponding to the maximum traction) of the epoxy adhesives. These experimental observations may have some potential applications tailoring adhesive joint configurations and interface variability to achieve or avoid particular failure modes.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-18T09:00:07Z (GMT). No. of bitstreams: 2 Guan_Y_D_2014.pdf: 8019176 bytes, checksum: ac6c9eb150c8d8c19998b1211e40d889 (MD5) Guan_Y_D_2014_support_1.pdf: 316252 bytes, checksum: b2b4a8e84399a887768da155923955ec (MD5)   Previous issue date: 2014-01-17",
  "format_medium": "ETD",
  "handle": "24905",
  "identifier_other": "vt_gsexam:2146",
  "identifier_uri": "http://hdl.handle.net/10919/24905",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Strain energy release rate",
    "double cantilever beam (DCB)",
    "fracture energy",
    "adhesively bonded joints",
    "crack path selection",
    "mode mixity angle",
    "shear toughening effect",
    "cohesive zone model",
    "fracture mechanics",
    "locally weakened interface",
    "crack steering"
  ],
  "title": "Crack path selection and shear toughening effects due to mixed mode loading and varied surface properties in beam-like adhesively bonded joints",
  "type": "Dissertation"
}