{
  "contributor_author": "Jong, Edmund Chime",
  "contributor_committeechair": "Luxbacher, Kramer Davis",
  "contributor_committeemember": [
    "Westman, Erik Christian",
    "Karmis, Michael E",
    "Agioutantis, Zacharias",
    "Perera, Inoka Eranda"
  ],
  "contributor_department": "Mining and Minerals Engineering",
  "date_accessioned": "2014-01-21T09:00:35Z",
  "date_available": "2014-01-21T09:00:35Z",
  "date_issued": "2014-01-20",
  "degree_discipline": "Mining Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The use of sulfur hexafluoride (SF6) as a tracer gas for analyzing underground mine ventilation systems has been practiced for over 30 years. As a result, the methods used to release, sample, and analyze SF6 are well accepted. Although improvements are still being made to enhance the analysis of this tracer, the overall technique remains largely the same. However, as the complexity and size of underground mine ventilation networks increase, coupled with steadily rising SF6 background levels, the ability of a single gas to function as a convenient, rapid means of analysis diminishes. The utilization of multiple tracer gases can mitigate these problems by allowing for a more comprehensive evaluation using multi-zone techniques. A well-documented alternative in HVAC studies to SF6 as a tracer are perfluorocarbon tracers (PFT). Many PFTs exist as volatile liquids at room temperature and pressure. This characteristic prevents a PFT from being released using the same technique as SF6. This paper introduces a passive release method for PMCH. Details about the development of the permeation plug release vessel (PPRV) from creating a GC calibration curve for vapor PMCH to the final field evaluation are presented. The following study successfully developed a mine-scale PPRV. The PPRV is designed to passively deploy PMCH vapor at linear.  An equation was derived in this study that allows the prediction of the release rate as a function of temperature and plug thickness. Details regarding the development of the PPRV from preliminary laboratory studies to final field evaluations are provided.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-21T09:00:35Z (GMT). No. of bitstreams: 1 Jong_EC_D_2014.pdf: 2429343 bytes, checksum: 423a7ed40ea0a682057f33fa6cd1d78d (MD5)   Previous issue date: 2014-01-20",
  "format_medium": "ETD",
  "handle": "24912",
  "identifier_other": "vt_gsexam:1956",
  "identifier_uri": "http://hdl.handle.net/10919/24912",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "tracer gas",
    "PMCH",
    "PFT",
    "passive release",
    "mine ventilation",
    "underground mines",
    "gas chromatography"
  ],
  "title": "Development and Evaluation of a Permeation Plug Release Vessel (PPRV) for the Release of Perfluoromethylcyclohexane (PMCH) in Underground Mine Tracer Gas Studies",
  "type": "Dissertation"
}