{
  "contributor_author": "Dohm, Erich David",
  "contributor_committeechair": [
    "Ripepi, Nino S",
    "Luttrell, Gerald H"
  ],
  "contributor_committeemember": [
    "Adel, Gregory T",
    "Karmis, Michael E"
  ],
  "contributor_department": "Mining and Minerals Engineering",
  "date_accessioned": "2014-01-25T09:00:36Z",
  "date_available": "2014-01-25T09:00:36Z",
  "date_issued": "2014-01-24",
  "degree_discipline": "Mining Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Roll press briquetting of coal-biomass mixtures presents a significant opportunity to address feedstock challenges associated with co-utilization of coal and biomass in existing coal-fired facilities. However, several technical and economic barriers require further investigation prior to industrial utilization of coal-biomass briquettes. The scientific contributions presented in this dissertation are intended to address the most critical technical challenges pertaining to coal-biomass briquette feedstocks. As with any product of an agglomeration process, the primary technical challenge regarding coal-biomass briquettes is achieving and maintaining a high level of quality from production to utilization. Several laboratory-scale research investigations were conducted to address this challenge. The first study was conducted to identify, develop and refine methods to characterize the most important physical properties indicative of coal-biomass briquette quality. The outcome of this work is a set of recommendations for novel and refined methods to characterize important coal-biomass briquette properties. The second study was conducted to develop a novel method to identify the optimum water content of coal-biomass blends prior to briquette production. As a result of this study, the Briquette Proctor Test was developed to minimize the time and materials required to identify the optimum water content that corresponds to maximum quality of coal-biomass briquettes. The third study was conducted to evaluate the influence of feedstock variables, additive variables, and roll press operating parameters in the production of coal-biomass briquettes from various coal and biomass types. From this study, the influence of each parameter on the quality of briquettes was determined and optimum conditions were identified for a variety of coal-biomass mixtures. The fourth and final study was conducted to develop and evaluate methods to improve the water resistance of coal-biomass briquettes using wood-derived chemicals. Using these chemicals, the novel coating method developed in this study significantly improved the water resistance and weathered durability of coal-biomass briquettes.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-25T09:00:36Z (GMT). No. of bitstreams: 2 Dohm_ED_D_2014.pdf: 70899816 bytes, checksum: 3b1790f59b6ce70020524710025b0ef8 (MD5) Dohm_ED_D_2014_support_1.pdf: 156098 bytes, checksum: 7b897746735541c5fd11cee50366c15e (MD5)   Previous issue date: 2014-01-24",
  "format_medium": "ETD",
  "handle": "25146",
  "identifier_other": "vt_gsexam:2005",
  "identifier_uri": "http://hdl.handle.net/10919/25146",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Coal-biomass briquette",
    "roll press briquetting",
    "briquette characterization"
  ],
  "title": "Production and Characterization of Coal-Biomass Briquettes",
  "type": "Dissertation"
}