{
  "contributor_author": "Palit, Manjushree",
  "contributor_committeechair": "Piercy, Fred P",
  "contributor_committeemember": [
    "Keeling, Margaret LongJourney",
    "Kaestle, Christine",
    "Savla, Jyoti Shital"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-01-25T09:00:23Z",
  "date_available": "2014-01-25T09:00:23Z",
  "date_issued": "2014-01-24",
  "degree_discipline": "Human Development",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The objective of this dissertation study was to investigate the lived experiences of intimacy in married couples in India. The researcher specifically explored the couples' intimacy experiences in six dimensions: emotional closeness and self-disclosure, shared ideas and support, sexual intimacy, relationship skills, commitment and social intimacy. The Zaltman Metaphor Elicitation Technique (ZMET), an innovative method of data collection was used to collect pictures as metaphors from 11 couples (N=22) and the researcher conducted 45-90 minutes in-depth phone interviews. Phenomenological approach was used for data analysis and five themes (description, positive and negative experiences, barriers and strategies used, changes over time and perceived societal norms) provided information on the six dimensions of intimacy. The findings confirmed that intimacy is experienced in married Indian couples in each of the above mentioned dimensions. In addition, when intimacy is experienced they are viewed positively and lack of intimacy is viewed negatively in each dimensions. Couples also perceived barriers to their achievement of intimacy and developed strategies that helped them maintain intimacy in their marriage over time. Gender differences were present, for wives, emotional closeness and self-disclosure was more important, whereas for men, commitment was more important. The findings have implications for marriage education programs and clinicians working with married Indian couples.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-25T09:00:23Z (GMT). No. of bitstreams: 2 Palit_M_D_2014.pdf: 2249849 bytes, checksum: aede6855edf02c43c01eaff9374ddfb3 (MD5) Palit_M_D_2014_support_1.pdf: 20508333 bytes, checksum: b45d5e33dd4aab2ac7e6c92adb4b9759 (MD5)   Previous issue date: 2014-01-24",
  "format_medium": "ETD",
  "handle": "25144",
  "identifier_other": "vt_gsexam:1892",
  "identifier_uri": "http://hdl.handle.net/10919/25144",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Intimacy",
    "couples",
    "close relationship",
    "closeness",
    "ZMET"
  ],
  "title": "Uncovering Messages of Intimacy in Urban, Educated, and Middle-income Married Indian Couples: A Phenomenological Study Using Pictures as Metaphors",
  "type": "Dissertation"
}