{
  "contributor_author": "Flack, Kyle",
  "contributor_committeechair": "Davy, Brenda Mueller",
  "contributor_committeemember": [
    "Winett, Richard A",
    "Frisard, Madlyn Irene",
    "Hulver, Matthew Wade",
    "Davy, Kevin P"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-01-24T09:00:48Z",
  "date_available": "2014-01-24T09:00:48Z",
  "date_issued": "2014-01-23",
  "degree_discipline": "Human Nutrition, Foods, and Exercise",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The Effects of Resistance Training on Aged Skeletal Muscle and Mitochondrial Function  Kyle D. Flack  ABSTRACT   With the aging of the baby boom population and an increased life expectancy, individuals aged 65 years and older are the fastest growing segment of our population.  Aging brings about changes in skeletal muscle such as reduced muscle strength and mass, as well as cellular deficits such as increased production of reactive oxygen species (ROS), and mitochondrial DNA (MtDNA) deletions and mutations.  Muscle mass declines at a rate of 1-2% each year after the age of 50, leading to muscle weakness, functional impairments, loss of independence, and an increase in falls.  Additional declines in muscle mass and reduced muscle strength may result in a lower resting metabolic rate, reduced lipid oxidative capacity, increased adiposity, and insulin resistance.  The rising number of individuals aged 65+ will increase demands on health care and health care costs, possibly leading to inadequate public resources and less care for the aged.  This large societal impact, coupled with the aging of our population, suggests a clear need for methods that will improve the aging phenotype to enhance functionality, quality of life, and overall health for our aging population.  This investigation aspires to delve into a relatively unexplored area of aging research and evaluate potential means  that could help improve the aging phenotype.   The associated mitochondrial impairments, mitochondrial mediated apoptosis, and mitochondrial DNA (MtDNA) deletions and mutations that accompany aging lead to a decline in physical fitness and oxidative capacity, and exercise has been shown to reverse or help prevent many of these disturbances.  Resistance exercise training (RT) is currently the most effective known strategy to stimulate skeletal muscle hypertrophy and increase strength.  Strength gains after RT lead to an improvement in activities of daily living and quality of life.  There is some evidence suggesting that RT may lead to increased antioxidant enzyme capacity, decreased ROS production and increased electron transport chain (ETC) function in older individuals.  The present study will lay a foundation for future research and further developments in the area of RT, mitochondrial function and aging.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-24T09:00:48Z (GMT). No. of bitstreams: 1 Flack_K_D_2014.pdf: 1415654 bytes, checksum: ff0f309423e053b49fef7a0302d8b401 (MD5)   Previous issue date: 2014-01-23",
  "format_medium": "ETD",
  "handle": "25143",
  "identifier_other": "vt_gsexam:2232",
  "identifier_uri": "http://hdl.handle.net/10919/25143",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Resistance Training",
    "Mitochondrial Function",
    "Aging"
  ],
  "title": "Effects of Resistance Training on aged Skeletal Muscle and Mitochondrial Function",
  "type": "Dissertation"
}