{
  "contributor_author": "Kim, Daeung",
  "contributor_committeechair": "Jones, James R",
  "contributor_committeemember": [
    "Grant, Elizabeth Joyce",
    "Telionis, Demetrios P",
    "Schubert, Robert P",
    "Ragab, Saad A"
  ],
  "contributor_department": "Architecture",
  "date_accessioned": "2014-01-24T09:00:32Z",
  "date_available": "2014-01-24T09:00:32Z",
  "date_issued": "2014-01-23",
  "degree_discipline": "Architecture and Design Research",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Computational Fluid Dynamics (CFD) can play an important role in building design. For all aspects and stages of building design, CFD can be used to provide more accurate and rapid predictions of building performance with regard to air flow, pressure, temperature, and similar parameters.  Generally, the process involved in conducting CFD analyses is relatively complex and requires a good understanding of how best to utilize computational numerical methods. Moreover, the level of skill required to perform an accurate CFD analysis remains a challenge for many professionals particularly architects. In addition, the user needs to input a number of different items of information and parameters into the CFD program in order to obtain a successful and credible solution.  This research seeks to improve the general understanding of how CFD can best be used as a design assistance tool. While there have been a number of quantitative studies suggesting CFD may be a useful tool for building related airflow assessment, few researchers have explored the more qualitative aspects of CFD, in particular developing a better understanding of the procedures required for the proper application of CFD to whole building analysis. This study therefore adopted a combined qualitative and quantitative methodology, with the researcher immersing himself into a case study approach and defining several lessons-learned that are documented and shared. This research will assist practicing architects and architecture students to better understand the application of CFD to building analysis and design.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-24T09:00:32Z (GMT). No. of bitstreams: 2 Kim_D_D_2014.pdf: 7155464 bytes, checksum: 3d370379e26f78862d413d52517d3cc4 (MD5) Kim_D_D_2014_support_1.pdf: 42558209 bytes, checksum: c21239f9bc45ddae5318a26621c437ee (MD5)   Previous issue date: 2014-01-23",
  "format_medium": "ETD",
  "handle": "25140",
  "identifier_other": "vt_gsexam:2136",
  "identifier_uri": "http://hdl.handle.net/10919/25140",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Computational Fluid Dynamics",
    "building design",
    "design assistance tool",
    "immersive case study",
    "wind tunnel tests"
  ],
  "title": "THE APPLICATION OF CFD TO BUILDING ANALYSIS AND DESIGN:   A COMBINED APPROACH OF AN IMMERSIVE CASE STUDY AND WIND TUNNEL TESTING",
  "type": "Dissertation"
}