{
  "contributor_author": "Merritt, Travis Robert",
  "contributor_committeechair": "Khodaparast, Giti",
  "contributor_committeemember": [
    "Pitt, Mark L",
    "Westwood, James H",
    "Robinson, Hans"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-01-25T09:00:48Z",
  "date_available": "2014-01-25T09:00:48Z",
  "date_issued": "2014-01-24",
  "degree_discipline": "Physics",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The techniques of optoperforation, spectral characterization of alloy disorder, and metal-enhanced fluorescence were applied to previously unconsidered or disregarded systems in order to demonstrate that such applications are both feasible and consequential. These applications were the subject of three disparate works and, as such, are independently discussed.  Despite being ostensibly restricted to mammalian cells, optoperforation was demonstrated in intact plant cells by means of successful femtosecond-laser-mediated infiltration of a membrane impermeable dextran-conjugated dye into cells of vital Arabidopsis seedling stems. By monitoring the rate of dye uptake, and the reaction of both CFP-expressing vacuoles and nanocellulose substrates, the intensity and exposure time of the perforating laser were adjusted to values that both preserved cell vitality and permitted the laser-assisted uptake of the fluorophore. By using these calibrated laser parameters, dye was injected and later observed in targeted cells after 72 hours, all without deleteriously affecting the vital functions of those cells.     In the context of alloy disorder, photoluminescence of excitonic transitions in two InAsxP1-x alloys were studied through temperature and magnetic field strength dependencies, as well as compositionally-dependent time-resolved behavior. The spectral shape, behavior of the linewidths at high magnetic fields, and the divergence of the peak positions from band gap behavior at low temperatures indicated that alloy disorder exists in the x=0.40 composition while showing no considerable presence in the x=0.13 composition. The time-resolved photoluminescence spectrum for both compositions feature a fast and slow decay, with the slow decay lifetime in x=0.40 being longer than that of x=0.13, which may be due to carrier migration between localized exciton states in x=0.40.   In order to achieve broadband metal-enhanced fluorescence in upconverting NaYF4:Yb,Er nanocrystals,  two nanocomposite architectures were proposed that retrofit metallic nanoshells to these lanthanide-doped nanocrystals. The typical monometallic construction was rejected in favor of architectures featuring Au-Ag bimetallic concentric surfaces, a decision supported by the considerable overlap of the calculated plasmon modes of the metallic structures with the emission and absorption spectrum of the nanocrystals. Furthermore, precursors of these nanocomposites were synthesized and photoluminescence measurements were carried out, ultimately verifying that these precursors produce the requisite upconversion emissions.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-25T09:00:48Z (GMT). No. of bitstreams: 2 Merritt_TR_D_2014.pdf: 4614081 bytes, checksum: f54719a859f418081b46b63075aa0af1 (MD5) Merritt_TR_D_2014_support_1.xps: 201349 bytes, checksum: d4476453385fbaeed7c57c4ffce5d071 (MD5)   Previous issue date: 2014-01-24",
  "format_medium": "ETD",
  "handle": "25148",
  "identifier_other": "vt_gsexam:1933",
  "identifier_uri": "http://hdl.handle.net/10919/25148",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "optoperforation",
    "laser-mediated plant cell disruption",
    "alloy disorder",
    "photoluminescence of III-V alloys",
    "plasmonically enhanced emission",
    "metal-enhanced  absorption",
    "upconversion",
    "nanocolloid",
    "interdisciplinary"
  ],
  "title": "Optoperforation of Intact Plant Cells, Spectral Characterization of Alloy Disorder in InAsP  Alloy Disorder in InAsP Alloys, and Bimetallic Concentric Surfaces for Metal-Enhanced  Fluorescence in Upconverting Nanocrystals",
  "type": "Dissertation"
}