{
  "contributor_author": "Hogan, Karla Loraine",
  "contributor_committeechair": "Mallory, Walter D.",
  "contributor_committeemember": [
    "Sheers, Kelly Lynn",
    "Cash, Carol S.",
    "Glenn, William Joseph"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-01-24T09:00:37Z",
  "date_available": "2014-01-24T09:00:37Z",
  "date_issued": "2014-01-23",
  "degree_discipline": "Educational Leadership and Policy Studies",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "The leadership of the principal is directly tied to the success or demise of a school.  Principals assume various leadership roles including those of educational leader, decision maker, visionary for change, supervisor of faculty and staff, and communicator with various stakeholders.  This study investigates the alignment between the Interstate School Leaders Licensure Consortium (ISLLC) standards and the successful strategies of outstanding first year principals as well as the behaviors and skills various stakeholders identify as crucial to the first year principal's success.  The topic of outstanding first year principals is important for two reasons.  First strong leadership results in effective schools.  Second, understanding the elements of outstanding leadership can have implications regarding the preparation of first year principals in educational leadership programs.    This qualitative case study examined five award winning principals during the period from 2006 to 2010.  The primary sources of data included interviews with each principal, interviews with a select focus group, and a content analysis of the nominating packet contents.  The results indicate that the principals had a command of the ISLLC standards, were especially skilled with relationships, removed the need for self-recognition and possessed the trait of withitness.  The results of this study provide school districts, school leadership teams, and administrative programs the opportunity to engage in an active dialogue around those areas which can be challenging and more difficult to teach (relationship building, withitness, and removal of self).  The study results suggest that principal preparation programs and administrative programs need to include a more active dialogue about these three elements because of the crucial part they play in establishing strong and effective leaders.  Attention to these areas will result in more well-rounded principals who can meet the demands and needs of all stakeholders, stimulate student achievement, and promote school success.",
  "description_degree": "EDD",
  "description_provenance": "Made available in DSpace on 2014-01-24T09:00:37Z (GMT). No. of bitstreams: 2  Hogan_KL_T_2014.pdf: 673437 bytes, checksum: ee2f777124f95e6c04f37c66261acb6a (MD5)  Hogan_KL_T_2014_support_1.pdf: 673449 bytes, checksum: 1a5b2abf65d7a82531ecfe6a2b1d65ee (MD5)    Previous issue date: 2014-01-23",
  "format_medium": "ETD",
  "handle": "25141",
  "identifier_other": "vt_gsexam:1963",
  "identifier_uri": "http://hdl.handle.net/10919/25141",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Education",
    "Administration"
  ],
  "title": "Behaviors of Outstanding First Year Principals and their Alignment with the ISLLC Standards",
  "type": "Dissertation"
}