{
  "contributor_author": "Robinette, Martin B",
  "contributor_committeechair": "Casali, John Gordon",
  "contributor_committeemember": [
    "Ericson, Mark A.",
    "Smith-Jackson, Tonya L",
    "Agnew, Michael J"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-01-28T09:00:26Z",
  "date_available": "2014-01-28T09:00:26Z",
  "date_issued": "2014-01-27",
  "degree_discipline": "Industrial and Systems Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "A warfighter's situation awareness is vital to their survival and lethality on the battlefield. Situation awareness, achieved through audition, allows the warfighter to quickly and accurately locate the position of fellow warfighters and potential threats. However, hearing loss, acoustic trauma, or the use of hearing protection can diminish this vital ability to locate sounds in the environment accurately. The introduction of electronically modulated hearing protection and enhancement devices (HPED) is an attempt to improve auditory situation awareness for the warfighter. Currently, however, there are no auditory fitness-for-duty measures that allow an warfighter, commander, or medical personnel to assess localization performance in the open-ear or with hearing protection. Such an assessment is important for pre-placement of a warfighter into a hearing critical job and also as a readiness metric prior-to and during a deployment. The ability to measure performance with a hearing protector will also assist warfighters in selecting protection that will afford maximum performance. This study examined a set of auditory fitness for duty (AFFD) test/stimulus combinations designed to quantify horizontal localization performance. Three listening conditions were used throughout the study; they included an open-ear condition as well as in-the- ear HPED and over-the-ear HPED. The Peltor Com-Tac IITM was used as the over-the- ear HPED and the Etymotic EB15 BlastPLGTM was used as the in-the-ear HPED. Stimuli consisted of filtered pink-noise that differed in both duration and frequency. Frequencies ranged from 500-1000 Hz (low) and 3000-6000 Hz (high) and durations included 300 ms (short) and 3 seconds (long). Stimuli were presented at 60 and 70 dB SPL. AFFD measures were specifically designed to measure current performance or to predict performance after training. Measures of current performance include an accuracy test measured in four quadrants (Left-Front, Right-Front, Left-Rear, and Right- Rear) and a front-back confusion test (FBCT). Accuracy within each quadrant was reduced to a mean absolute error, in degrees, for stimuli presented at 30 deg and 60 deg from the medial plane. FBCT consisted of a percent correct for stimuli presented at 0 deg and 180deg. Measures of post-training performance include an inter-aural cues test and a front-back difference test FBDT. The IACT and FBDT required participants to identify if two sequential stimuli were presented from the same or different locations. The IACT was tested in the left-front and right-front quadrants (for stimuli at 30 deg and 60 deg) and the FBCT was tested with stimuli at 0 deg and 180 deg These tests also provided a percent. Results show that the high-frequency long-duration (H-Long) stimuli predicted current localization performance well, for all listening conditions. Other AFFD test/stimulus combinations were also found to predict performance for a given listening condition, but not for all conditions. AFFD measures designed to predict post-training performance did not show any AFFD test/stimuli combinations that worked for all listening conditions. There were some combinations that worked for a given listening condition but not all conditions. A further analysis of the data showed that the limited number and types of HPEDs used may have confounded these results. Passive hearing protectors as well as HPEDs are known to disturb the spectral and temporal auditory cues that allow for accurate localization. While these cues are disturbed they are often still present in the signal heard by the listener. With training/use of a hearing protector, auditory learning may occur that allows these cues to be used again to accurately locate a sound source. Auditory learning was assessed by providing HPED training/use to novice hearing protection users. Pre and post-training testing was performed with the open-ear, in-the-ear HPED, and over-the-ear HPED. Training was provided for only one type of HPED. Results indicate that auditory learning occurred for the training HPED only. There was no crossover of auditory learning to the non-training protector. Other measures of auditory learning included a subjective confidence rating of the HPED and a measure of response time for the localization task. Results showed that confidence increased for the HPED that was used in training. However, no changes in response time were found for any listening condition. Based on the results of this study, it is recommended that AFFD measures continue to be developed for implementation as pre-placement, HPED selection, return-to-duty, and readiness metrics for U.S. military personnel. It is also recommended that objective and subjective measures of hearing protection performance consider the effect of auditory learning. The rating or ranking of HPEDs by novice users of such a device, without adequate training/use to allow for auditory learning, should be weighed carefully.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-28T09:00:26Z (GMT). No. of bitstreams: 2 Robinette_MB_D_2014.pdf: 44150940 bytes, checksum: 5b61ec3e2b3331088c57adb9f8571286 (MD5) Robinette_MB_D_2014_support_1.docx: 138620 bytes, checksum: 830d520e433e22fb3474d76a3f206ed0 (MD5)   Previous issue date: 2014-01-27",
  "format_medium": "ETD",
  "handle": "25152",
  "identifier_other": "vt_gsexam:1763",
  "identifier_uri": "http://hdl.handle.net/10919/25152",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "auditory learning",
    "auditory fitness for duty",
    "localization",
    "electronic pass- through",
    "hearing protection",
    "situation awareness"
  ],
  "title": "Evaluation of a Test Method for Assessing Horizontal Localization and Auditory Learning with Electronic Pass-through Hearing Protection",
  "type": "Dissertation"
}