{
  "contributor_author": "King, David Lorne",
  "contributor_committeechair": "Wolf, James F",
  "contributor_committeemember": [
    "Dull, Matthew Martin",
    "Hickok, Thomas A",
    "Khademian, Anne M"
  ],
  "contributor_department": "School of Public and International Affairs",
  "date_accessioned": "2014-01-30T09:00:57Z",
  "date_available": "2014-01-30T09:00:57Z",
  "date_issued": "2014-01-29",
  "degree_discipline": "Public Administration/Public Affairs",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Performance and accrual-based financial management systems as envisaged in the 1990 Chief Financial Officers (CFO) Act, the 1993 Government Performance and Results Act (GPRA), the 1996 Federal Financial Management Improvement Act (FFMIA) and related legislation have been in place since prior to the turn of the millennium. Nevertheless, although performance has been measured and financial accountability improved in U.S. federal government agencies, there remains a gap in reporting on operational efficiency and effectiveness. This dissertation extends research into performance management to determine the extent to which performance measurement systems report on operational efficiency and effectiveness and thereby further facilitate performance management. It examines outputs as the unit-of-analysis within the input-output-outcome framework of performance measurement and reporting systems and their integration with accrual-based financial management systems in assessing government operations. It challenges the predominantly outcomes-focused reporting system as insufficient to the objective of improved operational efficiency and effectiveness. The research methodology employs qualitative analysis of selected agency performance reports, interviews of selected agency senior managers and oversight officials, analysis of previous research on performance reporting, and analysis of GAO survey data. The research examines an increased focus on output reporting as a means to improve operational efficiency and the linkage of outputs to outcomes as an effectiveness measure. The research leads to the conclusion that very little output efficiency or effectiveness measurement and reporting is occurring. The failure to measure performance in this manner is to the considerable detriment of operational efficiency, effectiveness and cost reduction in the federal government.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-30T09:00:57Z (GMT). No. of bitstreams: 1 King_DL_D_2014.pdf: 3639866 bytes, checksum: 6dea32f4b9b730aec18c1a5ee1e136d4 (MD5)   Previous issue date: 2014-01-29",
  "format_medium": "ETD",
  "handle": "25224",
  "identifier_other": "vt_gsexam:2058",
  "identifier_uri": "http://hdl.handle.net/10919/25224",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Chief Financial Officers (CFO) Act",
    "Efficiency",
    "Effectiveness",
    "Federal Financial Management Improvement Act (FFMIA)",
    "Accrual Accounting",
    "Government Performance and Results Act (GPRA)",
    "Inputs",
    "Outcomes",
    "Outputs",
    "Performance Measurement",
    "Reporting"
  ],
  "title": "Comprehensive Output Measurement: The 'Missing Link' in U.S. Federal Government Performance Reporting",
  "type": "Dissertation"
}