{
  "contributor_author": "Cloyd, Tristan Dane",
  "contributor_committeechair": "Pitt, Joseph C",
  "contributor_committeemember": [
    "Garrison, James W",
    "Laberge, Ann F",
    "Fuhrman, Ellsworth R"
  ],
  "contributor_department": "Science and Technology in Society",
  "date_accessioned": "2014-01-30T09:00:39Z",
  "date_available": "2014-01-30T09:00:39Z",
  "date_issued": "2014-01-29",
  "degree_discipline": "Science and Technology Studies",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This dissertation addresses user responses to the introduction of Brain-Computer Interface technologies (BCI) for gaming and consumer applications in the early part of the 21st century. BCI technology has emerged from the contexts of interrelated medical, academic, and military research networks including an established computer and gaming industry. First, I show that the emergence and development of BCI technology are based on specific economic, socio-cultural, and material factors, and secondly, by utilizing user surveys and interviews, I argue that the success of BCI are not determined by these contextual factors but are dependent on user acceptance and interpretation. Therefore, this project contributes to user-technology studies by developing a model which illustrates the interrelations between producers, users, values, and technology and how they contribute to the acceptance, resistance, and modification in the technological development of emerging BCI technologies. This project focuses on human computer interaction researchers, independent developers, the companies producing BCI headsets, and neuro-gadget companies who are developing BCI's for users as an alternative interface for the enhancement of human performance and gaming and computer simulated experience. Moreover, BCI production and use as modes of enhancement align significantly with social practices of play which allows an expanded definition of technology to include cultural dimensions of play.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-01-30T09:00:39Z (GMT). No. of bitstreams: 1 Cloyd_TD_D_2014.pdf: 1712357 bytes, checksum: e24918796901bff53208814ca84a11a5 (MD5)   Previous issue date: 2014-01-29",
  "format_medium": "ETD",
  "handle": "25221",
  "identifier_other": "vt_gsexam:2048",
  "identifier_uri": "http://hdl.handle.net/10919/25221",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Brain-Computer Interface",
    "Electroencephalography",
    "Neurofeedback",
    "Human-Computer interaction",
    "Video Games",
    "User-Technology Studies",
    "Play"
  ],
  "title": "(r)Evolution in Brain-Computer Interface Technologies for Play: (non)Users in Mind",
  "type": "Dissertation"
}