{
  "contributor_author": "Zhang, Jianyuan",
  "contributor_committeechair": "Dorn, Harry C.",
  "contributor_committeemember": [
    "Santos, Webster",
    "Carlier, Paul R",
    "Gibson, Harry W"
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-02-04T09:00:49Z",
  "date_available": "2014-02-04T09:00:49Z",
  "date_issued": "2014-02-03",
  "degree_discipline": "Chemistry",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Endohedral metalofullerenes (EMFs) have emerged as an important class of nanomaterials with vast promise in applications of molecular devices and nanomedicines. This dissertation addresses the EMF research span from synthesis to application, with an emphasis of work on trimetallic nitride template (TNT) EMF and carbide clusterfullerenes (CCFs).     As a general introduction, chapter 1 reviews the main literature in TNT EMF studies. Also key works in CCF area are highlighted to show the common feature and uniqueness of this class of EMF in comparison with other EMFs. In the last part of the chapter a list of milestone progress in EMF area has been summarized.    Chapter 2 is devoted to the synthetic work on EMFs. Especially, for isotopic modification, the trial and actual EMF syntheses in efforts to introduce 13C, 89Y and 177Lu are described.     The next three chapters address the structural characterization of EMFs. Chapter 3 focuses on structural studies of CCFs. With detailed interpretation of 13C NMR and DFT computational results for selected members of the Y2C2@C2n family, the influence of fullerene cage on the size and shape of the yttrium carbide cluster (Y2C2)4+ is investigated. It has also been established that the carbide cluster prefers a linear shape in sufficiently large fullerene cages but adopts a compressed butterfly shape in smaller cages where space is constrained.     Chapter 4 presents a systemic examination of dipole moments in TNT EMFs. The first 13C NMR study of M3N@C2(22010)-C78 is achieved on Y3N@C2(22010)-C78. In addition, dipole moments of the M3N@C2n (n=39-44) family are probed by interpretation of chromatographic retention behavior, DFT computational results and single-crystal data. It has been found that TNT EMFs with pentalene motifs exhibit enhanced dipole moments due to the cluster-cage interplay.    Chapter 5 provides full characterization of the M2C2@C1(51383)-C84 (M=Y, Gd) molecule, which contains the first example of an asymmetric fullerene cage with fused pentagons. Furthermore, it is suggested that the C1(51383)-C84 cage is capable of a cascade of rearrangements into high symmetry and stable fullerene cages via well-established mechanistic steps, namely, extrusion of C2 units from pentalene or indene motifs and Stone-Wales transformations. As an important intermediate in the formation of high symmetry fullerene cages, the C1(51383)-C84 represents a missing link that implies the \"top-down\" fullerene formation mechanism.    Chapter 6 describes the endeavor to functionalize two exotic EMFs, the room-temperature radical heterometallofullerene Gd2@C79N, and the egg-shaped TNT EMF Gd3N@C84. The reactivity of Gd2@C79N is directly compared to Y2@C79N, Gd3N@C80 and Sc3N@C80 in two reactions and the paramagnetic Gd2@C79N is proven to be very inert toward many known common fullerene cage reactions. Eventually both EMFs have been successfully functionalized via the Bingel reaction, and the derivatives are characterized with HPLC and mass-spectrometry.     Chapter 7 compares the effective magnetic moment of Gd3N@C80 and Gd3N@C84, together with the previously reported Gd@C82. The magnetic moment has a second-order contribution to the T1 relaxivity and thereby is an important factor to evaluate an EMF's value in application as MRI contrast agents. Furthermore the influence of cluster motion to magnetic behavior in TNT EMF is discussed.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-02-04T09:00:49Z (GMT). No. of bitstreams: 2  Zhang_J_D_2014.pdf: 8556481 bytes, checksum: b97375a7e3b4a878fb22bf43fc76f96f (MD5)  Zhang_J_D_2014_support_1.pdf: 287877 bytes, checksum: 07089c847a4da0c685cd26e9a455127e (MD5)    Previous issue date: 2014-02-03",
  "format_medium": "ETD",
  "handle": "25290",
  "identifier_other": "vt_gsexam:1968",
  "identifier_uri": "http://hdl.handle.net/10919/25290",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Endohedral Metallofullerene",
    "Metal Carbide Cluster",
    "Trimetallic Nitride Template",
    "Clusterfullerene",
    "\"Top-down\" Fullerene Formation",
    "Isolated Pentagon Rule",
    "Contrast Agent"
  ],
  "title": "Yttrium, Gadolinium, and Lutetium Based Endohedral Metallofullerenes: From Synthesis to Application",
  "type": "Dissertation"
}