{
  "contributor_author": "Boynton, Matthew Arnold",
  "contributor_committeechair": "Paretti, Marie C.",
  "contributor_committeemember": [
    "Matusovich, Holly",
    "Elkins, Susan Anderson",
    "Gregg, Michael H.",
    "Satterwhite, Emily M."
  ],
  "contributor_department": "Engineering Education",
  "date_accessioned": "2014-02-07T09:00:12Z",
  "date_available": "2014-02-07T09:00:12Z",
  "date_issued": "2014-02-06",
  "degree_discipline": "Engineering Education",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This study explores how students in rural areas of Tennessee's Cumberland Plateau area perceive engineering as a future career. This area is a portion of the greater Appalachian region, which has historically, faced disproportionate economic struggles when compared to other areas of the United States. However, little research on career choice exists outside of the coal producing areas of Central Appalachia. This research, in contrast, focuses on rural counties without interstate access, situated along the Cumberland Plateau in Tennessee, an area with an economy historically based in manufacturing.   \tThis research focuses on understanding students' perceptions of engineering as a future career and on factors that support and inhibit the development of these perceptions. To understand these perceptions, the study used qualitative, semi-structured interviews, situated in a Social Constructivist worldview, informed by the Future Possible Selves framework. Participants include 27 high school students, 7 college engineering students, and 5 college students who had exposure to engineering through a formal program but are currently enrolled in another major.  \tResults of the study show that without access to formal programs or professionals to expose them to engineering, participants did not have a clear perception of engineering, and were not likely to pursue this career. Exposure through a formal program seemed to spark the start of engineering future possible self development by aligning engineering with activities participants enjoy. However, these participants often also believed that they lacked some key \"ability\" needed to become an engineer. Participants who had access to both formal programs and professionals were able to provide a clear description of potential engineering careers, aligning such careers with activities they enjoyed and, importantly, with desired attributes of their future. In addition, participants typically described relationships with professionals as mitigating the fear that an engineering career was beyond their \"ability.\" These results provide evidence, that in this study area, printed materials and programs are not enough; people clearly make the difference in helping students develop a clear perception of engineering as a viable future career choice. This result has multiple implications for engineering educators and industries interested in K-12 outreach.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-02-07T09:00:12Z (GMT). No. of bitstreams: 2  Boynton_MA_D_2014.pdf: 1972533 bytes, checksum: a1b449b3c9867c9473b79d697f0753e3 (MD5)  Boynton_MA_D_2014_support_1.PDF: 902903 bytes, checksum: 9af08f6ffd1d1996ed3f6d1e345548c5 (MD5)    Previous issue date: 2014-02-06",
  "format_medium": "ETD",
  "handle": "25332",
  "identifier_other": "vt_gsexam:2241",
  "identifier_uri": "http://hdl.handle.net/10919/25332",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Engineering",
    "Appalachia",
    "Cumberland Plateau",
    "K-12",
    "Outreach"
  ],
  "title": "People not Print: Exploring Engineering Future Possible Self Development in Rural Areas of Tennessee's Cumberland Plateau",
  "type": "Dissertation"
}