{
  "contributor_author": "Sullivan, Ellen Mowson",
  "contributor_committeechair": "Emmons, Paul F",
  "contributor_committeemember": [
    "Kelsch, Paul J",
    "Altenmuller, Ulrike",
    "Feuerstein, Marcia"
  ],
  "contributor_department": "Architecture",
  "date_accessioned": "2014-02-06T09:00:13Z",
  "date_available": "2014-02-06T09:00:13Z",
  "date_issued": "2014-02-05",
  "degree_discipline": "Architecture and Design Research",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Among the founders of the science of town planning at the beginning of the twentieth century, Scotsman Patrick Geddes introduced methods of investigation commensurate with other sciences.  A biologist, trained by Thomas Huxley, Geddes borrowed the practices of the microscopical laboratory in creating the Outlook Tower in Edinburgh, Scotland which served as a model for an approach to the study of cities.  His method was like that of a field botanist studying a species, and assumed an interdependent relationship between place, work and folk.  Embracing the evolutionary theory of Charles Darwin, Geddes proposed subtle town planning interventions as a means by which cities could adaptively respond to change over time.  He advocated the employ of a graphic device, which he called his \"thinking machines,\" and which served as a paradigmatic strategy to forge new relationships within sets of ideas.  Such an approach aligned him with the taxonomic strategies in practice in the formation of museum collections and display of the nineteenth century. This work examines the archival evidence of  the principles underlying Geddes' methods in the hope that they may be recovered in contemporary town planning.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-02-06T09:00:13Z (GMT). No. of bitstreams: 1 Sullivan_EM_D_2014.pdf: 9087513 bytes, checksum: 0cbcf3d9a6a298eb3188f55ddab74103 (MD5)   Previous issue date: 2014-02-05",
  "format_medium": "ETD",
  "handle": "25330",
  "identifier_other": "vt_gsexam:1776",
  "identifier_uri": "http://hdl.handle.net/10919/25330",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    ": Patrick Geddes",
    "Outlook Tower",
    "Cities and Town Planning Exhibition",
    "19th century",
    "visual culture",
    "museums",
    "collection",
    "display",
    "thinking machines"
  ],
  "title": "Patrick Geddes: Synthetic Vision",
  "type": "Dissertation"
}