{
  "contributor_author": "Shen, Ying",
  "contributor_committeechair": "Viehland, Dwight D",
  "contributor_committeemember": [
    "Li, Jie-Fang",
    "McLaughlin, Keith Lynn",
    "Aning, Alexander O",
    "Weiss, Chester J"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-02-12T09:00:17Z",
  "date_available": "2014-02-12T09:00:17Z",
  "date_issued": "2014-02-11",
  "degree_discipline": "Materials Science and Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "The magnetoelectric (ME) effect is an electric output in response to an applied magnetic field. In a heterostructure configuration where the two-phases are engineered with close interface contact, a giant electric response to a magnetic field has been found, which is designated as the ME voltage (or charge) coefficient α^ME. This effect is mediated by a mechanical-coupling between magnetostrictive and piezoelectric phases. In this thesis, I concentrate on application study for ME sensors with respect to noise control and rejection, thermal stability, triple-axis sensor design, array imaging, DC and AC magnetic sources detection and active mode ME sensor development, which is important for future ME sensor device applications.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-02-12T09:00:17Z (GMT). No. of bitstreams: 1 Shen_Y_D_2014.pdf: 7489375 bytes, checksum: dd762d3995ffd450a4be0d25af94b62d (MD5)   Previous issue date: 2014-02-11",
  "format_medium": "ETD",
  "handle": "25429",
  "identifier_other": "vt_gsexam:2257",
  "identifier_uri": "http://hdl.handle.net/10919/25429",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "applications",
    "magnetoelectric",
    "sensor"
  ],
  "title": "Applications of Magnetoelectric Sensors",
  "type": "Dissertation"
}