{
  "contributor_author": "Yavorosky, Bart Mykolas",
  "contributor_committeechair": "Stephenson, Max O",
  "contributor_committeemember": [
    "Medina, Dennis Xavier",
    "Luke, Timothy W",
    "Khademian, Anne M"
  ],
  "contributor_department": "School of Public and International Affairs",
  "date_accessioned": "2014-03-05T09:00:24Z",
  "date_available": "2014-03-05T09:00:24Z",
  "date_issued": "2014-03-04",
  "degree_discipline": "Planning, Governance, and Globalization",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "This dissertation addresses three questions about administrative rulemaking:   • Do comments submitted on proposed rules vary in identifiable ways?   • Do these differences directly relate to the likelihood that recommendations will be associated with changes to regulations?   • Can these characteristics be incorporated into a model that accurately predicts whether or not suggestions will coincide with changes to administrative rules?   Using data collected from the Commonwealth of Virginia's Regulatory Town Hall, I analyze 2,534 comments that address 67 regulations proposed by state agencies during an 11-year period. I find that submissions do differ in meaningful ways. I also find statistically significant evidence that those differences are related to the probability that a requested change coincides with a subsequent modification to a rule. The principal result of this research is a model that predicts with a high degree of accuracy the outcome of participants' recommendations to alter proposed regulations. I also demonstrate the implications of these results and how failure to account for these differences undermines the legitimacy of conclusions that can be drawn from studies of notice-and-comment rulemaking. The primary contribution of this dissertation is methodological, but the empirical evidence presented here also raises questions about the value of citizen participation in notice-and-comment rulemaking in its current form. As a result, it challenges contentions that participation contributes to the democratic legitimacy of bureaucracy, serves as a safeguard against the influences of organized interests, or improves the substantive quality of administrative decisions.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-03-05T09:00:24Z (GMT). No. of bitstreams: 2 Yavorosky_BM_D_2014.pdf: 1894428 bytes, checksum: d22b07dd98a3140302a941d7eca9f9f1 (MD5) Yavorosky_BM_D_2014_support_1.pdf: 120454 bytes, checksum: 9f77b0753bd316ac48db386669bb3655 (MD5)   Previous issue date: 2014-03-04",
  "format_medium": "ETD",
  "handle": "25804",
  "identifier_other": "vt_gsexam:2227",
  "identifier_uri": "http://hdl.handle.net/10919/25804",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "administrative rulemaking",
    "notice-and-comment",
    "public administration",
    "bureaucracy",
    "public participation"
  ],
  "title": "Comparing Apples: Predicting the effect of public comments on administrative rules",
  "type": "Dissertation"
}