{
  "contributor_author": "Christian, Marc",
  "contributor_committeechair": "Nussbaum, Maury A",
  "contributor_committeemember": [
    "Young-Corbett, Deborah Elspeth",
    "Madigan, Michael L",
    "Agnew, Michael J"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-12T08:00:47Z",
  "date_available": "2014-03-12T08:00:47Z",
  "date_issued": "2014-03-11",
  "degree_discipline": "Industrial and Systems Engineering",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Work-related musculoskeletal disorders (WMSDs) continue to present a substantial personal and economic burden.  Biomarkers, in providing objective measures of physiological changes, may offer advantages over current tools for WMSD risk assessment.  Existing work has identified biomarkers of cartilage and muscle damage, and demonstrated responsiveness to various forms of physical activity and biomechanical loading.  Here, three studies were complete to further assess the occupational relevance/utility of three selected biomarkers: Cartilage Oligomeric Matrix Protein (COMP), Interleukin-6 (IL6), and Creatine Kinase (CK).  First, the effects of age, obesity, gender, and diurnal variation was investigated.  Significant effects of time, age, and gender were evident, as well as some interactive effects, for COMP and CK, but not IL6.  Second, biomarker levels were compared between individuals in occupations having relatively high and low WMSD risk.  IL6 levels were greater in the high-risk group, while COMP levels demonstrated an oscillatory pattern, and CK levels did not vary between groups.  Third, physical demands were imposed on the lumbar spine during a repetitive flexion/extension task, under conditions with different loading and frequency.  IL6 levels varied significantly over time and between added load levels, while CK levels varied over time and was influenced by load and frequency.  These studies demonstrate important features of biomarkers; that personal confounding factors need to be considered, that select biomarkers may be sensitive to occupational risk factor exposure, and particularly to task parameters in lifting activities involving the lower back.  Further, these studies reveal important information concerning the relevance of the selected biomarkers, favorable time points for biomarker collection, and approximate biomarker levels expected between occupations and exposure to common risk factors.  These results support the use of biomarkers in occupational settings for assessing exposure and WMSD risk imposed by common risk factors.  Sensitivity to exposure levels is an important precursor to risk prediction, however prospective work is needed to verify predictive validity.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-03-12T08:00:47Z (GMT). No. of bitstreams: 1 Christian_M_D_2014.pdf: 2699414 bytes, checksum: 17ec7a317c2569a0b824e18302b96e13 (MD5)   Previous issue date: 2014-03-11",
  "format_medium": "ETD",
  "handle": "25877",
  "identifier_other": "vt_gsexam:2467",
  "identifier_uri": "http://hdl.handle.net/10919/25877",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Biomarkers",
    "Work-related Musculoskeletal Disorders",
    "Muscle",
    "Cartilage"
  ],
  "title": "Biomarkers of Physiological Damage and their Potential for Work-Related Musculoskeletal Disorder Risk Assessment",
  "type": "Dissertation"
}