{
  "contributor_author": "Hamby, Anne Marie",
  "contributor_committeechair": "Brinberg, David L.",
  "contributor_committeemember": [
    "Bagchi, Rajesh",
    "Weaver, Kimberlee D.",
    "Jaccard, Jim"
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-12T08:00:22Z",
  "date_available": "2014-03-12T08:00:22Z",
  "date_issued": "2014-03-11",
  "degree_discipline": "Business, Marketing",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "My dissertation explores how people are persuaded by narratives. The first essay is a  review of the literature over the past decade where I develop and then apply an overarching  framework to synthesize the empirical work that examine antecedents and consequences of  narrative persuasion as well as moderators and mediators that are involved in this process. In  the second essay, I adopt a structural equations approach to examine the process through  which consumers are persuaded by online consumer reviews, a common form of  consumer narrative. A review that reads like a narrative (story) is likely to evoke  transportation into that review, which affects persuasion-related outcomes. Across three  studies, I explore how variables identified in essay 1 and important to the persuasion-related  literature affect this process. In the third essay, I adopt an experimental approach to further  explore the process of reflection, which is introduced in essay one. I demonstrate that  this process is distinct from transportation, and that mediates the relationship between  transportation and persuasion-related outcomes.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-03-12T08:00:22Z (GMT). No. of bitstreams: 2  Hamby_AM_D_2014.pdf: 2220070 bytes, checksum: 23bebe45c64090635cba85b7ad7ad112 (MD5)  Hamby_AM_D_2014_support_1.pdf: 497964 bytes, checksum: 067c25f90446a2f20043ccde3f42389c (MD5)    Previous issue date: 2014-03-11",
  "format_medium": "ETD",
  "handle": "25873",
  "identifier_other": "vt_gsexam:2356",
  "identifier_uri": "http://hdl.handle.net/10919/25873",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "narrative",
    "persuasion",
    "transportation"
  ],
  "title": "Tell Me About Your Experience: How Consumer Narratives Persuade",
  "type": "Dissertation"
}