{
  "contributor_author": "Bahmani, Fatemeh",
  "contributor_committeechair": "Cramer, Mark S",
  "contributor_committeemember": [
    "Ragab, Saad A",
    "Ross, Shane David",
    "Paul, Mark R",
    "Jung, Sunghwan"
  ],
  "contributor_department": "Engineering Science and Mechanics",
  "date_accessioned": "2014-03-13T23:43:55Z",
  "date_available": "2014-03-13T23:43:55Z",
  "date_issued": "2013-08-27",
  "degree_discipline": "Engineering Mechanics",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "We have examined three problems involving steady flows of Navier-Stokes fluids. In each problem non-classical effects are considered. In the first two problems, we consider fluids which have bulk viscosities which are much larger than their shear viscosities. In the last problem, we examine steady supersonic flows of a Bethe-Zel'dovich-Thompson (BZT) fluid over a thin airfoil or turbine blade. BZT fluids are fluids in which the fundamental derivative of gasdynamics changes sign during an isentropic expansion or compression.   In the first problem we consider the effects of large bulk viscosity on the structure of the inviscid approximation using the method of matched asymptotic expansions. When the ratio of bulk to shear viscosity is of the order of the square root of the Reynolds number we find that the bulk viscosity effects are important in the first corrections to the conventional boundary layer and outer inviscid flow. At first order the outer flow is found to be frictional, rotational, and non-isentropic for large bulk viscosity fluids. The pressure is found to have first order variations across the boundary layer and the temperature equation is seen to have two additional source terms at first order when the bulk viscosity is large.   In the second problem, we consider the reflection of an oblique shock from a laminar flat plate boundary layer. The flow is taken to be two-dimensional, steady, and the gas model is taken to be a perfect gas with constant Prandtl number. The plate is taken to be adiabatic. The full Navier-Stokes equations are solved using a weighted essentially non-oscillatory (WENO) numerical scheme. We show that shock-induced separation can be suppressed once the bulk viscosity is large enough.   In the third problem, we solve a quartic Burgers equation to describe the steady, two-dimensional, inviscid supersonic flow field generated by thin airfoils. The Burgers equation is solved using the WENO technique. Phenomena of interest include the partial and complete disintegration of compression shocks, the formation of expansion shocks, and the collision of expansion and compression shocks.",
  "description_degree": "PHD",
  "description_provenance": "Made available in DSpace on 2014-03-13T23:43:55Z (GMT). No. of bitstreams: 2 Bahmani_F_D_2013.pdf: 7181741 bytes, checksum: e06c9dfa1c4cfddd133019324f90c288 (MD5) Bahmani_F_D_2013_support_1.pdf: 3680391 bytes, checksum: 5ef2669fc4374ea902f1c2c51c6e07fb (MD5)   Previous issue date: 2013-08-27",
  "format_medium": "ETD",
  "handle": "25885",
  "identifier_other": "vt_gsexam:1481",
  "identifier_uri": "http://hdl.handle.net/10919/25885",
  "publisher": "Virginia Tech",
  "rights": "This Item is protected by copyright and/or related rights. Some uses of this Item may be deemed fair and permitted by law even without permission from the rights holder(s), or the rights holder(s) may have licensed the work for use under certain conditions. For other uses you need to obtain permission from the rights holder(s).",
  "subject": [
    "Compressible flow",
    "shock",
    "boundary layer",
    "WENO",
    "CFD",
    "bulk viscosity",
    "BZT fluids"
  ],
  "title": "Three Problems Involving Compressible Flow with Large Bulk Viscosity and Non-Convex Equations of State",
  "type": "Dissertation"
}