{
  "contributor_author": "Meng, Fang",
  "contributor_committeechair": "Uysal, Muzaffer S.",
  "contributor_committeemember": [
    "McCleary, Ken W.",
    "Weaver, Pamela A.",
    "Littlefield, James E.",
    "McGehee, Nancy G."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:05:24Z",
  "date_adate": "2007-01-16",
  "date_available": "2014-03-14T20:05:24Z",
  "date_issued": "2006-12-13",
  "date_rdate": "2009-01-16",
  "date_sdate": "2007-01-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Destination competitiveness has become a critical issue in today's increasingly challenging tourism market. Many studies have indicated that tourists and their needs stand as the ultimate driving force which influences competition and competitiveness in the tourism destination. Today, destinations eventually compete on the quality of tourism experience offered to visitors. However, limited research has been undertaken to examine destination competitiveness from the tourists' perspective. The purpose of this study is to investigate the effect of quality of tourism experience on tourists' perception of destination competitiveness.<p>  A destination competitiveness model based on the perceptions of tourists and a measurement instrument to assess the constructs of the model were developed for this study. The model proposes that tourists' perceived destination competitiveness is affected by the quality of tourism experience, which includes the experience in pre-trip planning, en-route, on-site, and after-trip (reflection) phases. Furthermore, tourist involvement, as an important salient dimension of consumer behavior, is introduced into the model as a moderating factor in the relationship between quality of tourism experience and perceived destination competitiveness. <p>  The sample population of this study consists of residents of Virginia who are 18 years old or above and took at least one leisure trip away from home in the past 18 months. Three hundred and fifty-three usable questionnaires were utilized in the data analysis of the study. Canonical Correlation Analysis (CCA) and Structural Equation Modeling (SEM) analysis were performed to test the study hypotheses.  <p> The results indicated that the quality of tourism experience and tourists' perception of destination competitiveness do relate to each other as substantiated by the existence of shared common variances between these two major constructs. The study also revealed that tourists' perception of destination competitiveness is positively influenced by the quality of tourism experience in terms of different phases (pre-trip planning, en-route experience, on-site instrumental experience, on-site expressive experience, and after-trip reflection). Furthermore, tourist involvement appears to have a moderating effect on the relationship between pre-trip planning experience, en-route experience, on-site expressive experience, and perceived destination competitiveness. The study also provided managerial implications to destination managers and marketers based on the research findings.",
  "description_provenance": [
    "Author Email: fameng@vt.edu",
    "Advisor Email: samil@vt.edu",
    "Advisor Email: mccleary@vt.edu",
    "Advisor Email: weaver@vt.edu",
    "Advisor Email: jalittle@vt.edu",
    "Advisor Email: nmcgehee@vt.edu",
    "Made available in DSpace on 2014-03-14T20:05:24Z (GMT). No. of bitstreams: 1 FangMeng2006.pdf: 1282504 bytes, checksum: b4f295a855b5d19a07dc45c1e47bfb45 (MD5)   Previous issue date: 2006-12-13"
  ],
  "handle": "25936",
  "identifier_other": "etd-01022007-090556",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01022007-090556/",
  "identifier_uri": "http://hdl.handle.net/10919/25936",
  "publisher": "Virginia Tech",
  "relation_haspart": "FangMeng2006.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Involvement",
    "Tourists' Perspective",
    "Destination Competitiveness",
    "Tourism Experience"
  ],
  "title": "An Examination of Destination Competitiveness from the Tourists' Perspective: The Relationship between Quality of Tourism Experience and Perceived Destination Competitiveness",
  "type": "Dissertation"
}