{
  "contributor_author": "Arsoy, Sami",
  "contributor_committeechair": "Duncan, James Michael",
  "contributor_committeecochair": "Barker, Richard M.",
  "contributor_committeemember": [
    "Kapania, Rakesh K.",
    "Filz, George M.",
    "Kuppusamy, Thangavelu",
    "Murray, Thomas M."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:06:28Z",
  "date_adate": "2001-01-05",
  "date_available": "2014-03-14T20:06:28Z",
  "date_issued": "2000-12-15",
  "date_rdate": "2002-01-05",
  "date_sdate": "2001-01-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Bridges without expansion joints are called \"integral bridges.\"  Eliminating joints from bridges crates concerns for the piles and the abutments of integral bridges because the abutments and the piles are subjected to temperature-induced cyclic lateral loads.  As temperatures change daily and seasonally, the lengths of integral bridges increase and decrease, pushing the abutment against the approach fill and pulling it away.  As a result the bridge superstructure, the abutment, the approach fill, the foundation piles and the foundation soil are all subjected to cyclic loading, and understanding their interactions is important for effective design and satisfactory performance of integral bridges. The ability of piles to accommodate lateral displacements is a significant factor in determining the maximum possible length of integral bridges.  In order to build longer integral bridges, pile stresses should be kept low. This research project investigated the complex interactions that take place between the structural components of the integral bridge and the soil through experimental and analytical studies.  A literature review was conducted to gain insight into the integral bridge/soil interactions, and to synthesize the information available about the cyclic loading damage to piles of integral bridges.  The ability of the piles and the abutments to withstand cyclic loads was investigated by conducting large-scale cyclic load tests.  Three pile types and three semi-integral abutments were tested in the laboratory.  Experiments simulated 75 years of bridge life for each specimen by applying over 27,000 displacement cycles.  Numerical analyses were conducted to investigate the interactions among the abutment, the approach fill, the foundation soil, and the piles. The original VDOT semi-integral abutment hinge experienced shear key failure as observed in two large-scale laboratory tests.  The revised hinge detail did not exhibit any sign of damage.  Both abutments tolerated 75-year worth of displacement cycles without any appreciable change in their behavior.  Semi-integral abutments are recommended for longer integral bridges because they can reduce pile stresses.  As the need to build longer integral bridges grows, the role of the semi-integral abutments is expected to become more important. The data from the experimental program indicates that steel H-piles are the best pile type for support of integral abutment bridges.  Concrete piles are not recommended because under repeated lateral loads, tension cracks progressively worsen and significantly reduce vertical load carrying capacity of these piles. Pipe piles have high flexural stiffness, which results in an undesired condition for the shear stresses in the abutment.  For this reason, stiff pipe piles are not recommended for support of integral bridges. Numerical analyses indicate that the interactions between the approach fill and the foundation soils create favorable conditions for stresses in piles supporting integral bridges.  Because of these interactions, the foundation soil acts as if it were softer, resulting in reduction in pile stresses compared to a single pile in the same soil without the approach fill above it.",
  "description_provenance": [
    "Author Email: sarsoy@vt.edu",
    "Advisor Email: rkapania@vt.edu",
    "Advisor Email: filz@vt.edu",
    "Advisor Email: jmd@vt.edu",
    "Advisor Email: kuppu@vt.edu",
    "Advisor Email: thmurray@vt.edu",
    "Advisor Email: barker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:28Z (GMT). No. of bitstreams: 13 Chapter_5.pdf: 488718 bytes, checksum: 311f01b10cd9005ce48136c8d95bb349 (MD5) Chapter_1.pdf: 15431 bytes, checksum: 6062ba95350be42ea3742ad6c92b369d (MD5) Appendix_C.pdf: 107671 bytes, checksum: c7d2687dbacadde57667447769cd51e2 (MD5) VITA.pdf: 4637 bytes, checksum: 8d35d089a4d77ebcb38549c0337f8e65 (MD5) Chapter_3.pdf: 140662 bytes, checksum: 59bcb8fb0e2b5b60e8b096286e257eb1 (MD5) Appendix_A.pdf: 586794 bytes, checksum: 463382bdcd3f5d5c813bad8a70f16948 (MD5) Chapter_7.pdf: 14785 bytes, checksum: bb7f291d53b4686fdd020830c0eba679 (MD5) Chapter_4.pdf: 438492 bytes, checksum: b952b581d96927eaf75cad7fc5ad0706 (MD5) Front_Matter.pdf: 40738 bytes, checksum: 16fb9329aac5aca7781ff6240d81f3df (MD5) References.pdf: 25516 bytes, checksum: 753106b677bccdbab8c44e843a204d1d (MD5) Chapter_6.pdf: 113176 bytes, checksum: 49fa3fbf891419253256c4ecb953a35f (MD5) Chapter_2.pdf: 59351 bytes, checksum: 5969a11f74295f0f55c9c69c42c86779 (MD5) Appendix_B.pdf: 45596 bytes, checksum: 7902e5175d6cdf1a8e2d6ce7866adc2a (MD5)   Previous issue date: 2000-12-15"
  ],
  "handle": "25939",
  "identifier_other": "etd-01032001-003137",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01032001-003137/",
  "identifier_uri": "http://hdl.handle.net/10919/25939",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter_5.pdf",
    "Chapter_1.pdf",
    "Appendix_C.pdf",
    "VITA.pdf",
    "Chapter_3.pdf",
    "Appendix_A.pdf",
    "Chapter_7.pdf",
    "Chapter_4.pdf",
    "Front_Matter.pdf",
    "References.pdf",
    "Chapter_6.pdf",
    "Chapter_2.pdf",
    "Appendix_B.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "finite element analyses",
    "temperature effects",
    "abutments",
    "semi-integral abutment",
    "piles",
    "Integral bridges"
  ],
  "title": "Experimental and Analytical Investigations of Piles and Abutments of Integral Bridges",
  "type": "Dissertation"
}