{
  "contributor_author": "Mustafa, Amjad Issa",
  "contributor_committeechair": "Gogal, Robert M. Jr.",
  "contributor_committeemember": [
    "Ahmed, S. Ansar",
    "Reilly, Christopher M.",
    "Li, Liwu",
    "Prater, Mary Renee",
    "Holladay, Steven D."
  ],
  "contributor_department": "Biomedical Sciences and Pathobiology",
  "date_accessioned": "2014-03-14T20:05:23Z",
  "date_adate": "2009-01-31",
  "date_available": "2014-03-14T20:05:23Z",
  "date_issued": "2008-12-18",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-01-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Developmental 2,3,7,8-Tetrachlorodibenzo-p-dioxin (TCDD) exposure can permanently alter immune system ontogeny, resulting in the dysregulation of a number of vital immune pathways. We hypothesized that developmental exposure to TCDD may also impair the establishment of self-tolerance, resulting in an increased risk of autoimmunity. For example, we observed that a single prenatal TCDD exposure given to non-autoimmune-prone high affinity aryl hydrocarbon receptor (AhR) C57BL/6 mice resulted in an immune complex-mediated autoimmune disease during the adult stage. Further using a similar TCDD exposure protocol, autoimmune-prone low affinity AhR SNF1 mice exhibited acceleration and exacerbation of lupus-like nephritis in adulthood. Examination of these mice showed that perinatal TCDD exposure adversely affected both primary immune organs of the adaptive immune system.  In the thymic compartment, prenatal TCDD affected thymocyte cellularity, differentiation and maturation as well as central tolerance as indicated by high levels of autoreactive Vβ TCR T cells in the periphery. Prenatal TCDD also altered bone marrow B lymphopoiesis and B cell maturation and differentiation in the spleen. Functionally, these B cell changes resulted in high serum autoantibodies titers to dsDNA, ssDNA and cardiolipin suggesting a loss in central B cell tolerance. The functional assessment of T cells, via cytokine production showed that prenatal TCDD mice altered Th1/Th2 levels. As a result, significant changes were detected in the kidney characterized by increased immune complex deposition in the glomeruli, lymphocytic infiltration and general pathologic changes. This would suggest that multiple immune pathways are affected by prenatal TCDD and work either independently or synergistically to display immune-mediated disease during aging. Importantly, this study has also shown that the sex of an individual appears to influence both the type of immune pathways affected by TCDD as well as the progression and severity of the autoimmunity. In summary, these studies clearly demonstrate that postnatal immune system impairment due to prenatal TCDD exposure is not limited to immunosuppression but also can include inappropriate immune activation manifested as a hypersensitivity that can lead to the onset of autoimmune disease.",
  "description_provenance": [
    "Author Email: amustafa@vt.edu",
    "Advisor Email: rgogal@vt.edu",
    "Made available in DSpace on 2014-03-14T20:05:23Z (GMT). No. of bitstreams: 1 AMJAD.MUSTAFA.DISSERTATION.pdf: 5028251 bytes, checksum: d8809b490212d4f97e98f8d913db7ab3 (MD5)   Previous issue date: 2008-12-18"
  ],
  "handle": "25935",
  "identifier_other": "etd-01012009-150100",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01012009-150100/",
  "identifier_uri": "http://hdl.handle.net/10919/25935",
  "publisher": "Virginia Tech",
  "relation_haspart": "AMJAD.MUSTAFA.DISSERTATION.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "prenatal exposure",
    "TCDD",
    "SNF1mouse",
    "C57BL/6 mouse",
    "autoimmunity"
  ],
  "title": "Developmental Exposure to 2,3,7,8-Tetrachlorodibenzo-p-dioxin: Induced and Exacerbated Autoimmunity in Adulthood",
  "type": "Dissertation"
}