{
  "contributor_author": "Zhang, Xing",
  "contributor_committeechair": "Pfeiffer, Douglas G.",
  "contributor_committeemember": [
    "Bergh, J. Christopher",
    "Leskey, Tracy C.",
    "Tu, Zhijian Jake",
    "Youngman, Roger R."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:06:31Z",
  "date_adate": "2007-02-06",
  "date_available": "2014-03-14T20:06:31Z",
  "date_issued": "2006-11-28",
  "date_rdate": "2010-02-06",
  "date_sdate": "2007-01-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research focused on the reproductive incompatibility and genetic differences between the two strains of plum curculio, Conotrachelus nenuphar (Herbst). Two molecular markers served as the basis for the strain distribution analysis of plum curculio and Wolbachia symbiont. One marker is the partial mitochondrial cytochrome oxidase gene subunit I (mtCOI) of plum curculio. Another marker is the Wolbachia Surface Protein (wsp) gene of Wolbachia associated with plum curculio. First, the reproductive compatibility of cross-populations mating in plum curculio was studied during the summers of 2004 and 2006. The results confirmed the reproductive incompatibility among plum curculio geographic populations. A unidirectional incompatibility was revealed in an approximate north and south transect of the range of plum curculio (4 x 4 two factorial design: NY, VA, FL, and WV): there was a significant low fertility in WV males mated with NY (40%) and VA (29%) females. The Florida population showed a different pattern: FL males have a significantly lower fertility with VA (46%) and WV (37%) females while FL females were compatible with all males from the four populations. The results of experiment 2 indicated that within the northern geographic area populations (3 x 3 two factorial design: NY, MA, and NJ) were compatible with each other. An opposite unidirectional reproductive incompatibility was revealed in the combination of NJ males with FL females, which showed a significant low fertility (47%). A bi-directional incompatibility occurred between FL and WV reciprocal cross mating. FL males mated with WV females (26%) and WV males mated with FL females (21%) both have the significant low fertility compared to fertility of within their population matings.<p> \tThe genetic diversity among plum curculio populations from different geographic locations was investigated using the partial mtCOI gene. A total of 50 samples from 10 populations were sequenced. PCR products were 863 bp in length. A total of 23 unique sequence haplotypes were found in the 50 samples tested. Haplotype G (n = 5), L (n = 12) and T (n = 13) comprised 60% of 50 samples. The nucleotide distances between those haplotypes ranged from 0.12% to 4.87%. Genetic distances between northern and southern group plum curculios range from 4.17% to 4.87%. Two distinct major clades were found, using three different phylogenetic analyses: 1) neighbor joining (NJ), 2) maximum-parsimony (MP), and 3) maximum-likelihood (ML). 100% bootstraps support the northern clade and the southern clade was strongly supported (100/100/86, NJ/MP/ML) as well. The mid-southern subclade within the southern clade was also strongly supported (70/82/71, NJ/MP/ML) and the far-southern subclade was supported in NJ tree (81%) but was not resovled in MP and ML trees. The mid-southern subclade included haplotypes from two NJ, Washington, VA (Ra), Blacksburg, VA (BL) and 50% of WV populations and the far-southern subclade included haplotypes from FL, GA, Whitethorne, VA (Ke), Troutville, VA (Bo) and another 50% of WV populations. The results suggested that the northern and the southern clade could correspond with the northern and southern strains, respectively, of plum curculio. In this study, the mtCOI sequence was highly informative as a molecular marker in that it was useful to distinguish C. nenuphar from northern and from southern geographic locations in the eastern United States. However, the number of generations per year of several geographic populations within the southern clade still needs to be determined.   <p> \tThe distribution of Wolbachia infection associated with plum curculio strains was investigated. 91 of 93 samples were infected by Wolbachia. Three unique Wolbachia strains were identified. The strains wCne1 and wCne2 (593 bp) were 97% identical, and their sequences were both 84% identical with wCne3 (590 bp). The wsp sequence of wCne1 was 99% identical to Wolbachia sequenced from the neotropical beetle, Chelymorpha alternans Boheman (Keller et al. 2004). The wCne2 sequence was 98.5% identical to the flower bug, Orius nagaii Yasunaga (Miura and Tagami, unpublished). The wCne3 sequence was 100% identical to Wolbachia sequenced from the tephritid fruit fly, Dacus destillatoria (Jamnongluk et al. 2000) and the ant, Formica exsecta (Reuter and Keller 2003). PCR - Restriction Fragment Length Polymorphism (RFLP) was used for superinfection detection. Of 93 samples, 15 (16.1%), 21 (22.6%), 19 (20.4%), 36 (38.7%) samples were infected by wCne1, wCne2, wCne1 plus wCne2, and wCne3, respectively. Only two (2.2%) samples had no infection. The wCne3 strain was always present as a single infection. Therefore, current results suggest that Wolbachia strains approximate the distribution of plum curculio strains: the northern strain is infected with wCne1 and wCne2 strains in supergroup B, the southern strain is infected with wCne3 strain in supergroup A and the mid-Atlantic region is the convergence area. Compared with the haplotype distribution of plum curculio mtCOI gene, there was a closer relation of the mid-southern PC clade to the far-southern clade than to the northern clade. However, Wolbachia symbionts in mid-southern PC are more closely related to those in northern PC than to those in far-southern PC. The relationship of Wolabchia infection with reproductive incompatibility between plum curculio populations is also discussed.",
  "description_provenance": [
    "Author Email: zhxing@vt.edu",
    "Advisor Email: dgpfeiff@vt.edu",
    "Advisor Email: cbergh@vt.edu",
    "Advisor Email: Tracy.Leskey@ars.usda.gov",
    "Advisor Email: jaketu@vt.edu",
    "Advisor Email: youngman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:31Z (GMT). No. of bitstreams: 1 dissertation_xing.pdf: 1855529 bytes, checksum: 1b2746bc51cf78d7713ca626413de411 (MD5)   Previous issue date: 2006-11-28"
  ],
  "handle": "25948",
  "identifier_other": "etd-01052007-173151",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01052007-173151/",
  "identifier_uri": "http://hdl.handle.net/10919/25948",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation_xing.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cross-mating",
    "reproductive incompatibility",
    "mtCOI",
    "Conotrachelus nenuphar",
    "strains",
    "wsp",
    "Wolbachia"
  ],
  "title": "Biogeography and biosystematics of plum curculio, Conotrachelus nenuphar (Herbst)/Wolbachia interactions",
  "type": "Dissertation"
}