{
  "contributor_author": "Gyenai, Kwaku Barima",
  "contributor_committeechair": "Smith, Edward J.",
  "contributor_committeemember": [
    "Pyle, Robert Lee",
    "Pierson, Frank William",
    "Novak, Curtis L.",
    "Thatcher, Craig D."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:06:30Z",
  "date_adate": "2010-01-19",
  "date_available": "2014-03-14T20:06:30Z",
  "date_issued": "2009-12-16",
  "date_rdate": "2010-01-19",
  "date_sdate": "2010-01-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Dilated cardiomyopathy (DCM) or round heart disease is a muscle disease of the heart characterized by left ventricular dilatation and abnormal systolic and diastolic ventricular function. In animals, including turkeys and humans, DCM is a major cause of morbidity and mortality that results in heart failure. In the turkey, DCM can be idiopathic or induced. Since idiopathic or spontaneous DCM occurs in about 2-4 % of normal turkeys, it is of significant concern to the poultry industry. This dissertation was designed to increase our understanding of the pathophysiology of DCM in commercial turkeys. Specific objectives included: evaluating the influence of dietary selenium (Se) and vitamin E on poults fed toxic levels of furazolidone (Fz). Evaluating differences among reciprocal crosses of turkey varieties in susceptibility to a toxic level of Fz that induces DCM were used to assess the role of genetics in DCM. Using glutathione (GSH), glutathione peroxidase (GPx), malondialdehyde (MDA), and plasma uric acid (PUA) as biomarkers, oxidative stress (OS) levels were evaluated. Oxidative stress was also evaluated in poults fed diets containing varying concentration and combinations of vitamin E (0, 50 and 100 IU/kg) and Se (0.0, 0.3 and 0.5 mg/kg). Results from echocardiography measurements at four weeks of age, for poults fed toxic levels of Fz, showed the Narragansett x Bourbon Red reciprocal cross had the lowest internal-diastolic (LVIDd) and systolic dimensions (LVISd), while the Bourbon Red x Narragansett reciprocal cross had the largest LVIDd and LVISd. Left ventricular internal-diastolic and systolic dimension were lower for cross bred than parental poults. In treatment poults, heterosis for ventricular dilation was most significant for Bourbon Red x Narragansett cross. The data suggest that reciprocal crosses respond differently to toxin that induces DCM and genetics may influence a turkeyâ  s response to toxic levels of Fz that causes DCM. Results from OS measurements in poults fed normal and those fed normal diets with Fz at two weeks of age, showed no significant differences in MDA and GPx levels. PUA and GSH levels were however significantly increased for poults fed Fz-containing diets. At four weeks of age, no differences were observed for MDA and GPx measurements between poults fed normal and Fz-containing diets. PUA levels increased for poults fed normal diets with Fz, while GSH levels increased only for those fed normal diets. Differences between poults fed normal and Fz-containing diets were significant for GPx measurements. Results of this study showed that, feeding diets with Fz does not increase OS. Measure of the influence of feeding diets supplemented with different concentrations and combinations of Se and vitamin E to poults fed either normal or normal diets with Fz at two and four wks of age, showed higher MDA levels for poults fed Fz-containing diets supplemented with 0.3 mg/kg Se and 100 IU/kg vitamin E. For antioxidant biomarkers, GPx activity were increased for poults fed normal diets with Fz supplemented with 0.5 mg/kg Se and those fed 100 IU/kg vitamin E. Poults fed normal diets supplemented with 100 IU/kg vitamin E had the highest GPx. PUA levels were higher for poults fed normal diets with Fz supplemented with 0.5 mg/kg Se at two wks of age. At four wks of age, PUA concentrations were higher for poults fed Fz-containing diets supplemented with 100 IU/kg vitamin E. Increased PUA were also observed for poults fed diets supplemented with 0.5 mg/kg Se and 50 IU/kg vitamin E and 0.5 mg/kg and 100 IU/kg vitamin E. Poults fed diets supplemented with 50 and 100 IU/kg vitamin E had the highest GSH at two wks of age. Measurements taken at 2 wks of age, for poults fed normal diets supplemented with different concentrations and combinations of Se and vitamin E had increased GSH levels when compared with those fed diets with Fz at four wks of age. In this study, we showed that supplementation of poults fed normal diets with Fz with different concentrations and combinations of Se and vitamin E did not reduce DCM at 2 wks of age. However, at 4 wks of age, though DCM was not decreased by feeding diets supplemented with different concentrations and combinations of Se and vitamin E, reduced oxidant and antioxidant biomarkers were observed.",
  "description_provenance": [
    "Author Email: kbgyenai@vt.edu",
    "Advisor Email: rlpyle1@verizon.net",
    "Advisor Email: pierson@vt.edu",
    "Advisor Email: CLNovak@landolakes.com",
    "Advisor Email: esmith@vt.edu",
    "Advisor Email: Craig.Thatcher@asu.edu",
    "Made available in DSpace on 2014-03-14T20:06:30Z (GMT). No. of bitstreams: 1 Gyenai.pdf: 1797340 bytes, checksum: 907096b8365357e026e5d7cc49886c35 (MD5)   Previous issue date: 2009-12-16"
  ],
  "handle": "25946",
  "identifier_other": "etd-01042010-151045",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01042010-151045/",
  "identifier_uri": "http://hdl.handle.net/10919/25946",
  "publisher": "Virginia Tech",
  "relation_haspart": "Gyenai.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Turkey",
    "Dilated cardiomyopathy",
    "Oxidative stress",
    "Antioxidants",
    "Biomarkers"
  ],
  "title": "An Assessment of the Effects of Oxidative Stress and Dietary Antioxidants on Toxin-Induced Dilated Cardiomyopathy in the Turkey (Meleagris gallopavo)",
  "type": "Dissertation"
}