{
  "contributor_author": "Si, Hongwei",
  "contributor_committeechair": "Liu, Dongmin",
  "contributor_committeemember": [
    "Ju, Young H.",
    "Jiang, Honglin",
    "Bassaganya-Riera, Josep",
    "Lee, Yong Woo",
    "Denbow, Donald Michael"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:06:30Z",
  "date_adate": "2008-01-16",
  "date_available": "2014-03-14T20:06:30Z",
  "date_issued": "2007-12-18",
  "date_rdate": "2009-01-16",
  "date_sdate": "2008-01-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Cardiovascular diseases (CVD) are the leading cause of morbidity and mortality in the United States. It is also well recognized that the incidence of CVD is substantially increased in postmenopausal women due to the loss of estrogen. Experimental and clinical data support vascular protective effects of estrogen by various mechanisms. However, administration of estrogen is also associated with an increased incidence of heart disease which limits its therapeutic potential. Given the demonstrated risks of conventional estrogen therapy, a search for novel, cost-effective, alternative vasoactive agents for prevention of CVD is of major importance in the effort to decrease the burden of CVD morbidity. Genistein, a major soy isoflavone, may be one of those alternative agents because of its selective affinity to estrogen receptor-beta and various beneficial effects on CVD. However, the mechanism of the cardioprotective effects of genistein is still unclear. The objectives of this study were (1) to investigate the effect of genistein on the expression of endothelial nitric oxide synthase (eNOS) both in vitro and in vivo; (2) to define the mechanism by which genistein regulates eNOS expression; and, (3) to examine whether genistein protects against tumor necrosis factor-alpha (TNF-α)-induced apoptosis in human aortic endothelial cells (HAECs). The results demonstrated that genistein, at physiologically achievable concentrations (1-10 μM) in individuals consuming soy products, enhanced the expression of eNOS protein and subsequently elevated nitric oxie (NO) synthesis in both HAECs and human umbilical vein endothelial cells, concomitant with the increased eNOS mRNA expression (2.6-fold of control) and eNOS promoter activity, suggesting that genistein activates eNOS transcription. Furthermore, dietary supplementation of genistein to spontaneously hypertensive rats restored aortic eNOS levels, improved aortic wall thickness, and alleviated hypertension, confirming the biological relevance of the in vitro findings. However, the effects of genistein on eNOS and NO were not mediated by activation of estrogen signaling, mitogen-activated protein kinase, phosphatidylinositol 3-kinase/Akt kinase, protein kinase C or inhibition of typrosine kinases, but possibly through activating the cAMP/protein kinase A/cAMP responsive elemant binding protein pathway. These data suggest that genistein has direct genomic effects on the vascular wall that are unrelated to its known actions, leading to increase in eNOS expression and NO synthesis, thereby improving vascular homeostasis.  We also found that genistein (5-10 μM) significantly inhibited TNF-α-induced apoptosis in HAECs as determined by caspase-3 activation, apoptotic cell detection and DNA laddering. The anti-apoptotic effect of genistein was associated with an enhanced expression of anti-apoptotic Bcl-2 protein and its promoter activity that was ablated by TNF-α.  Moreover, this anti-apoptotic effect of genistein was not mediated by extracellular signal-regulated kinase 1/2, protein kinase A, or estrogen receptor. However, inhibition of p38 mitogen-activated protein kinase (p38) by SB203580 completely abolished the cytoprotective effect of genistein, suggesting that genistein acted through the p38-dependent pathway. Accordingly, stimulation of HAECs with genistein resulted in rapid and dose-dependent activation of p38. Unlike TNF-α which specifically activated p38α, genistein selectively induced phosphorylation of p38β, suggesting that p38β, but not p38α, is essential for the cytoprotective effect of genistein. These findings provide the evidence that genistein acts as a survival factor for vascular ECs to protect cells against apoptosis via activation of p38β.   Taken together, the resuls of the present study suggest that genistein can act directly on vascular ECs, improves endothelium homeostasis by promoting eNOS expression and endothelial-derived NO synthesis through activating the cAMP/PKA/CREB cascade, and protects against TNF-α-induced apoptosis via activation of p38 β. These data potentially provide a basic mechanism underlying the physiological effects of genistein in the vasculature.",
  "description_provenance": [
    "Author Email: hsi@vt.edu",
    "Advisor Email: yhju@vt.edu",
    "Advisor Email: hojiang@vt.edu",
    "Advisor Email: doliu@vt.edu",
    "Advisor Email: jbassaga@vt.edu",
    "Advisor Email: ywlee@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:30Z (GMT). No. of bitstreams: 1 Dissertation-hongwei_final.pdf: 1025922 bytes, checksum: adaf25d0761e98197c65f65cba962a70 (MD5)   Previous issue date: 2007-12-18"
  ],
  "handle": "25942",
  "identifier_other": "etd-01032008-101850",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01032008-101850/",
  "identifier_uri": "http://hdl.handle.net/10919/25942",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-hongwei_final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "protein kinase A",
    "p38 MAP kinase",
    "apoptosis",
    "signaling pathway",
    "cAMP",
    "nitric oxide",
    "endothelial nitric oxide synthase",
    "endothelial cells",
    "Genistein"
  ],
  "title": "Mechanisms of soy isoflavones in the regulation of vascular function",
  "type": "Dissertation"
}