{
  "contributor_author": "Sankir, Mehmet",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Wilkes, Garth L.",
    "Riffle, Judy S.",
    "Corcoran, Sean Gerald",
    "Lesko, John J."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:06:30Z",
  "date_adate": "2006-01-10",
  "date_available": "2014-03-14T20:06:30Z",
  "date_issued": "2005-12-06",
  "date_rdate": "2007-01-10",
  "date_sdate": "2006-01-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation describes the past and recent progress in proton exchange membranes (PEM) for fuel cells.  In particular the synthesis and characterization of materials for advanced alternative PEM were studied with an emphasis on structure-property and structure-property-performance relationships.  The focus has included firstly a one-step synthesis and characterization of 3,3'-disulfonated 4,4'-dichlorodiphenyl sulfone comonomer.  The procedure developed is adaptable for industrial-scale commercialization efforts.  Secondly, the synthesis of aromatic nitrile containing poly (arylene ether sulfone) random copolymers was demonstrated.  Various levels of disulfonation allowed the membrane characteristics to be investigated as a function of the membrane ion exchange capacity.  The results favorably compare with the current state-of-the-art (Nafionâ ¢), particularly for direct methanol systems (DMFC).  Thirdly, the mechanically and thermooxidatively stable copolymer membranes were blended with heteropolyacids producing nanocomposites which have potential in higher temperature fuel cell applications.  Lastly, the basic PEM parameters such as water uptake, proton conductivity, and methanol permeabilities were controlled and presented as tunable properties as a function of molecular structure.  This was achieved by in-situ control of chemical composition.  The direct methanol fuel cell performance (DMFC) was much better than Nafionâ ¢.  Hydrophobic surface properties of the membranes were improved by partial fluorination which made the Nafionâ ¢ bonded electrodes more compatible with the partially fluorinated copolymer membranes.  The influence of surface enrichment had two important roles in increasing both initial and long term performance tests.  The surface fluorine provided lower contact resistance and lower water uptake. The former was important for the initial tests and the latter provides for better long term performances.  A delamination failure mechanism was proposed for the hydrocarbon membrane electrode assemblies (MEA) due to the large difference between water uptake of the catalyst layer and membrane and this was verified by a reduction in high frequency resistance (HFR) for the partially fluorinated systems.  This thesis has generated the structure-property and structure-property-performance relationships which will provide direction for the development of next generation (PEM) materials.",
  "description_provenance": [
    "Author Email: msankir@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: sgc@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:30Z (GMT). No. of bitstreams: 1 MSankirPhDDissertation.pdf: 5326333 bytes, checksum: 3b58947e356bba83cdebb2714a210fcb (MD5)   Previous issue date: 2005-12-06"
  ],
  "handle": "25945",
  "identifier_other": "etd-01042006-221401",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01042006-221401/",
  "identifier_uri": "http://hdl.handle.net/10919/25945",
  "publisher": "Virginia Tech",
  "relation_haspart": "MSankirPhDDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Sulfonation",
    "Poly(arylene ether sulfone)",
    "Fuel Cell",
    "Proton Exchange Membrane",
    "poly(arylene ether benzonitrile)",
    "Fluorination"
  ],
  "title": "PROTON EXCHANGE MEMBRANE FUEL CELL SYSTEMS BASED ON AROMATIC HYDROCARBON and PARTIALLY FLUORINATED DISULFONATED POLY(ARYLENE ETHER) COPOLYMERS",
  "type": "Dissertation"
}