{
  "contributor_author": "Chen, Jianli",
  "contributor_committeechair": "Griffey, Carl A.",
  "contributor_committeecochair": "Maroof, M. A. Saghai",
  "contributor_committeemember": [
    "Wilkinson, Carol A.",
    "Stromberg, Erik L.",
    "Buss, Glenn R."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:06:31Z",
  "date_adate": "2006-01-09",
  "date_available": "2014-03-14T20:06:31Z",
  "date_issued": "2005-12-06",
  "date_rdate": "2008-01-09",
  "date_sdate": "2006-01-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Fusarium head blight (FHB) is one of the most destructive diseases of common wheat (Triticum eastivum L.) worldwide. Resistance to FHB is an ideal trait for which molecular marker assisted selection (MAS) would facilitate breeding and cultivar development efforts. Validation of quantitative trait loci (QTL) conferring FHB resistance is a prerequisite for MAS. This study was conducted to validate and evaluate the effect of two major QTL, previously reported on chromosomes 3BS and 5AS, on multiple FHB resistance components in two independent studies, one involving a mapping population derived from a cross between a known resistance source W14 and a susceptible soft red winter (SRW) wheat cultivar Pioneer2684, and the other involving seventy adapted SRW wheat lines. The first study confirmed that the 3BS and 5AS QTL were significantly associated with FHB resistance and further indicated that the 3BS QTL has a larger effect on three FHB resistance components (type II and III resistance and resistance to Fusarium Damaged kernels) evaluated in greenhouse experiments, while the 5AS QTL has a larger effect on type I resistance evaluated in a field experiment. Six simple sequence repeat (SSR) and two sequence targeted site (STS) markers associated with FHB resistance in the two QTL regions identified in the first experiment were then used to characterize FHB QTL marker haplotypes and their effect on FHB resistance in seventy wheat genotypes.  Five main haplotype groups (1-5) were characterized among the elite lines on the basis of allelic differences of four marker loci linked to the 3BS QTL and two marker loci linked to the 5AS QTL. Haplotype group 5 was comprised of marker allele combinations of both 3BS and 5AS QTL and elite lines with this haplotype have improved type I and type II resistance compared to the other haplotypes. This again validated the presence of QTL on chromosomes 3BS and 5AS, and illustrated the utility of SSR and STS markers in the two QTL regions in selection of FHB resistance in elite backgrounds. Four favorable marker alleles including two (Xbarc133 and XSTS3B142) on 3BS and two (Xbarc117 and Xbarc056) on 5AS are recommended for MAS of the two QTL for improved FHB resistance in wheat. Wheat lines having favorable marker alleles identified in the current study will provide breeding programs with a source of unique and adapted FHB resistant parents and some of the lines also may have potential for release as cultivars.",
  "description_provenance": [
    "Author Email: Jianli@vt.edu",
    "Advisor Email: wilki@vt.edu",
    "Advisor Email: elstrom@vt.edu",
    "Advisor Email: gbuss@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: cgriffey@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:31Z (GMT). No. of bitstreams: 1 Dissertation-JChen.pdf: 487157 bytes, checksum: b63a8367fe59784556cb46d6592232b6 (MD5)   Previous issue date: 2005-12-06"
  ],
  "handle": "25947",
  "identifier_other": "etd-01052006-120935",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01052006-120935/",
  "identifier_uri": "http://hdl.handle.net/10919/25947",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-JChen.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Fusarium graminearum",
    "Marker Assisted Selection",
    "Quantitative Trait  Loci",
    "Triticum aestivum",
    "Molecular Marker"
  ],
  "title": "Validation and Marker-Assisted Selection of Two Major Quantitative Trait Loci Conditioning  Fusarium Head Blight  Resistance in Wheat",
  "type": "Dissertation"
}