{
  "contributor_author": "Madanoglu, Melih",
  "contributor_committeechair": "Olsen, Michael D.",
  "contributor_committeemember": [
    "Kwansa, Francis A.",
    "Schmelzer, Claire D.",
    "Kumar, Raman"
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:06:29Z",
  "date_adate": "2006-01-06",
  "date_available": "2014-03-14T20:06:29Z",
  "date_issued": "2005-12-14",
  "date_rdate": "2006-01-06",
  "date_sdate": "2006-01-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "One of the keys for restaurant managers in conducting a proper assessment of their business opportunities is through understanding the level of risk these opportunities bear.  This can be achieved by analyzing the causal relationships between external environmental forces and internal capabilities of the firm, and then make a strategic choice in what opportunities to invest.      The purpose of this study was to investigate the concept of risk and its underlying dimensions that influence the restaurant industryâ  s cash flows and stock returns.  This study proposed a contemporary framework that enables restaurant industry executives to develop a better understanding of the risk factors (macroeconomic and industry) that influence their firmsâ   cash flows and stock returns.    The primary unit of analysis was at industry (portfolio) level. In addition, as a second step, three restaurant firms were selected to demonstrate the practical application of the model.  Exploratory factor analysis indicated that the restaurant industry risk is represented by three dimensions: â  Output,â   â  PPI Meats,â   and â  IP Restaurants.â    The macroeconomic risk construct was represented by the five variables of Arbitrage Pricing Theory of Chen et al. (1986).   Time series-analysis regression of the portfolio of 75 restaurant firms, for the 1993-2004 period, revealed that macroeconomic variables explained a significant portion of restaurant stock returns. On the other hand, both macroeconomic and industry models explained a significant level of variation in operating cash flows.  The addition of September 11 â  dummyâ   variable improved the explained variation in stock returns for both equations (macroeconomic and industry).  At a firm level, the industry model accounted for a significant variation in internal value drivers (operating cash flows, food cost, and labor cost) for all three restaurant companies. The industry risk model survived after controlling for the effect of macroeconomic variables on operating cash flows.  The results indicate that the industry model provides a parsimonious solution in estimating variation in operating cash flows by capturing macroeconomic effects.",
  "description_provenance": [
    "Author Email: melih@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:29Z (GMT). No. of bitstreams: 1 Melih_Madanoglu_Dissertation--2005.pdf: 767710 bytes, checksum: 33499146cabdfea63128a2c584b34e9a (MD5)   Previous issue date: 2005-12-14"
  ],
  "handle": "25941",
  "identifier_other": "etd-01032006-023940",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01032006-023940/",
  "identifier_uri": "http://hdl.handle.net/10919/25941",
  "publisher": "Virginia Tech",
  "relation_haspart": "Melih_Madanoglu_Dissertation--2005.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Co-alignment.",
    "Macroeconomic Risk",
    "Value Drivers",
    "Restaurant Industry Risk"
  ],
  "title": "Underlying Risk Dimensions in the Restaurant Industry: A Strategic Finance Approach",
  "type": "Dissertation"
}