{
  "contributor_author": "Gleason, Jeanne",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Asche, Jane A.",
    "Burton, John K.",
    "Dodl, Norman R.",
    "Head, J. Thomas"
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:06:33Z",
  "date_adate": "2009-01-05",
  "date_available": "2014-03-14T20:06:33Z",
  "date_issued": "1991-11-15",
  "date_rdate": "2009-01-05",
  "date_sdate": "2009-01-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>This developmental dissertation focuses on the creation of an interactive multimedia presentation for use in a public delivery setting. Interactive multimedia appears to have outstanding potential for information dissemination. However, this technology is not commonly used by organizations which lack resources or skills to support total in-house development, and do not have funds to contract outside development at commercial rates.</p> <p> This dissertation addresses these concerns in three ways:</p> <p> 1) It presents a comprehensive model, called ADOBE, to organize the steps of interactive multimedia design and implementation.</p> <p> 2) It outlines, in detail, the development and implementation of a fully functional interactive multimedia presentation, The Natural Resource Extravaganza, to demonstrate interactive multimedia development based on the ADOBE model.</p> <p> 3) It presents (a) design templates, supporting original but parallel development, and (b) program templates, supporting adaptive development through modification of program elements.</p> <p> A video tape demonstrating The Natural Resource Extravaganza, is available from the Reserved Materials section of the Virginia Tech Newman Library. The tape and information about the computer code also are available from NMSU Agricultural Information, Box 30003, Dept. 3AI, Las Cruces, New Mexico 88003. The Natural Resource Extravaganza presentation, graphics, video tape, and program code are copyrighted by New Mexico State University.</p>",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:06:33Z (GMT). No. of bitstreams: 2 LD5655.V856_1991.G654.pdf: 191413056 bytes, checksum: bdf4d4273bca11b3f591caba9ec25335 (MD5) LD5655.V856_1991.G654.mov: 59576222 bytes, checksum: 3597db01bc61451bd160705440b57f2c (MD5)   Previous issue date: 1991-11-15",
  "format_medium": "BTD",
  "handle": "25949",
  "identifier_other": "etd-01052009-132354",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01052009-132354/",
  "identifier_uri": "http://hdl.handle.net/10919/25949",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "LD5655.V856_1991.G654.pdf",
    "LD5655.V856_1991.G654.mov"
  ],
  "subject": "Agricultural extension work",
  "subject_lcc": "LD5655.V856 1991.G654",
  "title": "Development of an interactive multimedia presentation for use in a public delivery setting",
  "type": "Dissertation"
}