{
  "contributor_author": "Fu, I-Ping P.",
  "contributor_committeechair": "Shrum, Judith L.",
  "contributor_committeemember": [
    "Tlou, Josiah S.",
    "Doolittle, Peter E.",
    "Reyna, Sheila S.",
    "Niles, Jerome A."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:06:35Z",
  "date_adate": "2006-01-12",
  "date_available": "2014-03-14T20:06:35Z",
  "date_issued": "2005-12-15",
  "date_rdate": "2006-01-12",
  "date_sdate": "2006-01-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research focuses on the strategies that native English speakers use as they learn to speak and write Chinese vocabulary words in the first year of an elementary Chinese class.  The main research question was:  what strategies do native English-speaking beginning learners of Chinese use to learn Chinese vocabulary words in their speaking and writing?  The study was conducted at a medium-sized comprehensive university in the Southeastern U.S.  The study drew from concepts and theories in second language acquisition and psycholinguistic studies.  A random sampling of four students was selected in their first year of Chinese study for qualitative analyses.   Data were collected from demographic student surveys, reflection papers, interviews, observation and field notes, weekly diary of the students and Strategies Inventory for Language Learning (SILL).   \t The conclusions from this study provide insight as to how students of this demographic approach the challenge of learning Chinese.  From this study, a clear picture emerges that students use different strategies to learn Chinese.  Some students respond better to sound while others are more visually based learners.  However, in this study, students used combinations of audio, visual, and kinesthetic learning techniques.  The tonality of spoken Chinese was one of the most difficult skills to master and this aspect of the language frustrated many students.  This is a widely recognized problem with Chinese education.  Nevertheless, students enjoyed the artistic nature of Chinese characters and for the most part enjoyed writing them.  This element can be emphasized in Chinese instruction to motivate students and appeal to visual learners.  Similarly, integrating instruction on Chinese culture into language classes made the Elementary Chinese curriculum more appealing to students.  Using native Chinese speakers from the local community in the language curriculum, reinforced classroom instruction, made the instruction more relevant, and increased student interest.  Encouraging students to attend Chinese cultural events in the community had many of the same positive benefits for students.  The motivations for learning revealed in this study are very interesting and support earlier studies of Chinese learners.  Personal and profession interests as well as a combination of both these factors were the most commonly cited reasons for learning Chinese.  Maintaining proper motivation is a pivotal factor that determines the success of many elementary learners including the students in this study.  When students lost their motivation, interest in the curriculum and learning declined as well.  Teachers need to be aware of motivations and attempt to foster them in individual students in order to maximize the learning experience.",
  "description_provenance": [
    "Author Email: ifu@vt.edu",
    "Advisor Email: tlou@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: sreyna@radford.edu",
    "Advisor Email: jshrum@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:35Z (GMT). No. of bitstreams: 1 I_Ping_Fu_Dissertation.pdf: 3278620 bytes, checksum: 0750f2251eab88d1f96348ea06bc6a0e (MD5)   Previous issue date: 2005-12-15"
  ],
  "handle": "25955",
  "identifier_other": "etd-01062006-125559",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01062006-125559/",
  "identifier_uri": "http://hdl.handle.net/10919/25955",
  "publisher": "Virginia Tech",
  "relation_haspart": "I_Ping_Fu_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Chinese as a Foreign Language",
    "Chinese as a Second Language",
    "Second Language Acquisition",
    "Vocabulary Acquisition",
    "Vocabulary Learning Strategies"
  ],
  "title": "Student Approaches to Learning Chinese Vocabulary",
  "type": "Dissertation"
}