{
  "contributor_author": "Wilkins, John D.",
  "contributor_committeechair": "Fuhrman, Ellsworth R.",
  "contributor_committeemember": [
    "Rothschild, Joyce",
    "Luke, Timothy W.",
    "Edwards, John",
    "Burian, Richard M."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:06:35Z",
  "date_adate": "2004-01-16",
  "date_available": "2014-03-14T20:06:35Z",
  "date_issued": "2003-12-08",
  "date_rdate": "2005-01-16",
  "date_sdate": "2004-01-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Common, the Contradictory and the Idiosyncratic:  Signposts from a  Qualitative Exploration into the Structural Factors Influencing  Scientific Work in Tsukuba, Japan [1997 â   2002] <p> <p> <p> <p> John D. Wilkins <p> <p> <p> <p> Abstract <p> <p> From the socio-economic turmoil of the 20th century, Japan has repeatedly revealed its resilience.  During these trying times, scientific work has been an important element in Japanâ  s economic development.  However, the 1990s revealed weaknesses in this â  economic miracle.â    During this period, several socio-structural factors have contributed to this social landscape.  Future successes in Japanese socio-economic spheres will partially depend on scientific work.  In this study, it is suggested that identifying structural factors in the Japanese â  systemâ   that contribute to its scientific organizations is key to ascertaining a more coherent assessment of scientific work in Japan.  This assessment can lead to more in depth analyses of the interconnections between science and society.  The focus of this study is on scientific institutes and their organizational structure.  The social networks that interconnect these institutes and couple their scientific work with other elements of Japanese culture are essential in the analysis of Japanâ  s scientific enterprise.<p>  In the present study, a qualitative case study methodology is used to explore socio-structural networks within the cultural field of scientific work in Tsukuba, Japan.  The structure of scientific work in Japan is composed of several cultural and material elements which have been distilled into two themes for evaluative purposes.  These themes include cultural factors and scientific production/economic affairs.  Through a reflexive-thematic lens an analysis of scientific work is conducted.  Central to the method used in this study is a series of structured and un-structured in-person interviews using a format of open-ended questions.  Most informants in this study were chosen by administrators of the institutes involved.  Although, I did participate in assuring diversity in the sample, there is possible bias inherent in managementâ  s choices of particular informants.  These interviews were held during the month of October 2002 in five separate university and non-university institutes in Tsukuba, Japan.<p>  The findings in this study reveal common, contradictory and idiosyncratic aspects that have important cultural and scientific/economic effects across organizational types.  Common attributes include the observation of universal â  top-downâ   organizational hierarchies with networks of labor being accumulated through elite scientists.  Generally, informants perceived little to no effect from the national economy on their particular instituteâ  s funding of science.  Scientists spent an extraordinary amount of time at work and conducted highly specialized work tasks.  The publishing activity concentrated among elite scientists while utilization of foreign scientists and contingent workers were segregated.  Also, the use of tacit knowledge as a principal training tool was universally observed across institutes.<p>    Contradictory attributes include scientistsâ   attitudes toward their work versus the city they live in, government policy versus actual laboratory work, and publishing versus conference presentations.  The idiosyncratic attributes focus on levels of organizational formality across organizations.  The organizational formality is related to the individual scientistsâ   perceptions of what they enjoyed most about their work.  Thus, scientists that enjoyed the â  processesâ   of their work tended to be located in more formal organizations whereas those scientists who enjoyed â  discoveryâ   were situated in less formal organizations.  It is likely that the different levels of organizational formality observed in this study are associated with other elements of laboratory culture.  Also, the composition of foreigners and women varied remarkably across institutes.  Yet, their use in laboratories is relatively similar.<p>",
  "description_provenance": [
    "Author Email: jwilkins30276@my.gcu.edu",
    "Advisor Email: joycer@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Advisor Email: edwardsj@vt.edu",
    "Advisor Email: rmburian@vt.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:35Z (GMT). No. of bitstreams: 1 DISSERTATION_FINAL_JDW.pdf: 1169143 bytes, checksum: 5a4be572bea0bff0a5d38af9528aaea8 (MD5)   Previous issue date: 2003-12-08"
  ],
  "handle": "25953",
  "identifier_other": "etd-01062004-123151",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01062004-123151/",
  "identifier_uri": "http://hdl.handle.net/10919/25953",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISSERTATION_FINAL_JDW.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "scientific production and economic affairs",
    "culture",
    "Japanese science",
    "science and technology",
    "family structure",
    "Japan",
    "policy",
    "actor-network theory",
    "work and occupations",
    "Tsukuba",
    "reflexivity",
    "organizational structure"
  ],
  "title": "The Common, the Contradictory and the Idiosyncratic: Signposts from a Qualitative Exploration into the Structural Factors Influencing Scientific Work in Tsukuba, Japan [1997-2002].",
  "type": "Dissertation"
}