{
  "contributor_author": "Sparks, Jennifer B",
  "contributor_committeechair": "Johnson, Scott W.",
  "contributor_committeemember": [
    "Protinsky, Howard O. Jr.",
    "Skaggs, Gary E.",
    "Gressard, Charles",
    "Alderfer, Charleen"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:06:37Z",
  "date_adate": "2003-03-27",
  "date_available": "2014-03-14T20:06:37Z",
  "date_issued": "2002-12-02",
  "date_rdate": "2006-03-27",
  "date_sdate": "2003-01-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT      This study explores Self-of-the-therapist (SOTT) training practices in accredited and candidacy status doctoral programs supported by the Commission on Accreditation for Marriage and Family Therapy Education (COAMFTE).  Seventy-seven (77) surveys were sent to full-time faculty to assess training structures, training implementation, and the common ethical concerns associated with SOTT training in Marriage and Family Therapy (MFT) doctoral programs.  Chi-square tests and Independent Sample t-tests were run to assess for significant associations between various personal identifiers reported by respondents and attitudes toward required therapy for doctoral trainees.  The 42% response rate represented 14 of the 18 MFT doctoral programs.    The resulting data revealed disagreement within individual programs regarding training and ethical structures.  In addition, the following four variables were found to be significantly associated with the belief that therapy should be required for doctoral trainees: a.) Therapy should be required for master trainees; b.) The type of therapy required for doctoral trainees; c.) \"Authenticity\" as a favorable characteristic in supervisors; and d.) The number of years a respondent had been a client in therapy.  Suggestions are offered to COAMFTE regarding ethical concerns related to SOTT training.",
  "description_provenance": [
    "Author Email: wahookie@millenianet.com",
    "Made available in DSpace on 2014-03-14T20:06:37Z (GMT). No. of bitstreams: 3 TITLEABSTRACT.pdf: 72096 bytes, checksum: 1804c9b46062fdf96bc92226bef47e64 (MD5) VITA.pdf: 123968 bytes, checksum: d6aee16d42aa900d9dafbd4568da9093 (MD5) DISSERTATION.pdf: 958090 bytes, checksum: 1f3220a5c819d04d45648c66f14bd9df (MD5)   Previous issue date: 2002-12-02"
  ],
  "handle": "25959",
  "identifier_other": "etd-01072003-110017",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01072003-110017/",
  "identifier_uri": "http://hdl.handle.net/10919/25959",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "TITLEABSTRACT.pdf",
    "VITA.pdf",
    "DISSERTATION.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mft training",
    "COAMFTE accredited doctoral programs",
    "mft supervision",
    "self-of-the-therapist"
  ],
  "title": "The Current Use of Self-of-the-therapist Training in COAMFTE Accredited Doctoral Programs: A Survey",
  "type": "Dissertation"
}