{
  "contributor_author": "Bassette, Lorraine Pratt",
  "contributor_committeechair": "Parson, Stephen R.",
  "contributor_committeemember": [
    "Tignor, Beatrice",
    "Krill, Cecelia W.",
    "McGrady, Harold J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:06:37Z",
  "date_adate": "2005-04-20",
  "date_available": "2014-03-14T20:06:37Z",
  "date_issued": "2004-11-19",
  "date_rdate": "2005-04-20",
  "date_sdate": "2005-01-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purposes of this study were to assess the effect of the initial and exiting  attitudes toward mathematics and academic outcomes of students placed in the  Developmental Mathematics Basic Arithmetic course at a community college  in Maryland. Major research questions included were:  (1) What is the difference, if any,  between the pretest and posttest attitudes toward mathematics of students placed in Basic  Arithmetic as measured by the Aiken Mathematics Attitude Survey?  (2) What is the  effect, if any, of the placement test for students enrolled in Basic Arithmetic on the final  exam score, attitude pretest scores, and attitude change scores?  (3) What is the difference  between the achievers and nonachievers in Basic Arithmetic as measured by the Aiken  Attitude Towards Mathematics Survey? (4) What is the difference between the achievers  and nonachievers in Basic Arithmetic based on the demographic variables of age, gender,  and ethnicity? The population consisted of 329 students placed in the developmental course   DVM001 Basic Arithmetic. Data were collected by utilizing the Lewis R. Aiken  Attitude Toward Mathematics Survey and the admissions and registration data. The  analysis of variance and the Paired Samples Test were used to obtain the comparative and  correlation analysis. Chi Square was utilized to determine the relationship between the  final grade and the demographic variables. The results revealed: (a) No significant  differences between the pretest and posttest attitudes toward mathematics; (b) The  posttest shows a gain of 1.70 percent in the attitudes towards mathematics; (c) Attitude  change based on gender showed a gain in the female score only; (d) Achievers and  nonachievers have the same attitude towards mathematics; (e) There were statistically  significant differences between the placement score and the final exam score, and (f) The  demographic variables of age and gender were related to the final exam score.",
  "description_provenance": [
    "Author Email: myreturn22@aol.com",
    "Advisor Email: sparson@ncea.com",
    "Advisor Email: beatignor@aol.com",
    "Advisor Email: cwkrill@fcps.edu",
    "Advisor Email: hmcgrady@aol.com",
    "Made available in DSpace on 2014-03-14T20:06:37Z (GMT). No. of bitstreams: 8 Chapter3.pdf: 46826 bytes, checksum: 0ce29a213627e4455cbb24ebae56b7c5 (MD5) Chapter2.pdf: 45432 bytes, checksum: 094f4d3f75cbb8a07b16dc76188d9dfb (MD5) Chapter4.pdf: 116047 bytes, checksum: 9b09ca34445a0419f105a73a744db1d3 (MD5) AppendicesNew.pdf: 648436 bytes, checksum: 88161b24c3d6ccdbf213e20d434012c6 (MD5) References.pdf: 17665 bytes, checksum: e19b9b943bd7b8220b03c058fe41d1eb (MD5) Chapter5.pdf: 14028 bytes, checksum: 6ff1a597c9f7b6c8982b3c17f065dacb (MD5) Chapter1.pdf: 20235 bytes, checksum: eef359c84dd9afd84dd2f852aaa248cb (MD5) FrontMatter.pdf: 13609 bytes, checksum: 437d4d9ec4cbc2152ec0d341072a1cd5 (MD5)   Previous issue date: 2004-11-19"
  ],
  "handle": "25961",
  "identifier_other": "etd-01072005-164605",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01072005-164605/",
  "identifier_uri": "http://hdl.handle.net/10919/25961",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter3.pdf",
    "Chapter2.pdf",
    "Chapter4.pdf",
    "AppendicesNew.pdf",
    "References.pdf",
    "Chapter5.pdf",
    "Chapter1.pdf",
    "FrontMatter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Basic Mathematics",
    "Attitude Towards Math",
    "Community College"
  ],
  "title": "AN ASSESSMENT OF THE ATTITUDES AND OUTCOMES OF STUDENTS ENROLLED IN DEVELOPMENTAL BASIC MATHEMATICS CLASSES AT PRINCE GEORGE'S COMMUNITY COLLEGE",
  "type": "Dissertation"
}