{
  "contributor_author": "Dickerson, Gloria E.",
  "contributor_committeechair": "Parson, Stephen R.",
  "contributor_committeemember": [
    "Binford, Virgie",
    "Sughrue, Jennifer A.",
    "Dawson, Christina M.",
    "Krill, Cecelia W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:06:39Z",
  "date_adate": "2002-01-11",
  "date_available": "2014-03-14T20:06:39Z",
  "date_issued": "2001-11-29",
  "date_rdate": "2003-01-11",
  "date_sdate": "2002-01-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to examine the key factors associated with sustaining an effective educational program.  The primary research question was: How did the Bright Beginnings: Fantastic Follow Through program sustain itself for more than 25 years? The secondary research questions asked in this study were: (a) what role did the school context play in sustaining the program;  (b) what role did leadership play in sustaining the program;  (c) how did the school culture affect sustaining the program; (d) how did the implementation, continuation, and evaluation phases of the change effort affect sustaining the program; and  (e) what effect, if any, did external factors have on sustaining the program? \tThis study was a descriptive case study of one exemplary program in an urban elementary school in a mid-Atlantic state.  A naturalistic, responsive inquiry approach was employed through in-depth interviews, combined with document reviews as data sources.  The key participants included local school administrators, teachers, parents, and the central administrative liaison to the program.  The participants were interviewed in-person for approximately 30-60 minutes in length. \tMaterials gathered during the in-depth interviews were transcribed and analyzed after the interviews were completed.  First the researcher read the transcribed interviews and hand-coded the consistencies and emerging themes onto a large chart.  Second, a matrix was made of the hand-coded data using a word processor.  Third, the researcher identified themes, common patterns and important stories shared by the participants regarding the elements essential to the institutionalization of an educational program.  Discussion of the summary, conclusions, implications for practice, and recommendations for further research are provided in Chapter Five.",
  "description_provenance": [
    "Author Email: ged48@aol.com",
    "Advisor Email: parson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:39Z (GMT). No. of bitstreams: 2 FrontMatter.pdf: 18643 bytes, checksum: 1aa85730ac9e0e7815ba0c36d4fae374 (MD5) Chapters1-5.pdf: 287820 bytes, checksum: cfd39bd5265f840f891a77ca56a7cf26 (MD5)   Previous issue date: 2001-11-29"
  ],
  "handle": "25968",
  "identifier_other": "etd-01092002-190242",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01092002-190242/",
  "identifier_uri": "http://hdl.handle.net/10919/25968",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "FrontMatter.pdf",
    "Chapters1-5.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "School-Community Partnerships",
    ": Parent Involvement",
    "Follow Through"
  ],
  "title": "The Institutionalization of Educational Reform: Sustaining an Effective Educational Program",
  "type": "Dissertation"
}