{
  "contributor_author": "Chatraphorn, Pongprot",
  "contributor_committeechair": "Brozovsky, John A.",
  "contributor_committeemember": [
    "Ye, Keying",
    "Brown, Robert M.",
    "Richardson, Frederick M.",
    "Amoruso, Anthony J."
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:06:39Z",
  "date_adate": "2002-01-10",
  "date_available": "2014-03-14T20:06:39Z",
  "date_issued": "2001-12-19",
  "date_rdate": "2003-01-10",
  "date_sdate": "2002-01-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this research is to examine whether accounting methods for business combinations (purchase and pooling-of-interests accounting) have a different effect on firmsâ   market value of equity in the combination year and thereafter.  In particular, after the accounting method is no longer disclosed in the financial statements, does it have an impact on market value of equity of the combined firms because the accounting figures are different?  A five-year period subsequent to a particular business combination is used because public companies are not required to disclose the details of the combination for more than three years after the effective date of the combination.  This research, thus, tests whether market participants still take into consideration the accounting method of past business combinations when this information is no longer disclosed in the financial statements.  In addition to the testing of the impact of the accounting methods, the value-relevance of goodwill amortization is investigated.  \tThe sample consisted of 100 U.S. business combination transactions during the period 1985â  1995 (77 pooling firms and 23 purchase firms).  The results do not indicate that market participants price pooling firms and purchase firms differently at the time of business combinations.  The results, in addition, do not confirm that when the details of a particular business combinations do not appear in the financial statements, pooling firmsâ   accounting figures have a more positive effect on security prices than those of purchase firms.  It seems that market participant are able, even in the long term, to account for the accounting difference between purchase and pooling-of-interests.  Also, goodwill amortization does not appear to be value relevant.",
  "description_provenance": [
    "Author Email: pchatrap@vt.edu",
    "Advisor Email: keying@vt.edu",
    "Advisor Email: moren@vt.edu",
    "Advisor Email: jbrozovs@vt.edu",
    "Advisor Email: frich@vt.edu",
    "Advisor Email: amoruso@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:39Z (GMT). No. of bitstreams: 1 pongprot.pdf: 340944 bytes, checksum: 81d01a2593bc905231c1552a1b713707 (MD5)   Previous issue date: 2001-12-19"
  ],
  "handle": "25969",
  "identifier_other": "etd-01092002-230303",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01092002-230303/",
  "identifier_uri": "http://hdl.handle.net/10919/25969",
  "publisher": "Virginia Tech",
  "relation_haspart": "pongprot.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Pooling",
    "Purchase Accounting",
    "Acquisitions",
    "Business Combinations",
    "Mergers"
  ],
  "title": "Accounting for Business Combinations: A Test for Long-Term Market Memory",
  "type": "Dissertation"
}