{
  "contributor_author": "Tuttle, Terry Lynn",
  "contributor_committeechair": "Lawson, Gerard F.",
  "contributor_committeemember": [
    "Belli, Gabriella M.",
    "Rosen, Karen H.",
    "Coleman, Jean U.",
    "Brott, Pamelia E."
  ],
  "contributor_department": "Counseling",
  "date_accessioned": "2014-03-14T20:06:38Z",
  "date_adate": "2006-02-24",
  "date_available": "2014-03-14T20:06:38Z",
  "date_issued": "2004-06-08",
  "date_rdate": "2007-02-24",
  "date_sdate": "2006-01-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Hope, Attitude, and Recovery from Schizophrenia Terry Lynn Tuttle Virginia Polytechnic Institute and State University    ABSTRACT  The Hope Scale by Snyder and the Recovery Attitudes Questionnaire-7 were used to explore the patterns of hope and attitude toward recovery from schizophrenia in a sample of 100 adults diagnosed with schizophrenia or schizoaffective disorder participating in five psychiatric rehabilitation programs in an affluent suburban setting.  Using the Hope Scale, which is based on a definition of hope as a future-goal oriented cognitive process, and the Recovery Attitudes Questionnaire-7(RAQ-7), this study concluded that the construct of hope is not synonymous with a positive attitude about attaining the goal of recovery.  Though participants reported being generally hopeful and having positive attitudes toward recovery from serious mental illness, the two variables, hope and attitude do not correlate with each other. Nor do individual items from the Hope Scale and the Recovery Attitudes Questionnaire-7 load on the same components during principal components factor analysis, though hope and attitude each account for more than 20% of the total variance of the data set.  A serendipitous finding was the statistically significant difference between the means on the RAQ-7 of the sample of the current study and the sample of the instrument development process; across all levels of recovery, a more positive attitude towards recovery was expressed than was expressed seven years earlier.  An additional statistically significant finding was the direct positive correlation between level of recovery and number of hours of volunteer service per week.  Rather than concentrating on talk therapy with persons with schizophrenia to increase levels of hope and positive attitude before recovery begins, a more effective means of encouraging recovery may be to involve individuals with schizophrenia in meaningful social roles through volunteer work.",
  "description_provenance": [
    "Author Email: tltuttle@starpower.net",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: krosen@vt.edu",
    "Advisor Email: jcoleman@vt.edu",
    "Advisor Email: glawson@vt.edu",
    "Advisor Email: pbrott@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:38Z (GMT). No. of bitstreams: 2 tuttle1.pdf: 131665 bytes, checksum: 88564b5ca5ec5e3b2071545a7253c12f (MD5) tuttle2.pdf: 723337 bytes, checksum: 0cc7ff365d646366760f57673e2a68ce (MD5)   Previous issue date: 2004-06-08"
  ],
  "handle": "25966",
  "identifier_other": "etd-01082006-154002",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01082006-154002/",
  "identifier_uri": "http://hdl.handle.net/10919/25966",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "tuttle1.pdf",
    "tuttle2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "schizophrenia",
    "attitude",
    "hope",
    "hope scale",
    "recovery attitude questionnaire",
    "psychiatric rehabilitation"
  ],
  "title": "Hope, Attitude, and Recovery from Schizophrenia",
  "type": "Dissertation"
}