{
  "contributor_author": "Zheng, Jun",
  "contributor_committeechair": "Frazier, Charles E.",
  "contributor_committeemember": [
    "Wilkes, Garth L.",
    "Glasser, Wolfgang G.",
    "Helm, Richard Frederick",
    "Kamke, Frederick A."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:06:37Z",
  "date_adate": "2003-01-09",
  "date_available": "2014-03-14T20:06:37Z",
  "date_issued": "2002-12-17",
  "date_rdate": "2004-01-09",
  "date_sdate": "2003-01-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Phenol-formaldehyde (PF) resole and polymeric diphenylmethane diisocyanate (PMDI) are two commonly used exterior thermosetting adhesives in the wood-based composites industry.  There is an interest in combining these two adhesives in order to benefit from their positive attributes while also neutralizing some of the negative ones.  Although this novel adhesive system has been reportedly utilized in some limited cases, a fundamental understanding is lacking. This research serves this purpose by investigating some of the important aspects of this novel adhesive system.   The adhesive rheological and viscometric properties were investigated with an advanced rheometer. The resole/PMDI blends exhibited non-Newtonian flow behavior. The blend viscosity and stability were dependent on the blend ratio, mixing rate and time. The adhesive penetration into wood was found to be dependent on the blend ratio and correlated with the blend viscosity.  By using dynamic mechanical analysis, the blend cure speed was found to increase with the PMDI content. Mode I fracture testing of resole/PMDI hybrid adhesive bonded wood specimens indicated the dependence of bondline fracture energy on the blend ratio. The 75/25 PF/PMDI blend exhibited a high fracture energy with a fast cure speed and processable viscosity. Exposure to water-boil weathering severely deteriorated the fracture energies of the hybrid adhesive bondlines.   More detailed chemistry and morphological studies were performed with cross-polarization nuclear magnetic resonance and 13C, 15N-doubly labeled PMDI. A spectral decomposition method was used to obtain information regarding chemical species concentration and relaxation behavior of the contributing components within the major nitrogen resonance. Different urethane concentrations were present in the cured blend bondlines. Water-boil weathering and thermal treatment at elevated temperatures (e.g. > 200°C) caused reduced urethane concentrations in the bondline. Solid-state relaxation parameters revealed a heterogeneous structure in the non-weathered blends. Water boil weathering caused a more uniform relaxation behavior in the blend bondline.     By conducting this research, more fundamental information regarding the PF/PMDI hybrid adhesives will become available. This information will aid in the evaluation of, and improve the potential use of PF/PMDI hybrid adhesives for wood-based composites.",
  "description_provenance": [
    "Author Email: zhengj@bordenchem.com",
    "Advisor Email: cfrazier@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:37Z (GMT). No. of bitstreams: 1 Jun_Zheng_Dissertation.pdf: 3795646 bytes, checksum: 54c275137e319eac8566b475bfb52524 (MD5)   Previous issue date: 2002-12-17"
  ],
  "handle": "25960",
  "identifier_other": "etd-01072003-200607",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01072003-200607/",
  "identifier_uri": "http://hdl.handle.net/10919/25960",
  "publisher": "Virginia Tech",
  "relation_haspart": "Jun_Zheng_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fracture testing",
    "adhesives",
    "PF resole",
    "wood adhesion",
    "spectral decomposition",
    "solid-state NMR",
    "isocyanate",
    "urethane",
    "weathering"
  ],
  "title": "Studies of PF Resole / Isocyanate Hybrid Adhesives",
  "type": "Dissertation"
}