{
  "contributor_author": "Godshall, David Leonard",
  "contributor_committeechair": "Wilkes, Garth L.",
  "contributor_committeemember": [
    "Saraf, Ravi F.",
    "McGrath, James E.",
    "Shultz, Allan R.",
    "Baird, Donald G."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:06:39Z",
  "date_adate": "2003-02-26",
  "date_available": "2014-03-14T20:06:39Z",
  "date_issued": "2002-10-22",
  "date_rdate": "2004-02-26",
  "date_sdate": "2003-01-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Blown films of high molecular weight high density polyethylene (HMW-HDPE) were produced from two resins of differing molecular weight (MW) and molecular weight distribution (MWD) using a high stalk bubble configuration.  The processing conditions were varied such that three film gauges, each fabricated at three frost line heights (FLH), were produced.  Crystalline orientation and tear resistance properties of the films were measured.  Under appropriate conditions, the formation of two populations of lamellar stacks with their surface normals orthogonal to one another were observed.  Increasing the FLH increased the amount of transverse direction (TD) stacked lamellae.  This finding was related to bubble shape and relaxation behavior.  Balanced in plane crystalline orientation was noted to give the best dart impact performance.  Interestingly, for the lower Mw resin in the study, this could be achieved by down gauging.\t In a second project, structure-property-processing relationships were investigated in a series of high density polyethylene (HDPE) blown films.  The use of metallocene and chromium oxide based resins allowed the effects of MW and MWD on orientation behavior to be studied.  All films possessed Keller-Machin low stress morphologies oriented along the film MD.  Under identical processing conditions, the narrower MWD resins produced films with greater orientation than the broader MWD resins of equivalent weight average MW.  Greater processing stresses and shorter quench times were noted to produce higher levels of orientation.  Moisture vapor transmission rate (MVTR) performance of these films was also measured.  Orientation effects were seen to influence MVTR as permeation behavior did not scale directly with the crystalline content in the films.  \tAdditional studies investigated the relationship between comonomer content and the thermal and structural properties of novel poly(acrylonitrile-co-methyl acrylate) materials.  Five polymers were studied with methyl acrylate (MA) content varying between 0 and 15 mol%.  The MA decreased both the glass transition and melting temperatures.  Melting point depression was sufficient in the two highest MA content copolymers to allow for complete melting prior to the onset of thermal degradation using modest heating rates (20 ÂºC/min).  Insight into the heterogeneous structure of poly(acrylonitrile) homopolymer was gained through both conventional and modulated differential scanning calorimetry.",
  "description_provenance": [
    "Author Email: dlgodsha@tredegar.com",
    "Advisor Email: rsaraf@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: ashultz@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:39Z (GMT). No. of bitstreams: 1 dlg-dist2.pdf: 6781032 bytes, checksum: 8bda0171309e4aa410bd318e6c6d775b (MD5)   Previous issue date: 2002-10-22"
  ],
  "handle": "25971",
  "identifier_other": "etd-01092003-201135",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01092003-201135/",
  "identifier_uri": "http://hdl.handle.net/10919/25971",
  "publisher": "Virginia Tech",
  "relation_haspart": "dlg-dist2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "blown film",
    "Polyacrylonitrile",
    "Polyethylene"
  ],
  "title": "INVESTIGATIONS OF STRUCTURE â   PROPERTY RELATIONSHIPS IN SEMICRYSTALLINE THERMOPLASTIC POLYMERS: BLOWN POLYETHYLENE FILMS AND POLYACRYLONITRILE COPOLYMERS",
  "type": "Dissertation"
}