{
  "contributor_author": "Bonabana-Wabbi, Jackline",
  "contributor_committeechair": "Taylor, Daniel B.",
  "contributor_committeemember": [
    "Kuminoff, Nicolai V.",
    "Bosch, Darrell J.",
    "Bertelsen, Michael K.",
    "Norton, George W."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:06:40Z",
  "date_adate": "2008-04-15",
  "date_available": "2014-03-14T20:06:40Z",
  "date_issued": "2007-12-20",
  "date_rdate": "2008-04-15",
  "date_sdate": "2008-01-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Two experimental procedures are employed to value both health and environmental benefits from reducing pesticides in Uganda. The first experiment, an incentive compatible auction involves subjects with incomplete information placing bids to avoid consuming potentially contaminated groundnuts/water in a framed field experimental procedure. Three experimental treatments (information, proxy good, and group treatments) are used. Subjects are endowed with a monetary amount (starting capital) equivalent to half the country창  s per capita daily income (in small denominations). Two hundred and fifty seven respondents were involved in a total of 35 experimental sessions in Kampala and Iganga districts. Tobit model results indicate that subjects place significant positive values to avoid ill health outcomes, although these values vary by region, by treatment and by socio-economic characteristics. Gender differences were important in explaining bidding behavior, with male respondents in both study areas bidding higher to avoid ill health outcomes than females. Consistent with a priori expectation, rural population창  s average willingness to pay (WTP) to avoid ill health outcomes was lower (by 11.4 percent) than the urban population창  s WTP possibly reflecting the poverty level in the rural areas and how it translates into reduced regard for health and environmental improvements. Tests of hypotheses suggest (i) providing brief information to subjects just prior to the valuation exercise does not influence bid behavior, (ii) subjects are indifferent to the source of contamination: WTP to avoid health outcomes from potentially contaminated water and groundnuts are not significantly different, and (iii) the classical tendency to free-ride in public goods provision was observed, and this phenomenon was more pronounced in the urban than the rural area.  The second experimental procedure involved 132 urban respondents making repeated choices from a set of scenarios described by attributes of water quality, an environmental good. Water quality is represented by profiles of water safety levels at varying costs. Analysis using the conditional (fixed effects) logit showed that urban subjects highly discount unsafe drinking water, and were willing to pay less for safe agricultural water, a result not unexpected considering that the urban population is not directly involved in agricultural activities and thus does not value agricultural water quality as much as drinking water quality. Results also showed that subjects창   utility increased with the cost of a water sample (inconsistent with a downward sloping demand curve), suggesting perhaps that they perceived higher costs to be associated with higher water quality. Some theoretically inconsistent results were obtained with choice experiments.",
  "description_provenance": [
    "Author Email: jbonaban@vt.edu",
    "Advisor Email: kuminoff@vt.edu",
    "Advisor Email: bosch@vt.edu",
    "Advisor Email: bertel@vt.edu",
    "Advisor Email: gnorton@vt.edu",
    "Advisor Email: taylord@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:40Z (GMT). No. of bitstreams: 5 etdfinal.pdf: 643787 bytes, checksum: 1e048d17d3c15f8178b6f4ea5128ff3e (MD5) auctioniganga.pdf: 4446 bytes, checksum: e316fd8da250188444b92001b993cb8c (MD5) auctionkla.pdf: 11271 bytes, checksum: b242413c89594c5fc0b98058682449eb (MD5) choicedata.pdf: 120799 bytes, checksum: 5ae3b72bfa7fa6338072d59011cd9134 (MD5) irbapproval.pdf: 180199 bytes, checksum: 5159c0f6d086100f73a2e6c78512c542 (MD5)   Previous issue date: 2007-12-20"
  ],
  "handle": "25977",
  "identifier_other": "etd-01092008-174129",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01092008-174129/",
  "identifier_uri": "http://hdl.handle.net/10919/25977",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etdfinal.pdf",
    "auctioniganga.pdf",
    "auctionkla.pdf",
    "choicedata.pdf",
    "irbapproval.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Field Experiments",
    "Auctions",
    "Choice Experiments",
    "Conditional Logit",
    "Tobit",
    "Uganda"
  ],
  "title": "Health and Environmental Benefits of Reduced Pesticide Use in Uganda: An Experimental Economics Analysis",
  "type": "Dissertation"
}