{
  "contributor_author": "Chappell II, Glenn Franklin",
  "contributor_committeechair": "Sobrero, Patricia M.",
  "contributor_committeecochair": "Price, William T. Jr.",
  "contributor_committeemember": [
    "Phipps, Patrick M.",
    "Sutphin, H. Dean",
    "Hillison, John H."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:06:40Z",
  "date_adate": "2007-03-05",
  "date_available": "2014-03-14T20:06:40Z",
  "date_issued": "2006-12-04",
  "date_rdate": "2007-03-05",
  "date_sdate": "2007-01-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to identify the barriers Virginia agricultural producers encounter when using the Internet and their preferences when seeking information delivered via the Internet.  The results are expected to provide Extension educators needed information about producer Internet use patterns and their preferences related to Internet-based learning systems. \tThe survey population (N = 370) consisted of Virginia agricultural producers currently known to be using the Internet as identified by the county Agricultural  Extension agents.  Data were collected online via an interactive, encrypted Web site and analyzed with SAS/STAT software.  \tThe 186 usable producer responses indicated that they were predominately white (98.36%), males (82.87%) averaging 51 years of age with some college education.  Their primary occupation was farm or ranch work (41.71%) with a gross value of agricultural sales of $100,000 - $249,999.  Nearly 60% conducted Internet agricultural marketing activities; three quarters purchased agricultural supplies, 43.17% conduct non-agricultural Internet business, and 50% use dialup services to access the Internet.    In total, 95.68% of the responding producers access the Internet at least once a week and 31.60% reported previous participation in Internet-based learning.   \tProducers below 30 years of age considered their lack of experience/training to be less of a barrier than older producers.  Time constraints associated with job responsibilities, isolation from other program participants, and their ability to learn at a distance were seen as greater barriers by males than females.  Producers listing their primary occupation as other than farming saw time constraints associated with their job as a greater barrier than those retired but still farming.  Producers with a high school education generally rated barriers associated with Internet-based learning as greater obstacles than those with advanced degrees.  Following an exposure to an Internet-based learning experience, no differences were observed related to the producersâ   age, gender, primary occupation, and the operationâ  s gross value of agricultural sales and the selected factors.   \tProducers making agricultural Internet purchases, perceived their motivation to participate in Internet-base learning as less of a barrier than those that did not.  Generally, as the producersâ   Internet use frequency increased, their perception of the barriers was reduced and those with previous Internet-based learning experience saw their ability to learn at a distance as less of a barrier than did those with no experience.   \tA comparison of pre- and post-exposure data, revealed time constrains associated with job responsibilities, access to instructors/specialists, feedback/instructor contact, and the motivation to participate as the greatest barriers to Internet-base learning.  Differences in pre- and post-exposure assessments confirm that producersâ   perception of the barriers were worse than actuality.  \tExtensionâ  s Internet-based learning experiences should be accessible from a familiar Internet location.  The learnersâ   abilities and connectivity should be considered when developing systems to minimize barriers associated with these factors.  Internet-based activities should be relevant to the learner.  Experiences should be available in multiple formats including video, audio, print and combinations of the aforementioned.  Learners should be afforded the opportunity to interact with the presenter/instructor via the most acceptable and timely means.",
  "description_provenance": [
    "Author Email: gfcii@vt.edu",
    "Advisor Email: psobrero@vt.edu",
    "Advisor Email: pmphipps@vt.edu",
    "Advisor Email: sutphind@vt.edu",
    "Advisor Email: wprice@vt.edu",
    "Advisor Email: hillison@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:40Z (GMT). No. of bitstreams: 1 Chappell-edits-2-09-07.pdf: 730106 bytes, checksum: e1c3f8f6323ad35f07c02d4f1d6455c5 (MD5)   Previous issue date: 2006-12-04"
  ],
  "handle": "25974",
  "identifier_other": "etd-01092007-182442",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01092007-182442/",
  "identifier_uri": "http://hdl.handle.net/10919/25974",
  "publisher": "Virginia Tech",
  "relation_haspart": "Chappell-edits-2-09-07.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Internet-based learning system",
    "Agriculture",
    "Distance learning",
    "Barriers"
  ],
  "title": "Barriers to Internet-Based Learning Systems  in a Select Virginia Agricultural Population",
  "type": "Dissertation"
}