{
  "contributor_author": "Brame, Roderic Ian",
  "contributor_committeechair": "Bambach, Richard K.",
  "contributor_committeemember": [
    "Scheckler, Stephen E.",
    "Dutro, J. Thomas Jr.",
    "Eriksson, Kenneth A.",
    "Pojeta, John  Jr.",
    "Dennison, John M."
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:06:41Z",
  "date_adate": "2003-01-27",
  "date_available": "2014-03-14T20:06:41Z",
  "date_issued": "2000-08-25",
  "date_rdate": "2004-01-27",
  "date_sdate": "2003-01-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "REVISION OF THE UPPER DEVONIAN IN THE CENTRAL-SOUTHERN APPALACHIAN BASIN: Biostratigraphy and Lithostratigraphy  Roderic Ian Brame   (ABSTRACT)  \tThe Upper Devonian of the central-southern Appalachians Valley and Ridge province of Virginia lacks stratigraphic resolution, revised formal nomenclature, and detailed biostratigraphic data.  Eight of the most complete sections available in a three thousand square mile area were used to build a framework for revising the stratigraphy of the Upper Devonian strata in southwestern Virginia.  Detailed lithologic descriptions of about four thousand feet (1.3 km) of rock were made at each outcrop.  John Dennisonâ  s (1970 and 1976) nomenclature for the Upper Devonian along the Alleghany Front was successfully tested for it usefulness in Southwestern Virginia and are hereby applied to these rocks.  The stratigraphic interval ranges in age from the Middle Devonian to the Lower Carboniferous.  The stratigraphic units include the Middle Devonian Millboro Shale, the Upper Devonian Brallier, Scherr, Foreknobs (formally the \"Chemung\"), Hampshire, and the Lower Carboniferous Price Formation.  The Brallier contains two members (Back Creek Siltstone and Minnehaha Springs), the Foreknobs is divided into five members (Mallow, Briery Gap, Blizzard, Pound, and Red Lick), and the lower Price is divided into three members (the Cloyd Conglomerate, Sunbury Shale, and the Ceres).  23046 fossils were collected and 160 taxa were identified.  The biostratigraphic range of each taxon was compiled, analyzed, and then divided into biostratigraphic zones.  19 local biozones are described.  The Frasnian/Famennian boundary is accurately placed based on occurrences of internationally known index fossils.  The Frasnian/Famennian extinction event is recognized and is determined to have two pulses.  The local biostratigraphic zonations doubled the resolution of previous studies.  Lithostratigraphic and biostratigraphic data were combined to look at the timing and rates of events.  The lithostratigrapic divisions were tested to see if their boundaries are or are not time transgressive.  The Brallier/Foreknobs, Blizzard/Pound, and Pound/Redlick boundaries are crossed by biozones.  Conversely the Frasnian/Famennian boundary crosses the lithologic boundary between the Pound and Red Lick Members. This documents the prograding nature of the clastic wedge.  Composite biostratigraphic ranges correlate with ranges in New York and western Maryland.  This detailed lithostraigraphic and biostratigraphic study documents a comprehensive and higher resolution understanding of the Upper Devonian in the Central-Southern Appalachian Basin.",
  "description_provenance": [
    "Author Email: roderic.brame@wright.edu",
    "Advisor Email: stephen@vt.edu",
    "Advisor Email: kaeson@vt.edu",
    "Advisor Email: Pojeta.John@NMNH.SI.EDU",
    "Advisor Email: rbambach@oeb.harvard.edu",
    "Made available in DSpace on 2014-03-14T20:06:41Z (GMT). No. of bitstreams: 4 RBbiosketch.pdf: 162748 bytes, checksum: 035351daec6d373b86fbad0343bc133c (MD5) RBdist.pdf: 8826249 bytes, checksum: 548ad1a8517a3831f1c6f1b0a00ae721 (MD5) Plate25.pdf: 407780 bytes, checksum: 06cdcf4ad2a51ea7bbd46af3219983be (MD5) Plate24.pdf: 151334 bytes, checksum: 10ad4e073d06d32111e78672a6441d43 (MD5)   Previous issue date: 2000-08-25"
  ],
  "handle": "25981",
  "identifier_other": "etd-01102003-143257",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01102003-143257/",
  "identifier_uri": "http://hdl.handle.net/10919/25981",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "RBbiosketch.pdf",
    "RBdist.pdf",
    "Plate25.pdf",
    "Plate24.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Biostratigraphy",
    "Devonian",
    "Stratigraphy",
    "Frasnian/Famennian Extinction"
  ],
  "title": "Revision of the Upper Devonian in the Central-Southern Appalachian Basin: Biostratigraphy and Lithostratigraphy",
  "type": "Dissertation"
}