{
  "contributor_author": "Anchamparuthy, Vahida Muhammed Ismail",
  "contributor_committeechair": "Gwazdauskas, Francis C.",
  "contributor_committeemember": [
    "Pearson, Ronald E.",
    "Jiang, Honglin",
    "Wong, Eric A.",
    "Eyestone, Willard H."
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:06:42Z",
  "date_adate": "2008-02-19",
  "date_available": "2014-03-14T20:06:42Z",
  "date_issued": "2007-12-20",
  "date_rdate": "2008-02-19",
  "date_sdate": "2008-01-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Cryopreservation of oocytes is a challenge. Studies were conducted to vitrify mouse zygotes and cumulus-intact bovine oocytes from follicles of different diameters, small (â ¤ 4 mm) and medium (4 to 10 mm), using nylon mesh. The specific goals were to assess changes in apoptotic gene expression (Fas-FasL, Bax, Bcl-2, and survivin) in conjunction with terminal deoxynucleotidyl transferase dUTP nick end labeling (TUNEL) and caspase assays. Mouse zygotes were exposed to increasing concentrations of ethylene glycol (EG), Ficoll-70 and sucrose in phosphate buffered saline (PBS) for vitrification on nylon mesh and plunged into liquid nitrogen. Warming resulted in 81.7% morphological survival. The rate of blastocyst formation was 59.9% for vitrified zygotes but, this was significantly lower than that of non vitrified embryos (66.2%). There was no difference in the hatching rates between groups.  Both Fas and FasL mRNA were detected at the 4-cell and morula stages, suggesting Fas signaling was operational in early embryos. The level of expression of Bax mRNA tended to increase, while expression of survivin mRNA was not different for 2- and 4-cell embryos. Fragmented embryos showed an increase in Bax mRNA levels, while survivin mRNA level was reduced. In the second experiment, vitrification of bovine oocytes was carried out. Pre-cooled cryovials resulted in 98.9% morphological survival. The oocytes from small and medium size follicles had a significant impact on cleavage (53.7 Â± 1.6% vs. 43.8 Â± 1.6%, respectively) and blastocyst rates were 16.9 Â± 1.0% and 11 Â± 1.2%, respectively. Follicle size for oocytes had no impact on the expression of apoptotic genes. The Fas-FasL and Bax-Bcl-2 mRNA showed increased expression after vitrification, but tended to decrease after 9 h of maturation. Yet, results from TUNEL and caspase assays did not support the evidence of the downstream apoptotic signaling pathway in embryos. The semen utilized for in vitro fertilization in both vitrified and control oocytes responded differently in the 4 tested bulls than their field fertility record. The altered transcriptional activities of apoptotic genes, Fas-FasL and Bax-Bcl-2, and survivin were indicative of possible apoptotic activity in vitrified embryos and oocytes subjected to in vitro fertilization.",
  "description_provenance": [
    "Author Email: anchamvm@vt.edu",
    "Advisor Email: guaz@vt.edu",
    "Advisor Email: rep@vt.edu",
    "Advisor Email: hojiang@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: weyest@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:42Z (GMT). No. of bitstreams: 1 Vahida_Anchamparuthy_Dissertation.pdf: 1003711 bytes, checksum: 348f8a821fe5f171ade1189055420262 (MD5)   Previous issue date: 2007-12-20"
  ],
  "handle": "25986",
  "identifier_other": "etd-01112008-161136",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01112008-161136/",
  "identifier_uri": "http://hdl.handle.net/10919/25986",
  "publisher": "Virginia Tech",
  "relation_haspart": "Vahida_Anchamparuthy_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "caspase",
    "gene",
    "mRNA",
    "oocyte",
    "TUNEL"
  ],
  "title": "Vitrification of Bovine Oocytes",
  "type": "Dissertation"
}