{
  "contributor_author": "Johnson, Mark Steven",
  "contributor_committeechair": "Holladay, Steven D.",
  "contributor_committeemember": [
    "Robertson, John L.",
    "Smith, Stephen A.",
    "McCain, Wilfred C.",
    "Squibb, Kathrine S."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:06:42Z",
  "date_adate": "1999-01-11",
  "date_available": "2014-03-14T20:06:42Z",
  "date_issued": "1998-12-08",
  "date_rdate": "2000-01-11",
  "date_sdate": "1999-01-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Assessing ecological risk to wildlife exposed to anthropogenic contamination in soil has traditionally been problematic.  Attempts to standardize an approach to evaluate risk for various community types in North America have been challenging, given the variation in terrestrial communities and the values in which policy makers are bound to protect.  This has resulted in vague, yet flexible guidance from the U.S. Environmental Protection Agency and other interested parties (e.g., the U.S. Army Corps of Engineers, and the Tri-Service Ecological Risk Assessment Working Group).  Interpretation of these and other guidance has been variable, often resulting in conflicting opinions on how best to address the question of ecological risk to receptors that are exposed to xenobiotics in a soil matrix.    This work reports the results of research designed to address the question of ecological risk to terrestrial vertebrates.  Objective, ecologically-relevant criteria were used in the selection and development of models in this research.  Several lines of logic were considered: 1) substance sensitivity, 2) ecological sensitivity (i.e., the species importance to the system; e.g., keystone species); and, 3) probability and extent of exposure.    A primary soil contaminant at many U.S. Army installations is 2,4,6-trinitrotoluene (TNT).  This was a result of the mass manufacturing, storing, and assembly of weapons from the early 1900's until the 1950s.  The Army has reported soil concentrations of TNT ranging from 0.12 to 38,600 ug/g (Walsh and Jenkins 1992) and 0.08 to 64,000 ug/g (Hovatter et al. 1997).  The chemical-physical properties of TNT result in a relatively unique compound, not easily amenable to current modeling techniques to estimate exposure to terrestrial wildlife.  Moreover, there are few data describing the effects of exposure to TNT in other than mammals, fish, and specific invertebrates.   In this research, the pathways of exposure and selected potential toxic effects from TNT exposure were investigated in a terrestrial salamander: Ambystoma tigrinum (tiger salamanders).  A. tigrinum was chosen since they are exclusively carnivorous, relatively long-lived, have a thin integument, and are large enough to investigate individual effects.  These investigations were designed to mimic natural conditions as closely as possible, though maintain a degree of homogeneity in a laboratory environment.  All studies exposed salamanders to soil and food (earthworms) in identical preparations.  As such, these exposures were considered complete, eliminating assumptions made regarding daily food consumption, systemic dermal dose, etc.   The first study examined the relative contribution of dermal or oral exposures to the whole-body burdens of TNT and primary metabolites.  A poly-chlorinated biphenyl (PCB) mixture (Aroclor7 1260) was used with TNT to simultaneously to assist in the evaluation of each pathway, since the fate and transport of PCBs are well characterized.  Tiger salamanders were exposed 28 days in situ.  The dermal route of exposure contributed the most to the final burdens of TNT in salamanders, with the primary reduction products, 2-amino-4,6-dinitrotoluene and 4-amino, 2,6-dinitrotoulene reaching higher concentrations than of parent compound.  Other TNT metabolites were found in insignificant quantities.  The concentrations of PCBs were higher in the oral treatment, as expected.  These results were corroborated in a subsequent study using Ambystoma maculatum (spotted salamanders).  The second series of investigations evaluated the potential toxic effects from TNT exposure.  Two treatments consisting of TNT and a control were used to evaluate these effects to A. tigrinum.  The salamanders were exposed in situ for 14 days to TNT in soil and food (earthworms of which were exposed to TNT in the soil in similar preparations).   Non-specific immune effects were evaluated through the characterization of splenic phagocytes in their ability to: 1) phagocytize foreign particles, and 2) digest (through oxygen radicals) phagocytized material.  This was conducted using fluorescent microspheres and a fluorescent chemical probe specific to hydrogen peroxide, measured per each cell using flow cytometry.  Other data collected included histological examination (e.g., liver, kidney, and other miscellaneous organs), blood differentials, weight changes over time, organ/ body weight comparisons, and an analysis of organ-specific metabolism.  No significant effects were noted in salamanders exposed to these conditions.  Coordinated with the preceding study included a search for biomarkers of exposure and an investigation of the metabolites of TNT in situ.  Biotransformation products of TNT were found including primary (e.g., 2-amino-4,6-dinitrotoluene) and secondary (e.g., 2,4-diamino-6-nitrotoluene) in relative concentrations in skin, liver, and kidney.  Biomarkers of exposure included an analysis of cytochrome p450, b5, and the glutathione antioxidant enzymes in liver, kidney, skin, lung, and serum, respectively.  Traces of parent compound were found in the skin and liver only.  Levels of 2,4-diamino-6-nitrotoluene were found only in the liver and kidney, suggesting that TNT is reduced primarily in or on the skin.  Levels of p450 were higher in TNT exposed salamanders than controls.  Glutathione and related enzyme levels are reported.  This work suggests that salamanders have levels of detoxification enzymes capable of the biotransformation of anthropogenic substances in soil rivaling that of mammals.  Another investigation evaluated these same immunological parameters in white-footed mice (Peromyscus leucopus).  This species was chosen based on the relative importance of small mammals to the community structure in many North American ecosystems.  Mice were exposed to TNT in the feed at 0.264, 0.066, 0.033, and 0.017%, where actual daily dose estimates for males were 604, 275, 109, and 65; and for females was 544, 282, 143, and 70 mg/kg/d.   An investigation to evaluate the specificity of commercially-available monoclonal antibodies specific to cell surface markers for thymocytes and splenocytes in inbred mice was unsuccessful.  These results suggest the recognition epitopes of monoclonal antibodies prepared against Old-World mice are not conserved into Peromyscus, a New-World species.  However, high dose males and females had larger spleens consistent with the hemolytic effects previously reported for mammals exposed to TNT.  Further, males exposed at all levels had reduced phagocytic activity of splenocytes, and reduced hydrogen peroxide production associated with the two highest doses relative to controls.  Females showed no response relative to treatment.  This research has shown the feasibility for these types of investigations, and provides toxicity information valuable for modeling estimates of ecological risk.  Further, the in situ exposures have provided media concentrations that are or are not toxic for species of concern.  This type of information reduces the uncertainty associated with ingestion modeling estimates, dermal exposure estimates, and other factors not traditionally considered in toxicity studies.",
  "description_provenance": [
    "Author Email: Mark.Johnson@apg.amedd.army.mil",
    "Advisor Email: drbob@vt.edu",
    "Advisor Email: stsmith7.vt.edu",
    "Advisor Email: Wilfred_McCain@chppm-ccmail.apgea.army.mil",
    "Advisor Email: holladay@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:42Z (GMT). No. of bitstreams: 1 dissertation4.pdf: 1140533 bytes, checksum: c79f755bec549bebc01f3c9fb2906ded (MD5)   Previous issue date: 1998-12-08"
  ],
  "handle": "25987",
  "identifier_other": "etd-011199-140153",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-011199-140153/",
  "identifier_uri": "http://hdl.handle.net/10919/25987",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation4.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "dermal",
    "exposure",
    "non-specific immunity",
    "TNT",
    "Ambystoma",
    "Amphibians",
    "Peromyscus",
    "skin"
  ],
  "title": "Development and Application of Non-Traditional Vertebrate Models to Investigate Terrestrial Ecological Risk to 2,46-Trinitrotoluene Exposure",
  "type": "Dissertation"
}