{
  "contributor_author": "Xiao, Xunjun",
  "contributor_committeechair": "Webb, Kenneth E. Jr.",
  "contributor_committeemember": [
    "McElroy, Audrey P.",
    "Jiang, Honglin",
    "Wong, Eric A.",
    "Harper, Allen F."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:06:41Z",
  "date_adate": "2006-02-08",
  "date_available": "2014-03-14T20:06:41Z",
  "date_issued": "2005-12-14",
  "date_rdate": "2006-02-08",
  "date_sdate": "2006-01-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objective of this study was to evaluate developmental regulation of the expression of nutrient transporter and brushborder hydrolase genes in the small intestine of piglets. Seventy piglets from seven sows were killed at birth (d 0), during suckling (d 1, 3, 7, 14, 21) and postweaning (d 22, 24, 28, 35), and intestinal segments (duodenum, jejunum and ileum) were collected. The mRNA abundance was determined by Northern blot using specific cDNA probes for three disaccharidases (lactase-phlorizin hydrolase, LPH, sucrase-isomaltase, SI, and maltase-glucoamylase, MGA), three peptide hydrolases (aminopeptidase A, APA, aminopeptidase N, APN, and dipeptidyl peptidase IV, DPP IV), two sugar transporters (Na+-dependent glucose transporter 1, SGLT1, and facilitated glucose transporter 5, GLUT5), a peptide transporter (H+-dependent peptide transporter 1, PepT1), four amino acid transporters (excitatory amino acid carrier 1, EAAC1, Na+-dependent neutral amino acid transporter, ATB0, the light chain of a heterodimeric transport system b0,+ involved in the heteroexchange of cationic and neutral amino acids, b0,+AT, and Na+-independent large branched and aromatic neutral amino acid transporter 2, LAT2), and two iron transporters (divalent metal ion transporter 1, DMT1, and iron-regulated transporter 1, IREG1). Protein expression was quantified by Western blot using specific antibodies for LPH, SI, SGLT1, and PepT1. During suckling, the abundance of LPH, APA, APN, DPP IV, b0,+AT mRNA increased quadratically (P < 0.001) with age from birth to d 7 or 14 then remained unchanged or slightly declined with age to d 21. The mRNA abundance of SI increased and LAT2 decreased linearly (P < 0.001) with age, and the abundance of MGA and GLUT5 mRNA remained unchanged with age. There was an age x intestinal segment interaction (P < 0.001) for the abundance of EAAC1 and ATB0 mRNA. The abundance of EAAC1 mRNA increased from d 0 through 14 and remained stable to d 21 in the ileum, and it was low and slightly increased with age through d 21 in the duodenum and jejunum. The abundance of ATB0 mRNA generally increased from d 0 to 21 in the duodenum and ileum, and increased from d 0 to 7 and then decreased to d 21 in the jejunum. The abundance of SGLT1 and PepT1 mRNA was substantial at birth and transiently declined to d 1. The abundance of SGLT1 mRNA generally increased from d 1 to 21, and PepT1 mRNA abundance increased to d 3 and then plateaued through d 21. Postweaning, the mRNA abundance of all of these carbohydrate and protein assimilation related genes increased during the first day (3 d for ATB0) after weaning then declined to the levels at weaning in the jejunum and ileum, followed by a subsequent change pattern that varied among genes. During suckling, the mRNA abundance of LPH, SGLT1, and APA was greater in the duodenum and jejunum than the ileum (P < 0.001). The PepT1 and APN mRNA was evenly distributed among intestinal segments, and the expression of MGA, DPP IV, EAAC1, b0,+AT, ATB0, and LAT2 mRNA was generally greater in the jejunum and ileum than the duodenum or greatest in the ileum. Postweaning, the mRNA abundance of all of these carbohydrate and protein assimilation related genes examined was generally greater in the jejunum and ileum than the duodenum or highest in the ileum. From d 0 through 35, DMT1 and IREG1 mRNA was predominantly (P < 0.05) distributed in the duodenum, where the abundance of DMT1 and IREG1 mRNA increased with age during suckling, and then rapidly decreased after weaning. The protein expression of LPH and SI exhibited a similar developmental pattern as that for the mRNA abundance. Unlike the developmental regulation of their respective mRNA abundance, the protein expression of SGLT1 exhibited a general decline from suckling to postweaning. The protein expression of PepT1 gradually decreased with age from birth to d 35 in the duodenum, and initially declined from birth to the lowest value then slightly increased with age through d 21, followed by an increase to d 35 in the jejunum and ileum. In conclusion, the gene expression of these brushborder hydrolases and nutrient transporters was not only differentially regulated by age but also differentially distributed along the small intestine of piglets at early stages of life. These differences in ontogenetic regulation and the distribution may be related to the luminal substrate concentration as well as the nutrient categories, and the developmental regulation of these genes may occur not only at the transcriptional level but also at the posttranscriptional level.",
  "description_provenance": [
    "Author Email: xxiao@vt.edu",
    "Advisor Email: amcelroy@vt.edu",
    "Advisor Email: hojiang@vt.edu",
    "Advisor Email: webbk@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: alharper@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:41Z (GMT). No. of bitstreams: 1 XunjunXiaoDissertationRevised.pdf: 1073713 bytes, checksum: 3f20aab3492521f8e542c47903509015 (MD5)   Previous issue date: 2005-12-14"
  ],
  "handle": "25982",
  "identifier_other": "etd-01102006-110729",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01102006-110729/",
  "identifier_uri": "http://hdl.handle.net/10919/25982",
  "publisher": "Virginia Tech",
  "relation_haspart": "XunjunXiaoDissertationRevised.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "small intestine",
    "pig",
    "developmental regulation",
    "hydrolase",
    "transporter"
  ],
  "title": "Developmental Regulation of the Expression of Nutrient Transporter and BrushBorder Membrane Hydrolase Genes in the Small Intestine of Piglets",
  "type": "Dissertation"
}