{
  "contributor_author": "Stables, Gloria J.",
  "contributor_committeechair": "Wiswell, Albert W.",
  "contributor_committeemember": [
    "Huebner, Angela J.",
    "Cline, Marvin Gerald",
    "Hertzler, Ann A.",
    "Storey, Maureen"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:06:41Z",
  "date_adate": "2002-01-11",
  "date_available": "2014-03-14T20:06:41Z",
  "date_issued": "2001-12-12",
  "date_rdate": "2003-01-11",
  "date_sdate": "2002-01-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Demographic, Psychosocial, and Educational Factors Related to Fruit and Vegetable Consumption in Adults <p>Gloria J.  Stables <p>(ABSTRACT) <p>Recent global statistics estimate 20% of all cancer incidence could be prevented if Americans would modify their eating habits to increase fruit and vegetable intake to the minimum recommended level of five servings daily.  Educational strategies to change eating behavior would benefit from a greater understanding of psychosocial and demographic factors related dietary behavior.   <p>Secondary analysis of a nationally representative survey of 2655 adults was completed to assess differences between low-income and high-income adults in psychosocial, demographic, and educational factors related to fruit and vegetable intake.  Significant differences in self-efficacy, awareness/knowledge, and cost and availability of fruits and vegetables were found between the low-income and high-income groups.  In the low-income group, 37% of the variance in total fruit and vegetable consumption was explained by psychosocial and demographic factors, with demographics, self-efficacy and awareness/knowledge being the most significant predictors.  In the high-income group, 34% of the variance in total fruit and vegetable consumption was explained by psychosocial and demographic factors, with self-efficacy alone accounting for 14% of the variance. <p>This research suggests that, regardless of income category, social cognitive factors, in particular self-efficacy and knowledge/awareness of the health message, are stronger predictors of fruit and vegetable consumption than are perceived barrier factors.  Given the weaknesses of the survey instrument, the findings need to interpreted with caution.  Policy inferences can be suggested from this research, but would need further research findings before implementation of nutrition policy recommendations. <p>The implications of these research findings are that nutrition education interventions to increase fruit and vegetable consumption should be aimed at affecting those psychosocial factors that are predictive of behavior change.  In particular, differences by income level between psychosocial, education, and behavior responses underscore the need for tailoring educational interventions by income group for greater impact. <p>The most relevant psychosocial predictors of fruit and vegetable consumption in adults are self-efficacy, awareness/knowledge of the health message, social support, and weak intent.  The most relevant demographic predictors were smoking status, educational level, and age.  Income level appears to share variance with other demographic variables and should be explored in further research.",
  "description_provenance": [
    "Author Email: gloria_stables@nih.gov",
    "Advisor Email: awiswell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:41Z (GMT). No. of bitstreams: 3 backmatter.pdf: 487466 bytes, checksum: a5a8362f6e14270547b62f7ae731dcb0 (MD5) bodymatter.pdf: 284808 bytes, checksum: 8aa12e81436b58c4ec0ff324dbefc7bc (MD5) frontmatter.pdf: 113210 bytes, checksum: 03fba19e9b8a174094062e3122b952ff (MD5)   Previous issue date: 2001-12-12"
  ],
  "handle": "25980",
  "identifier_other": "etd-01102002-165320",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01102002-165320/",
  "identifier_uri": "http://hdl.handle.net/10919/25980",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "backmatter.pdf",
    "bodymatter.pdf",
    "frontmatter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Nutrition Education",
    "Self-Efficacy",
    "Psychosocial Factors",
    "Dietary Behavior"
  ],
  "title": "Demographic, Psychosocial, and Educational Factors Related to Fruit and Vegetable Consumption in Adults",
  "type": "Dissertation"
}