{
  "contributor_author": "Zhao, Song",
  "contributor_committeechair": "Etzkorn, Felicia A.",
  "contributor_committeemember": [
    "Taylor, Larry T.",
    "Kingston, David G. I.",
    "Castagnoli, Neal  Jr.",
    "Carlier, Paul R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:06:42Z",
  "date_adate": "2008-01-18",
  "date_available": "2014-03-14T20:06:42Z",
  "date_issued": "2007-12-17",
  "date_rdate": "2008-01-18",
  "date_sdate": "2008-01-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The phosphorylation-dependent PPIase (peptidyl prolyl isomerase), Pin1 (Protein interacting with NIMA#1), has been found to regulate cell cycle through a simple conformational change, the cis-trans isomerization of phospho-Ser/Thr-Pro amide bonds. A variety of key cell cycle regulatory phosphoproteins, including Cdc25 phosphatase,Cdc27, p53 oncogene, c-Myc oncogene, Wee1 kinase, Myt1 kinase, and NIMA kinas, have been confirmed as substrates of Pin1. Pin1 was also observed to be overexpressed in a variety of cancer cell lines, and the inhibitors of Pin1 showed antiproliferative activities towards these cancer cells. These results implied that Pin1 might serve as a potential anti-cancer drug target. Besides, Pin1 has an important neuroprotective function and represents a potential new therapeutic agent for Alzheimerâ  s disease.     In order to understand the interaction between Pin1 and Cdc25c and the role of Pin1 in the mechanism for the regulation of mitosis, two amide isosteres, Ser-Î¨[(Z)CH=C]-Pro-OH and Ser-Î¨[(E)CH=C]-Pro-OH were incorporated into two peptidomimetics derived from human Cdc25c. Phosphorylation of these two peptidomimetics by the incubation with Cdc2 was studied using LC-MS/MS technique. It was found that Cdc2 kinase was conformationally specific to its Cdc25c substrate. Only the trans conformer of Cdc25c at its Ser168-Pro position can be recognized and phosphorylated by Cdc2 kinase, thereby creating the binding site for Pin1.    In an effort to improve the cell permeability of the charged inhibitors of Pin1, bisPOM (pivaloyloxymethyl) prodrug moiety was introduced to mask the phosphate group of Fmoc-pSer-Î¨[(Z)CH=C]-Pro-(2)-N-(3)-ethylaminoindole, which is one inhibitor of Pin1. Fmoc-pSer-Î¨[(Z)CH=C]-Pro-(2)-N-(3)-ethylaminoindole and its bisPOM prodrug were synthesized efficiently starting with Boc-Ser-Î¨[(Z)CH=C]-Pro-OH in 24% and 12% yields respectively. The charged inhibitor showed a moderate inhibition towards Pin1 (IC50 = 28.3 Î¼M). Its antiproliferative activity towards A2780 ovarian cancer cells (IC50 = 46.2 Î¼M) was significantly improved by its bisPOM prodrug (IC50 = 26.9 Î¼M), which is comparable to the IC50 of the charged inhibitor towards Pin1 enzymatic activity. These results not only established the bisPOM strategy as an efficient prodrug choice for Pin1 inhibitors, but also added additional evidence for Pin1 as a potential anticancer drug target.",
  "description_provenance": [
    "Author Email: sozhao@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: ncastagn@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Advisor Email: fetzkorn@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:42Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 2677840 bytes, checksum: 33e3c90360bf6f643280d27f68fd45ea (MD5)   Previous issue date: 2007-12-17"
  ],
  "handle": "25989",
  "identifier_other": "etd-01122008-105708",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01122008-105708/",
  "identifier_uri": "http://hdl.handle.net/10919/25989",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "peptidomimetics",
    "cell cycle",
    "Cdc2",
    "conformation",
    "Cdc25",
    "Ser-trans-Pro",
    "Ser-cis-Pro",
    "Pin1",
    "isosteres",
    "LC-MS/MS",
    "assay",
    "inhibition",
    "kinase",
    "phosphorylation"
  ],
  "title": "Part 1 Design, Synthesis and Bioactivity of a Phosphorylated Prodrug for the Inhibition of Pin1; Part 2 Conformational Specificity of Cdc25c Substrate for Cdc2 Kinase using LC-MS/MS",
  "type": "Dissertation"
}