{
  "contributor_author": "Olsen, Brian J",
  "contributor_committeechair": "Walters, Jeffrey R.",
  "contributor_committeemember": [
    "Phillips, John B.",
    "Parkhurst, James A.",
    "Kelly, Marcella J.",
    "Greenberg, Russell S."
  ],
  "contributor_department": "Biological Sciences",
  "date_accessioned": "2014-03-14T20:06:42Z",
  "date_adate": "2007-01-26",
  "date_available": "2014-03-14T20:06:42Z",
  "date_issued": "2007-01-05",
  "date_rdate": "2007-01-26",
  "date_sdate": "2007-01-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Adaptation to local environments via natural selection is a powerful mechanism for population divergence and likely one of the primary causes of speciation.  To understand how specific habitats shape local adaptation, it is helpful to study closely-related populations from widely differing ecosystems that have not had sufficient time to diverge by genetic drift.  Throughout the following chapters I examine the distribution of morphological, behavioral, and reproductive phenotypes within and between two subspecies of the swamp sparrow.  These two populations, the tidal salt marsh endemic Melospiza georgiana nigrescens and the nominant inland subspecies, M. g. georgiana were incompletely isolated from each other following the retreat of the Wisconsin glaciation.  Since that time the increased nest predation, temperature, season length, salinity and tidal flow of the coastal marshes relative to inland wetlands has resulted in a number of adaptations among coastal sparrows due to natural selection, sexual selection, and phenotypic plasticity.  Specifically I examine the habitat preferences of the coastal plain swamp sparrow, the difference in clutch size between the two subspecies, the rates of extrapair fertilization relative to male quality, the ecosystem-specific interactions between natural and sexual selection on plumage badges, and the role of conspecific attraction in nest placement.  The environmental differences of the tidal salt marsh have played strong roles in the local adaptation and divergence of coastal plain swamp sparrows from their freshwater ancestors.  Many of these divergent mechanisms may be similar among other tidal marsh endemics, although some (especially those related to sexual selection) may be specific to the swamp sparrow.  In general, however, we see that the added environmental challenges of tidal ecosystems strongly alter selection regimes on a terrestrial vertebrate inhabiting this dynamic ecotone.  The swamp sparrow system can further increase our understanding of how the interplay between environmental resources, sexual selection, and natural selection affects the local adaptations leading to evolutionary divergence.",
  "description_provenance": [
    "Author Email: olsen@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: jphillip@vt.edu",
    "Advisor Email: jparkhur@vt.edu",
    "Advisor Email: makelly2@vt.edu",
    "Advisor Email: greenbergr@si.edu",
    "Made available in DSpace on 2014-03-14T20:06:42Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 1218199 bytes, checksum: 712443d2bac436837a11e32b00e06ed0 (MD5)   Previous issue date: 2007-01-05"
  ],
  "handle": "25985",
  "identifier_other": "etd-01112007-154140",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01112007-154140/",
  "identifier_uri": "http://hdl.handle.net/10919/25985",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Melospiza georgiana",
    "optimal habitat",
    "clutch size",
    "extrapair fertilization",
    "sexual selection",
    "conspecific attraction"
  ],
  "title": "Life History Divergence & Tidal Salt Marsh Adaptations of the Coastal Plain Swamp Sparrow",
  "type": "Dissertation"
}