{
  "contributor_author": "Crockett, Aleta Jo",
  "contributor_committeechair": "Kelly, Patricia Proudfoot",
  "contributor_committeemember": [
    "Graham, Joyce L.",
    "Driscoll, Lisa G.",
    "Carico, Kathleen M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:06:43Z",
  "date_adate": "1999-01-12",
  "date_available": "2014-03-14T20:06:43Z",
  "date_issued": "1998-12-16",
  "date_rdate": "2000-01-12",
  "date_sdate": "1999-01-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This study explores aspects of  the theoretical basis of Louise M. Rosenblatt's transactional theory of reading and its focus on the reader's efferent and aesthetic stances during transaction with nonfiction and fiction.  The study explores the following questions:<br> Does genre (nonfiction or fiction) influence the reader's response to a literarytext?<br> Does a reader's process of reading change during a nonfictional reading compared to a fictional one?<br> Are there certain factors that persuade a reader to view a nonfictional piece of writing differently than a fictional one?<br> To examine these questions and to ensure the validity of the study, I wrote a story titled \"The Exit\" and presented the writing to three freshman English classes, first as nonfiction and then during the next class period as fiction. I chose to follow Rosenblatt's  class procedure: an initial reading with free responses, an interchange of ideas, and then a rereading of the same text.  For research purposes I needed bulk written and verbal responses to compare and contrast.  This three-day immersion in nonfiction and fiction reflections produced sufficient data to analyze: (1) written free responses from the initial reading of the text as nonfiction; (2) recorded audio tapes of their small groups, responding to five inquiry questions regarding the nonfiction text; (3) written individual take-home responses to the same five inquiry questions; (4) written free responses from the second reading of the text as fiction; (5) recorded audio tapes of the small group discussions on their nonfiction and fiction responses; and (6) recorded audio tapes of the entire class reflections on the responses to reading the story as both nonfiction and fiction.  During this expedition I kept a journal of each day's events so that as my students and I experienced this exploration together,  I could capture what we all were feeling and thinking as it was actually happening.<br> Although the students were unaware of genre influence until the third-day class reflection, there were distinct differences in student responses to nonfiction and fiction.  These students predominately read nonfiction aesthetically and fiction efferently.  In this study with these students,  genre did influence the reader's response; the reader's process of reading did change during the nonfictional reading compared to a fictional one; and there were certain factors which persuaded the reader to view the nonfictional piece of writing differently than the fictional one.  The contrast and comparison of the students' responses to nonfiction and fiction are shown in a detailed Venn diagram.<br>      In addition, I have included an extensive essay titled \"The Transactional Dance: Louise Rosenblatt's Presence in the History of Literary Criticism.\"  Her transactional theory of reading transcends time and continues to invite research.<br>",
  "description_provenance": [
    "Author Email: acrockett@inetone.net",
    "Advisor Email: jlgraham@runet.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: kcarico@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:43Z (GMT). No. of bitstreams: 1 dissertation.pdf: 4649287 bytes, checksum: 7f46d95e63ad109e545a639ddb839208 (MD5)   Previous issue date: 1998-12-16"
  ],
  "handle": "25990",
  "identifier_other": "etd-011299-134351",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-011299-134351/",
  "identifier_uri": "http://hdl.handle.net/10919/25990",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "fiction",
    "reading stances",
    "literary criticism",
    "Louise M. Rosenblatt",
    "nonfiction",
    "reader response"
  ],
  "title": "Nonfiction and Fiction:  Does Genre Influence Reader Response?",
  "type": "Dissertation"
}