{
  "contributor_author": "Bond, Helen",
  "contributor_committeechair": "Wiswell, Albert K.",
  "contributor_committeemember": [
    "Cline, Marvin Gerald",
    "Morris, Linda E.",
    "Boucouvalas, Marcie",
    "Owusu-Ansah, David"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:06:44Z",
  "date_adate": "2002-01-21",
  "date_available": "2014-03-14T20:06:44Z",
  "date_issued": "2001-12-13",
  "date_rdate": "2003-01-21",
  "date_sdate": "2002-01-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Teaching for Freedom: A Case in Ghana \t\t                    Helen Bond                      ABSTRACT      The United Nations declared the years 1995 to 2004 as the Decade for Human Rights Education. The principles of human rights education promote dignity, tolerance, and peace by educating individuals and groups to respect, defend, and advocate for their rights. These rights are enshrined in the Universal Declaration of Human Rights, which was adopted in 1948 making human rights a global responsibility. During this decade nations are called upon to promote and implement human rights education in all sectors of their society.      In 1992 Amnesty International Norway developed a human rights education program called Teaching for Freedom (TFF). This program was implemented in 26 countries worldwide including all ten administrative regions in Ghana, West Africa. The purposes of the TFF program were to educate the youth and train final year teachers in the principles of human rights. These programs are based on the notion of universal human rights that are sometimes criticized as Western and non-applicable to the African context. Human rights education programs are tasked with not only making these universal principles meaningful and participatory in the lives of the people on the ground, but also implementing culturally legitimate programs in local contexts with few resources. This study attempted to understand how the Teaching for Freedom program accomplished these aims and the barriers that impeded it.        Using qualitative analysis and the grounded theory approach, I conducted a case study of one TFF program located in one school in one region of Ghana. This human rights education program operated as a club and was studied within the context of the school and society in which it operated. Grounded theory analysis revealed that the TFF club was a conflicted organization whose operation was greatly shaped by forces within the school that were also present in larger society. I describe the operation of the club in terms of awareness, empowerment, and implementation. Barriers to the operation of the TFF club were identified within these three areas of operation and were closely related to the conflicting cultural forces within the school and Ghanaian society",
  "description_provenance": [
    "Author Email: hpeters@intrepid.net",
    "Advisor Email: wiswell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:44Z (GMT). No. of bitstreams: 6 BondDiss.pdf: 649674 bytes, checksum: e29ad4b5bc191418bd2fb059e13d01ab (MD5) Form1sWorking.pdf: 4235910 bytes, checksum: f5c6c0cde635956e76bb41dc015b6a8e (MD5) TFFClub.pdf: 4249201 bytes, checksum: 74da01ae79143ee6acf5752d1b380e66 (MD5) DormsSecTech.pdf: 652706 bytes, checksum: b4c8eb36f513f21ebbd097998be275cd (MD5) SchoolAssembly.pdf: 3986937 bytes, checksum: 98a29b958a5440144f7b9b771e4c5f5d (MD5) StudentsinClass.pdf: 4543933 bytes, checksum: 728336e6280165db44ae995c4f67e7eb (MD5)   Previous issue date: 2001-12-13"
  ],
  "handle": "25996",
  "identifier_other": "etd-01142002-222738",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01142002-222738/",
  "identifier_uri": "http://hdl.handle.net/10919/25996",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "BondDiss.pdf",
    "Form1sWorking.pdf",
    "TFFClub.pdf",
    "DormsSecTech.pdf",
    "SchoolAssembly.pdf",
    "StudentsinClass.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Ghana",
    "Africa",
    "Human Rights"
  ],
  "title": "Teaching for Freedom: A Case in Ghana",
  "type": "Dissertation"
}