{
  "contributor_author": "Sul, Hoon-Ku",
  "contributor_committeechair": "Khan, Mahmood A.",
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:06:43Z",
  "date_adate": "2002-01-14",
  "date_available": "2014-03-14T20:06:43Z",
  "date_issued": "2001-12-13",
  "date_rdate": "2003-01-14",
  "date_sdate": "2002-01-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The primary purpose of this study was to explore a model that examines the relationships among the external environment, entrepreneurial strategy, mechanistic-organic structure and financial performance of restaurant franchisors from the perspective of franchisees. The final structural model indicated that restaurant franchisees perceive that franchisorsâ   entrepreneurial strategy makes a highly positive contribution to franchisorsâ   financial performance. The external environment is perceived to have a negative impact on franchisorâ  s financial performance. Franchisees also perceived that franchisorâ  s entrepreneurial strategy and mechanistic-organic structure could have a significantly and mutually positive impact on each other. The basic value of understanding entrepreneurial strategy is the prediction of certain financial outcomes. Entrepreneurial strategy proved to have a very significant impact on the franchisorâ  s financial performance from the perspective of restaurant franchisees. However, franchisorsâ   entrepreneurial strategy was not always perceived to guarantee financial success because of the negative impact of the external environment in the restaurant franchising industry on financial performance. Furthermore, restaurant franchisees perceived the franchisorâ  s external environment in the industry was unlikely to contribute to the franchisorâ  s entrepreneurial strategy or mechanistic-organic structure. Restaurant franchisees viewed that a high level of franchisorsâ   entrepreneurial strategy had a mutual relationship with their organic structure. It is significant in their perception that their free-flowing relationship, authority, and communication involvement in the franchisorâ  s decision-making process establish high levels of franchisorsâ   entrepreneurial strategy. However, franchisorsâ   mechanistic-organic structure is not necessarily perceived to influence franchisorsâ   financial performance positively. The indirect effect of mechanistic-organic structure on financial performance through entrepreneurial strategy was not perceived to be significant.   Restaurant franchisees perceive that franchisorsâ   entrepreneurial strategy is driven by mechanistic-organic structure in the franchising system, not by external environmental change in the industry. It is very understandable for franchisees to perceive this way, because franchisees constantly provide franchisors with local environmental information through franchising communication and relationship channels. Restaurant franchisees compete with other restaurants in many local markets, so that they are knowledgeable about significant changes in the local environment. Restaurant franchisees might perceive that the local environment is a more critical issue to franchisorsâ   entrepreneurial strategy than is the general external environment in the industry. Thus, they might not think of the external environment in the industry as important enough to have an influence on entrepreneurial strategy and mechanistic-organic structure, except on franchisorsâ   financial performance.",
  "description_provenance": [
    "Author Email: hsul@vt.edu",
    "Advisor Email: mahmood@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:43Z (GMT). No. of bitstreams: 2 Str_etd.pdf: 2703411 bytes, checksum: a1555b0be896f9aed6841392b795ea99 (MD5) ETD_Cover.pdf: 147401 bytes, checksum: ab31f72bfee1911d05b614b570383f7b (MD5)   Previous issue date: 2001-12-13"
  ],
  "handle": "25995",
  "identifier_other": "etd-01142002-151314",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01142002-151314/",
  "identifier_uri": "http://hdl.handle.net/10919/25995",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Str_etd.pdf",
    "ETD_Cover.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "External Environment",
    "Entrepreneurial Strategy",
    "Mechanistic-organic Structure",
    "Fianancial Performance",
    "Restaurant Franchising"
  ],
  "title": "An Exploratory Model of the Relationships among the External Environment, Entrepreneurial Strategy, Mechanistic-organic Structure, and Financial Performance of Restaurant Franchisors from the Perspective of Franchisees",
  "type": "Dissertation"
}