{
  "contributor_author": "Zuo, Tianming",
  "contributor_committeechair": "Dorn, Harry C.",
  "contributor_committeemember": [
    "Taylor, Larry T.",
    "Esker, Alan R.",
    "Troya, Diego",
    "Heflin, James R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:06:43Z",
  "date_adate": "2008-01-23",
  "date_available": "2014-03-14T20:06:43Z",
  "date_issued": "2008-01-09",
  "date_rdate": "2009-01-23",
  "date_sdate": "2008-01-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Synthesis, Isolation, and Characterization of Tb-based Large Cage TNT-EMFs  and Dimetallic Endohedral Metalloazafullerenes  Tianming Zuo  ABSTRACT A family of novel large cage Tb-based TNT-EMFs Tb3N@C2n (40 â ¤ n â ¤ 44), and a family of novel dimetallic endohedral metalloazafullerenes with the molecular formula of M2@C79N (M=Y, Tb, and La), were for the first time systematically synthesized, isolated, and structurally characterized. The protocol developed in this thesis provides an effective and systematic method for the synthesis, purification, and characterization of TNT-EMFs and other novel EMFs.  Structural information about this family of Tb-based TNT-EMFs strongly supports the TNT formation mechanism of TNT-EMFs. It also demonstrates for the first time that EMFs do not necessarily choose an IPR-obeying cage even if the IPR cages are available. At room temperature and in a non-polar organic solvent, the fluorescence of the hydrogenated product of Tb3N@C80 was for the first time successfully obtained based on the proposed idea:  de-shielding the screen effect of the fullerene cage on the metal ions or clusters inside the fullerene cage.  The structural characterization of Tb2@C79N using single crystal X-ray diffraction crystallography demonstrated that the fullerene cage of M2@C79N is an Ih eighty-atom cage. The presence of the N atom in the molecule was further confirmed by mass spectra of the 15N labeled samples. ESR data demonstrated that there is a single-electron bond between the two Y atoms in Y2@C79N molecules. Theoretical calculations showed for the first time that the single-electron bond is low-lying at the HOMO -2 orbital and thereby resulting in a large HOMO-LUMO gap. It is, in fact, this large HOMO-LUMO gap and the low-lying single-electron orbital (hidden at HOMO-2) that are jointly responsible for the stability of M2@C79N. The single-electron bonds are the longest metal-metal bond reported so far. The chromatographic retention behavior of TNT-EMFs was also systematically studied on 5PBB and 5PYE columns. Both experimental and theoretical data demonstrated that the 5PBB column is sensitive to a fullereneâ  s predicted cage size but indifferent to its cage symmetry, while the 5PYE column is more sensitive to the density and distribution of Ï  electrons in a fullerene cage. Therefore, the 5PYE column is more suitable for separating structural isomers. The combination of the 5PBB column in the first stage and the 5PYE column in the second provides a highly effective way for isolating specific isomers.",
  "description_provenance": [
    "Author Email: tianming@vt.edu",
    "Advisor Email: hdorn@vt.edy",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: troya@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:43Z (GMT). No. of bitstreams: 1 combined-copy-1.pdf: 4644771 bytes, checksum: 4b5b06a2c28ff3272420fd0488ade6fb (MD5)   Previous issue date: 2008-01-09"
  ],
  "handle": "25993",
  "identifier_other": "etd-01132008-111058",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01132008-111058/",
  "identifier_uri": "http://hdl.handle.net/10919/25993",
  "publisher": "Virginia Tech",
  "relation_haspart": "combined-copy-1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Retention behavior and mechanism",
    "Dimetallic endohedral metalloazafullerenes",
    "Tb-based large cage TNT-EMFs"
  ],
  "title": "Synthesis, Isolation, and Characterization of Tb-based Large Cage TNT-EMFs  and Dimetallic Endohedral Metalloazafullerenes",
  "type": "Dissertation"
}