{
  "contributor_author": "Fiegland, Larry Richard",
  "contributor_committeechair": "Morris, John R.",
  "contributor_committeemember": [
    "Crawford, Daniel T.",
    "Esker, Alan R.",
    "McGrath, James E.",
    "Tissue, Brian M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:06:44Z",
  "date_adate": "2008-01-25",
  "date_available": "2014-03-14T20:06:44Z",
  "date_issued": "2008-01-04",
  "date_rdate": "2008-01-25",
  "date_sdate": "2008-01-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Constructing a detailed understanding of the heterogeneous oxidation of atmospheric organic aerosols, both from a mechanistic and kinetic perspective, will enable researchers to predict the fate and lifetime of atmospheric gases and the particles with which they interact.  In an effort to develop a more complete understanding of the interfacial reactions of ozone with vinyl-containing organic thin films, self-assembled monolayers that contain vinyl groups positioned precisely at the gas/surface interface were synthesized as model systems for atmospheric organic aerosols.  To isolate the reactions of background gases with ozone or surface products, an ultrahigh vacuum surface analysis instrument was designed and constructed to explore the reactions of ozone with the atmospheric model systems.  The surface reactions can be monitored in real-time with reflection absorption infrared spectroscopy (RAIRS) and mass spectrometry.  The chemical identity of adsorbates on a surface can also be determined before or after a reaction with X-ray photoelectron spectroscopy (XPS).  Disordering of the monolayers concurrent with the disappearance of the vinyl group was observed with RAIRS.  New bands within the RAIR spectra were observed and assigned to carbonyl or carboxylic acids bound to the surface.  Little oxidation of the sulfur head groups and no significant loss of carbon during the reaction was observed with XPS.  A mechanism is proposed that includes the cross linking of the hydrocarbon chains within the monolayer, which impedes further oxidation of the sulfur head group and limits desorption of the chains.  By RAIRS, the kinetics of the oxidation of the vinyl groups were tracked and an observed rate constant was determined by monitoring the changes in IR absorbance of the C=C bond.  With the aid of the rate constant, an initial reaction probability for the collisions of ozone with vinyl groups positioned precisely at an interface was determined.  The reaction probability is approximately three orders of magnitude greater than the reaction probability for an analogous gas-phase reaction, which demonstrates that the gas/surface interface plays an important role in this reaction.  The results presented in this thesis should help develop a more detailed understanding of the interfacial reactions of pure ozone at surfaces.",
  "description_provenance": [
    "Author Email: lfieglan@vt.edu",
    "Advisor Email: crawdad@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: tissue@vt.edu",
    "Advisor Email: jrmorris@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:44Z (GMT). No. of bitstreams: 1 Fiegland_ETD.pdf: 2505819 bytes, checksum: 1cd6140b6e401a946de542085d1ad0b1 (MD5)   Previous issue date: 2008-01-04"
  ],
  "handle": "25998",
  "identifier_other": "etd-01142008-153114",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01142008-153114/",
  "identifier_uri": "http://hdl.handle.net/10919/25998",
  "publisher": "Virginia Tech",
  "relation_haspart": "Fiegland_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ozone",
    "ultrahigh vacuum",
    "vinyl-terminated self-assembled monolayers",
    "atmospheric aerosols",
    "ozonolysis"
  ],
  "title": "Ultrahigh Vacuum Studies of the Reaction Mechanisms of Ozone with Saturated and Unsaturated Self-Assembled Monolayers",
  "type": "Dissertation"
}