{
  "contributor_author": "Cail, Tracy",
  "contributor_committeechair": "Hochella, Michael F. Jr.",
  "contributor_committeemember": [
    "Tadanier, Christopher J.",
    "Lower, Steven K.",
    "Schreiber, Madeline E.",
    "Rimstidt, james Donald"
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:06:43Z",
  "date_adate": "2004-01-21",
  "date_available": "2014-03-14T20:06:43Z",
  "date_issued": "2003-12-18",
  "date_rdate": "2005-01-21",
  "date_sdate": "2004-01-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "It is estimated that there are 5x1030 microorganisms on Earth and that approximately 50% live in unconsolidated sediment on the terrestrial subsurface.  Subsurface disturbances caused by the constant search for natural resources and our dependence on groundwater make the abundance and diversity of these organisms a global concern.  It is vital to many environmental fields, including bioremediation, water purification, and contaminant transport, that we understand how microorganisms and other colloidal particles attach to and detach from natural sediments and ultimately how they travel through porous media.  Sticking efficiency (alpha) is a major component of most particle transport theories.  It is defined as the ratio of particles that adhere to a collector surface compared to the total number of particles that collide with that surface.  In this study, the Interaction Force Boundary Layer (IFBL) model was used to determine the sticking efficiencies of inorganic colloidal particles and Enterococcus faecalis cells against a silica glass collector surface.  Sticking efficiencies were derived from intersurface potential energies that were determined from integrated force-distance data measured by Atomic Force Microscopy (AFM).  Force data were measured in buffered aqueous solutions of varying pH and ionic strength to determine the influence of solution chemistry on particle removal from solution.  Zeta-potentials were measured to determine the impact of particle and collector surface charge on force measurements.  The results of this study indicate that alpha is strongly influenced by solution chemistry.  The response of alpha to small changes in solution pH and ionic strength may be several orders of magnitude.  Zeta-potential measurements imply that sticking efficiencies are strongly influenced by the electrical charges on both the particle and collector surfaces.  Zeta-potentials of bacteria did not vary significantly with changing solution pH, but did respond to changing solution ionic strength.    Historically, alpha has been very difficult to predict.  This study is the first to report sticking efficiencies measured using AFM and the first to successfully apply the IFBL model to colloidal particles. Æ nThe incorporation of empirical nanoscale interactions into the measurement of alpha promises to more successfully describe particle adhesion and, thus, particle transport.",
  "description_provenance": [
    "Author Email: tcail@vt.edu",
    "Advisor Email: tadanie@vt.edu",
    "Advisor Email: lower.9@osu.edu",
    "Advisor Email: mschreib@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: hochella@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:43Z (GMT). No. of bitstreams: 1 TCail_dissertation.pdf: 558220 bytes, checksum: 486d1ec12aa48b5640772f918312c289 (MD5)   Previous issue date: 2003-12-18"
  ],
  "handle": "25991",
  "identifier_other": "etd-01132004-143902",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01132004-143902/",
  "identifier_uri": "http://hdl.handle.net/10919/25991",
  "publisher": "Virginia Tech",
  "relation_haspart": "TCail_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "sticking efficiency",
    "AFM",
    "force microscopy",
    "microparticle transport",
    "colloidal transport"
  ],
  "title": "Experimentally Derived Sticking Efficiencies of Microparticles using Atomic Force Microscopy: Toward a Better Understanding of Particle Transport",
  "type": "Dissertation"
}