{
  "contributor_author": "Iroegbu, Henry Godson U.",
  "contributor_committeechair": "Uysal, Muzaffer S.",
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:06:47Z",
  "date_adate": "2002-01-17",
  "date_available": "2014-03-14T20:06:47Z",
  "date_issued": "2001-12-20",
  "date_rdate": "2003-01-17",
  "date_sdate": "2002-01-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "AN EMPIRICAL EXAMINATION OF MULTINATIONAL CORPORATIONSâ   (MNCs)        INTEGRATION OF TOURISM MARKET DEVELOPMENT STRATEGIES (TMDS)  WITH DEVELOPING AFRICAN HOST COUNTRIESâ   NEEDS AND EXPECTATIONS.          by   Henry Iroegbu  Dr. Muzaffer Uysal, Chairman  Hospitality and Tourism Management  \t(ABSTRACT)  This exploratory study examined the different tourism market development strategies that tourism Multinational Corporations (MNCs) implement in their operations in African host countries. It empirically investigated the existence of any relationships between tourism MNCsâ   market development strategies and the â  Needs and Expectations of African host countries.â   Also, it investigated the influences of external environmental factors on tourism MNCsâ   tourism market strategic choice. Its sample population were top management executives of tourism MNCsâ   with operations in the African market. The unit of analysis was the corporation. The sample frame was an exhaustive list of tourism MNCs with operations in the African region. The initial sample size was 106 tourism MNCsâ   executives. Thirty-seven of them responded to a mail in survey questionnaire. Two of the questionnaires were discarded due to numerous missing data. Thus, there were 35 usable questionnaires for data analysis, which is a response rate of 33%. The study results identified relationships between the integration of Multinational Corporationsâ   (MNCs) tourism market development strategies with the needs and expectations of developing African host countries, and their successful performance in those host countries in terms of growth in operations and profitability. It revealed that significant differences exist among the market development strategies on the factors of needs and expectations of African host countries. The significant factors were community participation, local entrepreneurship, and job and national security. Also, the economic development factor was observed to be partially significant. This study also identified free trade economy in the African host countries as a significant factor on the influence of external environment. The framework of this study is embedded in the underlying theories of international strategic management, international business, international development, and needs and expectations. The studyâ  s final conceptual model depicts the significant factors of African host countriesâ   needs and expectations, the tourism market development strategies, an integration of the two concepts and the resultant tourism MNCs successful performance. This research study investigated MNCs in all sectors of the tourism industry. And the findings have shown that for the tourism MNCs to be successful in their African host countries, they should be sensitive to the identified sectors, namely economic development, community participation, local entrepreneurship, and job and national security measures. Also, they should exert more efforts in exploring African free trade economies for their business locations in the region.",
  "description_provenance": [
    "Author Email: hiroegbu@vt.edu",
    "Advisor Email: samil@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:47Z (GMT). No. of bitstreams: 2 ETDVita.pdf: 37980 bytes, checksum: 07afb31d12b6fdf95466c466f50d54d9 (MD5) Dspro3c2.pdf: 1927418 bytes, checksum: 39f6292d2f2363a769046c84d4bb0b6c (MD5)   Previous issue date: 2001-12-20"
  ],
  "handle": "26006",
  "identifier_other": "etd-01172002-130703",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01172002-130703/",
  "identifier_uri": "http://hdl.handle.net/10919/26006",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ETDVita.pdf",
    "Dspro3c2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Strategic Integrations",
    "External Environmental Factors",
    "Needs and Expectations",
    "Multinational Corporations",
    "African Host Countries",
    "Tourism Market Development Strategies"
  ],
  "title": "An Empirical Examination of Multinational Corporations'(MNCs)Integration of Tourism Market Development Strategies(TMDS) With African Host Countries' Needs and Expectations.",
  "type": "Dissertation"
}