{
  "contributor_author": "Anderson, Ryan",
  "contributor_committeecochair": [
    "Hillison, John H.",
    "Stewart, Daisy L."
  ],
  "contributor_committeemember": [
    "Williams, Robert",
    "Burge, Penny L."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:06:46Z",
  "date_adate": "2007-03-20",
  "date_available": "2014-03-14T20:06:46Z",
  "date_issued": "2006-08-10",
  "date_rdate": "2007-03-20",
  "date_sdate": "2007-01-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to analyze outstanding agricultural education teachersâ   attitudes toward mathematics integration. The researcher also determined the outstanding agricultural teachersâ   level of mathematics integration into each course currently taught.  An investigation into the collaboration efforts being made between the agricultural education and mathematics department was also included.  The researcher identified the outstanding teachersâ   perceived needs related to mathematics integration and provided baseline data as the agricultural education instructors in Virginia increase their integration of mathematics.   The researcher utilized an electronic questionnaire completed by 25 outstanding agricultural education teachers and follow-up interviews of the 5 teachers who reported integrating mathematics at the highest level.  The agricultural teachers reported having favorable attitudes towards the integration of mathematics into the agricultural education curriculum. The results of the data analysis indicated that there was a negative relationship between age and percentage of mathematics integration.  All of the agricultural education teachers thought that their efforts to integrate mathematics have helped their students increase their mathematics achievement levels, but they have no concrete evidence.   There were several recommendations for implementation, which included encouraging agricultural education teachers to continue to integrate mathematics and other academic areas.  Textbook manufacturers, state agricultural leaders and state agricultural education curriculum specialists need to continue to develop curriculum and other education materials that emphasize academic integration. Recommendations for research that emerged from the study included investigating the attitudes of agricultural teachers toward the integration of other academic areas and the mathematics teachersâ   attitudes toward mathematics integrated into the agricultural education curriculum.  Another researcher could investigate the studentsâ   attitudes toward receiving academic credits for enrolling in agricultural education courses. There were several implications that rose from this study.  Future research could investigate whether the teachers would increase their rates of mathematic integration if ample materials that integrate mathematics are developed for their use.  The research findings related to the percentage of mathematics integration in each course taught give curriculum specialists insight into the courses in which the agricultural education teachers are struggling to integrate mathematics.  This researcher also identified that these adopters of mathematics integration into agricultural education fell within the implementation stage of the stages of adoption.",
  "description_provenance": [
    "Author Email: randrsn@vt.edu",
    "Advisor Email: hillison@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: Bob_Williams@tamu-commerce.edu",
    "Advisor Email: burge@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:46Z (GMT). No. of bitstreams: 1 RyanGAndersonDissertation.pdf: 717597 bytes, checksum: 661084ea0fabad39167d7dc921261a5e (MD5)   Previous issue date: 2006-08-10"
  ],
  "handle": "26004",
  "identifier_other": "etd-01162007-143229",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01162007-143229/",
  "identifier_uri": "http://hdl.handle.net/10919/26004",
  "publisher": "Virginia Tech",
  "relation_haspart": "RyanGAndersonDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Mathematics Integration",
    "Agricultural Education",
    "Agricultural Education Teachersâ   Needs",
    "Agricultural Education Teachersâ   Attitudes"
  ],
  "title": "Attitudes of Outstanding Virginia Agricultural Education Teachers Toward Mathematics Integration",
  "type": "Dissertation"
}