{
  "contributor_author": "Herdman, Andrew Orr",
  "contributor_committeechair": "Arthur, Jeffrey B.",
  "contributor_committeemember": [
    "Gnyawali, Devi R.",
    "Carlson, Kevin D.",
    "Cobb, Anthony Terry",
    "Lang, James R."
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:06:47Z",
  "date_adate": "2008-01-22",
  "date_available": "2014-03-14T20:06:47Z",
  "date_issued": "2008-01-16",
  "date_rdate": "2009-01-22",
  "date_sdate": "2008-01-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Recent meta-analytic treatments of the Strategic Human Resource Management literature suggest a relationship between the adoption of â  high-commitmentâ   HR practices and organization level performance outcomes (Combs, Lui, Hall & Ketchen, 2006).  However, there is considerable variability in the manner in which the HR system construct is conceptualized and measured (Arthur & Boyles, 2007; Delaney & Huselid, 1996).  Further, relative little attention has been given to how these systems of HR practices operate to influence organizational outcomes (Ostroff & Bowen, 2000).  Drawing on the extant SHRM literature, the present study attempts to lend clarity to these issues by specifying and assessing a number of unique measures of the HR system. Several attitudinal, motivation and behavioral employee outcomes are also identified and assessed as possible mediators between the HR system measures and organizational outcomes.  An integrated model proposing relationships both among these measures and their effects on various organizational outcomes is offered and tested.   Data obtained from 202 hotel locations provided mixed support for the proposed model of relationships.  However, results generally support the relationships between measures of the HR System and important organizational outcomes.  Findings also reinforce the utility of expanding the measurement of the HR system beyond the formally established HR programs, the need to better understand intra-organizational variability in HR systems along functional lines and the challenges and opportunities inherent in multi-respondent designs.  Finally, the failure to demonstrate the mediating role of the specified human capital characteristics in HRâ  s relationship with firm performance presents a continued challenge to future research to effectively model this relationship.",
  "description_provenance": [
    "Author Email: aherdman@vt.edu",
    "Advisor Email: devi@vt.edu",
    "Advisor Email: jearthur@vt.edu",
    "Advisor Email: kevinc@vt.edu",
    "Advisor Email: tcobb@vt.edu",
    "Advisor Email: jrlang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:47Z (GMT). No. of bitstreams: 1 Herdman-Dissertation-ETD2.pdf: 731019 bytes, checksum: 93b928944dcaf816b444b5cf1534ec2a (MD5)   Previous issue date: 2008-01-16"
  ],
  "handle": "26009",
  "identifier_other": "etd-01172008-124835",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01172008-124835/",
  "identifier_uri": "http://hdl.handle.net/10919/26009",
  "publisher": "Virginia Tech",
  "relation_haspart": "Herdman-Dissertation-ETD2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hr system measures",
    "employee attitudes behaviors",
    "hotel performance",
    "strategic human resource management"
  ],
  "title": "Explaining the Relationship Between the HR System and Firm Performance: a Test of the Strategic HRM Framework.",
  "type": "Dissertation"
}