{
  "contributor_author": "Brogan, Kevin J.",
  "contributor_committeechair": "Wolf, James F.",
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "Rees, Joseph V.",
    "Lane, Larry M.",
    "White, Thomas G."
  ],
  "contributor_department": "Public Administration and Policy",
  "date_accessioned": "2014-03-14T20:06:47Z",
  "date_adate": "2006-04-04",
  "date_available": "2014-03-14T20:06:47Z",
  "date_issued": "2006-01-16",
  "date_rdate": "2006-04-04",
  "date_sdate": "2006-01-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Media coverage of Post-World War II military conflicts resulted in a reorganization of war coverage procedures.  The predominant reason for the reorganization is the tension created within the organizational program that constantly sets one subgroup against another.  This study is interested in the tension that caused the transformation of the war coverage effort as it evolved from one war to another.  This dissertation addresses how the different war coverage policies and programs were formed to manage media involvement during war.  It is a descriptive account, identifying characteristics from past wars that caused the military and the media to revamp the war coverage procedures in the hope of addressing the tension inherent in their relationship.  The study focuses on the organizational dimension of the war coverage program within the particular environment that influences the tension.  By exploring the war coverage practices this study determines how the military and media address their relationship during times of war drawing inferences from organizational elements to account for the contentious relationship.  Specifically, this study examines the military-media relational characteristics within Richard Hallâ  s organizational elements.  It juxtaposes the war coverage programs against the elements of organizational structure (power, authority, and conflict), and environment (munificence, complexity and dynamism).  The research focuses on specific techniques and processes that the war coverage programs use to initiate these practices.  In doing so, it examines how certain characteristics influence the military-media relationship.  The research uses a multiple-case study approach to explore war coverage during WW II, the Vietnam War, The Gulf War, and the Iraq War.  The multiple-case study approach compares and contrasts these different war coverage procedures from both military and media perspective.  Media reports, scholarly writings, and other analytical studies for each period provide the data for the research.  The findings of the research are substantiated through interviews, personal journals of war correspondents, and other reports.  The findings identify significant trends and patterns within and across the wars.",
  "description_provenance": [
    "Author Email: kbrogan@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:47Z (GMT). No. of bitstreams: 1 Brogan.pdf: 624011 bytes, checksum: 5f7875963e1f9e06b4e41bd55831b4d6 (MD5)   Previous issue date: 2006-01-16"
  ],
  "handle": "26008",
  "identifier_other": "etd-01172006-145451",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01172006-145451/",
  "identifier_uri": "http://hdl.handle.net/10919/26008",
  "publisher": "Virginia Tech",
  "relation_haspart": "Brogan.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Office of War Information",
    "Embedded Program",
    "System of Voluntary Cooperation",
    "National Media Pool"
  ],
  "title": "Policy and Approach for Addressing the Military â   Media Tension",
  "type": "Dissertation"
}