{
  "contributor_author": "Roth, Elizabeth H.",
  "contributor_committeechair": "Garrison, James W.",
  "contributor_committeemember": [
    "Self, Warren P.",
    "Nespor, Jan K.",
    "Kelly, Patricia Proudfoot",
    "Small, Robert C. Jr."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:06:48Z",
  "date_adate": "2000-04-02",
  "date_available": "2014-03-14T20:06:48Z",
  "date_issued": "1998-12-04",
  "date_rdate": "2000-04-02",
  "date_sdate": "1999-01-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "(ABSTRACT)   This dissertation will trace the emerging paradigm of transaction as a model for the dynamics of the reading process. <p> The paradigm of transaction, implicit in John Dewey's writings as early as 1896 in \"The Reflex Arc Concept in Psychology,\" was originally described in terms of \"interaction\" between organism and environment.  Only in 1949, in the twilight of his career, did Dewey definitively distinguish between \"transaction\" and \"interaction,\" ascribing a mutually transformative character to the former process.  In Knowing and the Known, Dewey and co-author Arthur F. Bentley (1949) proposed adoption of a wholly new \"transactional vocabulary\" as a precision tool for a new mode of scientific inquiry, whereby inquiry itself was recognized as a species of transaction between inquirer and observed phenomena. <p> Even before the publication of Knowing and the Known, literary theorist Louise M. Rosenblatt had applied an implicitly transactional model of the relationship between organism and environment to the relationship between reader and text.  She described this dynamic model of the reading process in Literature as Exploration (first published in 1938), a work that has inspired an ongoing revolution in the teaching of reading and literature at all instructional levels.  In the first edition of this work, Rosenblatt employed Dewey's original term--\"interaction\"--to describe the dynamic relationship between reader and text.  Following the publication of Knowing and the Known in 1949, Rosenblatt began systematically to appropriate Dewey and Bentley's transactional terminology in her analysis of the reader-text relationship. <p> Educators who share the transactional vision of Dewey and Rosenblatt tend to see the role of the teacher as that of a facilitator of reader-text transaction and of reader-reader transaction as arbitrated by the text, rather than as an imparter of authoritative interpretations of texts.  Envisioning potentialities for students' growth through such transactions gives rise neither to sanguine optimism nor to despair, but rather to a hopeful meliorism.",
  "description_provenance": [
    "Author Email: rothl.concord_college@concord.edu",
    "Advisor Email: wesley@vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:48Z (GMT). No. of bitstreams: 1 EHROTH.PDF: 461791 bytes, checksum: 01a90312928288d1959e99d34c318c4d (MD5)   Previous issue date: 1998-12-04"
  ],
  "handle": "26013",
  "identifier_other": "etd-011999-190421",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-011999-190421/",
  "identifier_uri": "http://hdl.handle.net/10919/26013",
  "publisher": "Virginia Tech",
  "relation_haspart": "EHROTH.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "John Dewey",
    "literary theory",
    "teaching of literature",
    "philosophy of education",
    "Louise M. Rosenblatt"
  ],
  "title": "The Emerging Paradigm of Reader-Text Transaction: Contributions of John Dewey and Louise M. Rosenblatt, with Implications for Educators",
  "type": "Dissertation"
}