{
  "contributor_author": "Rosenberger, Amanda Elizabeth",
  "contributor_committeechair": "Angermeier, Paul L.",
  "contributor_committeemember": [
    "Newcomb, Tammy J.",
    "Dolloff, C. Andrew",
    "Hallerman, Eric M.",
    "Smith, Eric P."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:06:48Z",
  "date_adate": "2003-01-27",
  "date_available": "2014-03-14T20:06:48Z",
  "date_issued": "2002-12-19",
  "date_rdate": "2004-01-27",
  "date_sdate": "2003-01-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Roanoke logperch (Percina rex) is a federally endangered large darter that occurs only within the Roanoke and Chowan drainages of Virginia.  This dissertation examines multi-scale habitat use patterns by logperch in three river systems in Virginia, including comparisons among rivers and life stages.   The first study in this dissertation compares microhabitat use patterns of logperch among the Roanoke, Pigg, and Nottoway rivers.  My objectives are to: 1) compare available microhabitat and microhabitat use by logperch among these rivers; and 2) examine the transfer of habitat models among rivers.  Habitat availability in the three rivers indicates that the Nottoway River is least impacted by human activity, while the Pigg River is most impacted.  The Roanoke and Pigg rivers are found within the same region of Virginia and share many habitat characteristics.  Logperch consistently use silt free, loosely embedded gravel in all rivers and can occupy a variety of depths and velocities to accommodate substrate requirements.  Microhabitat models transfer better between the similar Pigg and Roanoke rivers.   The second study in this dissertation compares micro- and meso-habitat use patterns by Roanoke logperch in the Roanoke and Nottoway rivers.  My objectives are to: 1) compare micro- and meso-habitat use patterns of logperch in the Roanoke and Nottoway rivers; and 2) examine transfer of habitat models at both scales.  An increase in scale from micro- to meso- habitat did not improve model transfer.  Habitat selectivity and transfer was strongest at the microhabitat scale.  Logperch appear to be microhabitat substrate specialists and mesohabitat generalists.   The final study in this dissertation examines ontogenetic patterns of habitat use by Roanoke logperch in the Roanoke and Nottoway rivers.  My goals are to: 1) examine habitat use by three age classes of logperch and 2) compare ontogenetic patterns of habitat use between the Roanoke and Nottoway rivers.  In the Roanoke River, adult and subadult logperch primarily used run and riffle habitat, often over gravel substrate.  Subadults were found in lower water velocities and more embedded microhabitats than adults.  Young-of-year logperch were found in shallow, stagnant backwaters and secondary channels.  In the Nottoway River, both adult and subadult logperch were found over sand and gravel in deep, low velocity pools and runs.  Subadults were observed in slightly more silted, lower velocity habitat.  Younger age classes of logperch appear to be more vulnerable to sedimentation caused by human activity.   Evidence in this dissertation strongly indicates that logperch have strict substrate requirements and the distribution of habitat types and pathways of dispersal will be critical for completion of the logperch life cycle. A watershed-level conservation approach that addresses sediment loading and preserves ecological processes that provide ephemeral, seasonal, and persistent types of habitat required over logperch ontogeny will be most effective for management geared towards the recovery of this endangered species.",
  "description_provenance": [
    "Author Email: amrosenb@vt.edu",
    "Advisor Email: biota@vt.edu",
    "Advisor Email: newcombt@michigan.gov",
    "Advisor Email: adoll@vt.edu",
    "Advisor Email: ehallerm@vt.edu",
    "Advisor Email: epsmith@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:48Z (GMT). No. of bitstreams: 1 amandarosenbergerdiss.pdf: 2427098 bytes, checksum: 5f3c4d6c7f739a42446776ce5522e600 (MD5)   Previous issue date: 2002-12-19"
  ],
  "handle": "26015",
  "identifier_other": "etd-01202003-151249",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01202003-151249/",
  "identifier_uri": "http://hdl.handle.net/10919/26015",
  "publisher": "Virginia Tech",
  "relation_haspart": "amandarosenbergerdiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "model transferability",
    "ontogeny",
    "spatial scale",
    "endangered species",
    "habitat use",
    "Percina rex"
  ],
  "title": "Multi-scale patterns of habitat use by Roanoke logperch (Percina rex) in Virginia rivers: a comparison among populations and life stages",
  "type": "Dissertation"
}