{
  "contributor_author": "Liu, Tao",
  "contributor_committeechair": "Etzkorn, Felicia A.",
  "contributor_committeemember": [
    "Kingston, David G. I.",
    "Tanko, James M.",
    "Anderson, Mark R.",
    "Carlier, Paul R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:06:49Z",
  "date_adate": "2007-02-24",
  "date_available": "2014-03-14T20:06:49Z",
  "date_issued": "2007-01-15",
  "date_rdate": "2007-02-24",
  "date_sdate": "2007-01-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The first part of this work describes the synthesis of a new histone deacetylase (HDAC) inhibitor (HDI). HDAC enzymes modify core histones, influence nucleosome structure and change gene transcription by removing the acetyl groups from lysine residues on proteins. HDIs are showing exciting potential as a new class of drugs for cancer and a variety of other diseases. A new HDAC inhibitor based on the hydroxamic acid motif has been synthesized. Two characteristic structural features were incorporated into the design of the novel inhibitor. A cyclic peptide mimetic of known structure was fused to a hydroxamic acid moiety through an aliphatic chain. The HDAC inhibitor provided significant inhibitory activity against HDACs with an IC50 value of 46 ± 15 nM, and against HDAC8 with an IC50 value of 208 ± 20 nM. The potent HDAC inhibitory activity of the HDAC inhibitor demonstrates the importance of the rim recognition region in the design of HDIs. The hydrophobic cyclic turn mimic allows the formation of a tight complex between HDI and HDAC enzymes. The second part of this work is to synthesize secondary structure mimics and incorporate them into the helix-turn-helix (HTH) motif. One of the important methods to study the conformation of the biologically active peptides is to incorporate the rigid peptidomimetics into the relevant peptides. Important information can be obtained from the study of conformationally constrained peptides. HTH proteins are well characterized and found in many organisms from prokaryotes to eukaryotes. The relatively small size, simple structure, and significance in stabilizing  tertiary structures make the HTH peptide an attractive target to mimic. Both a Gly HTH turn mimic and a Ser HTH turn mimic were synthesized using stereoselective hydrogenation and macrocyclization starting from unnatural amino acids in a yield of 33% and 14%, respectively. The synthesis of Fmoc protected HTH turn mimics allowed incorporation into HTH peptides using Fmoc chemistry on solid phase. The incorporation of the HTH turn mimics into the peptides proved to be challenging, either by sequential elongation or by segment condensation. Alternative peptide synthesis strategies were employed in attempts to solve the problems.",
  "description_provenance": [
    "Author Email: taliu@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: fetzkorn@vt.edu",
    "Advisor Email: maander6@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:49Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 1045720 bytes, checksum: 8e7deedfa7a7b3ba8fd009b5dcb70fd4 (MD5)   Previous issue date: 2007-01-15"
  ],
  "handle": "26019",
  "identifier_other": "etd-01212007-215511",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01212007-215511/",
  "identifier_uri": "http://hdl.handle.net/10919/26019",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cyclization",
    "helix-turn-helix",
    "histone deacetylase inhibitor"
  ],
  "title": "Part 1 Synthesis of a potent histone deacetylase inhibitor; Part 2 Studies towards a stabilized helix-turn-helix peptide",
  "type": "Dissertation"
}