{
  "contributor_author": "Cassino, Theresa R",
  "contributor_committeechair": "Forsten-Williams, Kimberly",
  "contributor_committeemember": [
    "Goldstein, Aaron S.",
    "Davis, Richey M.",
    "Love, Brian J."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:06:48Z",
  "date_adate": "2006-02-08",
  "date_available": "2014-03-14T20:06:48Z",
  "date_issued": "2006-01-17",
  "date_rdate": "2006-02-08",
  "date_sdate": "2006-01-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The metabolic activity of cartilage cells (chondrocytes) is regulated by mechanical forces which act on them.  Chondrocytes can respond to these forces through synthesis or degradation of extracellular matrix and changes in gene expression.  The overall objective of this study was to investigate the effects of mechanical compression on gene regulation, proteoglycan (PG) synthesis and activation of signaling pathways. <p>    To achieve this goal a simple oscillatory displacement controlled device was designed to provide uniaxial unconfined strain to cell constructs.  Static compression and dynamic compression with various waveforms are utilized with a stroke range of 0.25 mm to 4 mm and a frequency range of 0.1 Hz to 3 Hz.  Poly-L-lactic acid (PLLA/)alginate disks and alginate disks with equine chondrocytes embedded in them were developed and showed unchanged viability for 24 hr under static and dynamic compression.  Testing to relate the strains applied to forces experienced in cell constructs was completed and the simple procedure outlined for companion use with our device. <p>   Quantitative reverse transcription polymerase chain reaction (QRT-PCR) revealed  changes in expression of collagen II and matrix metalloproteinase-3 under dynamic compression for 24 hr.  Equine chondrocytes compressed for 48 hr showed lower PG synthesis for both static and dynamic compression when compared to uncompressed samples in replicate experiments.  Repeatability of this experiment was problematic possibly due to decreased viability and inefficient extraction.  Different patterns of extracellular signal regulated kinase (ERK) activation with time were found for uncompressed and compressed samples (static at 15% strain and dynamic at 15% strain, 1 Hz) and protein kinase B (also called Akt) was not regulated by compression.  Results from experiments involving frequency and strain for dynamic compression were inconclusive. <p>   These studies show that regulation of gene expression, PG synthesis and intracellular signaling can be studied with our device but optimization of the experimental procedure is still needed.  To our knowledge these studies are the first to show these types of studies utilizing equine chondrocytes.  Despite issues encountered, our studies provide valuable insights into the effects of compression on equine chondrocytes and detail a simple device for use in a wide variety of compression studies. <p>",
  "description_provenance": [
    "Author Email: tgouker@vt.edu",
    "Advisor Email: goldst@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: blove@vt.edu",
    "Advisor Email: kfw@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:48Z (GMT). No. of bitstreams: 1 TCassinoDissertation.pdf: 7002944 bytes, checksum: 675761ae766a5eec823829ab210cb15d (MD5)   Previous issue date: 2006-01-17"
  ],
  "handle": "26018",
  "identifier_other": "etd-01202006-200759",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01202006-200759/",
  "identifier_uri": "http://hdl.handle.net/10919/26018",
  "publisher": "Virginia Tech",
  "relation_haspart": "TCassinoDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "articlular chondrocyte",
    "equine",
    "gene expression",
    "mechanical compression",
    "proteoglycan synthesis",
    "cell signaling"
  ],
  "title": "Investigation of Cellular Responses Activated by Mechanical Compression in Equine Chondrocytes: Device Design, Construction and Testing",
  "type": "Dissertation"
}