{
  "contributor_author": "Ragusa, Angela Theresa",
  "contributor_committeechair": "Bailey, Carol A.",
  "contributor_committeemember": [
    "Ryan, John W.",
    "Fuhrman, Ellsworth R.",
    "Sewell, Edward H. Jr.",
    "McCaughey, Martha"
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:06:50Z",
  "date_adate": "2003-03-13",
  "date_available": "2014-03-14T20:06:50Z",
  "date_issued": "2003-01-10",
  "date_rdate": "2004-03-13",
  "date_sdate": "2003-01-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research employs qualitative methodology to analyze social change in business news articles of The New York Times.  A random sample of 127 articles published between 1970 and 2000, discussing advertising news and containing one or more of the terms â  Gayâ  , â  Lesbianâ  , â  Bisexualâ  , â  Transexualâ  , â  Transgenderedâ   and â  Queerâ   (GLBTQ), were selected.  Feminist, Marxist, Postmodern, and critical theory is used to analyze social representation, cultural norms, stereotypes and levels of visibility. The â  meta-theoreticalâ   lens applied is a gendered postmodernism grounded in stratification theory that assuages the cultural-based critique of Marxism, overcomes the essentialist limitations of radical feminism, incorporates the pluralism of socialist feminism and delimits the relativist tendencies of a purer postmodernism. Quantitatively, gay men were found to achieve twice as much business news coverage as lesbians.  Bisexuals, transsexuals, transgenders and queers were highly invisible.  Overall, a change in the representation and depiction of corporate interest in gays and lesbians was manifested.  This socio-historical analysis revealed a shift from deviantization and stigmatization of homosexuality to the commodification, and spectacularization of GLBTQs.  GLBTQ invisibility is documented and the misconception of gay and lesbian wealth, created by market research, is addressed.  Invisibility of GLBTQs is posited to be both an intentional and actively managed form of politics.  Furthermore, business news reporting is argued to be less â  objectiveâ   and more a political, social cultural and political activity where the media itself is a stage for the cultural contestation of social norms. \t\tThis sociologically informed reading of business news articles details numerous case-specific instances where The New York Times contributed towards the proliferation of norms, values and beliefs characterizing GLBTQs.  The New York Times is argued to be a contributor towards the creation of sexuality as a cultural product.  Its representations of GLBTQs are seen as one manifestation of an institutionally created understanding of the â  culture of homosexualityâ  .",
  "description_provenance": [
    "Author Email: aragusa@vt.edu",
    "Advisor Email: johnryan@vt.edu",
    "Advisor Email: fuhrman@mail.vt.edu",
    "Advisor Email: esewell@vt.edu",
    "Advisor Email: baileyc@mail.vt.edu",
    "Advisor Email: marth@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:50Z (GMT). No. of bitstreams: 2 Angelaragusadissert.pdf: 1860369 bytes, checksum: 31f344cdf858c7b38fdf671fd536acac (MD5) Ragusa_CV03.pdf: 196856 bytes, checksum: 51e5c8e243550038337b3f87a71e7665 (MD5)   Previous issue date: 2003-01-10"
  ],
  "handle": "26025",
  "identifier_other": "etd-01232003-180107",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01232003-180107/",
  "identifier_uri": "http://hdl.handle.net/10919/26025",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Angelaragusadissert.pdf",
    "Ragusa_CV03.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Consumption",
    "Transsexual",
    "Gay",
    "Bisexual",
    "Inequality",
    "Media",
    "Lesbian",
    "Transgender",
    "Queer",
    "Social Change",
    "Qualitative",
    "Visibility"
  ],
  "title": "Social Change in the Media: Gay, Lesbian, Bi, Trans and Queer (GLBTQ) Representation and Visibility in The New York Times: A Critical, Qualitative Social-Historical Content Analysis of The New York Times.",
  "type": "Dissertation"
}