{
  "contributor_author": "Wang, Hang",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Riffle, Judy S.",
    "Dillard, John G.",
    "Long, Timothy E."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:06:50Z",
  "date_adate": "2007-01-25",
  "date_available": "2014-03-14T20:06:50Z",
  "date_issued": "2006-12-15",
  "date_rdate": "2007-01-25",
  "date_sdate": "2007-01-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nanophase-separated hydrophilic-hydrophobic multiblock copolymers are promising proton exchange membrane (PEM) materials due to their ability to form various morphological structures which enhance transport.  <p> Four arylene chlorides monomers (2,5-Dichlorobenzophenone and its derivatives) were first successfully synthesized from aluminum chloride-catalyzed, Friedel-Crafts acylation of benzene and various aromatic compounds with 2,5-dichlorobenzoyl chloride.  These monomers were then polymerized via Ni (0)-catalyzed coupling reaction to form various high molecular weight substituted poly(2,5-benzophenone)s.  Great care must be taken to achieve anhydrous and inert conditions during the reaction.<p> A series of poly(2,5-benzophenone) activated aryl fluoride telechelic oligomers with different block molecular weights were then successfully synthesized by Ni (0)- catalyzed coupling of 2,5-dichloro-benzophenone and the end-capping agent 4-chloro-4'-fluorobenzophenone or 4-chlorophenly-4â  -fluorophenyl sulfone.  The molecular weights of these oligomers were readily controlled by altering the amount of end-capping agent.  These telechelic oligomers (hydrophobic) were then copolymerized with phenoxide terminated disulfonated poly (arylene ether sulfone)s (hydrophilic) by nucleophilic aromatic substitution to form novel hydrophilic-hydrophobic multiblock copolymers.  <p> A series of novel multiblock copolymers with number average block lengths ranging from 3,000 to 10,000 g/mol were successfully synthesized.  Two separate Tgs were observed via DSC in the transparent multiblock copolymer films when each block length was longer than 6,000 g/mol (6k).  Tapping mode atomic force microscopy (AFM) also showed clear nanophase separation between the hydrophilic and hydrophobic domains and the influence of block length, as one increased from 6k to 10k.  Transparent and creasable films were solvent-cast and exhibited good proton conductivity and low water uptake.  <p> These PAES-PBP multiblock copolymers also showed much less relative humidity (RH) dependence than random sulfonated aromatic copolymers BPSH 35 in proton conductivity, with values that were almost the same as Nafion with decreasing RHs.  This phenomenon lies in the fact that this multiblock copolymer possesses a unique co-continuous nanophase separated morphology, as confirmed by AFM and DSC data.  Since this unique co-continuous morphology (interconnected channels and networks) dramatically facilitates the proton transport (increase the diffusion coefficient of water), improved proton conductivity under partially hydrated conditions becomes feasible.  These multiblock copolymers are therefore considered to be very promising candidates for high temperature proton exchange membranes in fuel cells.",
  "description_provenance": [
    "Author Email: hawang3@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: john.dillard@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:50Z (GMT). No. of bitstreams: 1 Wang-Dissertation.pdf: 3166287 bytes, checksum: 68233747af0816b032ce6a1fd93f6d34 (MD5)   Previous issue date: 2006-12-15"
  ],
  "handle": "26026",
  "identifier_other": "etd-01232007-135829",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01232007-135829/",
  "identifier_uri": "http://hdl.handle.net/10919/26026",
  "publisher": "Virginia Tech",
  "relation_haspart": "Wang-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Ni (0)-catalyzed coupling reaction",
    "Poly(benzophenone)",
    "Disulfonated Poly(arylene ether sulfones)",
    "Proton Exchange Membranes",
    "Fuel Cells",
    "Poly(p-phenylene)",
    "Morphology",
    "Multiblock Copolymers"
  ],
  "title": "SYNTHESIS AND CHARACTERIZATION OF MULTIBLOCK COPOLYMERS FOR PROTON EXCHANGE MEMBRANE FUEL CELLS (PEMFC)",
  "type": "Dissertation"
}