{
  "contributor_author": "Bowling, Daniel L.",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Newby, JoeAnn",
    "Schreck, John F.",
    "Martin, Rosalie Marie"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:06:50Z",
  "date_adate": "2007-02-15",
  "date_available": "2014-03-14T20:06:50Z",
  "date_issued": "2007-01-19",
  "date_rdate": "2010-02-15",
  "date_sdate": "2007-01-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to assess the satisfaction level of public middle school principals in Virginia as measured by the Minnesota Satisfaction Questionnaire (MSQ) and compare it to the earlier 1999 findings of Dr. JoeAnn Newby. The Long-Form of the Minnesota Satisfaction Questionnaire (MSQ) was used to determine the levels of job satisfaction for middle school principals in Virginia using twenty dimensions of the job and the following demographic variables: gender, age, experience, education, school location, school population, accreditation status, and Adequate Yearly Progress (AYP). Specifically, this study sought to answer the following 5 questions: (1) What is the general satisfaction level of middle school principals in the state of Virginia as measured by the Minnesota Satisfaction Questionnaire (MSQ)? (2) Based on the demographic variables of gender, age, degree, experience, school location, and school population what is the general satisfaction level of middle school principals in Virginia? (3) What is the satisfaction level of each of the twenty dimensions of the job as measured by the Minnesota Satisfaction Questionnaire (MSQ)? (4) Based on the demographic variables of gender, age, degree, experience, school location, and school population, what is the satisfaction level of middle school principals for each of the twenty dimensions of the Minnesota Satisfaction Questionnaire (MSQ)? (5) Based on the demographic variables of accreditation status and Adequate Yearly Progress (AYP) have the Virginia Standards of Learning and No Child Left Behind legislation influenced the general job satisfaction of middle school principals in Virginia? \tThe 2006 Virginia Educational Directory was utilized to select the target population of 334 middle school principals. A mailing consisting of an Individual Information Sheet and the 1967 Long Form of the Minnesota Satisfaction Questionnaire (MSQ) was mailed to each principal. Demographic data pertaining to gender, age, degree, experience, school location, school population, accreditation status, and Adequate Yearly Progress (AYP) was collected and compared with the twenty dimensions of the MSQ. Statistical procedures including frequency charts, ANOVAs, and post hoc tests (Scheffe) were utilized to determine the statistical significance of the findings.",
  "description_provenance": [
    "Author Email: dbowling@vt.edu",
    "Advisor Email: Joeann_newby@surryschools.net",
    "Advisor Email: stev7735@comcast.net",
    "Advisor Email: rosemartin@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:50Z (GMT). No. of bitstreams: 1 Dissertation1.pdf: 692145 bytes, checksum: cd0cd87ede5c3f115d5e7b73b79f27c9 (MD5)   Previous issue date: 2007-01-19"
  ],
  "handle": "26027",
  "identifier_other": "etd-01232007-140717",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01232007-140717/",
  "identifier_uri": "http://hdl.handle.net/10919/26027",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Middle School Principals",
    "Job Satisfaction"
  ],
  "title": "Job Satisfaction of Public Middle School Principals in the Commonwealth of Virginia: Revisited",
  "type": "Dissertation"
}