{
  "contributor_author": "Batlang, Utlwang",
  "contributor_committeecochair": [
    "Parrish, David J.",
    "Pereira, Andy"
  ],
  "contributor_committeemember": [
    "Grene, Ruth",
    "Veilleux, Richard E.",
    "Fike, John Herschel",
    "Ervin, Erik H."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:06:49Z",
  "date_adate": "2010-01-22",
  "date_available": "2014-03-14T20:06:49Z",
  "date_issued": "2010-01-05",
  "date_rdate": "2011-01-22",
  "date_sdate": "2010-01-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Drought stress was studied in rice (Oryza sativa) and maize (Zea mays) to identify drought-responsive genes and associated biological processes. One experiment with rice examined drought responses in vegetative and reproductive tissues and identified drought-responsive genes in each tissue type. The results showed that brief periods of acute drought stress at or near anthesis reduced photosynthetic efficiency and ultimately lowered grain yield. Yield was reduced as a result both of fewer spikelets developed and of lower spikelet fertility. Affymetrix arrays were used to analyze global gene expression in the transcriptomes of rice vegetative and reproductive tissue. Comparative analysis of the expressed genes indicated that the vegetative and reproductive tissues responded differently to drought stress. An experiment was conducted with maize, using GS-FLX pyrosequencing to identify differentially expressed genes in vegetative and reproductive tissues; and these results were compared with those from the just-described rice transcriptome. Some of the drought-responsive genes in the maize reproductive tissue were validated by quantitative real time polymerase chain reaction (qRT-PCR). The differentially expressed genes common to both maize and rice were further analyzed by gene ontology analysis to reveal core biological processes involved in drought responses. In both species, drought caused a transition from protein synthesis to degradation, and photosynthesis was one of the most severely affected metabolic pathways. In a validating experiment, a drought-responsive transcription factor found in rice and dubbed HIGHER YIELD RICE (HYR) was constitutively expressed in rice, and the transgenic HYR plants were studied. Under well-watered conditions, the HYR plants developed higher rates of photosynthesis, greater levels of soluble sugars (glucose, fructose, and sucrose), more biomass, and higher yield. They also exhibited a drought-resistant phenotype, with higher water use efficiency, photosynthesis, and relative leaf water content under drought stress. Taken together, these studies demonstrate the potential value of newer technologies for identifying genes that might impart drought resistance and for using such genes to make crops more productive either in the presence or in the absence of drought stress",
  "description_provenance": [
    "Author Email: ubatlang@vt.edu",
    "Advisor Email: grene@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: jfike@vt.edu",
    "Advisor Email: ervin@vt.edu",
    "Advisor Email: dparrish@vt.edu",
    "Advisor Email: pereiraa@vbi.vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:49Z (GMT). No. of bitstreams: 1 Batlang_U_D_2010.pdf: 1553229 bytes, checksum: 50d6bea0d2e6a3325965997c9e4b11ac (MD5)   Previous issue date: 2010-01-05"
  ],
  "handle": "26020",
  "identifier_other": "etd-01212010-141508",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01212010-141508/",
  "identifier_uri": "http://hdl.handle.net/10919/26020",
  "publisher": "Virginia Tech",
  "relation_haspart": "Batlang_U_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "water use efficiency",
    "rice",
    "maize",
    "HYR gene",
    "drought resistance",
    "drought stress"
  ],
  "title": "Identification of Drought-Responsive Genes and Validation for Drought Resistance in Rice",
  "type": "Dissertation"
}