{
  "contributor_author": "Freeman, Dorothy McCargo",
  "contributor_committeechair": "Rogers, Cosby Steele",
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:06:50Z",
  "date_adate": "2002-02-01",
  "date_available": "2014-03-14T20:06:50Z",
  "date_issued": "2001-12-18",
  "date_rdate": "2003-02-01",
  "date_sdate": "2002-01-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT  The primary purpose of this study was to investigate the extent to which measures of ego strength, as conceived by Erikson (1963a) and operationalized by Markstrom, Sabino, Turner and Berman (1997), contribute to the prediction of academic achievement of high school students.  At issue was whether the ego strength variables enhance prediction beyond that provided by selected demographic variables and two measures of religiosity: faith participation and faith importance. Participants included 121 Black and 131 White students of Virginia.  They were in the ninth through twelfth grades and were attending a single high school in the Tidewater area of Virginia.  They were administered a questionnaire that included several demographic questions, two questions regarding religion in their lives, and five subscales from the Psychosocial Inventory of Ego Strength (PIES) developed by Markstrom et al. (1997).  These variables were used in a series of hierarchical regression analyses to predict grade-point-average (GPA) which was obtained from the permanent school records of each student.  Significant relationships were found between and among the five psychosocial ego strengths.  Several relationships were found between studentsâ   psychosocial ego strength attributes and parentsâ   educational levels.  A positive significant relationship was found between the total ego strength and academic achievement.  Some differences were found between race and the Hope subscale, faith participation, and faith importance.  Race was also found to be a significant influence on the predictive relationships between psychosocial total ego strength and academic achievement.  Total ego strength was found to be a significant predictor of academic achievement.  The essential finding of the study was that ego strength measures explained approximately 10% of the variance in GPA above that already accounted for by the demographic variables and the two religiosity variables.  The items measuring the importance of faith and participation in faith activities did not contribute to the prediction of GPA, except for faith participation among Black students.",
  "description_provenance": [
    "Author Email: mccargo@vt.edu",
    "Advisor Email: rogersco@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:50Z (GMT). No. of bitstreams: 1 Dissertation..pdf: 1303981 bytes, checksum: 09694606385036cbb1dae21728d92d26 (MD5)   Previous issue date: 2001-12-18"
  ],
  "handle": "26024",
  "identifier_other": "etd-01232002-123541",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01232002-123541/",
  "identifier_uri": "http://hdl.handle.net/10919/26024",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation..pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "academic achievement",
    "adolescents",
    "ego strength",
    "psychosocial development",
    "faith"
  ],
  "title": "The Contribution of Faith and Ego Strength to the Prediction of GPA among High School Students",
  "type": "Dissertation"
}