{
  "contributor_author": "Geide, Cherie A.",
  "contributor_committeechair": "Salmon, Richard G.",
  "contributor_committeemember": [
    "Parson, Stephen R.",
    "Dawson, C.",
    "Rohr, John A.",
    "Colbert, Joy"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:06:50Z",
  "date_adate": "1999-02-05",
  "date_available": "2014-03-14T20:06:50Z",
  "date_issued": "1998-12-09",
  "date_rdate": "1999-02-05",
  "date_sdate": "1999-01-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Financing technology is an expensive and ongoing process due to constant upgrades and advancements that make yesterday's innovations obsolete.  How Catholic elementary schools attempt to meet the financial challenge to provide necessary technological tools to their students is a concern expressed throughout the Catholic education community. The questions addressed in this study include: (1) how are Catholic elementary schools in the middle Atlantic states financing technology in their schools? (2) to what extent has technology been integrated into these schools? and (3) what are some of the factors, combined with funding, that have enabled or hindered technology integration within these schools?  \tThis study of middle Atlantic Catholic elementary schools was planned to include a survey of approximately two hundred sixty-four (264) schools within the Dioceses of Charlotte, Raleigh, Richmond, Arlington, Wilmington, and the Archdioceses of Washington, D.C. and Baltimore. However, only superintendents for the Dioceses of Charlotte, Richmond, and Arlington approved of the survey distribution in their systems. As a result, seventy-two (72) schools were surveyed in these three systems.  The survey instrument contained questions designed to identify the methods of funding technology programs; the extent of technology use in the schools; any factors in addition to funding that have enabled technology integration; and any factors that have affected cost of technology in the school.  Follow-up telephone interviews were conducted as needed.  Candidates selected for interview were based on any notable survey responses.  Descriptive statistics were obtained from the survey and telephone interview data and were placed on the Demographics, Technology Use and Integration, and Budget and Acquisition data collection charts.  School demographics, staff development programs, percentage of budget designated for technology, and primary sources of technology funding were a few of the areas investigated. \tAlthough general references are available to Catholic school administrators regarding technology funding, this information is time consuming to read for application to locality and specifically to Catholic education.  The data collected from this study will be sent to each school principal who returned a survey and will reveal technology trends and methods of funding that are specific to the middle Atlantic Catholic elementary schools.   In addition, conclusions drawn from this study relative to funding methods, extent of technology integration, and factors that have enabled technology programs within the schools, provide the basis for future study.",
  "description_provenance": [
    "Author Email: kgeide@internetMCI.COM",
    "Advisor Email: sparson@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:50Z (GMT). No. of bitstreams: 5 PartII.pdf: 144944 bytes, checksum: b0a5a0cf7002123985f06f3dd96401df (MD5) appc.pdf: 137869 bytes, checksum: b05a9fc2fe6fbfed3c9629325ad20a26 (MD5) appd.pdf: 53268 bytes, checksum: 50e441c2b51fd32f2ce8d7880e921673 (MD5) appe.pdf: 34819 bytes, checksum: b920d2c5bc19f2adfc87c86e7598ba19 (MD5) PartI.pdf: 151175 bytes, checksum: 4bc5c67c48c4853598352a207b5c1c86 (MD5)   Previous issue date: 1998-12-09"
  ],
  "handle": "26028",
  "identifier_other": "etd-012399-175420",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-012399-175420/",
  "identifier_uri": "http://hdl.handle.net/10919/26028",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "PartII.pdf",
    "appc.pdf",
    "appd.pdf",
    "appe.pdf",
    "PartI.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Computer",
    "Elementary",
    "Technology",
    "Catholic",
    "Funding"
  ],
  "title": "A Descriptive Study of Technology Acquisition and Integration in Middle Atlantic Catholic  Elementary Schools",
  "type": "Dissertation"
}