{
  "contributor_author": "Power, Donna M",
  "contributor_committeecochair": [
    "Alexander, David",
    "Fortune, Jimmie C."
  ],
  "contributor_committeemember": [
    "Caldwell, M. Teressa",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:06:52Z",
  "date_adate": "2007-05-09",
  "date_available": "2014-03-14T20:06:52Z",
  "date_issued": "2007-01-16",
  "date_rdate": "2007-05-09",
  "date_sdate": "2007-01-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT With the re-authorization of the Individuals with Disabilities Education Act (IDEA) and the federal mandates of No Child Left Behind (NCLB), the role of the principal has new implications regarding the free and appropriate education of students with disabilities.  As a result of the inclusion model of special education instruction being supported as the most effective learning environment for students with disabilities, principals now need to know the definitions of types of disabilities, appropriate placements,  how to provide correct feedback for parents and at a minimum, the basics of special education law.  The literature review focused on principalsâ   attitudes and concerns for special education placements and how knowledgeable school principals are with regard to issues of special education law and the possibility of litigation when planning for the free and appropriate education of special education students.  Few U.S. studies have focused exclusively on the actual principalsâ   knowledge of special education law.   This study researched the knowledge of Virginia principals on special education.   A geographical random sample of 462 principals from the state of Virginia were asked to complete an on-line survey of 24 hypothetical scenarios based on the following components of IDEA:  free and appropriate public education, due process, individualized education plans, least restrictive environment, related services, student discipline and liability for reimbursement of parents..  Experts, practitioners, and researchers in the field reviewed these scenarios.  The survey was e-mailed to the principals from October 1st to November 1st, 2006.  A follow up e-mail was sent two weeks after the initial contact as a reminder to complete the survey.  From November 2nd to November 15th 10% of the respondents who did not respond were contacted by phone and asked why they did not respond. Out of 49 phone calls, 12 principals responded.  The instrument was anonymous and color coded according to the eight Superintendentsâ   Study Groups across the state of Virginia in order to identify the number of schools that participated.  A total of 236 principals responded resulting in a 51% response rate.   Upon completion of the questionnaire principals were provided correct responses. Using the Statistical Package for the Social Sciences (SPSS), an analysis of variance (ANOVA) was performed on all demographic variables and the principalsâ   test score.  An item analysis of each of the hypothetical scenarios determined the areas of deficiencies in the principalsâ   knowledge base.  Results of this study show that there is no significant difference between principalsâ   test scores and each of the demographic variables.  Seven areas of special education law were tested:  free and appropriate public education (FAPE), individualized education plan (IEP), least restrictive environment (LRE), student discipline, related services, due process and liability for reimbursement of parents  This study identified two significant areas of weakness: related services and FAPE.  The information from this study will be beneficial in determining school districtsâ   professional development needs and coursework in university education programs that addresses special education law.",
  "description_provenance": [
    "Author Email: dpower@mathews.k12.va.us",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: fortunj@vt.edu",
    "Advisor Email: Teressa.Caldwell@fcps.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:52Z (GMT). No. of bitstreams: 1 principalsknowledgeofspecialeducationlawcombined020907.pdf: 753200 bytes, checksum: 90174d22ef456a4fdebe66f7a636e308 (MD5)   Previous issue date: 2007-01-16"
  ],
  "handle": "26036",
  "identifier_other": "etd-01252007-110510",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01252007-110510/",
  "identifier_uri": "http://hdl.handle.net/10919/26036",
  "publisher": "Virginia Tech",
  "relation_haspart": "principalsknowledgeofspecialeducationlawcombined020907.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "school principals",
    "special education",
    "special education law"
  ],
  "title": "A Study of Selected Virginia Principals' Knowledge of Special Education Law",
  "type": "Dissertation"
}