{
  "contributor_author": "Campbell, Hugh David",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Krouscas, James A. Jr.",
    "Lepczyk, Billie F.",
    "Stratton, Richard K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:06:52Z",
  "date_adate": "2008-02-22",
  "date_available": "2014-03-14T20:06:52Z",
  "date_issued": "2008-01-21",
  "date_rdate": "2008-02-22",
  "date_sdate": "2008-01-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nearly one third of all Americans believe religion to be the most important part of their life.  Nearly two thirds of Americans believe religion to be an important part of their life.  The majority of Americans (94%) claim to have a belief in a supreme deity or God.  The purpose of this study was to examine the relationship between spirituality and religion and selected risk taking behaviors in college underclassmen.  Presently in the published literature, there are no studies that examined the relationship between levels of spirituality and religion and their interaction with select risk-taking behaviors, while delineating these variables to the college underclassmen.  The risk-taking behaviors that were of  interest to the researcher in this study were episodic and heavy drinking and sexual behaviors.  This research effort employed a non-experimental, descriptive study design.  The study population consisted of college underclassmen enrolled in an introductory wellness course in a teaching-intensive institution in the Mid-Atlantic United States.  Results indicated a significant interaction between religion and all of the sexual risk behaviors under analysis. Results also indicated a significant interaction between spirituality and three of the four sexual risk behaviors under analysis.  A significant interaction was found between frequency of church attendance and all of the sexual risk behaviors under analysis.  Finally, when cross tabulated with all measures of spirituality and religion, risk behaviors related to alcohol usage reported statistically insignificant on all data indices.",
  "description_provenance": [
    "Author Email: dcampbell@concord.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: jkrousca@vt.edu",
    "Advisor Email: lepczyk@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:52Z (GMT). No. of bitstreams: 1 campbelldissertation2.pdf: 329883 bytes, checksum: 2fee20f3fbdc92a924a099d7de8d312b (MD5)   Previous issue date: 2008-01-21"
  ],
  "handle": "26038",
  "identifier_other": "etd-01252008-133238",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01252008-133238/",
  "identifier_uri": "http://hdl.handle.net/10919/26038",
  "publisher": "Virginia Tech",
  "relation_haspart": "campbelldissertation2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Spirituality",
    "Religion",
    "Risk-Taking Behaviors"
  ],
  "title": "An Examination of the Relationship between Spirituality and Religion and Selected Risk-Taking Behaviors in College Underclassmen",
  "type": "Dissertation"
}