{
  "contributor_author": "Radhakrishnan, Rakesh",
  "contributor_committeechair": "Oyama, Shigeo Ted",
  "contributor_committeemember": [
    "Gibbs, Gerald V.",
    "Davis, Richey M.",
    "Cox, David F.",
    "Dillard, John G."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:06:51Z",
  "date_adate": "2001-01-26",
  "date_available": "2014-03-14T20:06:51Z",
  "date_issued": "2001-01-18",
  "date_rdate": "2002-01-26",
  "date_sdate": "2001-01-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Manganese oxide catalysts supported on Al2O3, ZrO2, TiO2 and SiO2 supports were used to study the effect of support on ozone decomposition kinetics.  X-ray diffraction (XRD), in-situ laser Raman spectroscopy, temperature programmed oxygen desorption, surface area measurements, extended and near edge x-ray absorption fine structure (EXAFS and NEXAFS) showed that the manganese oxide was highly dispersed on the surface of the supports.  EXAFS spectra suggest that the manganese active centers on all of the surfaces were surrounded by five oxygen atoms.  These metal centers were of a mononuclear type for the Al2O3 supported catalyst and multinuclear for the other supports.  NEXAFS spectra for the catalysts showed a chemical shift to lower energy and an intensity change in the L-edge features which followed the trend Al2O3 > ZrO2 > TiO2 > SiO2.  The trends provided insights into the positive role of available empty electronic states required in the reduction step of a redox reaction.   The catalysts were tested for their ozone decomposition reactivity and reaction rates had a fractional order dependency (n < 1) with ozone partial pressure.  The apparent activation energies for the reaction was low (3-15 kJ/mol).  The support influenced the desorption step (a reduction step) and this effect manifested itself in the pre-exponential factor of the rate constant for desorption.  Trends for this pre-exponential factor correlated with trends in NEXAFS features and reflected the ease of electron donation from the adsorbed species to the active center.",
  "description_provenance": [
    "Author Email: rradhakr@vt.edu",
    "Advisor Email: ggibbs@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Advisor Email: jdillard@vt.edu",
    "Advisor Email: oyama@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:51Z (GMT). No. of bitstreams: 1 dissert.pdf: 1179118 bytes, checksum: 25023dcaec7f8e177c883520114a8190 (MD5)   Previous issue date: 2001-01-18"
  ],
  "handle": "26033",
  "identifier_other": "etd-01252001-125957",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01252001-125957/",
  "identifier_uri": "http://hdl.handle.net/10919/26033",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissert.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Decomposition",
    "Oxygen Chemisorption",
    "Kinetics",
    "Temperature Programmed Desorption",
    "Ozone",
    "Raman Spectroscopy",
    "Manganese oxides",
    "Mechanism",
    "Ab initio",
    "X-ray Absorption Fine Structure Spectroscopy"
  ],
  "title": "Structure and Ozone Decomposition Reactivity of Supported Manganese Oxide Catalysts",
  "type": "Dissertation"
}