{
  "contributor_author": "Farrell, Rebecca L.",
  "contributor_committeechair": "Bodenhorn, Nancy E.",
  "contributor_committeemember": [
    "Day-Vines, Norma L.",
    "Camp, William G.",
    "Klecker, Beverly",
    "DePauw, Karen P."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:06:52Z",
  "date_adate": "2007-03-19",
  "date_available": "2014-03-14T20:06:52Z",
  "date_issued": "2007-01-15",
  "date_rdate": "2007-03-19",
  "date_sdate": "2007-01-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The call for mentorship in the counseling profession has recently become more prominent even though a comprehensive understanding of mentoring practices remains obscure. Researchers postulated that mentoring enhances studentsâ   professional development. Yet the frequency to which mentoring occurs and thus influences development is unknown due to the lack of empirical data. The purpose of this study was to examine mentorship, at the doctoral-level, in counselor education programs by identifying the following areas of mentoring: (a) structural components, (b) potential impact, and (c) important aspects. Personal experiences of 66 participants (sample of convenience) who were mentored as doctoral students were utilized.<p>   <p>The quantitative and qualitative results of this study were obtained through the utilization of the General Mentoring Questions, Mentoring Function Scale, and a short answer (one-shot) question. Participants, representing 28 CACREP accredited programs, identified aspects in the psychosocial and career domains of mentoring. Statistically significant differences (p<.05) in the psychosocial domain (M = 4.30) indicated that more intense mentoring occurred when compared to the career domain (M = 3.97). Statistically significant differences were not found across variables of age, gender, and race.<p> Participants qualitatively based responses to the most important aspect of their mentoring experiences assumed a more psychosocial orientation even when career-related functions were addressed. They were often encouraged, supported, respected, and protected while developing and/or enhancing teaching, research, service, and/or counseling based skills. Sentiments regarding the impact of the mentoring experiences on self-growth, self-confidence, and personal change were also expressed. Essentially, the participantsâ   mentoring experiences seemed to reflect the counseling principles of relationship development and promotion of well-being and empowerment as well as adherence to professional ethics.<p>  <p>It is important to note that these results, which provide a small glimpse to mentoring, cannot be generalized. Implications, however, can be drawn. Mentorship could potentially impact retention and graduation rates and promote professional continuity and identity. Obtaining a richer comprehension of mentorship is required and will most likely enable the profession to maximize practices in an effective and ethical manner, address acclimation, and ensure its longevity.<p>",
  "description_provenance": [
    "Author Email: rfarrell@vt.edu",
    "Advisor Email: dayvine@vt.edu",
    "Advisor Email: wgc4@cornell.edu",
    "Advisor Email: b.klecker@moreheadstate.edu",
    "Advisor Email: kpdepauw@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:52Z (GMT). No. of bitstreams: 1 RFarrellDissertation.pdf: 1052309 bytes, checksum: 6cbc9499d12ecebfbecbf67da7da345d (MD5)   Previous issue date: 2007-01-15"
  ],
  "handle": "26037",
  "identifier_other": "etd-01252007-223439",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01252007-223439/",
  "identifier_uri": "http://hdl.handle.net/10919/26037",
  "publisher": "Virginia Tech",
  "relation_haspart": "RFarrellDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mentoring",
    "doctoral students",
    "counselor education"
  ],
  "title": "Personal experiences of mentoring among doctoral students in counselor education",
  "type": "Dissertation"
}