{
  "contributor_author": "McCann, Lluana",
  "contributor_committeechair": "Rohr, John A.",
  "contributor_committeemember": [
    "White, Orion F. Jr.",
    "Catron, Bayard L.",
    "Wolf, James F.",
    "Wamsley, Gary L."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:06:51Z",
  "date_adate": "2008-01-30",
  "date_available": "2014-03-14T20:06:51Z",
  "date_issued": "2007-12-03",
  "date_rdate": "2008-01-30",
  "date_sdate": "2008-01-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "American Public Administration (PA) theory and practices have lacked adequately articulated or formalized normative foundations since the formal founding of the American State.  Discussions regarding how PA theory derives from individual and collective critical reflection on practices (praxiology) and how that knowledge can inform future actions (praxis) virtually have been absent in all organizations.  The recognition of the political legitimacy of PA has been lacking.  The placing of a viable and critical social theory that posits conscious, responsible, and committed human practices within the context of the administration of the American Constitutional State, a politically narrow context, has been lacking as well.  This dissertation establishes the works of social theorists Orion White, Jr., Michael Harmon, Robert Denhardt and Bayard Catron as the foundation for understanding how individuals do and can contribute to the collective administration of the complex state, including how they operate daily in organizations they join, critique and are capable of changing.  These scholars understand the dynamics of human being and present discussions of human actions and practices that are capable of tackling the challenges associated with administering the American State.  The work of John Rohr has established the other missing linksâ  the constitutional legitimacy of PA and the clarification of constitutional values to which American administrative actions and knowledge must adhere.  This dissertation asserts that it is the placing of human theory and action within the distinctly American theory and practices of the State that constitutes the solid normative foundations for American PA Praxis and Praxiology that constitutes a viable and formal founding of American Public Administration in word and deed.",
  "description_provenance": [
    "Author Email: lluana.mccann@hhs.gov",
    "Advisor Email: jrohr@vt.edu",
    "Advisor Email: jwolf@vt.edu",
    "Advisor Email: gwams@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:51Z (GMT). No. of bitstreams: 2 mccann01.pdf: 10576 bytes, checksum: 49638ceec60ef102fdddda008d4d96aa (MD5) McCann2.pdf: 599294 bytes, checksum: f9117bcca002b4b72efd7834e05c1b2d (MD5)   Previous issue date: 2007-12-03"
  ],
  "handle": "26031",
  "identifier_other": "etd-01242008-125832",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01242008-125832/",
  "identifier_uri": "http://hdl.handle.net/10919/26031",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "mccann01.pdf",
    "McCann2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ancient philosophers",
    "logical positivism",
    "western philosophy",
    "federal government",
    "logical empiricism",
    "Constitution",
    "political theory",
    "praxis",
    "praxiology",
    "public administration",
    "public administration theory",
    "public administration practice",
    "social theory"
  ],
  "title": "American Public Administration:  A Foundation for Praxis and Praxiology",
  "type": "Dissertation"
}