{
  "contributor_author": "Coffey, Brian Perry",
  "contributor_committeechair": "Read, James Fredrick",
  "contributor_committeemember": [
    "Textoris, D. A.",
    "Imhof, Matthias G.",
    "Eriksson, Kenneth A.",
    "Bambach, Richard K.",
    "Burbey, Thomas J."
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:06:56Z",
  "date_adate": "2000-01-28",
  "date_available": "2014-03-14T20:06:56Z",
  "date_issued": "2000-01-14",
  "date_rdate": "2001-01-28",
  "date_sdate": "2000-01-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The sequence stratigraphic development of the subsurface Paleogene, Albemarle Basin, North Carolina, was defined using well cuttings and wireline logs tied into largely published biostratigraphic and available seismic data.  Facies include: silty and shelly sands and shell beds (estuarine/lagoon/protected inner shelf facies); clean quartz sands and sandy mollusk-fragment grainstones (shoreface/shallow shelf); phosphatic hardgrounds (current and wave-swept shoreface and shallow shelf); bryozoan and echinoderm grainstones/packstones (storm reworked middle shelf); and fine skeletal wackestones and planktonic marls (slightly storm-winnowed to sub-wave base, deeper shelf).  Paleogene deposition on this high-energy, open-shelf was characterized by a distinctive shelf profile of inner shelf and inner shelf break, deep shelf and continental shelf/slope break.  The successive positions of terminal supersequence inner-shelf-breaks parallel the modern day continental margin and its onshore arches.  Thickness trends were strongly controlled by more rapid subsidence within the Albemarle Basin. \tThe Paleocene supersequence is dominated by deep shelf marl and developed following flooding after the latest Cretaceous low-stand.  Major shallowing occurred at the end of the Early Paleocene and near the end of the Late Paleocene.  The Eocene supersequence developed following lowstand deposition (evident on seismic) just off the terminal Paleocene depositional shelf break.  With flooding, a major transgressive sediment body developed (Pamlico spur), that formed a 50 km wide by 50 m high promontory at the inner shelf break, followed by HST progradation of quartzose and bryozoan-echinoderm open shelf carbonates that filled in the laterally adjacent shelf topography.  This was followed by ancestral Gulf Stream incision of the southeast-trending, shallow shelf to the south, and deep shelf further northeast.  Late Eocene-Oligocene deposition was initiated with localized lowstand sedimentation off the earlier terminal inner shelf break, followed by thin regional marl deposition and widespread highstand inner shelf, quartz sands and quartzose carbonates.  Localized Late Oligocene lowstand deposition occurred along the earlier Oligocene terminal inner shelf break, followed by widespread deposition of quartzose facies over the shallow shelf.  Oligocene units on the deep shelf were modified by highstand Gulf Stream scour.",
  "description_provenance": [
    "Author Email: bcoffey@vt.edu",
    "Advisor Email: mgi@vt.edu",
    "Advisor Email: kaeson@vt.edu",
    "Advisor Email: bambachr@vt.edu",
    "Advisor Email: tjburbey@vt.edu",
    "Advisor Email: jread@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:56Z (GMT). No. of bitstreams: 1 reviseetd.pdf: 6196049 bytes, checksum: bdabf3c2dd972cdac1fcb01da8c28205 (MD5)   Previous issue date: 2000-01-14"
  ],
  "handle": "26043",
  "identifier_other": "etd-01262000-10550002",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01262000-10550002/",
  "identifier_uri": "http://hdl.handle.net/10919/26043",
  "publisher": "Virginia Tech",
  "relation_haspart": "reviseetd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "North Carolina",
    "Paleogene",
    "mixed carbonate-siliciclastic",
    "nontropical",
    "sequence stratigraphy"
  ],
  "subject_lcc": "LD5655.V856 1999.C644",
  "title": "High-Resolution Sequence Stratigraphy of Paleogene, Nontropical Mixed Carbonate/Siliciclastic Shelf Sediments,  North Carolina Coastal Plain, U. S. A.",
  "type": "Dissertation"
}