{
  "contributor_author": "Sun, Zhifeng",
  "contributor_committeechair": "Meng, Xiang-Jin",
  "contributor_committeemember": [
    "Huckle, William R.",
    "Ahmed, S. Ansar",
    "Pierson, Frank William",
    "Toth, Thomas E.",
    "Tu, Zhijian Jake"
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:06:56Z",
  "date_adate": "2005-01-28",
  "date_available": "2014-03-14T20:06:56Z",
  "date_issued": "2005-01-20",
  "date_rdate": "2006-01-28",
  "date_sdate": "2005-01-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As novel or variant strains of HEV continue to evolve rapidly both in humans and other animals, it is important to develop a rapid pre-sequencing screening method to select field isolates for further molecular characterization. Two heteroduplex mobility assays (HMA) were developed to genetically differentiate field strains of swine HEV and avian HEV from known reference strains. It was shown that the HMA profiles generally correlate well with nucleotide sequence identities and with phylogenetic clustering between field strains and the reference swine HEV or avian HEV strains. Therefore, by using different HEV isolates as references, the HMA developed in this study can be used as a pre-sequencing screening tool to identify variant HEV isolates for further molecular epidemiological studies. <p>  Our previous study showed that avian HEV antibody is prevalent in apparently healthy chickens. A prospective study was conducted on a known seropositive but healthy chicken farm. Avian HEV was identified from the healthy chicken flock. Avian HEV isolates recovered from the healthy chicken share 70-97% nucleotide sequence identities with those isolates which cause hepatitis-splenomegaly (HS) syndrome based on partial helicase and capsid gene regions. Recovery of identical viruses from the experimentally inoculated chickens in the subsequent transmission study further confirmed our field results. The capsid gene of avian HEV isolates from chickens with HS syndrome were also characterized and found to be heterogeneic, with 76-100% nucleotide sequence identities to each other. The study indicates that avian HEV is enzootic in chicken flocks and spread subclinically among chicken populations, and that the virus is heterogeneic. <p>  As HEV can not be propagated in vitro, in order to further characterize avian HEV, an infectious viral stock with a known infectious titer must be generated. Bile and feces collected from specific-pathogen-free (SPF) chickens experimentally infected with avian HEV were used to prepare an avian HEV infectious stock. The infectivity titer of this infectious stock was determined, by intravenously inoculating one-week old SPF chickens, to be 5 x 10<SUP>4.5</SUP> 50% chicken infectious doses (CID<SMALL>50</SMALL>) per ml. Seroconversion, viremia as well as fecal virus shedding were observed in the inoculated chickens. Contact control chickens also became infected via direct contact with inoculated ones. Avian HEV infection in chickens was found to be dose-dependent. To determine if avian HEV can infect across species, one-week old SPF turkeys were intravenously inoculated each with 10<SUP>4.5</SUP>(CID<SMALL>50</SMALL>) of avian HEV. The inoculated turkeys seroconverted to avian HEV antibodies at 4-8 weeks postinoculation (WPI). Viremia was detected at 2-6 WPI, and fecal virus shedding at 4-7 WPI in inoculated turkeys. This is the first demonstration of cross-species infection by avian HEV.<p>  Little is known regarding the characteristics of the small ORF3 protein largely due to the lack of a cell culture system for HEV. To characterize the small protein, the ORF3 proteins of avian HEV and swine HEV were expressed in Escherchia coli, and purified by BugBuster His-Bind Purification System. Western blot analysis showed that avian HEV ORF3 protein is unique and does not share common antigenic epitopes with those of swine HEV and human HEV. However, swine HEV (genotype 3) and human HEV (genotype 1) ORF3 proteins cross-react with each other antigenically. To determine if the ORF3 protein is a virion protein, infectious stocks of avian HEV and swine HEV were first generated in SPF chickens and pigs, respectively. Virions were subsequently purified by sucrose density gradient centrifugation and virion proteins were characterized by SDS-PAGE and Western blot analysis. Two major forms of ORF2 proteins of avian HEV were identified: a 56 kDa and an 80 kDa proteins. Multiple immunoreactive forms of ORF2 proteins of swine HEV were also observed: 40 kDa, 53 kDa, 56 kDa and 72 kDa. However, the ORF3 protein was not detected from the native virions of avian HEV or swine HEV. These findings provide direct evidence that ORF2 indeed encodes a structural protein of HEV, whereas ORF3 does not. <p>  To search for other potential animal reservoirs for HEV, the prevalence of IgG anti-HEV antibody was determined in field mice caught in chicken farms to assess the possibility of mice as a potential reservoir for HEV infection in chickens. Three different recombinant HEV antigens derived from avian HEV, swine HEV, and human HEV were used in the ELISA assays. The anti-HEV seropositive rates in wild field mice (Mus musculus), depending upon the antigen used, are 15/76 (20%), 39/74 (53%), and 43/74 (58%), respectively. HEV RNA was also detected from 29 fecal and/or serum samples of mice. The HEV sequences recovered from field mice shared 72-100% nucleotide sequence identities with each other, 73-99% sequence identities with avian HEV isolates, and 51-60% sequence identities with representative strains of swine and human HEVs. However, attempts to experimentally infect laboratory mice (Mus musculus) with the PCR-positive fecal materials recovered from the wild field mice were unsuccessful. We also attempted to experimentally infect 10 Wistar rats each with avian HEV, swine HEV, and an US-2 strain of human HEV, respectively. However, the inoculated rats did not become infected as evidenced by the lack of viremia, virus shedding in feces or seroconversion. These data suggest that mice caught in chicken farms are infected by a HEV-like virus, but additional work is needed to determine the origin of the mouse virus as well as the potential role of rodents in HEV transmission.<p>  In summary, we developed two HMAs which are useful for differentiation and identification of variant strains of swine and avian HEVs. We genetically identified and characterized an avian HEV strain from apparently healthy chickens in seropositive flocks. We showed that avian HEV can cross species barriers and infect turkeys. Our data indicated that avian and swine HEV ORF2 genes encode structural proteins, whereas ORF3 genes do not. Evidence in this study also showed that HEV or HEV-like agent exists in field mice on a chicken farm.",
  "description_provenance": [
    "Author Email: zhsun1@vt.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: xjmeng@vt.edu",
    "Advisor Email: ansrahmd@vt.edu",
    "Advisor Email: pierson@vt.edu",
    "Advisor Email: ttoth@vt.edu",
    "Advisor Email: jaketu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:56Z (GMT). No. of bitstreams: 1 SunPhDDissertation.pdf: 1684661 bytes, checksum: 8f1b272e821cc653567e287a710fcdde (MD5)   Previous issue date: 2005-01-20"
  ],
  "handle": "26049",
  "identifier_other": "etd-01272005-103909",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01272005-103909/",
  "identifier_uri": "http://hdl.handle.net/10919/26049",
  "publisher": "Virginia Tech",
  "relation_haspart": "SunPhDDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hepatitis E",
    "hepatitis E virus",
    "cross-species infection",
    "open reading frames 2 and 3",
    "swine HEV",
    "heteroduplex mobility assay",
    "turkey",
    "avian HEV",
    "virion"
  ],
  "title": "Cross-Species Infection and Characterization of  Avian Hepatitis E Virus",
  "type": "Dissertation"
}