{
  "contributor_author": "Isaacs, Jeffrey S.",
  "contributor_committeecochair": [
    "Dawson, Christina M.",
    "Parson, Stephen R."
  ],
  "contributor_committeemember": [
    "Phares, James B.",
    "Fleenor, J. Russell",
    "Crockett, Jean B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:06:56Z",
  "date_adate": "2004-01-29",
  "date_available": "2014-03-14T20:06:56Z",
  "date_issued": "2003-12-02",
  "date_rdate": "2004-01-29",
  "date_sdate": "2004-01-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "</head>  <body lang=EN-US style='tab-interval:.5in'>  <div class=Section1>  Positive transition from a traditional schedule to a block schedule involves not only much investigation and planning but also the successful acclimation of teachers to the necessary changes in how they deliver instruction. With this being said, the importance of teacher evaluation and professional development can not be understated. This study investigates the evolution of the teacher evaluation process and professional development after the adoption of a 4x4 model of block scheduling. Data were collected from 6 Virginia public schools by means of principal interviews, teacher interviews, and analysis of the individual school divisionâ  s teacher evaluation methods and procedures. It was found that the 6 evaluation models shared similar components. The teachers and administrators believed that the models had not significantly changed since the adoption of block scheduling and, with some alterations by the administrators, did adequately evaluate teachers of 4x4 block scheduled schools. The most frequently offered suggestion for improvements to the block scheduled teacher evaluation process involved a larger narrative component. Considering both teacher and administrator comments, the researcher concluded that teacher developed portfolios would be a valuable part of the teacher evaluation process.  </div>   </div>  </body>  </html>",
  "description_provenance": [
    "Author Email: jeisaac2@vt.edu, singlewing@rocketmail.com",
    "Advisor Email: jbphares@yahoo.com",
    "Advisor Email: rfleenor@walton.k12.ga.us",
    "Advisor Email: crockettj@vt.edu",
    "Advisor Email: tdawson@antiochsea.edu",
    "Advisor Email: parson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:56Z (GMT). No. of bitstreams: 1 etdissacs1-25.pdf: 917893 bytes, checksum: 6adda29793f039e8e694c605a04637b1 (MD5)   Previous issue date: 2003-12-02"
  ],
  "handle": "26045",
  "identifier_other": "etd-01262004-152326",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01262004-152326/",
  "identifier_uri": "http://hdl.handle.net/10919/26045",
  "publisher": "Virginia Tech",
  "relation_haspart": "etdissacs1-25.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Teacher Evaluation Models",
    "Teacher Evaluation",
    "Block Scheduling",
    "Professional Development",
    "Portfolios"
  ],
  "title": "A Study of Teacher Evaluation Methods Found in Select Virginia Secondary Public Schools Using the 4x4 Model of Block Scheduling",
  "type": "Dissertation"
}