{
  "contributor_author": "Zhang, Bin",
  "contributor_committeechair": "Turner, S. Richard",
  "contributor_committeemember": [
    "Deck, Paul A.",
    "Long, Timothy E.",
    "Marand, Hervé L.",
    "Riffle, Judy S."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:06:55Z",
  "date_adate": "2012-03-29",
  "date_available": "2014-03-14T20:06:55Z",
  "date_issued": "2012-01-13",
  "date_rdate": "2012-03-29",
  "date_sdate": "2012-01-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Poly(arylene ether sulfone)s (PAES) are important commercial polymers and have been extensively studied due to their excellent thermal and mechanical properties. However, some applications are still limited when good solvent resistance and low thermal expansion coefficient are required. There has been a continuous interest in developing new PAES based on new monomers or polymer modifications to obtain new properties or to enhance existing properties. In this dissertation, the synthesis, characterization and structure-property relationship of new 1,4-cyclohexylene ring containing PAESs were comprehensively studied. Different polymerization techniques were used to synthesize polymers with different segmental lengths.  The monomer, 4,4'-[trans-1,4-cyclohexanebis(methylene)] bisphenol (CMB), was synthesized and fully characterized. Based on 4,4â  -dihydroxy-p-terphenyl (DHTP), 4,4â  -dihydroxybiphenyl (DHBP) and the CMB monomer, homopolymer and random copolymers of PAES were prepared with high molecular weights and high glass transition temperatures. Dynamic mechanical analysis (DMA) on these polymers showed multiple sub-Tg relaxations. A large increase in the ultimate elongation was obtained with the CMB and DHTP containing sample, which could be due to the strong sub-Tg relaxations observed from the DMA results. A series of four acid chloride monomers were synthesized and polymerized with phenol terminated PAES oligomers. Solution polymerization and pseudo-interfacial polymerization techniques were used to prepare both bisphenol-A (bis-A) based and DHBP based PAES oligomers. With the incorporation of the trans-1,4-cyclohexylene units, decreases in the glass transition temperatures were observed from both the bis-A based and the DHBP based polymers. However, melting transitions were only observed in the DHBP based trans-1,4-cyclohexylene containing PAESs. Crystallinity was confirmed by differential scanning calorimetry (DSC) and wide angle X-ray diffraction (WAXD). A mechanical property study of the high molecular weight trans-1,4-cyclohexylene containing polymer samples showed moderate ultimate elongation enhancements.  A series of PAES-polyester multiblock copolymers were synthesized with both solution method and melt polymerization. In the solution method, phenol terminated PAES oligomers and the acid chloride terminated poly(1,4-cyclohexylenedimethylene terephthalate) (PCT) oligomers were presynthesized and coupled in solution. The molecular weights of the polymer products obtained from the solution method were limited by solubility issues. Melt phase polymerization was employed to obtain high molecular weight polymers. Hydroxy ethoxy terminated PAES oligomers were synthesized and polymerized with 1,4-cyclohexanedimethanol (CHDM) and dimethyl terephthalate (DMT) in the melt. Polymers with high molecular weights were obtained. Tensile test results suggested that the mechanical properties of these polymers were dominated by the PAES components with polyester contents up to 20 wt%. Melting transitions were observed from polymers with higher polyester contents, and these polymers exhibited limited solubility in common organic solvents.",
  "description_provenance": [
    "Author Email: zhangb81@vt.edu",
    "Advisor Email: srturner@vt.edu",
    "Advisor Email: pdeck@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: hmarand@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Made available in DSpace on 2014-03-14T20:06:55Z (GMT). No. of bitstreams: 1 Zhang_B_D_20120308.pdf: 4176135 bytes, checksum: 8f80bd9fc581fb44bb7825e91b022098 (MD5)   Previous issue date: 2012-01-13"
  ],
  "handle": "26042",
  "identifier_other": "etd-01252012-185606",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01252012-185606/",
  "identifier_uri": "http://hdl.handle.net/10919/26042",
  "publisher": "Virginia Tech",
  "relation_haspart": "Zhang_B_D_20120308.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "poly(arylene ether sulfone)s",
    "trans-1ï¼ 4-cyclohexylene ring",
    "polysulfone-polyester",
    "multiblock copolymers",
    "relaxation",
    "mechanical properties",
    "structure-property relationship"
  ],
  "title": "Synthesis and Characterization of trans-1,4-Cyclohexylene Ring Containing Poly(arylene ether sulfone)s",
  "type": "Dissertation"
}