{
  "contributor_author": "Kim, Kibum",
  "contributor_committeechair": "Tatar, Deborah Gail",
  "contributor_committeemember": [
    "Patton, Charles M.",
    "Harrison, Steven R.",
    "Quek, Francis K. H.",
    "Pérez-Quiñones, Manuel A."
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2014-03-14T20:06:56Z",
  "date_adate": "2007-02-27",
  "date_available": "2014-03-14T20:06:56Z",
  "date_issued": "2007-01-12",
  "date_rdate": "2007-02-27",
  "date_sdate": "2007-01-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Constructing common ground and the associated convergent conceptual change is critical to cooperative work and learning. Convergent conceptual change is achieved as participants in a conversation update common ground through presentations, repairs, and acceptances of utterances. People employ available techniques that utilize the least collaborative effort for current purposes. Although sharing physical co-presence of interlocutors' facial expressions doesn't make grounding more efficient even in more open-ended and less task-focused dialogues, visual co-presence of the addressee's workspace is essential to work-related tasks, such as information transmission and collaborative problem-solving. However, handheld-mediated collaborative activity makes sharing the workspace challenging, especially when we consider that handhelds possess small screens and permit activities of a distributed nature. In a handheld-mediated classroom, a teacher must be able to check students' work for various reasons (e.g., grading, checking whether they are following directions correctly or paying attention) and at various phases of the activity. Gazing into the small screen of a handheld over someone's shoulder is a tricky task at best. The teacher may misread the information on the screen and thus provide incorrect feedback. Another challenge involves the difficulty inherent in latecomers joining the collaborative activity when each student is involved with his or her individual and small screen. This exclusion from joining on-going activity can reduce the chance of student's vicarious and serendipitous learning. Although such events may occur naturally in the learning environment, they become important concerns when one attempts to focus collaborative activities with handheld devices. I therefore created a new handheld network service called \"Look,\" which is designed to facilitate the acquisition of common ground and allow a latecomer to do meaningful monitoring of ongoing conversation about the workspace. I tested empirically the value of this shared physical/virtual context in the task of creating common ground by examining task performance and conversation quality.",
  "description_provenance": [
    "Author Email: kikim@vt.edu",
    "Advisor Email: charles.patton@sri.com",
    "Advisor Email: srh@cs.vt.edu",
    "Advisor Email: tatar@cs.vt.edu",
    "Advisor Email: quek@cs.vt.edu",
    "Advisor Email: perez@cs.vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:56Z (GMT). No. of bitstreams: 2 irb_approval_letter.PDF: 350176 bytes, checksum: 0f29355f3d1216fb9e06382c3cc79900 (MD5) Kibum_Kim_Dissertation.pdf: 1242516 bytes, checksum: af5011f658b6273e5e93932177aab1c9 (MD5)   Previous issue date: 2007-01-12"
  ],
  "handle": "26047",
  "identifier_other": "etd-01262007-233627",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01262007-233627/",
  "identifier_uri": "http://hdl.handle.net/10919/26047",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "irb_approval_letter.PDF",
    "Kibum_Kim_Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Human-Computer Interaction",
    "Computer-Supported Cooperative Work",
    "Handheld Devices",
    "Computer-Supported Collaborative Learning",
    "Ubiquitous and Pervasive Computing"
  ],
  "title": "THE EFFECTS OF HANDHELD NETWORK SERVICE \"LOOK\" ON THE ACQUISITION OF COMMON GROUND",
  "type": "Dissertation"
}