{
  "contributor_author": "Parker, Scott Landsborough",
  "contributor_committeechair": "Andrews, Robin M.",
  "contributor_committeemember": [
    "Jenssen, Thomas A.",
    "McNabb, F. M. Anne",
    "Jones, Robert H.",
    "Denbow, Donald Michael"
  ],
  "contributor_department": "Biological Sciences",
  "date_accessioned": "2014-03-14T20:06:57Z",
  "date_adate": "2006-02-16",
  "date_available": "2014-03-14T20:06:57Z",
  "date_issued": "2006-01-16",
  "date_rdate": "2008-02-16",
  "date_sdate": "2006-01-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to evaluate putative physiological and ecological constraints on the evolution of viviparity in sceloporine lizards. In Chapters one and two, I investigated the role of in utero oxygen availability as a constraint on the capacity to support embryonic development during extended egg retention. I incubated eggs of sceloporine lizards under conditions that simulated retention in the oviduct under a range of oxygen partial pressures. In Chapter one, I tested the hypothesis that embryos of the oviparous lizard Sceloporus undulatus from a high-latitude population are laid at more advanced developmental stages and have a higher developmental rate at low partial pressure oxygen (pO2) under simulated in utero conditions than embryos from a low-latitude population. This hypothesis was rejected; embryos from the two populations did not differ in embryonic stage at oviposition or developmental rate when incubated under simulated in utero conditions at low pO2. In Chapter two I tested the hypothesis that the degree of embryonic development attained by reptilian embryos in utero is directly related to in utero pO2. The species chosen for the study differed in their capacity to support embryonic development during egg retention and were characterized by developmental arrest (Urosaurus ornatus), retarded development (Sceloporus virgatus), and normal development (Sceloporus scalaris) when eggs are retained past the normal time of oviposition. The estimated in utero pO2â  s for the three species increased in the order of U. ornatus (5-6 kPa) < S. virgatus (9-11 kPa) < S. scalaris (> 11 kPa). These results indicate that in utero oxygen availability is associated with interspecifc differences in the capacity to support embryonic development during extended egg retention.   In Chapter three I tested the hypothesis that embryo thermal requirements determine the northern distributional limit of Sceloporus undulatus. I incubated eggs of S. undulatus under temperature treatments that simulated the thermal environment that eggs would experience if located in nests within their geographic range at 37 Â°N and at latitudes north of the species present geographic range at 42 and 44 Â°N. Incubation temperatures simulating nests at 44 Â°N prolonged incubation and resulted in hatchlings with shorter tails, shorter hind limb span, slower growth and lower survival than hatchlings from eggs incubated at temperatures simulating nests at 37 and 42 Â°N. I also predicted that the northernmost distributional limit of S. undulatus would be associated with locations that provide the minimum heat sum (degree-days) required to complete embryonic development. Eighty-four percent of location between 37-40 Â°N had > 495 degree-days above a threshold of 17 Â°C accumulated during June-September compared to eleven percent of locations between 41-50 Â°N. These results are consistent with the hypothesis that incubation temperature is an important factor limiting the geographic distributions of oviparous reptile species at high latitudes and high elevations.",
  "description_provenance": [
    "Author Email: sparker@vt.edu",
    "Advisor Email: tjenssen@vt.edu",
    "Advisor Email: happy@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: randrews@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:57Z (GMT). No. of bitstreams: 1 Dissertation13Feb06.pdf: 371075 bytes, checksum: 66f157f49e43f0d1969c3c52242d231a (MD5)   Previous issue date: 2006-01-16"
  ],
  "handle": "26050",
  "identifier_other": "etd-01272006-203908",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01272006-203908/",
  "identifier_uri": "http://hdl.handle.net/10919/26050",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation13Feb06.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Cold Climate Hypothesis",
    "Sceloporus",
    "Physiological Constraints",
    "Evolution",
    "Squamate Reptiles",
    "Distributional Limits"
  ],
  "title": "Physiological and Ecological Constraints on the Evolution of Viviparity in Sceloporine Lizards",
  "type": "Dissertation"
}