{
  "contributor_author": "Gomez Jaramillo, Marcelo A",
  "contributor_committeechair": "Jones, Jeryl C.",
  "contributor_committeemember": [
    "Freeman, Larry E.",
    "Lanz, Otto I.",
    "Broadstone, Richard V.",
    "Inzana, Karen D."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:06:57Z",
  "date_adate": "2005-02-04",
  "date_available": "2014-03-14T20:06:57Z",
  "date_issued": "2005-01-14",
  "date_rdate": "2006-02-04",
  "date_sdate": "2005-01-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The internal vertebral venous plexus (IVVP) is an extensive vascular network recently implicated in various human and canine spinal disorders. Nevertheless, little recent information is available regarding normal anatomy of canine IVVP and its role in acute spinal injuries. The objectives of the study were; (1) to describe the normal IVVP morphology in the canine cervical region using transverse anatomy sections and computed tomography (CT), (2) to develop a technique for CT examination of the IVVP in vivo, (3) to analyze the quantitative characteristics of the IVVP, and (4) to assess the effect of acute experimental spinal cord compression on IVVP morphology. In the first experiment, CT of the cervical vertebral canal was performed in 6, normal, adult mixed-breed dogs. After dogs were euthanized, a gelatin and iothalamate mixture was injected into the right external jugular vein. Cadavers were then frozen to â  8oC, sliced into transverse sections, and compared with CT images. Vascular components such as the IVVP, interarcuate veins, intervertebral veins, and vertebral veins were accurately depicted on CT images. In the second experiment, CT venography was performed using a biphasic IV injection of iodinated contrast medium.  Dimensions of the IVVP and other vertebral canal components were calculated for the C3-C7 vertebral region. Sagittal diameters of the IVVP ranged from 0.6 mm to 3.2 mm. The IVVP area occupied 30.61% of the cervical vertebral epidural space area. When C3-C7 segments were considered as a group, IVVP area dimensions were significantly correlated (r > 0.7, p < 0.0001) with vertebral canal area and dural sac area. In the last experiment, acute spinal cord compression (ASCC) was induced and maintained for 10 minutes using an angioplasty balloon catheter device over the C3/4 vertebral region in 6 dogs. Dogs were evaluated prior to, during, and after compression using digital subtraction venography (DSV) and CT venography. Results showed that ASCC produced a significant change in diameter of the IVVP at the site of compression. This effect persisted during the post-compression period. In conclusion, findings indicate that CT venography and DSV accurately depict the IVVP in dogs, and that significant changes of the IVVP morphology occur under ASCC conditions.",
  "description_provenance": [
    "Author Email: mgomez@vt.edu",
    "Advisor Email: lfreeman@vt.edu",
    "Advisor Email: jcjones@vt.edu",
    "Advisor Email: olanz@vt.edu",
    "Advisor Email: broadstr@vt.edu",
    "Advisor Email: kdyer@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:57Z (GMT). No. of bitstreams: 1 gomezdiss012805.pdf: 4398513 bytes, checksum: 5641f5ee4f683eaa5e0f4fd694ed8f02 (MD5)   Previous issue date: 2005-01-14"
  ],
  "handle": "26055",
  "identifier_other": "etd-01282005-155017",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01282005-155017/",
  "identifier_uri": "http://hdl.handle.net/10919/26055",
  "publisher": "Virginia Tech",
  "relation_haspart": "gomezdiss012805.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "spinal cord compression",
    "epidural veins",
    "vascular anatomy"
  ],
  "title": "Imaging Studies of the Canine Cervical Vertebral Venous Plexus",
  "type": "Dissertation"
}