{
  "contributor_author": "Zhao, Zunyang",
  "contributor_committeechair": "Knowlton, Katharine F.",
  "contributor_committeemember": [
    "Love, Nancy C.",
    "Ogejo, Jactone Arogo",
    "Harper, Allen F.",
    "McGilliard, Michael L."
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:06:59Z",
  "date_adate": "2008-02-06",
  "date_available": "2014-03-14T20:06:59Z",
  "date_issued": "2008-01-16",
  "date_rdate": "2008-02-06",
  "date_sdate": "2008-01-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract  Three experiments were conducted to 1) develop appropriate methods for livestock manure estrogen analysis; 2) determine estrogen removal in different manure treatment systems; and 3) determine estrogen removal from dairy manure in pilot scale reactors.  In Experiment I, the recoveries of 17Ã -estradiol (E2) and estriol (E3) were evaluated in double distilled water and dairy manure after a base extraction and analysis of estrogens by enzyme-linked immunoassay (ELISA) and yeast estrogen screen (YES) assay. The recoveries of E2 were 104% (ELISA) and 97% (YES) in double distilled water. 112% of E2 and 79% of E3 in flushed dairy manure and 118% of E2 in anaerobic digester effluent were recovered with ELISA. 67% and 140% of E2 in flushed manure and anaerobic digester effluent, respectively, were recovered with YES assay.       In Experiment II, samples were collected from a full-scale manure handling system incorporating separation and aeration (Separation/Aeration), an anaerobic digester receiving dairy manure (Anaerobic Digester), and four conventional dairy and swine manure storages. 70% of E2 (230 vs. 769 Î¼g/cow/day) and 86% of E3 (78 vs. 552 Î¼g/cow/day) mass were removed from the Separation/Aeration system when the effluent was compared to the influent; the ratio of E2 to total estrogenicity (E2-eq) averaged 76%. In the Anaerobic Digester, 38% of E2 (592 vs. 954 Î¼g/cow/day) and 30% of E3 (338 vs. 483 Î¼g/cow/day) mass were removed; E2 contributed more to E2-eq in the influent than in the effluent (43 vs. 26%). There was no significant difference for E2-eq (431 vs. 284 ng/g of total solids) and E2 (248 vs. 73 ng/g of total solids) concentrations between barn and pti in conventional dairy manure storages; E2 contributed more to E2-eq in barn manure than in pit manure (54 vs. 30%). In swine manure storages, both E2-eq (2852 vs. 1551 vs. 148 ng/g of total solids) and E2 (1933 vs. 808 vs. 89 ng/g of total solids) concentrations decreased (barn vs. primary lagoon vs. secondary lagoon; no significance analysis); the change of E2 ratio to E2-eq was not consistent between barn and lagoon manures between farms.   In Experiment III, samples were collected from six pilot scale reactors: two aerated reactors (60% and 100% aeration; AER60 and AER 100), a nitrifying/denitrifying reactor (NDN), an enhanced biological phosphorus removal reactor (EBPR), an anaerobic digester (AD), and a nitrifying reactor (NI) following AD. The influent had higher mass of E2 and E2-eq than the effluent with all reactors. Estrogen removal efficiencies were expressed in two ways: % and %/aerobic hour (or hour) of the influent mass. Higher ammonia nitrogen removing reactors had higher E2 and E2-eq removal in %, higher E2 removal in %/aerobic hour, and the same E2-eq removal in %/aerobic hour compared to those with lower ammonia nitrogen removal. Estrogen removal efficiencies (both in % and %/aerobic hour) were similar in nitrifying and denitrifying reactors. Reactors with aeration supported greater estrogen removal than those without. Reactors with influent anaerobic digestion pretreatment had the same E2 and E2-eq removal in % but higher E2 and E2-eq removal in %/aerobic hour compared to those without.   In conclusion, the aerobic treatment system removed more estrogens than the anaerobic one, which means aerobic conditions support more estrogen degradation than anaerobic conditions. The change of the ratios of E2 to E2-eq varied in different livestock manure treatment systems, which reflected different removal rates of E2 and other estrogenic compounds. The pilot scale reactors significantly removed E2 and E2-eq in dairy manure. Ammonia nitrogen removal rates and aeration are the two main factors influencing E2 and E2-eq removal.",
  "description_provenance": [
    "Author Email: zhaozy@vt.edu",
    "Advisor Email: nglove@umich.edu",
    "Advisor Email: arogo@vt.edu",
    "Advisor Email: alharper@vt.edu",
    "Advisor Email: mcg@vt.edu",
    "Advisor Email: kknowlto@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:59Z (GMT). No. of bitstreams: 1 Zhao.pdf: 568513 bytes, checksum: 9b0d39b606ae377bb44902702b264d89 (MD5)   Previous issue date: 2008-01-16"
  ],
  "handle": "26067",
  "identifier_other": "etd-01292008-164717",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01292008-164717/",
  "identifier_uri": "http://hdl.handle.net/10919/26067",
  "publisher": "Virginia Tech",
  "relation_haspart": "Zhao.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Endocrine disruptors",
    "Estrogens",
    "Livestock manure",
    "Reactor"
  ],
  "title": "Removal of Estrogens at Full and Pilot Scale Livestock Manure Treatment Systems",
  "type": "Dissertation"
}