{
  "contributor_author": "Tankoonsombut, Kriengkrai",
  "contributor_committeecochair": [
    "Kleiner, Brian M.",
    "Koelling, Charles Patrick"
  ],
  "contributor_committeemember": [
    "Blanchard, Benjamin S. Jr.",
    "Kincade, Doris H.",
    "Simis, Peter"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:06:59Z",
  "date_adate": "1999-01-28",
  "date_available": "2014-03-14T20:06:59Z",
  "date_issued": "1998-10-16",
  "date_rdate": "2000-01-28",
  "date_sdate": "1999-01-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Enabled by advanced information technologies, the distributed work environment has become a choice of organizations.  When employees and supervisors work in geographically separate locations, management challenges emerge.  Performance improvement may become an issue.   <p> Performance may be improved by identifying, studying, and improving factors that affect work performance.  Two factorsâ  feedback and goal settingâ  were chosen for this study because of the strong evidence of the effects of these components.  Positive effects of feedback and goal setting are commonly accepted in the literature concerning the traditional work environment. This study focused only on knowledge work because most work in the distributed work environment may be knowledge work.  The purpose of this study was to investigate the effects of feedback and goal setting on knowledge work performance in the distributed work environment.   <p> A laboratory experiment was conducted using 36 student subjects.  The experimental design was a 3 X 2 factorial design consisting of three levels of feedback (i.e., no feedback, task feedback, and task feedback with comparisons with others) and two levels of goal setting (i.e., no goal setting and goal setting).  Subjects were randomly assigned to various combinations of these two variables. <p> The evidence did not outright support the claim that feedback and goal setting improve task performance; task performance of the subjects was improved only under certain conditions.  Task feedback did not improve task performance because of its added pressure, especially in the presence of goals.  Task performance was higher for the subjects who received both task feedback and information about othersâ   performance than for the subjects who received task feedback only.  Overall, feedback was not found to improve task performance. <p> The study did not support the hypothesis that specific and difficult goals improve task performance.  The added pressure of having difficult goals was found to have demotivating effects.  The notion that the co-presence of feedback and goals is necessary to improve task performance was not supported because of the combined pressure that both components created.  The subjects who had feedback and/or goals did not perform better than those who had neither feedback nor goals.",
  "description_provenance": [
    "Author Email: ktankoon@vt.edu",
    "Advisor Email: bsblanch@vt.edu",
    "Advisor Email: kincade@vt.edu",
    "Advisor Email: peters@csufresno.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: koelling@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:59Z (GMT). No. of bitstreams: 1 ETD.pdf: 794052 bytes, checksum: f06622f3808af6bfb7847e96e0851969 (MD5)   Previous issue date: 1998-10-16"
  ],
  "handle": "26062",
  "identifier_other": "etd-012899-140253",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-012899-140253/",
  "identifier_uri": "http://hdl.handle.net/10919/26062",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Virtual Work Environment",
    "Distributed Work Environment",
    "Knowledge Work",
    "Feedback",
    "Performance Measurement",
    "Performance Improvement",
    "Goal Setting"
  ],
  "title": "Investigation of the Effects of Feedback and Goal Setting on Knowledge Work Performance in the Distributed Work Environment",
  "type": "Dissertation"
}