{
  "contributor_author": "Erturk, Hatice Neval",
  "contributor_committeecochair": [
    "Alscher, Ruth G.",
    "Turner, Bruce J."
  ],
  "contributor_committeemember": [
    "Lacy, George H.",
    "Hess, John L.",
    "Bevan, David R.",
    "Winkel, Brenda S. J."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:06:59Z",
  "date_adate": "1999-01-28",
  "date_available": "2014-03-14T20:06:59Z",
  "date_issued": "1998-12-10",
  "date_rdate": "2000-01-28",
  "date_sdate": "1999-01-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "RESPONSES OF SUPEROXIDE DISMUTASES TO OXIDATIVE STRESS IN ARABIDOPSIS THALIANA by Hatice Neval Erturk Ruth Grene Alscher, Chair (PPWS) Department of Biology ABSTRACT Superoxide dismutases (SODs) catalyze the dismutation of superoxide radicals to oxygen and hydrogen peroxide.  Mn SOD is localized in mitochondria, Cu-Zn SOD is in the cytosol and chloroplast, and Fe SOD is in chloroplasts. The effects of a chloroplast-localized oxidative stress, caused by methyl viologen or 3-(3, 4-dichlorphenyl)-1-1â  dimethylurea (DCMU) on SOD populations were investigated.  A cloned Arabidopsis thaliana Fe SOD gene was expressed in Escherichia coli and was purified from transformed cells.   This protein was used to raise antibodies against A. thaliana Fe SOD which in turn were used to quantify the effects of oxidative stress on Fe SOD protein. Effects of oxidative stress on enzyme activity were measured in native gels.  Fe SOD responded to oxidative stress with an increase in activity, but not in antibody reactive protein.  Two novel forms of Fe SOD activity, with faster migration rates in activity gels, were detected.   Mn SOD, a mitochondrial enzyme, responded to the stress with an increase in activity.  In contrast, the activity or amount of Cu-Zn SOD protein did not respond to this oxidative stress. In light of these results, we propose that SODs respond to oxidative stress at the enzyme and gene levels.  Mitochondrial Mn SOD responded to a chloroplast-localized stress with an increase in activity, suggesting either that the site of action for methyl viologen is not exclusively in the chloroplast or that there are other signals among the compartments of the cell.  Fe SOD, but not Cu-Zn SOD responded to stress, suggesting that Fe SOD may be the stress responsive enzyme in this organelle.   Evolutionary relationships among different isoforms were investigated based on the known primary, secondary, and tertiary structures of these isoforms.  The three dimensional structure of A.  thaliana  Fe SOD was modeled by using structures of crystallized E. coli and Pseudomonas ovalis Fe SODs as templates.   Comparison of prokaryotic Fe SOD with eukaryotic isoforms showed that Fe and Mn SODs are structurally homologous, whereas Cu Zn SOD is not.",
  "description_provenance": [
    "Author Email: nerturk@vt.edu",
    "Advisor Email: lacygh@vt.edu",
    "Advisor Email: ralsher@vt.edu",
    "Advisor Email: jlhess@vt.edu",
    "Advisor Email: drbevan@vt.edu",
    "Advisor Email: fishgen@vt.edu",
    "Advisor Email: shirley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:59Z (GMT). No. of bitstreams: 1 etd.pdf: 4956846 bytes, checksum: f6c66924c8e5da1e967ea86020caa84d (MD5)   Previous issue date: 1998-12-10"
  ],
  "handle": "26061",
  "identifier_other": "etd-012899-010205",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-012899-010205/",
  "identifier_uri": "http://hdl.handle.net/10919/26061",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "methyl viologen (paraquat)",
    "oxidative stress",
    "superoxide dismutase",
    "protein structure",
    "Arabidopsis thaliana"
  ],
  "title": "Responses of Superoxide Dismutases to Oxidative Stress in Arabidopsis thaliana",
  "type": "Dissertation"
}