{
  "contributor_author": "Lemus, Roque Wilson",
  "contributor_committeechair": "Parrish, David J.",
  "contributor_committeemember": [
    "Anderson-Cook, Christine M.",
    "Niemiera, Alexander X.",
    "Alley, Marcus M.",
    "Abaye, Azenegashe Ozzie"
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:06:59Z",
  "date_adate": "2004-01-30",
  "date_available": "2014-03-14T20:06:59Z",
  "date_issued": "2004-01-09",
  "date_rdate": "2005-01-30",
  "date_sdate": "2004-01-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Switchgrass (Panicum virgatum L.) has potential as a biofuels feedstock. Major management questions include cultivar selection, cutting management, and optimizing N fertilization.  Four cultivars of switchgrass were evaluated under two cutting regimes at eight locations within KY, NC, TN, VA, and WV in 2000 and 2001.  Harvests were made once (in early November) or twice (midsummer and early November).  Biomass yields averaged 15 Mg ha-1 and ranged from 10 to 22 Mg ha-1 across locations and years.  There was no yield advantage to taking two harvests of the lowland cultivars (â  Alamoâ   and â  Kanlowâ  ).  If harvested twice, the upland cultivars (â  Cave-in-Rockâ   and â  Shelterâ  ) provided yields equivalent to the lowland ecotypes.  A closer look at Alamo revealed much higher N removal in the midsummer harvests, late-season N translocation out of tillers, and fewer tillers developing under one-cut management.  Switchgrass appears to be capable of truly perennial productivity in the upper Southeast USA with 50 kg N ha-1 yr-1 and a single harvest. A second field study was conducted on â  Cave-in-Rockâ   switchgrass at Orange and Blacksburg, VA to examine N dynamics.  For the 3-yr study, N fertilizer was applied once in May 2001 at 0, 90, 180, or 270 kg N ha-1. Switchgrass was harvested once (early November) in 2001 and twice (early July and early November) in 2002 and 2003.  Tissue, root, and soil samples were collected in May, July, September, and November each year.  Nitrogen fertilization had no effect on yield in 2001 and small residual effects in 2002 and 2003.   Higher N removal was observed with two-cut management, where a high-yielding July cut had high shoot N concentrations.  The amount of N removed as biomass from the 0 N treatments over 3 yr was 227 kg N ha-1; obviously significant amounts of N can be made available by these soils without any fertilizer applied.  During the growing season, higher mineral N in soil was observed in July and September, when warmer temperatures increase microbial activity and N mineralization. Nitrogen use efficiency declined with increasing N rates. The low N response could be due to â  nativeâ   N, to microbiological interactions, and/or to the ability of the plants to create internal N reserves.  Proper N management of switchgrass must take into account the dynamics of several N pools. Greenhouse studies were conducted to establish switchgrassâ   responses to N and P under well-defined, soilless conditions and to examine two N sources. Shoot biomass increased with N fertilization with an observed inflection point at 210 kg N ha-1.  In these pot studies, root biomass increased with N only to 115 kg N ha-1. No significant effect of P above 30 kg ha-1 was observed in shoot or root biomass.  Biomass yield and tiller number were highly correlated. Biomass production was two times greater with ammonium sulfate than with urea when each was applied at equivalent N rates.    Taken together, these findings suggest soils in the upper Southeast USA can supply significant amounts of the N needs of switchgrass, especially when harvested once at the end of the season.",
  "description_provenance": [
    "Author Email: rlemus@columbus.rr.com",
    "Advisor Email: dparrish@vt.edu",
    "Advisor Email: candcook@vt.edu",
    "Advisor Email: niemiera@vt.edu",
    "Advisor Email: malley@vt.edu",
    "Advisor Email: cotton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:59Z (GMT). No. of bitstreams: 1 Roque_Lemus_Dissertation.pdf: 5670240 bytes, checksum: 44a22e718b0daeddb2f514e4e8ad97ba (MD5)   Previous issue date: 2004-01-09"
  ],
  "handle": "26064",
  "identifier_other": "etd-01292004-115043",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01292004-115043/",
  "identifier_uri": "http://hdl.handle.net/10919/26064",
  "publisher": "Virginia Tech",
  "relation_haspart": "Roque_Lemus_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mineralization",
    "switchgrass",
    "biomass",
    "volatilization",
    "translocation",
    "nitrogen",
    "efficiency",
    "Panicum virgatum",
    "removal",
    "management"
  ],
  "title": "Switchgrass as an Energy Crop:  Fertilization, Cultivar, and Cutting Management",
  "type": "Dissertation"
}