{
  "contributor_author": "Lu, Ming",
  "contributor_committeechair": "Drew, Donald R.",
  "contributor_committeemember": [
    "Sivanandan, R.",
    "Trani, Antoino A.",
    "Hobeika, Antoine G.",
    "Blanchard, Benjamin S. Jr."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:06:59Z",
  "date_adate": "2008-01-29",
  "date_available": "2014-03-14T20:06:59Z",
  "date_issued": "1996-04-01",
  "date_rdate": "2012-11-06",
  "date_sdate": "2008-01-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objective of this research is to explore a methodology that can be used for testing and evaluating AVCS technologies, and, in particular, automatic headway control models for trucks operating on rural highways. The emphasis is put on the realization of vehicle headway control in the real world highway systems. System dynamics has been selected as the simulation tool for developing, testing and evaluating vehicle headway control models. The following behavior of human driver in a real world highway environment is studied and simulated. An automatic headway control model, Multiple-mode Vehicle Headway Control (MVHC) model, is developed for single lane, cars and trucks mixed flow control in a rural highway system. Using safety and motorist comfort as MOE criteria and the acceleration noise as the index of motorist comfort, some selected automatic headway control models are evaluated. This study demonstrated that simulation affords a means of modeling control processes with various certain and uncertain factors, and therefore, it plays a key role in the development of automatic headway control systems.",
  "description_provenance": [
    "Author Email: none@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:59Z (GMT). No. of bitstreams: 1 LD5655.V856_1996.L8.pdf: 4925231 bytes, checksum: c69e46f0d171112546830c7ba1e467ed (MD5)   Previous issue date: 1996-04-01"
  ],
  "handle": "26066",
  "identifier_other": "etd-01292008-113749",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01292008-113749/",
  "identifier_uri": "http://hdl.handle.net/10919/26066",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1996.L8.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "System Dynamics",
    "evaluation",
    "Longitudinal contrei",
    "Simulation"
  ],
  "subject_lcc": "LD5655.V856 1996.L8",
  "title": "System Dynamics Model for Testing and Evaluating Automatic Headway Control Models for Trucks Operating on Rural Highways",
  "type": "Dissertation"
}