{
  "contributor_author": "Luketic, Christine Dorothy",
  "contributor_committeecochair": [
    "Wolfe, Edward W.",
    "Singh, Kusum"
  ],
  "contributor_committeemember": [
    "Burge, Penny L.",
    "Dolan, Erin L."
  ],
  "contributor_department": "Educational Research and Evaluation",
  "date_accessioned": "2014-03-14T20:06:59Z",
  "date_adate": "2008-04-01",
  "date_available": "2014-03-14T20:06:59Z",
  "date_issued": "2008-01-25",
  "date_rdate": "2009-04-01",
  "date_sdate": "2008-01-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract  Assessing Student Perceptions of High School Science Classroom Environments:  A Validation Study   By  Christine D. Luketic  \tThe purpose of this study was to assess the measures of the Science Laboratory Environment Inventory (SLEI), an existing classroom environment measurement instrument, to provide up-to-date norms and validation evidence for a U.S. secondary school population. This instrumentâ  s measures were established as a means of examining studentsâ   perceptions of their learning environment in science classrooms, and subsequently providing indicators of performance. Pedagogical changes have taken place in the science classroom fostered by the National Science Standards. This study included an examination of the SLEI measures using Mesickâ  s validity framework including an in-depth analysis of the instrumentâ  s content, substance, structure, generalizability and external validity. Rasch measurement theory was employed to investigate specific components of the instrument including item fit, rating scale function, dimensionality and individual performance information.  \tThree hundred and fifty five high school science students completed the SLEI. Structural equation modeling was used to assess the dimensional structure of the measures of the instrument. Analyses revealed that a multi-dimensional model encompassing five distinct factors and excluding negatively worded items best characterized the SLEI measures. Multidimensional measures created by scaling the data to the Multidimensional Random Coefficients Multinomial Logit (Rasch) Model exhibited suitable rating scale structure, item quality, and reliability of separation. \tAnalyses by academic grouping revealed that students in high achieving courses had a more favorable perception of all aspects of their learning environments when compared to students in the regular courses. In addition, student perceptions of the lab were influenced by the extent of studentsâ   experience learning science. To determine whether differences observed by grade level could be attributable to biology learning experience versus experience in school, additional analyses were completed. The analysis revealed that differences in perception were consistent across academic achievement groups as well as experience level by first year and beyond (course level) rather than by grade level. \tThis validation study has provided additional and up-to-date evidence concerning the validity of SLEI measures. Coupled with the existing research revealing positive correlations between student perceptions of their learning environments and their academic achievement, the outcomes reported here provide a foundation for future assessment of the relationship between classroom environment and student achievement.",
  "description_provenance": [
    "Author Email: cluketic@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: edwolfe@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: edolan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:06:59Z (GMT). No. of bitstreams: 15 Chapter2.pdf: 139145 bytes, checksum: cb5206ac819e10d934393b80fd35a85a (MD5) Chapter3.pdf: 224570 bytes, checksum: ca74f67383730c74795d0ff6c8db14ff (MD5) CLChapter4.pdf: 213996 bytes, checksum: 1346200740f575be0a665a28686a50ac (MD5) titlepage2.28.pdf: 33563 bytes, checksum: 95f5398f54e753e1f562c5b2a038aae0 (MD5) Chapter42.pdf: 55808 bytes, checksum: 255d66bb087d2c0ff96f380d522f8543 (MD5) Chapter43.pdf: 51507 bytes, checksum: 0d101902c7b6e60acd7ebe4317f79279 (MD5) Chapter44.pdf: 55604 bytes, checksum: 3f93995876fbce3f262d38489b7abf56 (MD5) Chapter45.pdf: 42583 bytes, checksum: 466bf8ce97fd9777820eeb9c71acb368 (MD5) Chapter46.pdf: 43522 bytes, checksum: f366f0925b0c7463482517d4b1f5019c (MD5) CLChapter5.pdf: 429972 bytes, checksum: f7079a7300be3a8e66e762645cf9fa41 (MD5) References.pdf: 107407 bytes, checksum: 4dfde5d7e0968232435b3b4ffda46437 (MD5) Chapter6.pdf: 89601 bytes, checksum: ba6a0ce59367d51147cd5ca69baba07d (MD5) TOC228.pdf: 107762 bytes, checksum: 041a580e67ad8e5881e174153828409a (MD5) Chapter1.pdf: 84389 bytes, checksum: 43e7904a8a8833c4d9943bf7dcea4bcd (MD5) appendices228.pdf: 185436 bytes, checksum: 7a393e15dfab00cab0ec7bfe49f39966 (MD5)   Previous issue date: 2008-01-25"
  ],
  "handle": "26065",
  "identifier_other": "etd-01292008-110133",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01292008-110133/",
  "identifier_uri": "http://hdl.handle.net/10919/26065",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter2.pdf",
    "Chapter3.pdf",
    "CLChapter4.pdf",
    "titlepage2.28.pdf",
    "Chapter42.pdf",
    "Chapter43.pdf",
    "Chapter44.pdf",
    "Chapter45.pdf",
    "Chapter46.pdf",
    "CLChapter5.pdf",
    "References.pdf",
    "Chapter6.pdf",
    "TOC228.pdf",
    "Chapter1.pdf",
    "appendices228.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "High School Science",
    "Science Laboratory",
    "Learning Environments",
    "Measurement",
    "Rasch",
    "Structural Equation Modeling"
  ],
  "title": "Assessing Student Perceptions of High School Science Classroom Environments: A Validation Study",
  "type": "Dissertation"
}