{
  "contributor_author": "Manjooran, Navin Jose",
  "contributor_committeechair": "Pickrell, Gary R.",
  "contributor_committeemember": [
    "Yang, Zhaomin",
    "Corcoran, Sean Gerald",
    "Clark, David E."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:07:02Z",
  "date_adate": "2007-02-02",
  "date_available": "2014-03-14T20:07:02Z",
  "date_issued": "2007-01-23",
  "date_rdate": "2010-02-02",
  "date_sdate": "2007-01-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Although enormous potential benefits are envisioned with the application of nanotechnology in conjunction with biological systems, interactions of nano particulate materials with biological materials is not well understood.   The focus of this dissertation is to determine the mathematical relationships of the forces between nanoparticles and biological agents. The systems under investigation are the alpha-SiC/H2O/LGG polar based systems. The mathematical analysis for the surface forces, based on the attractive van der Waals forces for the alpha-SiC/H2O/alpha-SiC and alpha-SiC/H2O/LGG polar solvent based systems are presented and discussed. The rheological parameters including pH, zeta potential, shear rate, shear stress and viscosity that alter the dispersion mechanisms are also presented and discussed. The concurrence of the experimental analysis with the mathematical modeling is also presented.  The rheological analysis in these systems for determining of the optimum amounts of dispersant, binder, plasticizer and solids loading using the Krieger-Dougherty fit and Liuâ  s model are presented and discussed. Alpha-SiC/H2O/alpha-SiC and alpha-SiC/H2O/LGG polar solvent based samples were also fabricated to test for an application area of nano-bio technology: A novel nano and micro porous materials fabrication process. Porous materials are used for a variety of applications including insulation, filtration, catalytic substrates, textiles and consumer goods and accounts for billions of dollars in sales annually. Results from the alpha-SiC/H2O/alpha-SiC and alpha-SiC/H2O/LGG polar solvent based slip and freeze cast samples and their characterization using digital and electron microscopy are presented and discussed.  Finally, the green and sintered density, porosity and strength of the alpha-SiC/H2O/alpha-SiC and alpha-SiC/H2O/LGG polar solvent based dispersion samples are determined and discussed.",
  "description_provenance": [
    "Author Email: jose@vt.edu",
    "Advisor Email: zmyang@vt.edu",
    "Advisor Email: sgc@vt.edu",
    "Advisor Email: dclark@vt.edu",
    "Advisor Email: pickrell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:02Z (GMT). No. of bitstreams: 1 NavinManjooran.pdf: 22156287 bytes, checksum: bfa56daa035e4c45ae160eab8d5ea39e (MD5)   Previous issue date: 2007-01-23"
  ],
  "handle": "26079",
  "identifier_other": "etd-01312007-135910",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01312007-135910/",
  "identifier_uri": "http://hdl.handle.net/10919/26079",
  "publisher": "Virginia Tech",
  "relation_haspart": "NavinManjooran.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Electron Microscopy",
    "Shear Stress",
    "Zeta Potential",
    "Dispersant",
    "Solids Loading",
    "Dispersion",
    "Viscosity",
    "Rheology",
    "Surface Forces"
  ],
  "title": "Van Der Waals Interactions Based Rheological Analysis for Electrosterically Stabilized Nano-Sized Alpha Silicon Carbide-Lactobacillus Gg Dispersions",
  "type": "Dissertation"
}