{
  "contributor_author": "Kyureghian, Hrachya Henrik",
  "contributor_committeecochair": [
    "Gilles, Robert P.",
    "Haller, Hans H."
  ],
  "contributor_committeemember": [
    "Stegeman, Mark",
    "Kats, Amoz",
    "Lutz, Nancy A."
  ],
  "contributor_department": "Economics (Arts and Sciences)",
  "date_accessioned": "2014-03-14T20:07:02Z",
  "date_adate": "2000-02-17",
  "date_available": "2014-03-14T20:07:02Z",
  "date_issued": "2000-01-28",
  "date_rdate": "2001-02-17",
  "date_sdate": "2000-01-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Chapter 2 deals with a linear city model à la Hotelling where the two firms share linear transport costs with their customers. Mill pricing and uniform delivery pricing are special limiting cases. We characterize the conditions for the existence of a pure strategy equilibrium in the two-stage location-price game. These enable us to identify the causes for non-existence in the two limiting cases. We solve for the equilibrium of a location game between the duopolists with an exogenously given price. When the two firms are constrained to locate at the same central spot, we show the nonexistence of pure strategy equilibria, conjecture the existence of mixed strategy equilibria, and show that any such possible equilibria will always yield positive expected profits. \t Chapter 3 provides simulations as well as theoretical analysis of potential spatial separation of heterogeneous agents operating on a two-dimensional grid space that represents a city. Heterogeneity refers to a characteristic which is also a determinant of individual valuation of land. We study spatial separation with respect to the distinguishing characteristic and investigate the details of emerging spatial patterns. Simulations suggest that the process of interaction with little trade friction goes through stages which resemble its end-state with high trade friction. Several theoretical examples exhibit a distinguishing characteristic upon which the simulations are based. They reflect some of the causes for spatial separation. Examples for the absence of spatial separation are also given. \t In Chapter 4 simulations, in addition to some theory, are used to investigate certain aspects of a city formation process. The model assumes two types of economic agents, workers and employers, operating on a two-dimensional grid. The agents have simple preferences, positive for the opposite type and negative for the own type in the own location. In addition, they have positive or negative preference for agglomeration in the own location. The model helps build intuition about a potentially important factor for agglomeration formation, namely, the disparity between entrepreneurial and technical skills in localities. We also determine the minimum level of positive preference for agglomeration that leads to agglomeration formation.",
  "description_provenance": [
    "Author Email: hkyuregh@vt.edu",
    "Advisor Email: stegeman@vt.edu",
    "Advisor Email: rgilles@vt.edu",
    "Advisor Email: haller@vt.edu",
    "Advisor Email: amoz@vt.edu",
    "Advisor Email: nlutz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:02Z (GMT). No. of bitstreams: 1 AllFiles.pdf: 1654808 bytes, checksum: 8a0992e553b3b62eb59fb57962d3860d (MD5)   Previous issue date: 2000-01-28"
  ],
  "handle": "26077",
  "identifier_other": "etd-01312000-04460048",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01312000-04460048/",
  "identifier_uri": "http://hdl.handle.net/10919/26077",
  "publisher": "Virginia Tech",
  "relation_haspart": "AllFiles.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Self-Reinforcement",
    "Linear City",
    "Automata",
    "Hotelling",
    "Agglomeration",
    "City Formation",
    "Simulations"
  ],
  "title": "Theory and Simulations in Spatial Economics",
  "type": "Dissertation"
}