{
  "contributor_author": "Meehan, Christopher Lee",
  "contributor_committeechair": "Duncan, James Michael",
  "contributor_committeemember": [
    "Brandon, Thomas L.",
    "Gutierrez, Marte S.",
    "Kapania, Rakesh K.",
    "Martin, James R. II"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:07:01Z",
  "date_adate": "2006-02-08",
  "date_available": "2014-03-14T20:07:01Z",
  "date_issued": "2006-01-25",
  "date_rdate": "2006-02-08",
  "date_sdate": "2006-01-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "When a clay soil is sheared, clay particles along the shear plane become aligned in the direction of shear, forming â  slickensidedâ   surfaces.  Slickensided surfaces are often observed along the sliding plane in field landslides.  Because the clay particles along a slickensided surface are already aligned in the direction of shear, the available shear resistance is significantly less than that of the surrounding soil.       During an earthquake, ground shaking often causes landslide movement.  For existing landslides or repaired landslides that contain slickensided rupture surfaces, it is reasonable to expect that the movement will occur along the existing slickensided surfaces, because they are weaker than the surrounding soil.  The amount of movement that occurs is controlled by the dynamic resistance that can be mobilized along the slickensided surfaces.   The objective of this study was to investigate, through laboratory strength tests and centrifuge model tests, the shearing resistance that can be mobilized on slickensided rupture surfaces in clay slopes during earthquakes.  A method was developed for preparing slickensided rupture surfaces in the laboratory, and a series of ring shear tests, direct shear tests, and triaxial tests was conducted to study the static and cyclic shear resistance of slickensided surfaces.  Two dynamic centrifuge tests were also performed to study the dynamic shear behavior of slickensided clay slopes.  Newmarkâ  s method was used to back-calculate cyclic strengths from the centrifuge data.    Test results show that the cyclic shear resistance that can be mobilized along slickensided surfaces is higher than the drained shear resistance that is applicable for static loading conditions.  These results, coupled with a review of existing literature, provide justification for using cyclic strengths that are at least 20% larger than the drained residual shear strength for analyses of seismic stability of slickensided clay slopes.  This represents a departure from the current state of practice, which is to use the drained residual shear strength as a â  first-order approximation of the residual strength friction angle under undrained and rapid loading conditionsâ     (Blake et al., 2002).",
  "description_provenance": [
    "Author Email: cmeehan@vt.edu",
    "Advisor Email: jmd@vt.edu",
    "Advisor Email: tbrandon@vt.edu",
    "Advisor Email: magutier@vt.edu",
    "Advisor Email: rkapania@vt.edu",
    "Advisor Email: jrm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:01Z (GMT). No. of bitstreams: 16 04_Chapter_3.pdf: 87251 bytes, checksum: e50858db7bf570d4add4c363e64ceac6 (MD5) 05_Chapter_4.pdf: 290028 bytes, checksum: 97bc66f175b8f42b6916a103064c3963 (MD5) 11_References.pdf: 107077 bytes, checksum: fe0c1687cc28969b613de51d72cef3ae (MD5) 01_Front_Pages.pdf: 102090 bytes, checksum: 9110a49119bc5dbcf8698dbe1429f9f6 (MD5) 02_Chapter_1.pdf: 87760 bytes, checksum: 1a495a253642f4eb9fa464ba248688e1 (MD5) 12_Appendix_A.pdf: 5710821 bytes, checksum: 1c4a227f80ee0f34ce7b554d0be2faf9 (MD5) 06_Chapter_5.pdf: 934089 bytes, checksum: 679b495fd637ba6b7264bf4fc2459bd9 (MD5) 07_Chapter_6.pdf: 1239850 bytes, checksum: 83f2d0927d01a213594a0f6a5a0729d0 (MD5) 08_Chapter_7.pdf: 197689 bytes, checksum: 8c14e78d95df0115e3d87a12b7113c87 (MD5) 09_Chapter_8.pdf: 118853 bytes, checksum: 032b1e922ec484ac76afc9b61fae6ef2 (MD5) 10_Chapter_9.pdf: 118703 bytes, checksum: 5a8bf111f47902f51cff5b8d3b00193d (MD5) 13_Appendix_B.pdf: 8557577 bytes, checksum: e3170d7696b79fef21f8c76e9d5265b6 (MD5) 03_Chapter_2.pdf: 675696 bytes, checksum: 8b9085003001f9bf17c64334f5efbd1a (MD5) 14_Appendix_C.pdf: 241852 bytes, checksum: 2b233a558605ff72b1ec17e73f9b4c33 (MD5) 15_Vita.pdf: 51202 bytes, checksum: eea55be070e68eb90a6859510048ed6f (MD5) 00_Addendum.pdf: 6562 bytes, checksum: 5e7335a8b12aa3836b07db0a23119758 (MD5)   Previous issue date: 2006-01-25"
  ],
  "handle": "26074",
  "identifier_other": "etd-01302006-101603",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01302006-101603/",
  "identifier_uri": "http://hdl.handle.net/10919/26074",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "04_Chapter_3.pdf",
    "05_Chapter_4.pdf",
    "11_References.pdf",
    "01_Front_Pages.pdf",
    "02_Chapter_1.pdf",
    "12_Appendix_A.pdf",
    "06_Chapter_5.pdf",
    "07_Chapter_6.pdf",
    "08_Chapter_7.pdf",
    "09_Chapter_8.pdf",
    "10_Chapter_9.pdf",
    "13_Appendix_B.pdf",
    "03_Chapter_2.pdf",
    "14_Appendix_C.pdf",
    "15_Vita.pdf",
    "00_Addendum.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Earthquakes",
    "Cyclic Loading",
    "Shear Strength",
    "Residual Strength",
    "Clay",
    "Slope Stability"
  ],
  "title": "An Experimental Study of the Dynamic Behavior of Slickensided Surfaces",
  "type": "Dissertation"
}