{
  "contributor_author": "Goldsby, Michael G.",
  "contributor_committeechair": "Shepard, Jon M.",
  "contributor_committeemember": [
    "Christman, John P.",
    "Wokutch, Richard E.",
    "Stephens, Carroll U.",
    "Bishop, James W."
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:07:00Z",
  "date_adate": "1999-02-05",
  "date_available": "2014-03-14T20:07:00Z",
  "date_issued": "1998-09-03",
  "date_rdate": "1999-02-05",
  "date_sdate": "1999-01-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Bureaucracy is being seriously challenged today by other organizational designs because its rigidity is being viewed as a detriment to organizational survival in the hypercompetitive marketplace of global business.  Standardization, homogeneity, and hierarchy are not conducive to meeting the changing demands of a turbulent business environment.  As a result, new organization forms based on flexibility and adaptibility are gaining prominence in the business literature and in managerial practice.  The purpose of this study was to provide an empirically-based examination of how employees are responding to these new organization forms.  Three hypotheses were generated concerning the impact of the new organization forms on employee alienation, and the role of ideology as a moderating variable between the new organization forms and alienation.  I predicted that employees working in new organization forms with an orientation toward communitarianism would be more alienated than employees who were more inclined toward the ideology of individualism.  While my hypotheses were not supported, hindsight suggests an alternative hypothesis for further study:  Employees with differing ideological dispositions can both prosper in the postindustrial workplace as long as elements of the traditional economic compact are in place.",
  "description_provenance": [
    "Author Email: mgoldsby.ucs@smtp.usi.edu,gold@tima.com,mgoldsby@vt.edu",
    "Advisor Email: jshepard@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:00Z (GMT). No. of bitstreams: 1 VTETD5.PDF: 249089 bytes, checksum: 8e63dda6dbe4cd6a73c1bc676bf76f7d (MD5)   Previous issue date: 1998-09-03"
  ],
  "handle": "26070",
  "identifier_other": "etd-012999-034835",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-012999-034835/",
  "identifier_uri": "http://hdl.handle.net/10919/26070",
  "publisher": "Virginia Tech",
  "relation_haspart": "VTETD5.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "individualism",
    "communitarianism",
    "alienation",
    "ideology",
    "new organization forms"
  ],
  "title": "New Organization Forms:  An Examination of Alienation and Ideology in the Postindustrial Workplace",
  "type": "Dissertation"
}