{
  "contributor_author": "Vartenisian, John Paul",
  "contributor_committeecochair": [
    "Fortune, Jimmie C.",
    "Gillespie, Diane Newkirk"
  ],
  "contributor_committeemember": [
    "Abouzeid, Mary P.",
    "Earthman, Glen I.",
    "Carlton, Patrick W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:00Z",
  "date_adate": "1999-03-03",
  "date_available": "2014-03-14T20:07:00Z",
  "date_issued": "1998-12-15",
  "date_rdate": "1999-03-03",
  "date_sdate": "1999-01-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "(ABSTRACT) This study is a retrospective examination of elements that influenced one elementary school staff to initiate and implement a school-wide innovation in their reading program in 1990-91. This school served 315 preschool children through grade three in small town set in the rural countryside. Case study methodology was used to discover how the change was initiated; why the particular program elements were chosen; the role of the staff, the principal, and the parents played in initiating the innovation; and what lessons this schoolâ  s experience may have for school reform. As the school community planned for the initiation of their new reading program, the â  whole languageâ   approach to reading was gaining momentum. The notion of â  early interventionâ   was popularly used to describe a variety of methods educators were using to deal with evidence of reading failure in young children. Their stories describe the challenges this school staff felt as they attempted a year-long initiative to merge phonics and whole language into a holistic approach to reading for grades one through three. Findings were reported around seven central themes emerging from the data collection, including: 1) empowerment, 2) academic improvement, 3) shared vision/beliefs, 4) collaboration, 5) focus on childrenâ  s needs, 6) site-based decision making, 7) participatory leadership.",
  "description_provenance": [
    "Author Email: jvarteni@neocomm.net",
    "Made available in DSpace on 2014-03-14T20:07:00Z (GMT). No. of bitstreams: 1 VARTENISIAN.PDF: 223143 bytes, checksum: 7897f9482c2ae8db3bceffb17effb4d8 (MD5)   Previous issue date: 1998-12-15"
  ],
  "handle": "26071",
  "identifier_other": "etd-012999-133354",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-012999-133354/",
  "identifier_uri": "http://hdl.handle.net/10919/26071",
  "publisher": "Virginia Tech",
  "relation_haspart": "VARTENISIAN.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "School change",
    "innovation change",
    "empowerment",
    "collaboration"
  ],
  "title": "An Elementary School Speaks Out: Their Decision To Initiate An Innovation",
  "type": "Dissertation"
}