{
  "contributor_author": "White, Jeremy Jason",
  "contributor_committeechair": "Sutphin, H. Dean",
  "contributor_committeemember": [
    "Palmieri, James",
    "Redican, Kerry J.",
    "Price, William T. Jr."
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:07:02Z",
  "date_adate": "2009-03-05",
  "date_available": "2014-03-14T20:07:02Z",
  "date_issued": "2009-01-26",
  "date_rdate": "2009-03-05",
  "date_sdate": "2009-01-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Skin infections by the ectoparasitic mite Sarcoptes scabiei are a preventable source of morbidity worldwide.  While scabies affects all socioeconomic sectors, it is especially prominent in the developing world where crowding, poor hygiene, and limited access to basic health care are commonplace.  Mass eradication efforts of this parasite have historically been hampered by delivery and compliance issues surrounding topical standards of care. There have been advances in eradication over the last decade due to the expanded use of oral Ivermectin for the treatment and prevention of ectoparasites such as scabies.  Previous research focused on various treatment aspects of the disease, yet most identified the need for basic scabies health education to accompany future studies to improve program sustainability and the overall health literacy of target populations. <p> The Virginia College of Osteopathic Medicine sponsors a public health clinic in Veron, Dominican Republic that reports a high prevalence of scabies infections among its general patient population.  The lack of any means of direct measurement, proper intervention, or control raises concerns that long-term infection may lead to multiple other secondary disease sequelae.  The Veron Scabies Eradication and Education Program was designed to address this deficiency and build on previous studies related to this problem by using a novel treatment and education protocol. <p> The purpose of this research was to identify, treat, and prevent primary and secondary health problems due to long-term scabies infection in the community of Barrio Nuevo, Veron, Dominican Republic in order to provide long-term sustainable eradication through a researcher-designed health education program and medical service protocol.  Participants continued typical daily life while interventions and education were monitored to detect change over a 9-month timeline using selected measurement intervals to test multiple scabies disease and knowledge objectives and related hypotheses. <p> Following this basic protocol, the following scabies markers were evaluated at baseline: subject demographics, scabies diagnosis and treatment history, baseline treatments and reported side effects, and scabies education pre-test results.  The following scabies markers were also assessed at baseline and reassessed at 2 weeks, 1 month, 2 months, 8 months, and 9 months: risk and prevention behaviors, symptomatology, skin exam findings, and scabies education post-test results.  There was a statistically significant post-intervention improvement in scabies markers when compared to pre-intervention values (p<0.05). <p> This study demonstrated that a community scabies program involving large-scale treatment and education can provide rapid and long lasting improvements to the health of a highly endemic population. Community-wide scabies eradication is possible with the appropriate level of structure and support using low cost medication available to the health care system that serves Veron, Dominican Republic.  Given the efficacy and safety profile of Ivermectin demonstrated in this study and substantiated by others, it is recommended that the Dominican Republic Ministry of Health consider adopting Ivermectin as the standard of care for scabies treatments and enforce an existing formal ban on Lindane products.  The protocol from this research should be considered for adoption to provide a sustainable, practical, self-sufficient model for improved health outcomes, health behaviors, and health literacy.  Future studies should replicate this research to determine validation in other settings, cultures and situations, build on the findings by exploring additional variables related to environmental risk factors, and continue to develop interventions that promote health education and enhance clinical practices.",
  "description_provenance": [
    "Author Email: jeremyjason@gmail.com",
    "Advisor Email: dsutphin@vcom.vt.edu",
    "Advisor Email: jpalmieri@vcom.vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: wprice@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:02Z (GMT). No. of bitstreams: 1 White_Jeremy_Dissertation.pdf: 8071692 bytes, checksum: 3431dcd7e44111d3a9e6a995e1a4dbf3 (MD5)   Previous issue date: 2009-01-26"
  ],
  "handle": "26076",
  "identifier_other": "etd-01302009-094512",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01302009-094512/",
  "identifier_uri": "http://hdl.handle.net/10919/26076",
  "publisher": "Virginia Tech",
  "relation_haspart": "White_Jeremy_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Permethrin",
    "Ivermectin",
    "scabies",
    "Dominican Republic",
    "education",
    "eradication"
  ],
  "title": "The Veron Community Scabies Education and Eradication Program",
  "type": "Dissertation"
}