{
  "contributor_author": "Pioli, Mark",
  "contributor_committeechair": "Hughes, Michael D.",
  "contributor_committeemember": [
    "Edwards, John N.",
    "Snizek, William E."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:07:03Z",
  "date_adate": "1997-05-05",
  "date_available": "2014-03-14T20:07:03Z",
  "date_issued": "1997-05-05",
  "date_rdate": "1998-05-05",
  "date_sdate": "1998-07-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Master of Science",
  "description_abstract": "This study examines the relationship between premarital  cohabitation and egalitarianism in marriage using data from  the two waves of the National Survey of Families and  Households (N = 13,017). Multiple regression and path  analysis techniques are used to test this effect.  Cohabitation is viewed as an experience in which patterns  of behavior and attitudes are formed that influence later  marriages. It is hypothesized that this experience leads to a  more egalitarian household division of labor and less  traditional gender ideologies among married individuals  who cohabited premaritally, as compared to those that did  not. Path models test the extent to which cohabitation's  effect on later marriages is explained by the household  division of labor and gender ideology at time-1. Based on  attitude-behavior research, 1) a higher correlation between  household division of labor and gender ideology is  expected for premarital cohabitors than for  non-cohabitors; and 2) a measure of attitude toward  sharing housework should better predict household  division of labor than does general gender ideology. The  analysis showed that premarital cohabitation does have a  positive effect on household division of labor and gender  ideology in marriage through indirect (and possibly direct)  paths. The attitudinal and behavioral measures were not  more closely linked for cohabitors, and the specific  attitude-toward-the- behavior measure was not a better  predictor of household division of labor than general  gender ideology. I conclude from this analysis that the  experience of cohabitation leads to more egalitarian  marriages and that this is largely due to household labor  during cohabitation.",
  "description_provenance": [
    "Author Email: dunham1@roanoke.infi.net",
    "Made available in DSpace on 2014-03-14T20:07:03Z (GMT). No. of bitstreams: 1 etd.thesis.PDF: 183194 bytes, checksum: d311a72b403a7a4eb6577da1a421ef06 (MD5)   Previous issue date: 1997-05-05"
  ],
  "handle": "26083",
  "identifier_other": "etd-017112249741411",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-017112249741411/",
  "identifier_uri": "http://hdl.handle.net/10919/26083",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.thesis.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "egalitarianism",
    "household division of labor",
    "cohabitation",
    "gender ideology"
  ],
  "title": "The Effect of Cohabitation on Egalitarianism in Marriage",
  "type": "Dissertation"
}