{
  "contributor_author": "Mecham, Sue  Jewel",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Lesko, John J.",
    "Dillard, John G.",
    "Wolfe, James W.",
    "Ward, Thomas C."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:07:02Z",
  "date_adate": "1998-02-11",
  "date_available": "2014-03-14T20:07:02Z",
  "date_issued": "1997-04-21",
  "date_rdate": "1998-02-11",
  "date_sdate": "1997-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract \tHigh temperature, solvent resistant materials which also display good mechanical properties are desired for use as aerospace structural adhesives and polymer matrix/carbon fiber composites.  High molecular weight amorphous poly(arylene ether sulfone) thermoplastic materials display many of these desirable characteristics but are deficient in solvent resistance.  Previous attempts to prepare poly(arylene ether) based thermosets to improve solvent resistance have been largely unsuccessful due to processiblity issues from the low curing temperature and high glass transition temperature of the thermoset precursor.  Incorporation of a high temperature curable (* 350°C) endgroup such as 3-phenylethynylphenol in the synthesis of controlled molecular weight poly(arylene ether sulfone) oligomers has allowed for a large processing window prior to the exothermic cure that forms the desired networks.  Control of oligomer molecular weight and backbone structure has allowed for further control of the processing, thermal transitions and adhesive properties of the thermosets. \tA systematic series of phenylethynyl terminated oligomers derived from either bisphenol A, or wholly aromatic hydroquinone or biphenol has been synthesized and characterized to determine the influence of backbone structure, molecular weight, and endgroup structure on thermoset properties.  The features most affected by backbone structure included thermal stability (weight loss behavior) as well as transition temperatures (Tg, Tm), and processing characteristics.  Increasing molecular weight of the oligomer produced a decrease in the glass transition temperature of the network and an increase in the adhesive properties of the thermoset.  Comparison of the curing behavior of the 3-phenylethynylphenol endcapped materials with other related phenylethynyl terminated compounds led to the synthesis and systematic investigation of the curing behavior of phenylethynyl endcappers in which the electronic environment in relation to the reactive ethynyl carbons was systematically varied.  Electron withdrawing groups, eg. sulfone, ketone, imide on the aryl ring para to the acetylene bond enhanced the rate of cure and also appear to improve the lap shear adhesion to suface treated titanium adherands.  Discussion of the background, synthesis and characterization are described in this dissertation.",
  "description_provenance": [
    "Author Email: sueb@vt.edu",
    "Advisor Email: jmcgrath@chemserver.chem.vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:02Z (GMT). No. of bitstreams: 1 SJMDissertation.pdf: 3223852 bytes, checksum: e845377018f5aa161623db17ee47212b (MD5)   Previous issue date: 1997-04-21"
  ],
  "handle": "26081",
  "identifier_other": "etd-01498-144548",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01498-144548/",
  "identifier_uri": "http://hdl.handle.net/10919/26081",
  "publisher": "Virginia Tech",
  "relation_haspart": "SJMDissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Poly(arylene ether sulfone)",
    "high temperature cure",
    "high temperature adhesive"
  ],
  "title": "Synthesis and Characterization of Phenylethynyl Terminated Poly(arylene ether sulfone)s as Thermosetting Structural Adhesives and Composite Matrices",
  "type": "Dissertation"
}