{
  "contributor_author": "Reed, Timothy A.",
  "contributor_committeechair": "Creamer, Donald G.",
  "contributor_committeecochair": "Turrentine, Cathryn G.",
  "contributor_committeemember": [
    "Harshberger, Richard F.",
    "Hirt, Joan B.",
    "Alexander, M. David"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:03Z",
  "date_adate": "2002-02-04",
  "date_available": "2014-03-14T20:07:03Z",
  "date_issued": "2001-12-17",
  "date_rdate": "2003-02-04",
  "date_sdate": "2002-02-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to identify the leadership skills students believe they learned in co-curricular activities, to determine how those skills are used in the classroom, and to discover whether those skills enhance the academic experience for students.  The results of this study provide information which can aid student affairs practitioners who are seeking ways to help students make the connection between the co-curricular and curricular leadership experiences. \tThis study used a combination of qualitative research techniques including document analysis and group interviews.  The qualitative nature of this study was guided by the need to allow the subjects explore their own perceptions, beliefs, observations, and understanding about their behavior and learning.  Thirty-one student leaders from programs and organizations sponsored by the Division of Student Affairs (DSA) at Virginia Polytechnic Institute and State University (Virginia Tech) were interviewed over a period of one semester.  Two cadres of three groups participated in four rounds each   A round consisted of an e-journal, sent and responded to individually by the participants, followed by a group interview.  E-journals and interviews were analyzed using a conceptually clustered matrix.  This process produced a series of matrices correlating the various perspectives of the participants with either leadership practices, research questions, demographic data, or all three. \tThe results of the study reveal that training programs for these student leaders tended to focus on three primary leadership practices and that the student leaders exhibited these same practices in their curricular experience.  Reflection both during and after the study had a profound impact on the studentsâ   perceptions of whether or not they perceived their own behavior as leadership either in or out of the classroom.  Additional results showed that the physical design of a classroom could have an impact on how leadership practices occur during class.  It was also shown that while all the participants in this study were in DSA sponsored programs, there was no central leadership theory or comprehensive approach to leadership development to guide Division programs. \tFindings from this study provide evidence of the value of co-curricular leadership training and its impact on curricular experience.  The study also adds to the body of research on student leadership, research on the impact of co-curricular activities on students, and the relationship between curricular and co-curricular learning, particularly as it relates to group assignments and the leadership of those projects.",
  "description_provenance": [
    "Author Email: reedta@vt.edu",
    "Advisor Email: uld2@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: turc@exchange.vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:03Z (GMT). No. of bitstreams: 1 tareed-dissertation.pdf: 535155 bytes, checksum: 5ad5c209bf0e184fdd11f8add05c972c (MD5)   Previous issue date: 2001-12-17"
  ],
  "handle": "26085",
  "identifier_other": "etd-02012002-171701",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02012002-171701/",
  "identifier_uri": "http://hdl.handle.net/10919/26085",
  "publisher": "Virginia Tech",
  "relation_haspart": "tareed-dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Higher Education",
    "Student Leadership Development"
  ],
  "title": "Student Leaders in the Classroom: A Study of Virginia Tech Student Leaders and Their Accounts of Curricular and Co-Curricular Leadership",
  "type": "Dissertation"
}