{
  "contributor_author": "Puttre, Catherine P.",
  "contributor_committeecochair": [
    "Alexander, M. David",
    "Mallory, Walter D."
  ],
  "contributor_committeemember": [
    "Bengier, Andrea",
    "Gatewood, Thomas E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:02Z",
  "date_adate": "2008-04-30",
  "date_available": "2014-03-14T20:07:02Z",
  "date_issued": "2007-12-13",
  "date_rdate": "2008-04-30",
  "date_sdate": "2008-01-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Does the Degree of Implementation of the Components of the Middle School Design Relate to High-stakes Assessment Scores in Grade 8 Reading and Math?  Catherine P. Puttre  ABSTRACT  \tDoes the degree of implementation of the components of the middle-school design relate to high-stakes assessment scores in Grade 8 reading and math? There currently exists a conflict between the advocates of the middle-school components and those who support an abandonment of this philosophy and conceptual model for a more conservative and curriculum centered school structure. The outcome of this study provides valuable data to resolve this debate. <p> \tSocioeconomic ratios, minority percentages, and student attendance were controlled for as they impact student achievement. The middle-school concept evolved from a desire to create a more appropriate learning environment which would address the unique needs of early adolescents. Student achievement as demonstrated on the math and reading Standards of Learning tests in Virginia schools should validate this belief. <p> \tThe data analysis resulted in no significant difference between the reading and math scores on the Virginia state assessment for eighth-grade students in middle schools and eighth graders in other grade configured schools. The socioeconomic status of the student population of the school was the one factor that did impact the studentsâ   academic achievement. Math scores were not impacted to the same degree as the reading scores. While this research provides no concrete support for the expansion of the middle-school program, neither is there support for the assertion that it lacks rigor, and keeps students from achieving academically and therefore should be abandoned.",
  "description_provenance": [
    "Author Email: puttrep@pwcs.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: wmallory@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:02Z (GMT). No. of bitstreams: 1 dissertationmar1808.pdf: 324264 bytes, checksum: 989c3c8995421eedcc320dd93e492a2f (MD5)   Previous issue date: 2007-12-13"
  ],
  "handle": "26080",
  "identifier_other": "etd-01312008-210608",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01312008-210608/",
  "identifier_uri": "http://hdl.handle.net/10919/26080",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertationmar1808.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "High Stakes Assessment",
    "Middle School",
    "Achievement"
  ],
  "title": "Does the Degree of Implementation of the Components of the Middle School Design Relate to High-Stakes Assessment Scores in Grade 8 Reading and Math?",
  "type": "Dissertation"
}