{
  "contributor_author": "Nelson, Rebecca  S.",
  "contributor_committeechair": "Mick, Harold W.",
  "contributor_committeemember": [
    "Wildman, Terry M.",
    "Magliaro, Susan G.",
    "Patty, C. Wayne",
    "Lloyd, Gwendolyn M."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:07:03Z",
  "date_adate": "1998-01-20",
  "date_available": "2014-03-14T20:07:03Z",
  "date_issued": "1997-12-17",
  "date_rdate": "1998-01-20",
  "date_sdate": "1997-12-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this case study was to examine the experience of one secondary mathematics teacher during his efforts to facilitate mathematical discussions in a secondary algebra class.  Class discussions and interviews were documented and analyzed to investigate the patterns of discussion, the teacher's role in facilitating discussion, and the struggles encountered by the teacher through his attempts to enact reform-oriented strategies.  The investigation focused on the teacher's vision for and actual practice in utilizing reform-oriented strategies for discussion in his Algebra class.  The teacher's vision of reform was largely based on NCTM Standards recommendations for reforming the teaching and learning of mathematics.  Data was collected through various sources and was analyzed using qualitative methods in the spirit of naturalistic inquiry.  Data was generated through classroom observations, teacher interviews, audiotapes of whole-class discussions, and personal log notes written by the researcher.  Although the teacher expressed intentions to reform discussion in his classroom, he continued to experience struggles in realizing his intentions.  Class discussions that were largely teacher-directed and followed traditional patterns of interaction.  The teacher struggled with three main issues:  classroom challenges, perceptions of student resistance, and teacher authority.  The findings of this study suggest that mathematics teachers, even those with extensive experience and grounded knowledge in current reform initiatives, will need to further develop strategies for facilitating a Standards-like environment in their classrooms.  Pre-service and in-service educators should also examine the development of programs that can better reflect actual practice and build on classroom teachers' prior experiences and practice.",
  "description_provenance": [
    "Author Email: RNelson65@aol.com",
    "Advisor Email: mick@math.vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:03Z (GMT). No. of bitstreams: 2 RSN-ETD.PDF: 13949 bytes, checksum: 1e72bd911a9831df95f4ae0526a8562d (MD5) RSN-PDF.PDF: 348654 bytes, checksum: 75cb38b04df4003c806d58af13bac3f3 (MD5)   Previous issue date: 1997-12-17"
  ],
  "handle": "26082",
  "identifier_other": "etd-01698-10352",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-01698-10352/",
  "identifier_uri": "http://hdl.handle.net/10919/26082",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "RSN-ETD.PDF",
    "RSN-PDF.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Mathematics Education",
    "Qualitative Research"
  ],
  "title": "Developing Mathematical Knowledge Through Class Discussion:  One Teacher's Struggles in Implementing Reform",
  "type": "Dissertation"
}