{
  "contributor_author": "Hallbeck, M. Susan",
  "contributor_committeechair": "Kroemer, Karl H. E.",
  "contributor_committeemember": [
    "Ayoub, M. M.",
    "Dryden, Robert D.",
    "Snyder, Harry L.",
    "Williges, Robert C."
  ],
  "contributor_department": "Industrial Engineering and Operations Research",
  "date_accessioned": "2014-03-14T20:07:03Z",
  "date_adate": "2006-02-01",
  "date_available": "2014-03-14T20:07:03Z",
  "date_issued": "1990-04-01",
  "date_rdate": "2010-10-05",
  "date_sdate": "2006-02-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>An experiment was performed to evaluate the relations between active range of motion (ROM) and upper limb anthropometric dimensions. Eight anthropometric dimensions, forearm length, distal and proximal forearm circumferences, wrist breadth, wrist thickness, wrist circumference, hand breadth, and hand length in combination with gender, wrist position, and direction of motion or exertion were evaluated to determine their effects on instant center of rotation (ICOR) and the magnitude of force exertion. The knowledge gained from analysis of the study data will be the first step in the formulation of a biomechanical model of wrist flexion and extension. Such a model would predict forces and torques at specific wrist postures and be employed to reduce cumulative trauma disorders of the wrist. </p><p> Sixty right-hand dominant subjects (30 male, 30 female) between 20 and 30 years of age all reporting no prior wrist injury and good to excellent overall physical condition, were employed in this study. </p><p> The upper limb anthropometric dimensions and ROM were measured and recorded for each subject. The anthropometric dimensions were compared to tabulated data. The measured active ROM values were compared with values in the literature. Correlation coefficients between pairs of anthropometric variables (by gender) were calculated. The mean active ROM measures, 164.0 deg for females and 151.8 deg for males, were significantly different (Î  = 2.193, <i>p</i> = 0.014). </p><p> The relationships between the anthropometric variables and active ROM were analyzed by three methods: correlation between ROM and each anthropometric dimension, prediction (regression) equations, and analysis of variance (ANOVA). No correlation coefficient between ROM and any anthropometric dimension was greater than 0.7. No prediction equation, based upon linear and quadratic combinations of anthropometric dimensions variables, was above the threshold of acceptability (<i>R<sup>2</sup></i> â ¥ 0.5). The results of the ANOVA showed a significant effect for gender. The ICOR had been hypothesized to be either in the head or neck of the capitate. The Method of Reuleaux was employed to locate the leOR points for flexion and extension (over the ROM) of the wrist with three load conditions, i.e., no-load, palmar resistance, and dorsal resistance. Analysis of the data, using ANOYA, showed that wrist position was the only significant variable. Thus, in future wrist models, the assumption cannot be made that the wrist is a pin-centered joint for flexion and extension. </p><p> The static maximal voluntary contractile forces that can be generated by recruiting only the six wrist-dedicated muscles in various wrist positions were measured. There was a significant gender difference for the mean flexion force (Î  = 4.00, <i>p</i> = 0.0001) and for the mean extension force (Î  = 4.58, <i>p</i> = 0.0001). Females averaged 76.3 percent of the mean male flexion force and 72.4 percent for extension. </p><p> The force data, categorized by gender, were then analyzed using three methods: correlation of variable pairs, regression equations, and ANOVA. None of the eight anthropometric dimensions and ROM was correlated with flexion or with extension force at an acceptable level. The prediction equations, linear and quadratic combinations of all possible subsets of anthropometric dimension values, ROM, and wrist position did not meet the minimum acceptable level of <i>R<sup>2</sup></i> â ¥ 0.5. The ANOVA procedure showed gender, wrist position, direction of force exertion, and the wrist position interaction with direction to have significant effects upon maximal force exertion.</p>",
  "description_provenance": [
    "Author Email: hallbeck@unl.edu",
    "Made available in DSpace on 2014-03-14T20:07:03Z (GMT). No. of bitstreams: 1 LD5655.V856_1990.H344.pdf: 4626689 bytes, checksum: 206145753f3f6e61504d68c0a03a081c (MD5)   Previous issue date: 1990-04-01"
  ],
  "format_medium": "BTD",
  "handle": "26086",
  "identifier_other": "etd-02012006-141703",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02012006-141703/",
  "identifier_uri": "http://hdl.handle.net/10919/26086",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1990.H344.pdf",
  "subject": [
    "Joints",
    "Carpus (human anatomy)",
    "Range of motion",
    "Wrist"
  ],
  "subject_lcc": "LD5655.V856 1990.H344",
  "title": "Biomechanical analysis of carpal flexion and extension",
  "type": "Dissertation"
}