{
  "contributor_author": "Benczik, Sandor Zoltan",
  "contributor_committeechair": "Chang, Lay Nam",
  "contributor_committeemember": [
    "Tauber, Uwe C.",
    "Takeuchi, Tatsu",
    "Haskell, Peter E.",
    "Pitt, Mark L."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:07:05Z",
  "date_adate": "2007-03-09",
  "date_available": "2014-03-14T20:07:05Z",
  "date_issued": "2007-01-22",
  "date_rdate": "2007-03-09",
  "date_sdate": "2007-02-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "We consider a modified non-relativistic quantum mechanics where the position and momentum operators satisfy a non-standard commutation relation of the form [Xi; Pj] = i~f(1 + P2) + 0PiPjg. Such a theory incorporates an absolute minimal length, UV/IR mixing and non-commutative position space. The possible representations in terms of differential operators are analyzed and their equivalence to first order is established.   Simple quantum systems, namely the harmonic oscillator, the Coulomb potential and the gravitational well are studied in one of these representations, the pseudo-position one, and results are compared to previously published results. The Coulomb potential is also analyzed by an alternative analytical/numerical method. A constraint of ~ 3 GeV on the scale of the parameters ; 0 is obtained from precision experimental data on the atomic hydrogen energy levels.",
  "description_provenance": [
    "Author Email: sbenczik@vt.edu",
    "Advisor Email: tauber@vt.edu",
    "Advisor Email: takeuchi@vt.edu",
    "Advisor Email: laynam@vt.edu",
    "Advisor Email: haskell@math.vt.edu",
    "Advisor Email: pitt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:05Z (GMT). No. of bitstreams: 1 thesis.pdf: 558031 bytes, checksum: a30ef7ed6bd7ff8ff3d6f140fae80967 (MD5)   Previous issue date: 2007-01-22"
  ],
  "handle": "26096",
  "identifier_other": "etd-02022007-144916",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02022007-144916/",
  "identifier_uri": "http://hdl.handle.net/10919/26096",
  "publisher": "Virginia Tech",
  "relation_haspart": "thesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "UV/IR mixing",
    "minimal length"
  ],
  "title": "Investigations on the minimal-length uncertainty relation",
  "type": "Dissertation"
}