{
  "contributor_author": "Tang, Shoubin",
  "contributor_committeechair": "Kingston, David G. I.",
  "contributor_committeemember": [
    "Gandour, Richard D.",
    "Etzkorn, Felicia A.",
    "Carlier, Paul R.",
    "Dorn, Harry C."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:07:07Z",
  "date_adate": "2006-04-14",
  "date_available": "2014-03-14T20:07:07Z",
  "date_issued": "2005-12-08",
  "date_rdate": "2006-04-14",
  "date_sdate": "2006-02-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As part of an ongoing investigation for anticancer agents from natural resources, four plant extracts were determined to contain interesting bioactivity. These extracts were separated by chromatography to afford a number of bioactive compounds that were characterized by spectral analysis.     Fractionation of the fruit extract of Cryptocarya crassifolia led to the isolation of two known flavonoids and two known cryptocaryalactones. Fractionation of the bark extract of the same plant also gave the same two cryptocaryalactones. All these compounds were weakly active in a cytotoxicity assay.      Two new isoflavones were isolated from the roots of an Egyptian lotus plant, Lotus polyphyllos. Both compounds were characterized by UV, NMR, and mass spectroscopic analysis The methanol extract from the leaves and bark of a Brexiella sp. were found to display significant cytotoxic activity versus the A2780 mammalian cell line. Two highly active cardenolides, glucodigimetholide and xysmalogenin glucoside, were isolated and found to be responsible for the bioactivities. Both compounds were characterized by spectroscopic analysis and comparison to the known literature data.     Two marine extracts were also investigated. The pyridoacridine alkaloids, amphimedine and neoampimedine, were isolated from the marine sponge Petrosia sp., and three bromo-tyrosine alkaloids were isolated from the marine sponge Porphyria flintae. The structures of these known compounds were all elucidated by comparison to literature data.     Two 6-amino-glycoglycerolipids had been previously isolated from a marine algae species and shown to inhibit the activity of the enzyme Myt-1 kinase. These compounds and some related compounds were synthesized and their bioactivities against Myt1 kinase were determined.      Two isotopically labeled paclitaxel analogs (2D, 19F) were prepared in preparation for studies of the tubulin-binding conformation of paclitaxel by REDOR NMR. A new macrocyclic A-nor-paclitaxel was also synthesized, and was found to have good cytotoxicity and improved tubulin-binding activity as compared with paclitaxel.",
  "description_provenance": [
    "Author Email: stang@vt.edu",
    "Advisor Email: gandour@vt.edu",
    "Advisor Email: fetzkorn@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Advisor Email: hdorn@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:07Z (GMT). No. of bitstreams: 4 AppendixSpectra.pdf: 548886 bytes, checksum: e39198aaaebbbb3b66c68854439fb973 (MD5) Maintext03.pdf: 1566210 bytes, checksum: 1414ea9bfbd6d17c9b8ae80e2ae87435 (MD5) Acknowledgements02.pdf: 103162 bytes, checksum: 057f033b7badefcdbd2da3513827c858 (MD5) Cover01.pdf: 23347 bytes, checksum: 12e479536ea0c390349af9c4b9f32625 (MD5)   Previous issue date: 2005-12-08"
  ],
  "handle": "26104",
  "identifier_other": "etd-02032006-160906",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02032006-160906/",
  "identifier_uri": "http://hdl.handle.net/10919/26104",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "AppendixSpectra.pdf",
    "Maintext03.pdf",
    "Acknowledgements02.pdf",
    "Cover01.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "glycolipids",
    "synthesis",
    "isolation",
    "anticancer",
    "Natural Product",
    "paclitaxel"
  ],
  "title": "Structural and Synthetic Studies of Bioactive Natural Products",
  "type": "Dissertation"
}