{
  "contributor_author": "Torma, Susan C.",
  "contributor_committeechair": "Dawson, Christina M.",
  "contributor_committeecochair": "Parson, Stephen R.",
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:08Z",
  "date_adate": "1999-02-05",
  "date_available": "2014-03-14T20:07:08Z",
  "date_issued": "1998-12-07",
  "date_rdate": "1999-02-05",
  "date_sdate": "1999-02-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This study examines perceptions of the stakeholders (parents, administrators, faculty members, counselors, and fifth grade students) about the Virginia Beach Elementary Guidance and Counseling Program.  A survey was developed by examining guidance goals and a previous study of the program (1993).  Questions covered four domains:  (1) home-school relationships, (2) student personal development, (3) support for academic growth, and (4) program value.  Results are reported in descriptive statistics.  Four one-way analyses of variance were used to compare responses of groups in domains.  Included are two supplemental analyses about student access to counselors and conditions affecting counselorsâ   work.   \tAdults agreed promoting closer home-school relationships was a worthwhile goal.  Parents felt less positive than administrators, faculty, and counselors that the program promoted home-school relationships, that parents met with counselors, and that parents received information and were being afforded appropriate parent educational opportunities.   \tAdults agreed that promoting closer home-school relationships was a worthwhile goal.  Means scores ranged from 3.3 to 3.7 on a 4 point scale.  (4.0 represented strongly agree.)  Administrators, faculty, and counselors felt more positively than parents that the program promoted home-school relationships, that parents met with counselors, and that parents received information and were being afforded appropriate parent educational opportunities.  Mean scores ranged from 2.9 to 3.9. \tAdults felt student personal development was a worthwhile goal.  Mean scores ranged from 3.3 to 3.8.  All adult groups felt positive about counseling programs helping students understand themselves and others better, the program having a positive impact on childrenâ  s personal development, and the program helping students cope with developmental changes.  Mean scores for these adults ranged from 3.0 to 3.8. \tIn support for academic growth, parents and faculty gave slightly lower scores, although all groups felt positive about counseling programs.  Mean scores ranged from 2.8 to 3.8. \tResponses to open-ended questions supported these ratings.  When asked about suggestions for program improvement, two responses given most often were more elementary counselors were needed and more communication with parents would be helpful.  When asked for other comments, primary themes were the program is positive, the program is helpful, and counselors are good. \tOverall perception is the elementary guidance and counseling program is valuable.  Findings suggest program administrators may want to consider reviewing home-school relationships, support provided by counselors for the academic program, and counselor-student ratio.",
  "description_provenance": [
    "Author Email: STORMA@prodigy.net",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: tdawson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:08Z (GMT). No. of bitstreams: 1 DISSERTA.PDF: 338936 bytes, checksum: 5464f1e384a0ff06c1645047675e7b9a (MD5)   Previous issue date: 1998-12-07"
  ],
  "handle": "26109",
  "identifier_other": "etd-020399-190239",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-020399-190239/",
  "identifier_uri": "http://hdl.handle.net/10919/26109",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISSERTA.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Guidance",
    "Elementary Counseling"
  ],
  "title": "The Perceptions of Elementary Guidance In the Virginia Beach City Public Schools",
  "type": "Dissertation"
}