{
  "contributor_author": "Sugandhi, Eko Winny",
  "contributor_committeechair": "Gandour, Richard D.",
  "contributor_committeemember": [
    "Carlier, Paul R.",
    "Hanson, Brian E.",
    "Kingston, David G. I.",
    "Tanko, James M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:07:07Z",
  "date_adate": "2007-03-05",
  "date_available": "2014-03-14T20:07:07Z",
  "date_issued": "2007-01-31",
  "date_rdate": "2007-03-05",
  "date_sdate": "2007-02-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Many previous studies of biological activity in a homologous series of amphiphiles have shown a cut-off effect, where the biological activity increases with an increase in chain length, after which the activity plateaus or weakens.  One factor suspected to cause this problem is solubility issues.  We have designed several series of very hydrophobic, water-soluble amphiphiles to overcome this problem.  Three homologous series containing mobile hydrophobic moieties and two series of epimers containing rigid cholestane moieties have been synthesized; the hydrophobic moiety is connected to the first-generation, Newkome-type dendron via a ureido linker.  We have demonstrated that as tris(triethanolammonium) salts, these amphiphiles show excellent solubility in water.  The solubilities in aqueous triethanolamine solution of the three series containing mobile hydrophobic moieties are 19,500 to 25,700 &mu;M depending on the formula weight of the homolog, while those containing rigid cholestane moieties are 18,900 and 17,400 &mu;M. Having eliminated the solubility issue, the antimicrobial activity against a broad spectrum of microorganisms has been screened.  We have demonstrated that the antimicrobial activity depends on the amphiphile-series, species, chain-length, or epimer specificities, as well as hydrophobicity.  The one-tailed, tri-carboxylato amphiphiles are generally better than the other series, with two exceptions.  First, the two-tailed tri-carboxylato amphiphiles, <b>3CUr1(11)<sub>2</sub></b> and <b>3CUr1(12)<sub>2</sub></b>, are more active against <i>Cryptococcus neoformans</i>; in fact, both amphiphiles (MICs are 6.9 and 7.2 &mu;M, respectively) are considered to display good antifungal activity.  Second, amphiphile <b>3CUr-&beta;-cholestane</b>, whose MIC is 27 &mu;M, is more active against <i>Staphylococcus aureus</i>.  Overall, these new tri-carboxylato amphiphiles only exhibit moderate activity with two promising leads. Furthermore, we have demonstrated the intrinsic activity (MIC<sub>0</sub>) of the one-tailed, tri-carboxylato amphiphile series (<b>3CUrn</b>) against <i>Mycobacterium smegmatis</i>.  All the MIC<sub>0</sub>s observed are at least 8-fold lower than the corresponding CMCs.  Amphiphile <b>3CUr16</b> is the most active; the MIC<sub>0</sub> is 100-fold smaller than the CMC.  With this consideration, we have suggested that the mechanism of action of the antimycobacterial activity in amphiphile <b>3CUr16</b> is not related to detergency.",
  "description_provenance": [
    "Author Email: esugandh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:07Z (GMT). No. of bitstreams: 1 Sugandhi.pdf: 8667965 bytes, checksum: ca7c835c658d77faf29965762384ca18 (MD5)   Previous issue date: 2007-01-31"
  ],
  "handle": "26106",
  "identifier_other": "etd-02032007-143323",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02032007-143323/",
  "identifier_uri": "http://hdl.handle.net/10919/26106",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sugandhi.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "multi-tailed",
    "multi-headed",
    "tri-carboxylato",
    "dendritic",
    "amphiphile",
    "solubility",
    "microorganism",
    "biological and intrinsic activity"
  ],
  "title": "Synthesis, Characterization, and Antimicrobial Activity of Water-soluble, Tri-carboxylato Amphiphiles",
  "type": "Dissertation"
}