{
  "contributor_author": "Best, Julia Y.",
  "contributor_committeechair": "Tlou, Josiah S.",
  "contributor_committeemember": [
    "Dixon, Benjamin",
    "Nespor, Jan K.",
    "Burton, John K.",
    "Graham, Richard Terry"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:07Z",
  "date_adate": "2006-03-23",
  "date_available": "2014-03-14T20:07:07Z",
  "date_issued": "2006-01-24",
  "date_rdate": "2007-03-23",
  "date_sdate": "2006-02-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>There is a nationwide decline in enrollment, retention and degree completion for African American students in predominantly White institutions (PWIs) in the United States. Colleges and Universities establish diversity initiatives to address these concerns, yet educational disparities persist. Institutions of higher learning also address ways to enhance the educational development of undergraduate students. One such initiative involves a paradigm shift to extend the curriculum into residential learning communities (RLCs). Therefore, this study addresses the following research question: How do African American undergraduate students in RLCs perceive the role of these communities, particularly the kinds of contacts they afford with faculty, staff, and peers, in shaping their educational development? </p><p> I used qualitative methods - open-ended semi-structured  interviews, participant observations, and a questionnaire - to explore students' experiences in six academically-tied residential learning communities. Thirty-two current and former members participated in individual interviews. Sixteen full-time male and sixteen female students include twenty-two freshmen, four sophomores, four juniors and two seniors. </p><p> Consistent with Astin's (1985, 1993b, 1996) work, this dissertation suggests that student involvement with faculty, peers and academics is necessary for retention. However, this study argues that a critical race theory (CRT) perspective is needed to make sense of the way peer interactions create racial barriers and lead some students to develop what I charaterize as \"racial-cope-ability\" skills to deal with racial challenges. </p><p> High school background plays a role in how students fare in RLCs. High school leadership experiences support positive self-efficacy and help students connect with faculty, peers and activities at the onset of the collegiate experience. </p><p> A number of RLC components help create positive affective and cognitive developmental experiences:  <ul><li> A sense of belonging and a sense of community significantly impact psychosocial wellbeing, success and retention; </li><li>Built-in support systems, educational advantages for retention and personalized experiences at a large PWI are reasons to recommend RLCs to other students; and </li><li>Residential learning communities at PWIs can contribute to existing outreach efforts into untapped in-state and out-of-state communities, school systems and outreach efforts on campus. </li></ul>",
  "description_provenance": [
    "Author Email: jbest@vt.edu",
    "Advisor Email: bdixon@vt.edu",
    "Advisor Email: tlou@vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: rgraham@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:07Z (GMT). No. of bitstreams: 1 JBestDissertation.pdf: 735272 bytes, checksum: 655b5cef4aec90c57451d78750cbd784 (MD5)   Previous issue date: 2006-01-24"
  ],
  "handle": "26103",
  "identifier_other": "etd-02032006-152449",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02032006-152449/",
  "identifier_uri": "http://hdl.handle.net/10919/26103",
  "publisher": "Virginia Tech",
  "relation_haspart": "JBestDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "retention",
    "residential learning communities",
    "African American students",
    "recruitment"
  ],
  "title": "African American Undergraduate Students' Experiences in Residential Learning Communities at a Predominantly White Institution",
  "type": "Dissertation"
}