{
  "contributor_author": "Uzarski, Joshua Robert",
  "contributor_committeechair": "Morris, John R.",
  "contributor_committeemember": [
    "Long, Gary L.",
    "Wi, Sungsool",
    "Anderson, Mark R.",
    "Gandour, Richard D."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:07:07Z",
  "date_adate": "2009-02-26",
  "date_available": "2014-03-14T20:07:07Z",
  "date_issued": "2009-01-19",
  "date_rdate": "2012-03-27",
  "date_sdate": "2009-02-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Reflection absorption infrared spectroscopy was used as the primary analysis technique to study the interfacial chemistry of surfaces relevant to chemical and biological warfare agent defense.  Many strategies utilized by the military to detect and decompose chemical and biological warfare agents involve their interaction with surfaces.  However, much of the chemistry that occurs at the interface between the agents and surfaces of interest remains unknown.  The surface chemistry plays an important role in efficacy of both detection and decontamination technology, and by obtaining a deeper understanding of that chemistry, researchers might be able to develop more sensitive detection devices and more effective decontamination strategies.  Our efforts have focused on three different areas of surface chemistry relevant to chemical and biological warfare agent defense:  <p> 1) The development of a surface synthesis strategy to create and control the structure of antibacterial self-assembled monolayers (SAMs).  Our work demonstrated a successful strategy for creating SAMs that contain long-chain quaternary ammonium groups, which were synthesized and subsequently characterized using RAIRS and X-ray photoelectron spectroscopy (XPS). <p>  2) The determination of the surface conformation, orientation, and relative surface density of immobilized antimicrobial peptides.  Our results revealed that the peptides consisted of tilted (50-60°), α-helices on the surface, regardless of solution conditions. <p>  3) The design and construction of a new ultrahigh vacuum surface science instrument that allows for the study of gas-surface reactions with up to three gases simultaneously. <p>  4) The study of the adsorption of chemical warfare agent simulants to silica nanoparticulate films.  Our work demonstrated that the adsorbate structure was dependent on the number of hydrogen-bonding groups, and the adsorption consists of a pressure-dependent two part mechanism. <p> \tThe results presented here will help increase the understanding of the surface chemistry of three interfaces relevant to chemical and biological defense.  Future researchers may apply the new information to develop more effective detection and decontamination strategies for chemical and biological warfare agents.",
  "description_provenance": [
    "Author Email: juzarski@vt.edu",
    "Advisor Email: jrmorris@vt.edu",
    "Advisor Email: long@vt.edu",
    "Advisor Email: sungsool@vt.edu",
    "Advisor Email: mark.anderson@ucdenver.edu",
    "Advisor Email: gandour@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:07Z (GMT). No. of bitstreams: 1 JUzarski_Dissertation_ETD.pdf: 3943328 bytes, checksum: f73299d595764312cbd99078adf889e0 (MD5)   Previous issue date: 2009-01-19"
  ],
  "handle": "26107",
  "identifier_other": "etd-02032009-052713",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02032009-052713/",
  "identifier_uri": "http://hdl.handle.net/10919/26107",
  "publisher": "Virginia Tech",
  "relation_haspart": "JUzarski_Dissertation_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "quaternary ammonium cation",
    "surface chemistry",
    "RAIRS",
    "antimicrobial peptides",
    "ultrahigh vacuum",
    "chemical warfare agent simulants"
  ],
  "title": "Reflection Absorption Infrared Spectroscopic Studies of Surface Chemistry Relevant to Chemical and Biological Warfare Agent Defense",
  "type": "Dissertation"
}