{
  "contributor_author": "Hamamouch, Noureddine",
  "contributor_committeechair": "Westwood, James H.",
  "contributor_committeemember": [
    "Cramer, Carole L.",
    "Nessler, Craig L.",
    "McDowell, John M.",
    "Wojcik, Edward J."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:07:08Z",
  "date_adate": "2004-03-15",
  "date_available": "2014-03-14T20:07:08Z",
  "date_issued": "2004-01-13",
  "date_rdate": "2005-03-15",
  "date_sdate": "2004-02-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<i>Orobanche</i> species are parasitic weeds that subsist on the roots of many dicotyledonous plants. These parasites form symplastic and apoplastic connections with their hosts and act as strong sinks for the uptake of water, minerals, and photosynthates, often causing severe damage to the hosts. Although the uptake of small molecules such as sugars and herbicides by <i>Orobanche</i> has been documented, movement of macromolecules between host and parasite has not been characterized. The objectives of this research were to 1) determine whether, and by what route, host macromolecules can be translocated to the parasite, and 2) engineer host resistance based on inducible expression of sarcotoxin IA, an anti-microbial peptide from the flesh fly (<i>Sarcophaga peregrina</i>). To address the first objective, transgenic plants expressing GFP localized to either the host cell cytosol (symplast) or secreted to the extra-cellular space (apoplast) were parasitized by <i>O. aegyptiaca</i>. Observations of green fluorescence in <i>O. aegyptiaca</i> tubercles growing on these plants indicate that the 27 kDa GFP molecule was translocated to the parasite via both symplastic and apoplastic routes. This work was supported by studies with xylem- and phloem-specific dyes, which showed that fluorescent dextrans as large as 70 kDa moved into the parasite through xylem connections. The second objective was addressed using tobacco (<i>Nicotiana tabacum</i> L. cv. Xanthi) plants expressing the sarcotoxin IA transgene under control of the parasite-inducible <i>HMG2</i> promoter. In soil experiments, transgenic tobacco plants had greater height and biomass, and showed up to 90% reduction in <i>O. ramosa</i> parasitism as measured by the fresh weight of parasite tubercles.  In a semi-hydroponic growth system, where <i>Orobanche</i> tubercles can be visualized at early stages of growth, <i>O. aegyptiaca</i> parasites growing on plants expressing sarcotoxin IA were smaller and had an increased number of senescent tubercles compared to those growing on non-transformed plants. Considering the relatively small size of sarcotoxin IA (4 kDa), it is likely that this peptide moves from host to the parasite, where it accumulates to phytotoxic concentrations. In addition to increasing our knowledge of host-<i>Orobanche</i> interactions, this research used an antibiotic peptide to engineer partial <i>Orobanche</i> resistance into a highly susceptible crop. This strategy has broad implications for the control of other parasitic weeds.",
  "description_provenance": [
    "Author Email: nhamamou@vt.edu",
    "Advisor Email: westwood@vt.edu",
    "Advisor Email: ccramer@vt.edu",
    "Advisor Email: cnessler@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Advisor Email: ewojcik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:08Z (GMT). No. of bitstreams: 1 Dissertation-2004.pdf: 2057917 bytes, checksum: 2ee1a4b92ee1a9232bd1ae11979ee416 (MD5)   Previous issue date: 2004-01-13"
  ],
  "handle": "26113",
  "identifier_other": "etd-02042004-152424",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02042004-152424/",
  "identifier_uri": "http://hdl.handle.net/10919/26113",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-2004.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Egyptian broomrape",
    "Protein movement",
    "<i>Orobanche</i> <i>ramosa</i>",
    "GFP",
    "<i>Orobanche</i> <i>aegyptiaca</i>",
    "Carboxyfluorescein",
    "Texas-Red labeled dextran",
    "Sarcotoxin IA",
    "Resistance"
  ],
  "title": "Engineering Resistance to <i>Orobanche</i> <i>aegyptiaca</i>: Evidence of Sarcotoxin IA as an Anti-Parasite Protein and Macromolecule Movement From Host to Parasite",
  "type": "Dissertation"
}