{
  "contributor_author": "Melnyk, Jason Alexander",
  "contributor_committeechair": "Williams, Jay H.",
  "contributor_committeemember": [
    "Davy, Kevin P.",
    "Moore, David Michael",
    "Newton, William E.",
    "Rankin, Janet L. Walberg"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:07:09Z",
  "date_adate": "2009-02-17",
  "date_available": "2014-03-14T20:07:09Z",
  "date_issued": "2009-01-23",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-02-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Creatine kinase (CK) primarily serves as an energy buffer assisting in regulating ATP homeostasis through synthesis of ATP from ADP and phosphocreatine (PCr). This enzyme is bound in the sarcomere near sites of ATP consumption via acto-myosin ATPase (Aâ ¢Mâ ¢ATPase) and research in cardiac muscle has found that PCr can alter contractile performance (maximal isometric force and Ca2+ sensitivity). Based on this evidence, CK and Aâ ¢Mâ ¢ATPase may be coupled in skeletal muscle. Therefore the purpose of this investigation was to determine the influence of the CK system on contractile performance and energy utilization in skeletal muscle. <p>  When skinned fibers (membrane removed) were provided a limited supply of [ATP] (0.1 mM), this resulted in increased Ca2+ sensitivity. The addition of PCr to low ATP solutions restored Ca2+ sensitivity and allowed normal isometric force generation across a range of [Ca2+] via ATP synthesis by CK. This was also possible with only CK reaction substrates (ADP, PCr) in the absence of ATP. Based on these findings, endogenous CK activity in glycerol skinned skeletal muscle fibers is sufficient to permit normal function of the contractile apparatus. <p>   Energy utilization was studied by indirect assessment of ADP production. Decreased net ADP production as measured by NADH fluorescence revealed endogenous CK was able to convert ADP produced by Aâ ¢Mâ ¢ATPase to ATP in skeletal muscle across a range of both [Ca2+] and [ATP]. This was confirmed directly via high-performance liquid chromatography measurements of ATP and ADP by showing that skinned skeletal muscle bundles have sufficient endogenous CK activity to produce ATP from substrates (ADP, PCr) and the ability to maintain low [ADP] in the presence of PCr. <p>  This study adds to the evidence for specific compartmentation of CK near sites of ATP utilization and contributes to the body of knowledge on contractile performance in skinned skeletal muscle fibers. By showing how changing demands on skeletal muscle (through increased Ca2+) alters force production and Ca2+ sensitivity, these findings lend support for the importance of endogenous CK as a pathway of ATP regeneration in skeletal muscle.",
  "description_provenance": [
    "Author Email: jmelnyk@vt.edu",
    "Advisor Email: kdavy@vt.edu",
    "Advisor Email: moored@vt.edu",
    "Advisor Email: wenewton@vt.edu",
    "Advisor Email: jrankin@vt.edu",
    "Advisor Email: jhwms@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:09Z (GMT). No. of bitstreams: 1 ETDMelnykv2.pdf: 1455834 bytes, checksum: 167a1521fbf165fd094c8a09f11db495 (MD5)   Previous issue date: 2009-01-23"
  ],
  "handle": "26116",
  "identifier_other": "etd-02042009-200044",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02042009-200044/",
  "identifier_uri": "http://hdl.handle.net/10919/26116",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETDMelnykv2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "contractile performance",
    "muscle energetics"
  ],
  "title": "Contractile Performance and Energy Utilization of Skeletal Muscle; Creatine Kinase and Acto-myosin ATPase",
  "type": "Dissertation"
}