{
  "contributor_author": "Harbeck, Julia Dedrich",
  "contributor_committeechair": "Magliaro, Susan G.",
  "contributor_committeemember": [
    "Nespor, Jan K.",
    "Wilkinson, Thomas W.",
    "Scales, Glenda Rose",
    "Moore, David Michael"
  ],
  "contributor_department": "Instructional Technology",
  "date_accessioned": "2014-03-14T20:07:09Z",
  "date_adate": "2001-02-14",
  "date_available": "2014-03-14T20:07:09Z",
  "date_issued": "2001-01-24",
  "date_rdate": "2002-02-14",
  "date_sdate": "2001-02-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A qualitative examination of community college studentsâ   experiences taking on-line courses. The study addresses the research question, \"How do community college students construct their on-line experiences?\" In order to answer this question, the following foci were examined: What are the characteristics of students taking online courses?, Why are they taking on-line courses?, What are facilitative or debilitative dimensions or features that promote or inhibit success in on-line courses?, and, How does the community college infrastructure support students taking web-based courses? The results of the study were grouped into 4 categories: Interpersonal Support, Student Characteristics, Course Issues, and Infrastructure Support. All but 2 of the findings of the PRCC Study are supported by research. The first factor not mentioned in the literature is that some students choose to take a course on-line if they are not interested in the content of the class. The second finding not implicated in the research is that electronic distractions of Instant Messagingâ ¢ and the lure of surfing the Web seem to be more debilitating than interruptions from other sources such as family and work.  Other implications of this study involve concerns that are common to both on-line and on-site instruction, as well as the connection between constructivism and on-line learning. Facilitative and debilitative dimensions or features that promote or inhibit success in on-line courses imply that faculty and institutions need to be adapting to the demands of teaching and learning on the Web.  Implications of the Study examine improvements to the study and ideas for future research.",
  "description_provenance": [
    "Author Email: harbecjd@jmu.edu",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: tom.wilkinson@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: gscales@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:09Z (GMT). No. of bitstreams: 2 finaletd.pdf: 773020 bytes, checksum: b01602746d951d46c99ef8191b6a5130 (MD5) vitae2_5.pdf: 19905 bytes, checksum: 639a4a064e116cf5c298f0135474f0c3 (MD5)   Previous issue date: 2001-01-24"
  ],
  "handle": "26119",
  "identifier_other": "etd-02052001-164701",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02052001-164701/",
  "identifier_uri": "http://hdl.handle.net/10919/26119",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "finaletd.pdf",
    "vitae2_5.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "distance learning",
    "online learning",
    "online student characteristics",
    "web-based learning",
    "distance education",
    "distance learning infrastructure support",
    "web-based instruction",
    "online instruction",
    "community college"
  ],
  "title": "Community College Students Taking Online Courses: The Student Point-of-View",
  "type": "Dissertation"
}