{
  "contributor_author": "Gutierrez, Juan Claudio",
  "contributor_committeechair": "Holladay, Steven D.",
  "contributor_committeecochair": "Prater, Mary Renee",
  "contributor_committeemember": [
    "Freeman, Larry E.",
    "Smith, Bonnie J."
  ],
  "contributor_department": "Biomedical Sciences and Pathobiology",
  "date_accessioned": "2014-03-14T20:07:09Z",
  "date_adate": "2009-03-25",
  "date_available": "2014-03-14T20:07:09Z",
  "date_issued": "2009-01-22",
  "date_rdate": "2009-03-25",
  "date_sdate": "2009-02-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The incidence of malformed newborns is higher in human pregnancies complicated by diabetes mellitus, as compared to non-diabetic pregnancies. Neural tube and cardiac defects predominate among the fetal malformations induced by hyperglycemia. Non-specific maternal immune stimulation is protective in mice against birth malformations caused by chemical or physical teratogens, or by maternal diabetes mellitus. Insulin dependent diabetes was induced in ICR females to study the late gestation fetal heart by morphometric analysis. Diabetic females treated with Freundâ  s compete adjuvant (FCA) or interferon-gamma (IFNÎ³) were also generated to elucidate potential positive effects of maternal immune stimulation during the diabetic pregnancy by morphometric analysis and pathologic scoring. Insulin-dependent CD1 females were generated to analyze late gestation fetal myocardial apoptosis by flow cytometric analysis and by real time-polymerase chain reaction (RT-PCR) analysis of a panel of 5 genes involved in apoptosis/proliferation (Bcl-2, P53, Caspase3, Caspase9 and PkC-e). The morphometric analysis of fetal hearts revealed visibly obvious dilation of ventricular chambers and outflow channel of the left ventricle, and reduction of total myocardial ventricular area in late gestation fetuses, as predominant changes seen in the offspring of diabetic dams. Pathologic scoring revealed that maternal immune stimulation, particularly with FCA, in part alleviated fetal heart changes of cavitary dilation and myocardial reduction. Increased rate of apoptosis/necrosis in the fetal myocardium in late gestation during the diabetic pregnancy was evidenced by flow cytometric analysis. Particularly there was a significant increase in percentage of early apoptotic cells in the fetal myocardium detected by cell markers annexin V and propidium iodide. There was also a significant increase in percentage of late apoptotic/necrotic fetal myocardial cells in the diabetic group compared to the control group. These results suggest that maternal treatment with FCA may in part protect the heart from high hyperglycemia by reducing the number of myocardial cells undergoing apoptosis and necrosis. The RT-PCR analysis revealed subtle changes in gene expression for all the genes except Bcl-2. A paradoxical and dramatic up-regulation of this anti-apoptotic gene was observed in late gestation fetal myocardium from the insulin-dependent hyperglycemic groups. Possibly, this could be a mechanism to protect the fetal myocardial cell from the chronic exposure to a severe hyperglycemic insult and consequent apoptosis. In conclusion, maternal insulin-dependent diabetes caused morphological changes in the late gestation fetal heart. Such changes were in part related to dysregulation of myocardial apoptosis. Maternal immune stimulation with FCA improved fetal heart morphology, by a mechanism that may in part relate to normalizing fetal myocardial apoptosis.",
  "description_provenance": [
    "Author Email: jcgutier@vt.edu",
    "Advisor Email: sdholl@uga.edu; holladay@vt.edu",
    "Advisor Email: mrprater@vt.edu",
    "Advisor Email: lfreeman@vt.edu",
    "Advisor Email: bjsmith@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:09Z (GMT). No. of bitstreams: 1 JCGutierrezETD2009.pdf: 4650752 bytes, checksum: f5e63cc6c2bcabb1abea1000662a5103 (MD5)   Previous issue date: 2009-01-22"
  ],
  "handle": "26117",
  "identifier_other": "etd-02042009-231016",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02042009-231016/",
  "identifier_uri": "http://hdl.handle.net/10919/26117",
  "publisher": "Virginia Tech",
  "relation_haspart": "JCGutierrezETD2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "diabetes",
    "Heart development",
    "apoptosis",
    "diabetes and pregnancy"
  ],
  "title": "Improved Late-gestation Cardiac Morphology in Fetuses of Diabetic Mothers After Maternal Immune Stimulation: Potential Role of Dysregulated Apoptosis",
  "type": "Dissertation"
}