{
  "contributor_author": "Giese, Laura",
  "contributor_committeechair": "Aust, Wallace Michael",
  "contributor_committeemember": [
    "Jones, Robert H.",
    "Kolka, R. K.",
    "Trettin, C. C.",
    "Dolloff, C. Andrew",
    "Parkhurst, James A.",
    "Oderwald, Richard G."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:07:09Z",
  "date_adate": "2001-02-08",
  "date_available": "2014-03-14T20:07:09Z",
  "date_issued": "2001-01-12",
  "date_rdate": "2002-02-08",
  "date_sdate": "2001-02-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Riparian forests are integral components of the landscape.  The inherent biogeochemical processes that occur in such forests provide numerous benefits to wildlife and society.  Maintaining good water quality is a major benefit from riparian forests and therefore, the maintenance, creation, or restoration of riparian forests is indispensable.  This study was designed to broaden current knowledge of the complex, interrelated biogeochemical processes and determine indices for riparian forest restoration based on the various carbon pools/fluxes that may represent restoration success.  \tThis study was implemented on the Savannah River Site, an Environmental Research Park, where several riparian forests are recovering from thermal disturbances.  The streams in these forests were subjected to thermal discharges that increased flows and resulted in removal of soil and a decline in the amount of woody vegetation. Two of these riparian forests are at different ages post-disturbance and represent different stages of recovery, which provides an exceptional opportunity to study successional processes in riparian forests and enhance restoration efforts.     \tLinear transects perpendicular to the main stream channels were established in 2 recovering riparian forests of different ages (two areas in Pen Branch ~ 8 years post-disturbance; Fourmile Branch ~ 12 years post disturbance) and an undisturbed (thermally) more mature riparian forest (Meyerâ  s Branch ~ 60 years).  Along these transects quantitative data were obtained on above and belowground carbon pools and fluxes.   \tCarbon pools exhibited a close correlation with riparian forest development.  Biomass and carbon pools increased with increasing riparian forest stand age.  The importance of the herbaceous carbon pool declined relative to the total above ground biomass, and the root carbon pool increased with forest age/succession.  In general, net primary production (NPP) in young riparian forests (~8-10 years) rapidly approached and even exceeded NPP of more mature riparian forests.  Once the herbaceous stage of succession was surpassed, the litterfall component of NPP plays a greater role riparian forests.  As a woody overstory became established (after ~ 8-10 years), annual litterfall rates as a function of NPP were independent of forest age.  \tEstablishment of woody species occurred ~8 to 10 years after thermal disturbance and litterfall amount in young riparian forests rapidly became comparable to mature riparian forests.  Lateral litter movement from the riparian forest toward the stream was less than the amount of litter (carbon pool) deposited from upstream into the riparian forest during a flood event.  Overall lateral litter movement supplied less energy to the stream system than vertical inputs. A decline in riparian forest floor biomass was observed with increasing riparian forest development. However, a difference in foliar forest floor percent carbon lended itself to a minimal increase in the forest floor carbon pool with increasing riparian forest age.  Woody debris in riparian forests comprised a relatively small carbon pool compared to tree and soil carbon pools.  \tThe species composition of litter appeared to be more of an overriding factor influencing decomposition rates than forest age. The influence of litter quality was evident in the decomposition rates of the different litter composites used in this study.  In all 4 sites the litter composite from the mature riparian forest decomposed significantly more than the litter composites from the younger riparian forests.  The fairly rapid decomposition of red maple (Acer rubrum L.), which was one of the main components in the mature riparian forest litter composite, influenced the greater decomposition rate. The litter composites from the younger riparian forests were similar and both included more decomposition resistant litter types, specifically waxmyrtle (Myrica cerifera L.) and alder (Alnus serrulata (Ait.) Willd.).  Decomposition rates did not differ between the individual successional stages.  \tRiparian forests are intimately associated with their hydroperiod.  During flood events the riparian forest receives inputs of organic matter and sediment, and the amount of deposition may decrease along a distance gradient from the main stream channel. The differential amount of inputs could affect forest productivity.   However, in these riparian forests, a distance gradient effect was not observed.  Trends in herbaceous biomass were evident along a microtopographic moisture gradient.  The ridge and swale microtopography prevalent in the younger riparian forests counteracted a distance from the stream channel gradient effect across the riparian forest.  \tThis study provided knowledge of how carbon pools and fluxes change with riparian forest recovery from disturbance as well as through different seral stages.  Implementing the findings of this study will enhance restoration evaluation efforts to ensure that these areas continue to provide the numerous benefits gleamed from them.",
  "description_provenance": [
    "Author Email: lgiese@vt.edu",
    "Advisor Email: waust@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:09Z (GMT). No. of bitstreams: 1 Etd2.pdf: 1184746 bytes, checksum: 928f0add68f001ef1955f460ec66735d (MD5)   Previous issue date: 2001-01-12"
  ],
  "handle": "26118",
  "identifier_other": "etd-02052001-064629",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02052001-064629/",
  "identifier_uri": "http://hdl.handle.net/10919/26118",
  "publisher": "Virginia Tech",
  "relation_haspart": "Etd2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "riparian",
    "bottomland hardwood",
    "restoration",
    "forest succession",
    "carbon"
  ],
  "title": "Carbon Pools and Fluxes as an Indicator of Riparian Restoration",
  "type": "Dissertation"
}