{
  "contributor_author": "Wongpaibool, Virach",
  "contributor_committeechair": "Jacobs, Ira",
  "contributor_committeemember": [
    "Stolen, Roger Hall",
    "Pratt, Timothy J.",
    "Woerner, Brian D.",
    "Shaw, John Kenneth"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:07:08Z",
  "date_adate": "2003-02-10",
  "date_available": "2014-03-14T20:07:08Z",
  "date_issued": "2003-01-31",
  "date_rdate": "2004-02-10",
  "date_sdate": "2003-02-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this dissertation the performance of a novel variant of a return-to-zero (RZ) modulation format, based on square-wave phase modulation and filtering of a continuous-wave (CW) signal, is investigated and compared with various modulation formats considered in the literature. We call this modulation format continuous-wave square-wave (CWSW). With CWSW an RZ pulse train is generated by phase modulating the CW signal by a periodic square-wave phase function having an amplitude of   and frequency of half the bit rate, and then filtering the signal. The filter performs phase-to-amplitude conversion, resulting in an alternate-sign RZ pulse train, which is shown to be resistant to fiber dispersion. The alternate-sign RZ pulse train is then amplitude modulated with the data before the transmission. Alternate signs between adjacent pulses makes this signal format robust to impairments caused by the optical fiber, similar to a conventional alternate-sign RZ signal format. However, the unique property of the CWSW signal format is that individual pulses can induce peak intensity enhancement (PIE), a phenomenon by which the peak of a pulse increases during the initial propagation in the presence of dispersion. The PIE in effect delays the decrease in the pulse peak, which represents the signal level for bit 1. Thus, the eye opening at the receiver is improved. An analytically tractable model is developed to explain the occurrence of the PIE, which cannot be achieved with a conventional pulse shape. The sources of performance degradations for different modulation formats in single-channel 40 Gb/s systems are also discussed in this dissertation. Various transmission system configurations of practical interest are considered and the performance of CWSW is compared with alternative modulation formats. It is found that the CWSW signal format performs significantly better than the other considered modulation formats in systems not employing dispersion compensation and is comparable to the others in dispersion-managed systems. Furthermore, the transmitter configuration of the CWSW signal format is simpler than the other approaches.",
  "description_provenance": [
    "Author Email: vwongpai@vt.edu",
    "Advisor Email: stolen@vt.edu",
    "Advisor Email: tipratt@vt.edu",
    "Advisor Email: ijacobs@vt.edu",
    "Advisor Email: woerner@vt.edu",
    "Advisor Email: shaw@vzavenue.net",
    "Made available in DSpace on 2014-03-14T20:07:08Z (GMT). No. of bitstreams: 9 01_Ch1.pdf: 1510902 bytes, checksum: 5d93e947ab430cdb43123a7dea7a43bc (MD5) 05_Ch5.pdf: 875542 bytes, checksum: 94e13ea4345a4d78654b6c7c0c60f4eb (MD5) 08_Back.pdf: 288692 bytes, checksum: ada055f07091b9d2b42bc66e909c6eec (MD5) 06_Ch6.pdf: 6004353 bytes, checksum: 0ac63386abb4a0d83faa05885a68a4ee (MD5) 07_Ch7.pdf: 189890 bytes, checksum: d5564b712ca7a13b2f1aec97028027e0 (MD5) 03_Ch3.pdf: 756165 bytes, checksum: 5d442fa372f15c6501c09b5dd9823a8b (MD5) 04_Ch4.pdf: 501937 bytes, checksum: 55a5046fae64913c54dc12b9654b044d (MD5) 02_Ch2.pdf: 741754 bytes, checksum: 9f40f617b9c0a20a30ae9c2a69ace487 (MD5) 00_Front.pdf: 512038 bytes, checksum: c3b8ce77e66f80c0c756c55fef9b76e8 (MD5)   Previous issue date: 2003-01-31"
  ],
  "handle": "26111",
  "identifier_other": "etd-02042003-164941",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02042003-164941/",
  "identifier_uri": "http://hdl.handle.net/10919/26111",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01_Ch1.pdf",
    "05_Ch5.pdf",
    "08_Back.pdf",
    "06_Ch6.pdf",
    "07_Ch7.pdf",
    "03_Ch3.pdf",
    "04_Ch4.pdf",
    "02_Ch2.pdf",
    "00_Front.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Phase Modulation",
    "WDM",
    "Modulation Format",
    "Fiber Optics",
    "Optical Fiber Communication"
  ],
  "title": "Improvement of Fiber Optic System Performance by Synchronous Phase Modulation and Filtering at the Transmitter",
  "type": "Dissertation"
}