{
  "contributor_author": "Turner, Scot Bruce",
  "contributor_committeecochair": [
    "Mallory, Walter D.",
    "Twiford, Travis W."
  ],
  "contributor_committeemember": [
    "Byers, Larry",
    "Krill, Cecelia W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:10Z",
  "date_adate": "2008-02-29",
  "date_available": "2014-03-14T20:07:10Z",
  "date_issued": "2008-01-22",
  "date_rdate": "0000-00-00",
  "date_sdate": "2008-02-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This causal comparative study examined the relationship of the school demographic factors of ethnicity, socioeconomic percentages, academic performance, and school location (urban versus rural) on principal leadership with data analyzed when schools were placed into groups ex-post-facto. One-Hundred and sixty-nine teachers representing six public high schools located in Virginia were surveyed using Powellâ  s (2004) survey. Five areas, or domains of leadership were analyzed, (I) Vision, Mission, and Culture; (II) Curriculum and Classroom Instruction; (III) Collaboration and Shared Leadership; (IV) Family and Community Involvement; (V) Effective Management. Quantitative data were analyzed (means, frequency, ANOVA, Tukey-Kramer HSD) with school results placed into demographic groups and locations to examine group differences in perceptions of principal leadership. Significant differences were found when schools were grouped according to location and demographic factors. A model of the contextual elements on the role of principal leadership was developed, and implications for research and future studies were presented.",
  "description_provenance": [
    "Author Email: scot.turner@fcps.edu",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: lbyers@vt.edu",
    "Advisor Email: cecelia.krill@fcps.edu",
    "Made available in DSpace on 2014-03-14T20:07:10Z (GMT). No. of bitstreams: 1 scotturnerdiss.pdf: 516187 bytes, checksum: 55cd0e470576ed5a73fbc3eb93415b27 (MD5)   Previous issue date: 2008-01-22"
  ],
  "handle": "26127",
  "identifier_other": "etd-02052008-163907",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02052008-163907/",
  "identifier_uri": "http://hdl.handle.net/10919/26127",
  "publisher": "Virginia Tech",
  "relation_haspart": "scotturnerdiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Minority Status",
    "SES",
    "Successful School",
    "Rural School",
    "Urban School",
    "Leadership",
    "Principals"
  ],
  "title": "Teacher's Perceptions of Leadership Characteristics of Public High School Principals Associated with Student Socioeconomic Status, Community Type, Race, and Student Achievement",
  "type": "Dissertation"
}