{
  "contributor_author": "Gillespie, Betty Lynn",
  "contributor_committeechair": "Eisler, Richard M.",
  "contributor_committeemember": [
    "Franchina, Joseph J.",
    "Foti, Roseanne J.",
    "Stephens, Robert S.",
    "Clum, George A. Jr."
  ],
  "contributor_department": "Clinical Psychology",
  "date_accessioned": "2014-03-14T20:07:10Z",
  "date_adate": "2007-02-05",
  "date_available": "2014-03-14T20:07:10Z",
  "date_issued": "1993-04-05",
  "date_rdate": "2012-08-23",
  "date_sdate": "2007-02-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Vulnerability to Feminine Gender Role Stress (FGRS), defined as the tendency to evaluate the self along feminine dimensions, was introduced as a psychosocial mediator between environmental stressors and maladaptive outcomes to explain the higher rate of particular mental health problems among women relative to men. FGRS was proposed to result from 1) vulnerability, adherence to feminine standards for self-appraisal, and 2) exposure to environmental conditions which directly threaten or challenge one's ability to live up to these standards. Two studies investigated the FGRS construct. In Study 1, women who appraised threats and challenges to feminine commitments as highly stressful, rated feminine traits as more personally important to exhibit, than did women who did not appraise these situations as highly stressful. Additionally vulnerability to FGRS interacted with inadequate social support to predict depressive symptomatology in women. Study 2 compared subjects high and low in FGRS vulnerability in responses to a counseling task presented as either a feminine or gender-neutral stressor. When the task was presented as a feminine stressor, women whose scores on the FGRS scale indicated adherence to feminine self-evaluation criteria evidenced greater physical stress, and cognitive engagement, including attempts to cognitively reframe the situation in order to cope with it, than did women who did not show adherence to these criteria. Across stressors high FGRS subjects reported greater reliance than low FGRS subjects on feminine styles of coping, including providing and soliciting social support. These findings elucidate the processes underlying women's vulnerability to FGRS and contribute to the understanding of gender-role mediated psychopathology in women.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:07:10Z (GMT). No. of bitstreams: 1 LD5655.V856_1993.G555.pdf: 3569684 bytes, checksum: a0e906c82efce10251d4cd813149cd41 (MD5)   Previous issue date: 1993-04-05",
  "format_medium": "BTD",
  "handle": "26122",
  "identifier_other": "etd-02052007-072446",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02052007-072446/",
  "identifier_uri": "http://hdl.handle.net/10919/26122",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1993.G555.pdf",
  "subject": [
    "Sex role Psychological aspects.",
    "Identification (Psychology)",
    "Stress (Psychology)",
    "Women Psychology."
  ],
  "subject_lcc": "LD5655.V856 1993.G555",
  "title": "Stress and the feminine self-concept : responses to feminine and gender-neutral stressors as a function of feminine self-evaluation",
  "type": "Dissertation"
}