{
  "contributor_author": "Sebens, Patricia Anne Shope",
  "contributor_committeechair": "Salmon, Richard G.",
  "contributor_committeemember": [
    "Sughrue, Jennifer A.",
    "Crockett, Jean B.",
    "Driscoll, Lisa G.",
    "McDowell, George R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:10Z",
  "date_adate": "2006-05-22",
  "date_available": "2014-03-14T20:07:10Z",
  "date_issued": "2006-01-23",
  "date_rdate": "2006-05-22",
  "date_sdate": "2006-02-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The purpose of this dissertation was to provide a functional definition of adequacy synthesized from the application of efficiency (E), equality/equity/dignity (EED), and excellence/quality (EQ) value clusters found in various state litigations pertaining to the financial systems used to distribute educational opportunity. Questions researched in this study were (a) In what manner might the tension of the paradoxical demands of community responsibility and individual rights housed within the principle of liberty be used creatively in the development of public policy? (b) How do the value clusters inherent in democracy allow for balance and affect the provision of adequate educational opportunity? (c) Using value critical analysis, how does funding litigation clarify the search for the meaning of adequate educational opportunity? (d) What themes appear throughout these cases that may be used to build consensus for the development of policy frameworks and the evaluation of present funding systems designed to provide adequate educational opportunity in a particular time and place?  <p>As an examination of policy, legal research was used to analyze litigation in cases in which the provision of educational opportunity was challenged based on the terms of art under girding standards established for the delivery of public education. This study was implemented in five stages:   <p>1. Values clusters to be examined were selected through the review of the history of educational opportunity in this nation and current literature addressing public values and education policy.  <p>2. Through the examination of the paradox within the principle of liberty that guarantees individual rights and requires community responsibility, consideration was given to the creative tension, both principled and structural, that laid the foundation for and continues to drive the democratic process.  <p>3. The role that policy development plays in establishing balance was outlined, noting the argumentation process used to transform knowledge through values, to create the framework necessary to take consistent action.   <p>4. Value critical analysis examined the definition given to values clusters of efficiency (E), equality/equity/dignity (EED), and excellence/quality (EQ) as found in court cases adjudicated in the last fifty years affecting the provision of educational opportunities. Litigation was analyzed, considering the standards established for the delivery of public education in state constitutions, the value given to the terms of art underpinning those standards, and the definitions for those terms as established by the courts.   <p>5. Using the information gleaned, a policy framework was developed to structure adequate educational opportunity for all children.",
  "description_provenance": [
    "Author Email: psebens@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:10Z (GMT). No. of bitstreams: 1 Sebens.pdf: 659555 bytes, checksum: d1e01a0120d92252789c4ffc6388bfd7 (MD5)   Previous issue date: 2006-01-23"
  ],
  "handle": "26121",
  "identifier_other": "etd-02052006-225652",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02052006-225652/",
  "identifier_uri": "http://hdl.handle.net/10919/26121",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sebens.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "policy values",
    "adequacy",
    "value critical analysis",
    "policy frameworks",
    "excellence",
    "equity",
    "quality",
    "dignity",
    "educational finance",
    "efficiency",
    "educational opportunity",
    "equality"
  ],
  "title": "Rationale and Structure for Adequate Public Education: A Value Critical Approach",
  "type": "Dissertation"
}