{
  "contributor_author": "Hartley, Douglas Lee",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Tripp, Norman Wayne",
    "Odom, Winston O.",
    "Quisenberry, Larry D."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:10Z",
  "date_adate": "2007-02-14",
  "date_available": "2014-03-14T20:07:10Z",
  "date_issued": "2007-01-30",
  "date_rdate": "2009-02-14",
  "date_sdate": "2007-02-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In 2006, 19 states had some type of route to alternative principal certification. An additional five states had either proposed or were considering offering alternative routes to principal certification (Education Commission of the States, 2006). These numbers indicate a nation-wide development and are worthy of investigation. In states across the country that have implemented alternative certification routes, the gatekeepers usually are directors of human resources who recruit, screen, rank, and forward applications to the superintendent. As a result, even though local districts may receive a green light from the state to hire alternatively certified principals; that approval does not guarantee they will be hired.  To gain insight into the willingness of directors of human resources to support hiring alternatively certified principals, a two-stage study was conducted. First, 12 purposefully selected directors of human resources nationwide were interviewed. Second, data collected from the interviews in union with a review of the literature on alternative certification was used to identify domains, themes, and items to develop web mail questionnaires consisting of Thurstone and Likert scale statements. The web mail questionnaires were emailed to 689 directors of human resources selected from the directory of the American Association of School Personnel Administrators (AASPA) on November 1, 2005.   Principal components analysis was applied to reduce the number of overlapping variables. Multiple linear regression was the major statistical procedure used to determine relationships between the predictor variables and the willingness of directors of human resources to support hiring alternatively certified principals. Five of 20 predictor variables were found to be significant, with anticipated concerns by directors of human resources being the strongest predictor. Conditions of the individual (e.g., â  right fit,â   leadership skills), being located in a primarily urban area, district experiencing a shortage in the quality of principals, and more willingness to support hiring alternatively certified assistant principals than principals were the other significant predictors. Candidates seeking employment in states that have alternate routes may experience a little resistance, but directors, on average, fell into the high neutral (more positive) position when it came to supporting hiring alternatively certified principals.",
  "description_provenance": [
    "Author Email: dhartley@ycsd.york.va.us",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: wodom@hopewell.k12.va.us",
    "Advisor Email: lquisenb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:10Z (GMT). No. of bitstreams: 1 DHartleyETD2submission.pdf: 1799882 bytes, checksum: cc0e45a9566e2250956a6547004bfa39 (MD5)   Previous issue date: 2007-01-30"
  ],
  "handle": "26125",
  "identifier_other": "etd-02052007-155459",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02052007-155459/",
  "identifier_uri": "http://hdl.handle.net/10919/26125",
  "publisher": "Virginia Tech",
  "relation_haspart": "DHartleyETD2submission.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "conditions",
    "support",
    "willingness",
    "behaviors"
  ],
  "title": "Variation in the Willingness of Directors of Human Resources to Support Hiring Alternatively Certified Principals",
  "type": "Dissertation"
}