{
  "contributor_author": "Pederson, Adam Micheal-Paul",
  "contributor_committeechair": "Gibson, Harry W.",
  "contributor_committeemember": [
    "Esker, Alan R.",
    "Deck, Paul A.",
    "Tanko, James M.",
    "Turner, S. Richard"
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:07:10Z",
  "date_adate": "2009-03-07",
  "date_available": "2014-03-14T20:07:10Z",
  "date_issued": "2009-01-20",
  "date_rdate": "2009-03-07",
  "date_sdate": "2009-02-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Production of efficiently synthesizable, strongly associating crown ether-based cryptands is desired for pseudorotaxane complexation of bipyridinium guests to produce suprapolymers and supramolecularly-linked block copolymers.  Cryptands based on bis(meta-phenylene)-32-crown-10 (BMP32C10) were synthesized. The functionality of phenylenemethanol-BMP32C10 cryptand III-3 (Ka = 2.0 x 104 M-1) did not negatively affect binding strength, although the strength of complexation is marginal to achieve the desired suprapolymers. The cryptand dimethylpyridyl-BMP32C10 IV-2 was synthesized in an attempt to improve over the binding ability of the pyridyl-BMP32C10 cryptand IV-1; instead, interesting host design insights were discovered as binding strengths were reduced over 1000-fold. The crystal structure of IV-2 shows acyl-aryl conjugation which limits the hostâ  s ability to accept guests.  Synthesis of larger cis-di(carbomethoxybenzo)-3n-crown-n crown ethers was explored using the high concentration, template technique previously reported for cDB24C8 diester. cDB30C10 diester (V-1c) was produced in 93% yield; the desired pyridyl-cDB30C10 cryptand V-12 binds paraquat strongly (Ka = 1-2x105 M-1) and diquat stronger than any other host (Ka = 1.9x106 M-1), both in 1:1 fashions; association constants were measured by ITC. X-ray crystallography of the complexes shows the cryptandâ  s para arm is too far away to interact with paraquat and the host has numerous bifurcated interactions with diquat, explaining the difference in binding strengths.   Syntheses of the regioisomers of cDB27C9 diester was also explored; the cyclization yields (cDB27C9S, VI-2: 59% and cDB27C9L, VI-3: 44%) are lower, likely due to poor attack angles due to mismatched arm length in cyclization, than the equivalent length ethyleneoxy-armed cDB24C8 and cDB30C10. Modeling of the cryptand isomers, pyridyl-cDB27C9S and pyridyl-cDB27C9L, showed that the former should improve para arm interaction with paraquat, but should be sterically hindered for diquat and the latter should have a highly flexible, poorly preorganized interaction with either type of guest. ITC, MS, and crystallography data supported the predictions.  Derivatization of the pyridyl-cDB30C10 cryptand V-12 was explored using chelidamic acid (VII-1). Schemes yielding alcohol, alkyl halide, alkyne, and TEMPO functionality were followed, but failed. Currently, functionalized cryptand derivatives have not been achieved, future directions are proposed.",
  "description_provenance": [
    "Author Email: adamp@vt.edu",
    "Advisor Email: hwgibson@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: pdeck@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: srturner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:10Z (GMT). No. of bitstreams: 1 AdamPedersonDissertation20090223.pdf: 7126006 bytes, checksum: cf56d590ad56bebac060279d7ba1f42f (MD5)   Previous issue date: 2009-01-20"
  ],
  "handle": "26128",
  "identifier_other": "etd-02052009-125852",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02052009-125852/",
  "identifier_uri": "http://hdl.handle.net/10919/26128",
  "publisher": "Virginia Tech",
  "relation_haspart": "AdamPedersonDissertation20090223.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "crown ether",
    "cyclization",
    "host-guest",
    "molecular recognition",
    "cryptand",
    "paraquat",
    "diquat",
    "supramolecular polymer",
    "polymer"
  ],
  "title": "Efficient Syntheses of Strong Binding Cryptands and their Derivatives for Supramolecular Polymer Synthesis",
  "type": "Dissertation"
}