{
  "contributor_author": "Kim, Byoung Joon",
  "contributor_committeecochair": [
    "Kavanaugh, Andrea L.",
    "Hult, Karen M."
  ],
  "contributor_committeemember": [
    "Rees, Joseph V.",
    "Dudley, Larkin S."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:07:11Z",
  "date_adate": "2009-02-18",
  "date_available": "2014-03-14T20:07:11Z",
  "date_issued": "2009-01-19",
  "date_rdate": "2009-02-18",
  "date_sdate": "2009-02-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Politically interested individual citizens often use information and communication technology (ICT) to facilitate and augment their civic and political participation.  At the local level, ICT plays an important role for communication and information sharing in order for local groups to create awareness and draw citizens into public deliberation about local issues and concerns.  This research examines the interplay of individual and local group level factors in order to better understand the relationship between civic engagement and ICT, especially the internet, by using household survey data from the town of Blacksburg, Virginia and environs in 2005 and 2006.  It seeks to reconcile those different levels of analysis relating to the use and impact of the internet on civic engagement in local governance.    This study identifies the distinctive influences at both the individual citizen level and the group level by applying a multilevel statistical model (the Hierarchical Linear Model).  First, this study found the effects of internal and external political efficacy and community collective efficacy as significant individual level influences on internet use for civic and political purposes.  Second, group internet useâ  which includes new internet technologiesâ  and group political discussion were revealed as key influences on citizensâ   perspectives on the helpfulness of the internet for civic and political purposes at the group level of analysis.  Finally, in multilevel analysis, those recognized group level variables (group internet use and group political discussion and interests) led to positive agreement with the following statements: 1) the internet has helped me feel more connected with people like myself in the local area; 2) the internet has helped me feel more connected with a diversity of people in the local area; and 3) the internet has helped me become more involved in local issues that interest me when taking individual level variables into account.",
  "description_provenance": [
    "Author Email: bjkim@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: kavan@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:11Z (GMT). No. of bitstreams: 2 BJoonKimPhDETD.pdf: 1760208 bytes, checksum: 79280be260d4140d3944ebe76e037309 (MD5) IRB_DG07_05-504_cont_3.pdf: 252620 bytes, checksum: 5f1a4dd8fda9a5df5a566d0f629b6564 (MD5)   Previous issue date: 2009-01-19"
  ],
  "handle": "26129",
  "identifier_other": "etd-02052009-215007",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02052009-215007/",
  "identifier_uri": "http://hdl.handle.net/10919/26129",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "BJoonKimPhDETD.pdf",
    "IRB_DG07_05-504_cont_3.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "E-democracy",
    "E-government",
    "Information and Communication Technologies",
    "Hierarchical Linear Model",
    "Local Community Group",
    "Internet",
    "Local Governance",
    "Civic Engagement"
  ],
  "title": "The Impact of the Internet on Civic and Political Participation in Local Governance: A Mulitilevel Model for Bridging Individual and Group Levels of Analysis",
  "type": "Dissertation"
}