{
  "contributor_author": "Arnette, Betsy",
  "contributor_committeechair": "Wiswell, Albert K.",
  "contributor_committeemember": [
    "Smith, Linda",
    "Cline, Marvin Gerald",
    "Morris, Linda E.",
    "Boucouvalas, Marcie"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:07:11Z",
  "date_adate": "2003-04-04",
  "date_available": "2014-03-14T20:07:11Z",
  "date_issued": "2003-01-14",
  "date_rdate": "2004-04-04",
  "date_sdate": "2003-02-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The ontology of organizational story begs us to discover when stories work best and why.  Is there a best practice for creating and telling stories?  This study examined one organizationâ  s use of storytelling as a means of facilitating an innovation and what happened from the perspective of the storyteller.  The study revealed the role of storytelling during the organizational initiative.  This qualitative study analyzed eleven written and oral stories using grounded theory.  Also using grounded theory, six tellersâ   interviews were analyzed to gain the tellersâ   perspective of the role of story.  Storyteller selection was based on those who had consistently told the stories throughout the initiative and were interested in the effort being successful.  The study revealed an implicit message that was intended to be understood in gaining full acceptance of the initiative.  Based on the results of this study, the story promoting innovation contained four consistent characteristics: event, dilemma, consequence(s) and outcome.  The true event used in the story was relevant and known by most personnel.  The dilemma contained the implicit tension created when choosing to go against the organizational practice and norm.  The consequence(s) in the story always conveyed success.  The outcome represented the personal benefits obtained.  To improve on the story used to promote the new knowledge management innovation, the organization might further examine its explicit and implicit norms and address the emergent concerns and vulnerabilities of the characters in the story.",
  "description_provenance": [
    "Author Email: bearnett@vt.edu",
    "Advisor Email: dr.llsmith@erols.com",
    "Advisor Email: mcline@vt.edu",
    "Advisor Email: lmorris@gwu.edu",
    "Advisor Email: wiswell@vt.edu",
    "Advisor Email: marcie@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:11Z (GMT). No. of bitstreams: 1 BArnetteDissertation.pdf: 365831 bytes, checksum: 9ac29485812516fb71d9a5058b2c6f08 (MD5)   Previous issue date: 2003-01-14"
  ],
  "handle": "26134",
  "identifier_other": "etd-02062003-202707",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02062003-202707/",
  "identifier_uri": "http://hdl.handle.net/10919/26134",
  "publisher": "Virginia Tech",
  "relation_haspart": "BArnetteDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Knowledge Management",
    "Organization",
    "Storytelling"
  ],
  "title": "Story as an Approach for Facilitating a Knowledge Management Innovation",
  "type": "Dissertation"
}