{
  "contributor_author": "Al-Taher, Hossam",
  "contributor_committeecochair": [
    "Novak, John T.",
    "Dietrich, Andrea M."
  ],
  "contributor_committeemember": [
    "Gallagher, Daniel L.",
    "Hughes, John M.",
    "Daniels, Walter Lee"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:07:11Z",
  "date_adate": "2001-02-17",
  "date_available": "2014-03-14T20:07:11Z",
  "date_issued": "2001-02-02",
  "date_rdate": "2002-02-17",
  "date_sdate": "2001-02-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Copper is applied to many crops as a fungicide/bactericide, including plasticulture tomato growing operations. Field tests have shown that copper is sometimes found in ground water near these fields. Therefore, a laboratory study was undertaken to determine if this copper can result from plasticulture application and to determine the mechanisms that account for the movement through soil to the subsurface. From the factors that may affect this mobility process; TOC, dryness and its temperature cycle and water content of the soil were selected for study. These factors were investigated in both batch and continuous flow (column) processes. Copper mobility through soil columns was associated with TOC mobility, and soil drying had a major effect on both copper and TOC mobility. The concentration of copper eluted from columns containing dried soils was up to 20 times higher from those containing wet soils. The extent of dryness was found to affect mobility. First-flush-pattern for both copper and TOC from the columns was observed in all columns studies. In this research the copper mobility through the A- and B-horizon of Bojac sandy loam from the Eastern Shore of Virginia was studied. This study included both batch and column processes. The effects of pH, TOC and humic substances were investigated. The mobility of copper was found to be higher through A-horizon soil. The pH was found to have a considerable effect on the mobility of copper and TOC. The highest mobility of copper was achieved at pH 6.24 and its mobility through both soil horizons was associated with the mobility of TOC. A study of the humic substances indicated that fulvic acids had 4 times higher adsorption capacity for copper than humic acids.  The association between fulvic acids and copper, coupled with the mobility of TOC and fulvic acids in the soil, accounted for transport of copper through soil columns.",
  "description_provenance": [
    "Author Email: haltaher@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Advisor Email: dang@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Advisor Email: jmhughes@vt.edu",
    "Advisor Email: wdaniels@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:11Z (GMT). No. of bitstreams: 1 submission2.PDF: 237271 bytes, checksum: 4cd4b8f68ca50aa59ed50370f8868052 (MD5)   Previous issue date: 2001-02-02"
  ],
  "handle": "26132",
  "identifier_other": "etd-02062001-154844",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02062001-154844/",
  "identifier_uri": "http://hdl.handle.net/10919/26132",
  "publisher": "Virginia Tech",
  "relation_haspart": "submission2.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "copper",
    "mobility",
    "soil",
    "horizon"
  ],
  "title": "Factors Affecting Mobility of Copper in Soil-Water Matrices",
  "type": "Dissertation"
}