{
  "contributor_author": "Benson, Sonya Denese",
  "contributor_committeechair": "Moore, Robert B.",
  "contributor_committeemember": [
    "Riffle, Judy S.",
    "Turner, S. Richard",
    "Baird, Donald G.",
    "Nazarenko, Sergei"
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:07:12Z",
  "date_adate": "2011-05-04",
  "date_available": "2014-03-14T20:07:12Z",
  "date_issued": "2011-01-24",
  "date_rdate": "2011-05-04",
  "date_sdate": "2011-02-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Semicrystalline ionomers are an important class of polymers that are utilized in a wide range of applications.  The particular end-use applications of these materials are determined by their chemical, physical, and thermomechanical properties which are directly related to their crystallization behavior.  It is therefore critical to identify structure-property relationships for these materials.  Sulfonated syndiotactic polystyrene (SsPS) is used as a model semicrystalline ionomer and two approaches are utilized to control the rate of crystallization of the SsPS ionomer in the presence of ionic aggregates. The first approach investigates the effect of the incorporation of nanoscale particles, montmorillonite clay, on the crystallization behavior of SsPS.  The morphology of the ionomer clay hybrids were studies via TEM and WAXD while the crystallization behavior of SsPS in the presence of the clay was evaluated using DSC.  It was found that the SsPS matrix containing 5 wt.% organically-modified clay crystallized more rapidly than the sPS homopolymer containing the same clay content.  This behavior is attributed to the presence of homogenously dispersed nanoscale clay platelets that act as nucleation sites distributed throughout the ionomer matrix.   The second approach that employed involved the manipulation of SsPS ionomer architecture via a controlled placement of the ionic sulfonate groups along the polymer backbone.  A post-polymerization sulfonation technique was developed to place the sulfonate groups along the homopolymer backbone in a non-random fashion leading to a pseudo-block ionomer architecture.  The crystallization behavior of the non-randomly sulfonated SsPS ionomer is compared to randomly sulfonated SsPS using differential scanning calorimetry.  The morphologies of the two ionomers were studied using SALLS and SAXS.  We have found that the non-randomly sulfonated SsPS ionomer crystallizes much more rapidly than the randomly sulfonated ionomer.  The more rapid crystallization behavior of the non-random ionomer to the presence of longer sequences of unsulfonated homopolymer that are able to readily organize into crystalline structures than the random SsPS ionomer containing the same ionic content. â",
  "description_provenance": [
    "Author Email: sdbenson@vt.edu",
    "Advisor Email: rbmoore3@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: srturner@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: sergei.nazarenko@usm.edu",
    "Made available in DSpace on 2014-03-14T20:07:12Z (GMT). No. of bitstreams: 2 Benson_SonyaD_D_2011_Copyright.pdf: 206792 bytes, checksum: b318ba53b239afb7c5d7daf55cbd05b1 (MD5) Benson_SonyaD_D_2011_4.pdf: 17601748 bytes, checksum: 7b2181f2e87ea0a62a757deed8e7c5bb (MD5)   Previous issue date: 2011-01-24"
  ],
  "handle": "26137",
  "identifier_other": "etd-02062011-171639",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02062011-171639/",
  "identifier_uri": "http://hdl.handle.net/10919/26137",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Benson_SonyaD_D_2011_Copyright.pdf",
    "Benson_SonyaD_D_2011_4.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ionomer",
    "nanocomposite",
    "crystallization",
    "syndiotactic polystyrene"
  ],
  "title": "The Effect of Nanoscale Particles and Ionomer Architecture on the Crystallization Behavior of Sulfonated Syndiotactic Polystyrene",
  "type": "Dissertation"
}