{
  "contributor_author": "Simon, Kevin Scott",
  "contributor_committeechair": "Benfield, Ernest Fredrick",
  "contributor_committeemember": [
    "Buikema, Arthur L. Jr.",
    "Culver, David C.",
    "Fong, Daniel W.",
    "Webster, Jackson R."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:07:12Z",
  "date_adate": "2000-02-08",
  "date_available": "2014-03-14T20:07:12Z",
  "date_issued": "2000-02-04",
  "date_rdate": "2001-02-08",
  "date_sdate": "2000-02-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this study of energy pathways in karst groundwater the first chapter examines spatial and temporal patterns of bacterial density and activity in the Dorvan-Cleyzieu karst aquifer, France.  During baseflow, bacterial density and activity in the water column was similar in upper and lower zones of the aquifer.  Floods apparently scoured inactive bacteria from the aquifer matrix but had little effect on respiring cells.  Dissolved organic carbon was more abundant at the base of the aquifer, probably because of patchy distribution of particulate organic matter in upper aquifer zones that leached dissolved organic carbon. The temporal sequence of flooding and drying in the aquifer appears to play an important role in the maintenance of biofilms which should be important energy sources to higher trophic levels in the aquifer.  The ecosystem expansion and contraction model, originally developed to describe surface streams, may be a good descriptor of spatial and temporal patterns of microbial films in karst aquifers.  The process of leaf and wood breakdown in cave streams in Organ Cave, West Virginia is examined in Chapter 2.  Leaf and wood breakdown rates and microbial biomass and respiration on leaves and wood were compared between cave streams with and without coarse particulate organic matter (CPOM) input from the surface to examine the role of CPOM input in leaf and wood breakdown.   Breakdown rate and pattern of microbial colonization of leaves and wood were typical of results reported for surface streams. Unlike in surface streams, CPOM input did not influence breakdown rate or microbial colonization on leaves and wood, apparently because nutrients are not limiting in cave streams.  Nutrient addition had little effect on microbial films on wood in either stream type.  Gammarus minus is an important shredder in Organ Cave streams and G. minus colonization accelerated leaf breakdown rates.  Leaf and wood transport rates were low and, when combined with breakdown rates, suggest that CPOM will be retained and transformed to fine particles near its entry point to the subsurface.  In chapter 3 I examine cave stream food web structure and the role various organic matter sources in stream trophic dynamics.  I used stable isotope (13C and 15N) natural abundance analysis and a 13C-acetate tracer release to establish feeding relationships and to trace the use and importance of bacterial carbon in cave streams with and without CPOM input.  Cave streams contained three trophic levels consisting of organic matter sources, primary consumers, and predators.  Patterns of 13C labeling in the stream were similar to that in similar studies of surface streams.  13C acetate was incorporated into epilithic biofilms and fine benthic organic matter (FBOM).  Some primary consumers, Fontigens tartarea, Gyraulus parvus, and Physa were highly labeled and showed a longitudinal labeling pattern consistent with the consumption of epilithic biofilms.  An epigean caddisfly, Dolophilodes, was highly labeled and probably feeds on suspended organic matter.  Other primary consumers, Gammarus minus and Caecidotea holsingeri, feed on FBOM and epilithon.  Two amphipods, Stygobromus emarginatus and S. spinatus, and a planarian, Macrocotyla hoffmasteri, are predators in the streams.  Leaves and wood were not major energy sources directly used by stream animals.  Dissolved organic matter (DOM) originating from soils appears to be the primary energy source for stream food webs by fueling bacterial production that is then used by higher trophic levels.  Because epilithon C turnover times were relatively long (12.7 - 17 days), DOM can be immobilized in cave stream biofilms, enhancing the efficiency with which the microbial loop may transfer energy to higher trophic levels.",
  "description_provenance": [
    "Author Email: simonks@jmu.edu",
    "Advisor Email: benfield@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:12Z (GMT). No. of bitstreams: 1 etd.PDF: 6064358 bytes, checksum: 79e8c45116f910528ee388ff12afb869 (MD5)   Previous issue date: 2000-02-04"
  ],
  "handle": "26138",
  "identifier_other": "etd-02072000-09510003",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02072000-09510003/",
  "identifier_uri": "http://hdl.handle.net/10919/26138",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "food web",
    "stream",
    "karst",
    "13C",
    "cave"
  ],
  "title": "Organic Matter Dynamics and Trophic Structure in Karst Groundwater",
  "type": "Dissertation"
}