{
  "contributor_author": "Mosley, Barbra F.",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_committeemember": [
    "Holmes, Glen A.",
    "Moore, David Michael",
    "Falls, Jane Ann",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:11Z",
  "date_adate": "2005-02-14",
  "date_available": "2014-03-14T20:07:11Z",
  "date_issued": "2005-02-04",
  "date_rdate": "2005-02-14",
  "date_sdate": "2005-02-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This developmental research used primary components of Rogers' Diffusion of Innovations theory to develop a technology mentoring program for K-12 instructional environments. This investigation utilized K-12 teachers, administrators, technology coordinators, and higher education faculty to evaluate the effectiveness of the proposed technology mentoring program. Findings showed that this program would be very effective in K-12 instructional environments. The final product resulted in a step-by-step procedural guide consisting of suggestions and activities that can be used to implement a technology mentoring program.",
  "description_provenance": [
    "Author Email: bmosley@vt.edu",
    "Advisor Email: holmesg@wssu.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: jfalls@vt.edu",
    "Advisor Email: barbara.lockee@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:11Z (GMT). No. of bitstreams: 1  Mosley_B.pdf: 1245341 bytes, checksum: 6aa166fd54e806458a4f3fef40ef2cf4 (MD5)    Previous issue date: 2005-02-04"
  ],
  "handle": "26135",
  "identifier_other": "etd-02062005-202653",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02062005-202653/",
  "identifier_uri": "http://hdl.handle.net/10919/26135",
  "publisher": "Virginia Tech",
  "relation_haspart": "Mosley_B.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Technology Training",
    "Mentoring",
    "Rogers",
    "Diffusion of Innovations"
  ],
  "title": "Development of a Technology Mentoring Program Using Rogers' Diffusion of Innovations",
  "type": "Dissertation"
}