{
  "contributor_author": "Green, Yvette Nicole Julia",
  "contributor_committeechair": "Weaver, Pamela A.",
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:07:12Z",
  "date_adate": "2001-02-08",
  "date_available": "2014-03-14T20:07:12Z",
  "date_issued": "2001-02-02",
  "date_rdate": "2002-02-08",
  "date_sdate": "2001-02-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An Exploratory Investigation of the Sales Forecasting Process in the Casual Theme and Family Dining Segments of Commercial Restaurant Corporations   Yvette Nicole Julia Green Committee Chair: Pamela A. Weaver Department of Hospitality and Tourism Management  (Abstract)  \tSales forecasting is an essential tool for the planning function of corporate restaurant management.  Accurate sales forecasts allow functional areas, such as marketing, advertising, human resources, and finance, to effectively develop programs to advance the company.  Examples of these programs include budgets, promotion and advertising campaigns, training programs, and capital equipment proposals.  Research in restaurant sales forecasting will aid restaurant corporations in properly allocating resources for more efficient utilization. Utilizing a descriptive sales forecasting benchmarking model developed by Mentzer et al. (1996; 1999), and adapting the model into the restaurant industry, the research sought to determine the relationship that the dimensions of the sales forecasting benchmarking model (functional integration, approach, systems, and performance measurement) had with level of accuracy of the sales forecast and level of managers'; satisfaction with the sales forecasting process.  The adapted model addressed two research questions.  The first question was what is the relationship of the four dimensions of the sales forecasting benchmarking process (Mentzer et al., 1996; 1999) with the level of accuracy of the sales forecast in the commercial restaurant setting? The second question was what is the relationship of the four dimensions of the sales forecasting benchmarking process (Mentzer et al., 1996; 1999) with the level of managers' satisfaction with their sales forecasting process in the commercial restaurant setting? \tA qualitative research methodology combining McCracken's (1988) 4-step method of inquiry and Strauss & Corbin's (1990) grounded theory research methodology allowed investigation of this phenomena.  Two propositions guided the research and a scheme was developed that allowed for analyzing the company participants based on the constructs of functional integration, approach, systems, and performance measurement, level of accuracy of the sales forecast and level of managers' satisfaction with the sales forecasting process. \tThe analysis revealed that there was a relationship between the dimensions of the sales forecasting benchmarking model and the level of managers' satisfaction with the sales forecasting process.   The analysis also revealed that the constructs of performance measurement and level of accuracy of the sales forecast might actually be one construct.  Another dimension emerged, training, and scenarios were developed to relate training to the original dimensions.  Recommendations were developed based on the research findings and hypotheses were developed based on the propositions.  The findings suggest that there is a positive correlation between the dimension of the sales forecasting benchmarking model and the level of managers' satisfaction with the sales forecasting process.  That is to say the more evolved a company may be in a dimension, the higher the level of managers' satisfaction with the sales forecasting process.",
  "description_provenance": [
    "Author Email: granty1012@aol.com",
    "Advisor Email: weaver@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:12Z (GMT). No. of bitstreams: 10 05chapterfour.pdf: 120920 bytes, checksum: 3a82d9a9e467dad426cf27288949f907 (MD5) 02chapterone.pdf: 28502 bytes, checksum: 7daaa19469b602e8409d5cf2f43a3d5a (MD5) 07ChapterfiveII.pdf: 28005 bytes, checksum: 4725d302d7b24f83ceafc3260a499c19 (MD5) 06ChapterfiveI.pdf: 73068 bytes, checksum: e97c092064f17126d34483a96e750830 (MD5) 04chapter3.pdf: 126763 bytes, checksum: fff019d3e5ba4e95c85a490cd296a472 (MD5) 08ChapterfiveIII.pdf: 33081 bytes, checksum: 6d7fa92581a07a6c271725a24b42f45e (MD5) 99BackMatter.pdf: 105322 bytes, checksum: 82e9fb63f242191601252632ea3c300d (MD5) 09chaptersix.pdf: 31699 bytes, checksum: 4bca81cec7077c745ea93fc31de499e2 (MD5) 03chaptertwo.pdf: 84780 bytes, checksum: c55e33bad0e843f41fbd8bd04feda428 (MD5) 01FrontMatter.pdf: 32909 bytes, checksum: 047c3bddc32cbc9323ecaf1282582e1b (MD5)   Previous issue date: 2001-02-02"
  ],
  "handle": "26139",
  "identifier_other": "etd-02072001-164547",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02072001-164547/",
  "identifier_uri": "http://hdl.handle.net/10919/26139",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "05chapterfour.pdf",
    "02chapterone.pdf",
    "07ChapterfiveII.pdf",
    "06ChapterfiveI.pdf",
    "04chapter3.pdf",
    "08ChapterfiveIII.pdf",
    "99BackMatter.pdf",
    "09chaptersix.pdf",
    "03chaptertwo.pdf",
    "01FrontMatter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Forecasting",
    "Commerical Restaurants",
    "Family Dining",
    "Casual Theme",
    "Sales Forecasting"
  ],
  "title": "An Exploatory Investigation of the Sales Forecasting Process in the Casual Theme and Family Dining Segments of Commercial Restaurant Corporations",
  "type": "Dissertation"
}