{
  "contributor_author": "Shambaugh, Roy Neal",
  "contributor_committeechair": "Magliaro, Susan G.",
  "contributor_committeemember": [
    "Sherman, Thomas M.",
    "Holmes, Glen A.",
    "Moore, David Michael",
    "Doolittle, Peter E.",
    "Niles, Jerome A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:11Z",
  "date_adate": "1999-02-05",
  "date_available": "2014-03-14T20:07:11Z",
  "date_issued": "1999-02-02",
  "date_rdate": "2000-06-02",
  "date_sdate": "1999-02-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "While there are numerous models to practice instructional design, few instructional models to teach instructional design have been documented. This dissertation documents the development of a reflexive teaching model for the teaching of instructional design (ID) in a graduate education program. The model supports co-participatory learning of instructional design and mutual examination of one's learning and participation by both instructor and students. A design and development framework is used to describe the design decisions, model implementation, and evaluation of the model across six deliveries, or case studies, of a master창  s level instructional design course from 1994-1998. Design decisions included course sequence, learning tasks, instructional materials, and assessment rubric. Model implementation described student responses to instruction and instructor efforts to assist learners. The model was evaluated in terms of student performance on instructional design projects, student perceptions of  their learning, and instructor responsivity to learner needs. The model's development was summarized in terms of changes in design decisions, model implementation, and model evaluation over the six cases. A discussion of the reflexive model is presented using Joyce and Weil창  s (1996) conceptual approach, describing the model창  s social system, syntax, participants창   reaction, support system, plus the model's instructional and nurturant effects. Four categories of conclusions address improvements to the instructional approach, conditions that promote successful use of the model, impact of the model on student and teacher learning, and conditions conducive to efficient model development. Limitations of the study, future research options, and the implications of the model for ID instruction, the ID process, and teacher inquiry are discussed.",
  "description_provenance": [
    "Author Email: neals@vt.edu",
    "Advisor Email: tsherman@vt.edu",
    "Advisor Email: gholmes@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:11Z (GMT). No. of bitstreams: 8 Ch1-2.pdf: 119827 bytes, checksum: 2213de82129d66f449c02c6f4c544d95 (MD5) Ch3.pdf: 123191 bytes, checksum: 45c86f566fdb07f88f0b9230dce1061e (MD5) App.pdf: 254265 bytes, checksum: 7a9ad9acb207e4817a0a205d55ffc19d (MD5) Ref.pdf: 49558 bytes, checksum: 02ecc2a3f98c9b33ea17cd2f1e20b053 (MD5) Ch6.pdf: 40845 bytes, checksum: f766fcfce6aac293e84996bf35dcd8e4 (MD5) Ch5.pdf: 76661 bytes, checksum: 2628e10a1077ed7e7ccee806475f0784 (MD5) Ch-0.pdf: 26279 bytes, checksum: faf0f29c6cc759ceeaa677869d4d5f2f (MD5) Ch4.pdf: 339074 bytes, checksum: 19925910685aab4ccc57cccc17236bfb (MD5)   Previous issue date: 1999-02-02"
  ],
  "handle": "26130",
  "identifier_other": "etd-020599-094356",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-020599-094356/",
  "identifier_uri": "http://hdl.handle.net/10919/26130",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Ch1-2.pdf",
    "Ch3.pdf",
    "App.pdf",
    "Ref.pdf",
    "Ch6.pdf",
    "Ch5.pdf",
    "Ch-0.pdf",
    "Ch4.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "developmental research",
    "case study",
    "teaching model",
    "instructional design"
  ],
  "title": "Development of a Co-participatory and Reflexive Approach to Teaching and Learning Instructional Design",
  "type": "Dissertation"
}