{
  "contributor_author": "Shrewsbury, Eric-Gene Jackson",
  "contributor_committeecochair": [
    "Tilley-Lubbs, Gresilda A.",
    "Shrum, Judith L."
  ],
  "contributor_committeemember": [
    "Browning, Nolan D.",
    "Barksdale, Mary Alice"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:13Z",
  "date_adate": "2012-03-14",
  "date_available": "2014-03-14T20:07:13Z",
  "date_issued": "2012-01-26",
  "date_rdate": "2012-03-14",
  "date_sdate": "2012-02-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Because distance learning (DL) programs provide students educational opportunities with minimal restrictions on location and/or time, the number of institutions that provide DL courses has grown at a tremendous rate over recent years and is projected to increase in the future.  Foreign language courses through DL, however, have been criticized for limited opportunities to engage in speaking activities and to develop oral proficiency.  While previous research consistently reports no significant differences, the focus of those studies has been the comparison of outcomes assessments between face-to-face and DL courses.  This study analyzed the types of interactions that occurred in the virtual foreign language classroom while using asynchronous audio-based CMC, known as voice boards, to learn Spanish at a rural community college located in Southwestern Virginia, Patrick Henry Community College (PHCC).  An embedded multiple-case study design and computer mediated discourse analysis were applied with activity theory to analyze the interactions holistically.  During a 10-year period, the amount of students enrolled in on-line only courses or in the virtual campus at PHCC increased from 97 students in the summer 2001 session to 655 students in the summer 2011 session.  These results showed a 575.3% (n = 558) increase of students enrolled in DL.  Only 37.7% (n = 507) of the students attending the community college during the summer 2011 session were enrolled in only FTF courses.  These increases were a result of studentsâ   needs to pursue degrees of higher education while working and taking care of family and other personal obligations.  Students enrolled in the SPA 101: Beginning Spanish I course explained that employment schedules, family obligations, and financial reasons motivated their decisions for taking a DL course.  When completing audio-based discussion board assignments, experimentation with the language was observed and participants took advantage of opportunities to listen to recordings multiple times before submitting responses.  Forty-seven percent of the utterances were categorized as containing questions to encourage continued discussion.  However, lexical chains for those utterances showed that only 11.6% (n = 11) of the utterances followed a three link chain of initial post-response-response (IRR) that represented extended conversations in the voice boards.",
  "description_provenance": [
    "Author Email: eshrewsb@vt.edu",
    "Advisor Email: nolandbrowning@yahoo.com",
    "Advisor Email: mbarksda@vt.edu",
    "Advisor Email: glubbs@vt.edu",
    "Advisor Email: jshrum@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:13Z (GMT). No. of bitstreams: 3 Shrewsbury_EJ_D_2012.pdf: 2428133 bytes, checksum: 1a553911124ad3aa4d6288a30ee8ab1c (MD5) Shrewsbury_EJ_D_2012_IRB.pdf: 1530266 bytes, checksum: 0608d0f613cefdeb8ff09ec702cfb865 (MD5) Shrewsbury_EJ_D_2012_Copyright.pdf: 2688169 bytes, checksum: 49bef079cdd8dd23282bc74034213a87 (MD5)   Previous issue date: 2012-01-26"
  ],
  "handle": "26144",
  "identifier_other": "etd-02072012-222848",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02072012-222848/",
  "identifier_uri": "http://hdl.handle.net/10919/26144",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Shrewsbury_EJ_D_2012.pdf",
    "Shrewsbury_EJ_D_2012_IRB.pdf",
    "Shrewsbury_EJ_D_2012_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "computer mediated communication",
    "distance learning",
    "foreign language as distance learning"
  ],
  "title": "Interaction through Asynchronous Audio-Based Computer Mediated Communication in the Virtual Foreign Language Classroom",
  "type": "Dissertation"
}