{
  "contributor_author": "Townsend, Linda Marie",
  "contributor_committeechair": "Glenn, William J.",
  "contributor_committeemember": [
    "Eller, John F.",
    "McCullough, Sue",
    "Twiford, Travis W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:14Z",
  "date_adate": "2009-03-05",
  "date_available": "2014-03-14T20:07:14Z",
  "date_issued": "2009-01-22",
  "date_rdate": "2009-03-05",
  "date_sdate": "2009-02-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine the occurrence of student discourse in asynchronous computer-mediated communication and its relation to student learning.  From in-depth investigation of teacher design, facilitation and direction for asynchronous discussion, implications for high school online instruction guidelines and the need for evaluation standards of online courses and teacher instructional practice are made. Examining student discourse provides information related to the social construction of knowledge.  Teacher presence and its relation to higher levels of student discourse provides information for best practices in online teaching. This information can be used to determine specific standards and guidelines for evaluation of online instruction which can contribute to quality online high school courses.  The context of this study was two high school online AP English courses. The multiple case study approach analyzed student discourse within asynchronous discussion forums and the relation to student learning outcomes. Observation of teacher facilitation and course documents were examined in relation to levels of student discourse and student learning outcomes. Triangulation of data sources included discourse analysis, interviews with teachers, and archival documents. Results from comparing and contrasting multiple cases are presented as basis for implications to guide course design, facilitation and evaluation.",
  "description_provenance": [
    "Author Email: townsendlm@longwood.edu",
    "Advisor Email: jeller@vt.edu",
    "Advisor Email: sue_mccullough@umit.maine.edu",
    "Advisor Email: wglenn@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:14Z (GMT). No. of bitstreams: 1 Townsend_OnlineTeachingLearning_2009.pdf: 2873364 bytes, checksum: 9cdeaa8e8a570108814d6b3568cda808 (MD5)   Previous issue date: 2009-01-22"
  ],
  "handle": "26149",
  "identifier_other": "etd-02082009-165331",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02082009-165331/",
  "identifier_uri": "http://hdl.handle.net/10919/26149",
  "publisher": "Virginia Tech",
  "relation_haspart": "Townsend_OnlineTeachingLearning_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "online learning",
    "online teaching",
    "student discourse",
    "teacher discourse",
    "constructivism"
  ],
  "title": "Online Teaching and Learning:  Student-Student and Teacher-Student Discourse for Student Learning in Asynchronous Discussions of High School Courses",
  "type": "Dissertation"
}