{
  "contributor_author": "Byrd, Melendez O'Neal",
  "contributor_committeecochair": [
    "Hutchins, David E.",
    "Bodenhorn, Nancy E."
  ],
  "contributor_committeemember": [
    "Madison-Colmore, Octavia D.",
    "Hohenshil, Thomas H.",
    "Moore, James L. III",
    "Skaggs, Gary E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:13Z",
  "date_adate": "2003-02-20",
  "date_available": "2014-03-14T20:07:13Z",
  "date_issued": "2003-01-15",
  "date_rdate": "2004-02-20",
  "date_sdate": "2003-02-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study was designed to explore the advising styles that are currently perceived and preferred by African American and White students in the College of Engineering at Virginia Tech. The high attrition rate of African Americans in the engineering colleges both nationally and at Virginia Tech makes it critical to investigate what can be done to increase retention. The lack of awareness of academic advising preferences could be a major component in the high attrition of African American students in the College of Engineering at Virginia Tech. Moreover, increased awareness and understanding for advisors, faculty, administrators and even students will befall, and in turn strengthen retention.  The purpose of this study was to determine; (a) the current advising African American and White students in the College of Engineering at Virginia Tech are perceiving; prescriptive versus developmental; and (b) what the preferences are for advising African American and White students in engineering; prescriptive versus developmental.  This study specifically examined the comparisons between race, gender, classification, grade point average (GPA), and major.  The instrument that was administered via the Internet is called the Academic Advising Inventory (Winston & Sander, 1984).  This four-part instrument measures the level of the developmental or prescriptive advising that occurs between students and advisors and student satisfaction with advising in the College of Engineering.  The sample consisted of a total of 373 undergraduate engineering students, 265 (71%) males and 108 (29%) females. African Americans made up 35% (n = 132) of the sample and Whites 65% (n = 241).  The sample consisted of 25% (n = 93) African American males, 10% (n = 39) African American females, 46% (n = 172) White males, and 19% (n = 69) White females.  A two-way analysis of variance (ANOVA) and t-tests were conducted to analyze differences in advising style when categorized by race, gender, classification, GPA, and major.    The results revealed a significant difference between the style of academic advising currently perceived by African American and White engineering students. The majority of the African Americans reported receiving prescriptive advising and the majority of the Whites reported receiving a developmental style of advising. The results also indicated that the majority of the African American males (55%) perceived receiving a prescriptive style of advising. When looking at African Americans when categorized by classifications, all reported receiving a prescriptive style of advising.  The junior class of African Americans was the only group that is borderline prescriptive/developmental. The ANOVA test also indicated a significant interaction between race and GPA. Results showed that African Americans engineering students in the GPA categories of 1.0-1.9 and 2.0-2.9 reported receiving prescriptive advising, while the 3.0-3.9 category of African Americans reported receiving developmental advising. This data was not consistent with White students in the GPA category of 1.0-1.9. All White students regardless of GPA reported receiving a developmental style of advising.  All engineering students regardless of race, gender, classification, GPA, or major preferred a developmental style of advising.  African American females significantly preferred a more developmental style of advising than the other groups. A Chi square test of independence also indicated that a significantly large portion of African American students felt that their academic advisor did not understand them.",
  "description_provenance": [
    "Author Email: mbyrd@vt.edu",
    "Advisor Email: omadison@vt.edu",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: moore.1408@osu.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: dhutch@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:13Z (GMT). No. of bitstreams: 9 09Vitae.pdf: 284487 bytes, checksum: 088ae9b32c6d404e75c190fe672da53d (MD5) 08Appendix.pdf: 483619 bytes, checksum: c5916d5d433ddb8fbc8bbaf8e1921c42 (MD5) 07References.pdf: 146363 bytes, checksum: 0e1bb87f6d0f996073119d2b76349476 (MD5) 06Chpt5.pdf: 141853 bytes, checksum: b75b882770e6cc90c6709c7aaf0b4ff4 (MD5) 05Chpt4.pdf: 327003 bytes, checksum: 34271926c484fd74b3daf6d6c1057bf3 (MD5) 04Chpt3.pdf: 88908 bytes, checksum: a433cabdca140423ad945050aa764ae3 (MD5) 03Chpt2.pdf: 303381 bytes, checksum: 2e32b20f0a704f9079934151bf3c9e2c (MD5) 02Chpt1.pdf: 115374 bytes, checksum: c12103ca234fded60f4146735fb2ae9d (MD5) 01TableofContents.pdf: 165990 bytes, checksum: 98790328add09f4fabd4732f5d0f3dcd (MD5)   Previous issue date: 2003-01-15"
  ],
  "handle": "26140",
  "identifier_other": "etd-02072003-120434",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02072003-120434/",
  "identifier_uri": "http://hdl.handle.net/10919/26140",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "09Vitae.pdf",
    "08Appendix.pdf",
    "07References.pdf",
    "06Chpt5.pdf",
    "05Chpt4.pdf",
    "04Chpt3.pdf",
    "03Chpt2.pdf",
    "02Chpt1.pdf",
    "01TableofContents.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "African American",
    "Developmental Advising",
    "Engineering",
    "Prescriptive Advising",
    "Academic Advising"
  ],
  "title": "Current and Preferred Academic Advising Styles of African American Students in the College of Engineering at Virginia Tech",
  "type": "Dissertation"
}