{
  "contributor_author": "Thompson, Roxene Marie",
  "contributor_committeechair": "Vorster, Michael C.",
  "contributor_committeemember": [
    "Songer, Anthony D.",
    "Van Aken, Eileen M.",
    "Beliveau, Yvan J.",
    "Lowe, James K. Jr.",
    "de la Garza, Jesus M."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:07:14Z",
  "date_adate": "2006-02-23",
  "date_available": "2014-03-14T20:07:14Z",
  "date_issued": "2006-02-07",
  "date_rdate": "2008-02-23",
  "date_sdate": "2006-02-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The general conditions of contract play a very important role in the dynamics of the construction phase.  The general conditions of contract outline the roles, rights, and obligations of the contracting parties during the construction phase of a project. The American Institute of Architects General Conditions of Contract for Construction (AIA A201) is considered the most widely used standard form of contracts in the U.S. construction industry.  Standard contracts, like AIA A201, are being periodically revised and are becoming more cumbersome over time.  The purpose and expectations of the revisions of the contract are not always clearly defined in literature or in practice.  Changes to the general conditions have been made, which do not advance the performance goals for a successful project, but rather react to negative experiences.  Oftentimes, there are conflicts between the partiesâ   interpretation of the general conditions and between the required administrative practices obligatory by the general conditions during the construction phase, thus impacting the contractual relationships between owners, architect/design professionals, and general contractors. The increasing complexity and size of projects, the multiple-contract interfaces, and the changing times have transformed construction practices and contractual relationships.  No longer simply following the lead of the AIA, owners seem to be questioning the value of the design professional, and the tone and path of the AIA A201.  The three-phase methodology of this dissertation research set out to advance the understanding of change in the AIA A201 and the impact change has had on the value-added benefit of the design professional during the construction phase and contract administration on a project.  The results of this research revealed the following primary conclusions: changes to various provisions pertaining to the key provisions have resulted in the Architect assuming less responsibility during the construction phase of a project; changes to the AIA A201 provision concerning the key provisions have not increased the value of the Architectâ  s performance of contract administration services during the construction phase of a project; with regard to the key provisions, Owners or Ownersâ   representatives perceive the value of the Architectâ  s contract administration services during construction have decreased in recent years.  In Phase I, this research identified the key contract provisions, which influence the function of the design professional performed in contract administration during construction.  This investigation identified that change exists in key provisions over time and that change may have an influence on the function performed by the design professional during construction and contract administration. Subsequently, in Phase II, this research investigated the effect that change has had on the function performed by the design professional.  The respective substantive changes to each provision that may have had a material effect on the function of the design professional were identified and these key provisions were thus studied further.  Then, whether or not changes made to key provisions of AIA A201 have had a material effect on the function performed by the architect/design professional during the construction phase and contract administration was examined in Phase III.  Ultimately, the research led to an enhanced knowledge of the owner-perceived value-added benefit by the design professional during the construction phase of a project.   The practical use of the AIA A201 and its future editions has an influence on improved performance and better working relationships, which ultimately leads to improved constructed projects.  The conclusions to this research study have demonstrated that changes made to key provisions of AIA A201 from 1951 to 1997 have diminished the role of the architect.  Changes to key provisions have had a material effect on the construction phase, contract administration, and the function performed by the architect/design professional during the construction phase of a project.  Before one can make effective changes to improve contractual and working relationships, the change must be identified for the purpose of supporting the industryâ  s efforts to reduce adversarial relations, balance risk, and control schedule and cost, impact the contractual relationships and the value-added benefit of the contractual parties.  This dissertation research successfully provided an understanding of the process used and the impact of change in the general conditions of contracts.  As such, the knowledge gained from this research illuminated the necessary considerations of change and its impacts on the future development of contracts and their revisions in efforts to create better documents, not to just create bigger documents.",
  "description_provenance": [
    "Author Email: roxene@vt.edu",
    "Advisor Email: adsonger@vt.edu",
    "Advisor Email: evanaken@vt.edu",
    "Advisor Email: yvan@vt.edu",
    "Advisor Email: jklowe@hsmm.com",
    "Advisor Email: chema@vt.edu",
    "Advisor Email: mikev@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:14Z (GMT). No. of bitstreams: 1 RMThompson_dissertation.pdf: 1870722 bytes, checksum: 080434f98bf347666d7bd79d37dc368f (MD5)   Previous issue date: 2006-02-07"
  ],
  "handle": "26148",
  "identifier_other": "etd-02082006-210252",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02082006-210252/",
  "identifier_uri": "http://hdl.handle.net/10919/26148",
  "publisher": "Virginia Tech",
  "relation_haspart": "RMThompson_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "construction administration",
    "construction phase",
    "General Conditions",
    "role of the architect",
    "contract administration",
    "construction contracts",
    "owners",
    "contract provisions",
    "contract documents",
    "contractual relationships",
    "performance",
    "function"
  ],
  "title": "An Investigation of Change to Key Provisions in the AIA A201 and its Impact on Perceptions of the Value-added Benefit of the Design Professional during Construction",
  "type": "Dissertation"
}