{
  "contributor_author": "LePera, Stephen D",
  "contributor_committeechair": "Vandsburger, Uri",
  "contributor_committeemember": [
    "O'Brien, Walter F. Jr.",
    "Ng, Fai",
    "Ekkad, Srinath V.",
    "Cohen, Jeffrey"
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:07:13Z",
  "date_adate": "2012-03-19",
  "date_available": "2014-03-14T20:07:13Z",
  "date_issued": "2012-02-03",
  "date_rdate": "2012-03-19",
  "date_sdate": "2012-02-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The work herein details an optical droplet measurement system based on planar multi-angle Mie scattering. Sizing information consists of a mean droplet diameter and droplet distribution estimates for every individual point within a planar (2D) area of interest. The planar method makes possible the fast acquisition of data within a large field of interest, and uses relatively inexpensive instrumentation. As presented, the method demonstrated the ability to measure water droplets from a typical simplex spray nozzle, across the range of 5-50 micrometers within +/-10% of known values, and in addition return an estimate of the shape and width of the size distribution at each location within the planar region of interest. Measurements demonstrating the agreement between results from this current method and known PDA data were successfully completed for a 1-gallon-per-hour spray nozzle, and repeatability was demonstrated in 2.5-gallon-per-hour and 4.5-gallon-per-hour nozzles. Additionally the limits of the technique are explored with simulated data. Conclusions from these exercises show that the multi-angle planar Mie scattering method is capable of measuring droplet distribution characteristics and means within a nominal range of 0.3 micrometers up to 150 micrometers.",
  "description_provenance": [
    "Author Email: stephen.lepera@gmail.com",
    "Advisor Email: uri@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:13Z (GMT). No. of bitstreams: 1 LePera_S_D_2012.pdf: 29352853 bytes, checksum: 214857989328b106af724881e95b693f (MD5)   Previous issue date: 2012-02-03"
  ],
  "handle": "26143",
  "identifier_other": "etd-02072012-101235",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02072012-101235/",
  "identifier_uri": "http://hdl.handle.net/10919/26143",
  "publisher": "Virginia Tech",
  "relation_haspart": "LePera_S_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Mie",
    "Scattering",
    "Optical",
    "Planar",
    "Measurement",
    "Diagnostic",
    "Laser",
    "Image",
    "Spray",
    "Droplet",
    "Particle"
  ],
  "title": "Development of a Novel Planar Mie Scattering Method for Measurement of Spray Characteristics",
  "type": "Dissertation"
}