{
  "contributor_author": "Halili, Rushan",
  "contributor_committeecochair": [
    "Taylor, Daniel B.",
    "Purcell, Wayne D."
  ],
  "contributor_committeemember": [
    "Reaves, Dixie Watts",
    "Thompson, G. Rodney",
    "McDowell, George R.",
    "Coale, Charles W. Jr.",
    "Pease, James W."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:07:14Z",
  "date_adate": "2000-02-09",
  "date_available": "2014-03-14T20:07:14Z",
  "date_issued": "1999-11-22",
  "date_rdate": "2001-02-09",
  "date_sdate": "2000-02-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "METHODS FOR EVALUATING AGRICULTURAL ENTERPRISES IN   THE FRAMEWORK OF UNCERTAINTY FACING TOBACCO           PRODUCING REGIONS OF VIRGINIA  <p>  Rushan Halili <p>   (ABSTRACT) <p> The purpose of this study was to develop and demonstrate an analytical framework to filter technical and economic information regarding alternative agricultural enterprises in order to enable farmers to make more informed diversification and adjustment decisions. This is particularly important for areas that need to adjust the structure of income sources as a result of dramatic changes in market demand and/or agricultural policy. Tobacco producing regions are currently facing such a problem in the United States. These regions need to consider a wide range of alternatives to maintain or enhance income and standards of living. <p> The problem involved both strategic economic decisions and operational economic decisions. The method used combined information in the ArcView Geographic Information Systems (GIS) with Linear Programming (LP). <p> Part of Pittsylvania County, Virginia, served as a case study example. A GIS database including soils and climatic conditions of the study area was created. Soils belonging to land capability classes 1 to 4 were considered for agricultural purposes. Agronomic requirements for specific yield levels of the enterprises considered were tabulated. An ArcView GIS analysis was conducted based on soil map unit symbols. Soil depth, soil series, soil texture, slope, flood potential and average summer temperature were factors associated with yield. Natural drainage, pH, natural fertility, content of organic matter and annual rainfall were factors that served for enterprise budget adjustments. The output of ArcView GIS analysis is maps of physically viable enterprise boundaries or enterprise reference units and tables of attributes for each field. <p> Marketing of agricultural products that have prices that fluctuate seasonally is feasible only within the period of time called the \"market window\". When average historical prices were above total costs, a market window was identified. <p> The optimal enterprise mix was addressed by LP from a whole farm planning perspective based on the results of ArcView GIS analysis and other constraints, including crop rotations, and irrigation limits. Various levels of tobacco production, vegetable enterprise activity levels, and limits on irrigation were employed to generate, ten scenarios. Results include the optimal enterprise mix, net revenue (above variable costs), shadow prices and sensitivity analysis. It is shown that specialty crops are not likely to replace tobacco income, at least in the near term. Developing a diversified farm plan could help farmers to make a smooth transition to other alternatives.",
  "description_provenance": [
    "Author Email: rhalili@vt.edu",
    "Advisor Email: dixie@vt.edu",
    "Advisor Email: taylord@vt.edu",
    "Advisor Email: rodney@vt.edu",
    "Advisor Email: purcell@vt.edu",
    "Advisor Email: mcdowell@vt.edu",
    "Advisor Email: coale@vt.edu",
    "Advisor Email: peasej@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:14Z (GMT). No. of bitstreams: 1 etd.pdf: 879580 bytes, checksum: f4e470b2187e51eff15762d52cb4f465 (MD5)   Previous issue date: 1999-11-22"
  ],
  "handle": "26145",
  "identifier_other": "etd-02082000-10550006",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02082000-10550006/",
  "identifier_uri": "http://hdl.handle.net/10919/26145",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Agricultural Enterprises",
    "GIS",
    "Linear Programming",
    "Economic Feasibility"
  ],
  "title": "Methods for Evaluating Agricultural Enterprises in the Framework of Uncertainty Facing Tobacco Producing Regions of Virginia",
  "type": "Dissertation"
}