{
  "contributor_author": "Maza Duerto, Octavio",
  "contributor_committeechair": "Salehi-Isfahani, Djavad",
  "contributor_committeemember": [
    "Yang, Dennis T.",
    "Spanos, Aris",
    "McGuirk, Anya M.",
    "Murphy, Russell D."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:07:14Z",
  "date_adate": "2003-03-06",
  "date_available": "2014-03-14T20:07:14Z",
  "date_issued": "2003-01-31",
  "date_rdate": "2004-03-06",
  "date_sdate": "2003-02-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this dissertation is to explore the relationship between fertility rates and the economy in Venezuela.  In particular, it looks at the extreme fluctuations in oil revenues, Venezuelaâ  s main source of income, in the 1970s and their impact on fertility.  It uses the 1998 National Survey of Population and Family collected in Venezuela by The Central Office of Statistics and Information to estimate a Poisson model of total fertility by union cohort and to empirically investigate changes in childbearing patterns.  The results show that compared to the 1967-1968 union cohort, all subsequent union cohorts decline in total fertility in the first 14 years after entering the first union.  This finding raises the possibility that the period fertility rate stall and reversal of the 1970s are not associated with rises in total fertility.  Further, the simple two period model of fertility timing developed for this study illustrates how females may change their fertility timing by responding to temporary changes in income, either through changes in wages or changes in the amount of transfers.  Also, the duration analysis presents differences in childbearing patterns where the boom cohort seems to be at a higher risk of an additional child for lower parities, but at a lower risk for higher parities when compared to the bust cohort.  These differences seem to remain even after controlling for individual characteristics or secular changes between the two cohorts.  This study is important, because it highlights how sharp and short changes in economic conditions faced by a Venezuelan household induce a change in the timing of birth, thereby creating unexpected moves in the period fertility rates.  Understanding the source of these moves can help to plan for them in the future.",
  "description_provenance": [
    "Author Email: omaza@vt.edu",
    "Advisor Email: deyang@vt.edu",
    "Advisor Email: aris@vt.edu",
    "Advisor Email: mcguirk@vt.edu",
    "Advisor Email: salehi@vt.edu",
    "Advisor Email: rdmurphy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:14Z (GMT). No. of bitstreams: 8 Vita.pdf: 58362 bytes, checksum: a279f1849f341d3dbafd479c748bfbd5 (MD5) Cover2.pdf: 86309 bytes, checksum: da608d8b71878185befdf977304018c5 (MD5) References.pdf: 76393 bytes, checksum: f626fe6f1cba021ac4fc420daa847561 (MD5) Appendix.pdf: 64985 bytes, checksum: fc58373741f06a60aa7cf534fbbfd800 (MD5) Cover1.pdf: 64313 bytes, checksum: 43c9e3ec836c03e4d08110bec5378fe7 (MD5) Chapter2.pdf: 199233 bytes, checksum: cedb7e2d515e4e6a0ac4be1d44d6db73 (MD5) Chapter3.pdf: 205681 bytes, checksum: 4a4f89d7e9c4e7a6d2759bcded065f9a (MD5) Chapter1.pdf: 150893 bytes, checksum: d55ac88cf1ff728b6fa024e082fa2532 (MD5)   Previous issue date: 2003-01-31"
  ],
  "handle": "26146",
  "identifier_other": "etd-02082003-180131",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02082003-180131/",
  "identifier_uri": "http://hdl.handle.net/10919/26146",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Vita.pdf",
    "Cover2.pdf",
    "References.pdf",
    "Appendix.pdf",
    "Cover1.pdf",
    "Chapter2.pdf",
    "Chapter3.pdf",
    "Chapter1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Timing",
    "Fertility",
    "Oil Shock"
  ],
  "title": "Essays on Fertility and the Economy in Venezuela",
  "type": "Dissertation"
}