{
  "contributor_author": "Spencer, Maryellen",
  "contributor_committeechair": "Harper, Laura Jane",
  "contributor_committeemember": [
    "Phillips, Jean A.",
    "West, James L. W. III",
    "Boles, Joann Ferguson",
    "Webb, Ryland E.",
    "Squires, Michael G."
  ],
  "contributor_department": "Human Nutrition and Foods",
  "date_accessioned": "2014-03-14T20:07:15Z",
  "date_adate": "2007-02-09",
  "date_available": "2014-03-14T20:07:15Z",
  "date_issued": "1982-06-30",
  "date_rdate": "2011-05-09",
  "date_sdate": "2007-02-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "PREFACE<p> Knowing how people eat-their foods, preparation styles, and dining customs-helps us understand style of food preparation, a cuisine profile of a culture, the physical how they live. Not merely a is the culinary and gastronomic and behavioral expression of a culture's social and aesthetic values. A cuisine has a dynamic relationship with its time, and historical cuisines also relate to our own time: an understanding of food in history better enables us to interpret and even influence current food styles and patterns. <p>Yet the researcher interested in historical cuisines faces a dilemma: how to conduct historical studies of the subject. Although we have methods for studying the chemical, nutritional, economic, and social aspects of food, we lack methods for studying historical cuisines or for defining the aesthetic and stylistic aspects of a cuisine. Most historical research centered on food has employed agricultural economics in relating food production data to a general nutritional status, while most research on food in culture has studied food habits with the objective of improving nutritional status. American food seems to have been especially neglected in the al ready scanty store of historical food studies, and almost all of the American studies have examined folk or ethnic food. Because so few studies of food history or of cookery styles have been conducted, we lack what might be termed a \"body of knowledge.\" Food history has no orderly scholarly arena, no discipline. One reason for the lack of systematic studies of food in history is an aversion among many scholars in food and nutrition to \"cuisines,\" to the stylistic and aesthetic aspects which might seem merely decorative aspects of man's diet. Another reason is a lack of training among those professionals in humanistic disciplines. But an overriding reason for the absence of scholarly histories of cuisines is the temporal, transitory nature of a cuisine. <p>If we compare cuisines with related popular arts such as costume, textiles, and home furnishings, a distinction quickly emerges: costumes, textiles, but food does not. and furnishings may survive as extant artifacts, However humble or grand, a meal is prepared to be consumed. In no way can we study a meal of the past firsthand; in no way can we know with certainty what tastes, textures, and smells met our ancestors at the dinner table. Descriptions and pictures of a meal reveal no more about a dining experience than descriptions and pictures of a musical event bring us the sounds or the experience of listening. <p>Food in seventeenth-century Virginia serves well as a test subject for a historical method. Historians traditionally have neglected daily life and common people in studies of that period, concentrating instead on politics and the elite. More recently, historical archaeologists and scholars in material culture have begun investigating the realm of daily experience in which food figures importantly, but they have discovered little about the stylistic and aesthetic aspects of the cuisine. <p> This study begins to address those two problems: the need for a method for studying historical cuisines, and the unanswered questions about Virginia's early cuisine. Although the method developed and tested in this study proved complex and demanding, it also brought rewards. Working across disciplines and using three categories of research sources-artifacts, documents, and iconographic records-proved especially helpful in uncovering and sifting data. Much was revealed about the physical context of Virginia's seventeenth-century cuisine: the available foods, the cooking and dining equipage. Aesthetic values were explained to some extent, as were dining customs. But the absence of primary recipe books, the dearth of information about seventeenth-century women, and our general ignorance of daily life during that century hindered discovery of the activities relating to food-the techniques and procedures for preparing, cooking, storing, and serving food. Additional studies, new sources, and refined methods may begin to unlock even those mysteries.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:07:15Z (GMT). No. of bitstreams: 1 LD5655.V856_1982.S772.pdf: 26388736 bytes, checksum: 6072f6982014e19bd32dca2331a2a321 (MD5)   Previous issue date: 1982-06-30",
  "format_medium": "BTD",
  "handle": "26153",
  "identifier_other": "etd-02092007-102006",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02092007-102006/",
  "identifier_uri": "http://hdl.handle.net/10919/26153",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1982.S772.pdf",
  "subject": "Food habits Virginia.",
  "subject_lcc": "LD5655.V856 1982.S772",
  "title": "Food in seventeenth-century Tidewater Virginia : a method for studying historical cuisines",
  "type": "Dissertation"
}