{
  "contributor_author": "Gant, Lenora  Peters",
  "contributor_committeechair": "Stubblefield, Harold W.",
  "contributor_committeemember": [
    "McKeen, Ronald L.",
    "Cline, Marvin Gerald",
    "Keesing, Hugo",
    "Boucouvalas, Marcie"
  ],
  "contributor_department": "Adult Learning and Human Resource Development",
  "date_accessioned": "2014-03-14T20:07:15Z",
  "date_adate": "1998-02-03",
  "date_available": "2014-03-14T20:07:15Z",
  "date_issued": "1997-12-02",
  "date_rdate": "1999-02-03",
  "date_sdate": "1997-12-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this case study research was to identify the factors and supporting strategies that contribute to the implementation of DL instruction in the two-way audio/video (A/V) electronic classroom (EC).  A primary goal of this research was to develop an outline of  a DL manual that identifies factors and strategies or subject areas that can be used to: (a) contribute to knowledge in the field of  practice, (b) improve practice, and (c) improve the quality and success of  DL teaching in the EC.    Additionally,  this study attempted to ascertain the differences and similarities in perceptions among  students, facilitators, and training officers  who participated in the EC.   A list of recommendations are presented at the end of this study; the first list of recommendations suggest areas for the improvement of practice and to influence the quality and success of  DL.   The second set of  recommendations suggest areas for further study to add to knowledge in the field as well as  to improve practice.    \tThe case study was completed employing a qualitative methodology using focus group interviews, observations, and written feedback from EC participants. Focus group 1 (data set I)  was conducted using a set of 13 pre-determined questions with a total of eleven participants.  The EC observations (data set II) was conducted at the Navy Marine Corps Intelligence Training Center (NMITC), Dam Neck, VA with 5 students in attendance.   The second focus group (data set III) was conducted with a set of 15 different pre-determined questions with the same 5 students at the NMITC immediately after the observations in the EC.  The  FGIs and observations were video and audio taped for further review and analysis.  Written information reported from two different distant site locations (same course and telecast)  was analyzed, coded, and used as data set IV.  This data set further clarified and corroborated data generated in data sets I, II, and III. \tThis case study identified 10 key factors and supporting strategies pertinent to the implementation of DL in the EC.  One of the findings in this study was that the roles of  the instructor and the facilitator are interwoven;  this arrangement is seen as a two-person &quot;team&quot; by this studyâ  s participants because the instructor and facilitator  are dependent on each other in order to implement DL and ensure quality operations in the EC.  This is a new paradigm shift in the instructorâ  s role when compared with the conventional classroom  instructor.  In my examination of the literature, I could not find that this collaborative arrangement of  a two-person &quot;team&quot; was addressed.  Other findings were: (a) the importance of the student guide and supplemental materials that aided EC interactions and (b) the importance of the EC design  as a quality indicator and how it can facilitate a good learning environment.    \tBased on a synthesis of the data, there was considerable agreement among the users about the factors and strategies used to operationalize DL in the EC.   The facilitators and training officers placed more emphasis on the administrative and return on investment aspects of DL -- cost savings, access to training at duty location -- versus the students who placed more stress on instructional strategies â   questioning and interaction techniques -- that worked well for them in the EC and the importance of  EC courses helping them to keep up to date with job competencies.",
  "description_provenance": [
    "Author Email: AFganlp@dia.osis.gov",
    "Advisor Email: hstubblefield@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:15Z (GMT). No. of bitstreams: 1 etd.pdf: 252420 bytes, checksum: 95dafee7062565289c7da864321d12f1 (MD5)   Previous issue date: 1997-12-02"
  ],
  "handle": "26158",
  "identifier_other": "etd-02098-14259",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02098-14259/",
  "identifier_uri": "http://hdl.handle.net/10919/26158",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "distance learning",
    "distance education",
    "electronic classroom"
  ],
  "title": "The Implementation of Distance Learning In The Electronic Classroom",
  "type": "Dissertation"
}