{
  "contributor_author": "Lee, Seungwoo",
  "contributor_committeechair": "McGehee, Nancy G.",
  "contributor_committeemember": [
    "Mills, Bradford F.",
    "Uysal, Muzaffer S.",
    "Perdue, Richard R."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:07:14Z",
  "date_adate": "2011-03-03",
  "date_available": "2014-03-14T20:07:14Z",
  "date_issued": "2011-01-28",
  "date_rdate": "2011-03-03",
  "date_sdate": "2011-02-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Volunteer tourism as an alternative to mass tourism has grown significantly since the 1970s, sparking research interest in the subject. However, there is little research that has examined future potential volunteer touristsâ   various perceptions, needs and wants. The purpose of this study was to understand how and in what way various potential volunteer touristsâ   beliefs, including attitudes, subjective norms, self-efficacy and motivation, influence their future intended participation in a volunteer tourism experience using the revised theory of planned behavior. Moreover, the potential moderating effect of past volunteer tourism experience was examined as well. The study collected 291 usable responses from potential volunteer tourists who were active members of volunteer tourism organizations. The study used second order confirmatory factor analysis, structural equation modeling and hierarchical multiple regression analysis to test study hypotheses. The study also used meta-analysis to examine the effect size of the predicting variables and compared it with that of previous tourism research. The results of structural equation modeling indicated that two constructs, both attitudes and subjective norms, appeared to be statistically significant, while self-efficacy and motivation were not statistically significant in predicting potential volunteer touristsâ   intended participation. Hierarchical multiple regression analysis found a moderating effect of past volunteer tourism experience on motivation toward intended participation in a negative direction. In addition, the motivation factor â  altruismâ   moderated in a negative direction. Meta-analysis found a large effect of attitudes, a medium effect of subjective norms, and a small effect of self-efficacy in relation to intended participation. In conclusion, the results did not validate the theory of planned behavior in the context of volunteer tourism research. Interestingly, the theory of reasoned action was found to be validated. Implications for volunteer tourism providers and organizations are also discussed.",
  "description_provenance": [
    "Author Email: lee72@vt.edu",
    "Advisor Email: nmcgehee@vt.edu",
    "Advisor Email: bfmills@vt.edu",
    "Advisor Email: samil@vt.edu",
    "Advisor Email: perduerr@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:14Z (GMT). No. of bitstreams: 2 LEE_SEUNGWOO_D_2011.pdf: 1883523 bytes, checksum: 9cdbc01e831b97abab0a473dd8fb75d8 (MD5) LEE_SEUNGWOO_IRB_2011.pdf: 197910 bytes, checksum: 4d0921eaf400a1bf04c050ab9035bebb (MD5)   Previous issue date: 2011-01-28"
  ],
  "handle": "26151",
  "identifier_other": "etd-02082011-152957",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02082011-152957/",
  "identifier_uri": "http://hdl.handle.net/10919/26151",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "LEE_SEUNGWOO_D_2011.pdf",
    "LEE_SEUNGWOO_IRB_2011.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "Volunteer Tourism Attitudes Subjective Norms Self",
  "title": "Volunteer Tourists' Intended Behavior Using the Revised Theory of Planned Behavior",
  "type": "Dissertation"
}