{
  "contributor_author": "Weiland, Christopher Jude",
  "contributor_committeechair": "Vlachos, Pavlos P.",
  "contributor_committeemember": [
    "Telionis, Demetri P.",
    "Brown, Eugene F.",
    "Yagla, Jon J.",
    "Duggleby, Andrew T."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:07:14Z",
  "date_adate": "2010-02-19",
  "date_available": "2014-03-14T20:07:14Z",
  "date_issued": "2009-12-02",
  "date_rdate": "2010-02-19",
  "date_sdate": "2010-02-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objective of this dissertation was to investigate physical characteristics of high speed gas-liquid interfaces for the cases of subsonic, transonic, and supersonic gas jets submerged underwater and the transient development of an underwater projectile reaching the supercavitating state.  These studies are motivated by the need to understand the basic physics associated with a novel submersible missile launcher termed the Water Piercing Missile Launcher (WPML). This dissertation presents the first study of high speed round and rectangular gas jets submerged underwater utilizing a global optical measurement technique.  This technique allows quantitative measurement of the entire gas jet and the interfacial motion.  Experimental results indicate that the penetration of the gas jets into a quiescent liquid is strongly influenced by the injection mass flow and the nozzle geometry.  In contrast, the oscillations of the interface are influenced by the injection Mach number.  The transition from a momentum driven to a buoyant jet is determined using a characteristic length scale that appears to be in good agreement with experimental observations.  Moreover, the unsteadiness of the interface appears to be governed by both Kevin-Helmholtz and Rayleigh-Taylor instabilities. This dissertation also contains the first study of a projectile accelerating to reach the supercavitating state.  Experimental results show that the transient development of the supercavity is governed by the formation of a vortex ring.  Nuclei are shed from the forebody of the accelerating projectile and are entrained in the vortex ring core where they are subjected to low pressure and subsequently expand rapidly.  A characteristic time scale for this supercavity development is presented.",
  "description_provenance": [
    "Author Email: cweiland@vt.edu",
    "Advisor Email: pvlachos@vt.edu",
    "Advisor Email: telionis@vt.edu",
    "Advisor Email: efbrown@vt.edu",
    "Advisor Email: jon.yagla.ctr@navy.mil",
    "Advisor Email: aduggleby@tamu.edu",
    "Made available in DSpace on 2014-03-14T20:07:14Z (GMT). No. of bitstreams: 1 Weiland_CJ_D_2010.pdf: 8795884 bytes, checksum: 2496ef39a2f48051bd871c3bb7ba36f7 (MD5)   Previous issue date: 2009-12-02"
  ],
  "handle": "26150",
  "identifier_other": "etd-02082010-165136",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02082010-165136/",
  "identifier_uri": "http://hdl.handle.net/10919/26150",
  "publisher": "Virginia Tech",
  "relation_haspart": "Weiland_CJ_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "supercavitation",
    "submerged gas jet"
  ],
  "title": "Characteristics of the High Speed Gas-Liquid Interface",
  "type": "Dissertation"
}