{
  "contributor_author": "Richardson, Tracy Bryant",
  "contributor_committeechair": "Tripp, Norman Wayne",
  "contributor_committeemember": [
    "Craig, James R.",
    "Twiford, Travis W.",
    "Swain, Carol M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:15Z",
  "date_adate": "2012-02-27",
  "date_available": "2014-03-14T20:07:15Z",
  "date_issued": "2012-01-27",
  "date_rdate": "2012-02-27",
  "date_sdate": "2012-02-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html xmlns=\"http://www.w3.org/1999/xhtml\"> <head> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" /> <title>Tracey B. Richardson Abstract</title> </head>  <body> <p>The purpose of this study was to document the history of Susie G. Gibson High School from its opening in 1954 to its closure in 1970. The researcher documented and described the establishment, operation, and closure of the school. The study includes a description of how Bedford County transitioned from a dual system of segregated education to a single school system for students of all races and how Susie G. Gibson High School was converted for use as a vocational school as it still functions today. </p> <p>   Historical research methods were used to collect data and describe the education of Black students who attended the Susie G. Gibson High School. The evidence for the study consists of primary and secondary sources. This evidence includes written records, archives, manuscripts, maps and documents, but also artifacts (Williams, 2007, p.11). The researcher conducted in-depth interviews with students, school employees, and community members who were involved with the school. Minutes of school board meetings and other contemporary records were utilized as well. Studies by Bonner (1939) and Harrell (1951) and histories by other authors were used as secondary sources for historical context.</p> <p>   Susie G. Gibson High School opened in the fall of 1954. It was a much anticipated event because it was the first new high school for Blacks in Bedford County, Virginia. Susie G. Gibson High School replaced the much smaller Bedford Training School that began as an elementary school, but which provided some secondary schooling after 1930. The opening of the school was a culmination of negotiations between the Black community and the Bedford County School Board. The school was the pride of the Black community for over a decade and a half. Susie G. Gibson High School changed to a vocational school in 1970 when the U. S. Department of Health, Education, and Welfare (HEW) ordered Bedford County to fully integrate its school system.    </p> </body> </html>",
  "description_provenance": [
    "Author Email: tracyalex2@msn.com",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: jcraig44@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: carol.swain@vanderbilt.edu",
    "Made available in DSpace on 2014-03-14T20:07:15Z (GMT). No. of bitstreams: 1 Richardson_TB_D_2012.pdf: 3751140 bytes, checksum: 492798e1df18b4ca8b70f020d8aa26e5 (MD5)   Previous issue date: 2012-01-27"
  ],
  "handle": "26157",
  "identifier_other": "etd-02092012-142344",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02092012-142344/",
  "identifier_uri": "http://hdl.handle.net/10919/26157",
  "publisher": "Virginia Tech",
  "relation_haspart": "Richardson_TB_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Gatekeeper",
    "Freedom of Choice",
    "Freedmen",
    "Blacks",
    "County Training Schools",
    "Industrial Education",
    "Integration",
    "Jeanes Fund",
    "Northern Philanthropists",
    "Segregation"
  ],
  "title": "Susie G. Gibson High School: A History of the Last Segregated School  in Bedford County, Virginia",
  "type": "Dissertation"
}