{
  "contributor_author": "Reidy, Michael James",
  "contributor_committeecochair": [
    "Nessler, Craig L.",
    "Cramer, Carole L."
  ],
  "contributor_committeemember": [
    "Medina-Bolivar, Fabricio",
    "Gillaspy, Glenda E.",
    "Bevan, David R."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:07:15Z",
  "date_adate": "2007-03-13",
  "date_available": "2014-03-14T20:07:15Z",
  "date_issued": "2007-01-26",
  "date_rdate": "2008-03-13",
  "date_sdate": "2007-02-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The major obstacle many promising drugs struggle to overcome is the barrier imposed by the outer cell membrane.  In addition to technologies such as liposomes and cell-penetrating peptides, more attention is being given to the class of proteins known as lectins to deliver therapeutic and antigenic proteins to the interiors of cells.  Lectins bind to but do not modify sugars, and provide an efficient route to endocytosis.  The galactose/N-acetyl-galactosamine specific lectin ricin B-chain (RTB) is especially attractive in possibly fulfilling a carrier role due to its well-characterized endocytotic trafficking and its efficacy over a wide range of cell types.  By producing RTB recombinantly in plants it is possible to create a fully active, non-toxic carrier that does not rely on the processing of large amounts of toxic material (e.g. castor bean).  Payload molecules such as small molecules and proteins can be attached to RTB via chemical conjugation at primary amine groups, without the loss of lectin or uptake activities.  The biotin/streptavidin interaction and direct genetic fusion of polypeptides also provide efficient mechanisms for the attachment of payload proteins to RTB.  An immunoglobulin domain-based scaffolding mechanism bridges modified RTB and payload proteins when co-expressed in Agrobacterium-infiltrated plant leaves.  Carrier and payload proteins expressed in plants and E. coli, respectively, and purified independently are not able to assemble into an efficient carrier/payload arrangement.  These findings show that plant cells are able to correctly produce the two components of the carrier/payload system and assemble them into an efficient and flexible capture and carry technology.",
  "description_provenance": [
    "Author Email: mreidy@vt.edu",
    "Advisor Email: cnessler@vt.edu",
    "Advisor Email: ccramer@astate.edu",
    "Advisor Email: fmedinabolivar@astate.edu",
    "Advisor Email: gillaspy@vt.edu",
    "Advisor Email: drbevan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:15Z (GMT). No. of bitstreams: 1 Michael_Reidy_Dissertation_4.pdf: 10170381 bytes, checksum: e30cefaaee473253ddbfa04258244e23 (MD5)   Previous issue date: 2007-01-26"
  ],
  "handle": "26155",
  "identifier_other": "etd-02092007-153948",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02092007-153948/",
  "identifier_uri": "http://hdl.handle.net/10919/26155",
  "publisher": "Virginia Tech",
  "relation_haspart": "Michael_Reidy_Dissertation_4.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "adjuvant",
    "lectin-mediated uptake",
    "Immunoglobulin scaffolding",
    "Type II RIP processing",
    "lectin",
    "drug carrier",
    "N. benthamiana",
    "ricin B-chain",
    "capture/carry platform",
    "Ricin",
    "retrograde trafficking",
    "RTB",
    "plant-based bioproduction",
    "Agrobacterium-mediated transient expression",
    "antigen carrier"
  ],
  "title": "Engineering of the RTB Lectin as a Carrier Platform for Proteins and Antigens",
  "type": "Dissertation"
}