{
  "contributor_author": "Gordon, Susan Marie",
  "contributor_committeecochair": [
    "Anderson, Linda",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_committeemember": [
    "Baker, Moira",
    "Wildman, Terry M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:17Z",
  "date_adate": "2006-02-23",
  "date_available": "2014-03-14T20:07:17Z",
  "date_issued": "2006-02-01",
  "date_rdate": "2006-02-23",
  "date_sdate": "2006-02-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Some colleges and universities require their business majors to take literature classes; others do not.  Some businesspeople, as well as many educators such as Donna M. Kish-Goodling (1999), William McCarron (1980), and Philip Vassallo (1991), support the need for business students to study literature in order to improve their communication skills and degree of human understanding.  Over the past fifty years, however, Virginia Techâ  s literature requirements for business majors have gradually diminished to none.    The twelve participants who were interviewed in this qualitative study were all business majors who graduated from Virginia Tech before 1990, when the business school, and the university at large, still required students to take one or more literature courses.   The vast majority of participants agreed that they had benefited from studying literature as part of their undergraduate business degree.  Participants most often credited the classes with broadening their world view, developing their analytical skills, making them more well-rounded, improving their communication skills, and helping them better express themselves.  Participants agreed with Vassalloâ  s suggestion that reading literature helped students to put their own lives into perspective (1991) and with poet Billy Collinsâ   argument that exposure to literature was the key to learning how to write well (Lenham 2001).  Even in todayâ  s highly technological society, the skills and insights obtained through the humanities, especially those involving writing, are still considered quite relevant by the participants.  The research suggests that core curriculum could benefit from being more balanced, as suggested by Chester Finn, Dianne Ravitch, and Robert Fancher (1984), so that it includes literature and humanities to the same extent that it currently includes math, science, and social sciences.  Literature courses, however, need not be exclusively relegated to English Departments and could even be specially designed for Business Departments, such as Kish-Goodlingâ  s class that used Shakespeare to teach monetary economics (1999).  Literature courses that stress analytical reading and writing could prove quite useful to business majors.",
  "description_provenance": [
    "Author Email: sugordon@vt.edu",
    "Advisor Email: lianders@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: mpbaker@radford.edu",
    "Advisor Email: wiley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:17Z (GMT). No. of bitstreams: 1 RevisionSecondTry.pdf: 285697 bytes, checksum: dfc35368446d915b58caae2800038fd5 (MD5)   Previous issue date: 2006-02-01"
  ],
  "handle": "26165",
  "identifier_other": "etd-02102006-162144",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02102006-162144/",
  "identifier_uri": "http://hdl.handle.net/10919/26165",
  "publisher": "Virginia Tech",
  "relation_haspart": "RevisionSecondTry.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Interviews to Collect Impressions",
    "Core Requirements",
    "Business Major Curricula",
    "World Literature"
  ],
  "title": "Virginia Tech Business College Alumni Reflect on Literature in their Lives",
  "type": "Dissertation"
}