{
  "contributor_author": "Rudzinsky, Michael Steven",
  "contributor_committeechair": "Zia, Royce K. P.",
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:07:17Z",
  "date_adate": "2000-02-12",
  "date_available": "2014-03-14T20:07:17Z",
  "date_issued": "2000-02-04",
  "date_rdate": "2001-02-12",
  "date_sdate": "2000-02-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "We explore steady-state properties of a driven lattice gas, which is a simple model of <p> interacting many-particle systems, driven far from equilibrium by an external field. First,<p> we study a system on a square lattice with periodic boundary conditions (PBC) along <p> both principal lattice axes, while the drive acts along only one of these axes. For such <p> systems, we analyze the full distribution of structure factors. Next, we investigate the <p> effects of imposing other boundary conditions on the system. In particular, we focus on <p> models with shifted periodic boundary conditions (SPBC) along one axis and open <p> boundary conditions (OBC) along the other axis. The OBC allow us to have a steady flux <p> of particles through the system while the SPBC permits us to drive the system in a range <p> of possibilities. Using Monte Carlo simulation techniques, we discover a rich variety of <p> phenomena, especially at low temperatures. A continuum theory for the densities, based <p> on Langevin equations, is formulated and its predictions compared to simulation data.<p> Many large scale properties are described successfully.",
  "description_provenance": [
    "Author Email: RudzinskyMS@nswc.navy.mil, MRudzinsky@aol.com",
    "Advisor Email: rkpzia@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:17Z (GMT). No. of bitstreams: 1 Rudzinsky1.pdf: 3621914 bytes, checksum: e130c8929709dc8fe0fae12cd0ff2979 (MD5)   Previous issue date: 2000-02-04"
  ],
  "handle": "26162",
  "identifier_other": "etd-02102000-11380016",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02102000-11380016/",
  "identifier_uri": "http://hdl.handle.net/10919/26162",
  "publisher": "Virginia Tech",
  "relation_haspart": "Rudzinsky1.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "lattice gas",
    "non-equilibrium steady states",
    "Monte Carlo simulations"
  ],
  "title": "Theoretical and Simulation Studies of a Driven Diffusive System",
  "type": "Dissertation"
}