{
  "contributor_author": "Hess, Tanja Maria",
  "contributor_committeechair": "Kronfeld, David S.",
  "contributor_committeemember": [
    "Saker, Korinn E.",
    "Geor, Raymond J.",
    "Houston, Michael E.",
    "Splan, Rebecca K."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:07:17Z",
  "date_adate": "2005-02-17",
  "date_available": "2014-03-14T20:07:17Z",
  "date_issued": "2005-01-10",
  "date_rdate": "2005-02-17",
  "date_sdate": "2005-02-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Effects of potassium supplementation were evaluated in four studies in endurance horses during races and treadmill exercise.  In the first and second studies a potassium-free experimental formula was compared to potassium rich commercial formulas.  The first study showed that supplementation increased plasma [K+], and that the extra sodium in the potassium-free experimental formulas helped to attenuate acidosis at the end of the ride.  In the second study supplementation also increased plasma [K+], however speeds were lower and no increases were observed in plasma concentrations during the race. Supplementation of potassium during recovery helped to restore plasma [K+].  Higher plasma [Ca++] was found in horses supplied with experimental feeds, due to a lower dietary cation anion balance (DCAB).  Three eliminated horses had heart rate arrhythmias and labile heart rates accompanied with higher plasma [K+] and lower [Ca++] than finishers.  Also horses supplied with the experimental sodium-rich formula were less dehydrated than the ones receiving commercial formulas. The third study involved an 80 km endurance exercise test on the treadmill, and plasma [K+] was affected by potassium supplementation during exercise and recovery.  The supply of potassium caused higher plasma [K+] helping to restore body stores.  Also chloride supply in the electrolyte formulas maintained plasma [Cl-] levels during exercise and affected plasma concentrations during recovery.  The fourth study showed that potassium supply affects plasma concentration, but also increases lactate production and glucose during sub-maximal exercise.  A potassium-free electrolyte supply caused higher plasma [Ca++] during exercise. Higher sodium supply in the potassium-free electrolytes improved hydration during exercise.   These studies show that potassium should supplemented after exercise and but not be done during exercise because of the risk of increased neuromuscular excitability.",
  "description_provenance": [
    "Author Email: thess@vt.edu",
    "Advisor Email: kesaker@vt.edu",
    "Advisor Email: rgeor@uoguelph.ca",
    "Advisor Email: Davidkronfeld@aol.com",
    "Advisor Email: houstonm@vt.edu",
    "Advisor Email: rsplan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:17Z (GMT). No. of bitstreams: 1 THessDissertation100205.pdf: 972437 bytes, checksum: 9c51ae71b4df8a4f730894e54b6f603e (MD5)   Previous issue date: 2005-01-10"
  ],
  "handle": "26163",
  "identifier_other": "etd-02102005-131245",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02102005-131245/",
  "identifier_uri": "http://hdl.handle.net/10919/26163",
  "publisher": "Virginia Tech",
  "relation_haspart": "THessDissertation100205.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "calcium",
    "equine",
    "endurance exercise",
    "neuromuscular hyperexcitability",
    "potassium"
  ],
  "title": "Potassium-free and potassium-containing electrolytes affect plasma ions and acid-base status of endurance horses",
  "type": "Dissertation"
}