{
  "contributor_author": "Jepson, Philip Reid",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Niles, Jerome A.",
    "Simmons, Sarah",
    "Harris, Larry A.",
    "Parson, Stephen R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:16Z",
  "date_adate": "1999-02-15",
  "date_available": "2014-03-14T20:07:16Z",
  "date_issued": "1999-01-26",
  "date_rdate": "2000-02-15",
  "date_sdate": "1999-02-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This is a case of  technological change as it took place in Jefferson Middle School over eight years.  It is a study of how a school moved from the abstract level of  visioning and planning to the concrete level of action and implementation.  Through interviews, historical documents, and reflection a story is told using a building trade metaphor of  how the work environment, governance, and learning evolved under the leadership of a new principal as an instructional  technology plan was implemented.  A lens metaphor was used to view culture, change process, leadership, and reform and frame the guiding questions and conclusions.   The culture was transformed by empowering staff members to act and involving them in decision making.  A change in the use of instructional technology occurred because staff members shared ideas; participated in visioning, planning, and training; and used the services of  an \"outside expert\".   Leadership roles such as \"supporter,\" \"innovator,\" and \"expert\" were dispersed  among staff members.  The staff was involved in building level reform as they identified and solved problems.  This case may be helpful to practitioners implementing change.",
  "description_provenance": [
    "Author Email: pjepson@pen.k12.va.us",
    "Made available in DSpace on 2014-03-14T20:07:16Z (GMT). No. of bitstreams: 2 vita.PDF: 2700 bytes, checksum: b0b9ecd8611c8da631b12a0956d198f8 (MD5) Jepson.pdf: 286177 bytes, checksum: 9edde8193148832981483f25e913ca6f (MD5)   Previous issue date: 1999-01-26"
  ],
  "handle": "26160",
  "identifier_other": "etd-020999-125625",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-020999-125625/",
  "identifier_uri": "http://hdl.handle.net/10919/26160",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "vita.PDF",
    "Jepson.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "reform",
    "change",
    "instructional technology"
  ],
  "title": "A Blueprint for Change: The Reconstruction of a School",
  "type": "Dissertation"
}