{
  "contributor_author": "Lui, Percy Luen-Tim",
  "contributor_committeechair": "Goodsell, Charles T.",
  "contributor_committeemember": [
    "Wamsley, Gary L.",
    "Rohr, John A.",
    "Rees, Joesph V.",
    "Hult, Karen M."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:07:16Z",
  "date_adate": "1999-02-10",
  "date_available": "2014-03-14T20:07:16Z",
  "date_issued": "1999-01-29",
  "date_rdate": "1999-02-10",
  "date_sdate": "1999-02-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "THE HONG KONG SPECIAL ADMINISTRATIVE REGION: MAKING â  ONE COUNTRY, TWO SYSTEMSâ   WORK by Percy Luen-Tim Lui, Charles T. Goodsell, Chairman Center for Public Administration and Policy (ABSTRACT) The dissertation examines how the unprecedented principle, â  one country, two systems,â  can best work in Hong Kong. Because of the political, economic, legal, historical and cultural differences between Hong Kong and China, China pledges to let Hong Kong maintain its capitalist system and way of life. The Chinese socialist system and policies will not be practiced in Hong Kong. The Hong Kong people will have a high degree of autonomy in ruling themselves. The actual degree of autonomy that Hong Kong enjoys in governing itself will be the benchmark for evaluating whether the principle is a success or a failure. The best way for Hong Kong to secure its high degree of autonomy, this dissertation argues, is to construct an open and responsible government. To this end, this study proposes a series of institutional changes. These changes include: selecting the Chief Executive by universal suffrage; creating a system of ministerial responsibility; and enacting a freedom of information law. This study also suggests proposals to strengthen the operation of Hong Kongâ  s legislature, the Legislative Council (LegCo). These proposals include: removing restrictions on the legislatorsâ   power to initiate â  private membersâ   billsâ  ; restoring the LegCoâ  s simple majority vote count system; and reforming the LegCoâ  s committee and staff support systems. The purpose of all these changes is to construct an open and responsible governmental system in Hong Kong. Field study included interviews with politicians and academics involved in Hong Kong politics, examining relevant government documents, academic studies, commentaries of the newspapers, and personal observation of the case. The ultimate aim of this dissertation is to contribute to the discussion now being conducted in Hong Kong on the creation of a responsible government and the successful implementation of the principle of â  one country, two systems.â",
  "description_provenance": [
    "Author Email: llui2000@hotmail.com",
    "Advisor Email: WAMSLEY@VT.EDU",
    "Advisor Email: JROHR@VT.EDU",
    "Advisor Email: REESJ@VT.EDU",
    "Advisor Email: GOODSELL@VT.EDU",
    "Advisor Email: KHULT@VT.EDU",
    "Made available in DSpace on 2014-03-14T20:07:16Z (GMT). No. of bitstreams: 14 CHAPTER1.PDF: 94141 bytes, checksum: bd330de6648be223ff5d0581b2698a60 (MD5) CHAPTER2.PDF: 116777 bytes, checksum: fb7761b6258e11a7a1ccb0bc02a9592d (MD5) CHAPTER3.PDF: 128279 bytes, checksum: 9e44a75fb5d923c9ec1694ff6ce61c51 (MD5) THANKS.PDF: 6299 bytes, checksum: 1c9ba8c3807ae1265d1ba5a3c9688a44 (MD5) VITA.PDF: 5021 bytes, checksum: dbc068ede8b6499854355b47bbbcc865 (MD5) CHAPTER4.PDF: 127905 bytes, checksum: 400767e34b9563a57d575eecf926683c (MD5) CHAPTER6.PDF: 56800 bytes, checksum: 06d3b92130012cdf4c264820ac030414 (MD5) BIBLIO.PDF: 35959 bytes, checksum: db5623034153f00b94dc1de98aa125b0 (MD5) CHAPTER5.PDF: 177567 bytes, checksum: 9b8f68014fa4b207b2316460402be29a (MD5) CONTENT.PDF: 13111 bytes, checksum: 2770cae206234685d26869b196144399 (MD5) FOR.PDF: 5457 bytes, checksum: 2b5013cdd478b739b79dba3858963ee6 (MD5) ABSTRACT.PDF: 6227 bytes, checksum: 6c699fd8848ee415e2c64e824c9c5b6e (MD5) BRIEF.PDF: 5991 bytes, checksum: 0d8376c26607d2b39205d489283e6317 (MD5) COVER.PDF: 3564 bytes, checksum: a3d656667a35687d518a051252919ecc (MD5)   Previous issue date: 1999-01-29"
  ],
  "handle": "26161",
  "identifier_other": "etd-020999-142542",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-020999-142542/",
  "identifier_uri": "http://hdl.handle.net/10919/26161",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAPTER1.PDF",
    "CHAPTER2.PDF",
    "CHAPTER3.PDF",
    "THANKS.PDF",
    "VITA.PDF",
    "CHAPTER4.PDF",
    "CHAPTER6.PDF",
    "BIBLIO.PDF",
    "CHAPTER5.PDF",
    "CONTENT.PDF",
    "FOR.PDF",
    "ABSTRACT.PDF",
    "BRIEF.PDF",
    "COVER.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "One Country",
    "The Hong Kong Special Administrative Region",
    "Two Systems"
  ],
  "title": "The Hong Kong Special Administrative Region: Making \"One Country, Two Systems\" Work.",
  "type": "Dissertation"
}