{
  "contributor_author": "Spargo, John T",
  "contributor_committeechair": "Alley, Marcus M.",
  "contributor_committeemember": [
    "Evanylo, Gregory K.",
    "Follett, Ronald F.",
    "Phillips, Steven B.",
    "Zelazny, Lucian W."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:07:17Z",
  "date_adate": "2008-03-04",
  "date_available": "2014-03-14T20:07:17Z",
  "date_issued": "2008-02-01",
  "date_rdate": "2008-03-04",
  "date_sdate": "2008-02-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "No-till management for agronomic crop production is recognized as an effective practice to regain a portion of soil organic matter lost following decades of cultivation. Increasing soil organic matter sequesters C, conserves organic N and concomitantly improves soil quality. Objectives of this research were to: i) quantify C sequestration rate and N conservation with duration of continuous no-till; ii) measure C stratification with continuous no-till as an indicator of soil quality; and iii) evaluate the Illinois soil N test (ISNT) for its value to predict fertilizer N needs of corn in Virginia. Objectives i and ii were achieved by collecting soil samples from 63 production fields in the Virginia Coastal Plain that were managed using continuous no-till from 0 to 14 yrs. No-till management resulted in sequestration of 0.308 ± 0.280 Mg C ha-1 yr-1 and conservation of 22.2 ± 21.2 kg N ha-1 yr-1 (0-15 cm). The C stratification ratio (0-2.5 cm: 7.5-15 cm) increased with increasing duration of continuous no-till (0.133 ± 0.056 yr-1) due to the accumulation of organic matter at the soil surface indicating improved soil quality with continuous no-till management.  Objective iii was addressed by conducting 29 on-farm fertilizer N response trials in major corn producing areas of Virginia with the duration of continuous no-till management ranging from 0 to 25 yrs. The ISNT values were significantly related to yield without fertilizer N (r2 = 0.57; p<0.001) and relative yield (r2 = 0.64; p<0.0001). We also found that the ISNT extracted a relatively consistent percentage of total soil N (16.3 ± 0.73 %) suggesting it is a poor indicator of labile N. Total soil N values did almost as well as the ISNT in predicting yield without fertilizer N (r2 = 0.53; p = 0.0002), and equally well predicting relative yield (r2 = 0.64; p<0.0001). Results do not suggest the ISNT is useful for measuring mineralizalbe N or improving fertilizer N recommendations in Virginia cropping systems.",
  "description_provenance": [
    "Author Email: jspargo@vt.edu",
    "Advisor Email: malley@vt.edu",
    "Advisor Email: gevanylo@vt.edu",
    "Advisor Email: ronald.follett@npa.ars.usda.gov",
    "Advisor Email: sphillips@ipni.net",
    "Advisor Email: zelazny@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:17Z (GMT). No. of bitstreams: 1 JSpargo.pdf: 636169 bytes, checksum: 4cb1844e87501a0f7c1c29e91cac64fe (MD5)   Previous issue date: 2008-02-01"
  ],
  "handle": "26166",
  "identifier_other": "etd-02102008-174038",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02102008-174038/",
  "identifier_uri": "http://hdl.handle.net/10919/26166",
  "publisher": "Virginia Tech",
  "relation_haspart": "JSpargo.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Nitrogen use efficiency",
    "carbon trading",
    "nutrient trading",
    "soil organic matter"
  ],
  "title": "Continuous No-till Management: Implications for Soil Quality, Carbon Sequestration, and Nitrogen Conservation",
  "type": "Dissertation"
}