{
  "contributor_author": "Keurentjes, Amy Elizabeth",
  "contributor_committeechair": "Sutphin, H. Dean",
  "contributor_committeemember": [
    "Tooke-Rawlins, Dixie",
    "Redican, Kerry J.",
    "Burton, John K."
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:07:19Z",
  "date_adate": "2009-04-30",
  "date_available": "2014-03-14T20:07:19Z",
  "date_issued": "2009-01-26",
  "date_rdate": "2009-04-30",
  "date_sdate": "2009-02-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Osteopathic Manipulative Treatment (OMT) has been used for more than 100 years to enhance the physiologic process of labor and delivery by normalizing pelvic structures and providing adequate blood supply to the uterus. Since maternal morbidity and mortality is a major health concern for developing countries, it was desirable to explore the benefits of OMT.  After IRB approval by the Virginia College of Osteopathic Medicine and Virginia Tech, the research was conducted in Santo Domingo, Dominican Republic at Hospital Maternidad Nuestra Señora de la Altagracia to determine the relationship of OMT during labor and delivery on rates of cesarean section and perineal lacerations/ episiotomies. Qualifying candidates received the next sequentially numbered envelope with a randomized number assigning her to either the treatment or control group. Staff physicians at the hospital provided care to women in the control group according to their standard protocol. Four Osteopathic Physicians and one pre-doctoral OMM fellow performed OMT on women during the first and second stages of labor and performed their deliveries. There were 33 parturients in the OMT Treatment group and 32 in the control, for a total of 65 in the trial. The results of a logistic regression analysis using Wald criterion, with a statistical significance of alpha = 0.05, indicated treatment group reduction of rates of episiotomies in the primiparous (P = .04) and marginal significance in the combined primiparous and multiparous population (P = .05). The percentage of episiotomies in the primiparous treatment group was 35.29% and 75% in the control group. The percentage of episiotomies in the combined primiparous and multiparous groups were 15.15% in the treatment group and 37.5% in the control group. The cesarean rate for the treatment group was 9.09% and 18.75% for the control group (P = 0.098). The percentages of grade I & II perineal lacerations were 15.15% for the treatment group and 12.5% for the control group (P = 0.55) due to the extensive use of episiotomies in the control group. There were composite calculations made of the total number of parturients who had either a cesarean section, an episiotomy, or a perineal laceration so that overall maternal morbidity in each group could be compared. In the combined groups, there were fourteen total parturients (42.42%) who had undergone one of the three outcomes measures in the treatment group and twenty-one (65.63%) in the control group. This brings an odds ratio of 0.200 and a significant P value of 0.0235. Though cross-cultural issues made it difficult to perform the research as originally intended, there is evidence that Osteopathic Obstetrics provides benefit to parturients. A multi-institutional randomized controlled trial is proposed as the next step for the evaluation of OMT during labor and delivery.",
  "description_provenance": [
    "Author Email: amykeurentjes@gmail.com",
    "Advisor Email: dsutphin@vcom.vt.edu",
    "Advisor Email: dtrawlin@vcom.vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:19Z (GMT). No. of bitstreams: 1 KeurentjesVTDissertation.pdf: 402754 bytes, checksum: 9e2c1104b1e68e0d3a9596f72673d64e (MD5)   Previous issue date: 2009-01-26"
  ],
  "handle": "26177",
  "identifier_other": "etd-02112009-061740",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02112009-061740/",
  "identifier_uri": "http://hdl.handle.net/10919/26177",
  "publisher": "Virginia Tech",
  "relation_haspart": "KeurentjesVTDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "maternal morbidity",
    "osteopathic manipulation",
    "OMT",
    "Dominican Republic",
    "cesarean section",
    "perineal laceration"
  ],
  "title": "Relationship of Osteopathic Manipulative Treatment During Labor and Delivery on Selected Maternal Morbidity Outcomes: A Randomized Controlled Trial",
  "type": "Dissertation"
}