{
  "contributor_author": "Alqahtani, Abdulmuhsen",
  "contributor_committeechair": "Salmon, Richard G.",
  "contributor_committeemember": [
    "Alexander, M. David",
    "Riad, Sedki Mohamed",
    "Fortune, Jimmie C."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:18Z",
  "date_adate": "2007-02-15",
  "date_available": "2014-03-14T20:07:18Z",
  "date_issued": "2007-02-09",
  "date_rdate": "2009-02-15",
  "date_sdate": "2007-02-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study aimed at investigating the differences in expectations between students with respect to their chosen programs between two English degree programs (Arts and Education). Eight research questions were formulated to pursue the purpose of this study. 351 students of English from the College of Education and the Faculty of Arts constituted the sample. The data was collected randomly through the use of survey questionnaire and was analyzed with the use of SPSS v11.0. Frequencies and percentage distributions as well as two independent-samples t-test statistical procedures were used to analyze the collected data.  In general, the results showed that students' expectations played an important role in students' choice of the preferred program of study with respect to English language programs. Based on a given context, students were found to hold what could be termed 'global' expectations where students show similar expectation, and 'program-related' expectations. One main conclusion drawn from this study was that students' expectations were vital in students' decision to invest in continued participating in education. Students were significantly statistically differentiated as a function of different expectations, particularly economic expectations. However, expectations were not just confined to pecuniary benefits; students tended to value the non-pecuniary benefits as well. Hence, students, along with their expectations should be included in evaluating or revising the academic programs instead of relying thoroughly on signals coming from the labor market and employers. Implications for educational policies and recommendations for future research were included as well.",
  "description_provenance": [
    "Author Email: amalqa70@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: sriad@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:18Z (GMT). No. of bitstreams: 1 Alqahtani_AA_D_2007.pdf: 632560 bytes, checksum: 1f337200cf65baabce4f8cb669aa119e (MD5)   Previous issue date: 2007-02-09"
  ],
  "handle": "26174",
  "identifier_other": "etd-02112007-191344",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02112007-191344/",
  "identifier_uri": "http://hdl.handle.net/10919/26174",
  "publisher": "Virginia Tech",
  "relation_haspart": "Alqahtani_AA_D_2007.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Students' expectations",
    "program of study"
  ],
  "title": "An Exploratory Study of Students' Expectations of Different Academic Programs: English language-related programs as a case study",
  "type": "Dissertation"
}