{
  "contributor_author": "Soh, Boon Kee",
  "contributor_committeechair": "Smith-Jackson, Tonya L.",
  "contributor_committeemember": [
    "North, Christopher L.",
    "Babski-Reeves, Kari L.",
    "Kleiner, Brian M."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:07:18Z",
  "date_adate": "2007-04-24",
  "date_available": "2014-03-14T20:07:18Z",
  "date_issued": "2007-02-05",
  "date_rdate": "2007-04-24",
  "date_sdate": "2007-02-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This dissertation set out to understand the decision processes used by decision makers in adversarial environment by setting up an adversarial decision making microworld, as an experimental platform, using a real time strategy (RTS) game called Rise of Nations (RON).  The specific objectives of this dissertation were: </p> <P> 1.\tContribute to the validation of recognition-primed decision (RPD) model in a simulated adversarial environment;</P> <p>2.\tExplore the roles of common-sense strategies in decision making in the adversarial environment; and </p> <p>3.\tTest the effectiveness of training recommendations based on the RPD model.</p> <p> Three related experimental studies were setup to investigate each of the objectives.  Study 1 found that RPD model was partly valid where RPD processes were prevalently used but other decision processes were also important in an adversarial environment.  A new decision model (ConPAD model) was proposed to capture the nature of decision making in the adversarial environment.  It was also found that cognitive abilities might have some effects on the types of decision processes used by the decision makers.  </p> <P> Study 2 found that common-sense strategies were prevalent in the adversarial environment where the participants were able to use all but one of the warfare related strategies extracted from literature without teaching them.  The strategy familiarization training was not found to significantly improve decision making but showed that common-sense strategies were prevalent and simple familiarization training was not sufficient to produce differences in strategy usage and performances from the novice participants.  Study 3 also found that RPD based training (cue-recognition and decision skill training) were not significant in producing better performance although subjective feedback found such training to be useful.  However, the participants with RPD based training conditions were able to perform on the same level as the expert participants bridging the gap between novices and experts. </p> <p> Based on the findings, it was recommended that decision training should involve not just RPD based training, but comparisons of attributes as well.  A more interactive training combining common-sense strategies, cue-recognition and decision skill training might be more useful.  More theoretical experimentation would be required to validate the new decision model proposed in this dissertation.  </p>",
  "description_provenance": [
    "Author Email: bsoh@vt.edu",
    "Advisor Email: north@vt.edu",
    "Advisor Email: kari@ise.msstate.edu",
    "Advisor Email: smithjac@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:18Z (GMT). No. of bitstreams: 1 Soh_Dissertation_ETD.pdf: 4720180 bytes, checksum: 73a0c27170c5b9e775f9ed3494342567 (MD5)   Previous issue date: 2007-02-05"
  ],
  "handle": "26173",
  "identifier_other": "etd-02112007-003951",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02112007-003951/",
  "identifier_uri": "http://hdl.handle.net/10919/26173",
  "publisher": "Virginia Tech",
  "relation_haspart": "Soh_Dissertation_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "decision skill training",
    "working memory",
    "attention",
    "adversarial environment",
    "cue-recognition training",
    "computer game",
    "decision making",
    "ConPAD model",
    "decision models",
    "naturalistic decision making",
    "dynamic decision making",
    "cognitive probing",
    "common-sense strategies",
    "Recognition-primed decision model",
    "real-time strategy game",
    "cognitive abilities",
    "microworld",
    "retrospective interview"
  ],
  "title": "Validation of the recognition-primed decision model and the roles of common-sense strategies in an adversarial environment",
  "type": "Dissertation"
}