{
  "contributor_author": "Luseno, Florah Kavulani",
  "contributor_committeechair": "Gillespie, Diane Newkirk",
  "contributor_committeecochair": "McGrady, Harold J.",
  "contributor_committeemember": [
    "Salmon, Richard G.",
    "Billingsley, Bonnie S.",
    "Cross, Lawrence H.",
    "Radcliffe, Patricia"
  ],
  "contributor_department": "Administration and Supervision of Special Education",
  "date_accessioned": "2014-03-14T20:07:20Z",
  "date_adate": "2001-02-22",
  "date_available": "2014-03-14T20:07:20Z",
  "date_issued": "2001-01-17",
  "date_rdate": "2002-02-22",
  "date_sdate": "2001-02-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "AN ASSESSMENT OF THE PERCEPTIONS OF SECONDARY  SPECIAL AND GENERAL EDUCATION TEACHERS WORKING IN  INCLUSIVE SETTINGS IN THE COMMONWEALTH OF VIRGINIA  by  FLORAH KAVULANI LUSENO  Committee Chair: Diane N. Gillespie; Co-Chair: Harold J. McGrady  Administration and Supervision of Special Education  (ABSTRACT)  One of the major challenges facing special and general classroom teachers stems from the current educational movement towards inclusion, a process that emphasizes providing special education services to students with disabilities within the regular classroom. Studies reviewed indicate that  difficulties occur in instituting integrated programs within general classrooms because educators working in inclusive settings lack knowledge of strategies needed to implement such programs effectively.   The purposes of this study were to determine whether secondary special and general education teachers working in inclusive settings in Virginia had: (a) a positive attitude towards inclusion and students with disabilities; (b) perceived themselves capable of adapting instruction to students with disabilities; (c) had the resources and support needed; and (d) perceived themselves knowledgeable of pertinent information required for teaching students with disabilities in inclusive classrooms. Information collected was also designed to identify: (e) whether these special and general educators collaborated in their inclusive classrooms; (f) the type of support received in working with students with disabilities; and (g) areas of needs the two groups of teachers have in working with students with disabilities in inclusive classrooms.  A total of 400 questionnaires, consisting of 36 Likert-statements and 19 open-ended items, were mailed to a stratified random sample of 200 special and 200 general classroom teachers working in inclusive settings in Virginia. Out of this total, usable questionnaires were received from 84% (n = 167) of the general education and 62% (n = 124) of the special education teachers, for an overall response rate of 73%.  An analysis of data collected, using descriptive statistics, thematic analysis, and analysis of variance, indicated that special educators, compared to general educators: (1) had more positive attitudes towards inclusion and students with disabilities; (2) perceived themselves more capable of adapting instruction to students with disabilities; (3) felt resources and support needed to work with students with disabilities were available; 4) had a greater sense of efficacy when it comes to knowledge required for teaching students with disabilities; and (5) worked more collaboratively in providing assistance to each other regarding students with disabilities.   Both groups of special and general educators had a negative attitude towards educating: (6) most students with disabilities (regardless of the level of their disability) in the regular classroom; especially (7) students with behavioral disorders, mental retardation, and multi-disabling conditions. These teachers also felt: (8) students with disabilities lack skills needed to master the regular classroom course content; and that (9) the large teaching load in the regular classroom makes it hard to meet the needs of students educated in inclusive settings effectively. Furthermore, both groups of teachers indicated they: (9) predominantly received support from other teachers and guidance  counselors in working with students educated in their inclusive classrooms.   Information focusing on areas of needs in working with students with disabilities indicated the two groups of teachers identified different areas of needs. The special educators noted they need: (10) more influence in the placement and decision making process, extra time for collaborating with others, reduced class loads, a clarification of the roles and responsibilities of special and general educators working in inclusive classrooms, and guidelines for meeting the new standards of learning. In contrast, the general educators indicated they require: (11) support from their administrators and parents, more resources and instructional material, assistance in dealing with school administrators who hold all students to equal standards, and training in special education and strategies for working with students with disabilities, behavior management, discipline, and anger management and conflict resolution. Implications this information has for school districts and teacher training institutions are discussed.",
  "description_provenance": [
    "Author Email: fluseno@ameritech.net",
    "Advisor Email: dgilles@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: hmcgrady@aol.com",
    "Advisor Email: bbilling@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: pradcliffe@rcs.k12",
    "Made available in DSpace on 2014-03-14T20:07:20Z (GMT). No. of bitstreams: 1 FlosElectronicDissertation.pdf: 272664 bytes, checksum: ce6f13e497ea4ab34e1a1b22e65e2250 (MD5)   Previous issue date: 2001-01-17"
  ],
  "handle": "26181",
  "identifier_other": "etd-02132001-003827",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02132001-003827/",
  "identifier_uri": "http://hdl.handle.net/10919/26181",
  "publisher": "Virginia Tech",
  "relation_haspart": "FlosElectronicDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Attitude",
    "Teachers",
    "Secondary school",
    "Inclusion"
  ],
  "title": "An Assessment of the Perceptions of Secondary Special and General Education Teachers Working in Inclusive Settings in the Commonwealth of Virginia",
  "type": "Dissertation"
}