{
  "contributor_author": "Beitin, Ben K",
  "contributor_committeechair": "Allen, Katherine R.",
  "contributor_committeemember": [
    "Protinsky, Howard O. Jr.",
    "Johnson, Scott W.",
    "Benson, Mark J.",
    "Sawyers, Janet K."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:07:20Z",
  "date_adate": "2003-02-21",
  "date_available": "2014-03-14T20:07:20Z",
  "date_issued": "2003-01-24",
  "date_rdate": "2004-02-21",
  "date_sdate": "2003-02-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research explored how Arab American couples found the strength and resilience that empowered them to overcome the terrorist attacks of September 11th and the aftereffects that followed. Utilizing a family resiliency model grounded in systems theory and social constructionism, I interviewed 18 Arab American couples from the New York and New Jersey areas. I applied a phenomenological method of inquiry to gather the experiences of Arab American couples in order to understand the protective processes of resilience. Couples reported fear and caution because of incidents of threats and violence against Arabs in the United States. Some couples described incidents against them.  Couples accessed a variety of resources to survive the aftereffect. These included coping skills developed during previous experiences of terror, American community support, determination, and religion. There were four major conclusions: resilient marriages, larger systems, process of identity, and religion: unify and identity. I discussed these conclusions in the context of the conceptual framework and made clinical and theoretical implications.",
  "description_provenance": [
    "Author Email: bbeitin@vt.edu",
    "Advisor Email: hprotins@vt.edu",
    "Advisor Email: swj@vt.edu",
    "Advisor Email: mbenson@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: sawyers@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:20Z (GMT). No. of bitstreams: 2 etdcoverabstracttableofcontents.pdf: 15633 bytes, checksum: 37fa33b50c8742eb3352141287c80121 (MD5) etddissertation.pdf: 530774 bytes, checksum: d049e814d87f4a6137a3eaed2ea51c3b (MD5)   Previous issue date: 2003-01-24"
  ],
  "handle": "26183",
  "identifier_other": "etd-02132003-000048",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02132003-000048/",
  "identifier_uri": "http://hdl.handle.net/10919/26183",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etdcoverabstracttableofcontents.pdf",
    "etddissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "resilience",
    "terrorist attacks",
    "Arab",
    "September 11",
    "couple",
    "family therapy"
  ],
  "title": "Resilience In Arab American Couples in the Wake of the Terrorist Attacks on New York City: A Family Systems Perspective",
  "type": "Dissertation"
}