{
  "contributor_author": "Burton, Samuel Lee",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Redican, Kerry J.",
    "Bolin, Delmas",
    "Krackow, Mike"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:20Z",
  "date_adate": "2006-02-24",
  "date_available": "2014-03-14T20:07:20Z",
  "date_issued": "2006-02-09",
  "date_rdate": "2006-02-24",
  "date_sdate": "2006-02-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to determine if a firefighterâ  s fundamental movement patterns can act as predictors for occupational injury and performance during the firefighter academy training. The study consisted of 23 firefighter candidates entering the 16-week firefighter academy training. The firefighter candidatesâ  , VO2Max, 1.5 mile-run and Firefighter Physical Conditioning Course and movement patterns were assessed at the on-set of the 16-week training. The firefighter movement patterns were assessed utilizing the Functional Movement Screen, which was designed to identify flaws in fundamental movement patterns. The firefighter candidates were then observed and their injuries documented during the firefighter academy training. The injury results as well as the initial performance tests were then compared to the results obtained by the Functional Movement Screen. There were no significant findings when comparing the Functional Movement Screen to the performance tests. The only significant correlation was with the Functional Movement Screen asymmetry score and the Firefighter Physical Conditioning Course. The relationship between the injuries recorded and Functional Movement Screen scores were inconclusive. The results of this study were unable to determine if a movement-based assessment such as the Functional Movement Screen can be utilized as an injury or performance predictor tool.  The findings determined that further research needs to be performed with efforts placed on larger population groups and more emphasis placed on the scoring and analysis criteria used by the movement-based assessment.",
  "description_provenance": [
    "Author Email: lburton@averett.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:20Z (GMT). No. of bitstreams: 1 LBFireDiss206Rev1.pdf: 1563284 bytes, checksum: e43f8bbf7fc58a6af730d4e3a7f98c7f (MD5)   Previous issue date: 2006-02-09"
  ],
  "handle": "26184",
  "identifier_other": "etd-02132006-123900",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02132006-123900/",
  "identifier_uri": "http://hdl.handle.net/10919/26184",
  "publisher": "Virginia Tech",
  "relation_haspart": "LBFireDiss206Rev1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Functional Movement Screen",
    "Kinetic Chain",
    "Core Strength",
    "Fundamental Movement Patterns"
  ],
  "title": "Performance and Injury Predictability during Firefighter Candidate Training",
  "type": "Dissertation"
}