{
  "contributor_author": "Latter, Macy Little",
  "contributor_committeechair": "Sutphin, H. Dean",
  "contributor_committeemember": [
    "Harden, David",
    "Redican, Kerry J.",
    "Lepczyk, Billie F."
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:07:20Z",
  "date_adate": "2009-04-14",
  "date_available": "2014-03-14T20:07:20Z",
  "date_issued": "2009-01-30",
  "date_rdate": "2009-04-14",
  "date_sdate": "2009-02-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Osteopathic Manipulative Therapy (OMT) is underutilized in addressing lung function and symptoms in asthma patients. The objective of this study was to determine if a single session of OMT can improve lung function and symptoms in patients suffering from asthma, and if patients can be taught a self-administered home OMT protocol to control their symptoms, in order to develop a protocol by which physicians can apply OMT to address lung disease in patients. This was a purposive randomized controlled quasi-experimental study which took place in family practice, pulmonology, and asthma specialist offices in southwest Virginia. The intervention was a ten-minute  semi-individualized OMT protocol and a self administered home OMT education session.  Variable baseline, within-subject study design was utilized, allowing each person to serve as his or her own control. Pre and posttest measurements included: participant spirometry FEV1, FVC, and PEF; thoracic excursion upper and lower rib cage motion; and a five-question rating scale to determine current asthma symptoms. A ten-minute OMT session included an individualized thoracic and rib screening and treatment, suboccipital release, diaphragm release, and thoracic pump. Comparison between pre- and post-OMT lung function and symptoms portrayed change. For the second part of the study, the participants were divided into two groups with group two receiving a ten-minute home OMT education session and a handout of the home OMT techniques. All participants returned two weeks later for a follow up lung function assessment.    Statistically significant (p<.05) improvements after initial OMT were documented for 8 of 10 measurements. Only two spirometry values, FEV1 and PEF, did not significantly improve. The group who participated in the home OMT education session had statistically significant improvements in 3 of 10 measurements, including the upper and lower thoracic excursion measurements and the overall asthma symptoms rating.    With a simple, easy to repeat, 10 minute semi-individualized OMT session, researchers demonstrated improved lung function and symptoms in this group of participants in Southwest Virginia. The addition of a home OMT education session was demonstrated to be at least partially beneficial. Future studies should expand on this pilot study with the researchers recommending using a larger patient population including patients with lower pre-treatment spirometry values in order to accurately monitor potential  for change.",
  "description_provenance": [
    "Author Email: macylatter@gmail.com",
    "Advisor Email: dgharden@vcom.vt.edu",
    "Advisor Email: dsutphin@vcom.vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: lepczyk@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:20Z (GMT). No. of bitstreams: 1 MacyLatterThesisApril3.pdf: 780529 bytes, checksum: a9b49f2e0ae4590e1e54b277c21f7e19 (MD5)   Previous issue date: 2009-01-30"
  ],
  "handle": "26189",
  "identifier_other": "etd-02132009-194552",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02132009-194552/",
  "identifier_uri": "http://hdl.handle.net/10919/26189",
  "publisher": "Virginia Tech",
  "relation_haspart": "MacyLatterThesisApril3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Southwest Virginia",
    "osteopathic manipulative treatment",
    "asthma"
  ],
  "title": "The Use of Osteopathic Manipulation in a Clinic and Home Setting to Address Pulmonary Distress as Related to Asthma in Southwest Virginia",
  "type": "Dissertation"
}