{
  "contributor_author": "Hargens, Trent Alan",
  "contributor_committeechair": "Herbert, William G.",
  "contributor_committeemember": [
    "Nickols-Richardson, Sharon M.",
    "Davy, Kevin P.",
    "Hosig, Kathryn Wright",
    "Gregg, John M.",
    "Zedalis, Donald"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:07:20Z",
  "date_adate": "2007-03-06",
  "date_available": "2014-03-14T20:07:20Z",
  "date_issued": "2007-02-02",
  "date_rdate": "2010-03-06",
  "date_sdate": "2007-02-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Obstructive sleep apnea syndrome (OSAS) is a serious disorder that affects an estimated 24% of middle-age males, and 9% of middle-aged females.  In addition, a large portion of individuals with OSAS go undiagnosed.  OSAS is associated with several adverse health problems, including the metabolic syndrome.    Therefore, there is a clear need to identify new methods for assessing OSAS risk.  The exercise test has been used effectively as a diagnostic and prognostic tool for those at high risk for cardiovascular disease and hypertension.  Research into the cardiopulmonary responses to exercise testing in young adult men with OSAS has not been examined.  Objectives:  The objectives of this study were to:  1) evaluate whether OSAS is characterized by exaggerated ventilatory responses to ramp exercise testing, with a secondary aim to evaluate if variations in serum leptin concentration might exert a regulatory in ventilatory responses during exercise; 2) To evaluate whether autonomic control of the cardiovascular response during exercise is distorted by OSAS in young overweight men, as manifested by a blunting of heart rate and exaggeration of blood pressure responses.; 3) To explore whether various simple clinical measures and response patterns from graded exercise testing might serve to discriminate between young men with and without OSAS.  Methods:  For objectives one and two, 14 obese men with OSAS [age = 22.4 Â± 2.8; body mass index (BMI) = 32.0 Â± 3.7; apnea-hypopnea index (AHI) = 22.7 Â± 18.5], 16 obese men without OSAS (age = 21.4 Â± 2.6; BMI = 31.4 Â± 3.7), and 14 normal weight subjects (objective 2) (age = 21.4 Â± 2.1; BMI = 22.0 Â± 1.3) were recruited.  For objective three, 91 men (age = 21.6 Â± 2.8; AHI range = 0.6 â   60.5; BMI range = 19.0 â   43.9) were recruited.  Subjects completed a ramp cycle ergometer exercise test, and a fasting blood sample was obtained to measure plasma leptin and blood lipid levels.  Repeated measures ANOVA and stepwise linear regression was used to examine objectives 1 and 2.  For objective 3, stepwise linear regression and receiver operator curve (ROC) analysis was utilized.  Results:  Ventilation (VE), the ventilatory equivalents for oxygen (VE/VO2) and carbon dioxide (VE/VCO2) were greater in the OSAS subjects vs. the overweight subjects without OSAS (P = 0.05, P < 0.05 and P < 0.005, respectively) at all exercise intensities.  Heart rate (HR) recovery was attenuated in the overweight OSAS subjects compared to the No-OSAS and Control groups throughout 5 minutes of active recovery (P = 0.009).  Oxygen uptake, HR, and blood pressure did not differ throughout exercise.  Leptin was not associated with ventilatory responses at any exercise intensity.  Linear regression analysis revealed hip-to-height ratio (HHR), hip circumference (HC), triglyceride levels, and recovery systolic blood pressure ratio (SBPR) at 2 and 4 minutes were independent predictors of AHI (model fit:  R2 = 0.68, p <0.0001).  ROC analysis determined that percent body fat, HHR, and recovery HR at 2 minutes and 4 minutes were the best single predictors of OSAS risk (AUC = 0.77 for each measure, p = 0.003).  Conclusions:  Unique ventilatory and hemodynamic characteristics to maximal exercise testing are exhibited in young men with OSAS.  These characteristics may be related to alterations in the sympathetic nervous system and chemoreceptor activation, and may be early clinical signs in the progression of OSAS.  These exercise characteristics, along with anthropometric and body composition measures may provide useful information in identifying young men at risk for OSAS.",
  "description_provenance": [
    "Author Email: thargens@vt.edu",
    "Advisor Email: smn13@psu.edu",
    "Advisor Email: kdavy@vt.edu",
    "Advisor Email: khosig@vt.edu",
    "Advisor Email: jgregg@vt.edu",
    "Advisor Email: wgherb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:20Z (GMT). No. of bitstreams: 1 Dissertation_THarg_3.1.07.pdf: 983825 bytes, checksum: ac4bcd669f0873a3a7b803df1b41106c (MD5)   Previous issue date: 2007-02-02"
  ],
  "handle": "26185",
  "identifier_other": "etd-02132007-154538",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02132007-154538/",
  "identifier_uri": "http://hdl.handle.net/10919/26185",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_THarg_3.1.07.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ventilation",
    "chemoreceptors",
    "heart rate",
    "obstructive sleep apnea syndrome",
    "exercise testing"
  ],
  "title": "The Effects of Obstructive Sleep Apnea Syndrome on Cardiovascular Function with Exercise Testing in Young Adult Males",
  "type": "Dissertation"
}