{
  "contributor_author": "Mongado, Blair Coja",
  "contributor_committeechair": "Yang, Dennis T.",
  "contributor_committeemember": [
    "Mills, Bradford F.",
    "Lutz, Nancy A.",
    "Salehi-Isfahani, Djavad"
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:07:20Z",
  "date_adate": "2007-03-30",
  "date_available": "2014-03-14T20:07:20Z",
  "date_issued": "2007-02-01",
  "date_rdate": "2010-03-30",
  "date_sdate": "2007-02-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research investigates three topics in child care quality, motherâ  s labor supply, and early childhood development. In the first study, we evaluate how child care quality influences the potential impacts of mothersâ   labor supply on child development. Although, previous studies have acknowledged the importance of the quality of child care, none have integrated quality in analyzing the effects of maternal employment. We find that the negative effect often found in past studies is largely due to the use of low quality child care.  The question we ask in the next study is, \"What are the effects of child care quality on child development?\" In this study we tried to separate out the contribution of initial child ability in child test scores of development from the effects of other inputs, particularly child care quality. We show that even after resolving endogeneity issues, we still find that child care quality has a significant positive effect on early cognitive development.  The third study investigates the determinants of householdsâ   demand for child care, particularly, child care quality. We determine if householdsâ   choices regarding child care quality, as well as quantity, respond to economic factors. A familyâ  s condition is defined by the combination of family choices on motherâ  s work status, mode and payment type of child care, and childâ  s age. We group families by condition and estimate demand for child care quality and hours by group. The results indicate that higher income will lead to higher quality for non-working mothers but lower quality for some working mothers. Demand for quality by non-working mothers are more price sensitive than working mothers. Wage effects on quality are positive only for users of home-based care. Demand for quality is more sensitive to economic factors when the child is around 3 years old than at 6 months. These results suggest that the form, target and timing of financial assistance need to be considered for it to be effective in promoting the use of quality care.",
  "description_provenance": [
    "Author Email: bmongado@vt.edu",
    "Advisor Email: bfmills@vt.edu",
    "Advisor Email: nlutz@vt.edu",
    "Advisor Email: deyang@vt.edu",
    "Advisor Email: salehi@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:20Z (GMT). No. of bitstreams: 1 Dissertation_Mongado2.pdf: 3600356 bytes, checksum: fbb4a6f9fcfbe5ccc7fd7d0f6c6a661e (MD5)   Previous issue date: 2007-02-01"
  ],
  "handle": "26186",
  "identifier_other": "etd-02132007-171834",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02132007-171834/",
  "identifier_uri": "http://hdl.handle.net/10919/26186",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Mongado2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "child care",
    "early childhood development",
    "economics",
    "maternal labor supply"
  ],
  "title": "Essays in Child Care Quality",
  "type": "Dissertation"
}