{
  "contributor_author": "Hockett, Karen Sue",
  "contributor_committeechair": "Roggenbuck, Joseph W.",
  "contributor_committeemember": [
    "Axsom, Daniel K.",
    "Smith-Jackson, Tonya L.",
    "Marion, Jeffrey L.",
    "Hull, Robert Bruce IV"
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:07:20Z",
  "date_adate": "2008-04-01",
  "date_available": "2014-03-14T20:07:20Z",
  "date_issued": "2008-01-28",
  "date_rdate": "2008-04-01",
  "date_sdate": "2008-02-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This two-part research project evaluated the effectiveness of interpretive messages at Fossil Butte National Monument in conveying knowledge about the place and its resources and promoting respect for the fossil resource.  The first study measured the short and long-term knowledge gains from a trip to the Visitor Center and the influence of a specially designed fossil respect message on the fossil protection beliefs of Monument visitors.  The Visitor Center was successful in conveying information about the fossil resource and story of Fossil Lake, and that knowledge was retained for at least several weeks.  However, neither the Visitor Center nor the special message, were successful in improving the fossil respect beliefs of respondents.  The second study combined a visitor survey with direct observations of visitor behavior to evaluate the effectiveness of interpretive materials along a nature trail in improving the knowledge of ancient Fossil Lake, increasing fossil respect beliefs, and reducing depreciative behaviors.  Six different treatments were applied that evaluated an interpretive sign, box of fossils that visitors were invited to touch, and participation in an interactive interpretive program. Only the interpretive program increased knowledge of the Fossil Lake story. None of the trail interpretive materials improved fossil respect beliefs.  The sign was somewhat effective in reducing entry into a closed research quarry.  While it is generally thought that those most knowledgeable about natural resources will have the higher resource protection beliefs, Fossil Butte visitors who reported being the most interested in fossils had the greatest knowledge of the Fossil Lake story but had the lowest fossil protection beliefs.   Therefore, there was some evidence that fossil enthusiasts were the least likely to respect the resource.",
  "description_provenance": [
    "Author Email: khockett@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: jroggenb@vt.edu",
    "Advisor Email: jmarion@vt.edu",
    "Advisor Email: hullrb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:20Z (GMT). No. of bitstreams: 1 KSHockett.pdf: 751148 bytes, checksum: c2e87e64f7aa5bf1404d1cbc7573cd99 (MD5)   Previous issue date: 2008-01-28"
  ],
  "handle": "26187",
  "identifier_other": "etd-02132008-164411",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02132008-164411/",
  "identifier_uri": "http://hdl.handle.net/10919/26187",
  "publisher": "Virginia Tech",
  "relation_haspart": "KSHockett.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "visitor survey",
    "visitor observations",
    "national parks",
    "depreciative behaviors",
    "interpretation",
    "persuasive messages",
    "resource protection beliefs"
  ],
  "title": "Influence of Interpretation on Visitors' Knowledge Gain and Respect for Fossil Resources in a National Monument",
  "type": "Dissertation"
}