{
  "contributor_author": "Carroll, Katherine Emma",
  "contributor_committeechair": "Kincade, Doris H.",
  "contributor_committeemember": [
    "Grange, Robert W.",
    "Beamish, Julia O.",
    "Vass, Dianna J.",
    "Giddings, Valerie L."
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2014-03-14T20:07:20Z",
  "date_adate": "2002-04-05",
  "date_available": "2014-03-14T20:07:20Z",
  "date_issued": "2001-12-03",
  "date_rdate": "2004-10-11",
  "date_sdate": "2002-02-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Clothing manufacturers and distributors in the current business climate need to become more flexible and willing to adapt to consumersâ   changing needs and preferences in order to satisfy the market (Kincade, 1995).  Clothing consumers who have special needs, such as working women with physical disabilities, comprise a group who would benefit from research into specialized products focused on a small target market (Reich & Otten, 1991).  However, research shows that consumers with physical disabilities do not want to be treated as a specialized group, but the same as any other consumer group (Freeman, Kaiser & Wingate, 1986).  The concept of Universal Design, typically applied to spatial and product design, provides a framework within which an item of clothing could be produced to satisfy many consumers, regardless of their physical ability.  If a universally-designed clothing product can be successfully produced and marketed to many types of consumers, potential benefits could exist for manufacturers, distributors and consumers. \tThe dissertation topic originated from the researcherâ  s questioning the lack of easily accessible ready-to-wear clothing for consumers with physical disabilities, and was based on preliminary conversations with a few working women who encountered difficulty finding business clothing that was both functional and visually appealing.  Considerable needs assessment research had already been completed in the clothing/disability area using data collected from small samples of subjects with disabilities similar in nature, but none had extended the research to include the opinions of clothing manufacturers and distributors of end-use products.  The researcher envisioned a study that would encompass all parties involved in decision-making processes for a clothing product.  \tThe qualitative research process employed multiple data collection and analysis strategies in two Phases.  In Phase A, detailed information was obtained about the physical limitations, clothing needs and preferences, and clothing acquisition preferences from a group of nine working women with various upper body limitations.  A prototype for an upper body garment suitable for working situations was developed and wear-tested with the original group, and with a group of working women (n=6) without any known physical limitations.  The second part of the study, Phase B, consisted of semi-structured interviews with clothing industry personnel (n=6) relating to issues involved in manufacturing and distributing the prototype within the existing ready-to-wear system. \tA framework for manufacturing clothing for a specific target market was explored and revised in the study.  The framework demonstrated the need for in-depth user information to generate ideas for the study, and included an industry feasibility component in order to assess not only consumer but also industry issues.  Both the principles of Universal Design and a framework for systemic change in the current business methodology acted as guideposts at various steps of the process.  Results indicated that (a) a clinical definition of disability is not needed to collect user information for clothing product development, rather a categorization of disabilityâ  s effect on the body can be used; (b) working women with a variety of disabilities can have similar clothing needs and preferences; (c) Universal Design can be a successful strategy for clothing product development; (d) constricting styles and fastenings present the greatest clothing problems regardless of subjectsâ   disabilities; (e) a universally-designed clothing product can be visually appealing, functional, and easily manufactured within the existing clothing system; (f) marketing the product will prove to be the most challenging aspect of putting this product into the ready-to-wear system; and (g) although other distribution channels exist, consumers with physical disabilities prefer to use existing â  brick-and-mortarâ   retail stores to shop for their clothing.  The researcher concluded that although the product development process used in this study was successful, more work could be done with clothing manufacturers and distributors to encourage them to consider this target market, and to use Universal Design as a strategy that can be applicable to all consumers, regardless of their physical abilities.",
  "description_provenance": [
    "Author Email: kacarrol@vt.edu",
    "Advisor Email: rgrange@vt.edu",
    "Advisor Email: jbeamish@vt.edu",
    "Advisor Email: djvass@uncg.edu",
    "Advisor Email: vgidding@vt.edu",
    "Advisor Email: kincade@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:20Z (GMT). No. of bitstreams: 1 etd.pdf: 1189878 bytes, checksum: dc50a988494c7834c0c7b39629c120bf (MD5)   Previous issue date: 2001-12-03"
  ],
  "handle": "26182",
  "identifier_other": "etd-02132002-140807",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02132002-140807/",
  "identifier_uri": "http://hdl.handle.net/10919/26182",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "working women",
    "clothing manufacturing",
    "co-design",
    "universal design",
    "Product  development",
    "clothing",
    "physical disabilities"
  ],
  "title": "Innovations and Improvisations: A  study in specialized product development focused on business clothing for women with physical disabilities",
  "type": "Dissertation"
}