{
  "contributor_author": "Oner, Asli Ceylan",
  "contributor_committeechair": "Knox, Paul L.",
  "contributor_committeemember": [
    "Dawkins, Casey J.",
    "Mayer, Heike",
    "Taylor, Peter J.",
    "Lang, Robert E.",
    "Weisband, Edward"
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:07:22Z",
  "date_adate": "2008-04-22",
  "date_available": "2014-03-14T20:07:22Z",
  "date_issued": "2008-01-30",
  "date_rdate": "2008-04-22",
  "date_sdate": "2008-02-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study is generally concerned with the assumption that the contemporary global flows of people, capital, and commodities, which accelerated dramatically in the age of globalization, have significant impacts on the land use patterns of global cities. With this assumption, the study further questions in the context of polycentric US metropolis, whether or not the distribution of transnational advanced producer service firms define a new form of centrality, in which the traditional central business districts and suburban centers differ from each other in terms of spatial clustering patterns and sectoral distributions of transnational advanced producer service firms. Spatial clustering patterns of advanced producer service firms are evaluated according to high-rise and high-density criteria. In ten selected cities, clusters of advanced producer service firms and high-rise office buildings are identified through the Nearest Neighbor Hierarchical Clustering Method in CrimeStat. To define the polycentric US metropolis, the research employs Lang et alâ  s (2006) classification of metropolitan office space. The results show significant differences between former manufacturing belt cities and Sunbelt cities.",
  "description_provenance": [
    "Author Email: aconer@vt.edu",
    "Advisor Email: dawkins@vt.edu",
    "Advisor Email: heikem@vt.edu",
    "Advisor Email: P.J.Taylor@lboro.ac.uk",
    "Advisor Email: lang@vt.edu",
    "Advisor Email: weisband@vt.edu",
    "Advisor Email: knox@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:22Z (GMT). No. of bitstreams: 4 ASLICEYLANONERTHESISABSTRACT,ACK.pdf: 36293 bytes, checksum: df22d5a24ca969e0e409667c0fb51f7e (MD5) ASLICEYLANONERTHESISCHAPTERS.pdf: 1684410 bytes, checksum: 192933e287e5f240f4bcb3741293703f (MD5) ASLICEYLANONERTHESISAPPENDIX.pdf: 14473149 bytes, checksum: 4af0bc72e9a6a7b4a1528a0ed6d0a9ed (MD5) ASLICEYLANONERTHESISTITLE.pdf: 5234 bytes, checksum: 31ae073d22ede63a6d5a2b1131468af7 (MD5)   Previous issue date: 2008-01-30"
  ],
  "handle": "26199",
  "identifier_other": "etd-02142008-050307",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02142008-050307/",
  "identifier_uri": "http://hdl.handle.net/10919/26199",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ASLICEYLANONERTHESISABSTRACT,ACK.pdf",
    "ASLICEYLANONERTHESISCHAPTERS.pdf",
    "ASLICEYLANONERTHESISAPPENDIX.pdf",
    "ASLICEYLANONERTHESISTITLE.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "advanced producer service firms",
    "polycentric metropolis",
    "high-rise office buildings",
    "global cities",
    "globalization"
  ],
  "title": "Locational Distribution of Global Advanced Producer Service Firms in the Polycentric Us Metropolis",
  "type": "Dissertation"
}