{
  "contributor_author": "Makela, Mark F",
  "contributor_committeechair": "Vogelaar, Robert Bruce",
  "contributor_committeemember": [
    "Ficenec, John R.",
    "Heflin, James R.",
    "Pitt, Mark L.",
    "Takeuchi, Tatsu",
    "Hsiung-Tze, Chia"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:07:22Z",
  "date_adate": "2005-02-16",
  "date_available": "2014-03-14T20:07:22Z",
  "date_issued": "2005-01-24",
  "date_rdate": "2010-10-12",
  "date_sdate": "2005-02-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Experiments with polarized 창  ultracold neutrons창   (UCN) offer a new way to measure the decay correlations of neutron beta decay; these correlations can be used to test the completeness of the Standard Model and predict physics beyond it.  Ultracold neutrons are very low energy neutrons that can be trapped inside of material and magnetic bottles.  The decay correlations in combination with the neutron and muon lifetimes experimentally find the first element (Vud) of the Cabibbo-Kobayashi-Maskawa (CKM) quark mixing matrix.  The CKM matrix is a unitary transform between the mass and weak eigenstates of the d, s and b quarks; if the matrix is not unitary this would imply that the Standard Model is not complete.  Currently the first row of the CKM matrix is over 2 sigma from unitarity and Vud is the largest component of the row. </p><p> The UCNA experiment looks at the correlation between the polarization of the neutron and the momentum of the electron resulting from the beta decay of the neutron (the A-correlation).  The keys to making a high precision measurement of A-correlation are a near 100% polarization of the neutrons that decay, low창  backscatter electron detectors, and small, well characterized backgrounds.  UCN can be 100% polarized by passing them through a seven Telsa magnetic field.  The key to the UCNA experiment is keeping them polarized until they decay or are lost. </p><p> This dissertation covers the development of guides that are minimally depolarizing and efficient transporters of UCN and their use in the UCNA experiment.  The entire guide development process is covered from conception to manufacturing and testing.  This process includes development of a pulsed laser deposition, diamond-like carbon coating system and materials studies of the resulting coatings.  After the initial studies of the guide coating, meter창  long sections of guide are tested with UCN to determine their depolarization and transport properties. </p><p> The guide technology developed in this dissertation has been used in the entire UCNA experiment.  Also, this technology is currently the state of the art for polarized and non-polarized UCN guide systems and it is being implemented in several new UCN experiments.</p>",
  "description_provenance": [
    "Author Email: mmakela@vt.edu",
    "Advisor Email: jficenec@vt.edu",
    "Advisor Email: vogelaar@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: pit@vt.edu",
    "Advisor Email: takeuchi@vt.edu",
    "Advisor Email: kahong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:22Z (GMT). No. of bitstreams: 1 MakelaDissertation.pdf: 3505298 bytes, checksum: 5720761f18052884fc14e013ddf28636 (MD5)   Previous issue date: 2005-01-24"
  ],
  "handle": "26194",
  "identifier_other": "etd-02142005-155324",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02142005-155324/",
  "identifier_uri": "http://hdl.handle.net/10919/26194",
  "publisher": "Virginia Tech",
  "relation_haspart": "MakelaDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Pulsed Laser Deposition",
    "Polarized Neutron Guides",
    "Neutron Beta Decay",
    "Polarized Ultracold Neutrons",
    "Diamond-Like Carbon",
    "Standard Model Tests"
  ],
  "title": "Polarized Ultracold Neutrons: their transport in diamond guides and potential to search for physics beyond the standard model",
  "type": "Dissertation"
}