{
  "contributor_author": "Cross, Benjamin Thomas",
  "contributor_committeecochair": [
    "Cousins, Thomas E.",
    "Roberts-Wollmann, Carin L."
  ],
  "contributor_committeemember": [
    "Easterling, William Samuel",
    "Sotelino, Elisa D."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:07:21Z",
  "date_adate": "2012-03-02",
  "date_available": "2014-03-14T20:07:21Z",
  "date_issued": "2012-02-01",
  "date_rdate": "2012-03-02",
  "date_sdate": "2012-02-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The use of high compressive strengths in prestressed bridge girders can lower costs by allowing for longer spans, increased girder spacing, and smaller cross-sections. If high strength lightweight concrete (HSLWC) is used, these advantages are further enhanced due to the corresponding reduction in self-weight. Additional benefits can then be realized in the form of more traffic lanes, increased load capacity, smaller substructures, reduced crane capacity requirements, and lower shipping costs. Despite the possible economic savings, HSLWC has been used infrequently in prestressed bridge girder applications across the nation. While recent research has been performed to extend the applicability of current bridge design specifications to normal weight concretes with strengths as high as 18 ksi, little has been done by comparison with regards to HSLWC. The purpose of the research in this report was to assess whether current bridge design specifications for transfer length, development length, prestress loss, camber, and flexural capacity are satisfactory for use with fully-bonded, pretensioned flexural members consisting of HSLWC and to make recommendations for improvements where necessary. Twelve high strength pretensioned beams of variable unit weight (eight lightweight beams and four normal weight beams) and strand size (eight beams with 0.5-in. strand and four beams with 0.6-in. strand) were cast at the Thomas M. Murray Structural Engineering Laboratory at Virginia Tech. These beams were allowed to sit for a period of several months after fabrication while measurements were taken regarding transfer length, prestress loss, and camber. After this period, the beams were load tested to collect development length data, flexural data, and further data related to prestress loss. In addition to the laboratory cast beams, prestress loss and camber data from six full-size bridge beams (five lightweight beams and one normal weight beam) cast as part of a separate project at Virginia Tech was examined. Analysis of the results for all beams shows that with a few caveats, the current AASHTO LRFD Specifications and other design methods examined regarding the topics under consideration are satisfactory for use in the design of HSLWC pretensioned bridge girders with properties similar to those of the beams studied.",
  "description_provenance": [
    "Author Email: crossbt@vt.edu",
    "Advisor Email: tcousins@vt.edu",
    "Advisor Email: wollmann@vt.edu",
    "Advisor Email: seaster@vt.edu",
    "Advisor Email: sotelino@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:21Z (GMT). No. of bitstreams: 2 Cross_BT_D_2012.pdf: 18819368 bytes, checksum: 922179b53062119ebfdd8ab921f1171f (MD5) Cross_BT_D_2012_Copyright.pdf: 4426435 bytes, checksum: 31c5208b96beeaf1f5a0f3702f5d2a51 (MD5)   Previous issue date: 2012-02-01"
  ],
  "handle": "26190",
  "identifier_other": "etd-02132012-005741",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02132012-005741/",
  "identifier_uri": "http://hdl.handle.net/10919/26190",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Cross_BT_D_2012.pdf",
    "Cross_BT_D_2012_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "prestress loss",
    "development length",
    "transfer length",
    "high strength concrete",
    "lightweight concrete",
    "camber growth",
    "pretensioned girders"
  ],
  "title": "Structural Performance of High Strength Lightweight Concrete Pretensioned Bridge Girders",
  "type": "Dissertation"
}