{
  "contributor_author": "Devers, Patrick Kevin",
  "contributor_committeechair": "Stauffer, Dean F.",
  "contributor_committeemember": [
    "Berkson, James M.",
    "Vaughan, Michael R.",
    "Jones, Robert H.",
    "Steffen, David E."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:07:31Z",
  "date_adate": "2005-02-18",
  "date_available": "2014-03-14T20:07:31Z",
  "date_issued": "2005-01-20",
  "date_rdate": "2005-02-18",
  "date_sdate": "2005-02-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT <P>  I investigated ruffed grouse (Bonasa umbellus) population ecology in the  southern and central Appalachians as part of the Appalachian Cooperative  Grouse Research Project (ACGRP).  Several hypotheses have been offered to  explain the low abundance of ruffed grouse in the region including inadequate  quantity of early-successional forests due to changes in land use, additive  harvest mortality, low productivity and recruitment, and nutritional stress.   Through the cooperative nature of the ACGRP, researchers tracked >3,000  ruffed grouse between October 1996 and September 2002 and gathered data on  reproduction, recruitment, survival, and mortality factors.  As part of the ACGRP  my objectives were <P>  (1) estimate reproductive rates, <P>  (2) estimate survival and cause-specific mortality rates, <P> (3) determine if ruffed grouse harvest in the Appalachian region is compensatory, and <P> (4) estimate ruffed grouse finite population growth. <P>   Ruffed grouse population dynamics in the Appalachian region differed greatly  from the core of ruffed grouse range.  In general, ruffed grouse in the  Appalachian region had lower productivity and recruitment, but higher survival  than reported for populations in the Great Lakes and southern Canada.   However, within the southern and central Appalachian region, ruffed grouse  population dynamics differed between oak-hickory and mixed-mesophytic forest  associations.  Productivity and recruitment were lower in oak-hickory forests, but  adult survival was higher than in mixed-mesophytic forests.  Furthermore, ruffed  grouse productivity and recruitment were more strongly related to hard mast (i.e.,  acorn) production in oak-hickory forests than in mixed-mesophytic forests.  The  leading cause of ruffed grouse mortality was avian predation (44% of known  mortalities).  Harvest mortality accounted for only 12% of all known mortalities  and appeared to be compensatory.  Population models indicate ruffed grouse  populations in the Appalachian region are declining, but estimates vary greatly  stressing the need for improved understanding of annual productivity and  recruitment. We posit ruffed grouse in the Appalachian region exhibit a clinal  population structure and changes in life-history strategies due to gradual  changes in the quality of food resources, changes in snow fall and accumulation  patterns, and predator communities.  Recommendations are presented for  habitat and harvest management and future research and management needs.",
  "description_provenance": [
    "Author Email: pdevers@vt.edu",
    "Advisor Email: dstauffe@vt.edu",
    "Advisor Email: jberkson@vt.edu",
    "Advisor Email: mvaughan@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: Dave.Steffen@dgif.virginia.gov",
    "Made available in DSpace on 2014-03-14T20:07:31Z (GMT). No. of bitstreams: 1 final_pkd.pdf: 2552070 bytes, checksum: 3d845d87d5bed43f56ed1670b874e9af (MD5)   Previous issue date: 2005-01-20"
  ],
  "handle": "26208",
  "identifier_other": "etd-02152005-135903",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02152005-135903/",
  "identifier_uri": "http://hdl.handle.net/10919/26208",
  "publisher": "Virginia Tech",
  "relation_haspart": "final_pkd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "population ecology",
    "Appalachian Mountains",
    "hunting",
    "survival",
    "harvest",
    "management",
    "ruffed grouse",
    "reproduction",
    "Bonasa umbellus"
  ],
  "title": "Population ecology of and the effects of hunting on ruffed grouse (Bonasa umbellus) in the southern and central Appalachians",
  "type": "Dissertation"
}