{
  "contributor_author": "Dorsey, Bonnie C.",
  "contributor_committeechair": "Getz, Hilda M.",
  "contributor_committeemember": [
    "Light, Danette",
    "Flanigan, Marjie",
    "Bodenhorn, Nancy E.",
    "Curcio, Claire Cole Vaught"
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:07:31Z",
  "date_adate": "2004-02-23",
  "date_available": "2014-03-14T20:07:31Z",
  "date_issued": "2004-02-02",
  "date_rdate": "2005-02-23",
  "date_sdate": "2004-02-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research reflects a qualitative exploration of the timeliness of pursuits of higher education by females who were classified as non-traditional students at Concord College in southern West Virginia. The researcher studied females, educated in West Virginia, who had completed at least 30 semester hours, and who were at least 25 years of age at the time of admission. The study focused on identifying several factors common to many non-traditional students, including the factors that influenced them to not pursue their education as traditional students, the factors that changed so they recognized higher education as a viable option for themselves, and the factors that influenced them, positively or negatively, in their perseverance to continue in an undergraduate program.",
  "description_provenance": [
    "Author Email: bshorter@vt.edu, Shorterb@concord.edu",
    "Advisor Email: lightp@concord.edu",
    "Advisor Email: mflanigan@concord.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: vaughtc@msn.com",
    "Made available in DSpace on 2014-03-14T20:07:31Z (GMT). No. of bitstreams: 1 bonnieetd.pdf: 501848 bytes, checksum: 5115972d7b8428da6e3f9045509c49b2 (MD5)   Previous issue date: 2004-02-02"
  ],
  "handle": "26207",
  "identifier_other": "etd-02152004-123535",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02152004-123535/",
  "identifier_uri": "http://hdl.handle.net/10919/26207",
  "publisher": "Virginia Tech",
  "relation_haspart": "bonnieetd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Higher Education",
    "Qualitative Exploration",
    "Non Traditional"
  ],
  "title": "Qualitative Exploration of Timeliness of Pursuits of Higher Education By non-Traditional Female Baccalaureate Students In West Virginia",
  "type": "Dissertation"
}