{
  "contributor_author": "Seaton, William",
  "contributor_committeechair": "Burbey, Thomas J.",
  "contributor_committeemember": [
    "Sinha, A. Krishna",
    "Henika, William S.",
    "Coruh, Cahit",
    "Johnson, Jeffrey A.",
    "Hole, John A."
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:07:29Z",
  "date_adate": "2002-03-16",
  "date_available": "2014-03-14T20:07:29Z",
  "date_issued": "2002-01-25",
  "date_rdate": "2003-03-16",
  "date_sdate": "2002-02-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Existing models of the hydrogeology in the Blue Ridge Province in the eastern United States generally assume a simplified two-layered system consisting of shallow unconsolidated and relatively homogeneous and porous regolith with a water-table aquifer that slowly supplies water downward to the underlying variably fractured crystalline bedrock. In these models, interconnected fractures in the crystalline bedrock act as conduits for predominantly downward vertical and limited horizontal flow. Fracture density is depthÃ limited and correlated with proximity to topographic lineaments. Current models consider the porous regolith as the primary water storage reservoir for the entire aquifer system.  In this research, detailed hydrogeologic studies in the Blue Ridge Province in Floyd County, Virginia reveal a substantially different framework for groundwater flow. Recent acquisition of two-dimensional surface resistivity profiles collected using a variety of array techniques combined with borehole geophysical logs revealed new insights into this geologically complex province. Dipole-dipole arrays were particularly important in gathering high resolution resistivity profiles that document horizontal and vertical resistivity variation reflecting changes in subsurface geology and anomalous low resistivity areas in crystalline bedrock associated with fault zones.  The shallow regolith contains unsaturated areas and also localized sand and clay prone facies with water table and confined aquifer conditions residing locally. Hydraulic heads between the shallow aquifer and the deeper fractured bedrock aquifer can vary by 20 m vertically.  Within the crystalline bedrock are anomalous lower resistivity intervals associated with ancient fault shear zones. Brecciated rock adjacent to the shear zones, and the shear zones themselves, can be hydraulically conductive and serve as pathways for groundwater movement. Aquifer testing of the regolith-bedrock fracture system occurred over a 6-day period and produced rapid and relatively uniform drawdowns in surrounding wells completed in the fractured bedrock aquifers. The shallow aquifers experienced minimal drawdowns from the aquifer test indicating low vertical hydraulic conductivity and limited communication between the shallow and deeper bedrock aquifers. Water chemistry and chlorofluorocarbon (CFC) age dating analyses indicated significant differences between water samples from the shallow and deep aquifers. A new conceptual model for Blue Ridge aquifers is proposed based on these research findings.",
  "description_provenance": [
    "Author Email: wseaton@vt.edu",
    "Advisor Email: tjburbey@vt.edu",
    "Advisor Email: searches@vt.edu",
    "Advisor Email: bhenika@vt.edu",
    "Advisor Email: coruh@vt.edu",
    "Advisor Email: admin@esnt.com",
    "Advisor Email: hole@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:29Z (GMT). No. of bitstreams: 2 etd-title-abstract.PDF: 6129 bytes, checksum: b9b138cfc5818b3c712c4d7feb0f6378 (MD5) Seaton-etd.pdf: 4240690 bytes, checksum: 9c0cba2b39a36a59c4f2efa1d18455b0 (MD5)   Previous issue date: 2002-01-25"
  ],
  "handle": "26205",
  "identifier_other": "etd-02152002-155415",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02152002-155415/",
  "identifier_uri": "http://hdl.handle.net/10919/26205",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etd-title-abstract.PDF",
    "Seaton-etd.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Blue Ridge Province",
    "borehole geophysics",
    "electrical resistivity",
    "hydrogeology",
    "aquifer"
  ],
  "title": "Aquifer Characterization in the Blue Ridge Physiographic Province",
  "type": "Dissertation"
}