{
  "contributor_author": "Cates, Sarah Elizabeth",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Anderson, Francine",
    "Sutphin, H. Dean",
    "Lepczyk, Billie F."
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:07:26Z",
  "date_adate": "2009-03-30",
  "date_available": "2014-03-14T20:07:26Z",
  "date_issued": "2009-01-27",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-02-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This descriptive research used the Health Belief Model (HBM) to assess HIV/AIDS knowledge, perceived severity, perceived susceptibility, and behavioral practices within the population throughout the State of Sonsonate, El Salvador. Geographic Information Systems (GIS) was also utilized to display the results of this population study. The study population was composed of 15-39 year olds consisting of a total sample size of  1,500 (250 participants from each of the six cities). The basis of this study was to evaluate where this population fit within the Health Belief Model (HBM) and also to practically represent the results pictorially. Also, this information was collected so that the government of El Salvador could see and understand where their educational deficits existed so that future programs could be established to alleviate these discrepancies. <p> An instrument consisting of 65 items including demographics, knowledge, perceived severity, perceived susceptibility, and behavioral practices was used for the general population. The analysis of the data was two-fold using Geographic Information Systems (GIS) mapping and statistical analysis. GIS mapping was used to graphically pinpoint areas of knowledge deficit and misinformation about HIV/AIDS.<p>     Results were based on a general population of 1,454. Various indices were created to show the level of knowledge or frequency of safe behavioral practices. The Perceived Severity and Perceived Susceptibility sections were not aggregated into an index but rather treated as individual variables.  An item analysis of the questionnaire found that on average the general population responded correctly to 78% of the knowledge questions. However, a total of 11 questions in the knowledge section had less 75% (n=385) of the general population answering correctly. Another 3 questions in the behavior section were also found to have less than 75% (n=385) indicating safe behavioral practices. Linear regression analyses were performed to explore correlations between the areas of demographics, knowledge level, perceived severity, and perceived susceptibility to safe behavior. GIS maps were created to pictorially show where this populationâ  s deficiencies were in regard to the HBM. This research helped to pinpoint where this population fits within the construct of the Health Belief Model so that future educational efforts can be targeted in geographic areas with the greatest need. This will help to move this sample toward behavioral change.",
  "description_provenance": [
    "Author Email: scates@vcom.vt.edu",
    "Advisor Email: fanderson@vcom.vt.edu",
    "Advisor Email: dsutphin@vcom.vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: lepczyk@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:26Z (GMT). No. of bitstreams: 3 01FrontMatter.pdf: 97861 bytes, checksum: 7e73faaad522cce62b49ffeed88c603f (MD5) 02Chapters1-appendixF.pdf: 61347304 bytes, checksum: eb6302325b87d12c49219d8ace5b18ae (MD5) 03AppendixG.pdf: 279490163 bytes, checksum: 8fe3fad6debdab5a4faf2f407758c444 (MD5)   Previous issue date: 2009-01-27"
  ],
  "handle": "26201",
  "identifier_other": "etd-02142009-044946",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02142009-044946/",
  "identifier_uri": "http://hdl.handle.net/10919/26201",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01FrontMatter.pdf",
    "02Chapters1-appendixF.pdf",
    "03AppendixG.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Human Immunodeficiency Virus",
    "GIS",
    "Geographic Information Systems",
    "Acquired Immunodeficiency Syndrome",
    "International Health"
  ],
  "title": "An Analysis of National HIV/AIDS Education Efforts Among 15-39 Year Olds and Health Care Workers Applying the Health Belief Model (HBM) in Six Cities in Sonsonate, El Salvador",
  "type": "Dissertation"
}