{
  "contributor_author": "Liu, Juan",
  "contributor_committeechair": "Hochella, Michael F. Jr.",
  "contributor_committeemember": [
    "Rimstidt, james Donald",
    "Aruguete, Deborah",
    "Schreiber, Madeline E."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:07:26Z",
  "date_adate": "2009-03-30",
  "date_available": "2014-03-14T20:07:26Z",
  "date_issued": "2009-01-30",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-02-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The acidic, non-oxidative dissolution of galena nanocrystals has been studied using both microscopic and wet-chemical methods. The effects of particle size, shape, aggregation state, and grain proximity on dissolution rates were investigated. Nearly monodisperse galena nanocrystals with an average diameter of 14.4 nm and a truncated cubic shape were synthesized. In the dissolution experiments of dispersed nanocrystals, galena nanocrystals attached on the surface of a TEM grid were exposed to deoxygenated HCl solutions (pH 3) at 25 °C. Capping groups on nanocrystals were removed via a washing process, and chemistry of nanocrystals was examined using X-ray photoelectron spectroscopy (XPS). The evolution of the size and shape of the pre- and post-dissolution nanocrystals were studied using transmission electron microscopy (TEM), and the dissolution rate was calculated directly according to the size shrinking of galena nanocrystals. To assess the size effect, galena microcrystals (~ 3 μm) were synthesized and dissolved under similar conditions to the dispersed nanocrystals. The results showed that the nanocrystals dissolved at a surface area normalized rate of one order of magnitude faster than the microcrystals. In addition, dissolution rate is orientationdependent on a single nanocrystal. High-resolution TEM (HRTEM) images indicated the {111} and {110} faces dissolve faster than {100} faces on galena nanocrystals, rationalized by the average coordination number of ions on each of these faces. To assess the aggregation effect, dissolution experiments of aggregated galena nanocrystals were conducted using a wet-chemical method, and the results were compared with the rates of microcrystals and dispersed nanocrystals. These experiments showed that the rate of aggregated nanocrystals is in the same order of magnitude as the rate of microcrystals, but one order of magnitude smaller than that of dispersed nanocrystals. Finally, the effect of the close proximity between nanocrystals on dissolution was observed by HRTEM. Dissolution was greatly inhibited on nanocrystal surfaces that were closely adjacent (1-2nm, or less) to other nanocrystals, which is probably relevant to the slow dissolution of aggregated nanocrystals. The dissolution phenomena of galena nanocrystals observed in this study is likely important for understanding the environmental fate and behavior of nanoparticles in aquatic systems.",
  "description_provenance": [
    "Author Email: juanliu@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: hochella@vt.edu",
    "Advisor Email: aruguete@vt.edu",
    "Advisor Email: mschreib@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:26Z (GMT). No. of bitstreams: 1 Liu_dissertation.pdf: 2872845 bytes, checksum: 35619af3edaf419ed90419ba2eb54758 (MD5)   Previous issue date: 2009-01-30"
  ],
  "handle": "26202",
  "identifier_other": "etd-02142009-135921",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02142009-135921/",
  "identifier_uri": "http://hdl.handle.net/10919/26202",
  "publisher": "Virginia Tech",
  "relation_haspart": "Liu_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "galena (PbS)",
    "nanoparticle",
    "size",
    "morphology",
    "aggregation",
    "high-resolution transmission electron microscopy (",
    "dissolution"
  ],
  "title": "Influence of grain size, morphology and aggregation on galena dissolution",
  "type": "Dissertation"
}