{
  "contributor_author": "Pienkowski, Nathan",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Potter, Kenneth R.",
    "Singh, Kusum",
    "Cennamo, Kathy",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:28Z",
  "date_adate": "2002-03-05",
  "date_available": "2014-03-14T20:07:28Z",
  "date_issued": "2002-02-01",
  "date_rdate": "2003-03-05",
  "date_sdate": "2002-02-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Untitled Document</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body bgcolor=\"#FFFFFF\" text=\"#000000\"> <div align=\"center\">The Effects of Cueing Learners to a Transfer Problem Prior    to Instruction </div> <p align=\"center\">by</p> <p align=\"center\">Nathan Pienkowski</p> <p align=\"center\">Chairman: Dr. David M. Moore<br>   Department of Teaching and Learning</p> <p align=\"center\">(ABSTRACT)</p> <p>Prior research indicates that cueing or priming an individual prior to exposing    them to a basic stimulus, either visual or verbal, will direct their perception    and attention toward specific aspects of that stimulus. Furthermore, it suggests    that those aspects of the stimulus that are attended or perceived may be related    by the extent to which they afford the resolution of a problem, need, or state    invoked by the cued phenomenon.<br>   <br>   The purpose of this study was to determine whether similar results would be    found using content of a greater scale. In other words, the purpose was to determine    whether the same cueing and priming results found using words and phrases would    apply using entire instructional modules. Specifically, this study attempted    to determine whether cuing individuals to an expected outcome performance prior    to instruction would cause them to focus on those parts of the instruction needed    to succeed on the outcome performance. It was hypothesized that prior cuing    would result in superior performance on a transfer problem. Similarly, it was    also hypothesized that, since the learner's attention would be directed toward    specific parts of the instruction to the neglect of others, overall memory retention    would be diminished for learners that were cued.<br>   <br>   To test these hypotheses, an experimental design was used with two overall groups:    one receiving prior exposure to a transfer problem and one not. In addition,    in order to avoid the possibility that any results could be generalized only    to the subject matter being taught, two different subject domains were used:    statistics and biology. Therefore, 115 undergraduate students were randomly    assigned to one of four groups: (a) a statistics group receiving prior exposure    to a transfer problem; (c) a statistics group without prior exposure to a transfer    problem; (b) a biology group receiving prior exposure to a transfer problem;    (d) a biology group without prior exposure to a transfer problem. Following    instruction, each group received the transfer problem and recall test appropriate    for the subject area covered during their instruction (statistics or biology).    <br>   <br>   The resulting data was analyzed using two ANOVAs, one for retention and one    for transfer. Neither ANOVA yielded significant results. Hence, the results    reported in this study do not support either hypothesis.</p> <p></p> </body> </html>",
  "description_provenance": [
    "Author Email: pienkows@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: cennamo@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:28Z (GMT). No. of bitstreams: 1 Nathansfinal.pdf: 1152818 bytes, checksum: ec28b862d26f3281efb28e0a5438522c (MD5)   Previous issue date: 2002-02-01"
  ],
  "handle": "26204",
  "identifier_other": "etd-02152002-152936",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02152002-152936/",
  "identifier_uri": "http://hdl.handle.net/10919/26204",
  "publisher": "Virginia Tech",
  "relation_haspart": "Nathansfinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "instructional sequence",
    "cueing",
    "transfer",
    "priming"
  ],
  "title": "The Effects of Cueing Learners to a Transfer Problem Prior to Instruction",
  "type": "Dissertation"
}