{
  "contributor_author": "Li, Bingbing",
  "contributor_committeechair": "Esker, Alan R.",
  "contributor_committeemember": [
    "Riffle, Judy S.",
    "Yee, Gordon T.",
    "Crawford, Daniel T.",
    "Marand, Hervé L."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:07:32Z",
  "date_adate": "2007-03-26",
  "date_available": "2014-03-14T20:07:32Z",
  "date_issued": "2007-01-31",
  "date_rdate": "2010-03-26",
  "date_sdate": "2007-02-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Poly (caprolactone) (PCL) has been widely studied as a model system for investigating polymer crystallization.  In this thesis, PCL crystallization along with other phase transitions in PCL-based polymer blends are studied as Langmuir films at the air/water (A/W) interface.     In order to understand the phase behavior of PCL-based blends, surface pressure induced crystallization of PCL in single-component Langmuir monolayers was first studied by Brewster angle microscopy (BAM).  PCL crystals observed during film compression exhibit butterfly-shapes.  During expansion of the crystallized film, polymer chains detach from the crystals and diffuse back into the monolayer as the crystals â  meltâ  .  Electron diffraction on Langmuir-Schaefer films suggests that the lamellar crystals are oriented with the chain axes perpendicular to the substrate surface, while atomic force microscopy (AFM) reveals a crystal thickness of ~ 7.6 nm.  In addition, the competition between lower segmental mobility and a greater degree of undercooling with increasing molar mass produces a maximum average growth rate at intermediate molar mass.   PCL was blended with poly(t-butyl acrylate) (PtBA) to study the influence of PtBA on the morphologies of PCL crystals grown in monolayers. For PCL-rich blends, BAM studies reveal dendritic morphologies of PCL crystals.  The thicknesses of the PCL dendrites are ~ 7-8 nm.  BAM studies during isobaric area relaxation experiments at different surface pressure reveal morphological transitions from highly branched dendrites, to six-arm dendrites, four-arm dendrites, seaweedlike crystals, and distorted rectangular crystals.  In contrast, PCL crystallization is suppressed in PtBA-rich blend films.  For immiscible blends of PCL and polystyrene (PS) with intermediate molar masses as Langmuir films, the surface concentration of PCL is the only factor influencing surface pressure below the collapse transition.  For PS-rich blends, both BAM and AFM studies reveal that PS nanoparticle aggregates formed at very low surface pressure form networks during film compression.  For PCL-rich blends, small PS aggregates serve as heterogeneous nucleation centers for the growth of PCL crystals.  During film expansion, BAM images show a gradual change in the surface morphology from highly continuous networklike structures (PS-rich blends) to broken ringlike structures (intermediate composition) to small discontinuous aggregates (PCL-rich blends).",
  "description_provenance": [
    "Author Email: bili2@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: gyee@vt.edu",
    "Advisor Email: crawdad@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: hmarand@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:32Z (GMT). No. of bitstreams: 11 CHAPTER4PurePCL.pdf: 323279 bytes, checksum: 736c85ecc88275523c347d5b8344eac4 (MD5) CHAPTER7PCLandGlassyPS.pdf: 3917942 bytes, checksum: 2c4e87069fc2be6411ae7eee1538ebf8 (MD5) CHAPTER5PCLPtBAI.pdf: 842579 bytes, checksum: 6b4cf8c3e662c3834291af8a80a4db42 (MD5) CHAPTER6PCLPtBAII.pdf: 1212827 bytes, checksum: 9e0b9988b690416afefd7eaa91301dfa (MD5) References.pdf: 161838 bytes, checksum: ca45fee401037aad2fd62be666b8669b (MD5) CHAPTER9ConclusionandFutureWork.pdf: 1368268 bytes, checksum: 8c87030e4196c7e334c1b7a866af258e (MD5) CHAPTER8MWDependence.pdf: 871715 bytes, checksum: 330fbc670577e885408ca2fc8d7edc3d (MD5) CHAPTER2Introduction.pdf: 1506092 bytes, checksum: 8e9f1994fbcedf92d058438c5d44b216 (MD5) AbstractandTableofContents.pdf: 164178 bytes, checksum: 0787ed4b8c5fd71ad2cce6b452479170 (MD5) CHAPTER1Overview.pdf: 93731 bytes, checksum: 1f721b89614778789bb2f9265ec3ea13 (MD5) CHAPTER3ExperimentalMethods.pdf: 160777 bytes, checksum: 19af883f9853a8dd177495a36d51e7c5 (MD5)   Previous issue date: 2007-01-31"
  ],
  "handle": "26210",
  "identifier_other": "etd-02152007-093909",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02152007-093909/",
  "identifier_uri": "http://hdl.handle.net/10919/26210",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAPTER4PurePCL.pdf",
    "CHAPTER7PCLandGlassyPS.pdf",
    "CHAPTER5PCLPtBAI.pdf",
    "CHAPTER6PCLPtBAII.pdf",
    "References.pdf",
    "CHAPTER9ConclusionandFutureWork.pdf",
    "CHAPTER8MWDependence.pdf",
    "CHAPTER2Introduction.pdf",
    "AbstractandTableofContents.pdf",
    "CHAPTER1Overview.pdf",
    "CHAPTER3ExperimentalMethods.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Langmuir monolayers",
    "Polymer blends",
    "Crystallization",
    "Diffusion-limited growth",
    "Dendritic growth",
    "Poly(caprolactone)"
  ],
  "title": "Phase Behavior of Poly(Caprolactone) Based Polymer Blends As Langmuir Films at the Air/Water Interface",
  "type": "Dissertation"
}