{
  "contributor_author": "Horn-Turpin, Frances D.",
  "contributor_committeechair": "Creighton, Theodore B.",
  "contributor_committeemember": [
    "Kirk, David",
    "Salmon, Richard G.",
    "Wasserman, Lewis M."
  ],
  "contributor_department": "Administration and Supervision of Special Education",
  "date_accessioned": "2014-03-14T20:07:32Z",
  "date_adate": "2009-02-24",
  "date_available": "2014-03-14T20:07:32Z",
  "date_issued": "2009-01-30",
  "date_rdate": "2009-02-24",
  "date_sdate": "2009-02-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> The purpose of this study was to examine whether transformational leadership behaviors were significantly related to the variables of teaching efficacy, job satisfaction, and organizational commitment as perceived by special education teachers. One hundred twenty-one special education teachers from region seven of the Commonwealth of Virginia completed surveys for this study. Confirmatory factor analysis revealed that administrative support was the transformational leadership behavior most frequently recognized by participants of this study. Pearson correlation analysis indicated that administrative support was significantly related to the factors of job satisfaction and organizational commitment. However, administrative support was not significantly related to teachers' sense of teaching efficacy. Teaching efficacy did share a significant relationship with teachers' job satisfaction. This finding suggests that the higher teachers report their perceived their sense of teaching efficacy, the higher they report their level of job satisfaction. The highest correlation in this study was between the factors of job satisfaction and organizational commitment. These findings suggest that as special education teachers' perceptions of administrative support increases, so do their levels of job satisfaction and organizational commitment; thereby increasing the likelihood that special education teachers will remain in their current teaching positions.</body> </html>",
  "description_provenance": [
    "Author Email: fhorntur@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: dkirk@rock.k12.nc.us",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: lmw1983@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:32Z (GMT). No. of bitstreams: 1 FDHornTurpinETD09.pdf: 1655616 bytes, checksum: e4ca5e705174f6ff82ae50c1d62459c3 (MD5)   Previous issue date: 2009-01-30"
  ],
  "handle": "26215",
  "identifier_other": "etd-02152009-080918",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02152009-080918/",
  "identifier_uri": "http://hdl.handle.net/10919/26215",
  "publisher": "Virginia Tech",
  "relation_haspart": "FDHornTurpinETD09.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Transformational Leadership",
    "Administrative Support",
    "Teaching Efficacy",
    "Job Satisfaction",
    "Organizational Commitment"
  ],
  "title": "A Study Examining the Effects of Transformational Leadership Behaviors on the Factors of Teaching Efficacy, Job Satisfaction and Organizational Commitment  as Perceived by Special Education Teachers",
  "type": "Dissertation"
}