{
  "contributor_author": "Renard, Paul D.",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Belli, Gabriella M.",
    "Kuehl, Daniel",
    "Morris, Linda E.",
    "Stubblefield, Harold W."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:07:33Z",
  "date_adate": "2006-03-09",
  "date_available": "2014-03-14T20:07:33Z",
  "date_issued": "2006-02-15",
  "date_rdate": "2009-03-09",
  "date_sdate": "2006-02-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "American Civil War officer preparation activities were rooted in the broader practices of antebellum military education as applied at West Point, other military academies, and the state militia system. The arrival of black troops in the Union Army led to a radical, if temporary, transformation in the Armyâ  s process for the selection and preparation of officersâ  but only for the white officers who served with black regiments.  Overtly political or casual processes of the early Civil War were replaced in many cases by formal examinations and the centralized review of results, operating in parallel with more traditional political patronage systems of appointment.  This study uses the experiences of officers from several black infantry regiments, and particularly the 41st U.S. Colored Infantry from the East and the 100th U.S.C.I. from the West, to illustrate how leaders for black units were chosen, prepared, examined, commissioned, and continued their military education. It focuses on the experiences of the officers, along with the contextual environments of antebellum education, slavery, racism, tactics, and bureaucracy in which they served.",
  "description_provenance": [
    "Author Email: prenard@paulrenard.com",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: kuehld@ndu.edu",
    "Advisor Email: linda_morris11495@yahoo.com",
    "Advisor Email: harold.stubblefield@comcast.net",
    "Made available in DSpace on 2014-03-14T20:07:33Z (GMT). No. of bitstreams: 1  RenardDissertation.pdf: 1922035 bytes, checksum: 61528b3b233bd7dc1df1755c684fe62a (MD5)    Previous issue date: 2006-02-15"
  ],
  "handle": "26219",
  "identifier_other": "etd-02162006-202721",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02162006-202721/",
  "identifier_uri": "http://hdl.handle.net/10919/26219",
  "publisher": "Virginia Tech",
  "relation_haspart": "RenardDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "American Civil War",
    "U.S. Colored Troops",
    "officer examination",
    "Bureau for Colored Troops",
    "black soldiers"
  ],
  "title": "The selection and preparation of white officers for the command of black troops in the American Civil War:  A study of the 41st and 100th U.S. Colored Infantry",
  "type": "Dissertation"
}