{
  "contributor_author": "Plathe, Kelly Lee",
  "contributor_committeechair": "Hochella, Michael F. Jr.",
  "contributor_committeemember": [
    "von der Kammer, Frank",
    "Rimstidt, james Donald",
    "Schreiber, Madeline E."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:07:35Z",
  "date_adate": "2010-03-05",
  "date_available": "2014-03-14T20:07:35Z",
  "date_issued": "2010-02-05",
  "date_rdate": "2010-03-05",
  "date_sdate": "2010-02-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Relationships between trace metals and nanoparticles were investigated using analytical transmission electron microscopy (aTEM) and asymmetric flow field flow fractionation (aFlFFF) coupled to both multi-angle laser light scattering (MALLS) and high resolution-inductively coupled plasma mass spectroscopy (HR-ICPMS).  Riverbed sediment samples were taken from the Clark Fork River in Montana, USA where a large-scale dam removal project has released reservoir sediment contaminated with toxic trace metals (namely Pb, Zn, Cu and As) which accumulated from one and a half centuries of mining activities upstream.  An aqueous extraction method was used to attempt to separate the nanoparticles from the bulk sediment.  After analysis of initial results, it was found that low density clays were being selected for in this process and made up a major portion of the particles within the extracts.  However, it was also realized that the metals of interest were associated almost exclusively with nano-sized Fe and Ti oxides.  In order to more fully examine these relationships, a density separation method, using sodium polytungstate (2.8g/cm3), was developed to separate these higher density oxides from the lower density clays.  The heavy fraction was then subjected to an aqueous extraction routine to extract the nanoparticulate fraction.  FFF results indicated a smaller size distribution and more ideal fractionation with this method.  The aFlFFF-HR-ICPMS profiles for Fe and Ti also matched strongly with the data for the trace metals.  The majority of particles analyzed with the TEM were nano-sized Fe and Ti oxides (most commonly goethite, ferrihydrite and brookite), which typically had trace metals associated with them.  In many cases, it was aggregates of these nano oxides that were found hosting trace metals.  Nanoparticles and aggregates are known to behave differently than their bulk mineral phases or constituent particles, respectively.  Nanoparticles are also capable of extended transport in the environment.  For these reasons, it is important that their associations with toxic trace metals be extensively evaluated, as they will affect the bioavailability and toxicity of these metals with implications for any type of contaminant sediment relocation, dam removal or metal contaminated site.",
  "description_provenance": [
    "Author Email: plathekl@vt.edu",
    "Advisor Email: hochella@vt.edu",
    "Advisor Email: frank.kammer@univie.ac.at",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: mschreib@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:35Z (GMT). No. of bitstreams: 1 Plathe_KL_D_2010.pdf: 2971320 bytes, checksum: 1f37568fdc0bfec680f1e24c3d2318cf (MD5)   Previous issue date: 2010-02-05"
  ],
  "handle": "26229",
  "identifier_other": "etd-02172010-055335",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02172010-055335/",
  "identifier_uri": "http://hdl.handle.net/10919/26229",
  "publisher": "Virginia Tech",
  "relation_haspart": "Plathe_KL_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "transmission electron microscopy",
    "field flow fractionation",
    "trace metal contamination",
    "environmental geochemistry",
    "nanogeoscience"
  ],
  "title": "Nanoparticle - Heavy Metal Associations in Riverbed Sediments",
  "type": "Dissertation"
}