{
  "contributor_author": "Gauch, Pamela K",
  "contributor_committeechair": "Mallory, Walter D.",
  "contributor_committeemember": [
    "Alexander, M. David",
    "Glenn, William J.",
    "Powell, Susan T."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:33Z",
  "date_adate": "2011-03-10",
  "date_available": "2014-03-14T20:07:33Z",
  "date_issued": "2011-02-04",
  "date_rdate": "2011-03-10",
  "date_sdate": "2011-02-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "With the advent of the No Child Left Behind legislation and the culture of standards-based education that it brings, it is imperative for educators to focus on the academic growth of students. Indeed, the nationâ  s schools, school districts, and states are being held accountable for student achievement. Administrators in numerous school districts across the United States have implemented a popular reform initiative, Site-Based Management SBM), to improve student achievement. District leaders must examine the efficacy of SBM, where the authority, autonomy, and responsibility for student learning are devolved to the school level, to ensure that SBM is yielding intended results and to ensure fidelity of its implementation.  This study examined principal perceptions and implementation of SBM in the Prince William County School District in Virginia after 19 years of implementation. The investigator administered an SBM survey to a population of all 86 principals in the school district. Of those, 78 completed at least part of the survey, for a return rate of 91%. The study focused on the perceptions of principals under SBM and their implementation of SBM as defined by the functions of the School Advisory Council and the shared decision-making processes used at the school level. Variables of the study were principalsâ   years of experience with SBM and the grade level at which they work.   Principals reported positive perceptions of SBM, in particular, the perception that SBM contributes to improvements in student achievement and to a climate of enhanced stakeholder satisfaction. A third of the principals indicated that SBM requires principals to spend too much time on administrative tasks.  Principals with more than 10 years of experience reported more positive perceptions than principals with zero to three years experience with SBM. Principals reported that School Advisory Councils spend the most time developing, monitoring, and evaluating the school plan. Principalsâ   years of experience with SBM were not related to the functions of their School Advisory Council, but principals with more than ten years of experience with SBM indicated a significantly higher use of consensus as a shared decision-making process.   No significant relationship was found between the school level at which principals work and their perceptions of SBM. While not significant, middle school principals rated the School Advisory Council function of aligning the school budget with the school plan slightly higher than principals at other levels. There was no relationship between principals' school level and their use of shared decision-making processes. Principals reported strengths of SBM to be autonomy in making instructional decisions; flexibility with budget; building teacher leaders; and shared decision making. Challenges to the successful implementation of SBM were budget issues; too much time away from instructional focus; and the need for ongoing training.",
  "description_provenance": [
    "Author Email: pkgauch@yahoo.com",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: wglenn@vt.edu",
    "Advisor Email: spowell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:33Z (GMT). No. of bitstreams: 2 Gauch_PK_D_2011.pdf: 487729 bytes, checksum: d87d318486fc066c255ec0cec671217a (MD5) Gauch_PK_D_2011_f4.pdf: 238209 bytes, checksum: c016b788c40657cd3a4485925311b8e8 (MD5)   Previous issue date: 2011-02-04"
  ],
  "handle": "26222",
  "identifier_other": "etd-02162011-124332",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02162011-124332/",
  "identifier_uri": "http://hdl.handle.net/10919/26222",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Gauch_PK_D_2011.pdf",
    "Gauch_PK_D_2011_f4.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "shared decision making",
    "principal role under site-based management",
    "site-based management"
  ],
  "title": "Site-Based Management – Principal Perceptions and Behaviors after 19 Years of Implementation",
  "type": "Dissertation"
}