{
  "contributor_author": "Swartz, Katherine Lively",
  "contributor_committeechair": "Sutphin, H. Dean",
  "contributor_committeemember": [
    "Redican, Kerry J.",
    "Tooke-Rawlins, Dixie",
    "Price, William T. Jr."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:34Z",
  "date_adate": "2009-06-08",
  "date_available": "2014-03-14T20:07:34Z",
  "date_issued": "2009-02-02",
  "date_rdate": "2009-06-08",
  "date_sdate": "2009-02-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "El Salvador has a large population of children living in orphanages where, as predictions from previous research indicate, many will not meet developmental milestones that could be remediated with research and development.<p> The purpose of this study was to determine milestone achievement and environmental impact among Salvadorian orphans at selected sites, in order to make recommendations for appropriate training materials to allow for the mentoring of caregivers to advance milestone achievement among the orphans.<p> The five objectives addressed in the research are in context of two investigator selected orphanages in El Salvador:  <ol><li> Determine the current level of development of orphans using the Battelle Developmental Inventory Screening Test.  </li><li>Determine characteristics of caregivers who have frequent interactions with the orphans. </li><li>Determine areas of strength and deficiency among the orphans with respect to Personal-Social, Adaptive, Motor, Communications, and Cognition. </li><li>Determine the level of association between selected characteristics of orphans with developmental milestone achievement. </li><li>Develop a model caregiver-training program for implementation at the two selected orphanages based on investigator-derived characteristics and related findings.</li></ol>  Screening Tool strengths and deficiencies were identified among the orphans with respect to Personal-Social, Adaptive, Motor, Communications, and Cognition. The Batelle Developmental Inventory Screening Tool in Spanish was completed on 34 qualifying children at Hogar Immaculado Corazon de Maria orphanage and an additional ten screening tools were completed on qualifying children at Casa de Mi Padre. Statistical analyses determined the level of association between selected characteristics of orphans with developmental milestone achievement.  Using findings from this initial phase, a model caregiver-training program was developed and implemented at the two selected orphanages based on investigator-derived characteristics and related findings.  Conclusions from the study and recommendations were developed from the findings.<p> The level of achievement of developmental milestones among the selected orphans was below the expected level for their chronological age.  The caregivers employed by the two orphanages were a diverse group of individuals from a variety of backgrounds.  The majority of them described themselves as not having formal education in child development.  The strong interest they demonstrated during the training program indicated an eagerness and willingness to learn.  The areas of greatest deficiency were communication and cognitive scores.  The areas of relative strength were Adaptive and Motor skills. <p> There were few statistically significant relationships between the selected independent variables and the scores on the screening tool with the exception of association between motor scores and both the child?s nutritional status and the number of months they have spent in the orphanage.  Months spent in the orphanage also show some evidence of association with communication scores, but not statistically significant.  The model intervention program was successfully implemented and should be part of an on-going training program. Future research should replicate this study in similar setting and provide additional probes with a larger sample to substantiate these finding and more in depth understanding for enhancement of both theory and practice. <p>",
  "description_provenance": [
    "Author Email: klively@vcom.vt.edu",
    "Advisor Email: dsutphin@vcom.vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: drawlins@vcom.vt.edu",
    "Advisor Email: wprice@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:34Z (GMT). No. of bitstreams: 1 KatieLivelySwartzFinalFINALDissertation.pdf: 9323509 bytes, checksum: df89f89201ac2c85912e7699d692892d (MD5)   Previous issue date: 2009-02-02"
  ],
  "handle": "26227",
  "identifier_other": "etd-02172009-071203",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02172009-071203/",
  "identifier_uri": "http://hdl.handle.net/10919/26227",
  "publisher": "Virginia Tech",
  "relation_haspart": "KatieLivelySwartzFinalFINALDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "orphans",
    "Battelle Developmental Inventory II Screening Too",
    "developmental milestones",
    "caregivers",
    "development"
  ],
  "title": "Achievement Of Developmental Milestones Among Salvadorian Orphans",
  "type": "Dissertation"
}