{
  "contributor_author": "Farrell, Leah Varney",
  "contributor_committeechair": "Geller, E. Scott",
  "contributor_committeemember": [
    "Dunsmore, Julie C.",
    "Jones, Russell T.",
    "Winett, Richard A."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:07:35Z",
  "date_adate": "2009-04-03",
  "date_available": "2014-03-14T20:07:35Z",
  "date_issued": "2009-02-06",
  "date_rdate": "2012-11-08",
  "date_sdate": "2009-02-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "While safety-belt use markedly reduces morbidity and mortality, many young adults in the U.S. do not buckle-up 100% of the time. Following a series of community-level interventions on a university campus, this dissertation project focused on promoting individual-level safety-belt use. More specifically, a targeted web-based assessment and brief motivational intervention for individuals with lower rates of safety-belt use was developed and tested. A Pilot Study conducted prior to the Main Study developed self-reported assessment measures for safety-belt use and motivation. Recruitment, baseline assessment, intervention, and follow-up assessment were conducted via the Internet. Student drivers who buckled-up less than 70% of the time and who met other eligibility requirements were enrolled in a within subjects, randomized, attention-controlled design.  <p> At baseline, each participant completed an assessment of: (1) demographics; (2) driving behaviors; and (3) social cognitive and motivational variables including knowledge, perceived importance, confidence (self-efficacy), and readiness to buckle-up. Participants were then randomly assigned to one of two groups: (1) an attention-control group receiving emailed general nutrition information or (2) a motivational interviewing-consistent feedback group receiving emailed personalized feedback. Dependent variables were re-assessed approximately ten days after feedback/general nutrition information were emailed via follow-up assessment.  <p> Outcomes analyses using non-parametric statistics were conducted twice. First, an analysis of â  completersâ   was conducted using data from those who completed follow-up. Second, a more conservative intent-to-treat analysis was conducted after carrying the last observation forward for those who did not complete follow-up, assuming no change among those who did not complete follow-up. Overall, results suggest this web-based assessment and brief motivational intervention was feasible and acceptable to participants. Overall, results from both analyses found statistically significant increases in median driver and passenger belt use between baseline and follow-up among participants in both groups. Further, effect sizes suggest the magnitude of change was greater among those in the intervention group versus those in the attention-control group. Participants were then categorized according to whether or not they increased driver belt use by at least one instance between baseline and follow-up. Those who received the intervention were not significantly more likely than those who received general nutrition information (i.e., assessment only) to increase driver safety-belt use by at least one instance. No statistical differences were found in either the completer or intent-to-treat analyses. Yet, when participants were categorized according to whether or not they increased passenger belt use by at least one instance between baseline and follow-up, those who received the intervention were 1.75 times more likely than those who received general nutrition information (i.e., assessment only) to increase passenger safety-belt use by at least one instance. This difference was not found in the intent-to-treat analysis.  <p> In general, study participation was associated with increased ratings of motivation (i.e., importance, confidence, and readiness) at follow-up. Results were interpreted with caution given psychometric weaknesses including high intercorrelations found between constructs of motivation in the Pilot Study. However, median change in one construct, readiness, was investigated in post-hoc analyses. Using the intent-to-treat sample, it was found that participants who were categorized as having increased driver safety-belt use by at least one instance also reported statistically significant median changes in readiness to buckle-up as a driver. Those categorized as having increased passenger safety-belt use by at least one instance also reported statistically significant median changes in readiness to buckle-up as a passenger. Further, although there was a trend for participants in the intervention group to be more likely than those in the attention-control group to commit to buckling-up and asking others to do the same at follow-up, there were no significant differences in commitment between groups.  <p> However, regardless of group assignment, change in median readiness was associated with: (1) commitment to buckle-up as a driver; (2) commitment to buckle-up as a passenger; (3) commitment to ask others to buckle-up while acting as a driver; and (4) commitment to ask others to buckle-up while acting as a passenger.   Overall, these studies found the Internet to be an acceptable and promising venue for assessment and brief motivational intervention to promote safety-belt use among university students. Further, safety-belt use and motivational constructs such as importance, confidence, and readiness may be measured via self-report methodology. Results suggest participation in the study was associated with improvement in safety-belt use and some levels of motivation. While there were trends for those in the intervention group to report greater increases, there were no statistically significant differences between the groups in the ITT analyses. In the completer analyses, it was found that those in the intervention group were significantly more likely to report increased passenger safety-belt use. Future research may elucidate more specific psychometric properties of new measures used. In particular, readiness may be a proxy motivational variable that appears to relate to change in safety-belt use among drivers and passengers as well as commitment to buckle-up and ask others to do the same. The simple process of assessment may be sufficient to produce changes in readiness related to behavior change.",
  "description_provenance": [
    "Author Email: lvf2101@vt.edu",
    "Advisor Email: lvf2101@vt.edu",
    "Advisor Email: jdunsmor@vt.edu",
    "Advisor Email: rtjones@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:35Z (GMT). No. of bitstreams: 1 FinalMarch29.pdf: 43119620 bytes, checksum: 7a4b889b79e2fdf4f1c48861dbd514cf (MD5)   Previous issue date: 2009-02-06"
  ],
  "handle": "26228",
  "identifier_other": "etd-02172009-104748",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02172009-104748/",
  "identifier_uri": "http://hdl.handle.net/10919/26228",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalMarch29.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Brief Intervention",
    "Motivation",
    "Seat belt",
    "Safety belt",
    "Internet"
  ],
  "title": "Web-Based Assessment and Brief Motivational Intervention to Increase Safety-Belt Use on a University Campus",
  "type": "Dissertation"
}