{
  "contributor_author": "Hertlein, Katherine Anne",
  "contributor_committeecochair": [
    "Johnson, Scott W.",
    "Piercy, Fred P."
  ],
  "contributor_committeemember": [
    "Cooper, Alvin",
    "Skaggs, Gary E.",
    "Benningfield, Anna Beth"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:07:34Z",
  "date_adate": "2004-02-19",
  "date_available": "2014-03-14T20:07:34Z",
  "date_issued": "2004-02-02",
  "date_rdate": "2005-02-19",
  "date_sdate": "2004-02-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Internet is being used more and more frequently as a way for people to meet. The Internet also provides increased opportunities to initiate couple relationships, as well as affairs. The present study adds to the existing literature base in Internet infidelity treatment as well as therapist conceptualization processes.   The present study investigated how family therapists assess and treat Internet infidelity. It assessed whether gender and other social background variables of therapists are operating in treatment decisions. Specifically, this study provided three clinical vignettes to 508 practicing marriage and family therapists and asked them several treatment and assessment questions about the cases while manipulating the gender of the clients in the vignettes. The questions asked of clinicians assess the clinician창  s prognosis of the case, the clinician창  s treatment strategy, how many sessions might be necessary, and how severe the clinician perceives the problem. Results include:   a)\ttreatment decisions of therapists regarding Internet infidelity cases b)\tinformation as to whether the assessment and treatment decisions vary according to the gender of the clients in Internet infidelity vignettes c)\twhether the treatment decisions vary depending on the clinician창  s social background characteristics (such as age, religiosity, gender).  The results indicate that therapists who are more religious tended to view Internet infidelity as that which might require a greater individual focus. Age and gender of the clinicians also affected how therapists used treated cases, with younger clinicians more likely to alter environmental issues and female clinicians more likely to focus on couple processes in treatment. Further, clinicians also viewed men as more likely to be sex addicted, while women engaging in the same behavior were viewed as atypical for engaging in the same behavior. Clinicians also made differential decisions in treatment based on client needs, client gender, client health, and their personal theoretical orientation.   This study sheds light on the role of specific identity variables in treatment decisions. It also provides a foundational knowledge of the treatment of Internet infidelity that will serve as a springboard for future projects to examine the effectiveness of different treatments, develop treatment protocols, and elevate the standard of care for this increasingly prevalent presenting problem.",
  "description_provenance": [
    "Author Email: khertlei@vt.edu",
    "Advisor Email: alcooper@myinternetcity.com",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: swj@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: abenning@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:34Z (GMT). No. of bitstreams: 1 HertleinETD.pdf: 3405211 bytes, checksum: 6b29f3d4aa232f15f21312bfb3209a9c (MD5)   Previous issue date: 2004-02-02"
  ],
  "handle": "26225",
  "identifier_other": "etd-02172004-121146",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02172004-121146/",
  "identifier_uri": "http://hdl.handle.net/10919/26225",
  "publisher": "Virginia Tech",
  "relation_haspart": "HertleinETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Differential Treatment",
    "Religiosity",
    "Gender",
    "Age",
    "Therapist창  s Biases",
    "Internet",
    "Infidelity",
    "Treatment",
    "Assessment",
    "Affairs"
  ],
  "title": "Internet Infidelity: An Examination of Family Therapist Treatment Decisions and Gender Biases",
  "type": "Dissertation"
}