{
  "contributor_author": "Mullin, Jennifer Susan",
  "contributor_committeechair": "Lohani, Vinod K.",
  "contributor_committeemember": [
    "Griffin, Odis Hayden Jr.",
    "Goff, Richard M.",
    "Wildman, Terry M."
  ],
  "contributor_department": "Engineering Education",
  "date_accessioned": "2014-03-14T20:07:36Z",
  "date_adate": "2010-04-28",
  "date_available": "2014-03-14T20:07:36Z",
  "date_issued": "2010-02-04",
  "date_rdate": "2010-04-28",
  "date_sdate": "2010-02-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Engineering is widely accepted as a creative discipline. However, research focused on assessment of student creativity in engineering studies is lacking.  Creativity by definition encompasses both novelty and value and has been approached through investigations of person, product, process and environment.  Contemporary socio-cultural theories of creativity recognize the subjective nature of creativity in terms of a person, domain, and field.  Domain specific viewpoints recognize the necessity of specialized skills and knowledge beyond the scope of general creativity to attain advanced levels of creative achievement within a given domain.  Given the breadth of these theoretical perspectives, the overarching goal of this research was to initiate a foundational understanding of student creativity through a sustainable energy themed engineering design project developed specifically for an introductory engineering course at Virginia Tech.      This embedded mixed-methods study approached creativity through assessment as well as significance of correlations between studentsâ   creative thinking abilities, their creative performance and their perceptions of the design experience in terms of known creativity factors on the 8-week long open-ended engineering design project.  The study is comprised of two research themes; the investigation begins in theme one with a focus on individual creativity leading to investigation of team creativity in theme two with data collected over two successive semesters (i.e., spring â  07 and fall â  07).  Creativity assessment measures included a test of creative thinking abilities, the Abbreviated Torrance Test for Adults (ATTA) as well as application of the Consensual Assessment Technique (CAT), a widely used creativity measurement technique, with graduate student judges assessing creativity of studentâ  s brainstorming ideas and final designs.  Student surveys were administered for each theme to assess studentsâ   perceptions of the design project.       Results reveal a significant correlation (p < 0.05) between studentsâ   ATTA scores and perceptions of the project as open-ended and interesting.  Additional factors significantly correlated (p < 0.05) with studentsâ   perceptions of the design experience as creative included finding the project meaningful, interesting, exciting, enjoyable and surprising.  Results of inter-rater reliability analysis followed by a two-way ANOVA illustrated difficulties in establishing consistency of judgesâ   assessment of technical brainstorming ideas and final designs.  Theme one findings with students repeatedly discussing the importance of their team in the creative process on the design project were further substantiated in theme two, bringing fresh insights concerning the role of collaboration in student creativity in the introductory engineering course.      Implications for future research begin with the necessity for establishing reliable judging criteria and training as well as determining appropriate judges used in the assessment of studentsâ   creative performance on the design project.  This research provides an essential starting point for researchers interested in developing engineering design curriculum to foster creativity.",
  "description_provenance": [
    "Author Email: jsmullin@vt.edu",
    "Advisor Email: vlohani@vt.edu",
    "Advisor Email: griffin@vt.edu",
    "Advisor Email: richgoff@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:36Z (GMT). No. of bitstreams: 1 Mullin_JS_D_2010.pdf: 1831148 bytes, checksum: 53688d17ea2fb2cdd7dd7899b7b14878 (MD5)   Previous issue date: 2010-02-04"
  ],
  "handle": "26239",
  "identifier_other": "etd-02182010-161327",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02182010-161327/",
  "identifier_uri": "http://hdl.handle.net/10919/26239",
  "publisher": "Virginia Tech",
  "relation_haspart": "Mullin_JS_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "creativity",
    "engineering design curriculum",
    "sustainability",
    "introductory engineering course"
  ],
  "title": "Investigations of Student and Team Creativity on an Introductory Engineering Design Project",
  "type": "Dissertation"
}