{
  "contributor_author": "Martin, Cortney V.",
  "contributor_committeechair": "Smith-Jackson, Tonya L.",
  "contributor_committeemember": [
    "Borrego, Maura Jenkins",
    "Babski-Reeves, Kari L.",
    "Fu, Victoria R.",
    "Kleiner, Brian M."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:07:36Z",
  "date_adate": "2007-02-22",
  "date_available": "2014-03-14T20:07:36Z",
  "date_issued": "2007-02-07",
  "date_rdate": "2007-02-22",
  "date_sdate": "2007-02-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This human factors research demonstrated the importance of instruction design on assembly performance and self-efficacy in young children.  The mixed-method usability study evaluated the effect of gender, age, toy, and experience on assembly performance, frequency and duration of instruction looks, subjective evaluations, and usability problems. A total of twenty-four boys and girls, six- and nine-year-olds, assembled K'NEX, LEGO, BIONICLE, and Lincoln Log toys using the accompanying pictorial assembly instructions.  Other research objectives included recommending key usability measures for instruction designers, developing a model of assembly self-efficacy, and evaluating traditional usability methods for use with children.  <p>  Not surprisingly, quantitative results revealed that the older children assembled the toys more quickly and accurately with fewer usability problems.  Six-year-old girls had the highest rate of mistakes.  The nine-year-olds required fewer instruction looks of shorter duration than the six-year-olds.  With few exceptions, toy comparisons were similar across subjective and objective measures.  Thirty-two instruction design usability problems were described and illustrated and resulted in twenty-seven design recommendations.  For example, more than half of the children omitted components added to the main assembly in the presence of a subassembly construction suggesting that the subassembly should be in a separate frame.  <p>  Principal components analysis of all quantitative measures revealed four key components for the usability testing of pictorial assembly instructions: performance, satisfaction, difficulty, and previous experience.     A qualitative analysis of the think-aloud data and observations, using Grounded Theory, produced a model of assembly self-efficacy from child usersâ   psychosocial and cognitive perspectives that affirmed the importance of user-centered instruction design.  Girls exhibited lower self-efficacy and a greater tendency toward internal attributions, which was exacerbated by assembly of a boy-oriented toy.  Six-year-old children were more affected by excess extraneous cognitive load and inaccurate information, such as color mismatches between the instructions and object.  <p>  Adaptations of traditional usability methods and instruments were effective with children.  They included video training for thinking aloud, visual-analog rating scales, and pictorial ranking instruments.  A small head-mounted camera provided an economic means for gathering gross instruction encoding times and for better understanding the userâ  s perspective.",
  "description_provenance": [
    "Author Email: martinc@vt.edu",
    "Advisor Email: mborrego@vt.edu",
    "Advisor Email: kari@ise.msstate.edu",
    "Advisor Email: smithjac@vt.edu",
    "Advisor Email: vfu@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:36Z (GMT). No. of bitstreams: 1  Martin_Usability_of_Toy_Assembly_Instructions.pdf: 7107869 bytes, checksum: 87ac8c08d5f972bc4fd312ce78b5dfba (MD5)    Previous issue date: 2007-02-07"
  ],
  "handle": "26237",
  "identifier_other": "etd-02182007-213120",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02182007-213120/",
  "identifier_uri": "http://hdl.handle.net/10919/26237",
  "publisher": "Virginia Tech",
  "relation_haspart": "Martin_Usability_of_Toy_Assembly_Instructions.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "pictorial instructions",
    "toy assembly",
    "construction play",
    "children",
    "usability",
    "self-efficacy",
    "design guidelines"
  ],
  "title": "Usability of Pictorial Assembly Instructions for Young Children",
  "type": "Dissertation"
}