{
  "contributor_author": "Dewing, Wende L",
  "contributor_committeechair": "Beaton, Robert J.",
  "contributor_committeemember": [
    "Alessi, Paula",
    "Wierwille, Walter W.",
    "Miller, Michael L.",
    "Prestrude, Albert M."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:07:35Z",
  "date_adate": "2000-05-02",
  "date_available": "2014-03-14T20:07:35Z",
  "date_issued": "1999-01-29",
  "date_rdate": "2001-05-02",
  "date_sdate": "2000-02-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Within the home environment there exits a host of digital color imaging (DCI) system configurations.  The combination of devices and software at the consumerâ  s desktop with devices and services at a remote location (e.g., Print at Kodak), creates a complex interaction of device, contextual, and observer characteristics.  In particular, the cathode-ray tube (CRT) display has the potential to influence consumersâ   perceptions of image quality and their subsequent image manipulation activities.  Depending on the inherent color bias and apparent contrast of the CRT, extensive image manipulation may occur, significantly altering the digital values of the image.  Output generated by a remote printer will reflect any image manipulation undertaken by the consumer.  If manipulation was extensive, what the consumer receives from a remote printer will appear quite different from the softcopy version and thus, may be deemed unacceptable.  This research was designed to address the softcopy-hardcopy matching issues that arise from the home DCI system configuration just described.  The primary study examined how the CRT display influenced perceived color quality of photographs generated at two points in a DCI system; on-screen photographs (softcopy) and photographic quality prints (hardcopy).  CRT gamma, color temperature, and excitation purity were manipulated using an orthogonal, blocked, central composite design.  Twenty-two Eastman Kodak Company employees viewed 6 photographs under each of the 15 CRT conditions.  Participants rated the color quality of each softcopy photograph, then were given an opportunity to edit color balance, brightness, and contrast for each photograph.  The edited photos were printed and rated once again for color quality and acceptability.  Results indicated that monitor calibration influenced perceived softcopy color quality, softcopy editing behavior, and subsequent perceived hardcopy color quality.  Perception of softcopy color quality ratings was determined predominantly by the CRT gamma level.  Participants responded to CRT color balance differences through their editing behavior.  In some cases, edits were large enough to significantly and negatively impact perceived hardcopy color quality.  Gamma in particular, was the most significant predictor of hardcopy color quality ratings and rejection rates.  Additional differences were observed between first- and third-party photographs.    Results from this research may be applied to the development of monitor calibration tools, scene balancing algorithms, and software, for the purpose of accommodating consumer image manipulation behavior, in the context of the home DCI system presented herein.",
  "description_provenance": [
    "Author Email: wende.dewing@honeywell.com",
    "Advisor Email: bobb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:35Z (GMT). No. of bitstreams: 1 Dewing_Dissertation2.pdf: 1095471 bytes, checksum: e379f7144c416f3c95d9612c4c30f18d (MD5)   Previous issue date: 1999-01-29"
  ],
  "handle": "26232",
  "identifier_other": "etd-02182000-16390013",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02182000-16390013/",
  "identifier_uri": "http://hdl.handle.net/10919/26232",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dewing_Dissertation2.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "human factors",
    "color imaging",
    "central composite design",
    "digital imaging",
    "soft-copy hard-copy matching",
    "image quality"
  ],
  "title": "Perception of Color Quality for Natural Images Viewed, Edited, and Printed Within the Context of a Home Digital Color Imaging System",
  "type": "Dissertation"
}