{
  "contributor_author": "Melton, David Glenn",
  "contributor_committeecochair": [
    "Richards, Robert R.",
    "Carlton, Patrick W."
  ],
  "contributor_committeemember": [
    "Upperman, James E.",
    "Salmon, Richard G.",
    "Earthman, Glen I."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:35Z",
  "date_adate": "1999-02-17",
  "date_available": "2014-03-14T20:07:35Z",
  "date_issued": "1998-11-20",
  "date_rdate": "1999-02-17",
  "date_sdate": "1999-02-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to document the history of the development of the Manassas Park City School system.  This study utilized historical research methods to preserve information that would otherwise be lost.<p> \tThis was a study of local school history.  It looked at how and why the school division began and how it has changed over time.  It provides an understanding of how the school division evolved into its present state.  This study examined the political, social and economic history of Manassas Park City Schools and the forces which influenced and shaped the school division.  The study concentrated on political leaders, the residents who lived and worked in the city, and the financial difficulties experienced by the school division.<p> \tThis study relied on historical research methods to document the history of the school division.  Data for the study came from both primary and secondary source materials.  Sources included letters, notebooks, memoranda, official papers and documents, reports, official minutes, newspaper articles, letters to the editor and editorials, and pamphlets.  A major source for the study was interviews of the key individuals who had first hand information worth preserving.<p>",
  "description_provenance": [
    "Author Email: dgmelton@hotmail.com",
    "Advisor Email: robertr@vtm1.cc.vt.edu",
    "Advisor Email: carltonp@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:35Z (GMT). No. of bitstreams: 1 etd.pdf: 831591 bytes, checksum: cabd5a12beaa4cc6d91b7533c20a126f (MD5)   Previous issue date: 1998-11-20"
  ],
  "handle": "26230",
  "identifier_other": "etd-021799-082322",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-021799-082322/",
  "identifier_uri": "http://hdl.handle.net/10919/26230",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "School History",
    "Public Schools"
  ],
  "title": "A History of Manassas Park City Schools",
  "type": "Dissertation"
}