{
  "contributor_author": "Eaker, Lisa",
  "contributor_committeechair": "Garrison, James W.",
  "contributor_committeemember": [
    "La Berge, Ann F.",
    "Boler, Megan M.",
    "Shargel, Emmanuel",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:35Z",
  "date_adate": "2003-03-10",
  "date_available": "2014-03-14T20:07:35Z",
  "date_issued": "2003-01-20",
  "date_rdate": "2004-03-10",
  "date_sdate": "2003-02-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Finding conceptual tools that lend themselves to the creation of consensus    is no easier in an age of mass communication, mass transportation or mass education,    than it was in earlier less \"modern,\" technology adventurous, times. In fact,    as I argue in this dissertation, modernity can be analyzed and experienced as    being anathema to those characteristics upon which consensus can be built. This    dissertation examines why this is the case and what may be done to ameliorate    the worst excesses of modernity while building on its greatest strengths. </p>",
  "description_provenance": [
    "Author Email: lisaeaker@paonline.com",
    "Advisor Email: alaberge@vt.edu",
    "Advisor Email: wesley@vt.edu",
    "Advisor Email: mboler@vt.edu",
    "Advisor Email: shargel@coe.fsu.edu",
    "Advisor Email: jburton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:35Z (GMT). No. of bitstreams: 1 LEfinal.pdf: 1164013 bytes, checksum: e3e66fb3a6d08bc952419d051fe164e1 (MD5)   Previous issue date: 2003-01-20"
  ],
  "handle": "26233",
  "identifier_other": "etd-02182003-103827",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02182003-103827/",
  "identifier_uri": "http://hdl.handle.net/10919/26233",
  "publisher": "Virginia Tech",
  "relation_haspart": "LEfinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Modernity",
    "Individuality",
    "Individualism",
    "Michel Foucault",
    "Education",
    "John Dewey"
  ],
  "title": "The Social Sacrifices of Being Modern",
  "type": "Dissertation"
}