{
  "contributor_author": "Henson, Camille  Jeanette",
  "contributor_committeechair": "Sutphin, H. Dean",
  "contributor_committeemember": [
    "Lockee, Barbara B.",
    "Palmieri, James",
    "Redican, Kerry J."
  ],
  "contributor_department": "Education",
  "date_accessioned": "2014-03-14T20:07:36Z",
  "date_adate": "2011-03-10",
  "date_available": "2014-03-14T20:07:36Z",
  "date_issued": "2011-02-04",
  "date_rdate": "2011-03-10",
  "date_sdate": "2011-02-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Background   Selected factors place Dominican female adolescent and adults at risk for sexually transmitted infections (STIs) such as Chlamydia, causative organism Chlamydia trachomatis, and Gonorrhea, causative organism Neisseria gonorrhoeae. The purpose of this study was to determine the prevalence of Chlamydia and Gonorrhea among adolescent and adult females that utilize the clinic in Veron, Dominican Republic. Clinical standards of care for these STIs and educational programs for prevention were developed from the data gathered from this study. Significance at 0.05 Î¬ of the relationship of educational level, management of risk factors and other selected independent variables on prevalence rate of Chlamydia and Gonorrhea in the clinic population of Veron, Dominican Republic were determined. The objectives of the study were to 1) determine the prevalence of adolescent and young adult females diagnosed with Gonorrhea and Chlamydia who visit the clinic for prenatal visits, annual pap smear exams and gynecological complaints; 2) determine the extent to which educational level is a predictor of positive diagnosis or risk for infection of Chlamydia and Gonorrhea and; 3) determine which selected demographic and risk factors are associated with positive test results for Gonorrhea and Chlamydia. Methods   All adolescent and adult females ages 15 years and older visiting the clinic in Veron for prenatal exams, pap smear exams and gynecological complaints between January 28, 2008 â  March 3, 2008 were invited to participate in this prevalence study. Of the 90 invited, the accepting sample was 90 who signed an informed consent form. Prior to STI testing each patient completed a verbal interview and questionnaire on sociodemographic characteristics as well as knowledge, attitudes, and beliefs related to Chlamydia and gonorrhea, sexual experiences and behaviors and illicit drugs use. Specimens collected from the endocervical canal of each female were tested and results provided within two hours, followed by immediate treatment by a licensed Dominican physician and follow-up care based on the guidelines and standards of care. The data were analyzed using descriptive statistics, chi square, t-test and logistic regression.  Results  A total of ninety women participated in the study. Chlamydia was detected in 6.7% of the patient population and Gonorrhea was detected in 22.2% of the patient population. Co-infection of both Chlamydia and Gonorrhea was present in 2 cases. Among the positive Chlamydia tests results, 50% had less than a six-year education and 50% had more then six years of education. In addition, 83.3% of the patients with positive Chlamydia results answered â  yesâ  , they could read and 16.6% stated they could not read, while 83.3% of the patients with positive Chlamydia results stated they could write and 16.6% stated they could not write (P>0.05). Among the patients that tested positive for Gonorrhea, 55% stated they had less than six years of formal education and 45% had more than six years of formal education (P>0.05). There were 75% of the patients that tested positive for Gonorrhea that stated they could read and 25% who stated they could not read (P>0.05); while 85% of the patients with positive Gonorrhea results stated they could write and 15% stated they could not write (P> 0.05).   Conclusion  Educational level and other selected demographic characteristics and risk factors in this study are not a significant predictor of positive diagnosis or risk of infection for Chlamydia or Gonorrhea. We cannot conclude that specific risk factors are associated with positive test results for Gonorrhea and Chlamydia. For the physicians involved in the clinical decision-making regarding the female patients at the Veron clinic, more data are needed to determine appropriate populations for screening of Gonorrhea and Chlamydia as well as appropriate educational tools on sexually transmitted infections.",
  "description_provenance": [
    "Author Email: cahenson35@gmail.com",
    "Advisor Email: dsutphin@vcom.vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: jpalmieri@vcom.vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:36Z (GMT). No. of bitstreams: 2 Henson_CJ_D_2011_f1.pdf: 61566 bytes, checksum: 987f569ee37db67399319dcbdb4a1868 (MD5) Henson_CJ_D_2011: 894187 bytes, checksum: cf65a2d28f63873d77ded9304351f054 (MD5)   Previous issue date: 2011-02-04"
  ],
  "handle": "26241",
  "identifier_other": "etd-02182011-161829",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02182011-161829/",
  "identifier_uri": "http://hdl.handle.net/10919/26241",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Henson_CJ_D_2011_f1.pdf",
    "Henson_CJ_D_2011"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "sexually transmitted infections (STIs)",
    "Chlamydia trachomatis",
    "Neisseria gonorrhoeae",
    "risk factors",
    "Dominican Republic"
  ],
  "title": "Risk Factors Contributing to Transmission Rates of  Chlamydia trachomatis and Neisseria gonorrhoeae Among Women in Veron, Dominican Republic",
  "type": "Dissertation"
}