{
  "contributor_author": "Bea, Joo-eun",
  "contributor_committeechair": "Toth, Thomas E.",
  "contributor_committeemember": [
    "Wong, Eric A.",
    "Boyle, Stephen M.",
    "Holladay, Steven D.",
    "Schurig, Gerhardt G."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:07:37Z",
  "date_adate": "1999-03-05",
  "date_available": "2014-03-14T20:07:37Z",
  "date_issued": "1999-02-05",
  "date_rdate": "1999-03-05",
  "date_sdate": "1999-02-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Brucella abortus is capable of resisting the microbicidal mechanisms of phagocytic cells and growing within phagocytic cells, usually macrophages.  B. abortus, like several other intracellular bacteria responds to the hostile environment in macrophages by producing heat shock proteins (HSPs) which are induced by environmental stresses. Bacterial HSPs are very immunogenic, eliciting both cellular and humoral immune responses in the infected host.  The significance of host cellular and protective immune responses directed against these proteins is currently unresolved.  Baculovirus recombinants were generated in Sf9 insect cells for B. abortus HSPs and the protein expression was optimized. Humoral (Western blot), cell mediated (CMI, IFN-g- release by splenocytes, and CD3+CD4+, CD3+CD8+ T cell/ total splenocytes ratios) and protective immune responses of BALB/c mice (challenge with virulent B. abortus 2308) against these recombinants, against B. abortus superoxide dismutase (SOD) and ribosomal L7/L12 proteins, inoculated alone or in various combinations with complete Freundâ  s, Ribi and recombinant IL-12 as adjuvants, were analyzed. Vaccinia virus-GroEL recombinant as priming immunogen, followed by baculovirus-GroEL-Ribi booster, was explored. Androstenediol, an immune up-regulator, was tested for its ability to induce resistance against challenge.<p> None of the mice inoculated with individual, divalent or trivalent HSP-expressing Sf9 cells combined with Freund's were protected against challenge and the Sf9 cell-induced response masked the recombinant protein-specific CMI responses. Recombinant HSPs were purified and combined with Ribi.  Although significant IFN-g release was induced by immunization with the HtrA-Ribi combination, no mice were protected against challenge. Priming with vaccinia virus-GroEl recombinant and boosting with purified baculovirus-GroEL protein-Ribi combination did not induce protection. Androstenediol did not enhance in vivo resistance to challenge. IL-12 alone did not activate splenocytes but induced significant IFN-g release in mice when combined with killed B. abortus RB51 vaccine, purified recombinant HtrA or purified SOD proteins, or L7/L12 expressing Escherichia coli cells. Significant protection was induced by SOD combined with IL-12. No correlation was seen between IFN-g release by splenocytes and protection against challenge in the SOD/IL-12-immunized mice. <p> The results suggest that B. abortus HSPs are not highly immunogenic in mice and though various immune responses may be induced by one or another HSPs, protective immune response, unfortunately, is not among them. The results of this study reflect the difficulties in experimenting with immune responses against single or a limited number of recombinant B. abortus proteins. This is particularly true when the task includes induction of a protective immune response and finding significant correlation between different types of immune response assays. <p>",
  "description_provenance": [
    "Author Email: jbea@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: smboyle@vt.edu",
    "Advisor Email: holladay@vt.edu",
    "Advisor Email: gschurig@vt.edu",
    "Advisor Email: ttoth@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:37Z (GMT). No. of bitstreams: 1 etd.pdf: 1756056 bytes, checksum: d981cb22e0e14ad881958b889f471ad1 (MD5)   Previous issue date: 1999-02-05"
  ],
  "handle": "26244",
  "identifier_other": "etd-021899-135828",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-021899-135828/",
  "identifier_uri": "http://hdl.handle.net/10919/26244",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Protection",
    "Brucella abortus",
    "Heat Shock Proteins",
    "Recombinants",
    "Superoxide Dismutase",
    "L7/L12",
    "Immune responses",
    "Baculovirus"
  ],
  "title": "GENERATION OF BACULOVIRUS-BRUCELLA ABORTUS HEAT SHOCK PROTEIN RECOMBINANTS; MICE IMMUNE RESPONSES AGAINST THE RECOMBINANTS, AND B. ABORTUS SUPEROXIDE DISMUTASE AND L7/L12 RECOMBINANT PROTEINS",
  "type": "Dissertation"
}