{
  "contributor_author": "Zhang, Bo Zhi",
  "contributor_committeechair": "Kornegay, Ervin T.",
  "contributor_committeemember": [
    "Keenan, Thomas W.",
    "Denbow, Donald Michael",
    "Notter, David R.",
    "Harper, Allen F."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:07:37Z",
  "date_adate": "1999-02-23",
  "date_available": "2014-03-14T20:07:37Z",
  "date_issued": "1999-01-15",
  "date_rdate": "2012-04-06",
  "date_sdate": "1999-02-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study was conducted to investigate the efficacy of phytase for improving the nutrient utilization for pigs and poultry.  Two experiments, one with broilers and one with pigs, were conducted to compare the efficiency of transgenic microbial (NatuphosÃ ) and plant (PhytaseedÃ ) phytase for enhancing the utilization of phytate P in corn-soybean diets fed to young broilers and pigs, and to evaluate the safety of PhytaseedÃ  phytase.  Three levels of the two sources of phytase (250, 500 and 2,500 U/kg of diet) were added to a corn-soybean meal basal diet containing 0.21 and 0.26% nonphytate P, respectively, for broilers and pigs.  Forty birds and thirty pigs (8 broilers and 6 pigs, one per cage, from the diet without added phytase and the diets with 500 or 2,500 U/kg phytase from both sources) were randomly selected for gross necropsy and histologic evaluation of liver, kidney and bone tissues.  Adding both sources of phytase to the basal diet resulted in similar increases of BW, BW gain, feed intake, gain:feed, apparent digestibilities (retention) of DM, P and Ca, and bone measurements.  Phosphorus excretion decreased as phytase addition increased.  No significant abnormalities were seen in any of the broilers and pigs necropsied.   <p> In a study with pigs (n=120 and 80, respectively for grower and finisher), the effects of supplemental microbial phytase on crude protein and amino acid utilization of low protein plant-based diets was investigated.  During the grower period (32 to 67 kg), diets 1, 2 and 3 contained 14, 13 and 12% crude protein and no added phytase, respectively, and diets 4 and 5 contained 12% crude protein with either 250 or 500 U of phytase/kg of diet, respectively.  During the   finisher period (67 to 109 kg), diets 1, 2 and 3 contained 12, 11 and 10% crude protein with no added phytase, respectively, and diets 4 and 5 contained 10% crude protein with either 250 or 500 U of phytase/kg of diet, respectively.  At the end of grower phase, two pigs (1 barrow and 1 gilt) were removed from each pen; 12 of the barrows that were removed from diets 1, 3 and 5 were put in metabolism cages for total collection, and the remaining four pigs in each pen continued on test for the finisher phase.  At the end of finisher phase, 12 barrows from diet 1, 3, and 5 were put in metabolism cages for total collection.  Ileal contents were taken (slaughter technique) from the remaining barrows and the barrows used in metabolism cages.  Daily gain increased as protein and phytase levels was added to the lowest protein level.  Fecal P and Ca digestibilities improved with added phytase.  Phytase addition to basal diet linearly increased ash weight in the grower phase.  With the exception of proline and glycine, the digestibilities of the other amino acids were linearly increased with phytase and CP level.  Nitrogen excretion was estimated to be reduced by 4.6% when phytase was added to pig diets at a level of 500 U/kg.  <p> In a study with cecectomized roosters, the main effects and interaction of phytase and non-startch polysaccharide enzymes on the nutrient utilization of barley, canola meal, rice bran and soybean meal, and canola-barley (36:64) and soybean meal-barley (27.3:72.7) were evaluated.  Phytase supplementation to basal diets increased the utilization of energy, N, total amino acid and most of amino acids in barley, canola meal, and canola-barley and numerically increased energy and N utilization in rice brain, soybean meal and soybean-barley.  The magnitudes of improvements in the digestibilities of lysine, arginine, cysteine, serine, and threonine were higher compared with the other amino acids.  The true utilization of energy and N, and the digestibilities of total amino acid and of glycine, isoleucine, and histidine in barley quadratically increased with RonozymeTM B.  Phytase addition increased Ca retention in barley, canola and soybean meal, and the soybean meal-barley blend, and increased P retention in barley and soybean meal-barley.  Addition of RonozymeTM B to barley linearly decreased Ca retention and quadratically increased P retention. <p> In summary, the efficiency of phytase in Phytaseed is equal to that of Natuphos for enhancing the utilization of phytate P in corn-soybean diets, and microbial phytase is effective in improving the utilization of N and amino acid in pigs and N, amino acid, and energy in poultry.",
  "description_provenance": [
    "Author Email: zhzhang5@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:37Z (GMT). No. of bitstreams: 1 EDissertation.pdf: 436079 bytes, checksum: 2b6c80a5948fe2a9f108c173a72b078b (MD5)   Previous issue date: 1999-01-15"
  ],
  "handle": "26245",
  "identifier_other": "etd-021899-155208",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-021899-155208/",
  "identifier_uri": "http://hdl.handle.net/10919/26245",
  "publisher": "Virginia Tech",
  "relation_haspart": "EDissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Phosphorus",
    "Phytase",
    "Poultry",
    "Pig",
    "Amino acids",
    "Energy"
  ],
  "title": "Reducing Nutrient Excretion via Improved Nutrient Utilization by Supplementing Pig and Poultry Diets with Phytase Enzyme",
  "type": "Dissertation"
}