{
  "contributor_author": "Chen, Zhangjing",
  "contributor_committeechair": "Lamb, Fred M.",
  "contributor_committeemember": [
    "White, Marshall S.",
    "Skaar, Christian",
    "Nelson, Douglas J.",
    "Kamke, Frederick A."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:07:38Z",
  "date_adate": "1998-01-22",
  "date_available": "2014-03-14T20:07:38Z",
  "date_issued": "1997-12-02",
  "date_rdate": "1998-01-22",
  "date_sdate": "1997-12-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<!doctype html public &quot;-//IETF//DTD HTML//EN&quot;>  <HTML>    <HEAD>    <META NAME=&quot;GENERATOR&quot; CONTENT=&quot;Internet Assistant for Word 1.0Z&quot;>  </HEAD>    <BODY>    <P>  <Center>Primary Driving Force in Wood Vacuum Drying  <P>  by  <P>  Zhangjing Chen  <P>  Committee Chairman: Fred M. Lamb  <P>  (Abstract)</center>  <P>   The objective of this research based on both the theory and experimentation  was to prove that the total pressure difference is the primary  driving force during the vacuum drying.  The theoretical drying  rates of diffusion, free water bulk flow and water vapor bulk  flow were calculated and compared.  The concept of equilibrium  moisture content under the vacuum was developed.  The theoretical  maximum moisture content drop in one cycle was calculated using  energy balance.  The model was developed for the vacuum drying  to understand the mechanism of the vacuum drying including the  boiling front and its movement.  <P>   To evaluate the effect of the sample size on the drying rate,  four different thicknesses (1, 1.5, 2, 2.5 inches) and three different  lengths (5, 10, 15 inches) were used.  In the cyclic drying, the  specimens were heated to the 60 C.  The vacuum was pulled to about  18 mm Hg.  The vacuum pump was kept running for 140 minutes.   It was found that in cyclic vacuum drying, drying rate was not  affected by the thickness.  However, it was affected by the length.   The cyclic drying curve consisted of two distinct parts.  The  fast drying period lasted about 10 to 20 minutes.  The slow drying  period occurred next when the pressure inside wood got close to  the ambient pressure.  <P>   In end grain vacuum drying, the specimens were coated with wax,  wrapped in the plastic film and inserted into a rubber tube to  prevent the moisture loss from the side surfaces during drying.   The specimen size was 1&amp;#215;1&amp;#215;10 inches.  Red oak and white  oak were sealed and dried in both cyclic and continuous vacuum  drying.  The results showed that sealed specimens dried almost  as fast as unsealed specimen.  There was little moisture loss  from the side surfaces.  There was a moisture gradient along the  length in both cyclic drying and continuous vacuum drying.  <P>   Red oak specimens of 2.5&amp;#215;1.5&amp;#215;10 inches were used to  study the boiling front in the vacuum drying.  In order to detect  the boiling phenomenon, the saturation pressures were calculated  and were compared with the pressures at the same time and the  same location.  Boiling occurred during drying and the boiling  front retreated to the center of wood as drying proceeded.  The  retreating speed depended on the heat supply and the permeability.  <P>   Vacuum drying at room temperature was investigated.  The specimens  were dried at 20 C and pressure near 18 mm Hg.  The results showed  that wood can be vacuum dried at room temperature with little  or no degrade at a reasonable drying rate.  <P>   All experimental results support the objective of this study  that the primary driving force is the total pressure difference.    </BODY>    </HTML>",
  "description_provenance": [
    "Author Email: chengo@vt.edu",
    "Advisor Email: fml195@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:38Z (GMT). No. of bitstreams: 1 DISS.PDF: 1533923 bytes, checksum: abc2b9b46672f07fd40fcba419542eb9 (MD5)   Previous issue date: 1997-12-02"
  ],
  "handle": "26255",
  "identifier_other": "etd-02198-185538",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02198-185538/",
  "identifier_uri": "http://hdl.handle.net/10919/26255",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISS.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "driving force",
    "wood vacuum drying",
    "boiling front",
    "room temperature drying",
    "end grain drying"
  ],
  "title": "Primary Driving Force in Wood Vacuum Drying",
  "type": "Dissertation"
}