{
  "contributor_author": "Moore, Michael Wilson",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Potter, Kenneth R.",
    "Ogle, Jeffrey Todd",
    "Burton, John K.",
    "Lockee, Barbara B."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:39Z",
  "date_adate": "2006-04-14",
  "date_available": "2014-03-14T20:07:39Z",
  "date_issued": "2006-02-03",
  "date_rdate": "2007-04-14",
  "date_sdate": "2006-02-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Stereographic virtual environments display data in such a way that a user perceives objects within the displayed environment to be separated in depth from the display itself.  The effectiveness of stereographic virtual environments as learning tools has been evaluated relative to factors such as multidimensional cues, user interaction, and learner characteristics. This study has examined the relationship between two evaluative factors: the presence of stereographic depth cues and field dependence, a learner characteristic associated with performance on visual tasks. Adult learners were identified on a field dependence continuum based on scores on the Group Embedded Figures Test. Each student received instruction related to the heart using stereographic materials or nonstereographic materials, depending on assignment to treatment group. All participants were given two tests, identification and terminology, following this instruction. The scores on the combination of these tests, denoted as the Modified Total Criterion Test (MTCT), represented the level of visual recall relative to the instructional materials reviewed. Analyses of variance revealed an interaction effect between the level of field dependence and the presence of stereographic depth cues within a virtual environment such that field independent participants scored higher on tests of visual recall within stereographic conditions versus nonstereographic conditions and field dependent participants scored lower within stereographic conditions versus nonstereographic conditions.",
  "description_provenance": [
    "Author Email: VEResearch@gmail.com",
    "Made available in DSpace on 2014-03-14T20:07:39Z (GMT). No. of bitstreams: 1 ETD.pdf: 1061569 bytes, checksum: 4810ddb2d085b83a3499540c6f476539 (MD5)   Previous issue date: 2006-02-03"
  ],
  "handle": "26258",
  "identifier_other": "etd-02202006-124107",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02202006-124107/",
  "identifier_uri": "http://hdl.handle.net/10919/26258",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "autostereoscopic display",
    "virtual environments",
    "field dependence independence"
  ],
  "title": "Investigation of the Effects of an Autostereographic Virtual Environment on Recall in Participants of Differing Levels of Field Dependence",
  "type": "Dissertation"
}