{
  "contributor_author": "Sutherland, James Eric",
  "contributor_committeechair": "Sutphin, H. Dean",
  "contributor_committeemember": [
    "Redican, Kerry J.",
    "Rawlins, Fred",
    "Burton, John K."
  ],
  "contributor_department": "Education",
  "date_accessioned": "2014-03-14T20:07:38Z",
  "date_adate": "2009-04-01",
  "date_available": "2014-03-14T20:07:38Z",
  "date_issued": "2009-01-30",
  "date_rdate": "2009-04-01",
  "date_sdate": "2009-02-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Teleradiology has far-reaching implications for the health of remote and underserved populations. With coordination of radiographic evaluation and diagnosis from a distance, teleradiology has the potential to raise the standard of patient care throughout the world. Perhaps the safest and most cost-effective mode of teleradiology today is telesonography. The current research determined that telesonography improves the standard of care at a rural, government-run primary clinic within the Dominican Republic. The work reported herein is intended to compare the use of telesonography to the current standard of sonographic examination which is referral to government hospital 60km from the clinic. the following research questions were addressed: When compared to the standard of care, (1) To what extent does the use of asynchronous telesonography increase the percentage of received sonographic reports based on the total number of ultrasound referrals (sonographic reports / total number of referrals)? (2) To what extent does the use of asynchronous telesonography increase the rate of successful follow-up visits based on the total number of ultrasound referrals? (3) To what extent does the elapsed time between ultrasound referral and sonographic report delivery decrease with the use of asynchronous telesonography? (4) To what extent does the elapsed time between ultrasound referral and patient follow-up decrease with the use of asynchronous telesonography? Research methodology included randomly assigning 100 patients with clinical indications for sonographic examination into experimental and control groups during a 9-week implementation period. Findings from this study indicate that the implemented telesonography system, along with patient awareness of such a system, while not having an appreciable effect on the time to patient follow-up, provided a 4-fold increase in the proportion of patient follow-ups and a 6-fold increase in the proportion of returned radiological reports, and delivered those reports to the referring physician 6-times faster than in the control group. This study demonstrates the feasibility of utilizing a store-and forward telesonography system within this setting. Additional research focusing on the impact of telesonography on patient outcomes within this setting is recommended.",
  "description_provenance": [
    "Author Email: sutherland.je@gmail.com",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: frawlins@vcom.vt.edu",
    "Advisor Email: dsutphin@vcom.vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:38Z (GMT). No. of bitstreams: 1 Telesonography_Adoption_and_Use.pdf: 2167414 bytes, checksum: 9baff1506f263fa4efb85457a6267d4d (MD5)   Previous issue date: 2009-01-30"
  ],
  "handle": "26251",
  "identifier_other": "etd-02192009-144458",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02192009-144458/",
  "identifier_uri": "http://hdl.handle.net/10919/26251",
  "publisher": "Virginia Tech",
  "relation_haspart": "Telesonography_Adoption_and_Use.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Veron",
    "Dominican Republic",
    "telemedicine",
    "teleradiology",
    "teleultrasound",
    "telesonography",
    "teleconsultation",
    "store and forward",
    "portable ultrasound",
    "standard of care"
  ],
  "title": "Telesonography Adoption and Use to Improve the Standard of Patient Care Within a Dominican Community",
  "type": "Dissertation"
}