{
  "contributor_author": "Kuhar, Thomas Patrick",
  "contributor_committeechair": "Youngman, Roger R.",
  "contributor_committeemember": [
    "Peterson, Paul R.",
    "Mack, Timothy P.",
    "Salom, Scott M.",
    "Kok, Loke T."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:07:39Z",
  "date_adate": "2000-02-22",
  "date_available": "2014-03-14T20:07:39Z",
  "date_issued": "2000-02-08",
  "date_rdate": "2001-02-22",
  "date_sdate": "2000-02-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The alfalfa weevil, Hypera postica (Gyllenhal) (Coleoptera: Curculionidae), remains a serious pest in Virginia despite being under complete biological control in the northeastern U.S.  In 1996, a survey of 187 alfalfa fields in Virginia was initiated to determine the current pest status of alfalfa weevil and incidence of natural enemies.  Fields located in the Piedmont region of the state had significantly higher alfalfa weevil pressure than those in the Shenandoah Valley and southwestern region.  The dominant natural enemy of alfalfa weevil larvae was the parasitoid, Bathyplectes anurus (Thomson).  Larval parasitization was lower in the Piedmont compared with the other regions.  The entomopathogenic fungus, Zoophthora phytonomi, also killed weevil larvae in all regions.   A more intensive ecological investigation of alfalfa weevil population dynamics and mortality was initiated in 1997 to determine why H. postica remains a pest in Virginia, particularly in the Piedmont region.  Nine alfalfa weevil populations from three geographic locations were sampled and measured over a period of two years.  Results showed that warmer winter temperatures in the Piedmont region contributed to a higher rate of alfalfa weevil oviposition compared with the Shenandoah Valley and southwestern mountains.  Parasitization of adult weevils by Microctonus aethiopoides (Loan) was low in all regions of Virginia relative to rates reported in the northeastern U.S.  This also contributes to relatively high alfalfa weevil fecundity in Virginia because a greater percentage of adults reproduce.  Phenological asynchrony between M. aethiopoides and the alfalfa weevil may explain the low parasitism.  The 1st generation of M. aethiopoides adults did not emerge until most of the overwintering alfalfa weevil adults had reproduced and died.    A majority of alfalfa weevil eggs were laid before January at all locations in Virginia.  Approximately half of the egg population survived to contribute to spring larval infestations.  In the northern U.S., very few alfalfa weevil eggs survive the winter, and larval populations result primarily from spring-laid eggs.  Mortality of larvae was high in Virginia and comparable to that reported in other states.  Bathyplectes anurus was well-synchronized with alfalfa weevil and killed a high percentage of larvae.",
  "description_provenance": [
    "Author Email: tkuhar@vt.edu",
    "Advisor Email: ppeters1@vt.edu",
    "Advisor Email: tmack@vt.edu",
    "Advisor Email: youngman@vt.edu",
    "Advisor Email: salom@vt.edu",
    "Advisor Email: ltkok@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:39Z (GMT). No. of bitstreams: 7 Chapter2.pdf: 128667 bytes, checksum: 4aee406737941b608c3cd6f6d9528684 (MD5) Chapter4.pdf: 144104 bytes, checksum: 571a2870f45259196be79b8596659b73 (MD5) Chapter5.pdf: 107169 bytes, checksum: cdb1bb37aed2fb73d7b18c92c674ad0e (MD5) Chapter3.pdf: 173848 bytes, checksum: 8336a85a58ef18b0eacdbf2a0163742c (MD5) Chapter1.pdf: 54986 bytes, checksum: c78ab4e9efe8dec6c1db9889f607de9d (MD5) 1frontmatter.pdf: 38414 bytes, checksum: 5516cc7e357ff5a23ccb6b335b1b88ba (MD5) Abstract.pdf: 5887 bytes, checksum: 0801365359d0ee7bc415e1b2073bef3c (MD5)   Previous issue date: 2000-02-08"
  ],
  "handle": "26256",
  "identifier_other": "etd-02202000-21040047",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02202000-21040047/",
  "identifier_uri": "http://hdl.handle.net/10919/26256",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter2.pdf",
    "Chapter4.pdf",
    "Chapter5.pdf",
    "Chapter3.pdf",
    "Chapter1.pdf",
    "1frontmatter.pdf",
    "Abstract.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "population ecology",
    "biological control",
    "pest management",
    "alfalfa",
    "Hypera postica",
    "parasitoids"
  ],
  "title": "Population dynamics, mortality factors, and pest status of alfalfa weevil in Virginia",
  "type": "Dissertation"
}