{
  "contributor_author": "Ahn, Yong Han",
  "contributor_committeechair": "Pearce, Annie R.",
  "contributor_committeemember": [
    "Lechner, Norbert",
    "Reichard, Georg",
    "Chang, Mido",
    "Garvin, Michael J."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:07:38Z",
  "date_adate": "2010-04-07",
  "date_available": "2014-03-14T20:07:38Z",
  "date_issued": "2010-02-18",
  "date_rdate": "2012-04-24",
  "date_sdate": "2010-02-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Public buildings and other public facilities are essential for the functioning and quality of life in modern societies, but they also frequently have a significant negative impact on the natural environment. Public agencies, with their large portfolios of facilities, have faced considerable challenges in recent years in minimizing their negative environmental impacts and energy consumption and coping with shortages of financial capital to invest in new facilities and operate and maintain existing ones, while still meeting their mission goals. These range from the need to provide a quality workplace for their staff to providing a public service and long term benefits to the public. The concept of green building has emerged as a set of objectives and practices designed to reduce negative environment impacts and other challenges while enhancing the functionality of built facilities. However, the prevailing belief related to implementing green building is that incorporating Green Building Strategies and Technologies (GBSTs) increases the initial cost of constructing a facility while potentially reducing its life cycle costs. Thus, this research deals with optimizing the design of individual facilities to balance the initial cost investment for GBSTs versus their potential Life Cycle Cost (LCC) savings without the need to conduct detailed life cycle cost analysis during the early capital planning and budget phases in public sector projects. The purpose of this study is to develop an approach for modeling the general relationship between investments in initial costs versus savings in LCCs involved in implementing green building strategies in public capital projects.  To address the research question, this study developed multiple regression models to identify the relationships between GBSTs and their initial cost premiums, operating costs, and LCCs. The multiple regression models include dummy variables because this is a convenient way of applying a single regression equation to represent several nominal variables, which here consist of initial, operating, maintenance, and repair and replacement costs, and ordinal variables, which in this case are the GBST alternatives considered. These new regression models can be used to identify the relationship between GBST alternatives, initial cost premiums, annual operating costs and LCC in the earliest stage of a project, when public agencies are at the capital planning and budgeting stages of facility development, without necessarily needing to know the precise details of design and implementation for a particular building. In addition, this study also proposes and tests a method to generate all the necessary cost data based on building performance models and industry accepted standard cost data.     This statistical approach can easily be extended to accommodate additional GBSTs that were not included in this study to identify the relationship between their initial cost premium and their potential LCC saving at the earliest stage of facility development. In addition, this approach will be a useful tool for other institutional facility owners who manage large facility portfolios with significant annual facility investments and over time should help them minimize the environmental impacts caused by their facilities.",
  "description_provenance": [
    "Author Email: yahn77@vt.edu, ahny@ecu.edu",
    "Advisor Email: lechnnm@auburn.edu",
    "Advisor Email: reichard@vt.edu",
    "Advisor Email: mchang@vt.edu",
    "Advisor Email: garvin@vt.edu",
    "Advisor Email: apearce@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:38Z (GMT). No. of bitstreams: 1 Ahn_YongHan_D_Feb182010.pdf: 6157904 bytes, checksum: b5b43afd2a18f609a307eaea2afb4df0 (MD5)   Previous issue date: 2010-02-18"
  ],
  "handle": "26252",
  "identifier_other": "etd-02192010-144603",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02192010-144603/",
  "identifier_uri": "http://hdl.handle.net/10919/26252",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ahn_YongHan_D_Feb182010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "First Cost",
    "Multiple Regression Analysis",
    "Life Cycle Cost",
    "Green Building"
  ],
  "title": "The Development of Models to Identify Relationships Between First Costs of Green Building Strategies and Technologies and Life Cycle Costs for Public Green Facilities",
  "type": "Dissertation"
}