{
  "contributor_author": "Bandara, Aloka B. P. A.",
  "contributor_committeechair": "Herbein, Joseph H. Jr.",
  "contributor_committeemember": [
    "Vinson, William E.",
    "McGilliard, Michael L.",
    "Keenan, Thomas W.",
    "Duncan, Susan E.",
    "Webb, Kenneth E. Jr.",
    "Herbein, Joseph H. Jr."
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:07:38Z",
  "date_adate": "1998-01-26",
  "date_available": "2014-03-14T20:07:38Z",
  "date_issued": "1997-12-17",
  "date_rdate": "1999-01-26",
  "date_sdate": "1997-12-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The potential for enhancing oleic acid (cis-18:1) and linoleic acid (18:2) content and  lowering medium chain fatty acid (MCFA) content of bovine milk was investigated by abomasal infusion or dietary supplementation of oils. In experiment 1, olive oil, sesame oil, sunflower oil, or fish oil was abomasally infused (155 to 219 g/d) into Jersey cows during the last 6 d of each of four 14-d periods. In experiment 2, canola oil, olive oil, high-oleic sunflower oil, or distilled water (control) was abomasally infused (342 to 371 g/d) into three Holsteins and three Jerseys during the last 5 d of each of four 10-d periods. The intestinal digestibility and concentration of cis-18:1 and 18:2 in milk were proportional to flow of these fatty acids to the duodenum. Also, greater concentration of cis-18:1 in milk was associated with lowered yield of MCFA. During olive oil or sesame oil infusion in experiment 1, for each 100 g of cis-18:1 infused into the abomasum, milk cis-18:1 yield was increased by an average of 47 g, and MCFA yield was reduced by 42 g. The yield of 18:2 in milk was increased by approximately 46 g for each 100 g of infused 18:2 during olive oil or sesame oil infusion. Milk produced during sesame oil infusion, however, had an off-flavor when evaluated by a taste panel. In experiment 2, each 100 g of cis-18:1 infused daily increased milk cis-18:1 yield in Holsteins and Jerseys by 41 and 39 g/d, respectively, whereas recovery of infused 18:2 was 34 g/d for Jerseys and 42 g/d for Holsteins. In experiment 3, 22 Jersey cows were fed a basal diet, or the basal diet supplemented with 3.5% high-oleic canola oil, 3.5% soybean oil, or 1.75% high-oleic canola oil plus 1.75% soybean oil for 5 wk. Dietary canola oil supplementation increased conjugated linoleic acid (CLA) percentage in milk to a moderate level without raising trans-18:1 percentage, whereas feeding either supplement containing soybean oil raised both CLA and trans-18:1 percentages. Concentrations of trans-18:1 and CLA in milk apparently reflected the extent of unsaturated fatty acid biohydrogenation in the rumen. Dietary supplementation with canola oil increased yield of cis-18:1 in milk by 21 g for each 100 g of supplemental cis-18:1 intake. Yield of 18:2 in milk was raised by 3 g for each 100 g of supplemental 18:2 intake by cows fed soybean oil. Using abomasal infusion as an indicator of the maximum potential for apparent recovery of cis-18:1 in milk (39 to 49%), cis-18:1 recovery in response to supplemental cis-18:1 in the diet was approximately half of the potential response due to partial biohydrogenation in the rumen. The apparent recovery of dietary 18:2 in milk was reduced to only one-tenth of the potential yield (31 to 47%) indicated by abomasal infusion of seed oils. Results indicated that the fatty acid profile of bovine milk was altered in a manner that would be beneficial to human health when cows were fed supplemental oleic acid, but further research should focus on safe and economical methods to protect dietary unsaturated fatty acids from biohydrogenation.",
  "description_provenance": [
    "Author Email: abandara@vt.edu",
    "Advisor Email: herbeinj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:38Z (GMT). No. of bitstreams: 1 ETD.PDF: 332352 bytes, checksum: eb3b752a49444e1865a1671c242e10cf (MD5)   Previous issue date: 1997-12-17"
  ],
  "handle": "26254",
  "identifier_other": "etd-02198-162042",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02198-162042/",
  "identifier_uri": "http://hdl.handle.net/10919/26254",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "oleic acid",
    "linoleic acid",
    "medium chain fatty acids",
    "abomasal infusion",
    "milk flavor"
  ],
  "title": "Modifying Fatty Acid Composition of Bovine Milk by Abomasal Infusion or Dietary Supplementation of Seed Oils or Fish Oil",
  "type": "Dissertation"
}