{
  "contributor_author": "Susuwele-Banda, William John",
  "contributor_committeechair": "Tlou, Josiah S.",
  "contributor_committeemember": [
    "Barksdale, Mary Alice",
    "Wilkins, Jesse L. M.",
    "Kelly, Patricia Proudfoot",
    "Niles, Jerome A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:40Z",
  "date_adate": "2005-03-07",
  "date_available": "2014-03-14T20:07:40Z",
  "date_issued": "2005-01-30",
  "date_rdate": "2005-03-07",
  "date_sdate": "2005-02-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated teachersâ   perceptions of classroom assessment in mathematics and their current classroom assessments practices. Specifically, the study sought to gain an understanding of the extent to which teachers use different classroom assessment methods and tools to understand and to support both the learning and teaching processes. The following three questions guided the study: 1) How do primary school teachers perceive classroom assessment in mathematics?  2) What kinds of assessment methods and tools do teachers use to assess their students in mathematics? 3) What is the influence of teachersâ   perceptions of classroom assessment on their classroom assessment practices? The study used a questionnaire to establish the teachersâ   perceptions of classroom assessment in mathematics, a lesson observation protocol, and pre-lesson and post-lesson observation interview protocols as main sources of data collection. The data collected through observations and interviews helped to map out patterns between perceptions of classroom assessment and the teachersâ   classroom assessment practices. Document analysis was used to triangulate the information collected through observations and interviews. In addition, document analysis provided first hand information on the kind of written feedback students get and the nature of activities they do. A total of six teachers (three male and three female) were drawn from two primary schools in Malawi.  <p> The data suggest that teachers perceive classroom assessment as tests that teachers give to their students at specified time intervals. What teachers said about their teaching was not reflected during their teaching. Since teachers perceived classroom assessment as tests, they showed limited ability to use different methods and tools to assess their students while teaching.  <p> The teachersâ   perceptions of classroom assessment have influence on their classroom assessment practices. Five of the six teachers perceived assessment as testing, and classroom assessment practices were not clearly embedded in their teaching.  <p> Teacher experience and teacher education program did not seem to contribute much to teachersâ   perceptions of classroom assessment; however, teacherâ  s academic qualification seemed to influence teachersâ   flexibility to accept new ideas.",
  "description_provenance": [
    "Author Email: wsusuwel@vt.edu",
    "Advisor Email: mbarksda@vt.edu",
    "Advisor Email: wilkins@vt.edu",
    "Advisor Email: tlou@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:40Z (GMT). No. of bitstreams: 1 wjs-b_dissertation_JAN2005.pdf: 634253 bytes, checksum: 27d84554b49b325e8a5268433db99ec1 (MD5)   Previous issue date: 2005-01-30"
  ],
  "handle": "26269",
  "identifier_other": "etd-02212005-131851",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02212005-131851/",
  "identifier_uri": "http://hdl.handle.net/10919/26269",
  "publisher": "Virginia Tech",
  "relation_haspart": "wjs-b_dissertation_JAN2005.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "monitoring learning",
    "constructing knowledge",
    "testing",
    "assessment model",
    "factors influencing assessment",
    "lesson evaluation",
    "participatory learning",
    "primary mathematics"
  ],
  "title": "Classroom Assessment in Malawi: Teachersâ   Perceptions and Practices in Mathematics",
  "type": "Dissertation"
}