{
  "contributor_author": "Santiago, Hector Luis",
  "contributor_committeechair": "Denbow, Donald Michael",
  "contributor_committeemember": [
    "Denbow, Cynthia J.",
    "Graham, Paul P.",
    "Hohenboken, William D.",
    "Emmerson, Derek A."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:07:40Z",
  "date_adate": "2002-02-22",
  "date_available": "2014-03-14T20:07:40Z",
  "date_issued": "2002-02-07",
  "date_rdate": "2003-02-22",
  "date_sdate": "2002-02-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A series of experiments were conducted to investigate the effects of certain biological, nutritional, and processing factors on breast meat quality of broilers.  In the first experiment, the influence of genetic strain, plane of nutrition, and age at slaughter on breast meat quality was evaluated.  Breast meat from a high yield line of broilers had lower pH at 24 h postmortem (PM), greater L*, a*, and b* values, lower water holding capacity (WHC), and higher expressible moisture (EM) than those of a line selected for rapid growth.  Breast meat from birds processed at 42 d had lower WHC than those processed at 53 d, even though no differences in pH and L* values at 24 h were observed.  No significant effects due to plane of nutrition on meat quality traits were observed. In Experiment two, the influence of strain and chilling methods (ice or air chilled) on breast meat quality was studied in broilers.  Breast meat quality significantly differed among strains, with one of the strains evaluated having higher muscle pH, lower L* values, and higher WHC than the other strains.  Ice-water chilling significantly reduced the rate and extent of PM pH decline, but had significantly lower WHC and higher EM than those from carcasses chilled by air.  However, chilling conditions did not influence breast meat color.  In Experiment three, the effects of strain and gender on breast muscle quality of broilers was studied.  Meat quality traits were evaluated on both sexes of six genetic crosses of commercial strains.  No significant differences in breast meat quality traits among strains were observed.  However, differences between sexes were highly significant.  The P. major muscles of females had lower pH values at all PM times, higher L*, a*, and b* values, and lower WHC than males.  The P. minor of females had significantly lower pH, lower WHC, higher EM, but similar color L*, a*, and b* values than males.  In Experiment four, the effects of strain, gender, and age at slaughter on breast meat quality were studied. \tStrain differences were observed in both sexes, but these differences did not show any specific relationship with the strain genotype.  Breast muscles from a male pure line had superior meat quality, with higher muscle pH, and WHC, but higher L* values than the other strains.  Significant differences in breast meat quality traits due to age at slaughter were also observed.  Regardless of gender, breast muscle pH at 24 h PM and WHC decreased linearly with age, while breast muscle temperature and L* values increased in a linear fashion with advancing age at slaughter.  No significant strain by age interactions were observed for any of the meat quality traits evaluated. The results of these studies indicate that commercial genotypes differ significantly in PM  muscle metabolism and subsequent meat quality.  The results also indicate that female broilers and older birds might be more susceptible to meat quality problems.",
  "description_provenance": [
    "Author Email: hsantiag@vt.edu",
    "Advisor Email: cdenbow@vt.edu",
    "Advisor Email: grahamp@vt.edu",
    "Advisor Email: whohenbo@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Advisor Email: demmerson@aviagen.com",
    "Made available in DSpace on 2014-03-14T20:07:40Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 564052 bytes, checksum: 37f0344f8734ca1f763ad2b12729b326 (MD5)   Previous issue date: 2002-02-07"
  ],
  "handle": "26267",
  "identifier_other": "etd-02212002-113821",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02212002-113821/",
  "identifier_uri": "http://hdl.handle.net/10919/26267",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "color",
    "pH",
    "broiler",
    "PSE",
    "meat quality"
  ],
  "title": "Biological, Nutritional, and Processing Factors Affecting Breast Meat Quality of Broilers",
  "type": "Dissertation"
}