{
  "contributor_author": "Arellano Ogaz, Eduardo",
  "contributor_committeechair": "Fox, Thomas R.",
  "contributor_committeemember": [
    "Daniels, Walter Lee",
    "Evanylo, Gregory K.",
    "Aust, Wallace Michael",
    "Burger, James A."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:07:39Z",
  "date_adate": "2009-04-08",
  "date_available": "2014-03-14T20:07:39Z",
  "date_issued": "2009-01-12",
  "date_rdate": "2010-04-08",
  "date_sdate": "2009-02-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Application of biosolids as an alternative source of Nitrogen (N) is becoming a common silviculture practices on loblolly pine forest. However, little is known about how biosolids type, application rate, and timing affect forest floor and soil N availability in pine plantations. The objectives of this study were to determine the effect of different types, rates, and season of application of biosolids on forest floor and soil N. The study was established in a 17-year-old loblolly pine plantation in Amelia County, VA. Anaerobically digested (AD225), lime stabilized (LS225), and pelletized (Pellet225) biosolids and a conventional inorganic urea plus diammonium phosphate fertilizer (U+DAP225) were surface applied at a rate of 225 kg ha-1 based on Plant Available Nitrogen (PAN) between March 5th and 10th, 2006. Anaerobically digested biosolids were also surface applied at the rates of 900 kg PAN ha-1 and 1800 kg PAN ha-1 (AD900 and AD1800). Anaerobically digested biosolids at the rate of 900 kg PAN ha-1 were also applied on November 5th, 2005 (AD900F). <p> Surface application of different type of biosolids in a loblolly pine plantation increased soil N availability and mineralization when biosolids were applied at the permitted rate of 225 kg PAN ha-1. Surface soil NH4-N and NO3-N availability and N mineralization was significantly different among biosolids type over time. N release from different type of biosolids depends on the initial inorganic N content, and N mineralization in biosolids. The average soil N availability and mineralization was significantly greater in the Pellet225 treatments than in all the other treatments. Soil N availability decreased in winter in all the treatments but remained generally higher than the control until the end of the second growing season. Nitrate-N concentrations in lysimeters were below water quality standard limits in all the treatments applied at the rate of 225 kg PAN ha-1. Accumulation of N, C, and Ca in the forest floor was well correlated with the amount of biosolids applied on each treatment. The surface application of different type of biosolids had minimal impact upon total N and C in the mineral soil. Increasing application rates of anaerobically digested biosolids directly increased soil N availability and mineralization. Nitrate-N concentrations in lysimeters were above water quality standards limits during several months in the AD900 and AD1800 treatments. Significant differences in the forest floor total N, C and Ca were observed with increasing application rates of biosolids. Total C accumulation was significantly higher in the forest floor in the AD1800 treatment. However, we observed no effect on soil total C with increasing application rates of biosolids. We found that biosolids application during spring significantly increased soil extractable N, N mineralization, NO3-N leaching, and total C in the mineral soil in comparison to the fall application. Fall application significantly increased NH4-N leaching and soil extractable Ca. We observed no significant effect on ion exchangeable N measured on membranes, total N, C, Ca, and pH measured in the forest floor, and soil total N and pH in the mineral soil. Our results demonstrated that permitted surface application of biosolids at the rate of 225 kg PAN ha-1 in a loblolly pine plantation increased surface soil N availability without increasing the potential for NO3-N groundwater pollution.",
  "description_provenance": [
    "Author Email: earellan@uc.cl",
    "Advisor Email: trfox@vt.edu",
    "Advisor Email: wdaniels@vt.edu",
    "Advisor Email: gevanylo@vt.edu",
    "Advisor Email: waust@vt.edu",
    "Advisor Email: Jaburger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:39Z (GMT). No. of bitstreams: 1 FINALARELLANO.pdf: 1976080 bytes, checksum: 442ea6e931684c12c44a5f24fbc6c7e1 (MD5)   Previous issue date: 2009-01-12"
  ],
  "handle": "26262",
  "identifier_other": "etd-02202009-103316",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02202009-103316/",
  "identifier_uri": "http://hdl.handle.net/10919/26262",
  "publisher": "Virginia Tech",
  "relation_haspart": "FINALARELLANO.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "forest fertilization",
    "Nitrogen leaching",
    "Nitrogen mineralization",
    "biosolids",
    "Loblolly pine (Pinus Taeda L.)"
  ],
  "title": "Changes in Soil Nitrogen Following Biosolids Application to Loblolly Pine (Pinus Taeda L.) Forest in the Virginia Piedmont",
  "type": "Dissertation"
}