{
  "contributor_author": "Drewry, Julie Anne",
  "contributor_committeechair": "Burge, Penny L.",
  "contributor_committeemember": [
    "Bodenhorn, Nancy E.",
    "Driscoll, Lisa G.",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:39Z",
  "date_adate": "2007-03-15",
  "date_available": "2014-03-14T20:07:39Z",
  "date_issued": "2007-02-12",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-02-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> The purpose of this study was to record and analyze students' experiences with dropping out of high school within a social capital framework. Discussing the stories of high school dropouts provided valuable information related to the root causes of dropout behaviors in a social capital context. This information can be used to develop programs designed to increase social capital in schools, families, and communities, which can contribute to a decrease in dropout behaviors. </p><p>\tThis phenomenological study took a narratological research approach that focused on collecting the lived experiences of high school dropouts within a social capital framework. The context of this study was a high school in an urban school division in Southwestern Virginia. The participants were five high school dropouts who speak English as a primary language and were a part of the general education population at the high school. Triangulation of data sources included field notes, interviews with the participants, and archival documents. A three-iteration code mapping procedure was used for data analysis to provide an audit trail. </p><p>\tNarrative descriptions of the life histories of each participant were written. The overarching themes resulting from the analysis across the narratives were that none of the students had relationships with members of their families or communities who had the capacity to assist them in their endeavors to complete school; students had the desire to complete school or obtain a GED, but did not have a relationship with any person outside of the school setting who was persistent with encouragement and knowledge; and the students had access to social capital, but did not understand how to use it effectively. Results and conclusions are included in two articles, one written for publication in Sociology of Education, and the other written for publication in Professional School Counseling.</p>",
  "description_provenance": [
    "Author Email: jdrewry@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:39Z (GMT). No. of bitstreams: 1 DrewryETD.pdf: 650208 bytes, checksum: e9a85c322913abd255442957f68898f8 (MD5)   Previous issue date: 2007-02-12"
  ],
  "handle": "26260",
  "identifier_other": "etd-02202007-181201",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02202007-181201/",
  "identifier_uri": "http://hdl.handle.net/10919/26260",
  "publisher": "Virginia Tech",
  "relation_haspart": "DrewryETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "dropout",
    "school completion",
    "social capital",
    "school counseling",
    "high school"
  ],
  "title": "High School Dropout Experiences: A Social Capital Perspective",
  "type": "Dissertation"
}