{
  "contributor_author": "Onyewu, Chinonyerem  Nonye Chidozie",
  "contributor_committeechair": "O'Reilly, Patrick A.",
  "contributor_committeemember": [
    "Eschenmann, Konrad Kurt",
    "Lichtenberger, Eric J.",
    "Whitacre, Brian E."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:07:40Z",
  "date_adate": "2009-03-18",
  "date_available": "2014-03-14T20:07:40Z",
  "date_issued": "2009-02-06",
  "date_rdate": "2009-03-18",
  "date_sdate": "2009-02-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "To decrease the steady rise in the prison population, we must deter ex-offenders from re-offending and recidivating, once they have been released.  For ex-offenders, finding employment is critical to successful post-release re-integration which can help reduce the chances of them recidivating.  Ex-offenders who are consistent in their employment patterns are less likely to return to a life of crime.  This study investigated the relative importance and significance of 11 selected variables on four separate levels of employment consistency.  The selected variables were chosen based on what has been identified in the literature as effecting employment patterns of ex-offenders and the general population, and what data was reliable and available.  The study group consisted of 2,314 male Virginia ex-offenders released in fiscal year 2001.  The results revealed that the variables of time served, career and technical education program completions, educational level, age at release, race, and being convicted of a violent offense were positive predictors of employment consistency.  On the other hand, having a record of minor infractions and being a repeat offender were associated with decreasing employment consistency in the analysis.  The findings of the study suggest that it is important for offenders to make changes in the ways they think and their attitudes.  This can be accomplished by taking advantage of opportunities in prison to participate in rehabilitative services and educational programs.  In addition, as offenders get older they tend to abandon criminal ways of thinking, and once released they are more apt to stay employed.  Furthermore, the influence of the race variable did not affect the study group of ex-offenders as anticipated.",
  "description_provenance": [
    "Author Email: nonyewu@vt.edu",
    "Advisor Email: oreilly@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Advisor Email: elichten@vt.edu",
    "Advisor Email: brian.whitacre@okstate.edu",
    "Made available in DSpace on 2014-03-14T20:07:40Z (GMT). No. of bitstreams: 1 Nonye_Onyewu_Dissertation_Final_version.pdf: 505844 bytes, checksum: bbed260a8d4b5b593ad4fecd1e212e1b (MD5)   Previous issue date: 2009-02-06"
  ],
  "handle": "26264",
  "identifier_other": "etd-02202009-131738",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02202009-131738/",
  "identifier_uri": "http://hdl.handle.net/10919/26264",
  "publisher": "Virginia Tech",
  "relation_haspart": "Nonye_Onyewu_Dissertation_Final_version.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "recidivism",
    "consistent employment",
    "career and technical education in prison",
    "ex-offender race",
    "negative behavior",
    "ex-offender attitudes",
    "ex-offenders",
    "employment consistency",
    "employment"
  ],
  "title": "The Relative Importance of Selected Variables on the  Employment Consistency of Virginia Ex-Offenders",
  "type": "Dissertation"
}