{
  "contributor_author": "Schneller, Debora P.",
  "contributor_committeechair": "Arditti, Joyce A.",
  "contributor_committeemember": [
    "Cross, Lawrence H.",
    "Johnson, Scott W.",
    "Uttech, Melanie R.",
    "Benson, Mark J."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:07:40Z",
  "date_adate": "2002-03-28",
  "date_available": "2014-03-14T20:07:40Z",
  "date_issued": "2001-12-17",
  "date_rdate": "2003-03-28",
  "date_sdate": "2002-02-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Untitled Document</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <p>The purpose of this study was to examine the complex process adults traverse    in their passage through divorce and in their establishment of post-divorce    intimate relationships. The goal of this work was to describe how adults interpret    their divorce experience, particularly in terms of how it connects with their    ideas about intimacy and post-divorce intimate relationships. <br>   <br>   Four theoretical frameworks guided this study. Social constructionism provided    a framework for understanding that reaction to a divorce may be impacted by    language, in terms of the explanations an individual makes, by social interchange    with others, and by the cultural meanings of marriage and divorce that have    influenced a person's thinking and perceptions. Attribution theory contributed    a systematic approach to understanding how people may construe their divorce    in ways that may damage trust, promote a sense of mastery and optimism regarding    future relationships, or encourage creative change. Attachment theory provided    a conceptual basis for examining the interplay between stability and change    in adult conceptualizations of intimate relationships, processes that underlie    how adults cope with changing interpersonal situations. Finally, theories of    loss and renewal offered a conceptual basis for understanding how reactions    to loss evolve over time, and enter post-divorce relationships.<br>   <br>   Data were collected through semi-structured interviews with 21 divorced men    and women. Analysis of data was guided by the research questions and structured    by a phenomenological approach to the analysis of themes and variations of themes    found in the interviews. Peer review and triangulation of data were used to    ensure trustworthiness in the findings.<br>   <br>   This study contributes new understandings about the connection between divorce    experiences and post-divorce intimacy. Three conclusions can be drawn from this    study. First, data analysis revealed divorce served consistently as a catalyst    for interpretation and personal growth. An important component of this interpretive    endeavor was the social context within which divorce occurred. Because divorce    still carries some stigma in our society, divorce provided a challenge to create    positive meanings from this experience.<br>   <br>   Second, the idiosyncratic understandings developed through the interpretive    process shaped adults' post-divorce perceptions and experiences in intimate    relationships. From the attributions made regarding causes of divorce, these    adults claim to have made deliberate changes in communication patterns, interactions,    attitudes, and expectations from self and partner in intimate relationships.    <br>   <br>   Third, during this process, some fundamental shifts in mental representations    occurred. Changes were linked to gender, with women viewing themselves as more    assertive in relationships, and men viewing themselves as more egalitarian and    responsible for relationship maintenance. <br> </p> </body> </html>",
  "description_provenance": [
    "Author Email: dschnell@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: swj@vt.edu",
    "Advisor Email: muttech@vt.edu",
    "Advisor Email: mbenson@vt.edu",
    "Advisor Email: arditti@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:40Z (GMT). No. of bitstreams: 1 DSfinal.pdf: 1013160 bytes, checksum: 244a1f28071e9a28ce190678c1af8886 (MD5)   Previous issue date: 2001-12-17"
  ],
  "handle": "26268",
  "identifier_other": "etd-02212002-141941",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02212002-141941/",
  "identifier_uri": "http://hdl.handle.net/10919/26268",
  "publisher": "Virginia Tech",
  "relation_haspart": "DSfinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "divorce",
    "marriage",
    "post-divorce intimacy",
    "gender",
    "qualitative",
    "interpretation"
  ],
  "title": "After the Breakup:  Adult Perceptions and Expectations of Post-Divorce Intimate Relationships",
  "type": "Dissertation"
}