{
  "contributor_author": "Horkey, Cynthia",
  "contributor_committeecochair": [
    "Hayhoe, Celia Ray",
    "Beamish, Julia O."
  ],
  "contributor_committeemember": [
    "White, Alex A.",
    "Anong, Sophia"
  ],
  "contributor_department": "Housing, Interior Design, and Resource Management",
  "date_accessioned": "2014-03-14T20:07:40Z",
  "date_adate": "2009-03-18",
  "date_available": "2014-03-14T20:07:40Z",
  "date_issued": "2009-02-06",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-02-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examined the relationship between demographics, attitudes, and subjective norms (influences) on Virginia adults over 50 with at least one adult child and the presence of estate planning documents. The Theory of Reasoned Action (Azjen & Fishbein, 1980) was applied using a secondary data set of 189 participants. Regression analyses examined paths from external variables (demographics), attitudes toward the behavior, and subjective norms to the intention and behavior. Intention and behavior were defined as the possession, intention to possess, and non-intention to possess estate planning documents. Asset-focused documents included Will, Living Trust, Durable Power of Attorney for Financial Issues, and the Letter of Instruction. Health care-focused documents included Living Will and the Durable Power of Attorney for Health Care. An analysis was also conducted on the possession of a complete set of estate planning documents. <p>  Older persons were more likely to possess all documents except the Letter of Instruction. Respondents with higher assets were more likely to possess a Will. Respondents who were more educated were more inclined to possess a Living Will. Respondents that had informally promised property to their children were more likely to possess a Living Trust. <p>  Younger respondents were more likely to intend to possess a Will, the Durable Power of Attorney for Health Care, and the Living Will. Persons with lower assets were more likely to intend to possess a Will, and those with a goal for privacy in financial affairs and who believed they should help their adult children financially were more likely to intend to possess a Living Trust. <p>  Participants who intended to possess a Letter of Instruction were more educated, male, owned homes, and had a goal for privacy in financial affairs. Age (younger) was an indirect influence to the Letter of Instruction, mediated through the goal to leave family financial security.<p>  Participants with lower assets and in good emotional health did not have intention to possess a Living Trust. Male gender and owning a home were influences on not intending to possess a Durable Power of Attorney for Financial Issues. Males were less likely to have a Letter of Instruction. Respondents with the goal to leave an inheritance were more likely to have non-intention to possess the Durable Power of Attorney for Health Care and Durable Power of Attorney for Financial Issues. More education, lower income, and residing with a relative were mediated influences to the Durable Powers of Attorney for Health Care and for Financial Issues through the goal to leave inheritance.<p>  Respondents that were older, had more assets, owned homes, had a goal to leave an inheritance, and that had informally promised their property were more likely to possess more estate documents. Indirect paths to having a set of estate planning documents were more education, lower income, and residing with a relative, which were mediated through the goal to leave inheritance. <p>  The low number of estate planning documents respondents had and the lack of intention to obtain estate planning documents indicate a need for further education in the areas of estate planning. The occurrence of older age as an influence, particularly with health care-focused documents, indicates a need for more awareness in younger adults of their vulnerability, at any age, to illness or injury and that medical directives should be in place.",
  "description_provenance": [
    "Author Email: chorkey@vt.edu",
    "Advisor Email: axwhite@vt.edu",
    "Advisor Email: chayhoe@vt.edu",
    "Advisor Email: jbeamish@vt.edu",
    "Advisor Email: sanong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:40Z (GMT). No. of bitstreams: 1 HorkeyDissertation.pdf: 1843569 bytes, checksum: 1ba7c7c9b522e8096628d469533b29e9 (MD5)   Previous issue date: 2009-02-06"
  ],
  "handle": "26263",
  "identifier_other": "etd-02202009-103925",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02202009-103925/",
  "identifier_uri": "http://hdl.handle.net/10919/26263",
  "publisher": "Virginia Tech",
  "relation_haspart": "HorkeyDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Living Trust",
    "Will",
    "Estate planning",
    "Living Will",
    "The Theory of Reasoned Action",
    "Durable Power of Attorney for Health Care",
    "Letter of Instruction",
    "Durable Power of Attorney for Financial Issues"
  ],
  "title": "Estate Planning Documents In Virginia Among Adults 50 And Over With At Least One Adult Child",
  "type": "Dissertation"
}