{
  "contributor_author": "Yu, Bin",
  "contributor_committeechair": "Rakha, Hesham Ahmed",
  "contributor_committeemember": [
    "Trani, Antoino A.",
    "Teodorovic, Dusan",
    "Kachroo, Pushkin",
    "Hobeika, Antoine G."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:07:41Z",
  "date_adate": "2005-03-22",
  "date_available": "2014-03-14T20:07:41Z",
  "date_issued": "2005-02-04",
  "date_rdate": "2006-03-22",
  "date_sdate": "2005-02-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Roadway grades have a diverse effect on vehicle speeds, depending on vehicle and roadway characteristics. For example, passenger cars can generally negotiate grades of 5 percent or less without considerable reductions in vehicle speeds, while heavy-duty trucks are affected significantly by grades because of their inferior operating capability. Consequently, due to the potential significant speed differential between automobiles and heavy-duty trucks, these trucks can have a significant impact on the quality of flow, throughput, and safety of a traffic stream. Truck climbing lanes are typically constructed in an attempt to lessen this negative impact. Currently, the American Association of State Highway and Transportation Officials (AASHTO) and Highway Capacity Manual (HCM) represent the state-of-art and state-of-practice procedures for the design of truck climbing lanes. These procedures only consider the tangent vertical profile grades in the design of climbing lanes and do not capture the impact of vertical curvature on truck performance. The dissertation describes the TruckSIM framework for modeling vehicle motion along roadway sections by considering both the longitudinal and lateral forces acting on a vehicle. In doing so, the tool reflects the impact of horizontal and vertical alignment on a vehicleâ  s longitudinal motion. The model is capable of reading Global Positioning System (GPS) (longitude, latitude, and altitude), roadway, and vehicle data. The dissertation demonstrates the validity of the software modeling procedures against field data and the HCM procedures. It is anticipated that by automating the design procedures and considering different vehicle and roadway characteristics on truck motion, the TruckSIM software will be of considerable assistance to traffic engineers in the design of roadways. The Global Positioning System (GPS) was originally built by the U.S. Department of Defense to provide the military with a super-precise form of worldwide positioning. With time, GPS units were introduced into the civilian domain and provided transportation professionals with an opportunity to capitalize on this unique instrumentation. With this GPS capability, this research investigates the feasibility of using inexpensive WAAS-capable units to estimate roadway vertical and horizontal profiles. The profiles that are generated by these inexpensive units (less than $500) are compared to the profiles generated by expensive carrier-phase DGPS units ($30,000 per unit including the base station). The results of this study demonstrate that the use of data smoothing and stacking techniques with the WAAS data provides grade estimates that are accurate within 10% of those generated by the carrier-phase DGPS units and thus offer a cost effective tool for providing input data to the TruckSIM software. Using the TruckSIM software, this research effort investigates truck performance reflective of various truck and road characteristics. These characteristics include vehicle engine power, weight-to-power ratio, pavement type, pavement condition, aerodynamic aid features, engine efficiency, tire type, and percentage mass on tractive axle. The study demonstrates that the vehicle weight-to-power ratio, vehicle engine power, pavement surface condition, tire type, aerodynamic aids, and engine efficiency are critical factors in the design of truck climbing lanes.",
  "description_provenance": [
    "Author Email: byu@vt.edu",
    "Advisor Email: vuela@vt.edu",
    "Advisor Email: duteodor@vt.edu",
    "Advisor Email: pkachroo@vt.edu",
    "Advisor Email: hrakha@vt.edu",
    "Advisor Email: hobeika@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:41Z (GMT). No. of bitstreams: 1 BinYu_Dissertation.pdf: 2036540 bytes, checksum: 085f0008d8a3e09a075a8aad9d58df9e (MD5)   Previous issue date: 2005-02-04"
  ],
  "handle": "26276",
  "identifier_other": "etd-02222005-205027",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02222005-205027/",
  "identifier_uri": "http://hdl.handle.net/10919/26276",
  "publisher": "Virginia Tech",
  "relation_haspart": "BinYu_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "AASHTO",
    "Global Positioning System",
    "Highway Capacity Manual",
    "Truck Performance",
    "TruckSIM"
  ],
  "title": "Modeling Truck Motion along Grade Sections",
  "type": "Dissertation"
}