{
  "contributor_author": "Snead, John David",
  "contributor_committeechair": "Hult, Karen M.",
  "contributor_committeemember": [
    "Rees, Joseph V.",
    "Gooden, Susan T.",
    "Dudley, Larkin S.",
    "Wamsley, Gary L."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:07:41Z",
  "date_adate": "2000-02-24",
  "date_available": "2014-03-14T20:07:41Z",
  "date_issued": "2000-02-07",
  "date_rdate": "2001-02-24",
  "date_sdate": "2000-02-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "AN INQUIRY INTO THE EFFECTS OF STATUTORY CLIMATE ON THE POLITICAL ATTITUDES AND BEHAVIOR OF STATE-LEVEL PUBLIC ADMINISTRATORS  John David Snead  Committee Chair:  Karen Hult Center For Public Administration and Policy College of Architecture and Urban Studies (ABSTRACT)       This dissertation examines ways in which differences in states' political activity laws affect the political attitudes and reported behavior of senior state government employees.  Of particular concern is whether a stringent little Hatch Act engenders any \"chilling effects\" that may lead these workers to shy away from permissible political activities.<p>      The study included officials employed in Pennsylvania, which has a restrictive political activity statute, and New Jersey, which has generally permissive laws.  Mail questionnaires were sent to 962 officials, 512 from Pennsylvania and 450 from New Jersey.  Responses were received from 582 employees, yielding a 61.91% response rate.<p>      Compared to New Jersey officials, those from Pennsylvania were less knowledgeable about their state's political activity laws.  The  Pennsylvania employees also reported being less politically active and less satisfied with their activity, and were more likely to indicate that they would increase their level of political activity if state prohibitions were eliminated.  However, compared to their New Jersey counterparts, these officials were no less inclined to engage in permissible political activities.  This finding casts doubt on the notion that a highly restrictive statutory climate spawns chilling effects.",
  "description_provenance": [
    "Author Email: johnsnead@hotmail.com",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: goodens@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:41Z (GMT). No. of bitstreams: 1 dissertation.pdf: 864883 bytes, checksum: 2bb73f2a417214ed70fc06fe1162b907 (MD5)   Previous issue date: 2000-02-07"
  ],
  "handle": "26272",
  "identifier_other": "etd-02222000-16350005",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02222000-16350005/",
  "identifier_uri": "http://hdl.handle.net/10919/26272",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "little Hatch Acts",
    "chilling effects",
    "political activity"
  ],
  "title": "An Inquiry Into the Effects of Statutory Climate on the Political Attitudes and Behavior of State-Level Public Administrators",
  "type": "Dissertation"
}