{
  "contributor_author": "Limon, Susana Dinkins",
  "contributor_committeechair": "Khademian, Anne Meredith",
  "contributor_committeemember": [
    "Wolf, James F.",
    "Woodard, Colleen",
    "Eikenberry, Angela M."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:07:41Z",
  "date_adate": "2007-04-12",
  "date_available": "2014-03-14T20:07:41Z",
  "date_issued": "2007-02-12",
  "date_rdate": "2007-04-12",
  "date_sdate": "2007-02-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation looks at the role narratives play in addressing organizational challenges by facilitating a collective assignment of meaning to those challenges that allows for problem solving, or at least a way to cope with the challenges.  Specifically, the research examines how informal knowledge is embedded in organizations in the form of narratives, and how narratives are used to transfer knowledge across the organization.  The dissertation develops the  concept of narrative, and the qualities of the narratives used in this dissertation, focused on events, focused on people, focused on values, and it develops an understanding of knowledge transfer as the collective assignment of meaning to challenges that are constantly emerging.  In this case study, three means, or tools emerge as facilitating the assignment of meaning.  These tools are superstars, indexing, and knowledge objects.  This research will enrich the public administration and nonprofit literature by utilizing narrative inquiry to examine the transfer of knowledge in a nonprofit social service organization that serves a vital public purpose under contracts with various levels of government.",
  "description_provenance": [
    "Author Email: limons@yahoo.com",
    "Advisor Email: akhademi@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: cwoodard@fed-tech.com",
    "Advisor Email: aeik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:41Z (GMT). No. of bitstreams: 1 Limon.pdf: 778891 bytes, checksum: b7ca346c08419e6cee693a6dd166a12d (MD5)   Previous issue date: 2007-02-12"
  ],
  "handle": "26278",
  "identifier_other": "etd-02222007-204522",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02222007-204522/",
  "identifier_uri": "http://hdl.handle.net/10919/26278",
  "publisher": "Virginia Tech",
  "relation_haspart": "Limon.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Storytelling",
    "Collective Assignment of Meaning",
    "Knowledge Transfer",
    "Narrative Inquiry",
    "Informal Knowledge"
  ],
  "title": "Knowledge Transfer through Narratives in an Organization",
  "type": "Dissertation"
}