{
  "contributor_author": "Marciu, Daniela",
  "contributor_committeechair": "Heflin, James R.",
  "contributor_committeemember": [
    "Zallen, Richard H.",
    "Indebetouw, Guy J.",
    "Dorn, Harry C.",
    "Ritter, Alfred L."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:07:42Z",
  "date_adate": "1999-02-23",
  "date_available": "2014-03-14T20:07:42Z",
  "date_issued": "1999-02-09",
  "date_rdate": "1999-02-23",
  "date_sdate": "1999-02-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <body>  <p>Abstract  <p>Two experimental methods, optical limiting and degenerate four-wave mixing, are employed to study the nonlinear optical properties of various novel fullerenes structures. Optical limiting refers to decreased transmittance of a material with increased incident light intensity. Detailed measurements of the wavelength-dependence of fullerene optical limiters have illustrated several key features of reverse saturable absorption. Most important among these is the requirement of weak but non-negligible ground state absorption. We have shown that the optical limiting performance of C<sub>60</sub> can be extended into the near infrared range by appropriate modifications of the structure such as higher cage fullerenes or derivatization of the basic C<sub>60</sub> molecule. The higher cage fullerene C<sub>76</sub> shows improved optical limiting behavior compared to C<sub>60</sub>, for wavelengths higher than 650 nm, but becomes a weak limiter in the 800 nm range. C<sub>84</sub>, even at  high concentrations in [alpha]-chloronaphthalene, does not reach the good performance of C<sub>60</sub>, but instead shows weak optical limiting  in the 800 nm range. <p>We also demonstrate that by attaching various groups to the C<sub>60</sub> molecule, we can extend the optical limiting performance in the near infrared regime. The C<sub>60</sub> derivatives studied, (C<sub>60</sub> cyclic ketone, C<sub>60</sub> secondary amine, C<sub>60</sub>CHC<sub>6</sub>H<sub>4</sub>CO<sub>2</sub>H, and C<sub>60</sub>C<sub>4</sub>H<sub>4</sub>(CH<sub>3</sub>)CH<sub>2</sub>O<sub>2</sub>C(CH<sub>2</sub>)CO<sub>2</sub>H), have a similar characteristic: the attached groups cause a symmetry-breaking of the C<sub>60</sub> sphere and, therefore, there are new allowed transitions that appear as absorption features up to 750 nm. The optical limiting measurements show that these materials, even for low input energies, have an exceptionally strong optical limiting response in the 640 to 750 nm spectral region. For wavelengths higher than 800 nm, however, they become transparent and no optical limiting is observed. Excited state absorption cross-sections obtained from analysis of the optical limiting data reveal that the C<sub>60</sub> derivatives have a maximum triplet-triplet absorption cross-section at 700 nm, which is shifted from the 750 nm value for the C<sub>60</sub> molecule. For the first time, optical limiting measurements are performed on five separate C<sub>84</sub> isomers. These intriguing results show that the optical limiting behavior is strongly dependent on the cage symmetry. It is also found that the most abundant isomer does not have the strongest optical limiting performance, but is in fact one of the weaker optical limiters of the isomers isolated so far.  <p>The endohedral metallofullerenes are a unique class of fullerene materials and consist of one or more metal atoms encapsulated inside the buckyball cage. An important characteristic of these materials is the charge-transfer from the dopant atoms to the fullerene cage, which has a high electron affinity. The charge-transfer is similar to the optical excitation in a material, but although the electrons are placed in the lowest unoccupied molecular orbital (LUMO), there are no holes produced in the highest occupied molecular orbital (HOMO). This is an important analogy, since it has been previously shown that optical excitation enhances the nonlinear optical properties of a material. The nonresonant degenerate four-wave mixing experiments performed on the endohedral metallofullerene Er<sub>2</sub>@C<sub>82</sub>, at 1064 nm, show that the third order nonlinear susceptibility value is increased by orders of magnitude relative to the empty cage fullerenes, thus, confirming the charg e-transfer process from the encapsulated atoms to the fullerene cage. We obtain a value [gamma]<sub>xyyx</sub><sup>(3)</sup>( &#173 [omega]; [omega], [omega],  &#173 [omega])= &#173 8.65 &#215 10<sup>-32</sup> esu for the molecular second order hyperpolarizability, which is almost three orders of magnitude larger than the values reported in literature for an empty cage fullerene. </body> </html>",
  "description_provenance": [
    "Author Email: dmarciu@vt.edu",
    "Advisor Email: aritter@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:42Z (GMT). No. of bitstreams: 5 CHAPTER3.PDF: 201941 bytes, checksum: 655b533e4ee73e9795182324afda2175 (MD5) VITA.PDF: 3590 bytes, checksum: b34566bdd8e69aa5dcef463cde912dd1 (MD5) CHAPTER4.PDF: 19497 bytes, checksum: 6cda7bc132fda7095bd9fca0567e12eb (MD5) CHAPTER2.PDF: 391017 bytes, checksum: 66d788f0a145cb482e8e2a7dc686ec0a (MD5) CHAPTER1.PDF: 118816 bytes, checksum: e7369b4fba8ce7050ad5a635d567c0b9 (MD5)   Previous issue date: 1999-02-09"
  ],
  "handle": "26285",
  "identifier_other": "etd-022299-083514",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-022299-083514/",
  "identifier_uri": "http://hdl.handle.net/10919/26285",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAPTER3.PDF",
    "VITA.PDF",
    "CHAPTER4.PDF",
    "CHAPTER2.PDF",
    "CHAPTER1.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "optical limiting",
    "degenerate four-wave mixing",
    "fullerenes",
    "nonlinear optics"
  ],
  "title": "Optical Limiting and Degenerate Four-Wave Mixing in Novel Fullerenes",
  "type": "Dissertation"
}