{
  "contributor_author": "Barthet, Michelle Marie",
  "contributor_committeechair": "Hilu, Khidir W.",
  "contributor_committeemember": [
    "Walker, Richard A.",
    "Beers, Eric P.",
    "Gillaspy, Glenda E.",
    "Sible, Jill C."
  ],
  "contributor_department": "Biological Sciences",
  "date_accessioned": "2014-03-14T20:07:44Z",
  "date_adate": "2006-03-10",
  "date_available": "2014-03-14T20:07:44Z",
  "date_issued": "2006-02-09",
  "date_rdate": "2007-03-10",
  "date_sdate": "2006-02-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The chloroplast matK gene has been identified as a rapidly evolving gene at nucleotide and corresponding amino acid levels.  The high number of nucleotide substitutions and length mutations in matK has provided a strong phylogenetic signal for resolving plant phylogenies at various taxonomic levels.  However, these same features have raised questions as to whether matK produces a functional protein product.  matK is the only proposed chloroplast-encoded group II intron maturase.  There are 15 genes in the chloroplast that would require a maturase for RNA splicing.  Six of these genes have introns that are not excised by a nuclear imported maturase, leaving MatK as the only candidate for processing introns in these genes.  Very little research has been conducted concerning the expression and function of this important gene and its protein product.  It has become crucial to understand matK expression in light of its significance in RNA processing and plant systematics.  In this study, we examined the expression, function and evolution of MatK using a combination of molecular and genetic methods.  Our findings indicate that matK RNA and protein is expressed in a variety of plant species, and expression of MatK protein is regulated by development.  In addition, matK RNA levels are affected by light.  Furthermore, genetic analysis has revealed that although MatK has a high rate of amino acid substitution, these substitutions are not random but are constrained to maintain overall chemical structure and stability in this protein.  We have also identified an alternate start codon for matK in some plant species that buffers indels (insertions and deletions) in the open reading frame (ORF) that are not in multiples of three in the gene sequence.  Usually, indels not in multiples of three result in frame shifts that destroy the reading frame.  Our results indicate that an out-of-frame matK start codon in some orchids compensates for these otherwise deleterious indels.  This research represents the first in-depth analysis of matK gene expression and contributes to several fields of biology including plant systematics, genetics and gene expression.",
  "description_provenance": [
    "Author Email: mbarthet@vt.edu",
    "Advisor Email: rawalker@vt.edu",
    "Advisor Email: ebeers@vt.edu",
    "Advisor Email: gillaspy@vt.edu",
    "Advisor Email: siblej@vt.edu",
    "Advisor Email: hilukw@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:44Z (GMT). No. of bitstreams: 1 FinalMMBdissertation.pdf: 1555170 bytes, checksum: 235443d8b923398922e58a7601426cb1 (MD5)   Previous issue date: 2006-02-09"
  ],
  "handle": "26287",
  "identifier_other": "etd-02232006-012016",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02232006-012016/",
  "identifier_uri": "http://hdl.handle.net/10919/26287",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalMMBdissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "chloroplast",
    "fast-evolving",
    "maturase",
    "MatK",
    "Orchidaceae"
  ],
  "title": "Expression and Function of the Chloroplast-encoded Gene matK.",
  "type": "Dissertation"
}