{
  "contributor_author": "Cormier, Joseph Michael",
  "contributor_committeechair": "Duma, Stefan M.",
  "contributor_committeecochair": "Gabler, Hampton Clay",
  "contributor_committeemember": [
    "Madigan, Michael L.",
    "Funk, James",
    "Stitzel, Joel D."
  ],
  "contributor_department": "Biomedical Engineering",
  "date_accessioned": "2014-03-14T20:07:42Z",
  "date_adate": "2009-04-10",
  "date_available": "2014-03-14T20:07:42Z",
  "date_issued": "2009-02-06",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-02-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this dissertation is to examine the occurrence of facial fractures in automotive collisions and to determine the tolerance of the facial bones to blunt impact.  The effects of restraint use, impact severity and impact direction on facial fractures were evaluated using the NASS-CDS database.  The association between brain injury and facial fractures was also examined.  The tolerance of the frontal bone, nasal bone, maxilla and mandible was determined using the flat surface of a cylindrical impactor.  The influence of anthropometric measures and geometrical descriptors on the tolerance of the facial bones is also presented.  The force-displacement response of each impacted region was also determined and response corridors were created.  These corridors were used to evaluate the biofidelity of the FOCUS headform under the same impact conditions.  Mathematical models were also created to predict the force and displacement resulting from facial impact.  The data contained in this dissertation can be used to determine the risk of facial fracture as a function of impact force and evaluate the biofidelity of models simulating facial impact.",
  "description_provenance": [
    "Author Email: jcormier@brconline.com",
    "Advisor Email: mlmadigan@vt.edu",
    "Advisor Email: gabler@vt.edu",
    "Advisor Email: duma@vt.edu",
    "Advisor Email: jfunk@brconline.com",
    "Advisor Email: jstitzel@wfubmc.edu",
    "Made available in DSpace on 2014-03-14T20:07:42Z (GMT). No. of bitstreams: 1 JMC_ETD.pdf: 2531382 bytes, checksum: 8343f55dd707cdad9ba5080e1c13be66 (MD5)   Previous issue date: 2009-02-06"
  ],
  "handle": "26280",
  "identifier_other": "etd-02222009-122741",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02222009-122741/",
  "identifier_uri": "http://hdl.handle.net/10919/26280",
  "publisher": "Virginia Tech",
  "relation_haspart": "JMC_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "maxilla",
    "mandible",
    "FOCUS",
    "NASS",
    "risk",
    "frontal",
    "face",
    "nasal"
  ],
  "title": "Epidemiology and Biomechanical Analysis of Facial Fractures",
  "type": "Dissertation"
}