{
  "contributor_author": "Jones, Jess Walter",
  "contributor_committeechair": "Neves, Richard J.",
  "contributor_committeecochair": "Hallerman, Eric M.",
  "contributor_committeemember": [
    "Orth, Donald J.",
    "Jiao, Yan",
    "Walters, Jeffery R."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:07:44Z",
  "date_adate": "2009-04-17",
  "date_available": "2014-03-14T20:07:44Z",
  "date_issued": "2009-02-06",
  "date_rdate": "2009-04-17",
  "date_sdate": "2009-02-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Genetic variation was examined in two endangered mussel species, Epioblasma brevidens and E. capsaeformis, and a common species Lampsilis fasciola, in the Clinch River, TN, by screening mitochondrial DNA (mtDNA) sequences and nuclear DNA microsatellites. These species use fish hosts with varying dispersal capabilities, ranging from low, moderate, and high, respectively. Patterns of mtDNA polymorphism exhibited different trends for long-term population sizes for each species during the Holocene (~10,000 ya to present); namely, E. brevidens has declined over time, E. capsaeformis has remained stable, and L. fasciola has expanded. Long-term effective population size (Ne) was smallest in E. brevidens, intermediate in E. capsaeformis, and highest in L. fasciola. Moderately diverged mtDNA lineages, perhaps indicative of secondary contact, were observed in E. brevidens and E. capsaeformis. High levels of gene flow (Nm) were estimated among demes of L. fasciola using traditional F-statistics and likelihood estimates of Nm, whereas such metrics were lower in E. brevidens and E. capsaeformis. Data are consistent with population dynamics and life history traits of each species and their fish hosts.   Age, shell growth, and population demography of Epioblasma brevidens, E. capsaeformis, and Lampsilis fasciola were studied from 2004-2007 in a 32-km reach of the Clinch River, TN. Observed maximum age and length of E. brevidens was 28 y and 71.5 mm for males and 11 y and 56.6 mm for females; of E. capsaeformis, 12 y and 54.6 mm for males and 9 y and 48.6 mm for females; and of L. fasciola, 45 y and 91.3 mm for males and 13 y and 62.6 mm for females. For all three species, observed maximum age and length was greater among males than females. Estimated population size in this river reach was approximately 43,000 individuals for E. brevidens, 579,000 individuals for E. capsaeformis, and 30,000 individuals for L. fasciola. Mean recruitment y-1 of 1 y-old E. brevidens ranged from 7.1% to 20%, of E. capsaeformis from 4.0% to 32.4%, and of L. fasciola from 5.8% to 25.6%. Population growth rate y-1 was 24.9% for E. brevidens, 34.6% for E. capsaeformis, and -22.4% for L. fasciola. Mortality rates of females were higher than for males of E. capsaeformis and L. fasciola, but not E. brevidens. Juvenile mussels were collected but temporally and spatially variable in occurrence, and a significant component of the age-class structure of all three species. Recruitment was very high during 2006-2007 for E. capsaeformis and other species, likely due to low river discharges in the spring-summer of 2005-2007. Surplus individuals of E. brevidens and E. capsaeformis are currently available to conduct translocations for restoration purposes.   Population modeling of Epioblasma brevidens and E. capsaeformis in the Clinch River was conducted to determine suitable harvest levels for translocation of sub-adults and adults, and to determine quantitative criteria for evaluating performance and recovery of extant and reintroduced populations. For both species, the recommended annual harvest was <1% of local population size to minimize risk of decline. Reintroduction modeling indicated that size of the initial population created during a 5 y build-up phase greatly affected final population size at 25 y, being similar to size at the end of the build-up phase, especially when expected growth rate was low, (e.g., 1-2%). Excluding age-0 individuals, age-1 juveniles or recruits on average comprised approximately 11% and 15% of a stable population of each species, respectively. The age-class distribution of a stable or growing population was characterized by multiple cohorts, to include juvenile recruits, sub-adults, and adults. Molecular genetic and demographic data indicated that the ratio of Ne/Nc was ~5% for both species. Based on this ratio and predicted declines of genetic variation at different population sizes, target sizes for reintroduced or recovered populations of each species should be 창 짜5,000 individuals (Ne=250) and 창 짜10,000 individuals (Ne=500), respectively, and should be comprised of multiple smaller demes spread throughout a river. Populations of both species are currently large enough to sustain harvest for translocation and reintroduction purposes, offering an effective species recovery strategy.",
  "description_provenance": [
    "Author Email: Jess_Jones@fws.gov",
    "Advisor Email: mussel@vt.edu",
    "Advisor Email: ehallerm@vt.edu",
    "Advisor Email: dorth@vt.edu",
    "Advisor Email: yjiao@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:44Z (GMT). No. of bitstreams: 1 JJonesDissertation(FINAL).pdf: 1374470 bytes, checksum: 51846dfd45d7a90c34bb9c5304faf1a6 (MD5)   Previous issue date: 2009-02-06"
  ],
  "handle": "26288",
  "identifier_other": "etd-02232009-001131",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02232009-001131/",
  "identifier_uri": "http://hdl.handle.net/10919/26288",
  "publisher": "Virginia Tech",
  "relation_haspart": "JJonesDissertation(FINAL).pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Freshwater mussels",
    "quantitative recovery criteria",
    "fish hosts",
    "Ne",
    "and Nm",
    "Epioblasma brevidens",
    "E. capsaeformis",
    "Lampsilis fasciola",
    "age",
    "growth",
    "population demography",
    "juvenile recruitment",
    "population modeling",
    "harvest",
    "reintroduction",
    "historical population trends"
  ],
  "title": "Genetics, demography and modeling of freshwater mussel (Bivalvia: Unionidae)  populations in the Clinch River, U.S.A.",
  "type": "Dissertation"
}