{
  "contributor_author": "Pierson, Mary  Ellen",
  "contributor_committeechair": "Potter, Kenneth R.",
  "contributor_committeemember": [
    "Moore, David Michael",
    "Lockee, Barbara B.",
    "Little, Jamie O."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:42Z",
  "date_adate": "2011-03-09",
  "date_available": "2014-03-14T20:07:42Z",
  "date_issued": "2011-02-10",
  "date_rdate": "2012-10-08",
  "date_sdate": "2011-02-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study explored the design and development of the knowledge harvesting and knowledge management components of a comprehensive tool which incorporates characteristics of continuity management, knowledge harvesting, and knowledge management.  While tools exist to support restoring continuity in the aftermath of a disastrous event, little is done to address maintaining continuity through the non-disastrous events.  Employee separation is one such non-disastrous event, and one that all organizations face. Knowledge harvesting is suggested as a means to address collecting the knowledge of employees within an organization so that it can be reused by new employees or temporary replacements.  The combination of the attributes of continuity management, knowledge harvesting, and knowledge management resulted in five characteristics of a comprehensive tool.  These characteristics were operationalized in the design of a comprehensive tool and provided contextual information for the design and development of the knowledge harvesting and knowledge management components.  Findings of the evaluations of the components indicated that the developed components complied with the design-based specifications. Lessons learned from the implementation and evaluations of the knowledge harvesting component suggest that the right questions for the knowledge harvesting process should be determined by the organization based on the need for the information and the nature of the information needed; that the tool should incorporate terminology, prompting questions, and a structure that are right for the organization and that the users will understand; that users may benefit from time to respond and having options to submit  responses in various formats; and that users may benefit from encouragement and support throughout the knowledge harvesting process.  Lessons learned from the implementation and evaluations of the knowledge management components suggest that the ability to provide a prompt follow-up to a user's response could improve the effectiveness of the tool; that the structure and development of the database requires precision; and that while the database must be precise, it must also be flexible and accurately accommodate changes to the content.",
  "description_provenance": [
    "Author Email: mep@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: littlej@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:42Z (GMT). No. of bitstreams: 1  Pierson_ME_D_2011.pdf: 830358 bytes, checksum: c1905d97addf96fe9b6f3e3395ea1ce1 (MD5)    Previous issue date: 2011-02-10"
  ],
  "handle": "26284",
  "identifier_other": "etd-02222011-122003",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02222011-122003/",
  "identifier_uri": "http://hdl.handle.net/10919/26284",
  "publisher": "Virginia Tech",
  "relation_haspart": "Pierson_ME_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "continuity management",
    "knowledge management",
    "prompting questions",
    "knowledge harvesting",
    "continuity"
  ],
  "title": "A Study Investigating the Design and Development of Components of a Comprehensive Tool Incorporating Characteristics of Continuity Management, Knowledge Harvesting, and Knowledge Management",
  "type": "Dissertation"
}