{
  "contributor_author": "Taylor, Tonya Marie",
  "contributor_committeecochair": [
    "Boyd, Heather",
    "Daisy Stewart"
  ],
  "contributor_committeemember": [
    "Sutphin, Cathy",
    "Pat O'Reilly"
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:07:42Z",
  "date_adate": "2010-04-08",
  "date_available": "2014-03-14T20:07:42Z",
  "date_issued": "2010-02-12",
  "date_rdate": "2011-04-08",
  "date_sdate": "2010-02-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Understanding volunteer motivation has been widely recognized by both researchers and administrators as a valuable component of program development.  Thus, it is important to explore the motivational needs that contribute to Virginia adult 4-H volunteerism. This quantitative research study was designed to fill a gap in the current volunteer literature regarding our understanding of the motivational needs of Virginia adult 4-H volunteers. The following research questions guided this study: 1.\tWhat are the motivations of Virginia adult 4-H volunteers and how are these volunteers distributed in terms of their primary motivational need (power, achievement, or affiliation)? 2.\tWhat is the relationship between motivational needs (power, achievement, and affiliation) and volunteer satisfaction as self-reported by Virginia adult 4-H volunteers? 3.\tTo what extent are Virginia adult 4-H volunteers motivated to volunteer for Virginia       4-H? 4.\tTo what extent do motivational needs (power, achievement, and affiliation) differ in urban and rural Virginia adult 4-H volunteers? 5.\tWhat are the most prevalent youth experiences influencing adult 4-H volunteerism in Virginia 4-H? Data were collected from 296 Virginia 4-H volunteers via a 20-item questionnaire utilizing McClellandâ  s Trichotomy of Needs Theory. The results showed that the top three motives for volunteering with Virginia 4-H were within the achievement and power subscales and included to teach and lead others, to improve the community, and to have an influence on how young people learn and grow. Further, a significant positive relationship was revealed between motivational needs (achievement, affiliation, and power) and satisfaction level. Results also indicated that the majority of Virginia adult 4-H volunteers described their current motivational level as â  motivated.â   Additionally, no significant differences were found between the motivational needs of urban and rural Virginia adult 4-H volunteers and 4-H involvement was the most prevalent youth experience that influenced the decision to volunteer for 4-H. Based on the results of this study, implications and recommendations for practice and further research were suggested.",
  "description_provenance": [
    "Author Email: totaylor@vt.edu",
    "Advisor Email: cmsutph@vt.edu",
    "Advisor Email: hboyd@vt.edu",
    "Advisor Email: oreilly@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:42Z (GMT). No. of bitstreams: 2 approval_letter[1].pdf: 237539 bytes, checksum: d1e68a52f5db2435b7c270eb2e596b8b (MD5) Taylor_TM_D_2010.pdf: 408995 bytes, checksum: e7f800f41eb1a4b171eba8683a1d7cdd (MD5)   Previous issue date: 2010-02-12"
  ],
  "handle": "26282",
  "identifier_other": "etd-02222010-103002",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02222010-103002/",
  "identifier_uri": "http://hdl.handle.net/10919/26282",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "approval_letter[1].pdf",
    "Taylor_TM_D_2010.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Volunteer",
    "4-H",
    "Motivation"
  ],
  "title": "Analyzing the Motivational Needs of Volunteerism Among Virginia Adult 4-H Volunteers",
  "type": "Dissertation"
}