{
  "contributor_author": "Glass, Martha Jean",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeemember": [
    "Janosik, Steven M.",
    "Burge, Penny L.",
    "Angle, Susan P."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:42Z",
  "date_adate": "2010-03-16",
  "date_available": "2014-03-14T20:07:42Z",
  "date_issued": "2010-02-08",
  "date_rdate": "2010-03-16",
  "date_sdate": "2010-02-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Retention of college students has continued to be a concern for many people connected with higher education (Baum & Ma, 2007; Day & Newburger, 2002; Habley & McClanahan, 2004). The high school to college transition experience has been identified as a key factor in studentsâ   decision to remain in college and persist to graduation (Hunter, 2006; Levitz & Noel, 1989; Pascarella & Terenzini, 2005; Roe Clark, 2005). More students than ever are coming to higher education with mental health challenges (Kadison & DiGeronimo, 2004; Soet & Sevig, 2006) but a thorough review of the literature reveals no literature on the transition experience of students that have been diagnosed with psychiatric illness. The purpose of this study was to understand and describe how students diagnosed with a mental illness experience the college transition. In addition, the study provided an understanding of the transition experience for these students at three different types of institutions. The theoretical framework for this study was Schlossbergâ  s (1984) transition theory. The individuals in the sample included 18-19 year old traditional first year college students diagnosed with mental illness.\t Interviews were conducted with 21 respondents during their second semester of college. Data analysis revealed themes under the topics of individual characteristics, academic and social transition, and institutional differences. Findings revealed that these first year students with mental illness had many of the same developmental and transition experiences and challenges as their peers. However, their transition experiences were complicated by the daily tasks of managing medications, symptoms, counseling appointments, academic support services, and involvement of parents. Participants were learning to take responsibility for their own well-being but still needed a safety-net. In addition, respondents described resources and strategies that they used to adjust academically and socially, such as receiving academic accommodations and disclosing their diagnosis to faculty and friends. The students described their campuses in similar ways, as friendly and supportive, with few institutional differences. In general, the participants confronted challenges early during their transition but at the time of the interviews they seemed to be experiencing a successful transition.",
  "description_provenance": [
    "Author Email: mglass@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: spangle@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:42Z (GMT). No. of bitstreams: 1 Glass_MJ_D_2010.pdf: 794662 bytes, checksum: 2168ee8aa2fe7f1b62f53b5a44b37ae2 (MD5)   Previous issue date: 2010-02-08"
  ],
  "handle": "26283",
  "identifier_other": "etd-02222010-144010",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02222010-144010/",
  "identifier_uri": "http://hdl.handle.net/10919/26283",
  "publisher": "Virginia Tech",
  "relation_haspart": "Glass_MJ_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mental illness",
    "college students",
    "transition"
  ],
  "title": "College Transition Experiences of Students with Mental Illness",
  "type": "Dissertation"
}