{
  "contributor_author": "Fitch, Gregory Malcolm",
  "contributor_committeechair": "Kleiner, Brian M.",
  "contributor_committeemember": [
    "Winchester, Woodrow W. III",
    "Dingus, Thomas A.",
    "Hankey, Jonathan M."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:07:42Z",
  "date_adate": "2009-03-18",
  "date_available": "2014-03-14T20:07:42Z",
  "date_issued": "2008-12-09",
  "date_rdate": "2009-03-18",
  "date_sdate": "2009-02-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Active safety systems that warn automobile drivers of various types of impending collisions have been developed.  How these systems alert drivers when integrated, however, is a crucial component to their effectiveness that hinges on the consideration of human factors.  Driversâ   ability to comprehend multiple alerts presented through a haptic driver seat was investigated in this dissertation.  Twenty-four participants, balanced for age and gender, drove an instrumented vehicle on a test-track while haptic alerts (vibrations in the driver seat) were generated.  Driversâ   ability to transmit the information conveyed by the alerts was investigated through two experiments.  The first experiment investigated the effects of increasing the number of potential alerts on driversâ   response performance.  The second experiment investigated whether presenting haptic alerts through unique versus common locations in the driver seat affects driversâ   response performance.  Younger drivers (between the ages of 18 and 25 years old) were found to efficiently process the increased information contained in the alerts, while older drivers were not as efficient.  However, it is foreseeable that older driver performance decrements may be assuaged when a crash context is provided.  A third experiment evaluated the haptic driver seatâ  s ability to alert distracted drivers to an actual crash threat.  Drivers that received a haptic seat alert returned their gaze to the forward roadway sooner, removed their foot from the throttle sooner, pressed the brake pedal sooner, and stopped farther away from an inflatable barricade than drivers that did not receive a haptic seat alert.  No age or gender effects were found in this experiment.  Furthermore, half of the drivers that received the haptic seat alert lifted up on the throttle before returning their eyes to the forward roadway.  This suggests these drivers developed an automatic response to the haptic seat alerts through their experience with the previous two experiments.  A three-alert haptic seat approach, the intermediate alternative tested, is recommended providing specific design requirements are met.",
  "description_provenance": [
    "Author Email: gfitch@vt.edu",
    "Advisor Email: wwwinche@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: tdingus@vtti.vt.edu",
    "Advisor Email: jhankey@vtti.vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:42Z (GMT). No. of bitstreams: 1 Driver_Comprehension_of_Integrated_Collision_Avoidance_System_Alerts_Presented_through_a_Haptic_Driver_Seat-Fitch_2009.pdf: 4230088 bytes, checksum: dfe448eee6ef66fd536a5b37e8a42941 (MD5)   Previous issue date: 2008-12-09"
  ],
  "handle": "26281",
  "identifier_other": "etd-02222009-150832",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02222009-150832/",
  "identifier_uri": "http://hdl.handle.net/10919/26281",
  "publisher": "Virginia Tech",
  "relation_haspart": "Driver_Comprehension_of_Integrated_Collision_Avoidance_System_Alerts_Presented_through_a_Haptic_Driver_Seat-Fitch_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Vibration",
    "Tactile",
    "Highway Safety",
    "Surface Transportation",
    "Haptic Driver Seat",
    "Haptic",
    "Integrated Collision Avoidance System",
    "Crash Alert",
    "Collision Avoidance",
    "Alert",
    "Active Safety",
    "Vibrotactile",
    "Collision Warning",
    "Collision Avoidance System"
  ],
  "title": "Driver Comprehension of Integrated Collision Avoidance System Alerts Presented through a Haptic Driver Seat",
  "type": "Dissertation"
}