{
  "contributor_author": "Pan, YuanXiang",
  "contributor_committeecochair": [
    "Wong, Eric A.",
    "Webb, Kenneth E. Jr."
  ],
  "contributor_committeemember": [
    "Bloomquist, Jeffrey R.",
    "Davis, Barbara A.",
    "Denbow, Donald Michael"
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:07:46Z",
  "date_adate": "2000-02-26",
  "date_available": "2014-03-14T20:07:46Z",
  "date_issued": "2000-02-11",
  "date_rdate": "2001-02-26",
  "date_sdate": "2000-02-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "We reported the primary structure, tissue distribution, and in vitro functional characterization of a peptide transporter, oPepT1, from ovine intestine.  The ovine intestinal oPepT1 cDNA was 2,829 bp long encoding a protein of 707 amino acid residues with an estimated molecular size of 79 kDa, and a pI of 6.57.  The cDNA contained a 79-bp 5' untranslated sequence and a 630-bp 3' untranslated sequence.  The proposed oPepT1 protein was 77.9, 81.3, and 82.6 percent identical to PepT1 from rabbit, rat, and human, respectively.  High stringency northern blot analysis demonstrated that oPepT1 is expressed strongly in the small intestine, at lower levels in the omasum, and at much lower levels in the rumen, but is not expressed in liver and kidney.  The presence of the peptide transporter in the forestomach at such levels could provide amino acid nitrogen for the ruminant in a nutritionally significant manner.  Transport function of oPepT1 was assessed by expressing oPepT1 in Xenopus oocytes using a two-electrode voltage-clamp technique.  Overall, the in vitro transport characteristics of oPepT1 expressed in oocytes were similar to those of PepT1 from other species.  The transport process is electrogenic and pH-dependent, but independent of Na+, Cl-, and Ca2+.  It displayed a broad substrate specificity that transported neutral and charged dipeptides and tripeptides.  All dipeptides and tripeptides examined evoked inward currents in a saturable manner, with an affinity constant (Kt) ranging from 20 mM to .6 mM for dipeptides and .15 to 3.0 mM for tripeptides.  No responses were detected from tetrapeptides or free amino acids.  Although many of the properties displayed by oPepT1 were similar to those of PepT1 from other species, some differences were noted.  First, the isoelectric point of oPepT1 was lower than that of others, but the oPepT1 protein appeared to have the same biological activity as that of others at a physiological pH.  Second, more potential phosphorylation sites for protein kinases were present in oPepT1.  Third, compared with PepT1 from other species, oPepT1 has more negatively charged amino acids at its C-terminus.",
  "description_provenance": [
    "Author Email: ypan@vt.edu",
    "Advisor Email: jbquist@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: badavis@vt.edu",
    "Advisor Email: webbk@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:46Z (GMT). No. of bitstreams: 1 Thesis02-25-2000-final.PDF: 949168 bytes, checksum: 5b08ad20a2c42d8c0830ed09eab868be (MD5)   Previous issue date: 2000-02-11"
  ],
  "handle": "26296",
  "identifier_other": "etd-02242000-17170025",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02242000-17170025/",
  "identifier_uri": "http://hdl.handle.net/10919/26296",
  "publisher": "Virginia Tech",
  "relation_haspart": "Thesis02-25-2000-final.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Characterization",
    "Ovine",
    "oPEPT1",
    "Transporter",
    "Cloning",
    "Peptide"
  ],
  "title": "Molecular Cloning, In Vitro Expression, and Functional Characterization of an Ovine Gastrointestinal Peptide Transporter (oPepT1)",
  "type": "Dissertation"
}