{
  "contributor_author": "Brookshire, E. N. J.",
  "contributor_committeechair": "Valett, H. Maurice",
  "contributor_committeemember": [
    "Jones, Robert H.",
    "Burger, James A.",
    "Thomas, Steven",
    "Webster, Jackson R."
  ],
  "contributor_department": "Biological Sciences",
  "date_accessioned": "2014-03-14T20:07:46Z",
  "date_adate": "2006-03-02",
  "date_available": "2014-03-14T20:07:46Z",
  "date_issued": "2006-02-10",
  "date_rdate": "2006-03-02",
  "date_sdate": "2006-02-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this dissertation I describe how coupled internal cycling and external forcing from the atmosphere and climate can regulate the dynamics of nitrogen (N) loss from forest watersheds.  I address three major gaps in our understanding of the global N cycle: 1) the role of dissolved organic N (DON) in internal N cycling in low-N ecosystems; 2) The influence of atmospheric pollution on DON production and loss from forests; and 3) the inherent climate sensitivity of forest N cycling and loss.  In chapter 2, I present the results of a study of DON spiraling that showed enormous capacity for stream microorganisms to immobilize and transform organic nutrients.  Although most DON in surface waters is highly refractory products of SOM dissolution, this study revealed very tight internal cycling of DON at the sediment interface and suggested significant production of DON in the hyporheic zone.  Most remarkably, this DON was not expressed in stream waters, supporting the idea that watershed DON losses would have been higher in the absence of pronounced benthic demand.  The experiments also suggested that coupled dynamics between DOC and DON spiraling may be altered under conditions of elevated N supply. Chapter 3 challenges the idea that soil organic matter (SOM) and its dissolved products are stoichiometrically static as N pools accumulate.  Using a broad geographic survey of forest streams, I show that DON losses increase as a consequence of N pollution and that this occurs through a disproportionate enrichment of N on dissolved organic matter rather than alteration of soil and dissolved carbon dynamics.  These results have implications for N limitation in forests and aquatic systems.  In particular, DOC: DON ratios of DOM draining N-saturated forests were strikingly low suggesting possible increases in DOM bioavailability with increasing N supply. Chapter 4 provides insight into how local forest nutrient cycles may be organized by synchronous global-scale climate-atmosphere dynamics.  This study of long term (30 yr) hydro-chemistry from reference forest watersheds provides an integrated example of the overall climate sensitivity of N cycling and underscores the importance of complex synergies between simultaneous vectors of global change.  Results from this study argue that the combined influence of N pollution and warming are likely to have pronounced long-term effects on ecosystems globally.",
  "description_provenance": [
    "Author Email: ebrooksh@vt.edu",
    "Advisor Email: rhjones@VT.EDU",
    "Advisor Email: jaburger@vt.edu",
    "Advisor Email: mvalett@VT.EDU",
    "Advisor Email: sthomas5@unlnotes.unl.edu",
    "Advisor Email: jwebster@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:46Z (GMT). No. of bitstreams: 1 Brookshire_Dissertation_Final.pdf: 735095 bytes, checksum: c0ad0cb33225d5fe01e43eaa813f5355 (MD5)   Previous issue date: 2006-02-10"
  ],
  "handle": "26299",
  "identifier_other": "etd-02242006-104624",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02242006-104624/",
  "identifier_uri": "http://hdl.handle.net/10919/26299",
  "publisher": "Virginia Tech",
  "relation_haspart": "Brookshire_Dissertation_Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "nitrogen",
    "cycling",
    "DIN",
    "DON",
    "climate",
    "atmosphere",
    "temperate forest",
    "DOC",
    "watershed",
    "biogeochemistry",
    "stream",
    "soil"
  ],
  "title": "The organic nature and atmosphere-climate dependency of nitrogen loss from forest watershed ecosystems",
  "type": "Dissertation"
}