{
  "contributor_author": "Gibbens, John Lawrence",
  "contributor_committeechair": "Buchanan, James M.",
  "contributor_committeemember": [
    "Tideman, Thorwald Nicolaus",
    "West, Edwin G.",
    "Wagner, Richard E.",
    "Staaf, Robert J."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:07:45Z",
  "date_adate": "2010-02-23",
  "date_available": "2014-03-14T20:07:45Z",
  "date_issued": "1977-05-01",
  "date_rdate": "2012-03-13",
  "date_sdate": "2010-02-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "PREFACE<p> Although his name is not familiar to today's student of economics. in his own lifetime William Edward Hearn's reputation as an economist stood high. In the last century Hearn's Plutology: Or the Theory of Efforts to Satisfy Human Wants, drew high and unqualified praise from W. S. Jevons, H. Sidgwick, A. Marshall, and F. J. Edgeworth. 1 And in the first part of this century the Plutology continued to be read respectfully--it was, praised by F. A. Hayek as late as 1936, for example. Admiration by economists of such stature in itself warrants an investigation of the Plutology-and that Hearn did respected work in related fields cannot but add interest ,to his work in political economy. Hearn enjoyed an international reputation, not only as an economist. but also as. a urist and as a political theorist. His Government of England, for example, was admired by Herbert Spencer and by A. C. Dicey. 'Hearn was no ordinary professor of .. supply and demand. It is therefore the purpose of this essay to disinter Hearn as a political economist and to relate his work in that field not only to his other work but also to prior and subsequent work of others in economics  <p> An appreciative understanding of the Plutology is' not likely to come to one familiar with only modern economic analysis and its development. Chapter I of this study was therefore written to introduce the reader to Hearn as a \"Smithian~ as opposed to a ~Ricardian\" classical economist. Hearn's political economy, developed and written in the middle of the nineteenth century, brings out elements of the \"Smithian\" approach which were forgotten as neoclassicism stiffened into orthodoxy. <p> In Chapter II. an account is given of Hearn's work and reputation. The respect which this remarkable man enjoyed and. the subsequent neglect which he suffered owe to an assemblage of circumstances. <p> The novel design of the Plutology is explained in Chapter III. The merits of Hearn's approach are illustrated in his success at finding within his scheme a natural location for the most notable doctrines of the previous century of economic inquiry. <p> In Chapter IV, some of Hearnâ  s views on specific doctrines are  presented. These. can be understood as contributions even by one whose sympathies lie largely with the orthodoxy. <p> Although the main flow of economic thought has not been in the direction to which Hearn would have pointed, he was not completely uninfluential. In particular, there is evidence that both Marshall's Principles and Jevons' Theory  would have been written differently had these two men not studied Hearn. This evidence is found in Chapter V. The \"labor theory of value\" has been the subject of such controversy that a separate chapter dealing with this topic is in order.Â· Chapter VI is an expansion of the implications of Hearn â ¢ s restatement of what might be called the \"Smithian labor theory of value.\" <p> Chapter VII draws from Hearn's work in both analytical and historical jurisprudence for a theory of economic institutions. The principal element in Hearn's legal theory was \"duty\" rather than \"right\" ; this might be compared to the emphasis. in classical economics, given \"laborâ   rather than \"satisfactions.\" Of particular interest to the economist is Hearn's analysisÂ· of property and contract.",
  "description_provenance": [
    "Author Email: johngibbens@att.net",
    "Made available in DSpace on 2014-03-14T20:07:45Z (GMT). No. of bitstreams: 1 LD5655.V856_1977.G52.pdf: 13362004 bytes, checksum: 15a27521d92d9301813cd2db21abb766 (MD5)   Previous issue date: 1977-05-01"
  ],
  "format_medium": "BTD",
  "handle": "26291",
  "identifier_other": "etd-02232010-020346",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02232010-020346/",
  "identifier_uri": "http://hdl.handle.net/10919/26291",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1977.G52.pdf",
  "subject": "Economics",
  "subject_lcc": "LD5655.V856 1977.G52",
  "title": "William E. Hearn and classical political economy.",
  "type": "Dissertation"
}