{
  "contributor_author": "Norris, Kimberly Jane",
  "contributor_committeechair": "Barksdale, Mary Alice",
  "contributor_committeemember": [
    "Witta, Terry C.",
    "Fu, Victoria R.",
    "Stewart, Daisy L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:45Z",
  "date_adate": "2012-04-11",
  "date_available": "2014-03-14T20:07:45Z",
  "date_issued": "2012-02-09",
  "date_rdate": "2012-04-11",
  "date_sdate": "2012-02-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Expectations for accountability have led policy makers to create standards designed to educate children to their highest potential. In addition to k-12 standards, the Commonwealth of Virginia created Foundation Blocks for a state-sponsored preschool program called the Virginia Preschool Initiative.  \tThis study included assessment of Virginiaâ  s Foundation Blocks for Early Learning: Comprehensive Standards for Four-Year-Olds as they relate to theories of Piaget, Vygotsky, and Rogoff.  This assessment included play, scaffolded instruction, emergent literacy, and spatial reasoning. The Foundation Blocks were examined to determine how they were interpreted and implemented by preschool classroom teachers. Using a case-study format, four volunteer teachers participated in three days of classroom observations, be interviewed, and complete a survey.  Evidence showed that the standards were theoretically based, and the participating teachersâ   pedagogy included play, emergent literacy, and spatial reasoning. Scaffolded instruction was not observed. There were concerns about teachersâ   low expectations and low-level questioning techniques.",
  "description_provenance": [
    "Author Email: knorris@vt.edu",
    "Advisor Email: twiita@martinsville.k12.va.us",
    "Advisor Email: vfu@vt.edu",
    "Advisor Email: mbarksda@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:45Z (GMT). No. of bitstreams: 4 Norris_KJ_D_2012.pdf: 988081 bytes, checksum: e29328e7d39396480f3d1badd36d957c (MD5) Norris_KJ_D_2012_f2.pdf: 289992 bytes, checksum: a9fa47abf6b1e4423373b3a56b129afb (MD5) Norris_KJ_D_2012_f3.pdf: 77702 bytes, checksum: af41a167ad2dfc0e3902f04fabe2c0a3 (MD5) Norris_KJ_D_2012_f1.htm: 1071470 bytes, checksum: efb4d5cdb53e2b62e0aa3841c0087cb9 (MD5)   Previous issue date: 2012-02-09"
  ],
  "handle": "26293",
  "identifier_other": "etd-02232012-113551",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02232012-113551/",
  "identifier_uri": "http://hdl.handle.net/10919/26293",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Norris_KJ_D_2012.pdf",
    "Norris_KJ_D_2012_f2.pdf",
    "Norris_KJ_D_2012_f3.pdf",
    "Norris_KJ_D_2012_f1.htm"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "early childhood theories",
    "Virginiaâ  s Foundation Blocks",
    "preschool",
    "scaffolded instruction",
    "play",
    "emergent literacy",
    "spatial reasoning"
  ],
  "title": "Virginiaâ s Foundation Blocks for Early Learning: Interpretation and Implementation by Practitioners",
  "type": "Dissertation"
}