{
  "contributor_author": "Sack, Kathryn Wilkinson",
  "contributor_committeechair": "Creamer, Donald G.",
  "contributor_committeecochair": "Blieszner, Rosemary",
  "contributor_committeemember": [
    "Getz, Hilda M.",
    "Creamer, Elizabeth G.",
    "Hirt, Joan B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:46Z",
  "date_adate": "2001-03-06",
  "date_available": "2014-03-14T20:07:46Z",
  "date_issued": "2001-01-30",
  "date_rdate": "2002-03-06",
  "date_sdate": "2001-02-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract Primary lifelines:  Informal friendship groups of women in higher education  (Abstract) Kathryn W. Sack A qualitative study of women in seven informal friendship groups identified the cognitive, affective, and behavioral processes utilized to support women working in higher education and traced the movement of each group through the friendship phases of formation, maintenance, and dissolution.  Phenomenological interviews were conducted with 36 women friendship group members in colleges and universities with different Carnegie classifications throughout the country.  Case data were transcribed and analyzed using  constant comparison with the aid of qualitative research software QSR NUDISTâ ¢ and NVIVOâ ¢.  Findings of the study encompass three major areas: (1) results highlighted the influences of context on development of friendship groups at the personal, network, community, and societal levels; (2) the processes which demonstrate trust at cognitive, affective, and behavioral levels of group interaction; and (3) the major role that friendship groups play in providing psychological support, affirmation, and  instrumental aid for some women entering academe in professional roles and (4) showed how friendship group phases affect development of cohesive groups through factors such as constant renewal and group interaction style.  The continued involvement of women in informal friendship groups depended upon the intersection of context, group cohesiveness, and changing expectations of members as individuals and groups moved through phases of group development from formation to maintenance and possible dissolution. The findings of this study challenge higher education to move toward significant changes in policies regarding hiring and retention all employees, especially women and minorities.  Issues of community and context must be addressed in order to retain and support newly hired faculty and staff.  Varying forms of support must be initiated institutionally to provide opportunities for productive career development of employees. Recommendations for further study include further inquiry into the impact of context on the development of women's friendships, friendships as a factor of support for retention of women staff and faculty, factors affecting generativity (constant renewal) in friendship groups over time, and the effects of race, class, and confrontational style on friendship group cohesion.",
  "description_provenance": [
    "Author Email: kwsack@nr.infi.net",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Advisor Email: creamere@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:46Z (GMT). No. of bitstreams: 2 ETD.pdf: 656275 bytes, checksum: d48cb9de219a0abea441a3f8c976bfb2 (MD5) ETD.pdf: 656275 bytes, checksum: d48cb9de219a0abea441a3f8c976bfb2 (MD5)   Previous issue date: 2001-01-30"
  ],
  "handle": "26297",
  "identifier_other": "etd-02242001-202119",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02242001-202119/",
  "identifier_uri": "http://hdl.handle.net/10919/26297",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ETD.pdf",
    "ETD.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Women",
    "support",
    "higher education",
    "networks",
    "friendship"
  ],
  "title": "Primary Lifelines: Friendship Groups of Women in Higher Education",
  "type": "Dissertation"
}