{
  "contributor_author": "Mallalieu, Lynnea Anne",
  "contributor_committeechair": "Nakamoto, Kent",
  "contributor_committeemember": [
    "Brinberg, David L.",
    "Sirgy, M. Joseph",
    "Axsom, Daniel K.",
    "Fern, Edward F."
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:07:47Z",
  "date_adate": "2000-04-26",
  "date_available": "2014-03-14T20:07:47Z",
  "date_issued": "2000-04-14",
  "date_rdate": "2001-04-26",
  "date_sdate": "2000-02-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research examines the effects of consumer motivation during an interpersonal sales encounter.  The research proposes that a consumer's motivational mind-set affects the consumer's cognitive appraisal of the salesperson and the consumer's subsequent emotional response.  Of primary interest is the interaction between a consumer's motivation and a salesperson's behavior.  A main thesis of this research is that a congruency mechanism operates between the consumer and the salesperson during a sales encounter.  Depending on the consumer's mind-set and the behavioral orientation of the salesperson either a congruent or an incongruent situation will be perceived by the consumer.  Based on the congruency mechanism it is proposed that cognitive appraisals concerning goal facilitation will arise that will subsequently trigger specific emotional responses and behavioral outcomes.",
  "description_provenance": [
    "Author Email: lmallali@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:47Z (GMT). No. of bitstreams: 1 lynnea.pdf: 238793 bytes, checksum: 882673a3a5b4e2d3884e3d50dcb18bd4 (MD5)   Previous issue date: 2000-04-14"
  ],
  "handle": "26303",
  "identifier_other": "etd-02252000-10540041",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02252000-10540041/",
  "identifier_uri": "http://hdl.handle.net/10919/26303",
  "publisher": "Virginia Tech",
  "relation_haspart": "lynnea.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "influence strategies",
    "motivation",
    "salesperson behavior",
    "emotion"
  ],
  "title": "An Examination of the Influence of Consumer Motivation on Salesperson Appraisal and Emotional Response to Salesperson Behavior.",
  "type": "Dissertation"
}