{
  "contributor_author": "Ware, Rebecca A",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Craig, James E.",
    "Dawson, Christina M.",
    "Earthman, Glen I."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:46Z",
  "date_adate": "2007-03-07",
  "date_available": "2014-03-14T20:07:46Z",
  "date_issued": "2007-02-08",
  "date_rdate": "2008-03-07",
  "date_sdate": "2007-02-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\"> <html xmlns=\"http://www.w3.org/1999/xhtml\"> <head> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\" /> <title>Rebecca Ware ETD Abstract</title> </head>  <body> <p>The professional development school (PDS) has had a recent resurgence in teacher education. Professional development schools were designed to reform teacher education programs and revitalize K-12 education. The purpose of this study was to evaluate a professional development school: The School Teacher Education Partnership (STEP) at Elizabeth City State University (ECSU). STEP is a partnership between Elizabeth City State University and one elementary school in each of three participating school districts -- Edenton-Chowan, Elizabeth City-Pasquotank, and Gates -- in North Carolina.  </p> <p>The study took place over two years. Participants from the 1998-2001 school years were the primary informants. Data were collected through extended interviews. Documentary data and end-of-the-year qualitative evaluations were used to substantiate interview data. The constant comparative method of Maykut & Morehouse (1994) was used to analyze the data. Data were unitized, coded, grouped, categorized, and compared for patterns and themes.</p> <p> The results of this evaluation were strong enough to recommend that a year-long internship be required for all prospective teachers at the university. The STEP graduates come from the program with strong pedagogical skills. The students are prepared to begin working with children from the first day of teaching. They can manage classes well handling routines with little difficulty.  </p> <p>Mentor teachers were found to be primary contributors to the development of new teachers, and they are paid little for their efforts. It is recommended that they be paid an amount commensurate with their effort and contributions to the development of new teachers. This compensation should be an integral part of the budgets of the state, local, or university agencies responsible for the preparation of teachers. </p> </body> </html>",
  "description_provenance": [
    "Author Email: rware45121@adelphia.net",
    "Advisor Email: craig@vt.edu",
    "Advisor Email: tdawson@antiochsea.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:46Z (GMT). No. of bitstreams: 1 wareetd2.pdf: 722776 bytes, checksum: cbaa36872816e47a978580e27432080c (MD5)   Previous issue date: 2007-02-08"
  ],
  "handle": "26300",
  "identifier_other": "etd-02242007-123911",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02242007-123911/",
  "identifier_uri": "http://hdl.handle.net/10919/26300",
  "publisher": "Virginia Tech",
  "relation_haspart": "wareetd2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Partnerships",
    "Professional development schools",
    "School and university collaboration",
    "Teacher education",
    "Evaluation"
  ],
  "title": "An Evaluation of a Professional Development School: The School Teacher Education Partnership Project",
  "type": "Dissertation"
}