{
  "contributor_author": "South, Joseph Thomas",
  "contributor_committeechair": "Reifsnider, Kenneth L.",
  "contributor_committeemember": [
    "Lesko, John J.",
    "Marand, Hervé L.",
    "Case, Scott W.",
    "Love, Brian J."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:07:47Z",
  "date_adate": "2002-02-28",
  "date_available": "2014-03-14T20:07:47Z",
  "date_issued": "2001-12-14",
  "date_rdate": "2003-02-28",
  "date_sdate": "2002-02-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The focus of this research was to investigate the effect of thermal degradation upon the mechanical properties of natural rubber compounds and apply those effects to the life prediction of off axis 2-ply cord rubber laminates.  The work examined both the quasi-static and dynamic mechanical properties of two natural rubber vulcanizates, which had been subjected to isothermal anaerobic aging.  Thermal aging was performed on two different natural rubber vulcanizates.  The thermal aging was conducted between the temperatures of 80 and 120Â°C for times ranging from 3 to 24 days.  The effect of thermal degradation was measured from the changes in the chemical composition of the vulcanizates as functions of time at temperature.  A master curve relationship between the changes in the chemical composition of the vulcanizates due to thermal degradation and their static and dynamic mechanical properties has been developed.  This relationship allowed for the prediction of the vulcanizate mechanical properties after thermal aging.  It was found that the mechanical properties correlated with the percentage of poly and monosulfidic crosslinks, where in general higher levels of polysulfidic crosslink gave rise to the highest mechanical properties.    Crack propagation in an aged and unaged natural rubber vulcanizate was measured using a double cantilever beam, DCB.  This type of testing arrangement exhibits a plane strain condition and resulted in crack growth rates two orders of magnitude faster than traditional plane stress testing geometries.  To validate the DCB specimens, an investigation into the potential cavitation inside the rubber of the DCB specimens was performed.  It was found that no cavitation occurred due to the high speed of the fracture.  DCB samples were thermally aged to determine the effect of thermal aging upon the crack growth rate.  It was found that crack growth rates increase with thermal aging.  Life prediction of the aged 2-ply laminates was performed using a finite element analysis.  In order to verify the finite element models used in the life prediction, the fatigue failure and crack growth characteristics of off axis 2-ply cord-rubber laminates were examined with a delamination analysis.  This analysis allowed for the determination of the modulus of off axis 2-ply laminates in the presence of damage as well as the calculation of the crack growth rates of the laminate.  The failure of unaged and thermally aged 2-ply laminates was evaluated and compared to the crack growth rates of thermally aged DCB specimens.  The trend due to thermal aging between the two types of testing specimens was consistent.  The finite element analysis was sectioned into two approaches: crack initiation and crack propagation.  The former utilized a residual strength approach, while the latter applied a fracture mechanics approach.  The predicted stress versus cycles, S-N, curves were not in complete agreement with the experimental data.  The error between the predicted and the experimental is discussed and future work to correct that error is suggested.  While there was not complete agreement between the predicted and the experimental data, this dissertation outlines a comprehensive approach to track the effects of thermal degradation and apply those effects to a real world application.",
  "description_provenance": [
    "Author Email: jsouth@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:47Z (GMT). No. of bitstreams: 1 1JTS_ETD.pdf: 1898387 bytes, checksum: a5489334a35c5d3ea990248b4fd6bc50 (MD5)   Previous issue date: 2001-12-14"
  ],
  "handle": "26306",
  "identifier_other": "etd-02252002-131148",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02252002-131148/",
  "identifier_uri": "http://hdl.handle.net/10919/26306",
  "publisher": "Virginia Tech",
  "relation_haspart": "1JTS_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Cord-Rubber Composite",
    "Natural Rubber",
    "Rubber Reversion",
    "Crosslink"
  ],
  "title": "Mechanical Properties and Durability  of Natural Rubber Compounds and Composites",
  "type": "Dissertation"
}