{
  "contributor_author": "Green, Stephen Dale",
  "contributor_committeechair": "Sporakowski, Michael J.",
  "contributor_committeemember": [
    "Peterson, Rick L.",
    "Sargent, Stephanie Lee",
    "Protinsky, Howard O. Jr.",
    "Bird, Gloria W."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:07:47Z",
  "date_adate": "2000-02-29",
  "date_available": "2014-03-14T20:07:47Z",
  "date_issued": "2000-01-31",
  "date_rdate": "1900-02-02",
  "date_sdate": "2000-02-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to compare couples in different phases of marriage with the primary goal of contributing to our understanding of marital quality throughout the life span.  Rusbult's investment theory (Rusbult, 1980, 1983; Rusbult & Buunk, 1993), which predicts specific outcomes concerning relationship satisfaction, commitment, and stability, served as the guiding theory behind this effort.  Assumptions derived from the theory were tested with couples in three distinct phases of marriage selected from the first wave of the National Survey of Families and Households (Sweet, Bumpass, & Call, 1988).  Short-term couples consisted of husbands and wives married between 4 and 6 years, intermediate couples consisted of those married between 20 and 25 years, and long-term couples consisted of those married 45 years or more.  <p>  Couples were compared with regard to four specific aspects of their relationships: conflict frequency, conflict resolution, satisfaction, and perceptions of the quality of alternatives to their current marriages.  Data generated from spouses' averaged scores were analyzed using a series of one-way ANOVAs and paired t-tests.  Results from this sample of respondents clearly revealed that long-term couples engaged in less conflict, utilized different conflict resolution strategies, were more satisfied with their marriages, and perceived alternatives to their relationships as less favorable than younger couples.  In addition, when husbands' and wives' scores on the above measures were compared, long-term couples exhibited fewer differences than younger couples.  Findings from this study are discussed in light of existing research and theory.",
  "description_provenance": [
    "Author Email: stgreen2@vt.edu",
    "Advisor Email: rpetersn@vt.edu",
    "Advisor Email: Stephanie.Sargent@vt.edu",
    "Advisor Email: eagle1@vt.edu",
    "Advisor Email: hprotins@vt.edu",
    "Advisor Email: birdfcd@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:47Z (GMT). No. of bitstreams: 1  future.pdf: 130741 bytes, checksum: 9bfd0ce1803805d1dea9bf70df21d0eb (MD5)    Previous issue date: 2000-01-31"
  ],
  "handle": "26304",
  "identifier_other": "etd-02252000-13520049",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02252000-13520049/",
  "identifier_uri": "http://hdl.handle.net/10919/26304",
  "publisher": "Virginia Tech",
  "relation_haspart": "future.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Marital Satisfaction",
    "Conflict",
    "Long-Term Marriages",
    "Marital Quality"
  ],
  "title": "Is the Future Better Than the Past?  An Empirical Comparison of Marital Quality Among Short-Term, Intermediate-Term, and Long-Term Couples",
  "type": "Dissertation"
}