{
  "contributor_author": "Pando, Miguel A.",
  "contributor_committeecochair": [
    "Lesko, John J.",
    "Filz, George M."
  ],
  "contributor_committeemember": [
    "Dove, Joseph E.",
    "Cousins, Thomas E.",
    "Brandon, Thomas L."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:07:49Z",
  "date_adate": "2003-03-05",
  "date_available": "2014-03-14T20:07:49Z",
  "date_issued": "2003-02-06",
  "date_rdate": "2004-03-05",
  "date_sdate": "2003-02-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Typically, foundation piles are made of materials such as steel, concrete, and timber. Problems associated with use of these traditional pile materials in harsh marine environments include steel corrosion, concrete deterioration, and marine borer attack on timber piles. It has been estimated that the U.S. spends over $1 billion annually in repair and replacement of waterfront piling systems. Such high repair and replacement costs have led several North American highway agencies and researchers to investigate the feasibility of using composite piles for load bearing applications, such as bridge substructures. As used here, the term â  composite pilesâ   refers to alternative pile types composed of fiber reinforced polymers (FRPs), recycled plastics, or hybrid materials. Composite piles may exhibit longer service lives and improved durability in harsh marine environments, thereby presenting the potential for substantially reduced total costs. Composite piles have been available in the North American market since the late 1980â  s, but have not yet gained wide acceptance in civil engineering practice. Potential disadvantages of composite piles are high initial cost and questions about engineering performance. At present, the initial cost of composite piles is generally greater than the initial cost of traditional piles. Performance questions relate to driving efficiency, axial stiffness, bending stiffness, durability, and surface friction. These questions exist because there is not a long-term track record of composite pile use and there is a scarcity of well-documented field tests on composite piles.  This research project was undertaken to investigate the engineering performance of composite piles as load-bearing foundation elements, specifically in bridge support applications. The objectives of this research are to: (1) evaluate the soil-pile interface behavior of five composite piles and two conventional piles, (2) evaluate the long-term durability of concrete-filled FRP composite piles, (3) evaluate the driveability and the axial and lateral load behavior of concrete-filled FRP composite piles, steel-reinforced recycled plastic composite piles, and prestressed concrete piles through field tests and analyses, and (4) design and implement a long-term monitoring program for composite and conventional prestressed concrete piles supporting a bridge at the Route 351 crossing of the Hampton River in Virginia. A summary of the main findings corresponding to each of these objectives is provided below. A laboratory program of interface testing was performed using two types of sands and seven pile surfaces (five composite piles and two conventional piles). The interface behavior of the different pile surfaces was studied within a geotribology framework that investigated the influence of surface topography, interface hardness, and particle size and shape. In general, the interface friction angles, both peak and residual, were found to increase with increasing relative asperity height and decreasing relative asperity spacing. The interface shear tests for the three pile types tested at the Route 351 bridge showed that, for medium dense, subrounded to rounded sand, with a mean particle size of 0.5 mm, the residual interface friction angles are 27.3, 24.9, and 27.7 degrees for the FRP composite pile, the recycled plastic pile, and the prestressed concrete pile, respectively. Interface shear tests on these same piles using a medium dense, subangular to angular sand, with a mean particle size of 0.18 mm, resulted in residual interface friction angles of 29.3, 28.8, and 28.0 degrees for the FRP composite pile, the recycled plastic pile, and the prestressed concrete pile, respectively. A laboratory durability study was completed for the FRP shells of concrete-filled FRP composite piles. Moisture absorption at room temperature caused strength and stiffness degradations of up to 25% in the FRP tubes. Exposure to freeze-thaw cycles was found to have little effect on the longitudinal tensile properties of saturated FRP tubes.  Analyses were performed to investigate the impact of degradation of the FRP mechanical properties on the long-term structural capacity of concrete-filled FRP composite piles in compression and bending. The impact was found to be small for the axial pile capacity due to the fact that the majority of the capacity contribution is from the concrete infill. The impact of FRP degradation was found to be more significant for the flexural capacity because the FRP shell provides most of the capacity contribution on the tension side of the pile. Full-scale field performance data was obtained for two composite pile types (concretefilled FRP composite piling and steel-reinforced recycled plastic piling), as well as for conventional prestressed concrete piles, by means of load test programs performed at two bridge construction sites: the Route 351 bridge and the Route 40 bridge crossing the Nottoway River in Virginia. The field testing at the two bridges showed no major differences in driving behavior between the composite piles and conventional prestressed concrete piles. Pile axial capacities of the composite piles tested at the Route 351 bridge were between 70 to 75% of the axial capacity of the prestressed concrete test pile. The FRP and prestressed concrete piles exhibited similar axial and lateral stiffness, while the steel-reinforced plastic pile was not as stiff. Conventional geotechnical analysis procedures were used to predict axial pile capacity, axial load-settlement behavior, and lateral load behavior of the piles tested at the Route 351 bridge. The conventional analysis procedures were found to provide reasonable predictions for the composite piles, or at least to levels of accuracy similar to analyses for the prestressed concrete pile. However, additional case histories are recommended to corroborate and extend this conclusion to other composite pile types and to different soil conditions. A long-term monitoring program for composite and conventional prestressed concrete piles supporting the Route 351 bridge was designed and implemented. The bridge is still under construction at the time of this report, therefore no conclusions have been drawn regarding the long-term performance of concrete-filled FRP composite piles. The longterm monitoring will be done by the Virginia Department of Transportation.  In addition to the above findings, initial cost data for the composite piles and prestressed concrete piles used in this research were compiled. This data may be useful to assess the economic competitiveness of composite piles. The initial unit cost of the installed composite piles at the Route 40 bridge were about 77 % higher than the initial unit cost for the prestressed concrete piles. The initial unit costs for the composite piles installed at the Route 351 bridge were higher than the initial unit cost of the prestressed concrete piles by about 289% and 337% for the plastic and FRP piles, respectively. The cost effectiveness of composite piles is expected to improve with economies of scale as production volumes increase, and by considering the life-cycle costs of low-maintenance composite piles.",
  "description_provenance": [
    "Author Email: mpando@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: jodove@vt.edu",
    "Advisor Email: tcousins@vt.edu",
    "Advisor Email: tbrandon@vt.edu",
    "Advisor Email: filz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:49Z (GMT). No. of bitstreams: 21 19_APPENDIX_C.pdf: 235893 bytes, checksum: 5e6b0a31f077d59f92ab384ec43a83a2 (MD5) 17_APPENDIX_A.pdf: 1220745 bytes, checksum: f7e17b3dd5e5c6cc7033a06716caa773 (MD5) 02_ABSTRACT.pdf: 10445 bytes, checksum: 01f1374b961bed27e89bfb49a8e1899f (MD5) 05_Chapter_1.pdf: 77064 bytes, checksum: 9dfcfb764a6a60acaec4611fe7f0af5e (MD5) 21_VITA.pdf: 37438 bytes, checksum: 7b384f6c393dede1d454cd2a44398505 (MD5) 09_CHAPTER_5.pdf: 1123195 bytes, checksum: 68e4cc2294e97f60897f311dd0825fd6 (MD5) 13_CHAPTER_9.pdf: 855857 bytes, checksum: e95bfb37bdd8e07ffead74c8965a5713 (MD5) 08_CHAPTER_4.pdf: 994016 bytes, checksum: 6850ffe0c16b731ac76777aefa007c51 (MD5) 16_REFERENCES.pdf: 149510 bytes, checksum: 401af3fd59e3d9c415e87923cbe25359 (MD5) 07_CHAPTER_3.pdf: 1077930 bytes, checksum: 91b684b9aa1df6a3dd7648bf7ba71d7d (MD5) 11_CHAPTER_7.pdf: 545283 bytes, checksum: 6c9f9b73848620f5db2539b0fab6a48b (MD5) 01_COVER.pdf: 51026 bytes, checksum: bd8f9052c8b3a0aac40b08fcc27634a2 (MD5) 06_Chapter_2.pdf: 408540 bytes, checksum: 3f840bb8409a1da72aba7b5e201e046a (MD5) 20_APPENDIX_D.pdf: 842691 bytes, checksum: f014bbf6f0fab5197e4b8b1be7ba0de3 (MD5) 10_CHAPTER_6.pdf: 2856265 bytes, checksum: 0372e0fdf6351ac5c9c153d5cfe65f7d (MD5) 04_Table_of_contents.pdf: 46404 bytes, checksum: 5dd8a4b9f204bc9c7de3ab83a6183ff1 (MD5) 12_CHAPTER_8.pdf: 551395 bytes, checksum: 55382421067f971fb6d2a2d7c5a95733 (MD5) 15_CHAPTER_11.pdf: 134362 bytes, checksum: 9c44566ef5eee8be3ca8fb3b60451dae (MD5) 03_ACKNOWLEDGEMENTS.pdf: 67630 bytes, checksum: 679dd8493e91c84923d044497bc53f6b (MD5) 14_CHAPTER_10.pdf: 82176 bytes, checksum: bbe11401931b5bb010f203e2307edf2b (MD5) 18_APPENDIX_B.pdf: 126781 bytes, checksum: 8d4caa28bab7bf6dda630b5c93742b26 (MD5)   Previous issue date: 2003-02-06"
  ],
  "handle": "26314",
  "identifier_other": "etd-02262003-111330",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02262003-111330/",
  "identifier_uri": "http://hdl.handle.net/10919/26314",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "19_APPENDIX_C.pdf",
    "17_APPENDIX_A.pdf",
    "02_ABSTRACT.pdf",
    "05_Chapter_1.pdf",
    "21_VITA.pdf",
    "09_CHAPTER_5.pdf",
    "13_CHAPTER_9.pdf",
    "08_CHAPTER_4.pdf",
    "16_REFERENCES.pdf",
    "07_CHAPTER_3.pdf",
    "11_CHAPTER_7.pdf",
    "01_COVER.pdf",
    "06_Chapter_2.pdf",
    "20_APPENDIX_D.pdf",
    "10_CHAPTER_6.pdf",
    "04_Table_of_contents.pdf",
    "12_CHAPTER_8.pdf",
    "15_CHAPTER_11.pdf",
    "03_ACKNOWLEDGEMENTS.pdf",
    "14_CHAPTER_10.pdf",
    "18_APPENDIX_B.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Composites",
    "Soil-Structure Interaction",
    "Durability",
    "FRP",
    "Piles",
    "Bridges"
  ],
  "title": "A Laboratory and Field Study of Composite Piles for Bridge Substructures",
  "type": "Dissertation"
}