{
  "contributor_author": "Zhai, Junyi",
  "contributor_committeechair": "Viehland, Dwight D.",
  "contributor_committeemember": [
    "Wang, Yu",
    "Aning, Alexander O.",
    "Priya, Shashank",
    "Li, Jie-Fang"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:07:48Z",
  "date_adate": "2009-03-12",
  "date_available": "2014-03-14T20:07:48Z",
  "date_issued": "2009-02-10",
  "date_rdate": "2012-03-27",
  "date_sdate": "2009-02-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Since the turn of the millennium, giant magnetoelectric (ME) effects have been found in laminated composites of piezoelectric and magnetostrictive layers. Compared to ME single phase and two phase particulate composites, laminated composites have much higher ME coefficients and are also readily fabricated. In this thesis, I have investigated ME effect in laminated composites including materials, structures, fundamental properties and devices.  Giant permeability Metglas was incorporated in ME laminates. The piezomagnetic coefficient of the Metglas is larger than that of widely used magnetostrictive materials, such as Terfenol-D or nickel ferrite. The experimental results show that Metglas based ME laminates have giant ME voltage coefficients and small required DC magnetic biases. Besides, the laminates have a good directional dependence of the magnetic field: it can only sense the magnetic field along its longitudinal direction. Symmetric bimorph and differential mode magnetoelectric laminates have been designed to reject (decrease) thermal and vibration noise sources, respectively. The mechanism for the noise cancellation capability is that the laminate operates in a bending (or longitudinal) mode, whereas the noise is contained in the other mode. <p> The ME susceptibility (ï ¡me) is the fundamental property that describes the coupling between the polarization and magnetization of a ME media. It is a complex quantity ( ). I discuss the relationship of the ME susceptibility between the magnetic permeability, dielectric permittivity of the materials, and the widely used ME voltage coefficient. The shape of the magnetic layer has a large impact on the giant permeability due to shape demagnetization effects. A long, thin and narrow shape increases the ME voltage coefficient and decreases the required optimum DC bias. The resonance frequency of Terfenol-D/PZT laminates can be continuously tuned by magnetic field over a wide range. This large tunability is due to the large magnetostriction of Terfenol-D. It results in a dramatic increase in the bandwidth over which devices might take advantage of the resonance enhanced ME coefficient. <p> Four device applications have also been studied based on the giant ME effect of laminate composites. (i) ME laminates offer much potential for low-frequency (10-2 to 103 Hz) detection of minute magnetic fields (10-12Tesla or below) in a passive mode of operation. With a wrapped active coil, the Metglas/PZT laminates are also capable of detecting changes of 0.8 nano-Tesla in DC magnetic fields without an applied DC bias. (ii) A geomagnetic field sensor is shown to have high sensitivity to variations in Earthâ  s field of HDC=0.8nano-Tesla. It could offer potential applications in global positioning. (iii) Under electro-mechanical resonance drive conditions, ME laminates have been shown to have a high gyration effect. These findings indicate the potential existence of a fifth fundamental network element. (iv) A multimodal system has been developed for simultaneously harvesting mechanical vibration and magnetic energies.",
  "description_provenance": [
    "Author Email: zhjy@vt.edu, junyizhai@gmail.com",
    "Advisor Email: yuwang@mse.vt.edu",
    "Advisor Email: aaning@vt.edu",
    "Advisor Email: spriya@vt.edu",
    "Advisor Email: jiefang@mse.vt.edu",
    "Advisor Email: dviehlan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:48Z (GMT). No. of bitstreams: 1 Junyithesis.pdf: 1966783 bytes, checksum: ca6af2516c86eafedb654e0f9f5d3181 (MD5)   Previous issue date: 2009-02-10"
  ],
  "handle": "26310",
  "identifier_other": "etd-02252009-012500",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02252009-012500/",
  "identifier_uri": "http://hdl.handle.net/10919/26310",
  "publisher": "Virginia Tech",
  "relation_haspart": "Junyithesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Magnetoelectric",
    "laminates",
    "devices",
    "piezoelectric",
    "magnetostrictive"
  ],
  "title": "Magnetoelectric laminated composites and devices",
  "type": "Dissertation"
}