{
  "contributor_author": "Thomas, Courtney Irene Powell",
  "contributor_committeechair": "Edward Weisband",
  "contributor_committeemember": [
    "Ioannis A. Stivachtis",
    "Renee R. Boyer",
    "Luke, Timothy W."
  ],
  "contributor_department": "Planning, Governance, and Globalization",
  "date_accessioned": "2014-03-14T20:07:48Z",
  "date_adate": "2010-03-22",
  "date_available": "2014-03-14T20:07:48Z",
  "date_issued": "2010-02-22",
  "date_rdate": "2013-05-21",
  "date_sdate": "2010-02-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "One of the great myths of contemporary U.S. culture is that Americaâ  s food supply is the safest in the world. Another is that government agencies have the ability and authority to guarantee food safety and to enforce accountability standards upon food producers, processors, and distributors.  But the U.S. food safety regulatory regime is as it has been for more than a century: embedded in the notions of food purity and wholesomeness that framed the 1906 Pure Food and Drug Act and the 1906 Federal Meat Inspection Act.  Although changes in food production, processing, and distribution that occurred throughout the 20th century have rendered this regulatory regime ineffective and inefficient, efforts to amend its regulatory scope and power have been largely unsuccessful.  Current proposals to transform this system, including the Food Safety Modernization Act of 2009 and the Food Safety Enhancement Act of 2009, however, would expand the power of government agencies to require process-based food safety systems, to test for contamination, to issue recalls, and to institute traceability protocols for all food products.  Yet much of the economic literature critiques this top-down approach to regulation.  Beginning with an overview of U.S. food safety and its regulation, this dissertation examines the relative effectiveness and efficiency of \"top-down\" \"command and control\" versus  \"bottom up\" \"market driven\" regulatory regimes designed to resolve market failures and promote accountability relative to food safety.  It includes an analysis of the impact and influence of food producing, processing, and distributing firms upon the policy process, examining when, why, and how large agri-food corporations support or oppose changes to the food safety regulatory regime and accountability framework, and concludes with an investigation of food safety crises as a catalyst for political change.",
  "description_provenance": [
    "Author Email: cipt@courtneyipthomas.com",
    "Advisor Email: ystivach@vt.edu",
    "Advisor Email: rraiden@vt.edu",
    "Advisor Email: weisband@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:48Z (GMT). No. of bitstreams: 1  Thomas_CIP_D_2010.pdf: 882255 bytes, checksum: 9455e3515894716c916c8c4b114ae27d (MD5)    Previous issue date: 2010-02-22"
  ],
  "handle": "26312",
  "identifier_other": "etd-02252010-141422",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02252010-141422/",
  "identifier_uri": "http://hdl.handle.net/10919/26312",
  "publisher": "Virginia Tech",
  "relation_haspart": "Thomas_CIP_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "political economy",
    "accountability",
    "public policy",
    "market failures",
    "regulation"
  ],
  "title": "The Problem with Purity: Market Failures, Foodborne Contamination, and the Search for Accountability in the U.S. Food Safety Regulatory Regime",
  "type": "Dissertation"
}