{
  "contributor_author": "Adamson, Nancy Lee",
  "contributor_committeecochair": [
    "Mullins, Donald E.",
    "Fell, Richard D."
  ],
  "contributor_committeemember": [
    "Roulston, T'ai H.",
    "Pfeiffer, Douglas G.",
    "Kennedy, Lisa M."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:07:48Z",
  "date_adate": "2011-03-22",
  "date_available": "2014-03-14T20:07:48Z",
  "date_issued": "2011-02-03",
  "date_rdate": "2011-03-22",
  "date_sdate": "2011-02-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Declines in pollinators around the globe, notably the loss of honey bees (Apis mellifera L.) to Colony Collapse Disorder, coupled with a dearth of quantitative data on non-Apis bee pollinators, led to this dissertation research, which documents the role of non-Apis bees in crop pollination in southwest Virginia. Major findings of this first study of its kind in the region were that non-Apis bees provided the majority of pollinationâ  measured by visitationâ  for several economically important entomophilous crops (apple, blueberry, caneberry, and cucurbits); diverse bee populations may be helping to stabilize pollination service (105 species on crop flowers); landscape factors were better predictors of non-Apis crop pollination service than farm management factors or overall bee diversity; and non-Apis bees in the genera Andrena, Bombus, and Osmia were as constant as honey bees when foraging on apple. \tNon-Apis, primarily native, bees made up between 68% (in caneberries) and 83% (in cucurbits) of bees observed visiting crop flowers. While 37â  59 species visited crop flowers, there was low correspondence between bee communities across or within crop systems (â  within cropâ   Jaccard similarity indices for richness ranged from 0.12â  0.28). Bee community diversity on crop flowers may help stabilize pollination service if one or more species declines temporally or spatially. A few species were especially important in each crop: Andrena barbara in apple; Andrena carlini and A. vicina in blueberry; Lasioglossum leucozonium in caneberry; and Peponapis pruinosa and Bombus impatiens in cucurbits. Eight species collected were Virginia state records.  \tIn models testing effects of farm management and landscape on non-Apis crop pollination service, percent deciduous forest was positively correlated in apple, blueberry, and squash, but at different scales. For apple and blueberry, pollination service declined with an increase in utilized alternative forage but was positively related to habitat heterogeneity. For squash, percent native plants also related positively, possibly due to increased presence of bumble bees in late summer. \tSpecies collected from both bowl traps and flowers was as low as 22% and overall site bee diversity had no effect on crop pollination service, highlighting the value in pollination research of monitoring bees on flowers.",
  "description_provenance": [
    "Author Email: nladamson@gmail.com",
    "Advisor Email: tai.roulston@virginia.edu",
    "Advisor Email: dgpfeiff@vt.edu",
    "Advisor Email: likenne1@vt.edu",
    "Advisor Email: mullinsd@vt.edu",
    "Advisor Email: rfell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:48Z (GMT). No. of bitstreams: 1 Adamson_NL_D_2011.pdf: 5767325 bytes, checksum: 5984a86ba217b07317f0015d52fd126d (MD5)   Previous issue date: 2011-02-03"
  ],
  "handle": "26313",
  "identifier_other": "etd-02252011-134549",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02252011-134549/",
  "identifier_uri": "http://hdl.handle.net/10919/26313",
  "publisher": "Virginia Tech",
  "relation_haspart": "Adamson_NL_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "pollinators",
    "native bees",
    "ecosystem services",
    "southwest Virginia agriculture",
    "non-Apis bee crop pollination",
    "pollination"
  ],
  "title": "An Assessment of Non-Apis Bees as Fruit and Vegetable Crop Pollinators in Southwest Virginia",
  "type": "Dissertation"
}