{
  "contributor_author": "Kim, Meeok",
  "contributor_committeecochair": [
    "Filz, George M.",
    "Plaut, Raymond H."
  ],
  "contributor_committeemember": [
    "Rojiani, Kamal B.",
    "Gutierrez, Marte S.",
    "Roberts-Wollmann, Carin L."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:07:49Z",
  "date_adate": "2003-03-17",
  "date_available": "2014-03-14T20:07:49Z",
  "date_issued": "2003-02-06",
  "date_rdate": "2004-03-17",
  "date_sdate": "2003-02-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Two-dimensional analysis of four types of water-filled tube dams is carried out: an apron-tube dam, a single baffle tube dam, a sleeved tube dam, and a stacked tube dam. Since the analysis of the water-filled tube dam involves highly nonlinear geometric deformations and interactions with soil, fluid, and structure, it is solved numerically with the explicit finite difference program FLAC. The tube is numerically modeled with beam elements. The predicted contact regions are modeled with interface elements. The Mohr-Coulomb constitutive model is used for the soil. Water inside and outside of the tube is modeled as hydrostatic pressure and the pressures are continuously updated as the configuration of the tube is changed. The change of the internal water pressure head (IWPH) for maintaining a constant tube area during the deformation is simulated. The simulation is achieved by two iterative procedures, the secant method and the factored secant method. The numerical analysis results show good agreement with the experimental results overall: the deformation of the tube(s), the IWPH changes, and the critical external water heights. From the numerical simulation of the experiments and the parametric studies, the behavior of each type of water-filled tube dam is clarified. Also, the failure modes of the tube dams are examined. The failure mode of a tube dam depends on the configuration and IWPH of the tube dam and the characteristics of the soil surface.",
  "description_provenance": [
    "Author Email: mekim@vt.edu",
    "Advisor Email: krojiani@vt.edu",
    "Advisor Email: magutier@vt.edu",
    "Advisor Email: filz@vt.edu",
    "Advisor Email: wollmann@vt.edu",
    "Advisor Email: rplaut@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:49Z (GMT). No. of bitstreams: 1 Komoll1.pdf: 4150536 bytes, checksum: c79de26382c71f34418fac2b05a4e6b3 (MD5)   Previous issue date: 2003-02-06"
  ],
  "handle": "26315",
  "identifier_other": "etd-02262003-152755",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02262003-152755/",
  "identifier_uri": "http://hdl.handle.net/10919/26315",
  "publisher": "Virginia Tech",
  "relation_haspart": "Komoll1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Inflatable Tube Dam",
    "FLAC",
    "Flood Protection",
    "Geomembrane",
    "Flexible Structure",
    "Soil-Structure Interaction"
  ],
  "title": "Two-Dimensional Analysis of Four Types of Water-Filled Geomembrane Tubes as Temporary Flood-Fighting Devices",
  "type": "Dissertation"
}