{
  "contributor_author": "Lower, Steven K.",
  "contributor_committeechair": "Hochella, Michael F. Jr.",
  "contributor_committeemember": [
    "Potts, Malcolm",
    "Berry, Duane F.",
    "Tadanier, Christopher J.",
    "Rimstidt, james Donald"
  ],
  "contributor_department": "Geological Sciences and Biochemistry",
  "date_accessioned": "2014-03-14T20:07:49Z",
  "date_adate": "2001-03-03",
  "date_available": "2014-03-14T20:07:49Z",
  "date_issued": "2001-02-22",
  "date_rdate": "2002-03-03",
  "date_sdate": "2001-02-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Biological force microscopy (BFM) was developed to quantitatively measure pico- to nano-Newton forces (10-9 to 10-12 N) as a function of the nanoscale distance (nanometers) between living bacteria and mineral surfaces, in aqueous solution.  Native cells were linked to a force-sensing probe, which was used in a force microscope to measure attractive and repulsive forces as a mineral surface approached, made contact with, and subsequently withdrew from a bacterium on the probe.  The resulting data were used to interpret the interactive dynamics operative between bacteria and mineral surfaces under environmentally relevant conditions.    BFM was used to study bacterial adhesion to mineral surfaces.  In the case of Escherichia coli interactions with goethite, graphite, and muscovite, attractive and repulsive forces were detected at ranges up to 400 nanometers, the magnitude and sign depending on the ionic strength of the intervening solution and the mineral surface charge and hydrophobicity.  Adhesion forces, up to several nanoNewtons in magnitude and exhibiting various fibrillation dynamics, were also measured and reflect the complex interactions of structural and chemical functionalities on the bacteria and mineral surfaces.  In the study of Burkholderia cepecia interactions with mica, it was found that the physiological condition of the cell affected the observed adhesion forces.  Cells grown under oligotrophic conditions exhibited an increased affinity for the mineral surface as opposed to cells grown under eutropic conditions.     BFM was also used to characterize the transfer of electrons from biomolecules on Shewanella oneidensis to Fe(III) in the structure of goethite.  Force measurements with picoNewton resolution were made in aqueous solution under aerobic and anaerobic conditions.  Energy values (in attoJoules) derived from these measurements show that the affinity between S. oneidensis and goethite rapidly increases by two to five times under anaerobic conditions where electron transfer from bacterium to mineral is expected.  Specific signatures in the force curves, analyzed with the worm-like chain model of protein unfolding, suggest that the bacterium recognizes the mineral surface such that a 150 kDa putative, iron reductase is quickly mobilized within the outer membrane of S. oneidensis and specifically interacts with the goethite surface to facilitate the electron transfer process.",
  "description_provenance": [
    "Author Email: slower@vt.edu",
    "Advisor Email: geordie@vt.edu",
    "Advisor Email: duberry@vt.edu",
    "Advisor Email: ctadanie@vt.edu",
    "Advisor Email: hochella@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:49Z (GMT). No. of bitstreams: 1 dissertation.pdf: 498768 bytes, checksum: d460f2a407ca62efb3e805184ac149ec (MD5)   Previous issue date: 2001-02-22"
  ],
  "handle": "26319",
  "identifier_other": "etd-02272001-145544",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02272001-145544/",
  "identifier_uri": "http://hdl.handle.net/10919/26319",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mineral",
    "AFM",
    "nanoscale",
    "nanotechnology",
    "bacteria",
    "force"
  ],
  "title": "Mineral-Microbe Interactions Probed in Force, Energy, and Distance Nanospace",
  "type": "Dissertation"
}