{
  "contributor_author": "Abraham-Hardee, Sofia E.",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Hosig, Kathryn Wright",
    "Sutphin, H. Dean",
    "Stratton, Richard K."
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:07:49Z",
  "date_adate": "2009-04-20",
  "date_available": "2014-03-14T20:07:49Z",
  "date_issued": "2009-01-30",
  "date_rdate": "2012-03-27",
  "date_sdate": "2009-02-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A mixed method study pretest and posttest research design was used in this study similar to those used by the Expanded Food and Nutrition Education Program (EFNEP) and Women, Infants and Children (WIC). An individual interview method was used to gather the qualitative data. The study was conducted using 26 caretakers and 31 children. No significant change in knowledge in the caretakers was observed across all lessons. A significant gain in knowledge was observed only in the nutrition lesson â  Fruits and Vegetablesâ  . A significant change in household dietary habits was seen when comparing dietary pretest and posttest score in the caretakers. A correlation of 0.33 was observed between dietary posttest scores between caretakers and children. A significant correlation (r2 0.50) was observed between the posttest (1) in caretakers from the nutrition lessons and dietary posttest taken by the caretakers. The need for a social worker, further education and more financial resources were some of the major themes identified by the qualitative component. Self sufficiency, increased evangelism and more trade classes were identified as the future goals of the nutrition program. This study showed that providing nutrition education in the caretakers can have a positive impact on the dietary choices within the household and can be a vital tool to targeting the issues of malnutrition in Tegucigalpa, Honduras.",
  "description_provenance": [
    "Author Email: sabraham@vcom.vt.edu",
    "Advisor Email: khosig@vcom.vt.edu",
    "Advisor Email: dsutphin@vcom.vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:49Z (GMT). No. of bitstreams: 1 Sofiadisseration.pdf: 942130 bytes, checksum: 6562b0c84d056da7a49a496de75454a9 (MD5)   Previous issue date: 2009-01-30"
  ],
  "handle": "26317",
  "identifier_other": "etd-02262009-201230",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02262009-201230/",
  "identifier_uri": "http://hdl.handle.net/10919/26317",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sofiadisseration.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Maluntrition",
    "Nutrition"
  ],
  "title": "Nutrition Knowledge of Honduran Caretakers and Dietary Change of Their Children",
  "type": "Dissertation"
}