{
  "contributor_author": "Hauger, J. Scott",
  "contributor_committeechair": "Barker, Peter",
  "contributor_committeemember": [
    "Hirsh, Richard F.",
    "Burian, Richard M.",
    "Scadden, Lawrence A.",
    "Fuhrman, Ellsworth R.",
    "Zallen, Doris T.",
    "Paterson, Robert A."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:07:50Z",
  "date_adate": "2007-02-27",
  "date_available": "2014-03-14T20:07:50Z",
  "date_issued": "1995-04-05",
  "date_rdate": "2007-02-27",
  "date_sdate": "2007-02-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In 1943, Vannevar Bush established a federal government program within the wartime Office of Scientific Research and Development to develop sensory aids for the blind. From the first, the program was intended to benefit not only veterans but all blind Americans. Over the next forty years, six firms worked to develop reading machines for the blind, with various kinds of federal government support. This dissertation reconstructs the history of that development and innovation effort in order to provide a basis for a broader consideration of technology and social change for persons with disabilities, and to provide recommendations for federal policy in the field of assistive technologies, based on that history, as informed by innovation theory. <p>Between 1943 and 1947, RCA worked under OSRD auspices to develop working prototypes of the A-2 Reader and a unique letter-recognition device. At the same time, Haskins Labs initiated research into the information content of articulated speech which later provided a basis for computer-driven speech synthesizers. This first federal program was terminated at the end of the war, but in 1957, Eugene Murphy of the Veterans Administration revived the program as Congress expanded the scope for federal research. Haskins, Battelle, and Mauch Laboratories worked with the VA in a three-pronged program, but ultimately failed at reading machine innovation. Jim Bliss and John Linvill of Stanford sought but failed to receive VA support. Working with blind students, t.hey ultimately secured funds in 1968, from the newly-established Bureau of Education for the Handicapped. In 1971, they established a firm to produce the Optacon, a reading machine which converts print into a Times Square sign-type tactile output. Over 12,000 Optacons were sold by 1990. <p>In 1975, Raymond Kurzweil sought help from the National Federation of the Blind to develop a synthetic speech reading machine. Kurzweil drew on the knowledge of blind readers, his own expertise at pattern recognition, and a speech synthesizer operating on principles established at Haskins Labs to develop a software-centered reading machine that has sold over 4,000 units. <p>The successful innovators sought knowledge from blind readers early on. They systematically pursued innovation. They stabilized a design through reiterative development drawing on social as well as scientific and engineering know ledge. They understood their practice of technology development in a different way from the linear model implicit in the practices of those developers who failed. <p>The historical cases provide a basis for informing federal innovation policy when considered in the light of emerging innovation theory. Technology developers should seek to incorporate social knowledge in their development practices prior to innovation and the establishment of a market.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:07:50Z (GMT). No. of bitstreams: 1 LD5655.V856_1995.H384.pdf: 36597564 bytes, checksum: fbfddb16ded9045ded2f8939ec9eafc8 (MD5)   Previous issue date: 1995-04-05",
  "format_medium": "BTD",
  "handle": "26321",
  "identifier_other": "etd-02272007-092410",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02272007-092410/",
  "identifier_uri": "http://hdl.handle.net/10919/26321",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1995.H384.pdf",
  "subject": [
    "Blind",
    "Disability",
    "Innovation",
    "Technology",
    "Reading"
  ],
  "subject_lcc": "LD5655.V856 1995.H384",
  "title": "Reading machines for the blind : a study of federally supported technology development and innovation",
  "type": "Dissertation"
}