{
  "contributor_author": "Kim, Dongshin",
  "contributor_committeechair": "Hult, Karen M.",
  "contributor_committeemember": [
    "Roberts, Patrick S.",
    "Choi, Sang O.",
    "Dudley, Larkin S."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:07:51Z",
  "date_adate": "2011-03-08",
  "date_available": "2014-03-14T20:07:51Z",
  "date_issued": "2011-02-11",
  "date_rdate": "2011-03-08",
  "date_sdate": "2011-02-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As current social problems grow more complex, public organizations have to deal with more complicated problems and values than in the past. Public organizations arguably need more knowledge to effectively address such complex problems. However, there is little study of the relationship between knowledge sharing and government performance. This study has several primary purposes. First, it tries to find out more about the roles and effects of knowledge sharing on program performance in public organizations. Second, by examining the factors affecting the relationships between knowledge sharing and program performance, the study explores the importance of individual and organizational conditions in connecting knowledge sharing to program performance. Lastly, the study helps clarify the effect of knowledge sharing on program performance by also examining other factors that are likely to affect program performance.  To explore the relationships among explicit and tacit knowledge sharing, public service motivation, self-set goals, red tape, economic conditions, staffersâ   professionalism, budgetary resources, and program performance, I examined Virginiaâ  s Child Protective Services program. The Virginia Department of Social Services determines the guidelines and policies for the stateâ  s CPS program and supervises its implementation by local agencies. I focused on the implementation of the CPS program. The study examined the relationships between CPS program performance and the degree and dynamics of knowledge sharing at the local jurisdictional and at the individual social worker levels in each of the 23 local CPS departments in which staffers responded to an on-line survey. In addition to these relationships, the study examined the effects of individual, organizational, and financial factors in Virginia local CPS departments on the relationships between knowledge sharing and program performance. The study yielded numerous findings. First, at the local agency level evidence showed that explicit knowledge sharing played an important role in affecting CPS program performance. At the individual level, only the reported usefulness of explicit knowledge sharing affected CPS program performance, while the usefulness of tacit knowledge sharing and time devoted to explicit knowledge sharing affected usefulness of explicit knowledge sharing. The personal motivation of CPS staffers influenced program performance through tacit knowledge sharing, and red tape evidently affected CPS program performance by decreasing explicit and tacit knowledge sharing. Even when factors like local economic conditions and available financial resources were taken into account, the usefulness of explicit knowledge sharing still affected CPS program performance. Second, the relationships among time devoted to, usefulness of, and access to explicit and tacit knowledge sharing were diverse. They affected CPS program performance through the reported usefulness of explicit and tacit knowledge sharing. Third, individual and organizational factors influenced the relationship between knowledge sharing and CPS program performance. The personal motivation of CPS staffers had a positive effect on tacit knowledge sharing, but red tape appeared to have a negative effect on explicit and tacit knowledge sharing. Fourth, the study showed that several factors other than knowledge sharing such as local economic conditions, work training of CPS staffers, family assessments, CPS staffer education, and additional budgetary resources also affected CPS program performance.",
  "description_provenance": [
    "Author Email: dkim73@vt.edu",
    "Advisor Email: robertsp@vt.edu",
    "Advisor Email: sang@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:51Z (GMT). No. of bitstreams: 2 Kim_Dongshin_D_2011_IRB.pdf: 245396 bytes, checksum: 4a3622af1b8576eb8ebb2525289d5e1f (MD5) Kim_Dongshin_D_2011.pdf: 2116211 bytes, checksum: 23fa83e77a6a54fa5378490604213655 (MD5)   Previous issue date: 2011-02-11"
  ],
  "handle": "26328",
  "identifier_other": "etd-02282011-180027",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02282011-180027/",
  "identifier_uri": "http://hdl.handle.net/10919/26328",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Kim_Dongshin_D_2011_IRB.pdf",
    "Kim_Dongshin_D_2011.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Red tape",
    "Explicit knowledge",
    "CPS program",
    "Street-level bureaucrats",
    "Program performance",
    "Knowledge sharing",
    "Personal motivation",
    "Tacit knowledge"
  ],
  "title": "The Effects of Knowledge Sharing on Program Performance:  Influences on CPS Program Performance",
  "type": "Dissertation"
}