{
  "contributor_author": "Chisom, Brian  Thomas",
  "contributor_committeechair": "Janosik, Steven M.",
  "contributor_committeemember": [
    "Puckett, Anita M.",
    "Hirt, Joan B.",
    "Creamer, Elizabeth G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:50Z",
  "date_adate": "2009-04-20",
  "date_available": "2014-03-14T20:07:50Z",
  "date_issued": "2009-01-29",
  "date_rdate": "2009-04-20",
  "date_sdate": "2009-02-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Influence of Private Colleges on Appalachian Identity: A Descriptive Case Study Brian T. Chisom Abstract \tThe purpose of this study was to describe the role private colleges in Appalachia play in shaping the region's identity using a descriptive case study method of inquiry. Private colleges have served a vital role in Appalachia in that they have allowed many students in the region the opportunity to attain a college degree. Consequently, these institutions have afforded students in the Appalachian region the chance for a higher quality of life than many of their parents or grandparents (Lloyd, 1969; Neal, 1983; Searles, 1995).However, these same colleges have also served as interveners in Appalachia, and thus been involved in the formation of the region's identity with both positive and negative consequences (Ashworth, 1913; McNeil, 1995; Whisnant, 1994). This study explored Grant College's impact on Appalachian identity by seeking an emic characterization of the institution's role in the region from faculty, staff and students, and the institution's public proclamations. Additionally, this research provided insights into the historic and evolving role of private colleges in the Appalachian region as well as the influence of higher education on regional identity. The findings of this study indicated that Grant College is not engaged in systematic cultural intervention in Appalachia; however, this study does not conclude this is necessarily the case at other institutions in the region.Further exploration of this topic might yield different findings and expand upon the research produced in this study.",
  "description_provenance": [
    "Advisor Email: apuckett@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: creamere@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:50Z (GMT). No. of bitstreams: 1 DissertationFinalNew.pdf: 1073418 bytes, checksum: 5d7cb93c29a69e72eb37c5406cd49d59 (MD5)   Previous issue date: 2009-01-29"
  ],
  "handle": "26323",
  "identifier_other": "etd-02272009-121455",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02272009-121455/",
  "identifier_uri": "http://hdl.handle.net/10919/26323",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationFinalNew.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Identity",
    "Higher Education",
    "Appalachia"
  ],
  "title": "The Influence of Private Colleges on Appalachian Identity: A Descriptive Case Study",
  "type": "Dissertation"
}