{
  "contributor_author": "Abdel-Rahman, Mohamed  A.",
  "contributor_committeechair": "Besieris, Ioannis M.",
  "contributor_committeemember": [
    "Shaarawi, Amr M.",
    "Scales, Wayne A.",
    "Kohler, Werner E.",
    "Elshabini-Riad, Aicha A."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:07:54Z",
  "date_adate": "1998-01-30",
  "date_available": "2014-03-14T20:07:54Z",
  "date_issued": "1997-12-17",
  "date_rdate": "1998-01-30",
  "date_sdate": "1997-12-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "(ABSTRACT)  A study is undertaken of the numerical reconstruction of  acoustic and electromagnetic (EM) localized waves (LWs). The  latter are carrier-free ultra-wideband pulses characterized  by large focusing depths and extended ranges of localization.  Special emphasis is placed on finite energy LWs that can be generated by dynamic aperture antennas with independently addressable elements. The reconstruction techniques are based  on Huygens and Rayleigh-Sommerfeld integral I and II  representations, both in the time and frequency domains. In  contradistinction to the Weyl representation,they lend  themselves to the physical realization of space-time aperture sources capable of generating localized wave solutions  propagating away from the aperture plane. A detailed  comparison of the three reconstruction techniques has been carried out in connection with LW solutions to the scalar wave equation, especially with respect to their handling of  acausal components incorporated in the aperture excitation  fields. In addition, a study is presented of the characteristic  properties of LWs propagating through dispersive media modeled  by the Klein-Gordon equation. It is demonstrated that  contrary to expectation, the depletion of the spectral  components of the LW Klein-Gordon field may be slower than  that associated with the free space scalar field. Previous work by Power et al. [73] is extended by studying the acoustic  bistatic scattering of a modified power spectrum (MPS) pulse  from rigid and compressible spheres. The analysis allows the  extraction of the radius of a sphere from the backscattered data. Finally, a special class of electromagnetic (EM) LWs,  referred to as azimuthally polarized X waves (APXWs), is  derived and their reconstruction is addressed, both in the  time and frequency domains.",
  "description_provenance": [
    "Author Email: mohamed@birch.ee.vt.edu",
    "Advisor Email: besieris@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:54Z (GMT). No. of bitstreams: 9 etd.pdf: 36252 bytes, checksum: f8f6b0e3699ddf71020fd2162f9527f7 (MD5) ch1.pdf: 30950 bytes, checksum: 663191abed007a547618fb9a7d44e69e (MD5) ch2.pdf: 238585 bytes, checksum: 2102e31a53ea6f4d97b42b33a42898e5 (MD5) ch3.pdf: 497827 bytes, checksum: 8fe006d54dfa46ccae227afddb6657db (MD5) ch4.pdf: 484181 bytes, checksum: 12b1781f5ff593e43d8aebc378cf85c9 (MD5) ch5.pdf: 126880 bytes, checksum: 28389d0e1211db55120f214ce18d57db (MD5) ch6.pdf: 13707 bytes, checksum: 8d517cf91bc13c99111220917c9bcbe8 (MD5) ref.pdf: 38804 bytes, checksum: 501dbbff98fe2b86f57226b67f07262f (MD5) vita.pdf: 3834 bytes, checksum: 5de886f92ceccea20e4d4da199b10099 (MD5)   Previous issue date: 1997-12-17"
  ],
  "handle": "26335",
  "identifier_other": "etd-02898-04748",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02898-04748/",
  "identifier_uri": "http://hdl.handle.net/10919/26335",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etd.pdf",
    "ch1.pdf",
    "ch2.pdf",
    "ch3.pdf",
    "ch4.pdf",
    "ch5.pdf",
    "ch6.pdf",
    "ref.pdf",
    "vita.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Acoustic and Electromagnetic Localized Pulses",
    "Dynamic Aperture Antennas",
    "Huygens and Rayleigh-Sommerfeld Reconstruction",
    "Plasma",
    "Bistatic Scattering",
    "Remote Sensing"
  ],
  "title": "Numerical Reconstruction and Applications of Acoustic and Electromagnetic Ultra-Wideband Localized Pulses Generated by Dynamic Aperture Antennas",
  "type": "Dissertation"
}