{
  "contributor_author": "Thanajaro, Metinee",
  "contributor_committeechair": "Shrum, Judith L.",
  "contributor_committeemember": [
    "Burton, John K.",
    "Magliaro, Susan G.",
    "Nespor, Jan K.",
    "Fortune, Jimmie C."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:07:54Z",
  "date_adate": "2000-03-02",
  "date_available": "2014-03-14T20:07:54Z",
  "date_issued": "2000-01-18",
  "date_rdate": "2001-03-02",
  "date_sdate": "2000-03-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Listening, the most frequently used form of language skill, plays a significant role in daily communication and educational process.  In spite of its importance, listening ability development has received only slight emphasis in language instruction.  Nevertheless, U.S. college classrooms, where comprehensive listening serves as a primary channel for learning, require that students function effectively as listeners.  It is therefore important for ESL programs to prepare students for successful listening in academic lectures by implementing authentic listening materials in the ESL classes.  <p> The fundamental purpose of this study was to examine the influences of aural authentic materials on listening ability in students of English as a second language.  The secondary purposes of the study were to identify the learning strategies used by ESL students experiencing authentic listening texts and to determine the influences of authentic materials on ESL students' attitudes towards learning English.  ESL students attending the High Intermediate Academic Listening and Vocabulary Development class at a language training center participated in this study.  The sources of data for this descriptive study included interviews, questionnaires, and class observation.  <p> Analysis of the interviews and the self-evaluation questionnaire revealed that the use of authentic materials in this ESL classroom helped increase students' comfort level and their self-confidence to listen to the target language.  Analysis of the class observation and the learning strategy questionnaire revealed that ESL students usually paid attention when someone was speaking English.  Students also relied on outside sources such as dictionaries, or other people such as relatives to understand unfamiliar words.  Finally, analysis of the class observation and the interview with students revealed that the use of aural authentic materials in ESL classroom had a positive effect on ESL students' motivation to learn the language.  Recommendations are offered to ease learners' frustration that resulted from the use of unfamiliar vocabulary and the speed of authentic speech. <p>",
  "description_provenance": [
    "Author Email: mthanaja@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: jshrum@vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:54Z (GMT). No. of bitstreams: 2 Metinee.pdf: 7344 bytes, checksum: c8b0f813efce978497102c9c3c445055 (MD5) Metinee1.pdf: 354516 bytes, checksum: a973e785c2b9cd9160e97b97343baf64 (MD5)   Previous issue date: 2000-01-18"
  ],
  "handle": "26336",
  "identifier_other": "etd-03012000-00590032",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03012000-00590032/",
  "identifier_uri": "http://hdl.handle.net/10919/26336",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Metinee.pdf",
    "Metinee1.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "language learning",
    "listening",
    "English as a second language",
    "authentic"
  ],
  "title": "Using Authentic Materials to Develop Listening Comprehension in the English as a Second Language Classroom",
  "type": "Dissertation"
}