{
  "contributor_author": "Bozorgi, Alireza",
  "contributor_committeechair": "Jones, James R.",
  "contributor_committeemember": [
    "Muldavin, Scott R.",
    "Auchey, Flynn L.",
    "Grant, Elizabeth J.",
    "Pearce, Annie R."
  ],
  "contributor_department": "Architecture and Design Research",
  "date_accessioned": "2014-03-14T20:07:53Z",
  "date_adate": "2012-04-10",
  "date_available": "2014-03-14T20:07:53Z",
  "date_issued": "2012-02-27",
  "date_rdate": "2012-04-10",
  "date_sdate": "2012-02-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Real estate professionals, such as investors, owner-occupants, and lenders who are involved in the investment decision-making process are increasingly interested in sustainability and energy efficiency investment. However, current tools and techniques, both technical and financial, typically used for assessing sustainability on their own are unable to provide comprehensive and reliable financial information required for making high-quality investment decisions. Sustainability investment often includes non-cost benefits, value implications, as well as substantial risk and uncertainty that current methods do not simultaneously incorporate in their assessment process.  Through a combined quantitative and qualitative approach, this research creates a new systematic assessment process to consider both cost and non-cost savings and therefore the true financial performance of a set of sustainable options in the context of value and risk, while explicitly deriving and including various uncertainties inherent in the process. The framework integrates assessment tools of technical decision-makers with those of investment decision-makers into a single platform to improve the quality of financial performance projections, and therefore, investment decisions concerning sustainable options in real estate. A case study is then conducted to test and demonstrate the numeric application of the proposed framework in the context of a non-green office building. The case study presents how to connect the technical outcomes to financial inputs, present the information, and estimate the true financial performance of a green retrofit option, where incremental value and uncertainty have been modeled and included. Three levels of financial analysis are performed to estimate the distribution of financial outcomes including: 1) Cost-based level-1: only energy related costs savings were considered; 2) Cost-based level-2: the non-energy cost savings, including heath and productivity, were also considered; and 3) Value-based level: the value implications of the green retrofit option were considered in addition to items in level 2. As a result of applying the proposed framework when evaluating sustainability investment options, many investment opportunities that were otherwise ignored may be realized, and therefore, the breadth and depth of sustainability investment in real estate will increase.",
  "description_provenance": [
    "Author Email: abozorgi@vt.edu",
    "Advisor Email: jajone10@vt.edu",
    "Advisor Email: smuldavin@rmi.org",
    "Advisor Email: flynn@vt.edu",
    "Advisor Email: elgrant2@vt.edu",
    "Advisor Email: apearce@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:53Z (GMT). No. of bitstreams: 1 Bozorgi_A_D_2012.pdf: 8804887 bytes, checksum: 4ef57cf5f6c218d18f0cea51da8dad22 (MD5)   Previous issue date: 2012-02-27"
  ],
  "handle": "26333",
  "identifier_other": "etd-02292012-140834",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-02292012-140834/",
  "identifier_uri": "http://hdl.handle.net/10919/26333",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bozorgi_A_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cost-based analysis",
    "financial performance",
    "investment decision-making",
    "building performance",
    "green retrofit options",
    "sustainable features",
    "uncertainty",
    "risk",
    "value-based analysis"
  ],
  "title": "A Framework for Integrating Value and Uncertainty in the Sustainable Options Analysis in Real Estate Investment",
  "type": "Dissertation"
}