{
  "contributor_author": "Sadia, Rina",
  "contributor_committeechair": "Triantis, Konstantinos P.",
  "contributor_committeemember": [
    "White, Orion F. Jr.",
    "Kurstedt, Harold A. Jr.",
    "Hoopes, Barbara J.",
    "Koelling, Charles Patrick"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:07:56Z",
  "date_adate": "2006-05-04",
  "date_available": "2014-03-14T20:07:56Z",
  "date_issued": "2006-02-23",
  "date_rdate": "2009-05-04",
  "date_sdate": "2006-03-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A System Dynamics Approach Linking Employee Health, Quality Culture and Organizational Effectiveness  Rina Sadia   Abstract The purpose of this research is to investigate the interactions between organizational effectiveness, quality culture, and employee health.  The system dynamics modeling approach is used in order to reveal the complex and dynamic behavior of the system under investigation.  Understanding system behavior facilitates policy analysis and management decision-making.  The relationships between the three constructs: organizational effectiveness, quality culture and employee health are non linear and during the research a number of dynamic hypotheses were investigated.  For example, illness is the main cause for absenteeism, loss of productivity, ineffective learning, which in turn causes even more stress and eventually more illness.  As part of the system dynamics approach a conceptual (qualitative) model and a formal (quantitative) model were built. The conclusion from analyzing the dynamic hypotheses of this model was that quality culture had a great impact on the performance of the whole system, especially on employees창   health and on organizational effectiveness.  Furthermore, employees창   health and organizational effectiveness concurrently impact each other.  However, this research could not show a considerable impact of the employees창   health and organizational effectiveness on the organization창  s quality culture. The research contributes to the general understanding of complex production systems, since the three constructs investigated in this research face similar issues, i.e., the trade-off between long-term and short-term goals, consequences of managerial actions that are far apart in time and space, and conflicts between measurable outcomes and subjective outcomes.  The research adds to the design of effective social systems, where the products and the services are created in a quality fashion, and individuals experience an environment that is conducive to their well-being.",
  "description_provenance": [
    "Author Email: rsadia@vt.edu",
    "Advisor Email: mcswite@sbcglobal.net",
    "Advisor Email: Triantis@vt.edu",
    "Advisor Email: hak@vt.edu",
    "Advisor Email: bhoopes@vt.edu",
    "Advisor Email: koelling@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:56Z (GMT). No. of bitstreams: 4 References_Appendices_2_Vita.pdf: 1166543 bytes, checksum: bb35aa66e8664761976735e645d9b0d2 (MD5) Introduction_literature_review_methodology.pdf: 747960 bytes, checksum: 241951874e3f459db6bb9125448f9bd1 (MD5) Chapters_four_five.pdf: 1074756 bytes, checksum: 2bc7a691c28e0e20aed04cf77ade570c (MD5) Pre_chapters_pages_2.pdf: 157856 bytes, checksum: 03ee045477f528726377fc00b9bec1f5 (MD5)   Previous issue date: 2006-02-23"
  ],
  "handle": "26349",
  "identifier_other": "etd-03032006-165647",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03032006-165647/",
  "identifier_uri": "http://hdl.handle.net/10919/26349",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "References_Appendices_2_Vita.pdf",
    "Introduction_literature_review_methodology.pdf",
    "Chapters_four_five.pdf",
    "Pre_chapters_pages_2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Quality Culture",
    "Organizational Effectiveness",
    "Employee Health",
    "Stress",
    "System Thinking",
    "System Dynamics"
  ],
  "title": "A System Dynamics Approach Linking Employee Health, Quality Culture and Organizational Effectiveness",
  "type": "Dissertation"
}