{
  "contributor_author": "Capra, Robert G.",
  "contributor_committeechair": "Pérez-Quiñones, Manuel A.",
  "contributor_committeemember": [
    "Dunlap, Daniel R.",
    "Ramakrishnan, Naren",
    "Novick, David",
    "Hartson, H. Rex"
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2014-03-14T20:07:55Z",
  "date_adate": "2006-03-23",
  "date_available": "2014-03-14T20:07:55Z",
  "date_issued": "2006-02-16",
  "date_rdate": "2006-03-23",
  "date_sdate": "2006-03-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Refinding electronic information is a common problem, yet it has received less study than the problem of how to find information for the first time.  In this dissertation, I examine how people approach tasks to refind information they have seen on the Web and factors that may affect refinding.  I conducted a controlled, laboratory study in which participants participated in two sessions:  one to find information for a set of 18 tasks and a second session, about a week later, to attempt a set of counterpart refinding tasks.  Results indicate that finding and refinding do have differences, but not for all types of tasks.  The use of Web search engines was not observed to change significantly from the first session to the second.  However, for tasks that participants were more familiar with, search engines were used less.  Tasks that involved refinding a subset of the information that was found in the first session took longer to complete and were perceived as more difficult.  Participants often went directly to known resources on the Web to start their searches.  These sets of known resources included many on-line counterparts of paper resources such as telephone directories, dictionaries, and newspapers.  For many tasks, participants used the same starting strategy to refind the information that they used find it, indicating strong patterns of access.  This work contributes to the base of knowledge about how people refind information and the factors that affect refinding.  It also contributes to the research field of information refinding and personal information management by identifying dimensions and factors that affect refinding.  The results reported have implications for the design of Web sites and information repositories, the design of tools to help users find and refind information, and for the research community studying personal information management.",
  "description_provenance": [
    "Author Email: rcapra@vt.edu",
    "Advisor Email: dunlapd@vt.edu",
    "Advisor Email: naren@cs.vt.edu",
    "Advisor Email: hartson@cs.vt.edu",
    "Advisor Email: perez@cs.vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:55Z (GMT). No. of bitstreams: 1 rcapra-dissertation.pdf: 1316427 bytes, checksum: 9141413e5c7501d17dd9e6170ff897bd (MD5)   Previous issue date: 2006-02-16"
  ],
  "handle": "26342",
  "identifier_other": "etd-03022006-154809",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03022006-154809/",
  "identifier_uri": "http://hdl.handle.net/10919/26342",
  "publisher": "Virginia Tech",
  "relation_haspart": "rcapra-dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "personal information management",
    "information science",
    "information refinding"
  ],
  "title": "An Investigation of Finding and Refinding Information on the Web",
  "type": "Dissertation"
}