{
  "contributor_author": "Whaley, Cory Miller",
  "contributor_committeechair": "Wilson, Henry P.",
  "contributor_committeemember": [
    "Hagood, Edward Scott Jr.",
    "Nessler, Craig L.",
    "Westwood, James H.",
    "Brann, Daniel E."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:07:55Z",
  "date_adate": "2005-03-04",
  "date_available": "2014-03-14T20:07:55Z",
  "date_issued": "2005-03-01",
  "date_rdate": "2005-03-04",
  "date_sdate": "2005-03-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Repeated use of acetolactate synthase (ALS)-inhibiting herbicides in recent years has resulted in the selection of 89 weed species resistant to these herbicides.  One management strategy that can eliminate or slow the development of resistance is applying mixtures of herbicides with different modes of action.  This research involved the characterization of ALS-inhibiting herbicide-resistant smooth pigweed (<i>Amaranthus hybridus</i> L.), as well as investigations on weed management programs in corn (<i>Zea mays</i> L.) utilizing mesotrione, a triketone, in mixtures with other herbicides.  ALS-inhibiting herbicide-resistant smooth pigweed biotypes were collected from fields in Virginia, Delaware, Maryland, and Pennsylvania to evaluate response to ALS-inhibiting herbicides and to determine the molecular mechanisms of resistance.  Sequencing of the ALS genes from these biotypes revealed two amino acid substitutions known to confer resistance, Ala<sub>122</sub> to Thr and Ser<sub>653</sub> to Asn, and one that has not been previously reported in plants, Asp<sub>376</sub> to Glu.  The smooth pigweed biotype with an Asp<sub>376</sub> substitution displayed resistance to four classes of ALS-inhibiting herbicides that included imidazolinone (IMI), sulfonylurea (SU), pyrimidinylthiobenzoate (PTB), and triazolopyrimidine sulfonanilide (TP) chemistries.  Transformation of this smooth pigweed ALS gene into <i>Arabidopsis thaliana</i> confirmed that the Asp<sub>376</sub> substitution is responsible for the resistance.  Other biotypes that had a substitution at Ala<sub>122</sub> exhibited resistance to an IMI herbicide, little to no resistance to SU herbicides, and increased sensitivity to a PTB and a TP herbicide, whereas, biotypes that had a substitution at Ser<sub>653</sub> exhibited high-level resistance to an IMI herbicide and lower resistance to PTB and SU herbicides.  Experiments were also conducted to investigate the effectiveness of mesotrione in preemergence (PRE) and postemergence (POST) corn weed management programs in Virginia.  Mesotrione applied PRE in mixtures with <i>S</i>-metolachlor and atrazine controlled common lambsquarters (<i>Chenopodium album</i> L.), smooth pigweed, common ragweed (<i>Ambrosia artemisiifolia</i> L.), and morningglory (<i>Ipomoea</i> spp.) species when a timely rainfall followed application.  POST applications of mesotrione controlled common lambsquarters and smooth pigweed, but common ragweed and morningglory species were not always controlled.  Common ragweed and morningglory species were controlled by mesotrione in a mixture with atrazine POST.  Large crabgrass [<i>Digitaria sanguinalis</i> (L.) Scop.] and giant foxtail (<i>Setaria faberi</i> Herrm.) control was generally better when the ALS-inhibiting herbicides nicosulfuron plus rimsulfuron or rimsulfuron plus thifensulfuron plus atrazine were applied in a mixture with mesotrione.  Mixtures of mesotrione with other POST herbicides in a total POST program produced corn yields comparable to standard PRE followed by POST weed management programs.",
  "description_provenance": [
    "Author Email: cwhaley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:55Z (GMT). No. of bitstreams: 12 05cwhaley_Chapter2.pdf: 268116 bytes, checksum: db21c07c6e818bec0feb1e7095e679db (MD5) 12cwhaley_vita.pdf: 56948 bytes, checksum: 42db57c8fc5345aa056434dae9ed8e55 (MD5) 11cwhaley_Chapter8.pdf: 79430 bytes, checksum: 4000c20866433fd2aaaad68c06763181 (MD5) 10cwhaley_Chapter7.pdf: 155730 bytes, checksum: 456f606f5f6ed0810d8fbb6adc835ae4 (MD5) 09cwhaley_Chapter6.pdf: 151724 bytes, checksum: dbb0ec4bdd7608c4b11c2c0f5979bce5 (MD5) 07cwhaley_Chapter4.pdf: 137558 bytes, checksum: f97b9ce76e4f885b0ce9e916eac96a8d (MD5) 08cwhaley_Chapter5.pdf: 168516 bytes, checksum: c96c38e4b7ce785ba8e06130cc45e1d2 (MD5) 01cwhaley_TitleAbstract.pdf: 86051 bytes, checksum: e4e3fdb6562eabb54b6f45005c31648b (MD5) 02cwhaley_Acknowledgments.pdf: 54745 bytes, checksum: 49178b6b8f7071dc94cebeaeb87a19f9 (MD5) 03cwhaley_TableofContents.pdf: 120208 bytes, checksum: 10243ec866f670a38a55f8c17864a7a2 (MD5) 04cwhaley_Chapter1.pdf: 133804 bytes, checksum: 556d9d3914a64aafe75fbc72ef68376c (MD5) 06cwhaley_Chapter3.pdf: 146118 bytes, checksum: 41a6d5755068838521c805fc9efa9dd0 (MD5)   Previous issue date: 2005-03-01"
  ],
  "handle": "26341",
  "identifier_other": "etd-03022005-225622",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03022005-225622/",
  "identifier_uri": "http://hdl.handle.net/10919/26341",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "05cwhaley_Chapter2.pdf",
    "12cwhaley_vita.pdf",
    "11cwhaley_Chapter8.pdf",
    "10cwhaley_Chapter7.pdf",
    "09cwhaley_Chapter6.pdf",
    "07cwhaley_Chapter4.pdf",
    "08cwhaley_Chapter5.pdf",
    "01cwhaley_TitleAbstract.pdf",
    "02cwhaley_Acknowledgments.pdf",
    "03cwhaley_TableofContents.pdf",
    "04cwhaley_Chapter1.pdf",
    "06cwhaley_Chapter3.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "thifensulfuron",
    "ALS mutation",
    "<i>Amaranthus hybridus</i> L.",
    "weed control",
    "nicosulfuron",
    "triazolopyrimidine",
    "imidazolinone",
    "herbicide resistance",
    "rimsulfuron",
    "pyrimidinyloxybenzoate",
    "atrazine",
    "sulfonylurea",
    "<i>S</i>-metolachlor"
  ],
  "title": "Characterization of Acetolactate Synthase-Inhibiting Herbicide-Resistant Smooth Pigweed and Corn Weed Management Programs Utilizing Mesotrione in Combinations with Other Herbicides",
  "type": "Dissertation"
}