{
  "contributor_author": "Lineburg, Mark Young",
  "contributor_committeecochair": [
    "Alexander, M. David",
    "Sughrue, Jennifer A."
  ],
  "contributor_committeemember": [
    "Salmon, Richard G.",
    "Driscoll, Lisa G.",
    "Berlin, Lois"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:54Z",
  "date_adate": "2005-03-09",
  "date_available": "2014-03-14T20:07:54Z",
  "date_issued": "2005-02-11",
  "date_rdate": "2005-03-09",
  "date_sdate": "2005-03-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "An Analysis of Random Student Drug Testing Policies and Patterns of Practice In Virginia Public Schools  Mark Y. Lineburg  Abstract \tThere were two purposes to this study. First, the study was designed to determine which Virginia public school districts have articulated policies that govern random drug testing of students and if school districtsâ   policies aligned with U.S. Supreme Court standards and Virginia statutes. The second purpose was to ascertain the patterns of practice in selected Virginia school districts that currently conduct random drug testing of students. This included identifying which student groups were being tested and for which drugs. It was also of interest to learn how school districts monitor the testing program and if drug testing practices were aligned with the policies that govern them. Data were gathered by examining student handbooks and district policies in order to determine which school districts had drug testing policies. These policies then were analyzed using a legal framework constructed from U.S. Supreme Court standards that have emerged from case law governing search and seizure in schools. Finally, data on patterns of practice were collected through in-depth interviewing and observation of those individuals responsible for implementing student drug testing in those districts that have such programs. The analyses revealed that the current policies and patterns of practice in random drug testing programs in Virginia public schools comply with Supreme Court standards and state statutes. Student groups subject to testing in Virginia public schools include student athletes and students in extracurricular activities in grades eight through twelve. Monitoring systems in the school districts implementing random drug testing were not consistent. There is evidence that the school districts implementing random drug testing programs have strong community support for the program.",
  "description_provenance": [
    "Author Email: mlineburg@rcps.org, lineburg@yahoo.com",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: jsughrue@fau.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: LBerlin@fccps.k12.va.us",
    "Made available in DSpace on 2014-03-14T20:07:54Z (GMT). No. of bitstreams: 1 lineburgdissertation.pdf: 609790 bytes, checksum: ef02f46518f21ef1f8f55f911c74ab93 (MD5)   Previous issue date: 2005-02-11"
  ],
  "handle": "26340",
  "identifier_other": "etd-03022005-095115",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03022005-095115/",
  "identifier_uri": "http://hdl.handle.net/10919/26340",
  "publisher": "Virginia Tech",
  "relation_haspart": "lineburgdissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Student Rights",
    "Fourth Amendment",
    "Random Drug Testing"
  ],
  "title": "An Analysis of Random Student Drug Testing Policies and Patterns of Practice In Virginia Public Schools",
  "type": "Dissertation"
}