{
  "contributor_author": "Jones, Cravor",
  "contributor_committeecochair": [
    "Hohenshil, Thomas H.",
    "Burge, Penny L."
  ],
  "contributor_committeemember": [
    "Cropper, Dennis",
    "Getz, Hilda M.",
    "Benson, Mark J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:07:56Z",
  "date_adate": "2005-03-16",
  "date_available": "2014-03-14T20:07:56Z",
  "date_issued": "2005-02-08",
  "date_rdate": "2006-03-16",
  "date_sdate": "2005-03-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Factors Affecting African-American Counselors' Job Satisfaction: A National Study  Cravor Jones  (Abstract)  The purpose of this study was to determine the factors that contributed to the job satisfaction of African American counselors (AAC).  Although there are a variety of job satisfaction studies regarding mental health professionals, a literature review indicated research related to the job satisfaction of AACs was negligible. Knowing the factors that contribute to minorities' occupational satisfaction is especially important for mental health organizations because the information helps managers recruit and retain AACs.   Subjects were 182 currently employed AACs who were members of American Counseling Association (ACA). A modified version of the Minnesota Satisfaction Questionnaire (MSQ) and a Data Information Form (DIF) were used to collect data. The following research questions were studied: What were the aggregate levels of job satisfaction expressed by African American Counselors? Which of the 20 subscales on the Minnesota Satisfaction Questionnaire (MSQ) were rated as being important to AACs' job satisfaction? Which select demographic variables contributed significantly to the job satisfaction of AACs?   It was determined that 87% of participants in this study were satisfied or very satisfied with their current job. Only 13% of subjects indicated they were dissatisfied.  Subjects were satisfied with 19 of 20 job facets. Social service was the only facet subjects indicated they were very satisfied with, and advancement was the only facet subjects indicated they were dissatisfied with on their current job. An analysis of demographic  variables revealed two significant associations:  subjects who were not planning to leave their profession within the next 5 years were satisfied with their job, and subjects who indicated sexism did not affect their job were more satisfied with their current position. Overall, the results from this research indicated AACs were satisfied in their current position.",
  "description_provenance": [
    "Author Email: crjones@vt.edu",
    "Advisor Email: dcropper@racsb.org",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: mbenson@vt.edu",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:56Z (GMT). No. of bitstreams: 1 czj.pdf: 764047 bytes, checksum: 6d5ec5e8bc966f89bcccc20e65502483 (MD5)   Previous issue date: 2005-02-08"
  ],
  "handle": "26348",
  "identifier_other": "etd-03032005-185442",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03032005-185442/",
  "identifier_uri": "http://hdl.handle.net/10919/26348",
  "publisher": "Virginia Tech",
  "relation_haspart": "czj.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "African American Counselors",
    "Job Satisfaction"
  ],
  "title": "Factors Affecting African American Counselors' Job Satisfaction: A National Survey",
  "type": "Dissertation"
}