{
  "contributor_author": "Dodd, Celia Anne",
  "contributor_committeechair": "Klein, Bradley G.",
  "contributor_committeemember": [
    "Jortner, Bernard S.",
    "Ehrich, Marion F.",
    "Bloomquist, Jeffrey R."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:07:58Z",
  "date_adate": "2009-04-20",
  "date_available": "2014-03-14T20:07:58Z",
  "date_issued": "2009-02-19",
  "date_rdate": "2009-04-20",
  "date_sdate": "2009-03-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Parkinson's disease (PD) is a neurodegenerative Lewy body disorder characterized by severe motor deficits, followed by cognitive dysfunction with progression of the disease. Environmental exposure has been suggested as a possible contributor to the development of PD and this view is linked to the discovery of the nigrostriatal neurotoxin MPTP. MPTP can induce dopamine specific degeneration within the basal ganglia often resulting in motor deficits similar to PD. MPTP used in the C57BL/6 mouse is a widely used animal model of PD. The pyrethroid permethrin (PM), and the organophosphate chlorpyrifos (CPF), can produce changes in dopaminergic nigrostriatal neurons, the primary target of PD and MPTP-induced neurotoxicity. Such insecticide induced changes in the basal ganglia could exacerbate the onset or severity of PD. Chronic exposure to the metal manganese (Mn) can damage the globus pallidus (GP) of the BG, and produce motor deficits similar to PD. Since the GP is part of the BG circuitry essential for motor control, and is synaptically integrated with the nigrostriatal pathway, Mn may exacerbate MPTP-induced neurotoxicity. Because the BG is disynaptically linked to the mesocortical pathway, a dopaminergic pathway that is important for cognition, Mn induced damage in the BG could indirectly affect the mesocortical pathway as well. This study investigated the pesticides, permethrin and chlorpyrifos, and the heavy metal, manganese as possible environmental compounds that could exacerbate PD in the MPTP treated C57BL/6 mouse. <p> The first part of this dissertation used immunohistochemistry to examine insecticide induced effets on MPTP-induced neurotoxicity in the dorsolateral striatum of the C57BL/6 mouse, the principal target of the nigrostriatal pathway. Tyrosine hydroxylase (TH) was used as a marker for loss of dopaminergic neuropil and glial fibrillary acidic protein (GFAP) was used as a marker of glial activation in the striatum. Three experiments assessed effects of 1) PM (200 mg/kg), 2) CPF (50 mg/kg) & 3) PM + CPF, on MPTP (30 mg/kg) neurotoxicity. Immunohistochemistry revealed a decrease in TH staining and an increase in GFAP staining with MPTP (30 mg/kg). A main effect increase in GFAP was observed for PM (200 mg/kg), but not for CPF (50 mg/kg) or PM+CPF. Insecticides, alone or combined, did not alter MPTP-induced toxicity. . However, the absence of the PM-induced increase in GFAP staining following combined insecticide treatment suggests a neuroprotective effect.<p> The next set of experiments in this dissertation looked at the effect of  Mn on MPTP-induced neurotoxicity in the nigrostriatal and mesocortical dopaminergic pathways  of the C57BL/6 mouse.  Inductively Coupled Plasma atomic emission spectrometry revealed striatal Mn levels were significantly increased with multiple dose 100,  50, and 25 mg/kg MnCl2. Administration of Mn  (MnCl2  s.c., Days 1, 4, & 7) in the MPTP (20  mg/kg i.p., Day 8) treated C57BL/6 mouse revealed Mn and MPTP interactions for locomotor activity, grip strength, and repeated measures of learning. Mn attenuated the effect of MPTP on striatal DOPAC, and facilitated the effect of MPTP on cortical DA and DOPAC. Mn also attenuated the MPTP induced decrease in cortical DAT. While these data support the notion that insecticides can produce tissue damage in the nigrostriatal pathway, in this case, these insecticide induced changes were not found to be strong enough to facilitate PD-like tissue damage. While Mn did not always facilitate MPTP neurotoxicity in the mesocortical and nigrostriatal dopaminergic pathways, these results demonstrate Mn and MPTP can interact in a complex way to alter dopaminergic function as well as motor and cognitive behavior.  Differences in brain uptake mechanisms and metabolism of Mn and MPTP, could explain why combined administration of Mn and MPTP differentially affect dopaminergic activity in the nigrostriatal and mesocortical pathways.",
  "description_provenance": [
    "Author Email: cdodd@vt.edu",
    "Advisor Email: bjortner@vt.edu",
    "Advisor Email: marion@vt.edu",
    "Advisor Email: jbquist@vt.edu",
    "Advisor Email: bklein@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:58Z (GMT). No. of bitstreams: 1 CADodd_ETD1_2009.pdf: 3507694 bytes, checksum: 07a91e64e2da9ddd8c213a177795d7e9 (MD5)   Previous issue date: 2009-02-19"
  ],
  "handle": "26359",
  "identifier_other": "etd-03042009-161653",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03042009-161653/",
  "identifier_uri": "http://hdl.handle.net/10919/26359",
  "publisher": "Virginia Tech",
  "relation_haspart": "CADodd_ETD1_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Chlorpyrifos",
    "Permethrin",
    "Manganese",
    "MPTP",
    "Parkinsonâ  s Disease"
  ],
  "title": "Synthetic and Natural Environmental Compounds as Potential Facilitators of Mptp-Induced Parkinsonism",
  "type": "Dissertation"
}