{
  "contributor_author": "Badger, Robert L.",
  "contributor_committeechair": "Sinha, A. Krishna",
  "contributor_committeemember": [
    "Hewitt, David A.",
    "Tracy, Robert J.",
    "Eriksson, Susan C.",
    "Gottfried, David",
    "Simpson, Carol"
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:07:58Z",
  "date_adate": "2009-03-04",
  "date_available": "2014-03-14T20:07:58Z",
  "date_issued": "1989-06-01",
  "date_rdate": "2009-03-04",
  "date_sdate": "2009-03-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Catoctin Volcanic Province represents a sequence of rift related tholeiitic magmas erupted during late Precambrian opening of the Iapetus ocean basin. Three transects have been mapped across the province in northern Virginia in order to demonstrate that there is a mappable stratigraphy and to provide a framework upon which to construct a chemical stratigraphy. Chemical analyses of multiple samples from single flows containing a contrast in fabric development and mineral assemblages indicate that portions of flows with poorly developed fabric and retaining igneous textures and relict clinopyroxenes have been least affected by hydration reactions and are more likely to retain igneous geochemical signatures.  Using primarily the less mobile oxides Ti02 , Ah03, lVlg0, FeO and P20 S1 the chemical stratigraphy for each traverse can be divided into chemical subunits. Each subunit can be modeled by fractional crystallization predominantly of plagioclase and clinopyroxene. Chemical discontinuities  between subunits suggest new magma sources or rejuvination of existing magma chambers. The overall geochemical signature of the magmas can be modeled through gabbro fractionation from a pi critic source.  Sr isotopic data from only those samples that have been least affected by fluid interaction indicate the magmas evolved from a Sr isotopically depleted mantle source and the age of eruption was at approximately 570 Ma. A depleted Sri is in sharp contrast to enriched signatures for a sequence  of proximally located tholeiites erupted during Mesozoic rifting between North America and northern Africa, suggesting that if the Mesozoic signature is reflecting contamination by a subducted slab component (Pegram, 1986) this contamination event must have been post Catoctin time.  The 570 Ma age of eruption is the fIrst isotopically determined age that is consistent with stratigraphic and paleontologic data. When contrasted with dates of 650-730 for other rift related magmas in the southern and central Appalachianst the 570 Ma age suggests a two stage rift event, the fIrst one failed while the second succeeded at opening the Atlantic ocean basin.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:07:58Z (GMT). No. of bitstreams: 1  LD5655.V856_1989.B345.pdf: 37712666 bytes, checksum: 886752900902e3ba25aa840556f5da9e (MD5)    Previous issue date: 1989-06-01",
  "format_medium": "BTD",
  "handle": "26358",
  "identifier_other": "etd-03042009-041139",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03042009-041139/",
  "identifier_uri": "http://hdl.handle.net/10919/26358",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1989.B345.pdf",
  "subject": "Petrogenesis",
  "subject_lcc": "LD5655.V856 1989.B345",
  "title": "Geochemistry and petrogenesis of the Catoctin Volcanic Province, central Appalachians",
  "type": "Dissertation"
}