{
  "contributor_author": "Nussbaum, Barbara B.",
  "contributor_committeecochair": [
    "Belli, Gabriella M.",
    "Morris, Linda E."
  ],
  "contributor_committeemember": [
    "French, Larry",
    "Glass, Paul W."
  ],
  "contributor_department": "Adult Learning and Human Resource Development",
  "date_accessioned": "2014-03-14T20:07:56Z",
  "date_adate": "2009-04-22",
  "date_available": "2014-03-14T20:07:56Z",
  "date_issued": "2009-02-27",
  "date_rdate": "2009-04-22",
  "date_sdate": "2009-03-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Conflict is a component of interpersonal interactions, neither inevitable nor innately bad, but often commonplace (Deutsch & Coleman, 2000; Schellenberg, 1996). Conflict interactions that occur in the workplace can impact individuals, relationships, and the organization as a whole.  This experimental study was framed from a contingency perspective to examine the extent to which specific contextual variables of a workplace conflict would influence participant responses in that interaction.  During the study, 389 individuals responded to an online questionnaire containing a description of a hypothetical workplace conflict interaction with one level of three manipulated context variables (i.e., conflict type, verb abstraction level, and sex of parties). The context variables were hypothesized to influence participantsâ   responses that included attitudes toward the interaction, subjective norms, appraisals of personal control and external control, and attributions of the locus of causality.  This cognitive set of variables was hypothesized to explain respondentsâ   behavioral intentions in that conflict. The four conflict behavioral intentions used in this study were control, nonconfrontation, compromise, and integrate.  Analyses of the data included multivariate analysis of variance (MANOVA), canonical correlation analysis, and hierarchical multiple regression.  The results of MANOVA were that context had modest effects on cognition and behavioral intention, examined in separate analyses. The conflict type, using a task versus relationship categorization, appeared to be the most salient of the context variables having effects on many of the cognitive measures in this study.  Two other contextual variables, sex of conflict initiator and abstraction level of the verbs used to describe the conflict scenario had statistically significant results, but much lesser effects.  The sex of the respondent played a minimal role in a statistically significant 3-way interaction with abstraction-level and sex of initiator. The cognitive variables together explained 29% of the variance in the set of conflict behavioral intentions using canonical correlation analysis.  When the data were analyzed with hierarchical multiple regression, the context and cognitive variables explained statistically significant proportions of the variance in each behavioral intention that ranged from 7% (of control), 15% (of nonconfrontation), 19% (of compromise), to 20% (of integrate).  Different patterns of context and cognitive variables influenced each of the conflict behavioral intentions. These findings present a challenge to hold two ideas together, the context and the individual, in future research and current practice.  The results of this study lend support to a contingency perspective that aspects of the context, when salient to a party in the conflict, will have effects on participant responses in that interaction.",
  "description_provenance": [
    "Author Email: bnussbau@vt.edu",
    "Advisor Email: lfrench@vt.edu",
    "Advisor Email: paulwglass@aol.com",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: linda_morris11495@yahoo.com",
    "Made available in DSpace on 2014-03-14T20:07:56Z (GMT). No. of bitstreams: 1 NussbaumDissertationForETD-revised4.pdf: 998576 bytes, checksum: 81b5d11c9195c90d3a307a99d56086df (MD5)   Previous issue date: 2009-02-27"
  ],
  "handle": "26351",
  "identifier_other": "etd-03032009-080434",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03032009-080434/",
  "identifier_uri": "http://hdl.handle.net/10919/26351",
  "publisher": "Virginia Tech",
  "relation_haspart": "NussbaumDissertationForETD-revised4.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "contingency",
    "intention"
  ],
  "title": "Examining the relationship among context, cognition, and conflict management in the workplace",
  "type": "Dissertation"
}