{
  "contributor_author": "Blackwood, Matthew Joseph",
  "contributor_committeecochair": [
    "Randolph, John",
    "Rich, Richard C."
  ],
  "contributor_committeemember": [
    "Papadakis, Maria",
    "Conn, W. David",
    "Carmin, Joann S."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:07:57Z",
  "date_adate": "2003-03-12",
  "date_available": "2014-03-14T20:07:57Z",
  "date_issued": "2003-02-21",
  "date_rdate": "2004-03-12",
  "date_sdate": "2003-03-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Local emergency planning committees (LEPCs) were designed to develop emergency response plans and provide information through community right-to-know programs. A literature review identified operational effectiveness, collaboration, risk communication, information technology (IT), and homeland security as important issues for LEPCs. However, a lack of research on the interaction of these fields raises several questions that were addressed in this study:  1.\tHow is the operational effectiveness of LEPCs related to their organizational characteristics? 2.\tTo what extent does collaboration exist between LEPCs and other groups? 3.\tWhat types of risk communication strategies are used by LEPCs? How are these initiatives mediated through technology? 4.\tTo what degree and to what purposes are LEPCs utilizing information technologies? 5.\tHow will homeland security initiatives influence emergency planning and community right-to-know programs? How will potential opportunities and constraints posed by homeland security affect the future role of LEPCs?  The sample for this study was randomly selected from LEPCs in US EPAâ  s Region III, including the states of Delaware, Maryland, Pennsylvania, Virginia, and West Virginia. Phase one involved mailing out 156 surveys; 66 were returned for a response rate of 42%. Phase two involved case studies of LEPCs in Greenbrier County, WV; Tazewell County, VA; and Elk County, PA. Findings indicate that LEPC activity level is lower than previously reported. This research shows that IT is considered important, but its use is limited. Respondents reported using computers for word processing and, on a limited basis, for planning. The level of IT use for data management, emergency response activities, and risk communication was unexpectedly low. The research did not find a significant relationship between LEPC characteristics and the level of IT use. Barriers to IT use and operational status related to lack of funding and training. Data from surveys, interviews, and physical evidence were used to triangulate these findings. This research is significant in its identification of the current operation of LEPCs. It provides an assessment of collaborative initiatives being used within LEPCs and highlights methods employed to develop and implement risk communication programs. These findings can be used to evaluate the potential role of LEPCs in homeland security initiatives, which will likely focus on emergency planning with a decreased emphasis on risk communication.",
  "description_provenance": [
    "Author Email: matt@blackwood-wv.net",
    "Advisor Email: papadamc@jmu.edu",
    "Advisor Email: energy@vt.edu",
    "Advisor Email: urban@vt.edu",
    "Advisor Email: dconn@calpoly.edu",
    "Advisor Email: jcarmin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:57Z (GMT). No. of bitstreams: 1 MJBlackwood.pdf: 5931270 bytes, checksum: 6374c36ba378af90efb435edd16004da (MD5)   Previous issue date: 2003-02-21"
  ],
  "handle": "26354",
  "identifier_other": "etd-03042003-202301",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03042003-202301/",
  "identifier_uri": "http://hdl.handle.net/10919/26354",
  "publisher": "Virginia Tech",
  "relation_haspart": "MJBlackwood.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "homeland security",
    "information technology",
    "collaboration",
    "risk communication",
    "local emergency planning committees"
  ],
  "title": "Local Emergency Planning Committees: Collaboration, Risk Communication, Information Technology and Homeland Security",
  "type": "Dissertation"
}