{
  "contributor_author": "Collins, Marina V.",
  "contributor_committeecochair": [
    "Lindsay, David S.",
    "Flick, George J. Jr."
  ],
  "contributor_committeemember": [
    "O'Keefe, Sean F.",
    "Jahncke, Michael L.",
    "Smith, Stephen A.",
    "Croonenberghs, Robert E.",
    "Fayer, Ronald"
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:07:57Z",
  "date_adate": "2005-03-17",
  "date_available": "2014-03-14T20:07:57Z",
  "date_issued": "2005-02-09",
  "date_rdate": "2010-10-12",
  "date_sdate": "2005-03-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Foodborne disease outbreaks associated with the protozoan parasite Cryptosporidium spp. are an emerging public health concern. Shellfish, including Eastern oysters (Crassostrea virginica) in Chesapeake Bay and other Atlantic coastal waters, have been identified as a potential source of Cryptosporidium parvum infection for humans. The inactivation of C. parvum and other pathogens in raw molluscan shellfish would provide increased food safety for normal and at-risk consumers. The objectives of this study were to evaluate the efficacy of three alternative food-processing treatments (e-beam irradiation, microwave energy, and high hydrostatic pressure processing) on the viability of C. parvum oocysts in Eastern oysters.</p>  <p>Oysters were artificially infected with the Beltsville strain of C. parvum and subjected to the three treatments in separate experiments. The effects of the treatments were evaluated by inoculation of the processed oyster tissues using the neonatal mouse bioassay.</p>  <p>E-beam radiation of in-shell and shucked oysters treated with doses of 1.0, 1.5 or 2.0 kGy produced significant reductions (P < 0.05) in C. parvum mouse infectivity.  A dose of 2.0 kGy completely terminated the infectivity of C. parvum and did not adversely affect the visual appearance of the oysters.</p>  <p>Microwave treatments of shucked oysters at time (temperature) exposures of 1 sec (43.2°C), 2 sec (54.0°C), and 3 sec (62.5°C) produced a reduction in C. parvum mouse infectivity of 26.7%, 33.3%, and 46.7%, respectively. Microwave treatments at 2 sec (54.0°C) and 3 sec (62.5°C) showed extensive changes in oyster meat texture and color. Thus due to lack of efficacy and unacceptable tissue changes, microwave treatment of oysters is not considered a viable food processing method. High pressure processing of shucked oysters at all pressures tested (305 MPa, 370 MPa, 400 MPa, 480 MPa, 550 MPa) significantly (P < 0.05) reduced infectivity of C. parvum oocysts as measured by the neonatal mouse bioassay. A treatment of 550 MPa at 180 sec produced the maximum decrease of C. parvum infectivity (93.3%). The results indicate that HPP (high pressure processing) can produce significant (P < 0.05) reductions in infectivity of C. parvum oocysts.  Measurement of tristimulus color values of pressurized raw oysters at extended processing times from 120 sec to 360 sec at 550 MPa showed an increase (P < 0.05) in whiteness.</p>  <p>One (e-beam irradiation) of the three food-processing treatments shows promise for commercial applications to reduce public health risks from cryptosporidiosis in Eastern oysters.</p>",
  "description_provenance": [
    "Author Email: macolli1@vt.edu",
    "Advisor Email: okeefes@vt.edu",
    "Advisor Email: mjahncke@vt.edu",
    "Advisor Email: stsmith7@vt.edu",
    "Advisor Email: rcroonenberghs@vdh.state.va.us",
    "Advisor Email: rfayer@anri.barc.usda.gov",
    "Advisor Email: lindsayd@vt.edu",
    "Advisor Email: flickg@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:57Z (GMT). No. of bitstreams: 1 Macolli1Dissertation.pdf: 231140 bytes, checksum: cbce51ea9a880aa1fad27a068af9c951 (MD5)   Previous issue date: 2005-02-09"
  ],
  "handle": "26355",
  "identifier_other": "etd-03042005-111325",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03042005-111325/",
  "identifier_uri": "http://hdl.handle.net/10919/26355",
  "publisher": "Virginia Tech",
  "relation_haspart": "Macolli1Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "oysters",
    "e-beam irradiation",
    "parasites",
    "Crassostrea virginica",
    "Cryptosporidium parvum",
    "high hydrostatic pressure",
    "microwave",
    "shellfish"
  ],
  "title": "The Effects of E-Beam Irradiation, Microwave Energy and High Hydrostatic Pressure on Presence and Health Significance of Cryptosporidium parvum in Eastern Oysters (Crassostrea virginica)",
  "type": "Dissertation"
}