{
  "contributor_author": "Schwartz, Viviane",
  "contributor_committeechair": "Oyama, Shigeo Ted",
  "contributor_committeemember": [
    "Velander, William H.",
    "Deck, Paul A.",
    "Gibbs, Gerald V.",
    "Cox, David F."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:08:00Z",
  "date_adate": "2000-03-11",
  "date_available": "2014-03-14T20:08:00Z",
  "date_issued": "2000-03-02",
  "date_rdate": "2001-03-11",
  "date_sdate": "2000-03-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>A series of niobium-containing nitride and carbides were prepared by a temperature-programmed synthesis method.  The catalysts synthesized comprised a monometallic niobium oxynitride and a new bimetallic oxycarbide supported system, Nb-Mo-O-C/Al2O3 (Mo/Nb = 1.2; 1.6; 2.0).<p>In the case of the niobium oxynitride, the progress of formation was analyzed by interrupting the synthesis at various stages.  The effect of the heating rate on product properties was also investigated.  The solid intermediates and the final niobium oxynitride were characterized using X-ray diffraction (XRD), scanning electron microscopy (SEM), elemental analysis (CHNS), and gas adsorption techniques.  The solid state transformation occurred directly from Nb2O5 to NbNxOy without any suboxide intermediates.<p>The bimetallic supported oxycarbide materials were also characterized by X-ray diffraction (XRD), gas adsorption techniques, X-ray photoelectron spectroscopy (XPS), and near-edge X-ray absorption fine structure (NEXAFS).  It was found that the electronic properties of the oxycarbide were modified by the interaction with the Al2O3 support, and that most of the oxygen atoms were associated with the niobium rather than the molybdenum atom. All of the niobium-containing catalysts were tested in a three-phase trickle-bed reactor for the simultaneous hydrodenitrogenation (HDN) of quinoline and hydrodesulfurization (HDS) of dibenzothiophene. The niobium oxynitride presented low HDS activity and moderate HDN activity, whereas the supported bimetallic oxycarbide was found to be highly active for both, HDN and HDS, demonstrating higher activities than the commercial sulfided Ni-Mo/Al2O3 when compared on the basis of active sites.<p>In addition to these studies a comprehensive investigation of the HDN reaction mechanism was carried out over bulk unsupported Mo2C, NbC, NbMo2-O-C, and compared with the mechanism over a sulfide catalyst, MoS2/SiO2.  For this purpose, a comparison of the HDN rate of a series of isomeric amines was performed, and the reaction occurred mainly through a b-elimination mechanism for all catalysts. Temperature programmed desorption of ethylamine was used to investigate the acid properties of the catalytic surfaces, and a good agreement between the specific rate of reaction and the number of Brønsted acid-sites was obtained. Infrared spectroscopy showed that the amines interacted with acidic centers to form adsorbed quartenary ammonium species. The deamination reaction over the carbide and sulfide catalysts probably occurs by a concerted push-pull mechanism involving basic sulfur species and Brønsted-acidic centers. In order to obtain more insight into the mechanism a study of the pyridine HDN network was carried out.All of the catalysts showed the same activity trend: the reactivity of n-pentylamine was high, while those of piperidine and pyridine were relatively low. The carbide catalysts showed higher selectivity towards HDN products than the sulfide catalyst at the same conversion levels. The higher selectivity was related to the higher ratio (r = k2/k1) between the rate constants of the two consecutive reactions, hydrogenation of pyridine (k1) and ring opening of piperidine (k2).  The order of activity of the carbides and sulfide differed considerably depending on the substrate.  However, for the pyridine reaction network the similarity in product distribution suggested that a similar surface composition, a carbosulfide, was attained during the reaction.",
  "description_provenance": [
    "Author Email: vschwart@vt.edu",
    "Advisor Email: wvelande@vt.edu",
    "Advisor Email: pdeck@vt.edu",
    "Advisor Email: gvgibbs@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Advisor Email: oyama@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:00Z (GMT). No. of bitstreams: 15 chapter3_a.pdf: 64520 bytes, checksum: 5cc595cc101f00d933b77ee93d726745 (MD5) chapter5.pdf: 153090 bytes, checksum: f9551f49fbe93deedc7393802bbeacf0 (MD5) listfigs.pdf: 14526 bytes, checksum: c09663452c09d0f0ce24196780f5d48e (MD5) chapter3_b.pdf: 9029 bytes, checksum: 870bd1f7fdf39c5f6ec5fb6fb9cbc34f (MD5) chapter1.pdf: 11972 bytes, checksum: 047cf6505d82f096f40f603bb750197a (MD5) vita.pdf: 3672 bytes, checksum: 4a7a6c92c72f18d692aa18f4da08d404 (MD5) chapter6.pdf: 9804 bytes, checksum: 574c5110945073581e572aafc0871a1a (MD5) chapter4.pdf: 235145 bytes, checksum: b9b90ecfe47e5f49a199d86727e0527a (MD5) tablconten.pdf: 5382 bytes, checksum: d6b0d1090b6c15db6a18b677be8d4c03 (MD5) chapter2_a.pdf: 74267 bytes, checksum: 3180e5ba9cc85b32984a7650edc8fd0e (MD5) titlepg.pdf: 3916 bytes, checksum: 2ff100392467f2efc368b8b9f38ff857 (MD5) abst.pdf: 12426 bytes, checksum: 82ce0ab34026569aa8327f2ca378055c (MD5) chapter4_a.pdf: 29745 bytes, checksum: df8e602c2943e7e641c207763f1ecedd (MD5) chapter3.pdf: 103012 bytes, checksum: 788078e0b0ed1b25cb148cdd0a6c078b (MD5) chapter2.pdf: 296387 bytes, checksum: 66e11e37b136f3b88a75730f887a59c2 (MD5)   Previous issue date: 2000-03-02"
  ],
  "handle": "26368",
  "identifier_other": "etd-03062000-21090032",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03062000-21090032/",
  "identifier_uri": "http://hdl.handle.net/10919/26368",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chapter3_a.pdf",
    "chapter5.pdf",
    "listfigs.pdf",
    "chapter3_b.pdf",
    "chapter1.pdf",
    "vita.pdf",
    "chapter6.pdf",
    "chapter4.pdf",
    "tablconten.pdf",
    "chapter2_a.pdf",
    "titlepg.pdf",
    "abst.pdf",
    "chapter4_a.pdf",
    "chapter3.pdf",
    "chapter2.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "hydrodenitrogenation mechanism",
    "niobium nitride",
    "bimetallic carbide"
  ],
  "title": "Preparation and Reactivity of Niobium-Containing Hydrotreating Catalysts",
  "type": "Dissertation"
}