{
  "contributor_author": "Stanton, Kenneth C.",
  "contributor_committeechair": "Goff, Richard M.",
  "contributor_committeemember": [
    "Doolittle, Peter E.",
    "Jones, Brett D.",
    "Paretti, Marie C.",
    "Knott, Tamara"
  ],
  "contributor_department": "Engineering Education",
  "date_accessioned": "2014-03-14T20:07:58Z",
  "date_adate": "2011-03-28",
  "date_available": "2014-03-14T20:07:58Z",
  "date_issued": "2011-02-17",
  "date_rdate": "2011-03-28",
  "date_sdate": "2011-03-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purposes of this study were to conduct an exploratory study of the status quo of engineering faculty motivation for and engagement in formative assessment, and to conduct a preliminary validation of a motivational model, based in self-determination theory, that explains relationships between these variables.  To do so, a survey instrument was first developed and validated, in accordance with a process prescribed in the literature, that measured individual engineering faculty membersâ   motivational traits and engagement regarding formative assessment, as no such instrument existed.  The survey asked engineering faculty about their satisfaction of autonomy, competence, and relatedness needs, degree of self-determined motivation experienced, and engagement, all relative to formative assessment of student learning. <p> Data from the final instrument were obtained from a stratified national sample of approximately 2,500 U.S. engineering faculty, attaining 223 responses, and was first evaluated for validity and reliability.  The major validity check utilized was to review two examples of formative assessment that respondents provided and then discard data from invalid responses; over 70% of responses qualified as valid.  Only responses with valid examples of formative assessment were used, indicating that the inferences drawn from this study only directly pertain to faculty who understand formative assessment, a subset of the U.S. engineering faculty population.  The reliability of instrument constructs was evaluated through use of Cronbachâ  s Alpha, including removal of low-scoring survey items.  Following, the remaining data were analyzed with descriptive statistics to evaluate trends and with linear regression to validate the motivational model. <p> Results show that, for the subset of engineering faculty studied, engagement in formative assessment is positive, motivation for it is self-determined and largely derives from faculty identifying its contribution to teaching and learning, and needs of autonomy, competence, and relatedness are moderately to highly satisfied.  Further, from testing of the motivational model, it can be reasonably concluded that faculty engagement is significantly predicted by self-determined motivation, but the prediction of self-determined motivation by motivational needs has a caveat: the self-determined motivation of male engineering faculty was predicted by autonomy and relatedness, but by autonomy and competence for females.",
  "description_provenance": [
    "Author Email: kstanton@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: brettjones@vt.edu",
    "Advisor Email: richgoff@vt.edu",
    "Advisor Email: mparetti@vt.edu",
    "Advisor Email: knott@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:58Z (GMT). No. of bitstreams: 1 Stanton_KC_D_2011.pdf: 2962824 bytes, checksum: 3ae62009fd4871dd1b0bb2ea567b5ba4 (MD5)   Previous issue date: 2011-02-17"
  ],
  "handle": "26361",
  "identifier_other": "etd-03042011-142108",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03042011-142108/",
  "identifier_uri": "http://hdl.handle.net/10919/26361",
  "publisher": "Virginia Tech",
  "relation_haspart": "Stanton_KC_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Formative Assessment",
    "Engagement",
    "Motivation",
    "Faculty",
    "Engineering"
  ],
  "title": "Engineering Faculty Motivation for and Engagement in Formative Assessment",
  "type": "Dissertation"
}