{
  "contributor_author": "Roy, Abhishek",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Lesko, John Jack",
    "Davis, Richey M.",
    "Baird, Donald G.",
    "Riffle, Judy S."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:07:59Z",
  "date_adate": "2008-04-03",
  "date_available": "2014-03-14T20:07:59Z",
  "date_issued": "2008-02-19",
  "date_rdate": "2009-04-03",
  "date_sdate": "2008-03-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The major challenge of the research was to characterize and develop concepts for establishing structure/property relationships between the functionality of the polymer backbone, the states of water and the membrane transport properties.  Most of the hydrocarbon based random copolymers reported in the literature show reduced proton conductivity at low water content.  This was attributed to the formation of an isolated morphology.  Over the last few years our group has synthesized thermally stable multiblock copolymers with varying chemical structures and compositions.  Block copolymers consist of two or more incompatible polymers (i.e. blocks) that are chemically conjoined in the same chain.  The transport properties of the multiblock copolymers showed a strong dependence on the morphology in contrast to the random copolymers.  Irrespective of the nature of the backbone, the transport properties scaled with the block lengths of the copolymers.  An increase in block length for a given series of block copolymer was associated with improved proton conduction, particularly under partially hydrated conditions compared to the random copolymers.  The structure-property relationship of the proton conductivity and self-diffusion coefficient of water was obtained as a function of the volume fraction of water for all the random and block copolymers.  At a given volume fraction, the block copolymers displayed both higher self-diffusion coefficients of water and proton conductivities relative to the random copolymers.  This improvement in transport properties indicates the presence of desired and favorable morphology for the blocks.  For DMFC applications, the block copolymers also showed low methanol permeability and high selectivity.  The states of water in the copolymers were characterized using DSC and NMR relaxation techniques.  At similar ionic contents, the free water concentration increased with increasing block lengths.  The distribution of the states of water in the copolymers correlates to transport properties.  This knowledge, coupled with the state of water experiments, transport measurements, and chemical structure of the copolymers provided a fundamental picture of how the chemical nature of a phase separated copolymer influences its transport properties.  The experimental procedure involved impedance spectroscopy, DSC, TGA, FTIR, DMA, pulse gradient stimulated echo (PGSE) NMR, NMR relaxation experiments and various electrochemical fuel cell performance experiments.",
  "description_provenance": [
    "Author Email: aroy@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:59Z (GMT). No. of bitstreams: 1 AbhishekRoyETD.pdf: 4031178 bytes, checksum: 10708555a869718b739e29e22ca735ba (MD5)   Previous issue date: 2008-02-19"
  ],
  "handle": "26365",
  "identifier_other": "etd-03052008-002040",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03052008-002040/",
  "identifier_uri": "http://hdl.handle.net/10919/26365",
  "publisher": "Virginia Tech",
  "relation_haspart": "AbhishekRoyETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Morphology",
    "Transport",
    "Block Copolymer",
    "States of Water",
    "Proton Exchange Membranes"
  ],
  "title": "Structure Property Relationships of Proton Exchange Membranes",
  "type": "Dissertation"
}