{
  "contributor_author": "Monthei, Derek Reed",
  "contributor_committeechair": "Fell, Richard D.",
  "contributor_committeemember": [
    "Behonick, George S.",
    "Peace, Michelle R.",
    "Paulson, Sally L.",
    "Brewster, Carlyle C.",
    "Pelzer, Kevin D."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:07:59Z",
  "date_adate": "2009-04-02",
  "date_available": "2014-03-14T20:07:59Z",
  "date_issued": "2009-02-06",
  "date_rdate": "2009-04-02",
  "date_sdate": "2009-03-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Studies were conducted on the effects of alcohol and opioids on the development of forensically important flies.  In addition different methods of degree-day calculations and development thresholds were used to determine the effects on PMI estimates.  The first study determined the effects of ethanol on the development of Phormia regina in vitro.  Ground pork loin was treated with a 1, 5, or 10% ethanol solution to give an equivalent Blood Alcohol Concentration (BAC) of 0.01, 0.04, and 0.8 % w/v. A significant difference in the time for second instarsâ   to complete the stage was seen between the 1% treated and control. Significant differences were also found among pupal and adult weights between all treatments and the control. A significant difference was shown between growth curves of the 5% treated and control for third instar larvae using the Kolmogorov-Smirnov test.       The ethanol content of Phormia regina in migrating third instar larvae that fed on treated meat was examined using headspace-gas chromatography (HSGC).  All larvae had a content of 0.01% w/v, including the control.      The effects of ante-mortem injection of oxycodone in pigs were examined with respect to insect succession patterns and the development rates of Phormia regina.  Pigs were given a subcutaneous injection of oxycodone hydrochloride (3 mg/kg by weight) and antemortem blood samples were collected prior to and following drug injection. Shortly after death the carcasses were placed at an open field site and allowed to decompose in a field cage.  Insect samples were collected from carcasses for seven days post-mortem and the collected data were used to develop occurrence matrices.  The Simple Matching Coefficient showed that successional patterns were similar between treated and untreated animals.  Loin and liver from the carcasses were used as  rearing media for in vitro development studies of Phormia regina.  Kolmogorov-Smirnov test showed that third instar P. regina maggots from treated loin tissue were significantly longer in length than maggots feeding on untreated loin tissue.  A significant difference in time was found among larvae on loin for the time from eclosion to completion of the second instar.  Significant differences were seen in the weight of adults reared on liver and loin.  A chi-square for homogeneity showed that adults were biased towards males (2:1) from untreated loin tissue.      A final study compared weather data sources, Accumulated Degree-Day (ADD) methods, and postmortem interval (PMI) estimations based on threshold and developmental data source. Four pigs were used for statistical comparisons.  Pigs were taken to a test site and allowed to decompose in an experimental cage.  Probes recorded ambient temperatures and body temperatures.  Maggot sampling was completed every day for each pig. A three way factorial linear fit model was used to test for statistical differences.  Significant differences were seen in the calculated ADD based on probe location and the development threshold used. The ADD calculated from local weather station locations: Kentland Farm, Moore Farm, and Blacksburg Airport were also compared.  A significant difference in ADD was found in the main effects among locations (Airport 44.1 ADD, Kentland 37.5 ADD, Moore 48.6 ADD), as well as among the thresholds used (10,12.2, and 14Â°C).  Different PMI estimations also resulted when using development data from different development studies on Phormia regina.",
  "description_provenance": [
    "Author Email: montheid@vt.edu",
    "Advisor Email: behonicg@ummhc.org",
    "Advisor Email: mrpeace@vcu.edu",
    "Advisor Email: spaulson@vt.edu",
    "Advisor Email: carlyleb@vt.edu",
    "Advisor Email: rfell@vt.edu",
    "Advisor Email: kpelzer@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:59Z (GMT). No. of bitstreams: 1 derekmonthei.pdf: 946984 bytes, checksum: 7298cf484c1186160cd582f3fa5eaef1 (MD5)   Previous issue date: 2009-02-06"
  ],
  "handle": "26366",
  "identifier_other": "etd-03052009-142013",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03052009-142013/",
  "identifier_uri": "http://hdl.handle.net/10919/26366",
  "publisher": "Virginia Tech",
  "relation_haspart": "derekmonthei.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "postmortem interval",
    "degree-days",
    "entomotoxicology",
    "forensic entomology"
  ],
  "title": "Entomotoxicological and Thermal Factors Affecting the Development of Forensically Important Flies",
  "type": "Dissertation"
}