{
  "contributor_author": "Xiong, Xinsheng",
  "contributor_committeechair": "Cowles, Joseph R.",
  "contributor_committeemember": [
    "Lederman, Muriel L.",
    "Grabau, Elizabeth A.",
    "Esen, Asim",
    "Rutherford, Charles L."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:07:59Z",
  "date_adate": "2000-03-11",
  "date_available": "2014-03-14T20:07:59Z",
  "date_issued": "1999-09-16",
  "date_rdate": "2001-03-11",
  "date_sdate": "2000-03-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "cDNA Cloning and Gene Characterization of Large and Small Subunits of Ribonucleotide Reductase in Soybean by Xinsheng Xiong Joe R. Cowles, Committee Chairman Department of Biology  Abstract       Ribonucleotide reductase (RNR) reduces four ribonucleoside diphosphates to corresponding deoxyribonucleoside diphosphates, which are transformed into deoxyribonucleoside triphosphates, substrates for DNA polymerase. By controlling the supply and balance of deoxyribonucleoside diphosphates, RNR regulates DNA synthesis. RNR in E. coli and in animals consists of two identical large and two identical small subunits. Until recently, little was known about RNR in plants. For cloning RNR cDNA in plants, soybean (Glycine max) cDNAs were amplified with highly degenerate primers and the Rapid Amplification of cDNA Ends techniques. The cDNAs encoding two complete large subunits, one partial large subunit and one complete small subunit of RNR in soybean were cloned and sequenced. The RNR large subunits in soybean contain a motif with 20 amino acids, which appears to be specific for the RNR large subunits in plants. Southern hybridization results imply that a gene family encodes at least three different large subunits of RNR in soybean, and that a single gene encodes the small subunit. The presence of three different large subunits of RNR in soybean suggests that RNR complex in some plants may have a non-homodimer structure; alternatively, some plants may have different RNR isozymes. Northern hybridization results show that RNR large and small subunit genes in soybean are expressed both in dark-grown and light-grown seedlings, and that light does not increase RNR mRNA levels. Multiple poly(A) sites and different lengths of the 3â   untranslated regions were found in cDNAs encoding some subunits of RNR in soybean. The same cis-acting elements may imprecisely locate some multiple poly(A) sites in plants.",
  "description_provenance": [
    "Author Email: xxiong@vt.edu",
    "Advisor Email: lederman@vt.edu",
    "Advisor Email: egrabau@vt.edu",
    "Advisor Email: cowlesjr@vt.edu",
    "Advisor Email: esen@vt.edu",
    "Advisor Email: rutherfo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:07:59Z (GMT). No. of bitstreams: 8 04.pdf: 57427 bytes, checksum: f5c0a2aba9052169b3985770e2a37741 (MD5) 07.pdf: 3153 bytes, checksum: a3c990adf59171af2813a67a3a5adae6 (MD5) 06.pdf: 4137 bytes, checksum: f29e02df5e6845111d1af40379fce185 (MD5) 01.pdf: 2429 bytes, checksum: 151fa199e37738c1ee493806868c2b64 (MD5) 08.pdf: 193856 bytes, checksum: bed61d71f027069f51448d97faedb8c0 (MD5) 02.pdf: 28352 bytes, checksum: 083968e707f248e2e2d2dc47a52aff61 (MD5) 05.pdf: 6832 bytes, checksum: aa427ee8b0370bd7f78670afcc3e8009 (MD5) 03.pdf: 7280 bytes, checksum: bea4b3789e9a1e3ed786b6439899f977 (MD5)   Previous issue date: 1999-09-16"
  ],
  "handle": "26364",
  "identifier_other": "etd-03052000-21010000",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03052000-21010000/",
  "identifier_uri": "http://hdl.handle.net/10919/26364",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "04.pdf",
    "07.pdf",
    "06.pdf",
    "01.pdf",
    "08.pdf",
    "02.pdf",
    "05.pdf",
    "03.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Soybean",
    "Cloning",
    "Ribonucleotide Reductase",
    "DNA Sequence",
    "Poly(A) Site",
    "Gene Expression",
    "Gene Family"
  ],
  "title": "cDNA Cloning and Gene Characterization of Large and Small Subunits of  Ribonucleotide Reductase in Soybean",
  "type": "Dissertation"
}