{
  "contributor_author": "Laws, Eric L.",
  "contributor_committeechair": "Prestrude, Albert M.",
  "contributor_committeemember": [
    "Cherry, Donald S.",
    "Bell, Martha Ann",
    "Friedman, Bruce H.",
    "Crawford, Helen J."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:08:00Z",
  "date_adate": "2000-03-14",
  "date_available": "2014-03-14T20:08:00Z",
  "date_issued": "2000-01-31",
  "date_rdate": "2001-03-14",
  "date_sdate": "2000-03-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Observer Imagery Vividness for Blue, Green and Orange Test Hues By Eric L. Laws Committee Chair: Dr. A. M. Prestrude Department of Psychology (Abstract)   Fifty-two college-aged observers participated in an experiment assessing color memory via a PowerPoint '97 computer display program which varied one of the three dimensions of hue, saturation and lightness at a time.  Consistent with previous research, errors were greater for the lightness conditions followed by saturation, and least for hue conditions  Additionally, a signal detection analysis indicated that d-prime was greatest for the hue conditions, less for saturation and lowest for lightness conditions.  There were also significant but unpredicted differences in response criterion which may reflect task difficulty.  Scores on the Vividness of Visual Imagery Questionnaire (Marks, 1973) were, in general, not correlated with performance on these color memory tasks, inconsistent with previous research.  The role of complexity of neuronal circuitry, the significance for opponent-process, trichromatic and retinex color vision theories and the relationship to Sokolov's model of color memory were discussed.  Also, it was concluded that investigators of color memory using a computer display are well-advised to calibrate the monitor with a colorimeter because the internal computer units may be unreliable indexes of changes in hue, saturation and lightness.",
  "description_provenance": [
    "Author Email: eric_laws@yahoo.com",
    "Advisor Email: dcherry@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: bhfriedm@vt.edu",
    "Advisor Email: alpres@vt.edu",
    "Advisor Email: hjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:00Z (GMT). No. of bitstreams: 1 DISS2.pdf: 53322122 bytes, checksum: dd71c54f8ae8ba2d6c29322c23c3772a (MD5)   Previous issue date: 2000-01-31"
  ],
  "handle": "26367",
  "identifier_other": "etd-03062000-09310016",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03062000-09310016/",
  "identifier_uri": "http://hdl.handle.net/10919/26367",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISS2.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "CRT Displays",
    "Colorimeter",
    "Color Perception",
    "VVIQ",
    "Color Memory",
    "Signal Detection Theory"
  ],
  "title": "An Investigation of Color Memory as a Function of Hue, Saturation, Lightness and Observer Imagery Vividness for Blue, Green and Orange Test Hues",
  "type": "Dissertation"
}