{
  "contributor_author": "Divoux, Gilles Michel Marc",
  "contributor_committeechair": "Moore, Robert B.",
  "contributor_committeemember": [
    "Baird, Donald G.",
    "Ellis, Michael W.",
    "McGrath, James E.",
    "Mauritz, Kenneth A."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:08:02Z",
  "date_adate": "2012-04-04",
  "date_available": "2014-03-14T20:08:02Z",
  "date_issued": "2012-02-20",
  "date_rdate": "2012-04-04",
  "date_sdate": "2012-03-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Over the past three decades, the steady decrease in fossil energy resources, combined with a sustained increase in the demand for clean energy, has led the scientific community to develop new ways to produce energy.  As is well known, one of the main challenges to overcome with fossil fuel-based energy sources is the reduction or even elimination of pollutant gases in the atmosphere.  Although some advances have helped to slow the emission of greenhouse gases into the atmosphere (e.g., electric cars and more fuel-efficient gas-burning automobiles), most experts agree that it is not enough. Proton Exchange Membrane (PEM) fuel cells have been widely recognized as a potentially viable alternative for portable and stationary power generation, as well as for transportation.  However, the widespread commercialization Proton Exchange Membrane Fuel Cells (PEMFCs) involves a thorough understanding of complex scientific and technological issues.  This study investigated the various structure-property relationships and materials durability parameters associated with PEMFC development.   First, the correlation between perfluorinated ionomer membranes and processing/performance issues in fuel cell systems was investigated. As confirmed by small-angle X-ray scattering data, impedance analysis, and dynamic mechanical analysis, solution processing with mixed organic-inorganic counterions was found to be effective in producing highly arranged perfluorinated sulfonic acid ionomer (PFSI) membranes with more favorable organization of the ionic domain.  Moreover, thermal annealing was shown to enhance the proton  mobility, thereby facilitating reorganization of the polymer backbone and the hydrophilic region for improved crystallinity and proton transport properties.  This research also confirmed an increase in water uptake in the solution-processed membranes under investigation, which correlated to an increase in proton conductivity.  Thus, annealing and solution-processing techniques were shown to be viable ways for controlling morphology and modulating the properties/performance of PFSI membranes. Second, this study investigated the role of the morphology on water and proton transport in perfluorinated ionomers.  When annealed at high temperatures, a significant decrease in water uptake and an increase in crystallinity were observed, both of which are detrimental to fuel cell performance.  Additionally, controlling the drying process was found to be crucial for optimizing the properties and performance of these membranes, since drying at temperatures close or above the Î±-relaxation temperature causes a major reorganization within the ionic domains.   Third, although many investigations have looked at key PEMFC components, (e.g., the membrane, the catalyst, and the bipolar plates), there have been few studies of more â  minorâ   componentsâ  namely, the performance and durability of seals, sealants, and adhesives, which are also exposed to harsh environmental conditions.  When seals degrade or fail, reactant gases leak or are mixed, it can degrade the membrane electrode assembly (MEA), leading to a performance decrease in fuel cell stack performance.  This portion of the research used degradation studies of certain proprietary elastomeric materials used as seals to investigate their overall stability and performance in fuel cell environments with applied mechanical stresses.  Additionally, characterization of the mechanical and viscoelastic properties of these materials was conducted in order to predict the durability based on accelerated aging simulations as well.  Continuous stress relaxation (CSR) characterization was performed on molded seals over a wide range of aging conditions using a customized CSR fixture.  The effects of temperature, stress, and environmental conditions are reported in terms of changes in momentary and stress relaxations, chain scission and secondary crosslink formation.  Aging studies provided insights on how anti-degradants or additives affect the performance and properties of sealing materials, as well as how a variety of environmental considerations might be improved to extend the lifetime of these elastomers.",
  "description_provenance": [
    "Author Email: gilles.divoux@gmail.com",
    "Advisor Email: rbmoore3@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: mwellis@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: kenneth.mauritz@usm.edu",
    "Made available in DSpace on 2014-03-14T20:08:02Z (GMT). No. of bitstreams: 2 DIVOUX_GM_D_2012.pdf: 12599319 bytes, checksum: 9a4bf3df1d63b973a76219ee020fd7d3 (MD5) DIVOUX_GM_D_2012_Copyrights.pdf: 1028317 bytes, checksum: 10ee2471c06ab608966eb0ee29709f81 (MD5)   Previous issue date: 2012-02-20"
  ],
  "handle": "26374",
  "identifier_other": "etd-03062012-073645",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03062012-073645/",
  "identifier_uri": "http://hdl.handle.net/10919/26374",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "DIVOUX_GM_D_2012.pdf",
    "DIVOUX_GM_D_2012_Copyrights.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fuel cell",
    "semicrystalline ionomer",
    "Nafion",
    "perfluorosulfonic acid ionomer",
    "proton exchange membrane",
    "morphology",
    "processing of elatomers",
    "degradation of elastomers",
    "proton exchange membrane fuel cell",
    "structure-property relationshipe"
  ],
  "title": "Properties and Performance of Polymeric Materials Used in Fuel Cell Applications",
  "type": "Dissertation"
}