{
  "contributor_author": "Bangor, Aaron W.",
  "contributor_committeechair": "Beaton, Robert J.",
  "contributor_committeemember": [
    "Van Aken, Eileen M.",
    "Koelling, Charles Patrick",
    "Prestrude, Albert M.",
    "Dingus, Thomas A."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:08:02Z",
  "date_adate": "2001-04-06",
  "date_available": "2014-03-14T20:08:02Z",
  "date_issued": "2000-12-19",
  "date_rdate": "2002-04-06",
  "date_sdate": "2001-03-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Display Technology and Ambient Illumination Influences on Visual Fatigue at VDT Workstations <p> Aaron Bangor <p> (ABSTRACT) <p> The concept of \"visual fatigue\" has been studied for 70 years or more.  In that time, no single metric of measuring visual fatigue nor one agreed-upon set of tasks to induce visual fatigue has been settled upon.  Not even a robust definition of visual fatigue has been established.  This research worked to solve some of those problems. <p> This research first set out to develop an index of visual fatigue that could be used effectively in quantifying the subjective experience of visual fatigue.  Then it sought to create a set of measurable tasks, representative of office work, that would induce visual fatigue.  Taking these two developments, an experiment using human participants was conducted to validate these developments and work toward solving two issues in the visual fatigue field: how visual display technology and ambient illumination affect the onset of visual fatigue.  A 4x4 within-subjects design was developed and executed to study how these two independent variables affected ratings of visual fatigue, performance on the task battery, subjective image quality judgments, and contrast sensitivity shifts. <p> Two cathode ray tube (CRT) and two active-matrix LCD (AMLCD) monitors were used in this study.  While many instances of the monitors as a whole caused significant differences in reports of visual fatigue, performance, subjective image quality, and contrast sensitivity loss, only a slight effect of display technology was found.  Four of eleven visual fatigue and two of eight subjective image quality dimensions showed that the LCD monitors induced more visual fatigue and were rated poorer than the CRT monitors. <p> Ambient illumination levels of 0, 300, 600, and 1200 lux affected all four groups of dependent variables.  On the whole, lighting caused visual fatigue, with \"watery eyes\" and \"glare from lights\" being adversely affected by brighter lighting.  The 0 and 1200 lux were associated with the worst performance, while 300 lux was associated with the best performance.  Subjective image quality was affected by lighting, with increasing lighting causing bothersome screen reflections and more temporal (e.g., flicker and jitter) distortions; 600 lux induced more reports of image sizing anomalies.  Finally, it caused significantly worse shifts at the 6.0 c/deg spatial frequency on the contrast sensitivity test.  The data show that lighting of 300 lux is the best of these four illumination levels. <p> The results of this study not only contribute to the body of research in the areas of display technology and ambient illumination, but several developments of this research are offered to the research community: a complete survey metric of visual fatigue, a standardized battery of tasks for studying visual fatigue and image quality, and a comprehensive subjective image quality survey. >p>",
  "description_provenance": [
    "Author Email: abangor@vt.edu",
    "Advisor Email: evanaken@vt.edu",
    "Advisor Email: koelling@vt.edu",
    "Advisor Email: bobb@vt.edu",
    "Advisor Email: alpres@vt.edu",
    "Advisor Email: tdingus@ctr.vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:02Z (GMT). No. of bitstreams: 1 vfatigue.pdf: 480585 bytes, checksum: 4a7986886083eb95829c353455dfa869 (MD5)   Previous issue date: 2000-12-19"
  ],
  "handle": "26376",
  "identifier_other": "etd-03072001-091123",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03072001-091123/",
  "identifier_uri": "http://hdl.handle.net/10919/26376",
  "publisher": "Virginia Tech",
  "relation_haspart": "vfatigue.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ambient illumination",
    "contrast sensitivity",
    "LCD",
    "CRT",
    "office work",
    "image quality",
    "VDU",
    "visual discomfort",
    "visual fatigue",
    "VDT"
  ],
  "title": "Display Technology and Ambient Illumination Influences on Visual Fatigue at VDT Workstations",
  "type": "Dissertation"
}