{
  "contributor_author": "Olbina, Svetlana",
  "contributor_committeechair": "Beliveau, Yvan J.",
  "contributor_committeemember": [
    "Suchicital, Carlos T. A.",
    "Thabet, Walid",
    "Jones, James R.",
    "O'Brien, Michael J.",
    "Wakefield, Ronald R."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:08:01Z",
  "date_adate": "2005-03-11",
  "date_available": "2014-03-14T20:08:01Z",
  "date_issued": "2005-02-11",
  "date_rdate": "2005-03-11",
  "date_sdate": "2005-03-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Most shading device systems installed in windows or glass walls are used only for protection from overheating and glare, neglecting other possible functions, such as increasing the daylight level in the space or collecting solar energy. The blinds are usually made of opaque or translucent materials, and if they are partially open/closed or completely closed, a direct view to the outside is blocked. A balance between a sufficient amount of daylight and protection from overheating of the space in summer is not often achieved due to inappropriate control of the blindsâ   tilt angle. There is also a need for specific guidance for the selection and design of shading device systems in the windows.<p>  This research develops a general decision-making framework (DMF) that can be used by architects and manufacturers of shading devices. The general DMF is a guide for the user in analyzing shading device performance in the process of selection/design of the shading device. This research also develops a specific DMF to better understand and validate the general DMF. The specific DMF, based on illuminance and luminance, is used for an analysis of daylighting performance of shading devices to select the best possible existing system or new system among several alternatives. Architects or manufacturers of shading devices, as the users of the DMF, analyze various systems of blinds applied on a particular building and at a given location. The users of the DMF can apply either an experimental procedure or computer simulation that provides information about illuminance and luminance levels in the space. Based on the analysis of the results of the experiments or simulations, the user of the DMF decides which blinds to select. The specific DMF proposes a methodology for both the analysis of the daylighting performance and for the process for making a decision based on the results of the analysis.<p>  A case study is conducted in order to validate the DMF. Three types of shading devices are tested: an existing system, a patented system, and a new system, proposed by this research. The shading devices are installed in an office space located in Roanoke, Virginia. The software Autodesk VIZ 4 is used to simulate daylighting performance. The output information, such as illuminance and luminance levels in the space, is used as a basis for making the decision about which type of blinds to apply. A new system of shading device, which has a triangular cross section and is made of clear plastic with a silver coating on one side, shows better performance than the existing shading device and the patented shading device, given the research limitations.<p>  By using the specific decision-making framework, a shading device manufacturer/designer is able to understand the shading device daylighting performance from his design-imposed criteria. Selection of the shading device, given the designerâ  s daylighting objectives, is better achieved. Existing shading devices are also able to be analyzed from a building designerâ  s perspective. This analysis is based on the designer-imposed daylighting criteria. The specific decision-making framework helps the designers of the buildings, together with the clients, select the most appropriate shading device based on daylighting performance. The decision-making framework is a model for development of decision-making software that will help designers of buildings, facades, and shading device systems in the selection/design of shading device systems in all phases of the design.",
  "description_provenance": [
    "Author Email: solbina@vt.edu",
    "Advisor Email: ctas@vt.edu",
    "Advisor Email: thabet@vt.edu",
    "Advisor Email: jajone10@vt.edu",
    "Advisor Email: mjobrien@vt.edu",
    "Advisor Email: yvan@vt.edu",
    "Advisor Email: ronwak@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:01Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 13422224 bytes, checksum: 36b657a08b550529779fbf4202cb1922 (MD5)   Previous issue date: 2005-02-11"
  ],
  "handle": "26370",
  "identifier_other": "etd-03062005-104155",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03062005-104155/",
  "identifier_uri": "http://hdl.handle.net/10919/26370",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "simulation",
    "daylighting",
    "transparent blinds",
    "illuminance/luminance"
  ],
  "title": "Decision-Making Framework for the Selection and Design of Shading Devices",
  "type": "Dissertation"
}