{
  "contributor_author": "Lekagul, Apichoke",
  "contributor_committeechair": "Miller, Patrick A.",
  "contributor_committeemember": [
    "Dyck, Robert G.",
    "Littlefield, James E.",
    "Sewell, Edward H. Jr.",
    "Bohland, James R."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:08:02Z",
  "date_adate": "2002-03-08",
  "date_available": "2014-03-14T20:08:02Z",
  "date_issued": "2002-02-21",
  "date_rdate": "2003-03-08",
  "date_sdate": "2002-03-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objectives of this dissertation are to: 1) identify the aspects of shopping environments that are important to people; and 2) identify strategies to maintain the cultural relevance and viability of traditional marketplaces in the new global economy.  This dissertation uses a Content Identifying Methodology (CIM) to determine preferences of general Thai shoppers for different shopping environments in Bangkok, Thailand.  The procedures include preference rating, scene description, and respondents창   background surveys.  Data were analyzed using factor analysis, content analysis, Analysis of Variance (ANOVA), canonical correlation analysis, and Multivariate Analysis of Variance (MANOVA).   In addition, interviews with designers and developers of shopping environments are used to establish implications for future development, design, and renovation of shopping environments.   Three major factors, environmental, shopping, and background, were found to influence preferences for shopping environments.  The environmental factors include the perceived environmental types; spacious and well-organized spatial configurations; physical content, such as fresh products, vegetation, and sitting areas; and environmental conditions, such as maintenance level, crowdedness, and cool temperatures.  Shopping factors include recreational and value shopping.  Respondent창  s background factors include shopping behaviors and socio-economic backgrounds, such as age and household economic status.   Shoppers prefer certain shopping environments based on their shopping purpose: recreational versus value shopping.  Recreational shopping appeals to young, single, and big group shoppers at modern malls, which provide the most opportunities for exploring, recreating, and socializing.  Value shopping appeals to older, married, and large family shoppers at traditional markets that offer the high quality fresh products at low price.   The dissertation창  s findings are consistent with previous studies and support theoretical explanations in the environmental perception and assessment field.   Coherence, complexity, legibility, and mystery, and the concept of affordance influence preference; and are useful in making recommendations.  The results indicate that, by identifying the preferences and perceptions of Thai shoppers, it is possible to preserve important aspects of the traditional Thai marketplace.  This is achieved by incorporating aspects of traditional Thai markets into new shopping environments; and enhancing existing traditional markets to give them broader appeal and make them more viable in today창  s economy.",
  "description_provenance": [
    "Author Email: alekagul@vt.edu, lakalan@yahoo.com, apichoke@chula.com",
    "Advisor Email: bobdyck@vt.edu",
    "Advisor Email: jalittle@vt.edu",
    "Advisor Email: esewell@vt.edu",
    "Advisor Email: jayjon@vt.edu",
    "Advisor Email: pmiller@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:02Z (GMT). No. of bitstreams: 10 08Bibliography.pdf: 30959 bytes, checksum: 735e5a596f2fcfe7f3a8ce5e6061b85d (MD5) 07Chapter6DiscussionandImplication.pdf: 366459 bytes, checksum: 03bcd4d27f324bea66533306fb183842 (MD5) 03Chapter2Context.pdf: 190677 bytes, checksum: 5ca26aeb21c7fb95f51aac2496401727 (MD5) 04Chapter3LiteratureReview.pdf: 329214 bytes, checksum: 7c6cfd1666f5d63fbc63f95add389c33 (MD5) 02Chapter1Introduction.pdf: 76679 bytes, checksum: 5c91c41c80524f7c6f4daf3c3076199c (MD5) 01TitleAbstractIndex.pdf: 266434 bytes, checksum: 4a5f3c80a07907fa8f8da4165b7a4ac7 (MD5) 10CurriculumVitae.pdf: 81739 bytes, checksum: 5944eb656c83d739569fba2f9306f5eb (MD5) 09Appendixes.pdf: 6442652 bytes, checksum: d7e78e1f8c55c186afbc7e80d69b686f (MD5) 05Chapter4Methodology.pdf: 164401 bytes, checksum: 7cbb738ca0982af39dab8050a7491ab0 (MD5) 06Chapter5Results.pdf: 7847901 bytes, checksum: 3fec504ccbb8b24e2d2138ac58384935 (MD5)   Previous issue date: 2002-02-21"
  ],
  "handle": "26378",
  "identifier_other": "etd-03072002-181243",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03072002-181243/",
  "identifier_uri": "http://hdl.handle.net/10919/26378",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "08Bibliography.pdf",
    "07Chapter6DiscussionandImplication.pdf",
    "03Chapter2Context.pdf",
    "04Chapter3LiteratureReview.pdf",
    "02Chapter1Introduction.pdf",
    "01TitleAbstractIndex.pdf",
    "10CurriculumVitae.pdf",
    "09Appendixes.pdf",
    "05Chapter4Methodology.pdf",
    "06Chapter5Results.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Traditional Environment",
    "Perception",
    "Preference",
    "Preservation",
    "Traditional Marketplace",
    "Shopping Environment",
    "Vernacular Environment",
    "Thailand",
    "Bangkok"
  ],
  "title": "Toward Preservation of the Traditional Marketplace: A Preference Study of Traditional and Modern Shopping Environments in Bangkok, Thailand",
  "type": "Dissertation"
}