{
  "contributor_author": "Ransome, Myrna M.",
  "contributor_committeechair": "Singh, Kusum",
  "contributor_committeemember": [
    "Skaggs, Gary E.",
    "Allen, Katherine R.",
    "Dika, Sandra L.",
    "Burge, Penny L."
  ],
  "contributor_department": "Educational Research and Evaluation",
  "date_accessioned": "2014-03-14T20:08:01Z",
  "date_adate": "2006-05-05",
  "date_available": "2014-03-14T20:08:01Z",
  "date_issued": "2006-02-10",
  "date_rdate": "2008-05-05",
  "date_sdate": "2006-03-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT  This study focuses on the effects of part-time employment of high school students during the school year. While there are many benefits to be derived from part-time employment, many researchers have concluded that working intensely (over 20 hours per week) during the school year has deleterious academic, social, and psychological effects on high school studentsâ   achievement (Bachman & Schulenberg, 1983; Mortimer & Finch, 1986; Steinberg & Dornbusch, 1991; Wright, Cullen, & Williams, 2002). The study made reference to the theory of social embeddedness (Granovetter, 1985) and the primary orientation model (Warren, 2002) which suggested that high intensity work reduces time to focus on and become involved in other activities. There is also application to the ecological theory of human development (Bronfenbrenner, 1986) which stated that social contexts such as school, family, and work should all have connections to provide significant influences on adolescentsâ   development.    In this study, it was hypothesized that intense work involvement would be related to less engagement in school and school activities. It was further hypothesized that intensity of work will be negatively related to family and peer relationships.  The data for the study were obtained from three school divisions in southwest Virginia. A sample of N=1,402 high school students in grades 9-12 was used. Students completed the Work, School, and Social Experiences of High School Students Survey, which was adapted for the study. The data were analyzed using SPSS 14.0. The researcher employed descriptive and regression based analysis procedures to answer the research questions, and to determine the relationships among variables of interest.  The results indicated that intense part-time employment by high school students has negative effects on grades, family relationships, and peer relationship and often contributes to increased stress in the lives of these students.  Part-time employment affects all aspects of studentsâ   lives and is far nuanced and needs continued attention and supervision from parents, educators, and teachers.  This research was supported by a 2005 Graduate Research Development Project grant from the Graduate Student Assembly at Virginia Polytechnic Institute and State University (Virginia Tech).",
  "description_provenance": [
    "Author Email: mransome@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: Sandra_Dika@brown.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:01Z (GMT). No. of bitstreams: 17 chapter2.pdf: 52975 bytes, checksum: 3f363b0941709fc7abf48e52fbdf314a (MD5) appendixa.pdf: 297756 bytes, checksum: 4ac01bf63c0097f949a82251d6190f83 (MD5) chapter1.pdf: 35687 bytes, checksum: 32f3db73791db5260bc56bd9ae179f53 (MD5) appendixg.pdf: 4636 bytes, checksum: 34dcc2962ae7ec591adf2159378e584b (MD5) appendixh.pdf: 5660 bytes, checksum: b34a93b9e4e4edf83eb5421a5a5209df (MD5) appendixf.pdf: 6016 bytes, checksum: 309b02b8b17bb1e0082ca5d9051acb0f (MD5) chapter5.pdf: 25217 bytes, checksum: 221210b6e20036372fdd9a41a23b6085 (MD5) appendixe.pdf: 10215 bytes, checksum: 6389818c60d127aa13b3d76bf8d008d3 (MD5) references.pdf: 37270 bytes, checksum: 367f9cd5c50aa1ba79cb2e70359a8d64 (MD5) VITA.pdf: 11488 bytes, checksum: 482a8ce4ebfb96c912092aa5e68f9f06 (MD5) appendixi.pdf: 9500 bytes, checksum: 03315d665cbdacb95b8adef2bfcb009e (MD5) appendixc.pdf: 45599 bytes, checksum: bcc960e9ab7c2cb2d171341de90d9c35 (MD5) appendixd.pdf: 4390 bytes, checksum: d30cc5172b32fbf7b7894acc912719fa (MD5) chapter4.pdf: 112358 bytes, checksum: 4cc665aedc0b97338ed473da23c32445 (MD5) appendixb.pdf: 10917 bytes, checksum: e7513bff83452f33ce59f09cf9f694ad (MD5) chapter3.pdf: 19300 bytes, checksum: 4837b2f7c17893080987f579652e4ca6 (MD5) etd.pdf: 55649 bytes, checksum: eeaaef69345349bd8c34d7c9b165764f (MD5)   Previous issue date: 2006-02-10"
  ],
  "handle": "26371",
  "identifier_other": "etd-03062006-182921",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03062006-182921/",
  "identifier_uri": "http://hdl.handle.net/10919/26371",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chapter2.pdf",
    "appendixa.pdf",
    "chapter1.pdf",
    "appendixg.pdf",
    "appendixh.pdf",
    "appendixf.pdf",
    "chapter5.pdf",
    "appendixe.pdf",
    "references.pdf",
    "VITA.pdf",
    "appendixi.pdf",
    "appendixc.pdf",
    "appendixd.pdf",
    "chapter4.pdf",
    "appendixb.pdf",
    "chapter3.pdf",
    "etd.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "High School Students",
    "Youth Employment",
    "Student Employment",
    "Part-Time Employment"
  ],
  "title": "Part-time employment in high school years: educational, social, and psychological effects.",
  "type": "Dissertation"
}