{
  "contributor_author": "Miao, Ran",
  "contributor_committeechair": "Brewer, Karen J.",
  "contributor_committeemember": [
    "Yee, Gordon T.",
    "Taylor, Larry T.",
    "Hanson, Brian E.",
    "Deck, Paul A."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:08:01Z",
  "date_adate": "2008-04-29",
  "date_available": "2014-03-14T20:08:01Z",
  "date_issued": "2007-12-04",
  "date_rdate": "2009-04-29",
  "date_sdate": "2008-03-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This thesis describes the study of a series of multimetallic supramolecules containing varied metals and ligands, synthesized by a building block method and characterized by mass spectrometry, electronic absorption spectroscopy, and electrochemistry. Incorporating different functional units into complex systems allowed these multimetallic supramolecules to perform various light activated tasks including DNA cleavage and hydrogen generation from water.     The complex [({(bpy)<sub>2</sub>Os(dpp)}<sub>2</sub>Ru)<sub>2</sub>(dpq)](PF<sub>6</sub>)<sub>12</sub> and [{(bpy)<sub>2</sub>M(dpp)}<sub>2</sub>Ru(BL)PtCl<sub>2</sub>](PF<sub>6</sub>)<sub>6</sub> were synthesized (M = Os<sup>II</sup> or Ru<sup>II</sup>; BL = dpp or dpq; bpy = 2,2<sup>'</sup>-bipyridine, dpp = 2,3-bis(2-pyridyl)pyrazine, dpq = 2,3-bis(2-pyridyl)quinoxaline). The building blocks displayed varied electrochemical properties upon complexation. The bridging ligands dpp and dpq display their reduction potentials shifted to less negative values when they changed from monochelating to bischelating. The electronic absorption spectra of the multimetallic systems displayed transitions of each contributing chromophore, with overlapping metal to ligand charge transfer (MLCT) transitions in visible region of spectrum. Spectroelectrochemistry revealed the nature of MLCTs and helped to identify fingerprint features of complex supramolecules. Photophysical measurements include emission spectroscopy with quantum yield measurements and emission lifetime measurements. Photophysical data provided detailed information to aid in developing an understanding of excited state properties of these complexes. Supported by the electrochemical data and spectroelectrochemistry, the hexametallic complex was suggested to have a HOMO localizing in the peripheral Os and a LUMO localizing in the central dpq, separating by a Ru energy barrier. This research systematically investigated photophysical properties of some building blocks and the mixed-metal, mixed-ligand supramolecules constructed by a variety of building blocks coupling light absorbing subunits to a reactive Pt metal center. Preliminary studies suggested [{(bpy)<sub>2</sub>Ru(dpp)}<sub>2</sub>Ru(dpq)PtCl<sub>2</sub>](PF<sub>6</sub>)<sub>6</sub> was a photocatalyst for H2 production from water in the presence of a sacrificial electron donor. The complex [{(bpy)<sub>2</sub>Ru(dpp)}<sub>2</sub>Ru(dpq)PtCl<sub>2</sub>](PF<sub>6</sub>)<sub>6</sub> had been studied for its catalytic ability in generating hydrogen and was found to have 34 product turnovers after 3 h photolysis. Photolysis and gel electrophoresis revealed that the tetrametallic complexes were able to bind to and then photocleave DNA through an oxygen mediated mechanism. The independence of ionic strength variation when [{(bpy)<sub>2</sub>Ru(dpp)}<sub>2</sub>Ru(dpp)PtCl<sub>2</sub>](PF<sub>6</sub>)<sub>6</sub> interacted with DNA, suggested the covalent interaction nature of the complex. These results suggest future work on understanding the excited state properties of supramolecular complexes is suggested. The designs of future photocatalysts for hydrogen production from water and anticancer photodynamic therapy drugs are also proposed.",
  "description_provenance": [
    "Author Email: rmiao@vt.edu",
    "Advisor Email: gyee@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: hanson@vt.edu",
    "Advisor Email: kbrewer@vt.edu",
    "Advisor Email: pdeck@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:01Z (GMT). No. of bitstreams: 1 final.pdf: 4281530 bytes, checksum: 60a5fbae558d507250101cff9b88364e (MD5)   Previous issue date: 2007-12-04"
  ],
  "handle": "26372",
  "identifier_other": "etd-03062008-222146",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03062008-222146/",
  "identifier_uri": "http://hdl.handle.net/10919/26372",
  "publisher": "Virginia Tech",
  "relation_haspart": "final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "DNA",
    "hydrogen",
    "solar energy conversion",
    "photocatalysis",
    "charge separation",
    "photodynamic therapy",
    "platinum",
    "multimetallic",
    "supramolecular",
    "ruthenium",
    "osmium"
  ],
  "title": "Multimetallic Supramolecular Complexes: Synthesis, Characterization, Photophysical Studies and Applications in Solar Energy Utilization and Photodynamic Therapy.",
  "type": "Dissertation"
}