{
  "contributor_author": "Cabaniss, Katherine",
  "contributor_committeecochair": [
    "Fortune, Jimmie C.",
    "Hutchins, David E."
  ],
  "contributor_committeemember": [
    "Reilly, Virginia J.",
    "Lynch, Sherry K.",
    "Getz, Hilda M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:02Z",
  "date_adate": "2001-03-15",
  "date_available": "2014-03-14T20:08:02Z",
  "date_issued": "2001-02-21",
  "date_rdate": "2002-03-15",
  "date_sdate": "2001-03-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "COUNSELING AND COMPUTER TECHNOLOGY IN THE NEW MILLENNIUM-AN INTERNET DELPHI STUDY by Katherine Cabaniss Committee Co-Chairs:  David Hutchins and Jimmie Fortune (ABSTRACT) \tComputer technology is developing so rapidly that the extent to which it is being utilized by counselors and counselor educators in their work is virtually unknown.  The purpose of this study was to assess how much and in what ways counselor experts believe computer-related technology (CRT) is being utilized by professional counselors today.  An additional purpose of this study was to determine projected use of CRT by the year 2008. \tData were collected by means of a modified futures Delphi method in which a panel of 21 counselor experts comprised of one group of counselor educators, three groups of counselor practitioners, and one group of computer technologists completed three rounds of questions.  The study, which was conducted entirely on the World Wide Web, requested Likert-type ratings of 53 generic work-related tasks in eight task categories for frequency of CRT use to accomplish the tasks and reasons for the selections.  In addition, panelists rated ten specific CRT tools for frequency of use, and supplied written examples of current and future CRT use by counseling professionals. \tThe findings of the study indicate counselors and counselor educators are using a large variety of CRT tools, including word processors, spread sheets, a variety of software programs, e-mail, chatrooms, listservs, databases, and other web-related tools to assist them in over half of job-related tasks today.  Experts forecast CRT use by counselors will significantly increase by the year 2008, when professional counselors are expected to utilize CRT for at least 90% of their work-related tasks. \tIt is suggested that findings of this study may provide an important foundation for much needed research investigating potential differences between therapeutic work accomplished with the help of CRT and traditional therapy, i.e., face-to-face therapy, in which computer technology is not utilized.  Finally, results establish the need to implement and promote computer skills training and competency assessments in counselor education programs.",
  "description_provenance": [
    "Author Email: kcabanis@vt.edu",
    "Advisor Email: jenmik@vt.edu",
    "Advisor Email: sklynch@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: dhutch@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:02Z (GMT). No. of bitstreams: 1 1Cabaniss.pdf: 1795506 bytes, checksum: 63a93264ad96fbd2c96309d6a596e3be (MD5)   Previous issue date: 2001-02-21"
  ],
  "handle": "26377",
  "identifier_other": "etd-03072001-175713",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03072001-175713/",
  "identifier_uri": "http://hdl.handle.net/10919/26377",
  "publisher": "Virginia Tech",
  "relation_haspart": "1Cabaniss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "technology in counseling",
    "counselor educators",
    "professional counselors",
    "counselor computer skills training",
    "webcounseling",
    "webcounselors",
    "mental health professionals",
    "Internet counseling",
    "computer skills",
    "future of computer technology in counseling"
  ],
  "title": "Counseling and Computer Technology in the New Millennium--An Internet Delphi Study",
  "type": "Dissertation"
}