{
  "contributor_author": "Erdal, Zeynep Kisoglu",
  "contributor_committeechair": "Randall, Clifford W.",
  "contributor_committeemember": [
    "Wightman, James P.",
    "Gallagher, Daniel L.",
    "Boardman, Gregory D.",
    "Gregory, Eugene M."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:08:03Z",
  "date_adate": "2002-03-21",
  "date_available": "2014-03-14T20:08:03Z",
  "date_issued": "2002-02-06",
  "date_rdate": "2003-03-21",
  "date_sdate": "2002-03-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Although enhanced biological phosphorus removal (EBPR) and complete biological nutrient removal (BNR) systems can be operated successfully by experienced operators, the accuracy of design and strength of the scientific background need to be reinforced to enable accurate modeling and economically optimal design. One way to accomplish this would be through a better understanding of the biochemical mechanisms and microbial population dynamics that determine the reliability and efficiency of EBPR, and the utilization of this information to improve the design and operation of BNR plants.  Such knowledge will also contribute to better structure of modeling tools that are used for design and educational purposes.  The current body of knowledge is limited to observational studies that lack detailed biochemical explanations backed with a series of well planned experiments, and this has introduced uncertainties and inaccuracies into the biochemical and design models. Therefore, this study mainly covers a biochemical survey of the underlying metabolisms of active populations in BNR sludges.  BNR biomass with biological phosphorus removal (BPR) capability was cultivated in continuous flow reactor (CFR) systems, configured as either University of Cape Town (UCT) and anoxic/oxic (A/O) systems.  Following an acclimation period at 20°C, low temperature stress (5°C) was imposed on one UCT system for investigation of the response of the microbial consortium responsible from EBPR activity under cold temperature.  Once a stable population with EBPR capabilities is established in each system, activities of ten enzymes that are hypothesized to be taking part in the EBPR metabolism were measured. These enzymes were selected among those that take part in major known pathways of bacterial energy and growth metabolism. Also, 13C-NMR was used as a tool to monitor the flux of labeled carbon in and out of pools of cellular storage; i.e. glycogen and polyhydroxyalkanoates (PHA).  Combining the gathered information, accurate mass balances of carbons and reducing equivalents were calculated, eventually leading to determination of the biochemical pathways utilized by the EBPR consortium.  Additionally, anaerobic stabilization of COD, a long debated but empirically established phenomenon, was addressed during the study.  Considering the pathways proposed to be operative under different conditions imposed on the EBPR systems, a biochemical explanation for the occurrence of COD stabilization in wastewater treatment systems that incorporate anaerobic zones was proposed.  Accordingly, depending on the pathways actively used by a microbial consortium, electrons stored in NADH and FADH2 can either be transferred to the terminal electron acceptor, oxygen, or they can be incorporated into storage polymers such as glycogen for future use. Such differences in metabolism reflect in the quantity of the oxygen consumed in the aerobic reactors. Thus, the correct incorporation of anaerobic stabilization of COD into process design would reduce design aeration requirements and result in economic savings during both construction and operation.",
  "description_provenance": [
    "Author Email: zkisoglu@vt.edu",
    "Advisor Email: cliff@vt.edu",
    "Advisor Email: wightman@vt.edu",
    "Advisor Email: dang@vt.edu",
    "Advisor Email: gboard@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:03Z (GMT). No. of bitstreams: 6 FrontMatter.pdf: 36426 bytes, checksum: 34304ca61620886ba7eb96c6f83da784 (MD5) Chapter1zke.pdf: 303411 bytes, checksum: 90507f959eca39e2d05329e9241f5610 (MD5) Chapter4zke.pdf: 233664 bytes, checksum: 485572181541cd0466fe07f646c40f95 (MD5) APPENDIX.PDF: 478177 bytes, checksum: 46b03a10a1041919b08bdf333b4b59e5 (MD5) Chapter2zke.pdf: 114151 bytes, checksum: 783faa2a5b2059b48e824e66be8231d7 (MD5) Chapter3zke.pdf: 397478 bytes, checksum: 501367dd2f247271948d5cd7b6c77985 (MD5)   Previous issue date: 2002-02-06"
  ],
  "handle": "26383",
  "identifier_other": "etd-03082002-152908",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03082002-152908/",
  "identifier_uri": "http://hdl.handle.net/10919/26383",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "FrontMatter.pdf",
    "Chapter1zke.pdf",
    "Chapter4zke.pdf",
    "APPENDIX.PDF",
    "Chapter2zke.pdf",
    "Chapter3zke.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "energy metabolism",
    "enzyme activity",
    "polyhydroxyalkanoates",
    "glycogen",
    "biochemical model",
    "intracellular storage",
    "anaerobic stabilization",
    "activated sludge",
    "competition",
    "biological phosphorus removal"
  ],
  "title": "An Investigation of the Biochemistry of Biological Phosphorus Removal",
  "type": "Dissertation"
}