{
  "contributor_author": "Hickman, Jeffrey Scott",
  "contributor_committeechair": "Geller, E. Scott",
  "contributor_committeemember": [
    "Cooper, Lee D.",
    "Finney, Jack W.",
    "Donovan, John J.",
    "Winett, Richard A."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:08:04Z",
  "date_adate": "2005-03-23",
  "date_available": "2014-03-14T20:08:04Z",
  "date_issued": "2005-02-04",
  "date_rdate": "2005-03-23",
  "date_sdate": "2005-03-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Altering driverâ  s goals and motives for at-risk driving is likely to reduce the frequency of at-risk driving behaviors and their associated crashes and injuries.  However, most driving occurs when people are alone with little supervisions or accountability.  Thus, a self-management for safety (SMS) intervention may be the most appropriate technique to decrease at-risk driving behaviors.  The current research evaluated an SMS process with college students on a simulated driving task.  Participants included 93 university students (41 males, 52 females) randomly assigned to one of three groups (31 participants per group).  Participants in the Control group did not receive any of the intervention materials; they were instructed to drive as they normally drive on each trial.  Participants in the Self-Monitoring + Objective Feedback group received objective feedback from the experimenter about their actual performance on the target driving behavior as well as personal feedback from their self-monitoring forms.  These participants recorded their individual improvement goals on the targeted driving behavior.  Participants in the Self-Monitoring group recorded their individual improvement goals on the targeted driving behavior, but received only personal feedback from their self-monitoring forms.  Similar to past self-management interventions directed at increasing safety-related driving behavior (Hickman & Geller, in press; Krause, 1997; Olson & Austin, 2001), SMS led to clear improvement in subsequent safety performance.  Based on the recorded driving behaviors of 93 participants, SMS was effective in increasing the mean percentage of total driving time traveling below the posted speed limit compared to a Control group that did not receive any of the SMS components.  Across the four trials, participants in the SM and SM + OFB group significantly increased the percentage of total driving time traveling below the posted speed limit by 13.4 (18.3%) and 14.5 (19.8%) percentage points, respectively, compared to participants in the Control group.",
  "description_provenance": [
    "Author Email: jhickman@vtti.vt.edu",
    "Advisor Email: esgeller@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: donovan@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:04Z (GMT). No. of bitstreams: 1 DissFinal_Final_.pdf: 535053 bytes, checksum: b4ab2704925e62a598da74e91d207c02 (MD5)   Previous issue date: 2005-02-04"
  ],
  "handle": "26387",
  "identifier_other": "etd-03082005-140658",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03082005-140658/",
  "identifier_uri": "http://hdl.handle.net/10919/26387",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissFinal_Final_.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "self-monitoring",
    "goal setting",
    "self-management",
    "safety",
    "driving simulator"
  ],
  "title": "Self-Management for Safety: Impact of Self-Monitoring versus Objective Feedback",
  "type": "Dissertation"
}