{
  "contributor_author": "Power, Vanessa",
  "contributor_committeechair": "Johnson, Janet M.",
  "contributor_committeemember": [
    "Kershaw, Terry",
    "Wheelan, Belle S.",
    "DePauw, Karen P."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:04Z",
  "date_adate": "2006-04-28",
  "date_available": "2014-03-14T20:08:04Z",
  "date_issued": "2005-12-14",
  "date_rdate": "2009-04-28",
  "date_sdate": "2006-03-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In 2005, according to the American Association of Community College (AACC) and the National Institute of Leadership Development, women signify 259 community college presidents nationally.  Hockaday and Puyear (2000), Weisman and Vaughan (2002) reported in 2002 that more women held presidencies at community colleges when compared to other types of higher education institutions.  Statistically, the number of women holding the position of president more than doubled, yet, women continue to remain disproportionately under-represented in administrative and policy-making positions, according to Corrigan (2002).  The purpose of this study was to identify the leadership styles, career path, effectiveness, and length of time from completion of terminal degree to presidency that identified the road to become a female community college president.  \t The Gregorc Style Delineatorâ ¢ (Gregorc, 1982) was used to determine the styles of women community college presidents relating to leadership.  The constructs, known as styles were displayed as Concrete Random, Concrete Sequential, Abstract Sequential, and Abstract Random. Descriptive statistics were used to address the preferred leadership styles. Contingency tables described the value obtained from the Gregorc Style Delineatorâ ¢ (Gregorc, 1982), path of promotion, and length of time. The Participant Information Sheet collected information on institutional demographics, significant events that influenced the participant to become a community college president, and their effectiveness. Five research questions guided this study and were interpreted using various research methods. Results from this study reflect that Concrete Random is the preferred leadership style of the participants. Furthermore, this research suggests that women community college presidents are multitaskers, visionaries, and motivators who inspire those working with them to achieve all goals set for the institution. These attributes and skills are displayed in Concrete Random and Concrete Sequential styles. Moreover, it was identified that a successful president should develop the skills and competencies necessary to meet the growing needs of the community, culture, educational, and political climate.   The results of the study may serve as a guide to a community college engaged in a search for a president. In addition, these findings may provide direction for institutions that strive to offer leadership development opportunities for professors and administrators.",
  "description_provenance": [
    "Author Email: vpower@vt.edu",
    "Advisor Email: janetmj@ntelos.net",
    "Advisor Email: tkershaw@vt.edu",
    "Advisor Email: bwheelan@sacscoc.org",
    "Advisor Email: kpdepauw@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:04Z (GMT). No. of bitstreams: 5 PresidentsTimelinesHandIFinal.pdf: 75345 bytes, checksum: e3fa178bc656bf93c3757e2688e2edbb (MD5) BODYFINAL.pdf: 250782 bytes, checksum: 5d11ffe39b69e599bfb31094370db225 (MD5) REFERENCESFINAL.pdf: 27066 bytes, checksum: f0d0ec7a16ad6c91180e0a55fbca4542 (MD5) Appendixesfinal.pdf: 244341 bytes, checksum: b97db6d135b61e12c3a0c327a57e13a1 (MD5) FRONTFINAL.pdf: 23969 bytes, checksum: daeac66f583d820833b5a0abaaf97505 (MD5)   Previous issue date: 2005-12-14"
  ],
  "handle": "26388",
  "identifier_other": "etd-03082006-000658",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03082006-000658/",
  "identifier_uri": "http://hdl.handle.net/10919/26388",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "PresidentsTimelinesHandIFinal.pdf",
    "BODYFINAL.pdf",
    "REFERENCESFINAL.pdf",
    "Appendixesfinal.pdf",
    "FRONTFINAL.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Presidents",
    "Women Community College Presidents",
    "Community College",
    "Leadership",
    "Gregorc Style Delineatorâ ¢"
  ],
  "title": "Women Community College Presidents: The Road to the Presidency",
  "type": "Dissertation"
}