{
  "contributor_author": "Kim, Sukwon",
  "contributor_committeechair": "Lockhart, Thurmon E.",
  "contributor_committeemember": [
    "Kleiner, Brian M.",
    "Roberto, Karen A.",
    "Park, Sung-Ha",
    "Babski-Reeves, Kari L."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:08:04Z",
  "date_adate": "2006-04-04",
  "date_available": "2014-03-14T20:08:04Z",
  "date_issued": "2006-02-06",
  "date_rdate": "2006-04-04",
  "date_sdate": "2006-03-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Overview of the Study Title  Biomechanical Analysis for Effects of Neuromusculoskeletal Training for Older Adults on Outcomes of Slip-induced Falls. Research Objectives  The objective of this study was to evaluate if neuromusculoskeletal training (i.e., weight and balance training) for older adults could reduce the likelihood of slip-induced fall accidents. The study focused on evaluating biomechanics among the elderly at pre- and post-training stages during processes associated with slip-induced fall accidents. Motivations    Older adults are at a higher risk of falls due to deficient gait characteristics and postural control, especially when facing unexpected external perturbations such as slippery surfaces. The literature (Alexander et al., 1992; Englander 1996; Hausdorff, 2001; Rizzo 1998) indicates that falls among the elderly over 65 result in enormous economic and personal losses, therefore, the losses must be diminished. The results from this study can provide intervention strategies for researchers, health care individuals, and the elderly and their families in reducing the likelihood of slip-induced falls.  Background  More than 25% of older adults fall every year (Sattin, 1992), and older adults and their family members fear their falls and fall-related injuries due to the associated high mortality rate (Jensen, 2003). The Center for Disease Control (CDC) reported in 2003 that emergency departments treated more than 1.6 million seniors due to fall-related injuries and, among them, 373,000 were admitted to the hospital. In 2002, The National Safety Council reported that 14,500 people died due to fall-related accidents, and 60 percent of them were 65 years of age and older. To minimize economic and personal losses, tribometric techniques for assessing shoe/floor interactions, the biomechanical responses in walking on slippery floor surfaces, and postural control were studied. Still, the elderly population is at a high risk of falling, severe enough that it is a major cause of hospitalization (CDC, 2003). Yet reasons for slip-induced fall accidents are not clear. Therefore, mechanisms involving fall accidents must be explored and, further, interventions to minimize fall accidents must be discovered and implemented.                           The occurrence of falls among the elderly are postulated to result from neuromusculoskeletal aging. The changes in neuromusculoskeletal components with advancing age are commonly accompanied with mobility problems and poor health status contributing to a decreased physical capability such as a reduction in lower extremity strength (Larsson et al., 1979; Lord et al., 1991 and 1994; Murray et al. 1985; Stalberg et al., 1989; Whipple et al. 1987) and insecure and unconfident balance (Manchester et al. 1989; Stelmach and Sirica, 1987; Teasdale et al. 1991; Thelen et al., 1998; Woolacott, 1986) leading to unstable dynamic postural control and poor gait dynamics (Alexander, 1994; Judge, 2003; Lockhart et al., 2003; Wolfson, 2001).  Unstable dynamic postural control and poor gait dynamics influence the likelihood of falls among older adults (Guralnik et al.1994; Judge et al.1996; Lockhart et al., 2003; Tinetti et al. 1988). Therefore, in an effort to improve unstable dynamic postural control and poor gait dynamics, strength and balance training have been proposed and implemented. (Campbell et al., 1999; Day et al., 2002; Fiatarone et al., 1994; Neil, 1994; Shepard et al., 1993; Tinetti et al, 1994; Wolfson et al, 1993).   Problem Statement Although the significance of muscle strengthening and balance training in reducing falls for older adults has been addressed previously, most studies (Berg et al., 1992; Duncan et al., 1990; Guralnik et al.,1994; Hageman et al., 1995; Nashner, 1993; Nashner and McCollum, 1985; Nevitt et al., 1989; Overstall et al., 1977; Rikli and Jones, 1999; Tinetti, 1986) have focused on the effect of muscle strengthening and balance training on the static and dynamic postural control such as quite standing, one-leg stand, the sit-to-stand test, the test of precise movement, functional reaching, or the mobility test.  Yet, research to evaluate the effectiveness of muscle strengthening and balance training on actual slip-induced fall events was lacking. This study were carried out to evaluate the likelihood of falls at pre- and post stages of training by incorporating and validating the effectiveness of training utilizing actual perturbations commonly associated with slips and falls.   Method \t18 older adults participated in the study for 8 weeks: 6 individuals in balance group, 6 individuals in weight group, and 6 individuals in control group (social group). Each group met three times a week and each session lasted for 1 hour. Biomechanical dependent measures and psychosocial dependent measures were evaluated to the effects of training.  Results \tThe results indicated that, overall, training resulted in improvements in biomechanical dependent measures. Further, regular social activities resulted in improvements in proprioception sensory sensitivity and in ankle dorsiflexion muscular strength.  Conclusion \tBalance training contributed to an improvement in ankle flexibility, whereas, weight training did not contribute to an improvement in ankle flexibility although either weight or balance training played a role in decreasing slip-propensity and the likelihood of slip-induced falls among older adults. An ability to integrate neuro-musculo-skeletal systems was improved by training and was a main contributor in reducing the likelihood of slip-induced falls. Proprioception sensitivity by itself did not play a role in decreasing the likelihood of slip-induced falls. In addition, the exercise training as well as social activities played a role in altering psychosocial behavior (i.e. fear of falling and independency) of older adults. \tThe author concluded that an ability to integrate neuro-musculo-skeletal systems could be improved by either balance or weight training and could be a primary factor contributing to a reduction in the likelihood of slip-induced falls among older adults. In addition, the author concluded that the regular social activities also could contribute to an enhancement in the psychosocial characteristics of older adults.",
  "description_provenance": [
    "Author Email: sukim9@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: lockhart@vt.edu",
    "Advisor Email: kroberto@vt.edu",
    "Advisor Email: shpark@vt.edu",
    "Advisor Email: kbabski@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:04Z (GMT). No. of bitstreams: 2 s05-375.pdf: 57256 bytes, checksum: cb3cd98c130fd16f33f97d88de39e2a0 (MD5) SukwonKimETD.pdf: 2236353 bytes, checksum: aa39ee458ca717008e5bfe0617453cbb (MD5)   Previous issue date: 2006-02-06"
  ],
  "handle": "26389",
  "identifier_other": "etd-03082006-113013",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03082006-113013/",
  "identifier_uri": "http://hdl.handle.net/10919/26389",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "s05-375.pdf",
    "SukwonKimETD.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "slips",
    "baby boomers",
    "training",
    "Falls",
    "balance",
    "weight"
  ],
  "title": "Biomechanical analysis of effects of neuromusculoskeletal training for older adults on the likelihood of slip-induced falls.",
  "type": "Dissertation"
}