{
  "contributor_author": "Doherty, Theresa M.",
  "contributor_committeechair": "Carlton, Patrick W.",
  "contributor_committeemember": [
    "Dawson, Christina M.",
    "Parks, David J.",
    "Richards, Robert R.",
    "van Vanno, Catherine J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:03Z",
  "date_adate": "1999-03-17",
  "date_available": "2014-03-14T20:08:03Z",
  "date_issued": "1999-02-22",
  "date_rdate": "1999-03-17",
  "date_sdate": "1999-03-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to describe the role that mentors played in the development of school principals.  This study focused on the role of mentors as described by retired school principals on the informal mentoring process.  It also identified and discussed differences the retired principals found in mentoring relationships among males and females.        Qualatative methodology was used in this study.  Principals who retired between 1960 and 1997 were interviewed and described the role that mentors played in their professional development and what role, if any, they played in a formal mentoring process.      The mentors of the retired principals contributed significantly to their career development.  During the time that they were serving as principal the nature of the mentor network was primarily informal.  Most of the retired principals made no application for the principalship but were invited to serve in that position.  Most participants believed that women were more likely to climb the career ladder with the help of a mentor.  As their careers were nearing an end, some of the participants were involved in the development of formal mentoring programs.  Whether engaged in formal or informal mentoring processes, all of the participants made contributions.  Those participants who had mentors all chose to mentor others.  Ultimately, the retired principals described mentoring as having made an important contribution to their development as school principals.  They encouraged continued use of mentoring in both formal and informal venues.",
  "description_provenance": [
    "Author Email: Doherty7@aol.com",
    "Advisor Email: pcarlton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:03Z (GMT). No. of bitstreams: 1 etd.pdf: 286846 bytes, checksum: e4f71ce6983eb52a5795e4d9be5eafbb (MD5)   Previous issue date: 1999-02-22"
  ],
  "handle": "26382",
  "identifier_other": "etd-030799-163759",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-030799-163759/",
  "identifier_uri": "http://hdl.handle.net/10919/26382",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Principalship",
    "Mentors",
    "Principal Preparation Programs"
  ],
  "title": "The Role of Mentors in the Development of School Principals",
  "type": "Dissertation"
}