{
  "contributor_author": "Rangaswamy, Sendil",
  "contributor_committeechair": "Agblevor, Foster Aryi",
  "contributor_committeemember": [
    "Haugh, C. Gene",
    "Chen, Jiann-Shin",
    "Helm, Richard Frederick",
    "Winkel, Brenda S. J."
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2014-03-14T20:08:04Z",
  "date_adate": "2003-04-04",
  "date_available": "2014-03-14T20:08:04Z",
  "date_issued": "2003-01-27",
  "date_rdate": "2004-04-04",
  "date_sdate": "2003-03-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Seventeen species of facultative anaerobic bacteria belonging to three genera (Serratia, Cellulomonas, and Corynebacterium) were screened for the production of xylitol; a sugar alcohol used as a sweetener in the pharmaceutical and food industries.  A chromogenic assay of both solid and liquid cultures showed that 10 of the 17 species screened could grow on D-xylose and produce detectable quantities of xylitol during 24-96 h of fermentation.  The ten bacterial species were studied for the effect of environmental factors, such as temperature, concentration of D-xylose, and aeration, on xylitol production.  Under most conditions, Corynebacterium sp. NRRL B 4247 produced the highest amount of xylitol. The xylitol produced by Corynebacterium sp. NRRL B 4247 was confirmed by mass spectrometry.  Corynebacterium sp. NRRL B 4247 was studied for the effect of initial D-xylose concentration, glucose, glyceraldehyde, and gluconate, aeration, and growth medium.  Corynebacterium sp. NRRL B 4247 produced xylitol only in the presence of xylose, and did not produce xylitol when gluconate or glucose was the substrate.  The highest yield of xylitol produced in 24 h (0.57 g/g xylose) was using an initial D-xylose concentration of 75 g/l.  Under aerobic conditions the highest xylitol yield was 0.55 g/g while under anaerobic conditions the highest yield was 0.2 g/g.  Glyceraldehyde in concentrations greater than 1 g/l inhibited Corynebacterium sp. B 4247 growth and xylitol production.  Corynebacterium sp. NRRL B 4247 culture grown in the presence of potassium gluconate (96 g/l) for 48 h and on addition of D-xylose to the media increased accumulation to 10.1 g/l of xylitol after 150 h.  Corynebacterium sp. NRRL B 4247 exhibited both NADH and NADPH-dependent xylose reductase activity in cell-free extracts.  The NADPH-dependent activity was substrate dependent. The activity was 2.2-fold higher when DL-glyceraldehyde was used as substrate than with D-xylose.  In cell-free extracts the difference in xylose reductase and xylitol dehydrogenase activity was highest at 24 h, whereas for cell cultures that were grown in gluconate and xylose, the difference in the reductase and dehydrogenase activities was highest at 12 h after xylose addition. The NAD+ dependent xylitol dehydrogenase activity was low compared to the cells grown without gluconate.  The molecular weight of NADPH-dependent xylose reductase protein obtained by gel filtration chromatography was 58 kDa. Initial purification was performed on a DE-52 anion exchange column.  Purification using Red Sepharose affinity column resulted in a 58 kDa protein on the SDS PAGE gel and was further purified on a Mono-Q column. The activity stained band on the native gel yielded 58, 49, 39 and 30 kDa bands on the denaturing gel.  The peptides of the 58 kDa protein of Corynebacterium sp. B 4247 sequenced by mass spectrometry, identified with E2 and E3  (Bacillus subtilis) components of multi-enzyme system consisting of pyruvate dehydrogenase complex, 2-oxoglutarate dehydrogenase complex and oxo-acid dehydrogenase complex. A 75% match was shown by the peptide â  QMSSLVTRâ   with E-value of 8e-04 to the Saccharomyces cerevisiae protein that was capable of reducing xylose to xylitol. The peptide â  LLNDPQLILMEAâ   had conserved match â  LL + DPâ   over several aldose reductases.  The xylose reductase of the yeast Candida tropicalis ATCC 96745 was also purified. The molecular weight of the yeast NADPH-dependent xylose reductase was about 37 kDa on an SDS PAGE",
  "description_provenance": [
    "Author Email: srangasw@vt.edu",
    "Advisor Email: haugh@vt.edu",
    "Advisor Email: fagblevo@vt.edu",
    "Advisor Email: chenjs@vt.edu",
    "Advisor Email: helmrf@vt,edu",
    "Advisor Email: winkel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:04Z (GMT). No. of bitstreams: 1 SenETD.pdf: 3504040 bytes, checksum: 6c646e0432c61928629fe838928ea1db (MD5)   Previous issue date: 2003-01-27"
  ],
  "handle": "26385",
  "identifier_other": "etd-03082003-172558",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03082003-172558/",
  "identifier_uri": "http://hdl.handle.net/10919/26385",
  "publisher": "Virginia Tech",
  "relation_haspart": "SenETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Corynebacterium sp.",
    "xylitol",
    "D-xylose",
    "Candida tropicalis",
    "xylose reductase"
  ],
  "title": "Xylitol Production From D-Xylose by Facultative Anaerobic Bacteria",
  "type": "Dissertation"
}