{
  "contributor_author": "Erdal, Ufuk Goksin",
  "contributor_committeechair": "Randall, Clifford W.",
  "contributor_committeemember": [
    "Wightman, James P.",
    "Gregory, Eugene M.",
    "Gallagher, Daniel L.",
    "Boardman, Gregory D."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:08:03Z",
  "date_adate": "2002-03-21",
  "date_available": "2014-03-14T20:08:03Z",
  "date_issued": "2002-02-01",
  "date_rdate": "2003-03-21",
  "date_sdate": "2002-03-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "It is generally accepted that a decrease in temperature causes the rates of chemical and biochemical reactions to slow down, usually resulting in poorer performance of biological wastewater treatment systems. Despite this, early researchers repeatedly showed that excess biological phosphorus removal (EBPR) was more efficient at colder temperatures.  Recent studies, however, have demonstrated that the reaction rates of EBPR processes decrease with temperature in accordance with Arrheniusâ   Law, resulting in an apparent contradiction in the literature. The objective of this study was to investigate the EBPR temperature controversy.  The experimental systems used were two, lab-scale UCT configuration plants fed with acetate as the sole volatile fatty acid (VFA) source. The results showed that EBPR systems do perform more efficiently at colder temperatures, i.e., at 5oC compared to 20oC. The reason for better system performance was determined to be related to reduced competition for substrate in the non-oxic zones that results in an increased population of phosphate accumulating organisms (PAOs) relative to non-PAOs and, therefore, greater EBPR efficiency even though the reaction rates are slower. The proliferation of PAOs relative to non-PAOs at cold temperature indicates that some of the PAOs are psychrophilic, i.e., they have alternate biochemical pathways that give them a competitive advantage over bacteria dependent upon glycogen metabolism.  The activated sludge acclimated to 20oC had relatively high polyhydroxyvalerate (PHV) and glycogen contents relative to sludge acclimated to 5oC. It was initially hypothized that there is a significant competition between PAO and glycogen accumulating organisms (GAOs) at 20oC and cold temperature (5oC) nearly eliminates this competition in favor of the PAOs.  A series of batch test experiments revealed that despite similar acetate utilization by the sludges grown at the two temperatures nearly 30% less PHA was produced by the sludge taken from the 20oC reactor, indicating that GAOs were a small fraction of the population at 20oC. Transmission electron microscopy pictures showed that the biomass acclimated to 20oC had a much more diverse bacterial population than the biomass acclimated to 5oC. However, no GAO population was detected in electron microscopy samples under any temperature conditions. The decreased P removal efficiency at 20oC was then attributed to the presence of fermentative or other non poly-P bacteria that are capable of utilizing substrate under anaerobic conditions.   PHA production greatly increased at 5oC, whereas glycogen metabolism substantially reduced. Even though glycogen is an essential requirement for EBPR mechanism, the EBPR microorganisms have the ability to adapt their metabolic pathways to environmental conditions and greatly reduce their need for glycogen. It is apperant that cold temperature inhibits some of the key enzymes in glycogen metabolism resulting in lower glycogen accumulation that in turn increases the EBPR performance. Therefore temperature not only exerts selective pressure on the dominant population but also alters the metabolic pathways of the EBPR process. Increased glycogen accumulation, as observed in this study at 20oC, may not be related to GAO proliferation as suggested by Filipe et al. (2001) instead it may be related to EBPR bacteria to efficiently use glycogen metabolism. Current models (Brdjanovic et al. 1997; Filipe et al. 2002) consider that GAO metabolism is an integral part of EBPR metabolism and the performance of EBPR processes depends on PAO/GAO fraction in the EBPR system. No GAO proliferation was observed even the A/O process was operated without P addition for more than 3 weeks at 10oC. Therefore such important concept should be further investigated before it is included in EBPR models.     EBPR stoichiometry was presumed to be insensitive to temperatures (Brdjanovic et al. 1997). However, observed stoichiometric values of PHA storage per unit glycogen utilization and PHA utilization per unit glycogen rephlenishment were quite different at different temperatures. Temperature, therefore, not only affects the kinetics of EBPR systems but also affects the EBPR stoichiometry.   Most prokaryotic cells have the ability to alter their cellular membrane fatty acid composition as temperature decreases to counteract the adverse effects of temperature on membrane fluidity (Becker et al., 1996). This unique ability is known as â  homeoviscous adaptationâ  . In this study, homeoviscous adaptation by EBPR activated sludge was investigated for a series of temperatures ranging from 20oC to 5oC using one of the lab scale EBPR systems. The fatty acid analysis results showed that the unsaturated to saturated fatty acid ratio increased from 1.40 to 3.61 as temperature dropped from 20 to 5oC. The increased cis-9-hexadecanoic acid (C16:1) at 5oC strongly indicated the presence of homeoviscous adaptation in the EBPR bacterial community. Thus the cell membranes of the EBPR community were still in a fluid state, and solute transport and proton motive force mechanisms were operable even at 5oC. It was concluded that loss of EBPR performance at low temperatures, as reported by McClintock et al. (1992) was not related to the physical state of the cellular membranes, but was probably caused by unsuitable operational conditions.   Even though the transport of volatile fatty acids (e.g. acetate) is an integral part of EBPR biochemistry and stoichiometry, this important concept has been ignored. Fleet (1997) concluded that acetate entry into bacterial cells in EBPR sludge was simple passive diffusion based upon the results of a single study (Baronofsky et al. 1984). However, this study showed that neither acetate nor propionate can cross the cell membrane via simple passive diffusion. The existence of apparent saturation curves when the substrate uptake rates (acetate and propionate) were plotted against the substrate concentrations suggested that transport of volatile fatty acids obey facilitated or active transport.   Following from the above results, an investigation of the impacts of operational conditions such as low solids retention time (SRT), presence of electron acceptors in the non-oxic zones, low anaerobic detention time, and lack of acclimation was performed.  The results showed that the â  critical, i.e., wash-outâ   SRT increased as temperature decreased, but if the biomass was permitted to acclimate to the lower temperature, a major population shift would occur which would increase the capacity of the system for phosphorus (P) removal.  When the 5 oC sludge was allowed to acclimate at a relatively high SRT (18 d), the systemâ  s P-removal capacity greatly surpassed that of the 20 oC system.  The decrease in EBPR performance because of the presence of nitrates in the non-oxic zones was determined to be greater than what would be predicted based on accepted stoichiometry.",
  "description_provenance": [
    "Author Email: uerdal@vt.edu",
    "Advisor Email: wightman@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Advisor Email: cliff@vt.edu",
    "Advisor Email: dang@vt.edu",
    "Advisor Email: gboard@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:03Z (GMT). No. of bitstreams: 7 Chapter2ue.PDF: 195258 bytes, checksum: 845db5a3eb5f8e4fc5279d247b14b760 (MD5) AppendixC4.PDF: 109167 bytes, checksum: d1d6e610e7f27dd48db2d819cbd07165 (MD5) Chapter4ue.PDF: 162444 bytes, checksum: acb9d698196a3c63427b7a3a1d70c333 (MD5) FrontMatterue.PDF: 34215 bytes, checksum: 30b2028cca8f9dd4bde6f7e954d5ec4b (MD5) Chapter3ue.PDF: 3001764 bytes, checksum: 9538eeba4e1d389bf7aac26379176dd4 (MD5) Chapter1ue.PDF: 313872 bytes, checksum: c3c54315174f3e1aad6c5f66ec6515ce (MD5) AppendixC3.PDF: 59337 bytes, checksum: 785067f6c5a4056a8af1883c593fb7fb (MD5)   Previous issue date: 2002-02-01"
  ],
  "handle": "26384",
  "identifier_other": "etd-03082002-154444",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03082002-154444/",
  "identifier_uri": "http://hdl.handle.net/10919/26384",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter2ue.PDF",
    "AppendixC4.PDF",
    "Chapter4ue.PDF",
    "FrontMatterue.PDF",
    "Chapter3ue.PDF",
    "Chapter1ue.PDF",
    "AppendixC3.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "homeoviscous adaptation",
    "competition",
    "activated sludge",
    "biological phosphorus removal",
    "energy metabolism",
    "aerobic recycle",
    "PAOs",
    "cold stress",
    "polyhydroxyalkanoates",
    "GAOs",
    "temperature",
    "glycogen"
  ],
  "title": "The Effects of Temperatures on System Performance and Bacterial Community Structure in a Biological Phosphorus Removal System",
  "type": "Dissertation"
}