{
  "contributor_author": "Early, Jeffrey Bryan",
  "contributor_committeecochair": [
    "Earthman, Glen I.",
    "Driscoll, Lisa G."
  ],
  "contributor_committeemember": [
    "Salmon, Richard G.",
    "Martin, Rosalie Marie"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:04Z",
  "date_adate": "2007-03-19",
  "date_available": "2014-03-14T20:08:04Z",
  "date_issued": "2007-03-02",
  "date_rdate": "2008-03-19",
  "date_sdate": "2007-03-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Institute for Advanced Learning and Research (IALR) is located in the south central region of Virginia commonly known as \"Southside\". The IALR was established in 2002 by the Code of Virginia for the primary purpose of revitalizing this economically distressed area of Virginia. The education of the citizenry of this area is central to this purpose.  One method of providing for this purpose is partnering with the school divisions within the service region of the IALR to provide increased access to educational opportunities.  The service region of the IALR includes eight school divisions.  The purpose of this study was to determine the perceived needs of K-12 educators in the service region of the IALR in Southside Virginia.  Teachers, principals, superintendents, and directors of instruction from each school division in the study area received a hyperlink to a separate survey instrument in which items were selected for inclusion that likely match the participant's knowledge based upon his or her job title. Specifically, they provided their perceptions on teaching staff development needs, administrative staff development needs, curricular needs, and the other needs they may have.  Descriptive statistics were used to report the data designed to identify the needs of the eight school divisions in this geographic area. The census survey method was used to collect data from the eight school divisions served by the IALR returned data from 100% of the superintendents and directors of instruction, 70.4% of principals, and 6.4% of teachers within these school divisions.  The low response rate for teachers made the value of their perceptions problematic.  The findings of the study indicate an overall perceived need for staff development in the areas of special education, science, math, reading, At-Risk programs, and technology.  Further, all respondents indicated a desire for greater access to graduate programs, and a majority of participants expressed a desire to have greater communication with the research center in their area.",
  "description_provenance": [
    "Author Email: jbearly@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: rowhite@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:04Z (GMT). No. of bitstreams: 1 early31407.pdf: 514307 bytes, checksum: dc80168305c7ae61a544d33eb62822b1 (MD5)   Previous issue date: 2007-03-02"
  ],
  "handle": "26390",
  "identifier_other": "etd-03082007-072019",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03082007-072019/",
  "identifier_uri": "http://hdl.handle.net/10919/26390",
  "publisher": "Virginia Tech",
  "relation_haspart": "early31407.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Technology Transfer",
    "Public Schools",
    "Research Centers"
  ],
  "title": "Research Centers as Modes of Technology Transfer between the University and Industry and the Implications for Public K-12 Schools",
  "type": "Dissertation"
}