{
  "contributor_author": "Steffey, Carrie Swanay",
  "contributor_committeechair": "Cennamo, Kathy",
  "contributor_committeemember": [
    "Lockee, Barbara B.",
    "Brown, Daniel",
    "Sherman, Gregory P.",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:05Z",
  "date_adate": "2001-03-12",
  "date_available": "2014-03-14T20:08:05Z",
  "date_issued": "2001-02-09",
  "date_rdate": "2002-03-12",
  "date_sdate": "2001-03-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Effects of Visual and Verbal Cues in Multimedia Instruction Carrie Swanay Steffey  (ABSTRACT)  Various forms of presenting content via computer differ in the number and quality of visual and verbal cues. Many of these cues such as eye contact, tone of voice, appearance, facial expressions, proximity, and gestures have been found to be beneficial to the learning process.  This study seeks to uncover what effects multimedia instruction, which contain a high degree of visual and verbal cues, compared to multimedia instruction, which contains a low degree of visual and verbal cues, may have on college students perception of social presence, satisfaction with their instruction, motivation, and achievement. The relationships among these dependent variables were also investigated.   One hundred and fifty students were randomly assigned to five treatment groups. The treatment groups received three computer based multimedia lessons that included either full visual and verbal cues (video), limited visual and full verbal cues (still picture with audio), limited visual cues and no verbal cues (still picture and text), no visual cues and full verbal cues (audio only), or no visual or verbal cues (text only).   Results show no significant differences among treatment groups regarding social presence, motivation, satisfaction, and achievement. Significant correlations were found between social presence and satisfaction; social presence and motivation; satisfaction and motivation; and motivation and achievement. Correlations for social presence and achievement, and satisfaction and achievement were not significant.  This study suggests that visual and verbal cues in multimedia may not be important for student learning. Further research using different lesson content and a revised social presence scale is encouraged.",
  "description_provenance": [
    "Author Email: cssteffey@milligan.edu",
    "Advisor Email: barbara.lockee@vt.edu",
    "Advisor Email: brownd@etsu.edu",
    "Advisor Email: cennamo@vt.edu",
    "Advisor Email: shermang@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:05Z (GMT). No. of bitstreams: 1 DissertationITCBSREV3.pdf: 293931 bytes, checksum: 68f22b5605be0a3174e8662ae26eadc9 (MD5)   Previous issue date: 2001-02-09"
  ],
  "handle": "26394",
  "identifier_other": "etd-03092001-134749",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03092001-134749/",
  "identifier_uri": "http://hdl.handle.net/10919/26394",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationITCBSREV3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "multimedia",
    "motivation",
    "achievement",
    "satisfaction",
    "social presence"
  ],
  "title": "The Effects of Visual and Verbal Cues in Multimedia Instruction",
  "type": "Dissertation"
}