{
  "contributor_author": "Deshmukh, Atul Ramesh",
  "contributor_committeechair": "Casali, John G.",
  "contributor_committeemember": [
    "Krimgold, Frederick",
    "Kleiner, Brian M.",
    "Lockhart, Thurmon E.",
    "Lancaster, Jeff A."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:08:04Z",
  "date_adate": "2007-03-13",
  "date_available": "2014-03-14T20:08:04Z",
  "date_issued": "2006-11-13",
  "date_rdate": "2010-03-13",
  "date_sdate": "2007-03-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "To analyze the system development, manufacturing practices and system evaluation procedures of representative PPES manufacturers, two companies (i.e., one â  smallâ  , referred to here as â  simple manufacturer (SM)â  , and one â  largeâ  , referred here as â  complex manufacturer (CM)â   â   in terms of workforce, market presence, and capital) that develop first responder PPES, which voluntarily agreed to participate in the research were chosen.  The complex PPES is an Air-Pak, a self contained breathing apparatus (SCBA) used by first responders for artificial breathing in life-threatening scenarios and the simple PPES is the Fire-Eye device, a thermal sensor that attaches to the visor of the firefighter in order to convey the visual warning of the ambient thermal environment.  In order to differentiate the two distinct methodological approaches, the dissertation has been split into two different parts.  The first methodology is a â  case studyâ   type of empirical investigation which follows a triangulation approach utilizing surveys, structured interviews, process and system observations, and examination of archival records.  The second type of methodology is an experimental empirical research one, which involves laboratory-scale and full-scale real-life fire scenarios to conduct product evaluation.  The research goals of the case study research were to identify the problems faced by the manufacturers of PPES and to formulate guidelines with regards to manufacturing, compliance, design and development processes, etc., for the PPES manufacturers.  The investigation sought answer to the following key questions: a) How do PPES manufacturers currently approach the systems design and development process and what best practices in manufacturing and quality control have they adopted? b) What human factors and ergonomic measures are adopted by these companies while designing their products and what human testing is conducted by companies? c)What safety measures are considered by the safety designer while designing the product? The recommendations also include modifications to the product design process taking into account the market trends in the product design processes, involvement of ergonomics and safety aspects. The research goals for the experimental part of this dissertation were to identify appropriate evaluation methods and conduct the PPES evaluation in simulated fire environments.  The Fire-Eye device primarily functions in hot environments and warns the firefighters of the ambient temperature.  Therefore, the laboratory-scale evaluation was conducted using test methods such as the Static Oven, Fire Equipment Evaluator, and Radiant Panel, methods which represent controlled environment test conditions.  The Fire-Eye device was also evaluated in realistic fire environment created in an ISO burn room by conducting several tests using different types of fuels such as Heptane, Natural Gas, and Living-room set-up (i.e., furniture as fuel).  The Fire-Eye device was tested for repeatability and reproducibility of its performance in both of the experimental settings.  Statistical data analysis was conducted to determine any differences in performance of the Fire-Eye device among each laboratory-scale methods as well as to compare the performance of the device between laboratory-scale and full-scale fire environments in identical heat locations.  The results suggest that a dual approach (laboratory-scale and full-scale fire environment) for evaluating the performance of PPES is more effective than is testing the device in either one of the methods.",
  "description_provenance": [
    "Author Email: atdeshmu@vt.edu",
    "Advisor Email: krimgold@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: lockhart@vt.edu",
    "Advisor Email: jlancast@vt.edu",
    "Advisor Email: jcasali@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:04Z (GMT). No. of bitstreams: 2 DissertationPart2.pdf: 3644926 bytes, checksum: 3de4dfb2de29468264e6dafb54681993 (MD5) DissertationPart1.pdf: 1236117 bytes, checksum: 7ebe858b1565b58e5b34308d06e1c119 (MD5)   Previous issue date: 2006-11-13"
  ],
  "handle": "26391",
  "identifier_other": "etd-03082007-100626",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03082007-100626/",
  "identifier_uri": "http://hdl.handle.net/10919/26391",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "DissertationPart2.pdf",
    "DissertationPart1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "System Safety Principles",
    "Personal Protective Equipment",
    "Full-scale ISO room fire test",
    "Fire Research",
    "NIOSH Guidelines"
  ],
  "title": "Product Evaluation and Process Improvement Guidelines for the Personal Protective Equipment Manufacturers based on Human Factors, NIOSH Guidelines and System Safety Principles",
  "type": "Dissertation"
}