{
  "contributor_author": "Minnix, Douglas  Wayne",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Sherman, Thomas M.",
    "Redican, Kerry J.",
    "Lepczyk, Billie F."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:08:04Z",
  "date_adate": "2010-04-22",
  "date_available": "2014-03-14T20:08:04Z",
  "date_issued": "2010-02-26",
  "date_rdate": "2010-04-22",
  "date_sdate": "2010-03-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Mental Toughness in the Classical Martial Arts  Douglas Wayne Minnix  ABSTRACT   The construct of mental toughness is in a state of evolution and refinement.  The current study proposed to investigate;  (1) the importance of mental toughness attributes from a Classical Martial Arts context, (2) the trainability of the mental toughness attributes from a Classical Martial Arts context, (3) and the extent to which classical martial artists perceive that attributes converge under broader, overarching sub-categories.     \tThe current study used a two-phase approach to evaluate the perceptions of mental toughness in 174 non-competition based classical martial artists.  Phase One used a survey (a) to assess the perceived importance and trainability of mental toughness, (b) to evaluate unique CMA (CMA) mental toughness components, and (c) to determine underlying factors via factor analysis.  Phase Two used interviews to enhance study perspectives of 20 randomly selected CMA participants.  \tPhase One survey results support (a) the inclusion of all items as important to the mental toughness construct, (b) the trainability of all but 4 items, and (c) anticipation, learning attitude, and ethics as three unique CMA mental toughness components.  The factor analysis supports the use of a six-factor model, which accounts for 60% of the variance, to explain CMA toughness.  Phase Two promotes the use of several key themes as important to mental toughness in the CMA¬- conviction, commitment, conditioning, readiness to perform, distraction control, and shifting focus of attention.  Phase Two also provides insight into the context specific application of the six-factor model.   \tPrevious perspectives on attribute importance, trainability, and general dimensions of mental toughness are supported by the current study. Variations exist between dimensions in the current study and those found previously.  However, these differences are noted to exist more in context applications than in the essential meanings.",
  "description_provenance": [
    "Author Email: dminnix@vt.edu, dminnix@bluefield.edu",
    "Made available in DSpace on 2014-03-14T20:08:04Z (GMT). No. of bitstreams: 1 Minnix_DW_D_2010.pdf: 2576218 bytes, checksum: 461cc1c4faa7f220f46ba97a163f4e53 (MD5)   Previous issue date: 2010-02-26"
  ],
  "handle": "26392",
  "identifier_other": "etd-03082010-000849",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03082010-000849/",
  "identifier_uri": "http://hdl.handle.net/10919/26392",
  "publisher": "Virginia Tech",
  "relation_haspart": "Minnix_DW_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Conviction",
    "Classical Martial Arts",
    "Mental Toughness",
    "Commitment"
  ],
  "title": "Mental Toughness in the Classical Martial Arts",
  "type": "Dissertation"
}