{
  "contributor_author": "Alexander, Quentin Renard",
  "contributor_committeechair": "Bodenhorn, Nancy E.",
  "contributor_committeemember": [
    "Hirt, Joan B.",
    "Burge, Penny L.",
    "Day-Vines, Norma L."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:08:05Z",
  "date_adate": "2011-05-06",
  "date_available": "2014-03-14T20:08:05Z",
  "date_issued": "2001-02-22",
  "date_rdate": "2011-09-05",
  "date_sdate": "2011-03-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine the adjustment experiences of African American graduates of historically Black colleges or universities (HBCUs) attending graduate school at a Southern predominantly White university (PWU). A discussion of narratives and themes across participants provided information about the adjustment experiences of African American graduate students who transitioned from a university community where the student population was predominantly African American to one where African American students were the minority. This information can be utilized by both PWUs and HBCUs to develop resources that address issues related to adjustment for African American graduate students. <p> \tThis study was phenomenological by design and focused on analyzing the adjustment experiences of 11 female African American graduate students attending a Southern PWU. Participants were between the ages of 22-28, graduated from 10 different HBCUs across 8 states, represented 8 different graduate majors and had been in graduate school an average of 3.5 semesters. Research methodology included participant interviews, demographic questionnaires and investigator field notes.  Collected data were analyzed using a coding iteration strategy. <p> \tDescriptions of participant experiences were documented and ten prominent themes emerged from the data: support systems, negative emotionality, distrust, academic frustration, lack of African American presence, non-cohesive African American community, racial microaggressions, prior acquaintances and resilience.",
  "description_provenance": [
    "Author Email: qrt6205@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: ndayvine@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:05Z (GMT). No. of bitstreams: 1 _Alexander_QA_D_2011_2.pdf: 423854 bytes, checksum: cca85b6d6979bbdf7a500addf4aa1826 (MD5)   Previous issue date: 2001-02-22"
  ],
  "handle": "26393",
  "identifier_other": "etd-03082011-110835",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03082011-110835/",
  "identifier_uri": "http://hdl.handle.net/10919/26393",
  "publisher": "Virginia Tech",
  "relation_haspart": "_Alexander_QA_D_2011_2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "PWU",
    "HBCU",
    "social adjustment",
    "African American",
    "personal-emotional adjustment"
  ],
  "title": "Adjustment Experiences of African American Graduates of Historically Black Colleges or Universities Attending Graduate School at a Southern Predominantly White University",
  "type": "Dissertation"
}