{
  "contributor_author": "Arnado, Mary Janet Madrono",
  "contributor_committeechair": "Dunaway, Wilma A.",
  "contributor_committeemember": [
    "Ballweg, John A.",
    "Fuller, Theodore D.",
    "Bailey, Carol A.",
    "Rothschild, Joyce",
    "Wimberley, Dale W."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:08:05Z",
  "date_adate": "2002-03-14",
  "date_available": "2014-03-14T20:08:05Z",
  "date_issued": "2002-02-28",
  "date_rdate": "2003-03-14",
  "date_sdate": "2002-03-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is geared toward a deeper understanding of the complexity of the multiple positions of women in the â  Third World,â   and on how these positions create, sustain, and reproduce inequalities. I examine class inequality among employed women in the Philippines in the context of mistress-maid employment relationship. Using feminist fieldwork approaches, my gatekeeper, Merly, and I conducted extensive interviews and focus groups with thirty-one maids and ten mistresses between May and August 2000 in a medium-sized city in the Philippines. Recorded interviews were transcribed and processed using QSR NUD*IST N4.  Domestic workers, who started as child laborers, live in their mistressesâ   homes where they perform household chores and carework. Aside from their â  job description,â   they carry out additional tasks within and outside the household. The maidsâ   relationship with their mistresses is based on maternalism, in which the mistresses integrate them into the family, engage in gift giving, provide educational support, but at the same time, control their bodies, times, spaces, and relationships. Except in cases where maternalist behavior becomes violent, both maids and mistresses approve of maternalism. In looking at the factors that may contribute to the mistressesâ   maternalist behavior, this study found that mistresses who are subordinate relative to their spouses and their workplaces are more likely than those who are not subordinate to engage in maternalist behavior with their maids. As maids prefer maternalist relationship with their mistresses, they accommodate their mistressesâ   dominating tendencies. When reprimanded, they respond through culture-specific rituals of subordination. However, when their threshold of tolerance is breached, they apply a combination of subtle and blatant resisting strategies. Younger maids perceive domestic work as a stepping-stone toward a more comfortable future, while older maids view it as a dead-end occupation. From a global standpoint, class mobility is examined based on the domestic workers dialectic positions within the international division of reproductive labor. Throughout this dissertation, womenâ  s inequality in the context of mistress-maid relations were analyzed from various angles, shifting the analysis from micro to macro dynamics; from class to the intersection of gender, ethnicity, age, and class; and from local to global. In addition to providing a sociological understanding of this phenomenon, I put the varied voices of â  Third World womenâ   at the forefront of this study.",
  "description_provenance": [
    "Author Email: marnado@vt.edu",
    "Advisor Email: jballweg@vt.edu",
    "Advisor Email: ted.fuller@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: joycer@vt.edu",
    "Advisor Email: dale.wimberley@vt.edu",
    "Advisor Email: wdunaway@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:05Z (GMT). No. of bitstreams: 1 arnadofinaldissertation1.pdf: 1465375 bytes, checksum: 3c661be1aa2eab47afe5d79bb5aefd36 (MD5)   Previous issue date: 2002-02-28"
  ],
  "handle": "26397",
  "identifier_other": "etd-03092002-233742",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03092002-233742/",
  "identifier_uri": "http://hdl.handle.net/10919/26397",
  "publisher": "Virginia Tech",
  "relation_haspart": "arnadofinaldissertation1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Philippines",
    "maternalism",
    "gender inequality",
    "domestic workers",
    "class inequality"
  ],
  "title": "Class Inequality among Third World Women Wage Earners: Mistresses and Maids in the Philippines",
  "type": "Dissertation"
}