{
  "contributor_author": "Dowling, Maureen F.",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Parson, Stephen R.",
    "Fenchak, Richard J.",
    "Dawson, Christina M.",
    "Carlton, Patrick W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:07Z",
  "date_adate": "2000-03-29",
  "date_available": "2014-03-14T20:08:07Z",
  "date_issued": "2000-02-08",
  "date_rdate": "2001-03-29",
  "date_sdate": "2000-03-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "In recent years a body of literature on the topic of school culture has emerged, highlighting the importance of developing strong school cultures.  My purpose was to explore the creation of culture in a new school by studying the school's core principles, leadership, history, practices, decision making, language, membership, environment, and critical events.   <p>The setting for this descriptive case study was Chapman Friends School - an alternative Quaker high school located in a mid-Atlantic state.  Data-gathering techniques included:  (a) weekly on-site observations, (b) formal interviews, (c) school publications and documents, and (d) the researcher's log.  The data were analyzed with a thematic coding system based on the cultural components.  <p>Three factors were found to be critical in the creation of culture at Chapman Friends School:  (a) core principles and the symbolic interactions whereby they were transmitted; (b) the charismatic, authentic leadership of the headmaster; and (c) the consensus-based standards for student membership.  The creation of culture at Chapman Friends School was a process wherein school members sought to resolve problems and issues resulting from their conflicting expectations of what the school should be.  The creation of culture at Chapman Friends School involved the development of a shared image of what the school should become.  Finally, as indicated by previous researchers and supported in this study, a culture evolves over time.      <p>The findings expand the field of literature on the subject of school culture and provide insight for school leaders and educators seeking to create effective school cultures.  Related topics for further study include:  (a) student enrollment screening procedures which shape a school culture, (b) the effect of secular school leaders on the creation of culture in religious-based schools, (c) the effect of the absence of a Quaker majority in Quaker schools, and (d) alternative environmental options for school settings and their effect on school culture.",
  "description_provenance": [
    "Author Email: maureen.dowling@ed.gov",
    "Advisor Email: parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:07Z (GMT). No. of bitstreams: 3 Part2.PDF: 484125 bytes, checksum: c4d6d026eb92bbafb7392e77dfc9dc0b (MD5) Part1.PDF: 22116 bytes, checksum: 93b86264f6b83a27b93b7bb5885101c3 (MD5) Part3.PDF: 231231 bytes, checksum: a9223016e6f6ae6b6d622c35e21173b4 (MD5)   Previous issue date: 2000-02-08"
  ],
  "handle": "26407",
  "identifier_other": "etd-03102000-14380041",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03102000-14380041/",
  "identifier_uri": "http://hdl.handle.net/10919/26407",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Part2.PDF",
    "Part1.PDF",
    "Part3.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Friends School",
    "Culture",
    "Alternative Schools",
    "Quaker"
  ],
  "subject_lcc": "LD5655.V856 2000.D695",
  "title": "Chapman Friends School: A Study of the Creation of Culture",
  "type": "Dissertation"
}