{
  "contributor_author": "Wang, Yuwen Jr.",
  "contributor_committeechair": "McNair, Harold M.",
  "contributor_committeemember": [
    "Anderson, Mark R.",
    "Long, Gary L.",
    "Glanville, James O.",
    "Dillard, John G."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:08:07Z",
  "date_adate": "1998-02-04",
  "date_available": "2014-03-14T20:08:07Z",
  "date_issued": "1997-12-11",
  "date_rdate": "1999-02-04",
  "date_sdate": "1997-12-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Solid Phase Microextraction (SPME) associated with Microwave Assisted  Extraction (MAE)<sup>(1-3)</sup> , on-line headspace derivatization <sup>(4-6)</sup> and the selectivity of  different SPME coatings <sup>(7)</sup> were studied. Trace amounts of Veltol &reg;, Veltol Plus&reg; and short chain fatty acids in food samples were analyzed by GC/MS.  <p>        Since SPME is not directly applicable to solid samples, SPME associated  with MAE techniques was studied for solids, primarily food samples. The  efficiency of classical solvent extraction and MAE was compared. The  parameters which affect SPME, were optimized for the determination of Veltol&reg;  and Veltol Plus &reg; in food products such as potato chips and coffee. The technique  gave a detection limit of 2 ppb for Veltol Plus &reg; which is 200 times more sensitive  than conventional GC technique.  <p>        Headspace injection is characterized by simple and easy handling of  complicated solid and solution matrices. Headspace injection, however, is not  suitable for high molecular weight substances or non-volatile compounds. An on-line  derivatization headspace technique was studied for short chain fatty acids.  These samples are difficult to do by classical GC. The developed technique  simplified the conventional derivatization procedures and combined the sample  preparation and GC/MS analysis into one step. The thermostatting temperature,  time, solvent and matrix effects were investigated. Low calorie fat and some  agricultural samples were analyzed. The detection limit for acetic acid is 8 ppb.  <p>        SPME is a novel sample introduction technique. The behavior of  di(methylsiloxane), polyacrylate and Carbowax coatings on SPME fibers for  compounds having different functional groups were investigated. The selectivities  of the coating, sample pH and the sample temperature were investigated.",
  "description_provenance": [
    "Author Email: ywang@vt.edu",
    "Advisor Email: hmcnair@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:07Z (GMT). No. of bitstreams: 1 ETDWANG.PDF: 426967 bytes, checksum: ccf05a77e19adf9f14a01401a1404f6e (MD5)   Previous issue date: 1997-12-11"
  ],
  "handle": "26404",
  "identifier_other": "etd-03098-145259",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03098-145259/",
  "identifier_uri": "http://hdl.handle.net/10919/26404",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETDWANG.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "GC/MS",
    "trace analysis",
    "sample preparation/concentration",
    "SPME",
    "MAE"
  ],
  "title": "Sample Preparation/Concentration for Trace Analysis in GC/MS (A study of solid phase microextraction and headspace sampling)",
  "type": "Dissertation"
}