{
  "contributor_author": "Bedden, Dana T.",
  "contributor_committeecochair": [
    "Salmon, Richard G.",
    "Alexander, M. David"
  ],
  "contributor_committeemember": [
    "Janosik, Steven M.",
    "Ruffin, Santee"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:07Z",
  "date_adate": "2006-03-21",
  "date_available": "2014-03-14T20:08:07Z",
  "date_issued": "2006-03-02",
  "date_rdate": "2007-03-21",
  "date_sdate": "2006-03-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "School officials are constantly challenged to perform a myriad of duties in an extremely complex and demanding job with numerous responsibilities. They are expected to work with a variety of students, faculty and parents under difficult circumstances. â  Faced with multiple needs, with the necessity of making fast decisions in an atmosphere of fragmented time, administrators are liable for everything they do.â     School administrators need to understand the rights guaranteed to students by the Fourth Amendment and how it applies to the school setting. This document will provide an overview of student search and seizure in kindergarten to 12th grade (K-12) public schools in a non-traditional dissertation (non-experimental design) format by providing an historical review of the relevant case law. Specifically, based upon legal research, it will review relevant Supreme Court cases, post-New Jersey v. T.L.O.  federal, Pennsylvania and other state court cases related to search and seizure in K-12 public schools. The conclusion and summary will provide answers to the guiding questions, provide a conceptual model, outline what is a reasonable search, and provide a short practical school law exercise to test the readerâ  s understanding of search and seizure in public schools.",
  "description_provenance": [
    "Author Email: dbedden@vt.edu, dana.bedden@verizon.net",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: drdrumming13@aol.com",
    "Made available in DSpace on 2014-03-14T20:08:07Z (GMT). No. of bitstreams: 1 DBeddenFinalETD.pdf: 557122 bytes, checksum: 869a5d8b3d53fc434246f010129721a6 (MD5)   Previous issue date: 2006-03-02"
  ],
  "handle": "26409",
  "identifier_other": "etd-03102006-174524",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03102006-174524/",
  "identifier_uri": "http://hdl.handle.net/10919/26409",
  "publisher": "Virginia Tech",
  "relation_haspart": "DBeddenFinalETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Student Discipline",
    "Search and Seizure",
    "School Law",
    "Student Rights",
    "Fourth Amendment"
  ],
  "title": "Public School Law: Student Search and Seizure in K-12 Public Schools",
  "type": "Dissertation"
}