{
  "contributor_author": "Worley, Gary M.",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Taylor, C. David",
    "Magliaro, Susan G.",
    "Lockee, Barbara B.",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:07Z",
  "date_adate": "1999-03-11",
  "date_available": "2014-03-14T20:08:07Z",
  "date_issued": "1999-03-02",
  "date_rdate": "2000-11-03",
  "date_sdate": "1999-03-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Much of the research investigating color as an image characteristic for enhancing recognition memory has focused on comparisons between black-and-white images and full color images.  These comparisons have only recently been extended to differentiate how color impacts learners of different cognitive style and in particular how color influences field dependency.  Learners predisposed to field-dependence continually demonstrate a lower capacity than field-independent learners in terms of performance tasks where organizing or restructuring visual information is required.  By using color as a mechanism to highlight objects within a visual field, we potentially increase figure-ground separation, which may help facilitate learning for field-dependents in instances where visual information is present.  Thus this study undertook to examine the effects highlight color offers as a means of addressing individual learner differences.  Undergraduate students were identified on the field-dependence-independence continuum using the Group Embedded Figures Test.  Each student then received an instructional lesson on the anatomy of the heart where images were presented in one of four color variations; black-and-white, full realistic color, realistic highlight color, or contrived highlight color.  All participants were given two tests following the instructional lesson, one for identification and the other for terminology.  Test scores for the two tests indicated no differences for any variation of the color variable.  Field-independents were observed to outperform field-dependents in all instances for both tests.",
  "description_provenance": [
    "Author Email: gworley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:07Z (GMT). No. of bitstreams: 1 GMWORLEY.pdf: 288492 bytes, checksum: 15a50fe81a66de2c1520dae591d97ef2 (MD5)   Previous issue date: 1999-03-02"
  ],
  "handle": "26406",
  "identifier_other": "etd-030999-145545",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-030999-145545/",
  "identifier_uri": "http://hdl.handle.net/10919/26406",
  "publisher": "Virginia Tech",
  "relation_haspart": "GMWORLEY.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Recall",
    "Field Dependency",
    "Color"
  ],
  "title": "The Effects of Highlight Color on Immediate Recall in Subjects of Different Cognitive Styles",
  "type": "Dissertation"
}