{
  "contributor_author": "Andersen, Rikke Granum",
  "contributor_committeechair": "Novak, John T.",
  "contributor_committeemember": [
    "Widdowson, Mark A.",
    "Marr, Linsey C.",
    "Hagedorn, Charles  III",
    "Cox, Steven C."
  ],
  "contributor_department": "Environmental Sciences and Engineering",
  "date_accessioned": "2014-03-14T20:08:07Z",
  "date_adate": "2006-04-11",
  "date_available": "2014-03-14T20:08:07Z",
  "date_issued": "2006-01-23",
  "date_rdate": "2009-04-11",
  "date_sdate": "2006-03-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Rikke Granum Andersen  In situ characterization and quantification of phytoremediation removal mechanisms for naphthalene at a creosote-contaminated site  Phytoremediation is an attractive remediation technology due to its relative low cost and maintenance requirement. Acceptance of phytoremediation requires that the contaminant removal mechanisms are characterized and demonstrated in the field. Quantification of contributions from each mechanism to the overall remediation rate is crucial for optimization of phytoremediation systems, risk management and prediction of the total remediation time. The objective of this research was to characterize and quantify removal mechanisms for naphthalene at a creosote-contaminated site with poplar trees in Oneida, Tennessee. Groundwater monitoring for seven years in the surficial aquifer at this site demonstrated a reduction in polycyclic aromatic hydrocarbons (PAHs) with selective removal of naphthalene and three-ring compounds. Naphthalene mass loss mechanisms investigated at this site are biodegradation in the saturated zone, volatilization and biodegradation in the vadose zone and phytovolatilization. This is probably the most comprehensive field study of PAH phytoremediation mechanisms conducted to date. The significance of this research is to contribute to predictions of remediation time and end result for phytoremediation of PAHs. The understanding of in situ factors controlling each mechanism can facilitate future optimization of phytoremediation systems as well as improve risk assessment and monitoring strategies.  Biodegradation rates were determined for different conditions at this site with in situ respiration tests, laboratory soil microcosms and laboratory soil columns. The combined remediation mechanisms of volatilization and biodegradation in the vadose zone were investigated in the field and in laboratory columns. Field measurements show that lower groundwater elevations in the summer and early fall lead to elevated groundwater concentrations of naphthalene and increased volatilization. The increase in the fraction of the porespace occupied by gas (gas saturation) in the unsaturated zone during the summer and fall further enhances the volatilization by increasing effective diffusion rates. Water consumption and interception by the phytoremediation system are believed to enhance mass transfer to the vadose zone. Column experiments and field measurements show that more than 90% of the naphthalene vapors are biodegraded within 5-10 cm above the groundwater table. The data indicate that biodegradation increases the overall volatilization flux out of the source by 10-300 times, when the source is exposed directly to the gas phase. In situ the naphthalene is generally dissolved from the source into the groundwater and then volatilezed from the groundwater to the gas phase. Under these conditions biodegradation in the vadose zone will still indirectly have an enhancing effect on the flux out of the source. This is the result of removal naphthalene from the soil gas by biodegrdation driving removal from the groundwater by volatilization, which in turn drives dissolution form the source into the groundwater.  Phytovolatilization was quantified in flux chambers mounted on trees and calculated from transpiration rates. A laboratory uptake study and analysis of tree cores from the site provided supplementary evidence for naphthalene uptake by poplar trees. Phytovolatilization was detected throughout the year and was highest in the summer and fall when the groundwater concentrations were highest and transpiration was active.  The role of biodegradation relative to physical removal mechanisms was compared for a year, for winter and summer conditions and with and without the impact of phytoremediation. Biodegradation of naphthalene in the saturated zone dominates by orders of magnitude over the removal by volatilization and phytovolatilization of naphthalene at this site. The removal of the total residual naphthalene mass was estimated to require up to 100 years with phytoremediation, but more than twice as long without phytoremediation. The estimated removal of naphthalene was three times larger in the summer than in the winter due to slower biodegradation in the saturated zone and smaller rates of volatilization to the vadose zone in the winter. The research shows that phytoremediation enhances the overall naphthalene removal, mainly by stimulating faster biodegradation in the rhizosphere and promoting mass transfer of naphthalene to the vadose zone followed by rapid vadose zone biodegradation. In the future, phytoremediation research focusing on the capillary zone is desirable.",
  "description_provenance": [
    "Author Email: riander1@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Advisor Email: mwiddows@vt.edu",
    "Advisor Email: lmarr@vt.edu",
    "Advisor Email: chagedor@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:07Z (GMT). No. of bitstreams: 4 AppendixB_edt.pdf: 106166 bytes, checksum: d348bcc53fbde09371154a4cfb519db0 (MD5) TotalDissertation-rettet.pdf: 1035369 bytes, checksum: 1483efd0768ce90165de8944cbbffe56 (MD5) AppendixA.pdf: 1372524 bytes, checksum: 53a7672ef5b11eaf3e92587c1d255cc4 (MD5) VITA.pdf: 49789 bytes, checksum: 133644aa417201063b5001cce8fe01d5 (MD5)   Previous issue date: 2006-01-23"
  ],
  "handle": "26408",
  "identifier_other": "etd-03102006-130742",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03102006-130742/",
  "identifier_uri": "http://hdl.handle.net/10919/26408",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "AppendixB_edt.pdf",
    "TotalDissertation-rettet.pdf",
    "AppendixA.pdf",
    "VITA.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Phytoremediation",
    "full scale",
    "field",
    "DNAPL",
    "creosote",
    "naphthalene",
    "volatilization",
    "groundwater",
    "hybrid poplar"
  ],
  "title": "In situ characterization and quantification of phytoremediation removal mechanisms for naphthalene at a creosote-contaminated site",
  "type": "Dissertation"
}