{
  "contributor_author": "Vann, James Linwood",
  "contributor_committeechair": "Wolf, James F.",
  "contributor_committeemember": [
    "Hickok, Thomas",
    "Dudley, Larkin S.",
    "Khademian, Anne Meredith"
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:08:07Z",
  "date_adate": "2011-04-25",
  "date_available": "2014-03-14T20:08:07Z",
  "date_issued": "2011-02-28",
  "date_rdate": "2011-04-25",
  "date_sdate": "2011-03-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study applies a theoretical framework from institutional organization theory  (Scott, 2001) to examine the problem of managing government contracting, conceptualized as the â  smart buyer problemâ   by Kettl (1993).  Kettl argued that, while embracing the market-based promises of contracting, governments have failed to develop the capacity to address even the most fundamental contracting questions, such as what to buy, who to buy from and what was bought?  He suggests that the problem is partly attributable to bureaucratic barriers to information sharing in government agencies that prevent them from becoming learning organizations.  This study explores the proposition that institutional characteristics within acquisition organizations may contribute to this problem.  Governments do not behave as a single buyer with clearly defined buying objectives.  Multiple organizations, each shaped by institutional factors, lay claim to processes relating to Kettlâ  s smart buyer questions.  As key organizational participants become aligned with their own regulative, normative, and socio-cognitive institutional â  pillars,â   smart buying behavior may become confounded by institutional factors and constraining organizational structures.  For this study, an organizational field consisting of the program office, contracting office, and budget office was selected as the level of analysis.  A qualitative multi-approach methodology was developed to analyze data from public sources, including government policy documents, audit reports, and other published information related to five individual cases.  Data from autoethnographic accounts, interviews, content analyses, and the case studies helped frame the institutional characteristics of these offices.  The study confirmed that the three offices are key participants in acquisition programs, although their roles are not always formally recognized.  Strong evidence was found that they each possess unique institutional characteristics.  These differences could be creating conditions of divergence and misalignment with the acquisition objectives, raising the possibility of conflicting institutional demands, competing challenges for legitimacy, and institutional change.  Policy initiatives to formally recognize the roles and responsibilities of these offices and the use of working-level oversight boards, project teams, and interagency contracting may help mitigate these institutional differences.  The study points to the importance of recognizing participantsâ   institutional characteristics when planning and managing an acquisition program.",
  "description_provenance": [
    "Author Email: jvann@vt.edu",
    "Advisor Email: thickok@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: akhademi@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:07Z (GMT). No. of bitstreams: 1 Vann_JL_D_2011.pdf: 3013454 bytes, checksum: 98c581a1a8b879c5eea9b4f0be5bdcc1 (MD5)   Previous issue date: 2011-02-28"
  ],
  "handle": "26410",
  "identifier_other": "etd-03102011-182009",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03102011-182009/",
  "identifier_uri": "http://hdl.handle.net/10919/26410",
  "publisher": "Virginia Tech",
  "relation_haspart": "Vann_JL_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Public organizations",
    "public procurement",
    "institutional theory"
  ],
  "title": "Institutional Dimensions of the Governmentâ s â Smart Buyerâ Problem: Pillars, Carriers, and Organizational Structure in Federal Acquisition Management",
  "type": "Dissertation"
}