{
  "contributor_author": "Laborie, Marie-Pierre Genevieve",
  "contributor_committeechair": "Frazier, Charles E.",
  "contributor_committeemember": [
    "Glasser, Wolfgang G.",
    "Kamke, Frederick A.",
    "Esker, Alan R.",
    "Ward, Thomas C.",
    "Marand, Eva"
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:08:08Z",
  "date_adate": "2002-03-16",
  "date_available": "2014-03-14T20:08:08Z",
  "date_issued": "2002-02-01",
  "date_rdate": "2005-03-16",
  "date_sdate": "2002-03-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This work addresses the morphology of the wood/ Phenol-Formaldehyde (PF) adhesive interphase using yellow-poplar.  In this case, morphology refers to the scale or dimension of adhesive penetration into wood.  The objective is to develop methods for revealing ever smaller levels of wood/resin morphology.  Dynamic techniques that are commonly utilized in polymer blend studies are investigated as potential methods for probing the wood/ adhesive interphase morphology.  These are Dynamic Mechanical Analysis (DMA) and solid state NMR using CP/MAS.  PF resin molecular weight is manipulated to promote or inhibit resin penetration in wood, using a very low or a very high molecular weight PF resin. With DMA, the influence of PF resin on wood softening is investigated.  It is first demonstrated that the cooperativity analysis according to the Ngai coupling model of relaxation successfully applies to the in-situ lignin glass transition of yellow-poplar and spruce woods.  No significant difference in intermolecular coupling is detected between the two woods.   It is then demonstrated that combining simple DMA measurements with the cooperativity analysis yields ample sensitivity to the interphase morphology.  From simple DMA temperature scans, a low molecular weight PF (PF-Low) does not influence lignin glass transition temperature.  However, the Ngai coupling model of relaxation indicates that intermolecular coupling is enhanced with the low molecular weight PF. This behavior is ascribed to the low molecular weight PF penetrating lignin on a nanometer scale and polymerizing in-situ.    On the other hand, a high molecular weight resin with a broad distribution of olecular weights (PF-High) lowers lignin glass transition temperature dramatically.  This plasticizing effect is ascribed to a small fraction of the PF resin being low enough in molecular weight to penetrate lignin on a nanoscale, but being too dispersed for forming a crosslinked network.   With CP/MAS NMR, intermolecular cross-polarization experiments are found unsuitable to probe the angstrom scale morphology of the wood adhesive interphase.  However, observing the influence of the PF resins on the spin lattice relaxation time in the rotating frame, HT1r, and the cross-polarization time (TCH) is useful for probing the interphase morphology.   None of the resins significantly affects the cross-polarization time, suggesting that angstrom scale penetration does not occur with a low nor a high molecular weight PF resin.   However, the low molecular weight PF substantially modifies wood polymer HT1r, indicating that the nanometer scale environment of wood polymers is altered.  On the other hand, the high molecular weight PF resin has no effect on wood HT1r.  On average, the high molecular weight PF does not penetrate wood on a nanometer scale.  Interestingly, the low molecular weight PF resin disrupts the spin coupling that is typical among wood components.  Spin coupling between wood components is insensitive to the high molecular weight PF.   Finally, it is noteworthy that the two PF resins have significantly different T1r 's in-situ.  The low molecular weight resin T1r lies within the range of wood relaxations, suggesting some degree of spin coupling.  On the other hand, the T1r of the high molecular weight PF appears outside the range of wood relaxations.  Spin coupling between the high molecular weight resin and wood components is therefore inefficient.  The CP/MAS NMR and DMA studies converge to identify nanometer scale penetration of the low molecular weight PF in wood.  On the other hand, the high molecular weight PF resin forms separate domains from wood, although a very small fraction of the PF-High is able to penetrate wood polymers on a nanoscale.",
  "description_provenance": [
    "Author Email: mlaborie@vt.edu",
    "Advisor Email: wglasser@vt.edu",
    "Advisor Email: cfrazier@vt.edu",
    "Advisor Email: kamkefa@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: emarand@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:08Z (GMT). No. of bitstreams: 1 MarieLaborieETD1.pdf: 2282399 bytes, checksum: 288dd18f98945daff4f2fdb1daf7abfd (MD5)   Previous issue date: 2002-02-01"
  ],
  "handle": "26411",
  "identifier_other": "etd-03112002-110430",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03112002-110430/",
  "identifier_uri": "http://hdl.handle.net/10919/26411",
  "publisher": "Virginia Tech",
  "relation_haspart": "MarieLaborieETD1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cooperativity analysis of wood",
    "solid-state NMR",
    "glass transition",
    "wood/adhesive interphase"
  ],
  "title": "Investigation of the Wood/Phenol-Formaldehyde Adhesive Interphase Morphology",
  "type": "Dissertation"
}