{
  "contributor_author": "Flanagan, Barbara G.",
  "contributor_committeechair": "Billingsley, Bonnie S.",
  "contributor_committeemember": [
    "Van Dyke, Ray E.",
    "Sherman, Thomas M.",
    "Crockett, Jean B.",
    "Magliaro, Susan G."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:10Z",
  "date_adate": "2001-03-15",
  "date_available": "2014-03-14T20:08:10Z",
  "date_issued": "2001-02-27",
  "date_rdate": "2002-03-15",
  "date_sdate": "2001-03-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<HTML> <HEAD> <META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=iso-8859-1\"> <META NAME=\"Generator\" CONTENT=\"Microsoft Word 97/98\"> <TITLE>Parents&#146; Views of and Participation in </TITLE> </HEAD> <BODY>  <B><P ALIGN=\"CENTER\">Parents&#146; Views of and Participation in </P> <P ALIGN=\"CENTER\">the Special Education Process</P> <P ALIGN=\"CENTER\"></P> </B><P ALIGN=\"CENTER\">by</P> <P ALIGN=\"CENTER\">Barbara Grace Flanagan</P> <P ALIGN=\"CENTER\">Committee Chairperson: Bonnie S. Billingsley</P> <P ALIGN=\"CENTER\">Curriculum and Instruction</P> <P ALIGN=\"CENTER\"></P> <FONT FACE=\"Times\"><P ALIGN=\"CENTER\">(ABSTRACT)</P> <BR> <P>Parents&#146; views of and participation in the special education process are important in light of parents&#146; expanded membership in all decision making groups, specifically those that make eligibility and placement decisions guaranteed by The Individuals with Disabilities Education Act Amendments of 1997 (IDEA &#146;97). The purpose of this study was to understand how parents view the special education process and their participation from their child&#146;s referral to eligibility determination. Furthermore, this study sought to determine how parents&#146; understanding and participation in the special education process could be enhanced.</P> <P>Nine parents&#146; journeys through the special education referral and evaluation process were chronicled through pre-and post-eligibility parent interviews and observations of eligibility meetings. This data was contexualized through educator post-eligibility interviews to determine representativeness of parents&#146; participation and meeting characteristics. </P> <P>Individual and cross case analyses were used to analyze data. Findings indicate that little has changed in the past 25 years in the day-to-day implementation of the special education evaluation process. That is, parents know little of the process and participate minimally. Furthermore, parents express feelings about their child and the process that indicate that they care deeply and feel a vested interest in outcomes. However, parents express a need for greater understanding and participation in the process. A model for the effective implementation of the special education process is offered</P></FONT></BODY> </HTML>",
  "description_provenance": [
    "Author Email: flanagab@vt.edu",
    "Advisor Email: rvandyke@mail.mcps.org",
    "Advisor Email: tsherman@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: bbilling@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:10Z (GMT). No. of bitstreams: 1 BFLANfinal.pdf: 355865 bytes, checksum: ca96d241b76d2fd9dd0a69cb310c3269 (MD5)   Previous issue date: 2001-02-27"
  ],
  "handle": "26419",
  "identifier_other": "etd-03132001-103550",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03132001-103550/",
  "identifier_uri": "http://hdl.handle.net/10919/26419",
  "publisher": "Virginia Tech",
  "relation_haspart": "BFLANfinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Parents' Participation",
    "Parents' Views",
    "Special Education Process"
  ],
  "title": "Parents' Views of and Participation in the Special Education Process",
  "type": "Dissertation"
}