{
  "contributor_author": "Palmer, Stephen E",
  "contributor_committeechair": "Graham, George M.",
  "contributor_committeemember": [
    "Redican, Kerry J.",
    "Krouscas, James A. Jr.",
    "Lockee, Barbara B.",
    "Elliott, Eloise"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:09Z",
  "date_adate": "2002-03-14",
  "date_available": "2014-03-14T20:08:09Z",
  "date_issued": "2001-07-18",
  "date_rdate": "2003-03-14",
  "date_sdate": "2002-03-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Substantial resources are being directed towards use of the Internet in K-12 Education with over $2.25 billion annually distributed to K-12 schools from the Federal government alone (Maiden & Beckham, 1999). In 1998, 90% of schools had Internet access while only 2% of funds spent on software in K-12 schools were directed towards Web-based courseware (Jerald & Orlofsky, 1999). The Web-based instructional module Healthy Hearts was developed as a self-contained instructional unit delivered over the Internet, popularly referred to as â  e-Learningâ  , for fifth grade students to use as part of the classroom curriculum. Healthy Hearts teaches children about risk factors associated with heart disease, including physical activity, tobacco, and nutrition. After piloting and formatively evaluating Healthy Hearts in two fifth grade classrooms, Elliott (1997) made recommendations for future modification and implementation. No research regarding effects the Web-based instructional unit Healthy Hearts has on fifth grade children exists. The purpose of this study is to evaluate the impact Healthy Hearts has on fifth grade childrenâ  s physical activity knowledge, attitudes, and behavior.  Participants included 233 fifth grade boys and girls and 11 teachers who implemented Healthy Hearts during Spring 2001. A repeated measures experimental-control design was employed to measure Healthy Hearts effects on physical activity knowledge, attitudes, and behavior. The questionnaire used for this study included three attitude items adapted from Sport, Play, and Active Recreation for Kids (SPARK) (Sallis, Alcaraz, McKenzie, & Hovell, 1999a), six criterion referenced knowledge items developed from Healthy Hearts objectives, and a Weekly Activity Checklist to assess physical activity behavior, which was developed and validated for SPARK (Sallis et. al., 1993a). Classroom teachers administered the baseline test before students began using the module. For five weeks following the baseline test, the group 1 engaged in Healthy Hearts lessons by going to a computer lab for 45 minutes twice a week while group 2 participated in regularly scheduled classroom activities. After group 1 finished Healthy Hearts, both groups completed test 1 and then teachers from group 2 implemented Healthy Hearts with their classes. When group 2 finished using Healthy Hearts, both groups completed test 2. Dependent variables were physical activity knowledge, attitude, and behavior with group as independent variables. Other independent variables included school socioeconomic status, time allocated to Healthy Hearts, non-Healthy Hearts instruction time for related objectives, and speed of Internet connection.  Repeated measures ANOVA revealed significant effects of Healthy Hearts on physical activity knowledge and attitude, however Healthy Hearts had no significant effects on behavior. Results of this study indicate Healthy Hearts could be an effective means of using the Internet to deliver health and physical activity instruction to fifth grade children, and suggest a need for further design, development, and evaluation of Healthy Hearts.",
  "description_provenance": [
    "Author Email: steve.palmer@nau.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: krouscas@vt.edu",
    "Advisor Email: barbara.lockee@vt.edu",
    "Advisor Email: elelliot@concord.edu",
    "Advisor Email: ggraham@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:09Z (GMT). No. of bitstreams: 3 dissfd.pdf: 4859389 bytes, checksum: f9d22a9aab0b33815e2db7836406adc3 (MD5) Abstract.pdf: 59767 bytes, checksum: fb3fc49c34718f3bb7492affb5d6e4a3 (MD5) bibliography.pdf: 115638 bytes, checksum: a12a434fcc532795c695fbccdec0948e (MD5)   Previous issue date: 2001-07-18"
  ],
  "handle": "26415",
  "identifier_other": "etd-03122002-124401",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03122002-124401/",
  "identifier_uri": "http://hdl.handle.net/10919/26415",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "dissfd.pdf",
    "Abstract.pdf",
    "bibliography.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "physical activity",
    "Internet",
    "health",
    "e-learning",
    "intervention",
    "World Wide Web"
  ],
  "title": "The Effects of the Web-Based Instructional Unit Healthy Hearts on Fifth Grade Children's Physical Activity Knowledge, Attitudes, and Behavior",
  "type": "Dissertation"
}