{
  "contributor_author": "Hu, Jiahuai",
  "contributor_committeecochair": [
    "Hong, Chuanxue",
    "Stromberg, Erik L."
  ],
  "contributor_committeemember": [
    "McDowell, John M.",
    "Moorman, Gary W.",
    "Tyler, Brett M."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:08:09Z",
  "date_adate": "2007-07-16",
  "date_available": "2014-03-14T20:08:09Z",
  "date_issued": "2007-02-27",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-03-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Mefenoxam has been a premier compound for Phytophthora disease control in the nursery industry for 30 years. The primary objectives of this research were to examine whether Phytophthora species have developed resistance to this compound and to investigate fungicide resistance management strategies. Phytophthora nicotianae, a destructive pathogen of numerous herbaceous and some woody ornamental plants, was used as a model system. P. cinnamomi, a major pathogen of a wide range of tree species and shrub plants, was also included for comparison. Twenty-six isolates of P. nicotianae were highly resistant to mefenoxam with a mean EC50 value of 326.5 Âµg/ml while the remaining 70 were sensitive with an EC50 of <0.01 Âµg/ml (Label rate: 0.08Âµg/ml). All resistant isolates were recovered from herbaceous annuals and irrigation water in 3 Virginia nurseries. Resistant isolates were compared with sensitive ones using seedlings of Lupinus â  Russell Hybridsâ   in the absence of mefenoxam for relative competitive ability. Resistant isolates out-competed sensitive ones within 3 to 6 sporulation cycles. Resistant isolates exhibited greater infection rate and higher sporulation ability than sensitive ones. No mefenoxam resistant isolates were identified in P. cinnamomi. All 65 isolates of P. cinnamomi were sensitive to mefenoxam with an EC50 of < 0.04 ï ­g/ml. Attempts to generate mutants with high resistance to mefenoxam through UV mutagenesis and mycelial adaptation were not successful. However, there were significant reductions in sensitivity to mefenoxam; those slightly resistant mutants carried fitness penalties, which may explain why P. cinnamomi remains sensitive to mefenoxam. The effect of propamocarb hydrochloride on different growth stages of Phytophthora nicotianae was evaluated in search for an alternative fungicide. Propamocarb greatly inhibited sporangium production, zoospore motility, germination and infection. However, it has little inhibition of mycelial growth and infections. Propamocarb can be used as an alternative fungicide to mefenoxam where mefenoxam resistance has become problematic. However, it must be used preventively; i.e. before infections occur. The genetic inheritance of mefenoxam resistance in P. nicotianae was studied using F1 progenies of a cross between resistant and sensitive isolates. The F1 progenies segregated for mefenoxam resistance in ratio of 1R:1S, indicating the mefenoxam resistance is controlled by a single dominant gene. One RAPD marker putatively linked to resistant locus in repulsion phase was obtained by bulked segregant analysis and was converted to the SCAR marker. This marker is capable of differentiating mefenoxam resistant populations from sensitive populations included in this study.",
  "description_provenance": [
    "Author Email: hjh@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Advisor Email: chhong2@vt.edu",
    "Advisor Email: elstrom@vt.edu",
    "Advisor Email: g1m@psu.edu",
    "Advisor Email: bmtyler@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:09Z (GMT). No. of bitstreams: 1 Dissertation_Jiahuai_Hu.pdf: 2982953 bytes, checksum: e7502a0fd94f19474d0add557798d6a9 (MD5)   Previous issue date: 2007-02-27"
  ],
  "handle": "26416",
  "identifier_other": "etd-03122007-205922",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03122007-205922/",
  "identifier_uri": "http://hdl.handle.net/10919/26416",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Jiahuai_Hu.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "DNA markers",
    "and bulk segregant analysis",
    "fungicide resistance",
    "genetics",
    "competitive ability",
    "mycelial adaptation",
    "ornamental crops",
    "fitness costs",
    "segregation",
    "fitness",
    "IPM",
    "EC50 value",
    "molecular detection"
  ],
  "title": "Phytophthora nicotianae: Fungicide Sensitivity, Fitness, and Molecular Markers",
  "type": "Dissertation"
}