{
  "contributor_author": "Keil, Clifford B.",
  "contributor_committeechair": "Ross, Mary H.",
  "contributor_committeemember": [
    "West, David A.",
    "Cochran, David G.",
    "Mullins, David E.",
    "Esen, Asim"
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:08:12Z",
  "date_adate": "2009-03-13",
  "date_available": "2014-03-14T20:08:12Z",
  "date_issued": "1982-06-05",
  "date_rdate": "2009-03-13",
  "date_sdate": "2009-03-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>A chromosome banding protocol for <u>Blattella germanica</u> speramtocytes was developed to reveal locations of constitutive heterochromatin (C-bands). Normality of the acid treatment used to denature basic (histone) proteins, temperature of the salt solution used to extract DNA from unhanded regions, and the components of the Romanowsky-type stain proved to be critical components in the C-banding process. The thiazine component of a standard Gieasa stain had an absorbance maximum altered from that of methylene blue, the putative major thiazine in this stain and was ineffective in producing C-bands. Two samples of Leishman's stain were examined chromatographically, spectrophotometrically, and for their C-bandinq ability as they aged. Banding failure was accompanied by a rounding of the thiazine spectral peak and the appearance of unknowns with cbromatographic mobility intermediate to azures A and B, and an apparent increase in azure C content. Experimental thermal and photo-degradation of Leishman's stain shoved similar alterations of the thiazine components. c-banded prop base II and diplotene kacyotypes revealed a hiqhly heteroaorphic pattern of C-band distribution. Blocks of constitutive heterochromatin were not soley associated with centroaeres bat occurred interstitially and terminally also. One chromosome was C-band negative, number 8, while two others. 9 and the X, were almost completely heterochromatic. Differential rates of condensation from prophase I to prophase II for euchromatic and heterochromatic regions were documented. The karyotype of <u> B. germanica</u> contained many gray bands that may indicate euchroaatin interspersed with heterochromatin. Translocation heterozygote stocks were used to correlate the banded karyotype with linkage groups. Translocation multivalents frequently contained C-bands Dot resolved in wild type chromosomes. A C-banded prophase II karyotype of a closely related species, <u>Blattella vaga</u>, was prepared to assess the variability of heterochromatin distribution. The basic banding pattern was preserved in four of the twelve chromosomes although the bands were larger in this species. Tvo chromosomes, 11 and 8, had a single additional C-band in each. The basic banding pattern was preserved in four of the twelve chromosomes although the bands larger in this species.  Two chromosomes, 11 and 89, had a single additional C-band in each.  The  <u>B. vaga X</u> chromosome was about twice as large as that in <u>B. germanica</u>. The mid-sized chromosomes were extensively repatterned. Overall, <u>B. vaga</u> chromosomes were longer than those of <u>B. germanica</u>. Increased heterochromatin content appeared to be the cause of the greater length.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:08:12Z (GMT). No. of bitstreams: 1 LD5655.V856_1982.K532.pdf: 5434689 bytes, checksum: 67e4126fba395aede3c561f98b8b1f08 (MD5)   Previous issue date: 1982-06-05",
  "format_medium": "BTD",
  "handle": "26426",
  "identifier_other": "etd-03132009-040450",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03132009-040450/",
  "identifier_uri": "http://hdl.handle.net/10919/26426",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1982.K532.pdf",
  "subject": "Cockroaches",
  "subject_lcc": "LD5655.V856 1982.K532",
  "title": "Chromosome banding of German cockroach spermatocytes",
  "type": "Dissertation"
}