{
  "contributor_author": "Winston, Ebony  Joy",
  "contributor_committeechair": "Piercy, Fred P.",
  "contributor_committeemember": [
    "Creamer, Elizabeth G.",
    "McWey, Lenore M.",
    "Allen, Katherine R."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:08:11Z",
  "date_adate": "2008-04-08",
  "date_available": "2014-03-14T20:08:11Z",
  "date_issued": "2008-02-13",
  "date_rdate": "2008-04-08",
  "date_sdate": "2008-03-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "I conducted a mixed method study to explore how gender and diversity are being taught and defined at accredited marriage and family therapy programs.  This research approach was explored through a feminist lens and within a systems theory framework, using both qualitative and content analysis methods. I examined course syllabi and interviewed faculty members that taught gender and diversity topics in their courses.  I examined findings by program (masters and doctoral) and type of training (those that taught specific gender and culture courses and those that attempted to infuse gender and culture throughout the curriculum). The sample population consisted of syllabi from 21 masters and 18 doctoral training programs (ten each that taught specific courses in gender and diversity and eleven masters and eight doctoral courses that stated that they infuse gender and diversity throughout the curriculum). That is that there was variation in the topic areas that were explored when the specific courses content and infused course content were compared. There was a significant difference in the degree to which these topics were taught between the two program levels (Masters vs. Doctoral). However, the qualitative data reflected similarities in the teaching methods of both types of programs. Additionally, Twenty faculty members were interviewed, ten from a masterâ  s and ten from doctoral programs. These faculty members were equally split between those representing infusion and specific courses.  I constructed course summary tables of books, articles, course objectives and illustrative learning activities from each syllabus. The major implications of this study were that the experiences of the professors were explored and the studentâ  s perspectives had been excluded.  There was also little variation in the racial and gender characteristics of the professors",
  "description_provenance": [
    "Author Email: ebonyjoy@vt.edu",
    "Advisor Email: creamere@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: lmcwey@fsu.edu",
    "Advisor Email: kallen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:11Z (GMT). No. of bitstreams: 1 EJWDissertation.pdf: 680551 bytes, checksum: 7a84e3acc5445580fbb80b7843d68e53 (MD5)   Previous issue date: 2008-02-13"
  ],
  "handle": "26423",
  "identifier_other": "etd-03132008-192734",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03132008-192734/",
  "identifier_uri": "http://hdl.handle.net/10919/26423",
  "publisher": "Virginia Tech",
  "relation_haspart": "EJWDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Culture",
    "Curriculum",
    "Ethnicity",
    "Race",
    "Gender",
    "Diversity"
  ],
  "title": "Gender and Diversity Topics Taught in Coamfte Programs",
  "type": "Dissertation"
}