{
  "contributor_author": "Lyons, James Edward",
  "contributor_committeechair": "Walters, Jeffrey R.",
  "contributor_committeemember": [
    "Collazo, Jaime A.",
    "Jenssen, Thomas A.",
    "Smith, Eric P.",
    "Fraser, James D.",
    "Jones, Robert H."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:08:12Z",
  "date_adate": "2001-03-21",
  "date_available": "2014-03-14T20:08:12Z",
  "date_issued": "2001-02-07",
  "date_rdate": "2002-03-21",
  "date_sdate": "2001-03-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nest survival often is lower at habitat edges than in habitat cores because of greater nest predation and parasitism near edges.  I studied nest survival of breeding birds in bottomland hardwood forests of the lower Roanoke River, North Carolina.  Nesting success was monitored in two forest width classes: narrow bands of levee forest that were dominated by two edge types, and wide, continuous levee forest stands that have edges but most forest is relatively far from edge.  Nest success of Acadian Flycatchers and Prothonotary Warblers was similar in narrow and wide levees; nest success of Northern Cardinals was greater in narrow levees.  Results of my study indicate that edge effects are not universal, and that amount of contrast at edges may interact with landscape context to alter ecological processes, such as nest predation.  Bird populations are remarkably constant over time relative to other taxa, implying strong regulation.  Avian population ecologists, however, have not studied regulatory mechanisms as often as seasonal limiting factors.  Conversely, avian behavioral ecologists seldom emphasize the population dynamic consequences of habitat selection and reproductive success.  This study describes the intersection of individual behavior and population regulation in the context of a new model of population regulation, site dependence, which is based on characteristics of breeding sites and behavior of individuals.  I studied habitat distribution, age structure, reproductive output, and breeding site fidelity of Prothonotary Warblers (Protonotaria citrea) in two different bottomland hardwood forest habitats of the lower Roanoke River in North Carolina.  Older males (³ 2 yr old) were equally common in cypress-gum swamps and mixed oak hardwood levee forest.  Pairing success and success of first nests indicated that older males occupied the most suitable territories available in each habitat.  Bird density was three times greater in swamps, and birds nesting in swamps averaged greater clutch sizes and fledged more young per nest than birds in levees.  Greater reproductive output was the result of greater fecundity because nest survival and predation pressure appeared equal in the two habitats.  Annual return rates for plot immigrants vs. previous residents did not differ in swamps.  In levees, newly arriving birds were less likely to return the following year than previous residents.  Immigrants most likely occupied low quality sites and dispersed in an attempt to improve breeding site quality.  Habitat-specific demography and density patterns of this study indicate ideal preemptive distribution.  Variance in site quality, between and within habitats, and preemptive use of sites are consistent with theory of population regulation via site dependence.  Foraging behavior often reflects food availability. For example, in habitats where food availability is high, predators should move more slowly and attack prey more often than in habitats where food availability is low.  I studied the foraging behavior of breeding Prothonotary Warblers in two habitat types to assess relative food availability and implications for habitat quality.  The two habitats, levee and swamp forest, differ in hydrology, forest structure, and tree species composition.  I quantified foraging behavior with focal animal sampling and continuous recording during foraging bouts.  I measured two aspects of foraging behavior: 1) prey attacks per minute, using four attack types (glean, sally, hover, strike), and 2) number of movements per minute (foraging speed), using three types of movement (hop, short flight [£ 1 m], long flight [>1 m]).  Male warblers made significantly more prey attacks per minute in swamp forest than in levee forest; the same trend was evident in females.  Foraging speed, however, was not different between habitats for males or females.  Results indicate that foraging effort is similar in swamps and levees, but that warblers encounter more prey in swamps.  Greater food availability may be related to greater reproductive success of warblers nesting in cypress-gum swamps than in coastal plain levee forest.",
  "description_provenance": [
    "Author Email: jelyons@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:12Z (GMT). No. of bitstreams: 1 etd.pdf: 498029 bytes, checksum: c07ed5dc44c98287a4ff2e38b7edf490 (MD5)   Previous issue date: 2001-02-07"
  ],
  "handle": "26429",
  "identifier_other": "etd-03142001-184756",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03142001-184756/",
  "identifier_uri": "http://hdl.handle.net/10919/26429",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "edge effects",
    "site dependence",
    "habitat distribution",
    "movement frequency",
    "population regulation",
    "foraging behavior",
    "nest success",
    "attack rate"
  ],
  "title": "Population Ecology and Foraging Behavior of Breeding Birds in Bottomland Hardwood Forests of the Lower Roanoke River",
  "type": "Dissertation"
}