{
  "contributor_author": "Alexander, Jenny Burroughs",
  "contributor_committeechair": "Meszaros, Peggy S.",
  "contributor_committeemember": [
    "Few-Demo, April L.",
    "Mancini, Jay A.",
    "Olsen, Deborah"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:08:13Z",
  "date_adate": "2008-04-07",
  "date_available": "2014-03-14T20:08:13Z",
  "date_issued": "2008-03-13",
  "date_rdate": "2008-04-07",
  "date_sdate": "2008-03-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Recruitment and retention of public child welfare workforce is in crisis due to turnover caused by 1) dissatisfaction with job; 2) excessive stress and burnout, including vicarious trauma; and 3) a lack of support from supervisors and organizations. No instrument was found to evaluate the impact of supervisory support and the use of organizational and professional strategies. The Supervisory and Organizational Support (SOS) survey instrument was created in response to the need for reliable and valid instruments to measure issues related to child welfare workforce turnover.  The purpose of this study was to investigate the psychometric properties of the SOS survey instrument and was designed to address the following research questions:  1)\tDoes the instrument have demonstrated content validity? 2)\tDoes the instrument have demonstrated construct validity as developed through factor analysis techniques? 3)\tDoes the instrument have demonstrated reliability? 4)\tTo what extent do the instrument and itsâ   subscales correlate with measures of theoretically related and unrelated variables?  The results of this study with a sample of 387 employees in 18 Virginia Department of Social Services agencies provide good beginning evidence of content, construct, convergent, and discriminant validity, and reliability of the SOS survey instrument. As such, the SOS survey can be used in studies of social services workforce turnover/ retention. However, to increase confidence in this recommendation, further research should address the implications and limitations of the current study and provide replication of the results with a different sample using confirmatory factor analysis. Finally, the SOS survey instrument may serve to assist in the evaluation of practice and policy efforts aimed at increasing worker retention.",
  "description_provenance": [
    "Author Email: jburroug@radford.edu",
    "Advisor Email: meszaros@vt.edu",
    "Advisor Email: alfew@vt.edu",
    "Advisor Email: mancini@vt.edu",
    "Advisor Email: dolsen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:13Z (GMT). No. of bitstreams: 2 etd--title&abstract..pdf: 34582 bytes, checksum: 1242c42cbe0ff95d17d3b56679c70f1a (MD5) JBAdissertation.pdf: 654509 bytes, checksum: 20428e2094e08516bebc63729ecc05ef (MD5)   Previous issue date: 2008-03-13"
  ],
  "handle": "26436",
  "identifier_other": "etd-03152008-183325",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03152008-183325/",
  "identifier_uri": "http://hdl.handle.net/10919/26436",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etd--title&abstract..pdf",
    "JBAdissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Child Welfare workforce retention and turnover",
    "exploratory factor analysis",
    "survey development",
    "supportive supervision",
    "Constructivist Self-Development Theory",
    "Supervisory and Organizational Support (SOS) Surv",
    "vicarious trauma"
  ],
  "title": "Development and Validation of Supervisory and Organizational Support Measures",
  "type": "Dissertation"
}