{
  "contributor_author": "Kite, Brett Lee",
  "contributor_committeechair": "Gandour, Richard D.",
  "contributor_committeemember": [
    "Kingston, David G. I.",
    "Merola, Joseph S.",
    "Brewer, Karen J.",
    "Castagnoli, Neal  Jr."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:08:13Z",
  "date_adate": "2006-04-05",
  "date_available": "2014-03-14T20:08:13Z",
  "date_issued": "2005-12-01",
  "date_rdate": "2006-04-05",
  "date_sdate": "2006-03-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The development of suitable models to study and quantify the strengths of noncovalent interactions is a major goal of our group.  With this goal in mind, we have synthesized octasubstituted diarylacetylenes (tolanes) as potential model systems to measure intramolecular noncovalent interactions.<p> \tThe Stille cross-coupling reaction allowed synthesis of both arylacetylenes and tolanes from aryl iodides.  The Stille reaction is usually slow for electron rich aryl iodides (such as these aryl iodides that are substituted resorcinol derivatives).  However, these crowded penta-substituted aryl iodides underwent the Stille coupling reactions (typically 2-3 hours) at a significantly faster rate than the Stille couplings of the un-crowded tri-substituted aryl iodides (typically 24 hours).  DFT calculations on 1,3-dimethoxy-2-iodobenzene (as a model system) indicate that this rate difference is mainly due to a decrease in the reduction potential of the crowded penta-substituted aryl iodides (~ 0.4 eV lower) relative to the tri-substituted aryl iodides.<p> \tThe successful synthesis of the targeted crowded symmetrical tetra ester produced a mixture of atropomers, which separated into two components with similar NMR and MS data.  HF calculations on 4,4',6,6'-tetra-tert-butyl-1,1',3,3'-tetramethoxydiphenylacetylene (as a model system) showed that there are five possible atropomeric conformations.  We separated the component which showed a green fluorescence when irradiated with UV (254 nm) light and grew a suitable single crystal.  The X-ray crystal structure revealed that this component is the syn-syn_anti atropomer.  The remaining atropomers, which show blue fluorescence when irradiated with UV (254 nm) light, were not successfully separated.  Comparison of the observed UV spectrum of the green-fluorescent atropomer (syn-syn_anti) with a calculated (ZINDO) UV spectrum of diphenylacetylene, with an interplanar angle of 0° between the arene rings, showed that the observed and calculated spectra closely matched.  The calculated (ZINDO) UV spectrum of diphenylacetylene, with an interplanar angle of 60° between the arene rings, closely matched the observed spectrum for the blue-fluorescent component (mixture of atropomers).  The combination of experimental and computational methods demonstrated the stereochemical complexities of the crowded symmetrical tetra ester.<p>",
  "description_provenance": [
    "Author Email: bkite@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: jmerola@vt.edu",
    "Advisor Email: gandour@vt.edu",
    "Advisor Email: kbrewer@vt.edu",
    "Advisor Email: ncastagn@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:13Z (GMT). No. of bitstreams: 1 Kite_Dissertation.pdf: 1979350 bytes, checksum: e8c5495ba0153b3f7201919e9c942ef3 (MD5)   Previous issue date: 2005-12-01"
  ],
  "handle": "26433",
  "identifier_other": "etd-03152006-135012",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03152006-135012/",
  "identifier_uri": "http://hdl.handle.net/10919/26433",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kite_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Chemistry",
    "Tolane",
    "Molecular Recognition",
    "Diarylacetylene"
  ],
  "title": "Synthesis of Crowded Tolanes: Models for Molecular Recognition",
  "type": "Dissertation"
}