{
  "contributor_author": "Gunduz, Irfan",
  "contributor_committeechair": "Buss, Glenn R.",
  "contributor_committeemember": [
    "Wilkinson, Carol A.",
    "Griffey, Carl A.",
    "Veilleux, Richard E.",
    "Tolin, Sue A.",
    "Maroof, M. A. Saghai"
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:08:15Z",
  "date_adate": "2000-03-17",
  "date_available": "2014-03-14T20:08:15Z",
  "date_issued": "2000-01-28",
  "date_rdate": "2001-03-17",
  "date_sdate": "2000-03-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research was conducted to analyze the genetics of soybean mosaic virus (SMV) resistance in soybean [Glycine max (L.) Merr.] and to determine allelic relationships of SMV resistance genes and their interactions with SMV strain groups. <p>In the first part of this study, the inheritance of SMV resistance in OX670 and 'Harosoy' was studied to determine the source and identity of the resistance gene/genes in OX670.  Other researchers reported that OX670 possesses a single gene at a locus independent of Rsv1 and assigned the gene symbol Rsv2.  Rsv2 was presumably derived from the cultivar 'Raiden'.  However, later work showed that Raiden contains a single resistance gene at the Rsv1 locus, raising the possibility that the resistance gene in OX670 was not from Raiden.  Harosoy and its derivatives make up much of the remaining pedigree of OX670. Results from crosses of OX670 with susceptible cultivars indicate that it contains two independent genes for SMV resistance.  One is allelic to the Rsv1 locus, expresses resistance to SMV-G1 and G7 and is derived from Raiden.  The other is allelic to the Rsv3 locus, expresses resistance to SMV-G7 but susceptibility to SMV-G1 and is derived from Harosoy. Therefore the Rsv2 locus does not appear to exist in OX670 or its ancestors.  The presence of Rsv1 and Rsv3 makes OX670 resistant to all SMV strains from G1 through G7. <p>The second study was conducted to investigate the inheritance and allelomorphic relationships of resistance gene(s) in 'Tousan 140' and 'Hourei', which were reported to carry single independent resistance genes when inoculated with the Japanese SMV strain C.  Both of these lines exhibit resistance to strains SMV-G1 through G7.  This inheritance study shows that Tousan 140 and Hourei each possess two resistance genes.  One of the genes in Hourei confers resistance to SMV-G1 and G7 strains; the other gene confers susceptibility to SMV-G1 but resistance to SMV-G7. Allelism tests indicate that one of the genes in both Hourei and Tousan 140 is allelic to Rsv1, and the other is allelic to Rsv3.  The two genes in Tousan 140 were separated into individual lines, R1 and R2. R1, most probably containing Rsv1, exhibited resistance to SMV-G1 through G3 but was susceptible to SMV-G5 through G7.   Line R2, most likely possesses Rsv3 gene, was susceptible to SMV-G1 through G3 but resistant to SMV-G5 through G7.  Therefore, presence of these two genes makes Tousan 140 resistant to SMV-G1 through G7. <p>The objective of the third study was to investigate inheritance and allelomorphic relationships of SMV resistance in PI88788.  PI88788 exhibits resistance to SMV-G1 through G7. Genetic analysis of our data reveals that SMV resistance in PI88788 is conferred by a single gene at a locus tentatively labeled 'Rsv4'.  Expression of this gene in the homozygous state decreased accumulation rate and prevented vascular movement of SMV.  In the heterozygous state vascular movement of the SMV was delayed but not prevented.",
  "description_provenance": [
    "Author Email: irnaz@vt.edu",
    "Advisor Email: wilki@vt.edu",
    "Advisor Email: cgriffey@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: stolin@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: gbuss@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:15Z (GMT). No. of bitstreams: 1 etd1.pdf: 1425062 bytes, checksum: 77fadde20e45f04bd6c0fe939b64e5cf (MD5)   Previous issue date: 2000-01-28"
  ],
  "handle": "26439",
  "identifier_other": "etd-03162000-14330026",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03162000-14330026/",
  "identifier_uri": "http://hdl.handle.net/10919/26439",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd1.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Glycine max",
    "allelism",
    "incomplete dominance",
    "late susceptibility",
    "disease resistance"
  ],
  "title": "Genetic Analysis of Soybean Mosaic Virus Resistance in Soybean",
  "type": "Dissertation"
}