{
  "contributor_author": "Lu, Qifeng",
  "contributor_committeechair": "Hancock, Kathleen L.",
  "contributor_committeemember": [
    "Midkiff, Scott F.",
    "Lu, Chang-Tien",
    "Kikuchi, Shinya",
    "Dymond, Randel L."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:08:15Z",
  "date_adate": "2009-04-22",
  "date_available": "2014-03-14T20:08:15Z",
  "date_issued": "2009-02-25",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-03-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "With the technological advancement in computer science, Geographic Information Science (GIScience), and transportation, more and more complex path finding queries including category based queries are proposed and studied across diverse disciplines. A category based query, such as Optimal Sequenced Routing (OSR) queries and Trip Planning Queries (TPQ), asks for a minimum-cost path that traverses a set of categories with or without a predefined order in a graph. Due to the extensive computing time required to process these complex queries in a large scale environment, efficient algorithms are highly desirable whenever processing time is a consideration. In Artificial Intelligence (AI), a best first search is an informed heuristic path finding algorithm that uses domain knowledge as heuristics to expedite the search process. Traditional best first searches are single-variate in terms of the number of variables to describe a state, and thus not appropriate to process these queries in a graph. In this dissertation, 1) two new types of category based queries, Category Sequence Traversal Query (CSTQ) and Optimal Sequence Traversal Query (OSTQ), are proposed; 2) the existing single-variate best first searches are extended to multivariate best first searches in terms of the state specified, and a class of new concepts--state graph, sub state graph, sub state graph space, local heuristic, local admissibility, local consistency, global heuristic, global admissibility, and global consistency--is introduced into best first searches; 3) two bivariate best first search algorithms, C* and O*, are developed to process CSTQ and OSTQ in a graph, respectively; 4) for each of C* and O*, theorems on optimality and optimal efficiency in a sub state graph space are developed and identified; 5) a family of algorithms including C*-P, C-Dijkstra, O*-MST, O*-SCDMST, O*- Dijkstra, and O*-Greedy is identified, and case studies are performed on path finding in transportation networks, and/or fully connected graphs, either directed or undirected; and 6) O*- SCDMST is adopted to efficiently retrieve optimal solutions for OSTQ using network distance metric in a large transportation network.",
  "description_provenance": [
    "Author Email: qilu1@vt.edu",
    "Advisor Email: midkiff@vt.edu",
    "Advisor Email: ctlu@vt.edu",
    "Advisor Email: hancockk@vt.edu",
    "Advisor Email: kikuchi@vt.edu",
    "Advisor Email: dymond@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:15Z (GMT). No. of bitstreams: 1 ETD_QifengLU_Patented.pdf: 1125249 bytes, checksum: 6053dfa2baf8d293e1e0d1edd3bebb52 (MD5)   Previous issue date: 2009-02-25"
  ],
  "handle": "26444",
  "identifier_other": "etd-03162009-210052",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03162009-210052/",
  "identifier_uri": "http://hdl.handle.net/10919/26444",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD_QifengLU_Patented.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "state graph space",
    "O*-MST",
    "Geographic Information Science",
    "C*- Dijkstra",
    "O*-Greedy",
    "O*-Dijkstra",
    "O*-SCDMST",
    "trip planning",
    "category based queries",
    "O*",
    "Geographic Information System",
    "admissible",
    "L#",
    "transportation network",
    "logistics",
    "multivariate",
    "Bivariate",
    "best first search",
    "CSTQ",
    "C*",
    "consistent",
    "path",
    "heuristic",
    "optimization",
    "state graph",
    "graph",
    "OSTQ",
    "C*-P"
  ],
  "title": "Bivariate Best First Searches to Process Category Based Queries in a Graph for Trip Planning Applications in Transportation",
  "type": "Dissertation"
}