{
  "contributor_author": "Schapiro, Nancy Ellen",
  "contributor_committeecochair": [
    "Burge, Penny L.",
    "Getz, Hilda M."
  ],
  "contributor_committeemember": [
    "Long, Lynette",
    "Kriz, Kerri-Lynn",
    "Boucouvalas, Marcie"
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:08:15Z",
  "date_adate": "2005-03-25",
  "date_available": "2014-03-14T20:08:15Z",
  "date_issued": "2005-03-15",
  "date_rdate": "2008-03-25",
  "date_sdate": "2005-03-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Although existing literature is rich with descriptions of the process of coming out for lesbian women, the present study is distinctive in its systematic examination of coming out from the perspective of lesbian women who were sexually abused as children. Through the hermeneutic-phenomenological analysis of interviews with selected participants who identified as lesbian women, the objective of this study was to identify and describe participantsâ   perspectives of childhood sexual abuse, coming out experiences, and their perception of how these experiences might interrelate. Within the complex layers that were common to all the participants, the researcher attempted to interpret and make sense of phenomena across all cases, while respecting and recognizing the meanings that each participant brought to the interview.   The results of this study were consonant with findings from previous studies that suggested maintaining a lesbian identity is an ongoing task, continually informed by events and relationships that typically occur during the lifespan of an individual. However, in the course of this investigation, the findings pointed to a new understandingâ  the coming out process becomes more complicated when histories of childhood sexual abuse need to be considered. While family and social factors had powerful influences on coming out for all the participants, the emotional and behavioral strategies that each woman adapted in order to cope with long-term sequelae of CSA, also appeared to have considerable impact on the coming out process as well.",
  "description_provenance": [
    "Author Email: nanscha@comcast.net",
    "Advisor Email: drlynettelong1@aol.com",
    "Advisor Email: kerri-lynn.kriz@fcps.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: marcie@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:15Z (GMT). No. of bitstreams: 10 document2.pdf: 198019 bytes, checksum: fb76ffdb2328c50665e3a23a887d69cb (MD5) document3.pdf: 328813 bytes, checksum: 545426b5d3d0f88ae474a05c3d14abac (MD5) document5.pdf: 99007 bytes, checksum: 2e3dca38b154c1fa04b42a53dd0b5484 (MD5) document6.pdf: 85286 bytes, checksum: 2a12cb475c03e560a39a0e3b26b958a6 (MD5) document7.pdf: 72623 bytes, checksum: 5a5ca9eb0b38ecaa8353d332568bb44f (MD5) document8.pdf: 27979 bytes, checksum: ba16db2000fce14ad0751f139c6a183c (MD5) document9.pdf: 593019 bytes, checksum: 2d8e784fd61a8be48486c8844db71876 (MD5) document1.pdf: 19635 bytes, checksum: d5d93b73a3e8102d97c15ae9c7cd4561 (MD5) document10.pdf: 46932 bytes, checksum: fc8ed581dbc03621bc76e8621f529dc5 (MD5) document4.pdf: 195896 bytes, checksum: fe3a57b551d78387b6298aa0d22aded6 (MD5)   Previous issue date: 2005-03-15"
  ],
  "handle": "26443",
  "identifier_other": "etd-03162005-221640",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03162005-221640/",
  "identifier_uri": "http://hdl.handle.net/10919/26443",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "document2.pdf",
    "document3.pdf",
    "document5.pdf",
    "document6.pdf",
    "document7.pdf",
    "document8.pdf",
    "document9.pdf",
    "document1.pdf",
    "document10.pdf",
    "document4.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "sexual identity",
    "coming out",
    "lesbian",
    "childhood sexual abuse",
    "hermeneutic phenomenology"
  ],
  "title": "The Experience of Coming Out for Lesbians Sexually Abused in Childhood",
  "type": "Dissertation"
}