{
  "contributor_author": "Tottossy, Andrea Perry",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Rogers, Catherine S.",
    "Richards, Robert R.",
    "Byers, Larry"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:15Z",
  "date_adate": "2005-03-21",
  "date_available": "2014-03-14T20:08:15Z",
  "date_issued": "2005-03-14",
  "date_rdate": "2007-03-21",
  "date_sdate": "2005-03-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p> The hiring of teachers is one of the most important responsibilities of principals (Emley & Ebmeier, 1997; Place & Drake, 1994).  When errors in hiring occur, consequences are felt by staff, students, parents, community, and the overall operation and functioning of the school (Emley & Ebmeier, 1997).   </p><p>      Unfortunately, not much empirical research has been conducted to date to support how to hire quality teachers effectively.  \"The research to date has not sufficiently addressed questions such as (1) what criteria need to be assessed; (2) which of those criteria are judged to be the most important by those using them in the process; and (3) what variables influence principal priorities.\"  (Place & Drake, p. 87)    </p><p>  The implementation of the No Child Left Behind Act (NCLB, 2002) has mandated that all teachers meet the definition of being highly qualified.  This mandate poses unique challenges to principals in the identification of teachers who possess the characteristics considered essential in the teacher selection process.  The purpose of this study was to develop consensus among nationally recognized principals regarding the traits considered essential for teachers, the best interview questions to target these traits, and other sources utilized to identify these essential traits.  </p><p>      The research methodology that was used to develop consensus consists of a three-round Delphi study.  By definition, the Delphi technique is \"a group process involving an interaction between the researcher and a group of identified experts on a specified topic, usually through a series of questionnaires\" (Skutsch & Hall, 1973).  The knowledge and experiences of the panel of expert principals provided the underlying premise from which group consensus was built.</p>",
  "description_provenance": [
    "Author Email: atottossy@nps.k12.va.us",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: carogers@vt.edu",
    "Advisor Email: lbyers@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:15Z (GMT). No. of bitstreams: 1 TottossyFinal317PDF.pdf: 846020 bytes, checksum: 3cc78aeed4c1767af3e07a2c38cc8b86 (MD5)   Previous issue date: 2005-03-14"
  ],
  "handle": "26442",
  "identifier_other": "etd-03162005-170422",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03162005-170422/",
  "identifier_uri": "http://hdl.handle.net/10919/26442",
  "publisher": "Virginia Tech",
  "relation_haspart": "TottossyFinal317PDF.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "teacher selection",
    "teacher traits"
  ],
  "title": "Teacher Selection:  A Delphi Study",
  "type": "Dissertation"
}