{
  "contributor_author": "Alford, Shannon Recca",
  "contributor_committeechair": "Gillaspy, Glenda E.",
  "contributor_committeemember": [
    "McDowell, John M.",
    "Grabau, Elizabeth A.",
    "White, Robert H.",
    "Tu, Zhijian Jake"
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:08:17Z",
  "date_adate": "2009-04-08",
  "date_available": "2014-03-14T20:08:17Z",
  "date_issued": "2009-02-12",
  "date_rdate": "2012-03-27",
  "date_sdate": "2009-03-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Understanding how plants respond to stress is of importance, considering the increasing need to feed a growing population and supply its energy.  Plants have complex systems for detecting, and responding to stresses.  One stress-responsive system involves myo-inositol (Ins).  Ins is a precursor for cell wall components, inositol trisphosphate (Ins(1,4,5)P3) and phosphatidylinositol phosphate signaling molecules, and an alternate ascorbic acid (AsA) synthesis pathway.  The enzyme, myo-inositol oxygenase (MIOX) is encoded by four genes in Arabidopsis and catalyzes the first step of Ins catabolism producing D-glucuronic acid (DGlcA). <p> This research focuses on MIOX metabolism of Ins during plant growth and stress responses.  I have examined miox mutants for alterations in metabolism and signaling.  MIOX2 and MIOX4 expression patterns correlate with miox mutant root growth in varying nutrient conditions, and changes in flowering time.  In miox2 mutants, I found an increase in Ins in most tissues, which was accompanied by cold- and abscisic (ABA)- sensitivity; however, miox4 mutants are ABA- insensitive, and have a small increase of Ins in flowers.  MIOX2:GFP fusion protein accumulates in the cytoplasm and MIOX4:GFP accumulates in the cytoplasm and nucleus. <p> Overexpresser MIOX4+ plants provide a model system to examine how directing carbon from Ins into DGlcA impacts Ins levels and Ins signaling.  I have examined MIOX4+ plants for alterations in MIOX4 RNA and protein, and measured Ins by gas chromatography (GC).  My results indicate that MIOX4+ tissues are impacted differently by the MIOX4 transgene, with decreases in Ins after seed imbibition, and increased Ins levels later in development.  Ins depletion in seedlings was correlated with a decrease in Ins(1,4,5)P3.  To determine the impact of reducing Ins and Ins(1,4,5)P3 in MIOX4+ seedlings, I examined processes known to involve Ins(1,4,5)P3 signaling.  MIOX4+ seed have increased seed dormancy, NaCl-sensitivity, and ABA-insensitivity.  These results suggest MIOX affects Ins signaling in response to ABA.  Together, these data indicate that transcriptional control of MIOX2 and MIOX4 results in distinct roles in plant growth, and that MIOX2 and MIOX4 function in metabolic and signaling processes critical for growth, nutrient sensing, and stress responses.",
  "description_provenance": [
    "Author Email: sralford@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Advisor Email: egrabau@vt.edu",
    "Advisor Email: rhwhite@vt.edu",
    "Advisor Email: jaketu@vt.edu",
    "Advisor Email: gillaspy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:17Z (GMT). No. of bitstreams: 1 AlfordDissertation040109.pdf: 1401948 bytes, checksum: 7a7ddcdb9a22991bbd4306ff374268d4 (MD5)   Previous issue date: 2009-02-12"
  ],
  "handle": "26448",
  "identifier_other": "etd-03172009-121446",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03172009-121446/",
  "identifier_uri": "http://hdl.handle.net/10919/26448",
  "publisher": "Virginia Tech",
  "relation_haspart": "AlfordDissertation040109.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "inositol trisphosphate",
    "myo-inositol oxygenase",
    "gas chromatography",
    "Arabidopsis thaliana",
    "phosphatidylinositol",
    "ascorbic acid",
    "D-glucuronic acid"
  ],
  "title": "Molecular Characterization of Two myo-Inositol Oxygenases in Arabidopsis thaliana",
  "type": "Dissertation"
}