{
  "contributor_author": "Mukhopadhyay, Archana",
  "contributor_committeechair": "Kennelly, Peter J.",
  "contributor_committeemember": [
    "Larson, Timothy J.",
    "Potts, Malcolm",
    "Keenan, Thomas W."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:08:16Z",
  "date_adate": "2006-04-11",
  "date_available": "2014-03-14T20:08:16Z",
  "date_issued": "2006-02-10",
  "date_rdate": "2009-04-11",
  "date_sdate": "2006-03-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The predicted protein product of open reading frame slr0328 from Synechocystis sp. PCC 6803, SynPTP, possesses significant amino acid sequence similarity with known low molecular weight protein tyrosine phosphatases (PTPs). To determine the gross functional properties of this hypothetical protein, open reading frame slr0328 was cloned, and its predicted protein product was expressed in E. coli. The recombinant protein, SynPTP, was purified by metal ion column chromatography. The catalytic activity of SynPTP was examined toward several exogenous protein substrates that had been phosphorylated on either tyrosine residues or serine residues. SynPTP exhibited phosphatase activity toward tyrosine phosphorylated protein substrates (Vmax toward phosphotyrosyl 32P-casein was 1.5 nmol/min/mg). However, no phosphatase activity was detected toward serine phosphorylated protein substrates. SynPTP displayed phosphohydrolase activity toward several organophosphoesters including para-nitrophenyl phosphate (p-NPP), beta-napthyl phosphate and phosphotyrosine but not toward alpha-napthyl phosphate, phosphoserine, or phosphothreonine. Kinetic analysis indicated that the Km (0.6 mM) and Vmax (3.2 mmole/min/mg) values for SynPTP toward pNPP are similar to those of other known bacterial low molecular weight PTPs. The protein phosphatase activity of SynPTP was inhibited by sodium orthovanadate, a known inhibitor for tyrosine phosphatases, but not by okadaic acid, an inhibitor for many serine/threonine phosphatases. Mutagenic alteration of the predicted catalytic cysteine, Cys7, to serine abolished enzyme activity. Several phosphotyrosine containing proteins were detected from the whole cell extracts of Synechocystis sp. PCC 6803 through immunoreactions using anti-phosphotyrosine antibody. SynPTP was observed to dephosphorylate three of these proteins in vitro. Two of these proteins were identified by peptide-mass fingerprinting analysis, as PsaD (photosystem I subunit II) and CpcD (phycocyanin rod linker protein). In addition, several phosphotyrosine proteins were detected from the soluble and membrane fractions of Synechocystis sp. PCC 6803 cell extracts by in vitro substrate trapping as potential endogenous substrates of SynPTP. Two of these proteins were identified as the alpha and beta subunits of phycocyanin. We therefore speculate that SynPTP might be involved in the regulation of photosynthesis in Synechocystis sp. PCC 6803.",
  "description_provenance": [
    "Author Email: amukhopa@vt.edu",
    "Advisor Email: tilarson@vt.edu",
    "Advisor Email: geordie@vt.edu",
    "Advisor Email: twkeenan@vt.edu",
    "Advisor Email: pjkennel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:16Z (GMT). No. of bitstreams: 1 Archana-Dissertation.pdf: 1466883 bytes, checksum: f1c45b2a985ad8d99a5aeafcb5ffbec7 (MD5)   Previous issue date: 2006-02-10"
  ],
  "handle": "26447",
  "identifier_other": "etd-03172006-054826",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03172006-054826/",
  "identifier_uri": "http://hdl.handle.net/10919/26447",
  "publisher": "Virginia Tech",
  "relation_haspart": "Archana-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Protein tyrosine phosphorylation",
    "Phycocyanin",
    "Protein tyrosine kinases",
    "Low molecular weight protein tyrosine phosphatases"
  ],
  "title": "Identification of a Low Molecular Weight Protein Tyrosine Phosphatase and Its Potential Physiological Substrates in Synechocystis sp. PCC 6803",
  "type": "Dissertation"
}