{
  "contributor_author": "Newby, JoeAnn E.",
  "contributor_committeecochair": "Earthman, Glen I.",
  "contributor_committeemember": [
    "York, Jane T.",
    "Carlton, Patrick W.",
    "Parson, Stephen R.",
    "Richards, Robert R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:18Z",
  "date_adate": "1999-04-02",
  "date_available": "2014-03-14T20:08:18Z",
  "date_issued": "1999-02-02",
  "date_rdate": "1999-04-02",
  "date_sdate": "1999-03-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to assess job satisfaction of middle school principals in Virginia as measured by the Minnesota Satisfaction Questionnaire (MSQ).  The primary question addressed by the study was:  What is the general satisfaction level of middle school principals in Virginia as measured by the Minnesota Satisfaction Questionnaire?  In addition to the primary question, three sub-questions were addressed by the study.  They were: a) What is the general satisfaction level according to the demographic variables gender, age, degree, experience, school location, and school size? b)  what is the satisfaction level for each of the 20 dimensions of the job measured by the MSQ?  and  c) what is the satisfaction level for the 20 dimensions of the job according to the demographic variables gender, age, degree, experience, school location, and school size? \tOne hundred eighty-eight middle school principals in Virginia selected from the 1997-98 Virginia Educational Directory were surveyed with the Individual Data Sheet and the Minnesota Satisfaction Questionnaire.  Demographic data pertaining to gender, age, experience, degree, school location, and school size were collected through use of the Individual Data Sheet.  The 1967 Long-Form Minnesota Satisfaction Questionnaire was used to measure job satisfaction.  This instrument utilized a 20-dimension Likert-type scale with five response alternatives ranging from \"Not Satisfied\" (weighted 1) to \"Extremely Satisfied\" (weighted 5).  On this scale, the general satisfaction score for the respondents resulted in a mean of 3.65 (SD= .57) indicating that these principals are \"Satisfied\" (3.00-3.99) with their jobs.  According to the demographic variables, all general satisfaction scores were within the \"Satisfied\" range.  The mean scores for the 20 dimensions ranged from  \"Slightly Satisfied\" (2.00-2.99) to \"Very Satisfied\" (4.00-4.99). Compensation ranked the lowest in the hierarchy ( M=2.83, SD=.94), and Social Service ranked the highest ( M=4.19, SD= .73).  Demographically, females were significantly more satisfied with Activity and Variety than males; younger and older principals were significantly more satisfied with Activity than middle aged principals; principals with educational specialist degrees were significantly more satisfied with Achievement than doctorate and masters principals; principals from suburban schools were significantly more satisfied with Compensation, Supervision, and Working Conditions than urban and rural principals, and principals at large schools were significantly more satisfied with General Satisfaction, Advancement, and Security than principals from small schools. \tRecommendations for further research included conducting a study of principal satisfaction and student performance; conduct a comparative investigation of elementary, middle and secondary principal satisfaction; investigate principal satisfaction and school size, and study job satisfaction of  principals using the interview technique or an open-ended survey instrument.",
  "description_provenance": [
    "Author Email: jnewby1@gte.net",
    "Advisor Email: earthman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:18Z (GMT). No. of bitstreams: 1 BIBLIO2.PDF: 325361 bytes, checksum: 01f98a8522ad754978447bbd1f355d69 (MD5)   Previous issue date: 1999-02-02"
  ],
  "handle": "26458",
  "identifier_other": "etd-031899-164059",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-031899-164059/",
  "identifier_uri": "http://hdl.handle.net/10919/26458",
  "publisher": "Virginia Tech",
  "relation_haspart": "BIBLIO2.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Principals",
    "Middle School",
    "Job Satisfaction"
  ],
  "title": "Job Satisfaction of Middle School Principals in Virginia",
  "type": "Dissertation"
}