{
  "contributor_author": "Brown, Gregory Allen",
  "contributor_committeechair": "Tripp, Norman Wayne",
  "contributor_committeemember": [
    "Creighton, Theodore B.",
    "McCracken, Robert C.",
    "Worner, Wayne Dempsey"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:18Z",
  "date_adate": "2010-04-07",
  "date_available": "2014-03-14T20:08:18Z",
  "date_issued": "2010-03-17",
  "date_rdate": "2010-04-07",
  "date_sdate": "2010-03-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to determine whether there are differences in the perceptions of the importance of identified servant leadership characteristics for high school principals held by teachers in schools located in two diverse communities. Servant leadership is a practical philosophy supporting people who serve first in their life and work (Frick, 2004, p. 8). Like other leadership philosophies, the practice of servant leadership may be influenced by variables that are particular to the environment in which it is employed (Howard, 2005; Kelly & Williamson, 2006; Lambert, 2004).<p> This research is a case study involving two purposively chosen communities.  Participants in the study were teachers from high schools in two diverse communities, one located in urban coastal Virginia and the other located in rural southwestern Virginia.  A similar number of participants were obtained from the two communities to assure appropriate representation for data analysis. <p> A 48-item questionnaire using a Likert-type scale was used as the research instrument. The questionnaire was constructed using the servant leadership characteristics and behaviors identified by Abel (2000).  The questionnaire was offered to all teachers in both communities. <p> A confirmatory factor analysis was used to group the 48 items into 12 factors.  The data secured were compiled and analyzed to determine differences in teachersâ   perceptions of the importance of identified characteristics of servant leadership in principals in the two communities. While all the identified characteristics were found to be important, the analysis indicated statistically significant (p< .01) differences did exist for the factor represented the servant leadership characteristics of building community, communicating vision, and empowering people.  For this factor, the population from the urban community had a higher mean score (3.78 compared to 3.49) and smaller standard deviation (.29 compared to .49) than the population from the rural community.<p> The implications of the study are that current school leaders might be able to better manage and lead their school communities if they adapted their practice of servant leadership to the particular characteristics of their communities. Similarly, principal preparation programs might incorporate the findings into their curricula.",
  "description_provenance": [
    "Author Email: gregb66@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: rmccracke@radford.edu",
    "Advisor Email: wworner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:18Z (GMT). No. of bitstreams: 1 BROWN_GA_D_2010.pdf: 660331 bytes, checksum: d9834a2a603761d73e5f37ac581c2775 (MD5)   Previous issue date: 2010-03-17"
  ],
  "handle": "26457",
  "identifier_other": "etd-03182010-211048",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03182010-211048/",
  "identifier_uri": "http://hdl.handle.net/10919/26457",
  "publisher": "Virginia Tech",
  "relation_haspart": "BROWN_GA_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Leadership",
    "Transformational Leadership",
    "Servant Leadership"
  ],
  "title": "TEACHERSâ   PERCEPTIONS OF THE IMPORTANCE OF IDENTIFIED SERVANT LEADERSHIP CHARACTERISTICS FOR HIGH SCHOOL PRINCIPALS IN TWO DIVERSE COMMUNITIES",
  "type": "Dissertation"
}