{
  "contributor_author": "Hargreaves, Belinda Jane",
  "contributor_committeechair": "Kronfeld, David S.",
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:08:18Z",
  "date_adate": "2002-04-01",
  "date_available": "2014-03-14T20:08:18Z",
  "date_issued": "2002-03-05",
  "date_rdate": "2003-04-01",
  "date_sdate": "2002-03-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Two times are critical for the horse ¾ the first few days of its life and the last few moments of a race.  Vitamin E is critical in regard to immune competence in the first and antioxidant status in the latter.  Studies conducted at the Middleburg Agricultural Research and Extension (MARE) Center include the development of horse feeds that replace sugar and starch with fat and fiber.  The previous fat source of the pasture supplement under development was corn oil, which contains much vitamin E, was replaced with a cereal by product, which contains relatively little.  Vitamin E has been studied in horses to a limited degree but not in grazing Thoroughbreds, thus the MARE Center gave me the opportunity to study vitamin E in Thoroughbred mares and foals.  Middleburg is located in the Blue Ridge Mountains on Northern Virginia close to the site of one of the toughest endurance races in the world.  This allowed me the opportunity to study vitamin E and antioxidant status in the horse during endurance racing. \tInitial studies of vitamin E supplementation to mares during the last trimester of gestation were disconcerting with no changes in serum concentrations of a-tocopherol (vitamin E).  Studies conducted during the post-partum period revealed evidence of responses to vitamin E supplementation, as increased a-tocopherol concentrations were observed in mares' milk and in foal serum.  Foals are born with virtually no circulatory antibodies and the supplementation of a synthetic form of vitamin E to mares demonstrated an increased passive transfer of immunoglobulins to foals.  Natural vitamin E has shown a greater bioavailability than synthetic forms, in other species and was tested here at the MARE Center on mares.  A greater passive transfer of immunoglobulins was observed with natural vitamin E supplementation compared with the synthetic forms, with immunoglobulin M concentrations in foal serum remaining higher for a longer period after birth compared to foals of non-supplemented mares.  The transfer of a-tocopherol via the milk was also increased in concentration and duration in mares supplemented with natural vitamin E.     Bioavailability of five oral forms of vitamin E (3 natural and 2 synthetic) were tested and one natural form was also administered intravenously so that clearance of vitamin E could be used to calculate the efficiency of absorption of the oral forms.  Efficiency of absorption for oral treatments was not determined because of the slow turnover time of the intravenously administered vitamin E, which confounded all subsequent baseline serum a-tocopherol concentrations.  Of the salvageable data, serum a-tocopherol concentrations were higher in grouped treatments at 9 and 12 h post dosing.  Lipid fractions revealed possible insufficient absorption of the oral doses of vitamin E and possibly tissue saturation following intravenous doses of vitamin E.  Serum concentrations of a-tocopherol were generally higher following natural forms of oral vitamin E administration.   \tAs vitamin E is the most important antioxidant in cells, it is often supplemented to endurance horses competing in 80 and 160 km races.  Vitamin E protects lipid cell membranes from peroxidation by free radicals, which are increased during strenuous exercise resulting in oxidative stress.  The antioxidant status of horses is severely tested during endurance racing and so a study was conducted to monitor changes in circulating antioxidants during three endurance races.  Interesting novel findings in the horse were the maintenance of serum a-tocopherol and the depletion of erythrocyte glutathione and plasma ascorbate during two 80 km and one 160 km races.  Associations were found between increased muscle cell enzyme leakage and decreased antioxidant status during endurance exercise and although associations do not prove a causation of oxidative stress, they do provide motivation to search for a cause and it is tempting to propose that oxidative stress damaged muscle cell membranes in endurance horses.  Further, these findings propose a connection between muscle cell damage and a new form of exertional rhabdomyolysis (ER) that has been observed in endurance horses, where oxidative fibers are damaged compared to the typical glycolytic fiber damage associated with known forms or ER. An increased understanding of vitamin E utilization in the horse will improve the health and welfare of all horses, but especially newborn foals and the athletic endurance horses.",
  "description_provenance": [
    "Author Email: bhargrea@vt.edu",
    "Advisor Email: kronfeld@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:18Z (GMT). No. of bitstreams: 1 BJHdissertnbjpdf.pdf: 688925 bytes, checksum: 84c4ad50dc7d11a60b6d7650189668db (MD5)   Previous issue date: 2002-03-05"
  ],
  "handle": "26459",
  "identifier_other": "etd-03192002-155822",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03192002-155822/",
  "identifier_uri": "http://hdl.handle.net/10919/26459",
  "publisher": "Virginia Tech",
  "relation_haspart": "BJHdissertnbjpdf.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "endurance exercise",
    "bioavailability",
    "antioxidants",
    "horse",
    "vitamin E"
  ],
  "title": "Vitamin E Status of Thoroughbred Horses and the Antioxidant Status of Endurance Horses",
  "type": "Dissertation"
}