{
  "contributor_author": "Stith, Dettrick Lamont",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Brown, Michael D.",
    "Jones, Russell T.",
    "Burton, John K.",
    "Sanders, Reliford T. Jr."
  ],
  "contributor_department": "Educational Cirriculum and Instruction (Health Promotion)",
  "date_accessioned": "2014-03-14T20:08:17Z",
  "date_adate": "2006-04-24",
  "date_available": "2014-03-14T20:08:17Z",
  "date_issued": "2006-02-17",
  "date_rdate": "2009-04-24",
  "date_sdate": "2006-03-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to investigate time commitment, self-efficacy and social environment as it relates to physical activity in a selected sample of hypertensive African Americans. In addition, this study focused on identifying additional research areas in regards to hypertensive African Americans. This study utilized a quantitative method for data collection. The survey instrument utilized contained the following subtopics: (1) demographics;(2)hypertension risk factors;(3) prevention and treatment;(4)hypertension knowledge, and (5)physical activity participation.      Data collected did not support the hypotheses or information contained in the review of literature. It was revealed from data collection that 69% of the respondents (n=90) disagreed with the survey statement that â  exercise takes too much of my time (time commitment).â   Fifty-two percent of the respondents (n=68) either disagreed or strongly disagreed with the statement â  exercise tires me (self-efficacy belief).â   Forty-three percent of the respondents (n=56) disagreed with the statement â  my spouse (or significant other) does not encourage exercise.â          There is a need for future investigation to examine how additional barriers to physical effect activity African Americans individually, and is there a culmination of specific barriers to physical activity that work in conjunction to inhibit African Americans to engage in physical activity.",
  "description_provenance": [
    "Author Email: dstith@vt.edu",
    "Advisor Email: mdbrown@umd.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: rtjones@vt.edu",
    "Advisor Email: jburtion@vt.edu",
    "Advisor Email: resande1@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:17Z (GMT). No. of bitstreams: 1 DLStithDissertation2006.pdf: 429116 bytes, checksum: 80560f5c30d46c14250428836c9e91e3 (MD5)   Previous issue date: 2006-02-17"
  ],
  "handle": "26452",
  "identifier_other": "etd-03182006-195546",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03182006-195546/",
  "identifier_uri": "http://hdl.handle.net/10919/26452",
  "publisher": "Virginia Tech",
  "relation_haspart": "DLStithDissertation2006.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cardiovascular disease",
    "obesity",
    "body mass index",
    "exercise",
    "minorities"
  ],
  "title": "Time Commitment, Self-Efficacy, Social Environment and the Physical Activity Participation of Selected Hypertensive African Americans",
  "type": "Dissertation"
}