{
  "contributor_author": "Cobb, Jr., Robert",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Burton, John K.",
    "Holmes, Glen A.",
    "Glenz, Nancy",
    "Lockee, Barbara B."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:20Z",
  "date_adate": "2003-03-25",
  "date_available": "2014-03-14T20:08:20Z",
  "date_issued": "2003-03-19",
  "date_rdate": "2004-03-26",
  "date_sdate": "2003-03-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated self-regulated learning behaviors and their relationships with academic performance in web-based courses. The participants (n = 106) were distance learners taking humanities and technical coursed offered by a community college in Virginia. Data was collected using 28 items from the Motivated Strategies for Learning Questionnaire and 5 demographically related items. Data analysis included factor analyses, multivariate analysis of variance, and regression analyses. The employment of self-regulated learning behaviors differed between humanities and technical courses (p = .0138). Time and study environment management (p = .0009) and intrinsic goal orientation (p = .0373) categories reported significant findings in their relationship to academic performance. The factors affiliated with time and study environment management and intrinsic goal orientation were used as predictors in the development of a mathematical formula used to predict academic success in a web-based course. These predictors explain 21 percent of the variance in the academic success rating calculated using the mathematical formula developed from this study.",
  "description_provenance": [
    "Author Email: rcobbjr@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: gholmes@vt.edu",
    "Advisor Email: glenzn@ncat.edu",
    "Advisor Email: lockeeb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:20Z (GMT). No. of bitstreams: 1 srlonline_dissertation.pdf: 711993 bytes, checksum: d10a1dca18c92e8297fd2b8cbd8fe2e4 (MD5)   Previous issue date: 2003-03-19"
  ],
  "handle": "26469",
  "identifier_other": "etd-03212003-130332",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03212003-130332/",
  "identifier_uri": "http://hdl.handle.net/10919/26469",
  "publisher": "Virginia Tech",
  "relation_haspart": "srlonline_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "distance learning",
    "distance education",
    "self-regulation",
    "self-regulated learning"
  ],
  "title": "The relationship between self-regulated learning behaviors and academic performance in web-based courses",
  "type": "Dissertation"
}