{
  "contributor_author": "Greer, Janet Agnes",
  "contributor_committeechair": "Mallory, Walter D.",
  "contributor_committeemember": [
    "Twiford, Travis W.",
    "Mondak, Michael J.",
    "Glenn, William J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:19Z",
  "date_adate": "2012-04-10",
  "date_available": "2014-03-14T20:08:19Z",
  "date_issued": "2012-03-01",
  "date_rdate": "2012-04-10",
  "date_sdate": "2012-03-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The American education system must utilize collaboration to meet the challenges and demands our culture poses for schools. Deeply rooted processes and structures favor teaching and learning in isolation and hinder the shift to a more collaborative paradigm. Professional learning communities (PLCs) support continuous teacher learning, improved efficacy, and program implementation. The PLC provides the framework for the development and enhancement of teacher collaboration and teacher collaboration develops and sustains the PLC. The interpersonal factors that influence collaboration make it difficult to implement and preclude the use of any systematic directions to develop a PLC successfully. However, research has identified emerging strategies that could guide the development of collaborative cultures for school improvement. The researcher designed this case study to describe collaboration in the PLC of an elementary school. The study focuses on collaborative behaviors, perceptions, influences, barriers, and strategies present in the school. The researcher utilized the Professional Learning Community Organizer (Hipp & Huffman, 2010) in the analysis of the data. Hipp, Huffman and others continued the research started by Hord (1990) and identified PLC dimensions and behaviors associated with those dimensions. The PLCO included behaviors aligned with the initiating, implementing, and sustaining phases of each dimension of a PLC. Structure and process, trust and accountability, and empowerment emerged as important themes in the observed PLC. The sequential path to teacher empowerment began with the development of structure and process. Teachers developed trust in each other by demonstrating accountability required by those structures and processes. Trust provided opportunities for risk taking and leadership to emerge. The teachers and administrators demonstrated their commitment   to the vision and worked collaboratively for the learning success of all students. The data provided evidence of administrators and teachers making decisions to solve problems and improve instruction based on the vision. The PLC of the elementary school observed demonstrated development at the implementing and sustaining levels. The teachers and administrators worked collaboratively over time to improve teacher practice resulting in improved student learning. The opportunity to utilize the PLC for continuous growth by challenging the new norms and embracing risk taking remains.",
  "description_provenance": [
    "Author Email: greerja@pwcs.edu",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: wglenn@vtg,edu",
    "Made available in DSpace on 2014-03-14T20:08:19Z (GMT). No. of bitstreams: 3 Greer_JA_2012_IRB.pdf: 462841 bytes, checksum: 01c8b6b612185eb049efedc4a38be187 (MD5) Greer_JA_D_2012.pdf: 999181 bytes, checksum: 1ff6d996a6b55930c3548dbf671be4e7 (MD5) Greer_JA_2011_IRB.pdf: 56281 bytes, checksum: b910833b202669309b20a5619a81f973 (MD5)   Previous issue date: 2012-03-01"
  ],
  "handle": "26463",
  "identifier_other": "etd-03192012-174517",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03192012-174517/",
  "identifier_uri": "http://hdl.handle.net/10919/26463",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Greer_JA_2012_IRB.pdf",
    "Greer_JA_D_2012.pdf",
    "Greer_JA_2011_IRB.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "collaboration",
    "professional learning community"
  ],
  "title": "Professional Learning and Collaboration",
  "type": "Dissertation"
}