{
  "contributor_author": "Smith, Judith",
  "contributor_committeechair": "Parson, Stephen R.",
  "contributor_committeemember": [
    "Byers, Larry",
    "Johnson, Paula A.",
    "Krill, Cecelia W.",
    "Niles, Jerome A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:18Z",
  "date_adate": "2003-03-27",
  "date_available": "2014-03-14T20:08:18Z",
  "date_issued": "2003-02-26",
  "date_rdate": "2004-03-27",
  "date_sdate": "2003-03-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "According to the U. S. Department of Education (National Commission on Teaching and Americaâ  s Future, 1996), U.S. public schools will hire an estimated two million teachers within the decade. The experience of the beginning teacher is a stressful one with more than 40% of new teachers choosing to leave the profession during the first three years. One promising practice to address this problem is mentoring, an expert teacher helping the beginner one-on-one. The heart of mentoring is the mentor/mentee relationship. This study investigated the nature of the beginning teacher/mentor relationship and the forces that affected that relationship. The methodology was a cross-case analysis of three pairs of mentor/mentees at the elementary level. The data were collected from focus groups, teacher interviews, observations, email responses, and document review. Data were analyzed using a constant comparative method examining emerging themes across all three cases. Trustworthiness of the research was fostered through multiple sources of data, practice interviews, oversight by peers and committee, participant review, and description of themes in the participantsâ   own words. The data revealed that the mentor/mentee pairs developed very strong relationships grounded on reassurance, collaboration, reciprocity, friendship, problem solving, multi-layered support, and informal structures for getting together. Positive forces affecting the relationships included personality of the participants, perception of mentor role, closeness of age, proximity of classrooms, and common teaching assignment. Time constraints acted as a negative force that presented many challenges addressed by mentors and their mentees in very unique ways.",
  "description_provenance": [
    "Author Email: jjsmith64@earthlink.net",
    "Advisor Email: lbyers@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: pjohnso6@gmu.edu",
    "Advisor Email: cwkrill@fcps.edu",
    "Advisor Email: niles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:18Z (GMT). No. of bitstreams: 1 finalED.pdf: 743146 bytes, checksum: 31b80dabec4bcb96fd2f92cba49425a1 (MD5)   Previous issue date: 2003-02-26"
  ],
  "handle": "26460",
  "identifier_other": "etd-03192003-105806",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03192003-105806/",
  "identifier_uri": "http://hdl.handle.net/10919/26460",
  "publisher": "Virginia Tech",
  "relation_haspart": "finalED.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "beginning teachers",
    "induction",
    "mentoring"
  ],
  "title": "Forces Affecting Beginning Teacher/Mentor Relationships in a Large Suburban School System",
  "type": "Dissertation"
}