{
  "contributor_author": "Pressman, Sue Ellen",
  "contributor_committeechair": "Paritzky, Richard S.",
  "contributor_committeemember": [
    "Danek, Marita M.",
    "McDaniels, Carl O.",
    "Lichtman, Marilyn V.",
    "Mckeen, Ronald L."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:08:19Z",
  "date_adate": "1999-04-20",
  "date_available": "2014-03-14T20:08:19Z",
  "date_issued": "1999-01-21",
  "date_rdate": "1999-04-20",
  "date_sdate": "1999-03-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This national study was undertaken to learn about the characteristics and demographics of Deaf entrepreneurs and small business owners. Descriptive research methodology was to obtain data from a clearly defined population comprising Deaf entrepreneurs and small business owners. The researcher designed a questionnaire to answer six research questions. Study results were based on nationwide responses from 86 deaf men and women. Implications for career counseling were generated from participant responses and the researcher's extensive career counseling experience with the Deaf population. Data collected from participant responses determined the characteristics and demographics, and provided the basis for developing recommendations for counseling, training, and educational tools that could be used by others with similar career aspirations.       Study results showed that the majority of respondents started their business before the age of 35, had been in business for more than 10 years, came from residential and/or mainstream school settings, and had earned at least a Bachelor degree from a vast range of accredited colleges and universities      Most respondents were born deaf to hearing families and used American Sign Language. However, in business the majority used voice and writing with hearing people.  The most frequently used communication aids in business were telephone relay services, electronic mail systems, and sign language interpreters.      The study sought insight into respondent's career development and identified influential role models and mentors at various career stages. In the early stages of career development family and teachers served as the most influential role models.  However, respondent's identified \"friends\" as the most influential role model when it came to starting their business.      Entrepreneurial data revealed that types of businesses varied, with the majority of business owners employing hearing people.  Most respondents invested their personal savings to launch their business and conducted business in the private sector.  Two frequently reported motivations for going into business were \"desire to be their own boss\" and \"to earn more money.\"  In the start-up phase of their business, most needed more help with marketing, advertising, writing business plans and identifying funding sources.  When asked to express, in their own words, their greatest challenge in starting their businesses, frequent responses included \"proving to hearing people that a deaf person can run a business\" and \"communicating with hearing customers.\"       The following summarizes the implications for career counseling. Based on the results of the study it was suggested that Deaf women be given special attention; counselors encourage clients to continue their education beyond high school, and to work before launching their business. Participants in the study suggested that developing strong interests and skills were essential, and that voice was used as a primary communication tool in business. When appropriate, counselors may hold this population as a model to others, demonstrating that deafness alone is not a barrier to career aspirations.  An additional technique career counselors may find helpful, is describing the characteristics of the typical Deaf business owner who participated in this study.  The typical Deaf business owner who participated in this study was an entrepreneur who raised his/her own money from personal savings, had hearing employees, and conducted business in the private sector with mostly hearing people.",
  "description_provenance": [
    "Author Email: SEPressman@aol.com",
    "Advisor Email: paritsky@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:19Z (GMT). No. of bitstreams: 1 finaldissertation.pdf: 406201 bytes, checksum: b59295718f4873c45e204e792910c86e (MD5)   Previous issue date: 1999-01-21"
  ],
  "handle": "26466",
  "identifier_other": "etd-032099-145756",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-032099-145756/",
  "identifier_uri": "http://hdl.handle.net/10919/26466",
  "publisher": "Virginia Tech",
  "relation_haspart": "finaldissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Counseling",
    "Small Business Owners",
    "Deaf Entrepreneurs",
    "Career Development"
  ],
  "title": "A National Study of Deaf Entrepreneurs and Small Business Owners: Implications for Career Counseling",
  "type": "Dissertation"
}