{
  "contributor_author": "Francis, Gerald",
  "contributor_committeechair": "Boroyevich, Dushan",
  "contributor_committeemember": [
    "Lesko, John Jack",
    "Burgos, Rolando",
    "Baumann, William T.",
    "Tranter, William H."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:08:19Z",
  "date_adate": "2010-05-10",
  "date_available": "2014-03-14T20:08:19Z",
  "date_issued": "2010-01-25",
  "date_rdate": "2013-05-10",
  "date_sdate": "2010-03-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation presents work conducted at the Center for Power Electronics Systems (CPES) at Virginia Polytechnic Institute and State University. Chapter 1 introduces the concept of impedance measurement, and discusses previous work on this topic.  This chapter also addresses issues associated with impedance measurement. Chapter 2 introduces the analyzer architecture and the proposed algorithm. The algorithm involves locking on to the voltage vector at the point of common coupling between the analyzer and the system via a PLL to establish a D-Q frame.  A series of sweeps are performed, injecting at least two independent angles in the D-Q plane, acquiring D- and Q-axis voltages and currents for each axis of injection at the point of interest. Chapter 3 discusses the analyzer hardware and the criteria for selection.  The hardware built ranges from large-scale power level hardware to communication hardware implementing a universal serial bus.  An eight-layer PCB was constructed implementing analog signal conditioning and conversion to and from digital signals with high resolution.  The PCB interfaces with the existing Universal Controller hardware. Chapter 4 discusses the analyzer software.  Software was written in C++, VHDL, and Matlab to implement the measurement process.  This chapter also provides a description of the software architecture and individual components.  Chapter 5 discusses the application of the analyzer to various examples.  A dynamic model of the analyzer is constructed, considering all components of the measurement system.  Congruence with predicted results is demonstrated for three-phase balanced linear impedance networks, which can be directly derived based on stationary impedance measurements.  Other impedances measured include a voltage source inverter, Vienna rectifier, six-pulse rectifier and an autotransformer-rectifier unit.",
  "description_provenance": [
    "Author Email: jerryf@vt.edu",
    "Advisor Email: jlesko@exchange.vt.edu",
    "Advisor Email: dushan@vt.edu",
    "Advisor Email: baumann@vt.edu",
    "Advisor Email: btranter@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:19Z (GMT). No. of bitstreams: 1 FRANCIS_G_D_2010.pdf: 4147019 bytes, checksum: 4a4277006daf24814103d63faaaf8be7 (MD5)   Previous issue date: 2010-01-25"
  ],
  "handle": "26462",
  "identifier_other": "etd-03192010-150706",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03192010-150706/",
  "identifier_uri": "http://hdl.handle.net/10919/26462",
  "publisher": "Virginia Tech",
  "relation_haspart": "FRANCIS_G_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Three Phase AC Systems",
    "Impedance Measurement",
    "D-Q Coordinates",
    "Rotating Coordinate Systems",
    "Power Electronics",
    "Transfer Functions"
  ],
  "title": "An Algorithm and System for Measuring Impedance in D-Q Coordinates",
  "type": "Dissertation"
}