{
  "contributor_author": "Balfour, David Leigh",
  "contributor_committeechair": "Heath, Alan G.",
  "contributor_committeemember": [
    "Turner, Bruce J.",
    "Keenan, Thomas W.",
    "Angermeier, Paul L.",
    "McNabb, F. M. Anne"
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:08:19Z",
  "date_adate": "2000-04-17",
  "date_available": "2014-03-14T20:08:19Z",
  "date_issued": "1999-12-01",
  "date_rdate": "2001-04-17",
  "date_sdate": "2000-03-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Hypoxia refers to any condition in which the water is less than fully saturated with oxygen.  Although it is generally accepted that adults are more tolerant of hypoxic conditions than larval stages, there is little information to support this assumption.  To determine whether reduced concentrations of dissolved oxygen (DO) affect fishes differently during various early life stages, I examined the responses of two species of fish (fathead minnows (Pimephales promelas) and rainbow trout (Oncorhynchus mykiss)) exposed to low dissolved oxygen concentrations at different ages during the first 100 days post-hatch. The changes in oxygen requirements and respiratory patterns that occur during ontogeny and exposure to hypoxia were observed.  The results of this study suggest that the early larval stages appear to be at least as tolerant of short-term exposure to low dissolved oxygen concentrations as the older, more developed stages.  Fathead minnows underwent a gradual transition from being metabolic conformers to regulators during development.  Hemoglobin appeared to be playing a larger role in oxygen supply in the early post-hatch trout than in the minnows.  Fathead minnow larvae produced relatively low concentrations of lactate upon exposure to hypoxia.  Conversely, rainbow trout larvae exhibited significant increases in lactate concentration under similar conditions.  This implies that there is a threshold oxygen concentration below which trout larvae utilize anaerobic metabolism to provide additional energy.  Lactate dehydrogenase activity increased as the rainbow trout larvae aged, suggesting that they develop an anaerobic capacity which could be used to provide additional energy during hypoxia.  The minnows did not exhibit this increase in activity. The ability of larval fishes to detect and avoid hypoxic conditions was also examined.  The overall trends suggest that throughout this period of development, both fish species gradually leave an area as the dissolved oxygen concentration decline.  Both species appeared to leave the hypoxic areas with deliberate motions, indicating that a directed sensor system allowed them to detect oxygen gradients.  The results suggest that a combination of physiological, biochemical, and behavioral mechanisms may allow fishes to cope with hypoxia.",
  "description_provenance": [
    "Author Email: dbalfour@vt.edu",
    "Advisor Email: aheath@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:19Z (GMT). No. of bitstreams: 1 etdprint2.pdf: 343215 bytes, checksum: 31080bad64b8f88069edc52a880fd393 (MD5)   Previous issue date: 1999-12-01"
  ],
  "handle": "26467",
  "identifier_other": "etd-03212000-16120002",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03212000-16120002/",
  "identifier_uri": "http://hdl.handle.net/10919/26467",
  "publisher": "Virginia Tech",
  "relation_haspart": "etdprint2.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Citrate Synthase",
    "Avoidance Behavior",
    "Larval Fishes",
    "Lactate Dehydrogenase",
    "Ontogeny",
    "Hypoxia",
    "Oxygen Consumption",
    "Lactate"
  ],
  "title": "Ontogenetic Changes and Environmental Hypoxia: Responses of Two Fish Species to Low Oxygen Concentrations at Early Life Stages",
  "type": "Dissertation"
}