{
  "contributor_author": "McDonald, Sharon Angella",
  "contributor_committeecochair": [
    "Tolin, Sue A.",
    "Nault, Brian A."
  ],
  "contributor_committeemember": [
    "Pfeiffer, Douglas G.",
    "Mack, Timothy P.",
    "Nault, Lowell R."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:08:20Z",
  "date_adate": "2001-03-22",
  "date_available": "2014-03-14T20:08:20Z",
  "date_issued": "2001-02-22",
  "date_rdate": "2002-03-22",
  "date_sdate": "2001-03-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Production of hot peppers, Capsicum spp., in Jamaica is constrained by the aphid-transmitted potyviruses, tobacco etch virus (TEV) and potato virus Y (PVY).  The virus epidemiology was not understood and no effective virus management system existed for these viruses.  This study sought to identify possible management strategies for aphid-transmitted viruses of hot peppers in Jamaica, using TEV and Capsicum chinense, var. 'Scotch Bonnet' and 'West Indian Red', as models.  Field spread of TEV to pepper was mainly by secondary spread from primary infections.  Secondary infections were spatially correlated to primary infections for up to 25 meters.  Natural infections of TEV were associated with aphid flight activity.  Over 30 species of aphids were collected on pepper farms in St. Catherine parish.  These aphids included five known vectors of TEV, Aphis gossypii Glover, A. craccivora Koch, A. spiraecola Patch, Lipaphis erysimi Hille Ris Lambers and M. persicae (Sulzer), and 12 new records for Jamaica, Aphis amaranthi Holman, Brachycaudus helichrysi (Kaltenbach),Capitophorus hippophaes (Walker), Geopemphigus floccosus (Moreira), Hysteroneura setariae (Thomas), Lipaphis erysimi Hille Ris Lambers, Rhopalosiphum padi (Linnaeus), Schizaphis graminum (Rondani), Schizaphis rotundiventris (Signoret), Trichosiphonaphis poligoni (van der Goot), Uroleucon ambrosiae complex (Thomas) and Uroleucon pseudoambrosiae (Olive).  A. amaranthi and U. ambrosiae were associated with TEV spread.  Weeds on and near farms influenced the abundance and species of aphids captured.  West Indian Red pepper showed tolerance to TEV.  Scotch Bonnet pepper yield reduction was greater if plants were infected with TEV during the vegetative stage through flower initiation rather than after the start of fruit set.  Stylet oil and reflective mulch used together delayed the incidence of TEV in pepper plots for over two months. TEV management programs should aim to delay the virus from infecting peppers during the first two months after transplanting.  A risk analysis is proposed for management of TEV and other aphid-borne viruses.",
  "description_provenance": [
    "Author Email: shmcdona@vt.edu",
    "Advisor Email: stolin@vt.edu",
    "Advisor Email: dgpfeiff@vt.edu",
    "Advisor Email: bnault@vt.edu",
    "Advisor Email: tmack@vt.edu",
    "Advisor Email: nault.1@osu.edu",
    "Made available in DSpace on 2014-03-14T20:08:20Z (GMT). No. of bitstreams: 8 CHAPTER_3.pdf: 165176 bytes, checksum: 506cc33030b69de933d869fbe52095b5 (MD5) CHAPTER_1.pdf: 143420 bytes, checksum: f73a37843da4646f6ca58ad1d3a77553 (MD5) CHAPTER_2.pdf: 306043 bytes, checksum: fdf771601ea9a23200313275e5eaf2ae (MD5) VITA.pdf: 6051 bytes, checksum: 19801810a524f241dd5613e2894efb6b (MD5) CHAPTER_6.pdf: 25959 bytes, checksum: 66eb5e255a97d99edf0db3fc86dfcf57 (MD5) CHAPTER_5.pdf: 50475 bytes, checksum: ec771bd520292f1c77b2af49897962f1 (MD5) CHAPTER_4.pdf: 148468 bytes, checksum: 3a27e0882d4f2113eb1994574c678945 (MD5) FRONT_MATTER.pdf: 39564 bytes, checksum: ec38a94b94600a0c037fac07ad0d955c (MD5)   Previous issue date: 2001-02-22"
  ],
  "handle": "26468",
  "identifier_other": "etd-03212001-144228",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03212001-144228/",
  "identifier_uri": "http://hdl.handle.net/10919/26468",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAPTER_3.pdf",
    "CHAPTER_1.pdf",
    "CHAPTER_2.pdf",
    "VITA.pdf",
    "CHAPTER_6.pdf",
    "CHAPTER_5.pdf",
    "CHAPTER_4.pdf",
    "FRONT_MATTER.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "seasonal abundance",
    "yield",
    "reflective mulch",
    "geostatistics",
    "stylet oil",
    "time of infection"
  ],
  "title": "Epidemiology, Aphid Vectors, Impact and Management of Tobacco Etch Potyvirus in Hot Peppers in Jamaica",
  "type": "Dissertation"
}