{
  "contributor_author": "Evans, Jackson Allan",
  "contributor_committeechair": "Magliaro, Susan G.",
  "contributor_committeemember": [
    "Chang, Mido",
    "Buikema, Arthur L. Jr.",
    "Wildman, Terry M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:18Z",
  "date_adate": "2009-05-14",
  "date_available": "2014-03-14T20:08:18Z",
  "date_issued": "2009-03-16",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-03-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This investigation examines college success in freshman and sophomore level biology courses for students with biology AP credit by addressing the following questions: One, Does AP biology experience increase academic performance in freshman biology? Do AP students with scores of 3 significantly outperform non-AP students? Do AP students with scores of 5 significantly outperform non-AP students in sophomore level biology courses? Two groups of college freshman and sophomores, those with AP biology scores and those without, were matched in regards to gender and SAT scores and instructor of record. Results suggest that students with biology AP scores of 3 may not, as suggested by the College Board, be adequately prepared to enroll directly into sophomore level biology courses. Results from this dissertation suggest the following implications: (a) AP students with final AP exam scores of 1 and 2 have derived little if any benefit from their yearlong AP biology course and the AP final exam in regards to Freshman Biology I; (b) AP biology students with scores of 3 and 4 on their end-of-the-year biology AP exam appear to be well prepared to be successful, based on mean final grades, in Freshman Biology I; (c) There is no supporting evidence that suggests AP students with AP final exam scores of 3 or 4 are adequately prepared to enroll directly into sophomore level biology courses and be successful; and (d) AP students with scores of 5 who have enrolled directly into sophomore level biology courses did not significantly outperform, based on mean final grades, non-AP students who have taken the two semester sequence of freshman biology courses. Further research needs to be done at each college and university participating in the Advanced Placement program to set appropriate cut off scores for the end-of-the-year AP exam score in regards to awarding college credit. Moreover, a considerable amount of research carried out thus far fails to capture many of the variables known to be associated with college success. Therefore, further research done in this area needs to control for these other variables.",
  "description_provenance": [
    "Author Email: jaevans1@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: mchang@vt.edu",
    "Advisor Email: @vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:18Z (GMT). No. of bitstreams: 1 PDF3.pdf: 347511 bytes, checksum: 5556a06e42760a047b34b735d0ab7af4 (MD5)   Previous issue date: 2009-03-16"
  ],
  "handle": "26461",
  "identifier_other": "etd-03192009-155607",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03192009-155607/",
  "identifier_uri": "http://hdl.handle.net/10919/26461",
  "publisher": "Virginia Tech",
  "relation_haspart": "PDF3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Biology courses",
    "College success",
    "Advanced Placement"
  ],
  "title": "Advanced Placement and College Success in Freshman and Sophomore Level Biology Courses",
  "type": "Dissertation"
}