{
  "contributor_author": "Bizzell, Brad E.",
  "contributor_committeechair": "Creighton, Theodore B.",
  "contributor_committeemember": [
    "Craig, James R.",
    "Tripp, Norman Wayne",
    "McCracken, Robert C."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:19Z",
  "date_adate": "2011-04-13",
  "date_available": "2014-03-14T20:08:19Z",
  "date_issued": "2011-03-16",
  "date_rdate": "2011-04-13",
  "date_sdate": "2011-03-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine the nature of professional development of principals of schools in the rural Appalachian region of Virginia.  The researcher interviewed 13 principals from public elementary, middle, and high schools regarding their professional development experiences.  Principals were asked to describe their past and current professional development experiences, identify barriers to accessing professional development, and provide their opinion regarding the importance of professional development that focuses specifically on leading a school in rural Appalachia.  Principals reported participation in many different types of professional development.  Principalsâ   responses were analyzed to determine the extent to which professional development was on-going, job-embedded, and connected to school improvement goals.  Results indicated principalsâ   professional development experiences were seldom on-going, often job-embedded, and somewhat connected to school or district improvement goals.  Principals reported the demands of the job, lack of professional development opportunities provided by their school district, lack of knowledge of professional development available outside their district, and being geographically isolated as barriers to their professional learning.  The results led to identification of areas for further research. These areas include (a) the role and influence of school division leadership on principalsâ   professional development (b) the importance and impact of incorporating networking and other opportunities for collaboration into the design of principalsâ   professional development, (c) the impact of designing professional development that is on-going, job-embedded, and connected to school improvement goals on initial learning and continued leadership behaviors of principals, (d) the issues relating to the use and non-use of distance technologies for principalsâ   professional development, and (e) the efficacy of professional development designed for teachers in meeting the needs of principals or the ability of principals to translate the content of teachers professional development to knowledge and skills needed by instructional leaders. The researcher also suggested the need for additional research to compare and contrast the professional development experiences of this studyâ  s participants with other principals in rural Appalachia as well as principals from suburban and urban school districts.",
  "description_provenance": [
    "Author Email: bbizzell@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: jcraig44@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: rmccracke@radford.edu",
    "Made available in DSpace on 2014-03-14T20:08:19Z (GMT). No. of bitstreams: 2 Bizzell_BE_D_IRBfairuse.pdf: 409636 bytes, checksum: beabfc71ea99c8c59b450f2f8c8726bd (MD5) Bizzell_BE_D_2011.pdf: 899589 bytes, checksum: dcb572e82d0675ca644e31b53cc60b0e (MD5)   Previous issue date: 2011-03-16"
  ],
  "handle": "26464",
  "identifier_other": "etd-03202011-093016",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03202011-093016/",
  "identifier_uri": "http://hdl.handle.net/10919/26464",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Bizzell_BE_D_IRBfairuse.pdf",
    "Bizzell_BE_D_2011.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Appalahcia",
    "principal",
    "leadership",
    "professional development"
  ],
  "title": "Professional Development of School Principals in the Rural Appalachian Region of Virginia",
  "type": "Dissertation"
}