{
  "contributor_author": "Langley, Audra Kae",
  "contributor_committeechair": "Jones, Russell T.",
  "contributor_committeemember": [
    "Hutchinson, Susan R.",
    "Ollendick, Thomas H.",
    "Finney, Jack W.",
    "Winett, Richard A."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:08:20Z",
  "date_adate": "2000-03-31",
  "date_available": "2014-03-14T20:08:20Z",
  "date_issued": "2000-03-10",
  "date_rdate": "0000-00-00",
  "date_sdate": "2000-03-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Recent studies of children and adolescents who have experienced a residential, industrial, or wild fire have suggested a causal link between fire disaster and PTSD related psychological distress. Not everyone, however, is equally affected by the stress of experiencing such an event, and the role of coping in this process may be an important mediating factor. Additionally, several studies have found that girls and African Americans report more distress following disasters than do boys and Caucasians. The current study sought to investigate the roles of exposure/loss, coping efficacy, and coping strategy in mediating psychological distress in adolescents after a disaster.  The current study included a representative sample of 206 9th graders from a Central Florida High School affected by severe wildfires who were assessed via self-report measures 3- and 10- months after the fires, in a latent variable path analysis to assess the fit of a model including exposure/loss, coping efficacy, coping strategy, and PTSD, depression, and anxiety scores. Moreover, acculturation level and SES were included along with gender and ethnicity in testing for the moderating role of sociodemographics, as little research has delved into the important proximal factors affecting reported racial differences, as ethnicity is better conceptualized as a distal variable that works through a variety of proximal variables to affect outcomes.   Results indicated that although the assessment of the global fit of the latent variable path model revealed it to be a poor fit to the data, component fit of the model pointed to a possible mediating role of coping efficacy between exposure/loss and psychological distress, as well as coping efficacy being associated negatively with avoidant coping strategies. Likewise, post hoc regression analyses indicated an important role for exposure/loss, coping efficacy, and coping strategy as they related to PTSD symptomatology in adolescents at both Time 1 and Time 2. Finally, although relationships between the proposed variables and PTSD did not interact with gender, acculturation, SES, or ethnicity, there was a significant interaction between acculturation and ethnicity signifying that for African American youth, high acculturation levels were predictive of less PTSD symptomatology.",
  "description_provenance": [
    "Author Email: aulangle@vt.edu",
    "Advisor Email: rtjones@vt.edu",
    "Advisor Email: hutchins@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:20Z (GMT). No. of bitstreams: 1 dissertation.PDF: 238308 bytes, checksum: 35f4b691b4cfc7e3177c043e9125fdc2 (MD5)   Previous issue date: 2000-03-10"
  ],
  "handle": "26473",
  "identifier_other": "etd-03222000-08170029",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03222000-08170029/",
  "identifier_uri": "http://hdl.handle.net/10919/26473",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "coping",
    "self efficacy",
    "adolescents",
    "Post Traumatic Stress Disorder",
    "acculturation"
  ],
  "title": "Coping Efforts and Efficacy, Acculturation, and Post-Traumatic Symptomatology in Adolescents following Wildfire: A Latent Variable Path Analysis",
  "type": "Dissertation"
}