{
  "contributor_author": "Wang, Liguang",
  "contributor_committeechair": "Yoon, Roe-Hoan",
  "contributor_committeemember": [
    "Vlachos, Pavlos P.",
    "Telionis, Demetri P.",
    "Davis, Richey M.",
    "Luttrell, Gerald H."
  ],
  "contributor_department": "Mining and Minerals Engineering",
  "date_accessioned": "2014-03-14T20:08:21Z",
  "date_adate": "2006-04-04",
  "date_available": "2014-03-14T20:08:21Z",
  "date_issued": "2006-03-08",
  "date_rdate": "2006-04-04",
  "date_sdate": "2006-03-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Fundamental studies of surface forces in foam films are carried out to explain the stability of foams and froths in froth flotation. The thin film pressure balance (TFPB) technique was used to study the surface forces between air bubbles in water from equilibrium film thickness and dynamic film thinning measurements. The results were compared with the disjoining pressure predicted from the Derjaguin-Landau-Verwey-Overbeek (DLVO) theory. The contribution from the non-DLVO force was estimated by subtracting the electrostatic double-layer and van der Waals forces from the total force (or pressure) measured. The results obtained in the present work suggest that a strong attractive force (referred to as hydrophobic force) exists at very low surfactant concentrations, and that it decreases with increasing surfactant and/or electrolyte concentrations. In contrast, pH changes have only minor effects on the hydrophobic force.  The changes in the hydrophobic force observed at low surfactant concentration region have been related to foam stability in flotation. In addition, an analytical model applicable to a broad range of surfactant concentration was developed to calculate film elasticity from surface tension. The model finds, however, that the film elasticities change little at low surfactant concentrations. It is, therefore, suggested that bubble coalescence and foam stability at low surfactant concentrations may be largely affected by hydrophobic force.   The TFPB technique was also used to study the surface forces in the foam films stabilized with various frothers such as pentanol, octanol, methyl isobutyl carbinol (MIBC), and polypropylene glycol (PPG). The results were compared with the foam stabilities measured using the shake tests and the film elasticity calculated using the model developed in the present work. It was found that at a low electrolyte concentration foam stability is controlled by film elasticity and surface forces, the relative contributions from each changing with frother concentration and type. It is, therefore, proposed that one can control the foam stability in flotation by balancing the elasticities of foam films and the disjoining pressure in the films, particularly the contributions from the hydrophobic force.",
  "description_provenance": [
    "Author Email: liwang6@vt.edu",
    "Advisor Email: pvlachos@vt.edu",
    "Advisor Email: telionis@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: ryoon@vt.edu",
    "Advisor Email: luttrell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:21Z (GMT). No. of bitstreams: 11 Vita.pdf: 53296 bytes, checksum: 18b0266f2ece566316479d6e2d5c107a (MD5) Abstract.pdf: 53161 bytes, checksum: cbb1dea9b1ba76f28d0a1cdc153db936 (MD5) Ack-Contents-Tab-Fig.pdf: 110052 bytes, checksum: 8353acc1743beddb47d7086fc9fc15e1 (MD5) Title.pdf: 3563 bytes, checksum: 4e559253c0ae0a65ae03a9d55d1a9ffc (MD5) Chap6.pdf: 219778 bytes, checksum: fe168ec1551b66a071313e2cc976d816 (MD5) Chap4.pdf: 329042 bytes, checksum: 8b00022660b74f139d6e755bffc7b024 (MD5) Chap7.pdf: 218356 bytes, checksum: 7a5fa8c6726d9cf8980ac4ccb97dd79d (MD5) Chap5.pdf: 246644 bytes, checksum: c11f401b46a578c01313ee4c05f50979 (MD5) Chap1.pdf: 245834 bytes, checksum: 3815e4b1f82800f5440a12a2fddfc170 (MD5) Chap2.pdf: 389483 bytes, checksum: 0f98d08c6b4e2b76524d20f939c4f66d (MD5) Chap3.pdf: 341089 bytes, checksum: ec6098312e5bdba559e08de344de24a2 (MD5)   Previous issue date: 2006-03-08"
  ],
  "handle": "26476",
  "identifier_other": "etd-03222006-132408",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03222006-132408/",
  "identifier_uri": "http://hdl.handle.net/10919/26476",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Vita.pdf",
    "Abstract.pdf",
    "Ack-Contents-Tab-Fig.pdf",
    "Title.pdf",
    "Chap6.pdf",
    "Chap4.pdf",
    "Chap7.pdf",
    "Chap5.pdf",
    "Chap1.pdf",
    "Chap2.pdf",
    "Chap3.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "foam stability",
    "film elasticity",
    "hydrophobic force"
  ],
  "title": "Surface Forces in Foam Films",
  "type": "Dissertation"
}