{
  "contributor_author": "Bodas, Jaee",
  "contributor_committeechair": "Ollendick, Thomas H.",
  "contributor_committeemember": [
    "Clum, George A. Jr.",
    "Cooper, Lee D.",
    "Bell, Martha Ann",
    "Singh, Kusum"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:08:20Z",
  "date_adate": "2006-07-06",
  "date_available": "2014-03-14T20:08:20Z",
  "date_issued": "2006-02-28",
  "date_rdate": "2008-07-06",
  "date_sdate": "2006-03-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The present study examined the nature of test anxiety from a cross-cultural perspective, with a specific reference to children in the Indian culture. In particular, the present study investigated the role of intra-individual variables (fear, anxiety, depression, and somatization) and extra-individual variables (activities schedule, consequences of failure, perceived parental expectations and involvement and parental expectations and involvement) in predicting test anxiety. A culturally sensitive methodology consistent with Berryâ  s imposed etic-emic-derived etic approach was adopted wherein a combination of qualitative and quantitative data was examined. A sample of 231 children from government, government-aided, and private schools participated in the study. Qualitative data was collected using focus groups and open-ended questions and provided an enriched understanding of the manifestation of test anxiety and its correlates in a sample of school going children in India. Quantitative data was collected from translated and adapted western questionnaires and surveys that tapped intra-individual and extra-individual variables examined in the current investigation. Overall, the qualitative data indicated that social derogation and somatization were salient aspects of the phenomenological experience; while high stakes exams, authoritarian parenting styles, and poverty, were significant contextual factors related to test anxiety in Indian children. Quantitative data suggested that somatization was correlated to test anxiety and predicted test anxiety above and beyond other intra-individual variables. However, among the extra-individual variables, only consequences of exam failure and perceived parental expectations were correlated with test anxiety and these did not predict test anxiety above and beyond the intra-individual variables. Limitations and suggestions for future research are discussed.",
  "description_provenance": [
    "Author Email: jbodas@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:20Z (GMT). No. of bitstreams: 1 Dissertation_Paper.pdf: 313439 bytes, checksum: 7fcc226b3b95590d65e0daba301e1fd5 (MD5)   Previous issue date: 2006-02-28"
  ],
  "handle": "26471",
  "identifier_other": "etd-03212006-000504",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03212006-000504/",
  "identifier_uri": "http://hdl.handle.net/10919/26471",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Paper.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "emic",
    "culture",
    "test-anxiety",
    "etic"
  ],
  "title": "Intra-individual and Extra-individual predictors of text anxiety in Indian children: A cross-cultural perspective",
  "type": "Dissertation"
}