{
  "contributor_author": "Cankaya, Banu",
  "contributor_committeechair": "Clum, George A. Jr.",
  "contributor_committeemember": [
    "Winett, Richard A.",
    "Bell, Martha Ann",
    "Cooper, Lee D.",
    "Scarpa-Friedman, Angela"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:08:20Z",
  "date_adate": "2006-03-28",
  "date_available": "2014-03-14T20:08:20Z",
  "date_issued": "2006-03-13",
  "date_rdate": "2008-03-28",
  "date_sdate": "2006-03-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Drawing from the meta-construct model of cognition (Ingram, 1984; Ingram & Kendall, 1986), the goal of the present study was to examine whether the structural (i.e., self-complexity; SC, Linville, 1985) and propositional components of schemas (dysfunctional attitudes; DAS, Weissman & Beck, 1978), independently and in interaction with each other and stressors, lead to changes in depressive symptoms.  The prediction was that if negative self-attributes across different self-aspects in a specific domain, interpersonal or achievement, are highly distinct (i.e., high negative SC) or if positive self-attributes across different aspects of self are redundant (i.e., low positive SC), then the DAS would be more likely to lead to higher levels of depression when domain-congruent stressors occur.  To test the main effect, two-way interaction, and three-way interaction hypotheses, the present study used a two month longitudinal design involving three assessment periods, separated by one month.  At the baseline, a total of 189 students participated in the study.  Of these students, 163 and 121 students participated in the first and second follow-ups, respectively.  Multiple hierarchical regression analyses were used to examine two-way and three-way interactions.  Results showed strong support for the predictive power of negative SC with respect to depressive symptomatology.  The DAS, on the contrary, was a concurrent factor related to depressive symptoms.  Further, the present study did not provide supportive evidence for the diathesis-stress model of depression.  Although contradicting expectations, the pattern of relationships between interpersonal negative SC, DAS, distal stressors suggested promising venues for future research.",
  "description_provenance": [
    "Author Email: bcankaya@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: ascarpa@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:20Z (GMT). No. of bitstreams: 1 Bcankaya2.pdf: 515835 bytes, checksum: a2aa7bdd5deb03a932ccdd37a6c0b383 (MD5)   Previous issue date: 2006-03-13"
  ],
  "handle": "26472",
  "identifier_other": "etd-03212006-151653",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03212006-151653/",
  "identifier_uri": "http://hdl.handle.net/10919/26472",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bcankaya2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Life Events",
    "Self-Complexity",
    "Dysfunctional Attitudes",
    "Depression",
    "Schemas"
  ],
  "title": "Diatheses to Depression: The Interactions of Schema Propositions, Schema Structure, and Negative Life Events",
  "type": "Dissertation"
}