{
  "contributor_author": "Guthrie, Miriam E.",
  "contributor_committeechair": "Burton, John K.",
  "contributor_committeemember": [
    "Ford, David R.",
    "Magliaro, Susan G.",
    "Wilkinson, Thomas W.",
    "Moore, David Michael"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:20Z",
  "date_adate": "2003-03-27",
  "date_available": "2014-03-14T20:08:20Z",
  "date_issued": "2003-03-17",
  "date_rdate": "2004-03-27",
  "date_sdate": "2003-03-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<dir> <p class=MsoNormal style='text-indent:.5in;line-height:200%;tab-stops:.5in'>This study investigated<i style='mso-bidi-font-style:normal'> </i>the perceptions of Chief Financial Officers and primary Distance Education Administrators on economic and institutional decision-making factors influencing institutional involvement in distance education, and the economic readiness criteria and business plan components necessary for institutions to be strategically successful in distance education. Data were collected via an online questionnaire from a sample of 151 Carnegie Foundation Classified Doctoral/Research Institutionsâ  Extensive. <o:p></o:p></p> <p class=MsoNormal style='text-indent:.5in;line-height:200%;tab-stops:.5in'>Responses from 80 institutions (31 Chief Financial Officers and 72 Distance Learning Administrators) indicated that 78.6% of all institutions planned to increase their institutional involvement in distance education and 19.4% planned to maintain their current involvement in distance education. <o:p></o:p></p>  <p class=MsoNormal style='text-indent:.5in;line-height:200%;tab-stops:.5in'>This study indicated that administrators should consider the role that economic and other institution-related decision-making factors play in distance education, particularly in assessing reasons for institutional involvement and plans to not start, maintain or increase distance education activities. Statistically significant relationships were found to exist between an institutionâ  s plans for not starting, maintaining or increasing distance education activities and institutional demographics, institutional engagement, specific core values, and distance education business plans. Economic factors were also found to impact institutional involvement in distance education. Specifically, addressed were institutional readiness criteria for successful involvement in distance education, components of a business plan, and institutional assumptions about distance and higher education. <o:p></o:p></p>  <p class=MsoNormal style='text-indent:.5in;line-height:200%;tab-stops:.5in'>The predominant markets for Research I institutions are graduate (43.1%) and undergraduate students (27.3%), and markets are selected primarily in accordance with institution mission, support of the strategic plan, and to address a specific market niche. Findings indicated that traditional core values are either not influenced by distance education or positively influenced. With respect to business plans, 25.2% indicated that no business plans were present for distance education, 19.4% were not certain, with the remaining reporting that business plans existed for university-wide and/or individual initiative levels. <o:p></o:p></p>  <p class=MsoNormal><o:p>Â </o:p></p>  </div>",
  "description_provenance": [
    "Author Email: mguthrie@vt.edu",
    "Advisor Email: fordd@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: twilkie@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: burton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:20Z (GMT). No. of bitstreams: 1 theMGFINAL.pdf: 1285456 bytes, checksum: e22fb4e2528ce5446080157d0ec5a73c (MD5)   Previous issue date: 2003-03-17"
  ],
  "handle": "26470",
  "identifier_other": "etd-03212003-135733",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03212003-135733/",
  "identifier_uri": "http://hdl.handle.net/10919/26470",
  "publisher": "Virginia Tech",
  "relation_haspart": "theMGFINAL.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "barriers",
    "business plan",
    "higher education",
    "distance learning",
    "instructional technology",
    "institutional readiness"
  ],
  "title": "The Perceptions of Selected University Administrators on Economic and Associated Decision-Making Factors Related to Institutional Involvement in Distance Education",
  "type": "Dissertation"
}