{
  "contributor_author": "DeNardis, Laura Ellen",
  "contributor_committeechair": "Abbate, Janet E.",
  "contributor_committeemember": [
    "Hirsh, Richard F.",
    "Hauger, J. Scott",
    "Downey, Gary L.",
    "Allen, Barbara L."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:08:22Z",
  "date_adate": "2006-04-05",
  "date_available": "2014-03-14T20:08:22Z",
  "date_issued": "2006-03-15",
  "date_rdate": "2008-04-05",
  "date_sdate": "2006-03-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "IPv6, a new Internet protocol designed to exponentially increase the global availability of Internet addresses, has served as a locus for incendiary international tensions over control of the Internet.  Esoteric technical standards such as IPv6, on the surface, appear not socially significant.  The technical community selecting IPv6 claimed to have excised sociological considerations from what they considered an objective technical design decision.  Far from neutrality, however, the development and adoption of IPv6 intersects with contentious international issues ranging from tensions between the United Nations and the United States, power struggles between international standards authorities, U.S. military objectives, international economic competition, third world development objectives, and the promise of global democratic freedoms.  This volume examines IPv6 in three overlapping epochs: the selection of IPv6 within the Internetâ  s standards setting community; the adoption and promotion of IPv6 by various stakeholders; and the history of the administration and distribution of the finite technical resources of Internet addresses.  How did IPv6 become the answer to presumed address scarcity?  What were the alternatives?  Once developed, stakeholders expressed diverse and sometimes contradictory expectations for IPv6.  Japan, the European Union, China, India, and Korea declared IPv6 adoption a national priority and an opportunity to become more competitive in an American-dominated Internet economy.  IPv6 activists espoused an ideological belief in IPv6, linking the standard with democratization, the eradication of poverty, and other social objectives.  The U.S., with ample addresses, adopted a laissez-faire approach to IPv6 with the exception of the Department of Defense, which mandated an upgrade to the new standard to bolster distributed warfare capability. The history of IPv6 includes the history of the distribution of the finite technical resources of â  IP addresses,â   globally unique binary numbers required for devices to exchange information via the Internet.  How was influence over IP address allocation and control distributed globally?  This history of IPv6 explains what's at stake economically, politically, and technically in the development and adoption of IPv6, suggesting a theoretical nexus between technical standards and politics and arguing that views lauding the Internet standards process for its participatory design approach ascribe unexamined legitimacy to a somewhat closed process.",
  "description_provenance": [
    "Author Email: LEDeNardis@aol.com",
    "Advisor Email: rhirsh@vt.edu",
    "Advisor Email: scott.hauger@dri.edu",
    "Advisor Email: downeyg@vt.edu",
    "Advisor Email: ballen@vt.edu",
    "Advisor Email: abbate@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:22Z (GMT). No. of bitstreams: 1 DeNardisETD.pdf: 1095808 bytes, checksum: 2a8ae57e5c8ad589b2100bbe0aefd3b6 (MD5)   Previous issue date: 2006-03-15"
  ],
  "handle": "26485",
  "identifier_other": "etd-03232006-140127",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03232006-140127/",
  "identifier_uri": "http://hdl.handle.net/10919/26485",
  "publisher": "Virginia Tech",
  "relation_haspart": "DeNardisETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Internet History",
    "Computer Networking",
    "Globalization",
    "Internet Governance",
    "Technology Standards",
    "Internet Protocols"
  ],
  "title": "IPv6: Politics of the Next Generation Internet",
  "type": "Dissertation"
}