{
  "contributor_author": "Elseifi, Mostafa",
  "contributor_committeechair": "Al-Qadi, Imadeddin L.",
  "contributor_committeemember": [
    "Holzer, Siegfried M.",
    "Case, Scott W.",
    "Loulizi, Amara",
    "Trani, Antoino A.",
    "Flintsch, Gerardo W.",
    "Reifsnider, Kenneth L."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:08:23Z",
  "date_adate": "2003-04-02",
  "date_available": "2014-03-14T20:08:23Z",
  "date_issued": "2003-02-21",
  "date_rdate": "2004-04-02",
  "date_sdate": "2003-03-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study quantifies the benefits of two interlayer systems (steel reinforcing netting and a newly-designed geocomposite membrane) in different pavement applications.  Steel reinforcing netting and geocomposite membrane have been installed at the Virginia Smart Road in four different sections.  Ground penetrating radar (GPR) surveys and time domain reflectometer (TDR) validated the effectiveness of the geocomposite membrane in preventing water from infiltrating to the underneath layers.  In pavement rehabilitation applications, based on finite element (FE) analysis, it was found that the geocomposite membrane would create a protective compressive field around the crack tip and separate the criticality of the stress field in the cracked area from the bottom of the overlay.  However, if the crack passes through the interlayer, a faster propagation rate than in a typical pavement is expected.  These results emphasize the importance of proper field installation.  As to steel reinforcing netting, this study found that this interlayer system would be effective in new pavement systems in both the crack initiation and propagation phases when the cracks start at the bottom of the HMA layers.  For the considered pavement structures, steel reinforcing netting was found effective to delay the initiation of the cracks.  This delay depends on the stiffness of the hot-mix asphalt (HMA) layers, the reinforcing pattern, and the direction of the strain at the bottom of the HMA layers.  After initiation of the crack, steel reinforcement contribute by delaying the rate of crack propagation to the pavement surface.  In pavement rehabilitations, however, the crack is already well established in the existing pavement, and steel reinforcement contribution is expected from the time of installation.  In this case, steel reinforcement will delay the initiation of the crack in the overlay, and reduce the rate of crack propagation afterwards.  Two models, to predict the overlay service life against reflective cracking from existing HMA layers, were developed.",
  "description_provenance": [
    "Author Email: melseifi@vt.edu",
    "Advisor Email: alqadi@vt.edu",
    "Advisor Email: holzer@vt.edu",
    "Advisor Email: scase@exchange.vt.edu",
    "Advisor Email: amlouliz@vt.edu",
    "Advisor Email: vuela@vt.edu",
    "Advisor Email: flintsch@vt.edu",
    "Advisor Email: reifsnid@engr.uconn.edu",
    "Made available in DSpace on 2014-03-14T20:08:23Z (GMT). No. of bitstreams: 14 Vitae.pdf: 62250 bytes, checksum: b810cc17fbfc85a615aeef1acb646787 (MD5) Table_of_Content.pdf: 86025 bytes, checksum: e021c840c9e8026526eec355a28bf26f (MD5) coverpage.pdf: 125264 bytes, checksum: feaa0d63cda0f399fdc31ec03fac22ff (MD5) CHAPTER_7.pdf: 99296 bytes, checksum: 7fc9f4e61b18786adaf3b111d3cb26da (MD5) CHAPTER_6.pdf: 271417 bytes, checksum: fcade4ba0e666afcc36cdc131584f426 (MD5) CHAPTER_5.pdf: 793370 bytes, checksum: 4d49249d509f455574ec6716393ee137 (MD5) CHAPTER_4.pdf: 2619595 bytes, checksum: 7f0259d3b560838805d30313d64b3739 (MD5) CHAPTER_3.pdf: 1489348 bytes, checksum: 7b4008612f2a5cf0f985b05bd2b457d8 (MD5) CHAPTER_2.pdf: 421157 bytes, checksum: 38b5b266797d3588869fe878cbddb065 (MD5) CHAPTER_1.pdf: 152796 bytes, checksum: ed9117b62c1037d2d7d4b9f60af79dc9 (MD5) APPENDIX_D.pdf: 151079 bytes, checksum: 0e7e0305c8b5fc65639ac591f308c84b (MD5) APPENDIX_C.pdf: 101561 bytes, checksum: f239cd218179d34e9a3e6be873729c40 (MD5) APPENDIX_B.pdf: 468382 bytes, checksum: 1c8d0530c1ce0bb5cbb1b767a81f423b (MD5) APPENDIX_A.pdf: 1305395 bytes, checksum: cb03b95faddd070935887b6752edb5c3 (MD5)   Previous issue date: 2003-02-21"
  ],
  "handle": "26489",
  "identifier_other": "etd-03242003-163736",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03242003-163736/",
  "identifier_uri": "http://hdl.handle.net/10919/26489",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Vitae.pdf",
    "Table_of_Content.pdf",
    "coverpage.pdf",
    "CHAPTER_7.pdf",
    "CHAPTER_6.pdf",
    "CHAPTER_5.pdf",
    "CHAPTER_4.pdf",
    "CHAPTER_3.pdf",
    "CHAPTER_2.pdf",
    "CHAPTER_1.pdf",
    "APPENDIX_D.pdf",
    "APPENDIX_C.pdf",
    "APPENDIX_B.pdf",
    "APPENDIX_A.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Geocomposite Membrane",
    "Instrumentation",
    "Finite Element",
    "Steel Reinforcing Netting",
    "Reflective Cracking"
  ],
  "title": "Performance Quantification of Interlayer Systems in Flexible Pavements Using Finite Element Analysis, Instrument Response, and Non Destructive Testing",
  "type": "Dissertation"
}