{
  "contributor_author": "Walker, Anthony M.",
  "contributor_committeechair": "Creighton, Theodore B.",
  "contributor_committeemember": [
    "Whitaker, Carol E.",
    "Salmon, Richard G.",
    "Wasserman, Lewis M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:23Z",
  "date_adate": "2010-04-06",
  "date_available": "2014-03-14T20:08:23Z",
  "date_issued": "2010-03-05",
  "date_rdate": "2010-04-06",
  "date_sdate": "2010-03-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Walker Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>The purpose of this study was to examine if certified special education teachers who instruct emotionally disabled students experience the same barriers to retention when compared to other special educators. Also, this study answered the hypothesis whether significant relationships exists between the variables of staff development, stress and burnout, compensation, student discipline, role conflict, workload, and administrative support and teacher retention. One hundred forty two certified special education teachers from school districts in regions six and seven of southwestern Virginia completed a seventy-nine Likert style questionnaire for this study. Demographic profiles were outlined based on responses from special education teachers. Gender of participants was twenty-two males and seventy-eight females. Confirmatory Factor Analysis was used to validate predictor variables and aided in the development of the special education teacher survey. Principal component analysis interpreted the loadings of survey items on identified constructs. Results of the analysis revealed a strong correlation between the factors of Administrative Support, Compensation, Staff Development and the retention of special education teachers who work with emotionally disabled students. </p> <p>Fourteen percent of respondents chose to leave their positions compared to eighty-six percent who planned to stay. Findings indicated that administrative support, compensation, and staff development were the three most significant factors that influenced certified special educators' decisions to stay or leave their assigned positions. In addition, results of this study revealed that additional factors of student discipline, role conflict, stress and burnout, and workload were less significant, but were considered to have relevancy with minor roles towards a teacher's retention. It can be perceived that the three major constructs serve as a foundation that supports the four remaining individual constructs (stress and burnout, student discipline, role conflict and workload). These constructs were considered to be secondary underlying issues of teacher retention that surface and negatively impact teacher performance and job satisfaction, if not supported by the three major constructs over an extended period of time. Further, results confirmed that Administrative Support exhibited the strongest correlation among survey items and was found to have the most influence on the retention of special education teachers. </p> </body> </html>",
  "description_provenance": [
    "Author Email: anwalke3@vt.edu",
    "Advisor Email: cwhitaker@rcs.k12.va.us",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: tcreih@vt.edu",
    "Advisor Email: lmw1983@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:23Z (GMT). No. of bitstreams: 1 AMWalker_ETD.pdf: 679375 bytes, checksum: c00a2c7d78f9281228b91a916db93a23 (MD5)   Previous issue date: 2010-03-05"
  ],
  "handle": "26487",
  "identifier_other": "etd-03232010-073540",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03232010-073540/",
  "identifier_uri": "http://hdl.handle.net/10919/26487",
  "publisher": "Virginia Tech",
  "relation_haspart": "AMWalker_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Teacher Preparation",
    "and Staff Development",
    "Administrative Support",
    "Special Education",
    "Emotional Disturbance",
    "Retention",
    "Job Satisfaction"
  ],
  "title": "Stay or Leave? Factors Influencing the Retention of Teachers of Emotionally Disturbed in Southwestern Virginia",
  "type": "Dissertation"
}