{
  "contributor_author": "Davis, Sean David",
  "contributor_committeechair": "Piercy, Fred P.",
  "contributor_committeemember": [
    "Keeling, Margaret L.",
    "Johnson, Scott W.",
    "Sprenkle, Douglas K."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:08:22Z",
  "date_adate": "2005-03-25",
  "date_available": "2014-03-14T20:08:22Z",
  "date_issued": "2005-03-23",
  "date_rdate": "2005-03-25",
  "date_sdate": "2005-03-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Meta-analytic reviews of decades of comparative efficacy psychotherapy research consistently reveal that all tested models of marriage and family therapy (MFT) work, and they generally work equally well. Researchers have hypothesized that this may be due to factors common across models responsible for change. Despite a sizable body of common factors literature in psychology, such research in MFT is still in its infancy. The purpose of this study is to contribute to the development of a theory of common factors responsible for change in MFT. Semi-structured, open-ended qualitative interviews were conducted with three different MFT model developers (i.e., Dr. Susan M. Johnson, Emotionally Focused Therapy; Dr. Frank M. Dattilio, Cognitive Behavioral Therapy; and Dr. Richard C. Schwartz, Internal Family Systems Therapy), Dr. Johnson and Dr. Schwartzâ  s former students, and each of their former clients who had terminated therapy successfully. Transcripts were coded using the grounded theory techniques of open coding, axial coding, and relational statements. Coding was done utilizing a constant comparative method in which data were simultaneously analyzed and coded. Common factors fell into two main categories of model-dependent factors and model-independent factors. Factors within the model-dependent category include those aspects of therapy directly informed by the therapistâ  s model. Model-dependent categories include common conceptualizations, common interventions, and common outcomes. Factors within the model-independent category include general aspects of therapy that are not directly related to the therapistâ  s model. Model-independent categories include client variables, therapist variables, the therapeutic alliance, therapeutic process, and expectancy and motivational factors. Each model-dependent and model-independent category has several subcategories. Results are discussed in both model-specific and common factors conceptualizations. A sequential model outlining how model-dependent factors appear to combine to produce therapeutic change while being mediated by model-independent variables is proposed. The findings are integrated with the current common factors literature in psychology and MFT.  Clinical, training, and research implications are discussed.",
  "description_provenance": [
    "Author Email: seandavis@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:22Z (GMT). No. of bitstreams: 1 SeanDavisDissertation.pdf: 645866 bytes, checksum: 86cc956997fd5a5a97b6718fd1e3f672 (MD5)   Previous issue date: 2005-03-23"
  ],
  "handle": "26484",
  "identifier_other": "etd-03232005-172348",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03232005-172348/",
  "identifier_uri": "http://hdl.handle.net/10919/26484",
  "publisher": "Virginia Tech",
  "relation_haspart": "SeanDavisDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "couple therapy",
    "common factors",
    "marital therapy",
    "change processes",
    "marital therapy theory"
  ],
  "title": "Common and Model-Specific Factors: What Marital Therapy Model Developers, Their Former Students, and Their Clients Say About Change.",
  "type": "Dissertation"
}