{
  "contributor_author": "Gorham, Ephraim",
  "contributor_committeechair": "Salmon, Richard G.",
  "contributor_committeemember": [
    "Thompson, John",
    "Carlton, Patrick W.",
    "Parson, Stephen R.",
    "Earthman, Glen I."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:29Z",
  "date_adate": "2002-05-21",
  "date_available": "2014-03-14T20:08:29Z",
  "date_issued": "2001-11-16",
  "date_rdate": "2003-05-21",
  "date_sdate": "2002-03-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Multicultural Teaching Competence As Perceived by Elementary School Teachers Submitted by Ephraim Gorham (ABSTRACT) The purpose of this study was to (a) explore elementary school teachersâ   perceptions of their strengths and deficiencies for working with, and meeting the need of, students from diverse cultural backgrounds; and (b) assess the relationships between these perceptions and the teachers multicultural background and demographic factors such as age, gender, and ethnicity. The participants were elementary school teachers in the Guilford County School System, North Carolina. One school was randomly selected from the four geographical regions in the school system. Teachers who taught summer school were also selected to participate in the program. Classroom teachers from selected schools participated in the study. This study used Jacobeth Ntsebe Thabedeâ  s dissertation, Multicultural Teaching Competence as Perceived by Business Education Student Teachers (1996) as a model to frame the research. Thabede used Wayson's (1993) The Multicultural Teaching Scale classified into Banks' (1993) Dimensions of Multicultural Education to determine the level of multicultural teaching skills of business education student teachers. This study determined the level of multicultural teaching skills of elementary school teachers. The outcome of the regression formula indicated 38 percent of the variance of Building Respect was explained. Building respect for diversity represents the teachersâ   reported willingness to model respect building practices. The four important independent variables were age, the number of hours of multicultural instruction, whether they taught in a suburban school, and whether the participants had experiences with diversity during their education. The more multicultural background during teacher education, the older the participant, the more hours of multicultural instruction, and if teachers were working in a suburban teaching environment, the more likely teachers were to report behaviors that reflect building respect for multicultural diversity.  The findings of the focus groups and the survey showed teachers, who had multi-ethnic family origin, early education experience with cultural diverse students and multicultural friendship groups, perceived themselves competent to teach multicultural students.",
  "description_provenance": [
    "Author Email: gorhame@guilford.k12.nc.us",
    "Made available in DSpace on 2014-03-14T20:08:29Z (GMT). No. of bitstreams: 2 resume.pdf: 4532 bytes, checksum: 83747d996400ab0b8618f6636d0349d4 (MD5) egorham.pdf: 209128 bytes, checksum: a6ac991457a755fa0996c72c64199919 (MD5)   Previous issue date: 2001-11-16"
  ],
  "handle": "26496",
  "identifier_other": "etd-03252002-164438",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03252002-164438/",
  "identifier_uri": "http://hdl.handle.net/10919/26496",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "resume.pdf",
    "egorham.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Curriculum and Instruction",
    "Multiculturalism"
  ],
  "title": "Multicultural Teaching Competence as Perceived by Elementary School teachers",
  "type": "Dissertation"
}