{
  "contributor_author": "Scardina, Robert Paolo",
  "contributor_committeechair": "Edwards, Marc A.",
  "contributor_committeemember": [
    "Little, John C.",
    "Novak, John T.",
    "Knocke, William R.",
    "Esker, Alan R."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:08:29Z",
  "date_adate": "2004-03-26",
  "date_available": "2014-03-14T20:08:29Z",
  "date_issued": "2004-01-19",
  "date_rdate": "2006-03-26",
  "date_sdate": "2004-03-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Gas bubbles that form within water treatment plants can disrupt drinking water treatment processes.  Bubbles may form whenever the total dissolved gas pressure exceeds the local solution pressure, a condition termed dissolved gas â  supersaturation.â    This project investigated how bubble formation affects conventional drinking water treatment and examined factors that can reduce these problems. \tGas bubbles attached to coagulated floc particles can reduce settling efficiency and create â  floating floc.â    In laboratory experiments, bubbles formed on the surface of the mixing paddle, since this was the location of minimum pressure within the system.  The formation and stability of floating floc was dependent on many different factors including the amount and type of dissolved gas supersaturation and surface chemistry of the mixing paddle.  The intensity and duration of rapid mixing also controlled the amount of floating floc.  \tBubbles forming in filter media can block pore spaces and create headloss, a process popularly termed â  air binding.â    During benchscale filtration experiments, bubbles were released upwards from the media in a burping phenomenon, and bubbles could also be pushed downwards by fluid flow.  Burping is beneficial since it partly alleviates the bubble induced headloss, but the media disruptions might also decrease filter efficiency (particle capture).  Bubble formation within filters can be reduced by increasing the pressure inside the filter via greater submergence (water head above the media), lower hydraulic flow rate, or use of a more porous media.  The mode of filter operation (declining or constant flow rate) will also affect the local filter pressure profile. \tDissolved gas supersaturation and bubble formation are detected in on-line turbidity devices and particle counters causing spurious measurements.  The use of bubble traps usually reduced these problems, but one device worsened turbidity spikes.  Flow disturbances may also release bubbles upstream of the on-line turbidimeter, which can cause spikes in turbidity readings.",
  "description_provenance": [
    "Author Email: paolo@vt.edu",
    "Advisor Email: jcl@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Advisor Email: knocke@vt.edu",
    "Advisor Email: edwardsm@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:29Z (GMT). No. of bitstreams: 1 PaoloScardinaDissertation2004.pdf: 2447541 bytes, checksum: 04c59eb7dca2d2b4973095c24b8d2157 (MD5)   Previous issue date: 2004-01-19"
  ],
  "handle": "26497",
  "identifier_other": "etd-03252004-084851",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03252004-084851/",
  "identifier_uri": "http://hdl.handle.net/10919/26497",
  "publisher": "Virginia Tech",
  "relation_haspart": "PaoloScardinaDissertation2004.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "bubble formation",
    "water treatment",
    "coagulation",
    "gas bubble",
    "filtration"
  ],
  "title": "Effects of Dissolved Gas Supersaturation and Bubble Formation on Water Treatment Plant Performance",
  "type": "Dissertation"
}