{
  "contributor_author": "Yilmaz, Levent",
  "contributor_committeechair": "Edwards, Stephen H.",
  "contributor_committeemember": [
    "Ravindran, Binoy",
    "Nance, Richard E.",
    "Nespor, Jan K.",
    "Arthur, James D."
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2014-03-14T20:08:29Z",
  "date_adate": "2002-04-03",
  "date_available": "2014-03-14T20:08:29Z",
  "date_issued": "2002-03-13",
  "date_rdate": "2003-04-03",
  "date_sdate": "2002-03-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In a parameterized collaboration design, one views software as a collection of components that play specific roles in interacting, giving rise to collaborative behavior. From this perspective, collaboration designs revolve around reusing collaborations that typify certain design patterns. Unfortunately, verifying that active, concurrently executing components obey the synchronization and communication requirements needed for the collaboration to work is a serious problem. At least two major complications arise in concurrent settings: (1) it may not be possible to analytically identify components that violate the synchronization constraints required by a collaboration, and (2) evolving participants in a collaboration independently often gives rise to unanticipated synchronization conflicts. This work presents a solution technique that addresses both of these problems. Local (that is, role-to-role) synchronization consistency conditions are formalized and associated decidable inference mechanisms are developed to determine mutual compatibility and safe refinement of synchronization behavior. More specifically, given generic parameterized collaborations and components with specific roles, mutual compatibility analysis verifies that the provided and required synchronization models are consistent and integrate correctly. Safe refinement, on the other hand, guarantees that the local synchronization behavior is maintained consistently as the roles and the collaboration are refined during development. This form of local consistency is necessary, but insufficient to guarantee a consistent collaboration overall.  As a result, a new notion of global consistency (that is, among multiple components playing multiple roles) is introduced: causal process constraint analysis. A method for capturing, constraining, and analyzing global causal processes, which arise due to causal interference and interaction of components,  is presented. Principally, the method allows one to: (1) represent the intended causal processes in terms of interactions depicted in UML collaboration graphs; (2) formulate constraints on such interactions and their evolution; and (3) check that the causal process constraints are satisfied by the observed behavior of the component(s) at run-time.",
  "description_provenance": [
    "Author Email: levent@tridsys.com",
    "Advisor Email: binoy@vt.edu",
    "Advisor Email: nance@cs.vt.edu",
    "Advisor Email: janlee@cs.vt.edu",
    "Advisor Email: arthur@cs.vt.edu",
    "Advisor Email: edwards@cs.vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:29Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 1312269 bytes, checksum: 96011def3614e56b055881c20c08fa17 (MD5)   Previous issue date: 2002-03-13"
  ],
  "handle": "26494",
  "identifier_other": "etd-03252002-121049",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03252002-121049/",
  "identifier_uri": "http://hdl.handle.net/10919/26494",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "component-based",
    "verification",
    "validation",
    "reuse",
    "collaborative behavior",
    "testing"
  ],
  "title": "Specifying and Verifying Collaborative Behavior in Component-Based Systems",
  "type": "Dissertation"
}