{
  "contributor_author": "Adams, Samuel Hamilton",
  "contributor_committeechair": "Wiswell, Albert W.",
  "contributor_committeemember": [
    "Kurstedt, Harold A. Jr.",
    "Belli, Gabriella M.",
    "Rosen, Karen H.",
    "Croswell, Clyde"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:08:29Z",
  "date_adate": "2004-03-31",
  "date_available": "2014-03-14T20:08:29Z",
  "date_issued": "2004-02-24",
  "date_rdate": "2004-03-31",
  "date_sdate": "2004-03-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Organizations often take trust for granted or ignore it, although trust is important for organizational learning and performance.  Organizations must continuously learn if they are to survive, and trust facilitates individual and organizational learning.  However, many authors either mention the importance of trust, or assume trust is present, and then discuss other topics as if little can be done to better understand the antecedents of trust or to improve trust in an organization.  In particular, prior to this study, researchers had not explored the influence of adult attachment and disclosiveness on organizational trust.  Human resources development professionals can play a vital role by helping leaders in their organizations attain strategic goals, however, no research study done previously has focused on how trust in an organization is influenced by adult attachment and disclosiveness.  There is a need to better understand organizational trust because in today's global economy, an organization's ability to survive may depend in part on individual and organizational learning facilitated by trust.   This study focused on a main research question \"What portion of the variance in employees' perceptions of organizational trust do employees' adult attachment and disclosiveness explain?\"  During this research, a revised instrument for measuring organizational trust was developed.  The findings of this study showed that disclosiveness did not have a statistically significant influence on organizational trust.  In contrast, fearful attachment, in particular was shown to have a modest, statistically significant, and negative influence on organizational trust.",
  "description_degree": "PhD",
  "description_provenance": [
    "Author Email: saadams@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:29Z (GMT). No. of bitstreams: 1 SamAdamsRevDissertationFinal.pdf: 649369 bytes, checksum: 053a7ed956fc82696ac9d5777b35ea78 (MD5)   Previous issue date: 2004-02-24"
  ],
  "handle": "26499",
  "identifier_other": "etd-03252004-150617",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03252004-150617/",
  "identifier_uri": "http://hdl.handle.net/10919/26499",
  "publisher": "Virginia Tech",
  "relation_haspart": "SamAdamsRevDissertationFinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Self-Disclosure",
    "Organizational Trust",
    "Adult Attachment"
  ],
  "title": "The Relationships Among Adult Attachment, General Self-Disclosure, and Perceived Organizational Trust",
  "type": "Dissertation"
}