{
  "contributor_author": "Davis, Thomas Wayne",
  "contributor_committeechair": "Lockhart, Thurmon E.",
  "contributor_committeemember": [
    "Cuqlock-Knopp, V. Grayson",
    "Winchester, Woodrow W. III",
    "Kalb, Joel T.",
    "Babski-Reeves, Kari L."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:08:29Z",
  "date_adate": "2006-04-26",
  "date_available": "2014-03-14T20:08:29Z",
  "date_issued": "2006-03-09",
  "date_rdate": "2006-04-26",
  "date_sdate": "2006-03-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The attrition rate of enlistees in basic combat training is of particular concern to all Branches of the military due to the high cost associated with recruiting and training a new enlistee.  Each year the military loses hundreds of millions of dollars invested in enlistees whom never make it to their first duty station.    Investigators have extensively examined the impact of physiological injuries on the rate of enlistee discharge from basic combat training.  Also, investigators have reported that alcoholism, adjustment disorders, mood disorders, and personality disorders were among the leading hospital discharge diagnostic categories for enlistees during the 1990s; especially, within the first six-months of service.  Additionally, investigators have reported that the transition process from civilian to military in basic combat training tends to be very stressful and anxiety provoking for enlistees.  However, little data has been gathered to assess the relationship of enlisteesâ   physiological and perceived stress levels and their attrition rate.    A study was conducted of 155 soldiers during their nine-week basic combat training at Fort Jackson, South Carolina.  Salivary amylase testing was used as an objective measure of physiological stress, and the Multiple Affects Adjective CheckList Revised (MACCL-R) was use as a subjective measure of perceived stress.  It was hypothesized that enlistees with higher levels of stress would also have a higher level of depression and hostility resulting in performance degradation.  The results of linear regression analyses and multivariate pairwise correlation showed a statistically significant positive relationship among perceived stress, hostility and depression levels. Additionally, the analyses showed that for the soldiers participating in this study, coping style moderated their perceived stress experience.  Those participants who were able to modify their coping mechanism to meet the physically and mentally demanding challenges of basic combat training tended to be more confident in successfully completing training.  Moreover, they were less likely to receive disciplinary action.    The military training command has requested follow up studies to expand upon this current study to encompass the various training cycles over a one-year time period.",
  "description_provenance": [
    "Author Email: twdavis@arl.army.mil",
    "Advisor Email: grayson@arl.army.mil",
    "Advisor Email: wwwinche@vt.edu",
    "Advisor Email: lockhart@vt.edu",
    "Advisor Email: Jkalb@arl.army.mil",
    "Advisor Email: kbabski@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:29Z (GMT). No. of bitstreams: 1 ThomasDavis-Dissertation_ETD_.pdf: 7074176 bytes, checksum: 7954601122b41e853c01243e026676ee (MD5)   Previous issue date: 2006-03-09"
  ],
  "handle": "26500",
  "identifier_other": "etd-03252006-135019",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03252006-135019/",
  "identifier_uri": "http://hdl.handle.net/10919/26500",
  "publisher": "Virginia Tech",
  "relation_haspart": "ThomasDavis-Dissertation_ETD_.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Attrition",
    "Multiple Affects Adjective Check List Revised",
    "Coping Mechanism",
    "Confidence",
    "Stress",
    "Performance",
    "Basic Combat Training",
    "Depression",
    "Hostility"
  ],
  "title": "Effects of Stress, Coping Style, and Confidence on Basic Combat Training Performance, Discipline, and Attrition",
  "type": "Dissertation"
}