{
  "contributor_author": "Poff, Joni Clayman",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Tripp, Norman Wayne",
    "Whitaker, Carol E.",
    "Young, Carl A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:31Z",
  "date_adate": "2008-04-15",
  "date_available": "2014-03-14T20:08:31Z",
  "date_issued": "2008-03-17",
  "date_rdate": "2008-04-15",
  "date_sdate": "2008-03-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Joni Clayman Poff Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>The No Child Left Behind Act of 2001 and the accountability movement that has engulfed education in the last 20 years have put leadership at the heart of school improvement. Student achievement is affected by multiple factors that must be addressed with unique leadership skills and specialized knowledge. No one person can be responsible for orchestrating the success of each student within a school building. When members of a school community share responsibility for the many activities that contribute to student learning, the work of educational leaders becomes a manageable task. The purpose of this study was to create an operational definition of shared leadership by identifying key descriptors that define the characteristics and behaviors of shared leadership and the aspects of school cultures in which it can be effective. </p> <p>The procedure used to construct a rich description of shared leadership was a three-round Delphi study. A panel of experts was assembled from writers or researchers in the field of leadership and superintendents, principals, and teachers who have practiced shared leadership in the school environment. The first-round Delphi instrument consisted of four open-end questions that asked for key words or phrases that describe the characteristics and behaviors of shared leadership, key words or phrases that describe aspects of school cultures in which shared leadership can be effective, and key words or phrases that describe barriers to shared leadership. In the second round, panelists were asked to rate the compiled responses from round one on a four-point scale. In the third round, panelists received statistical information based on second-round responses. They were allowed to revise opinions once more using a four-point scale. </p> <p>Using the Delphi technique, the panel of experts reached consensus on 84 critical elements of effective shared leadership. An inventory that can be used by schools as a guide for planning, implementing, and evaluating shared leadership in school settings was created from the data. </p> </body> </html>",
  "description_provenance": [
    "Author Email: jopoff@vt.edu; jpoff@bcps.k12.va.us",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: cwhitaker@rcs.k12.va.us",
    "Advisor Email: cayoung2@gwced.ncsu.edu",
    "Made available in DSpace on 2014-03-14T20:08:31Z (GMT). No. of bitstreams: 1 JPoffETD.pdf: 491991 bytes, checksum: bfdb73ab755f075377b94a59f579ef82 (MD5)   Previous issue date: 2008-03-17"
  ],
  "handle": "26509",
  "identifier_other": "etd-03262008-193032",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03262008-193032/",
  "identifier_uri": "http://hdl.handle.net/10919/26509",
  "publisher": "Virginia Tech",
  "relation_haspart": "JPoffETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "School Improvement",
    "Shared Leadership",
    "Shared Decision Making",
    "School Reform",
    "Teacher Leader",
    "Principal Leadership",
    "Educational Leadership",
    "Distributed Leadership",
    "Leadership"
  ],
  "title": "Operationalizing the Construct of Shared Leadership: a Delphi Study",
  "type": "Dissertation"
}