{
  "contributor_author": "Johnson, Ane Turner",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeemember": [
    "Burge, Penny L.",
    "Browder, John O.",
    "Janosik, Steven M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:31Z",
  "date_adate": "2009-04-21",
  "date_available": "2014-03-14T20:08:31Z",
  "date_issued": "2009-03-17",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-03-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Higher education scholars note an abundance of obstacles that render higher education institutions in developing countries ineffectual and unable to participate in the intentional development of their societies (Ajayi, Goma & Johnson, 1996; Altbach, 2004; Bloom, Canning & Chan, 2006; Dill, 1997; Lulat, 2003; Puplampu, 2006; Sawyerr, 2003; Selvaratnam, 1988; Teferra & Altbach, 2004). African higher education has been particularly sensitive to these obstacles, due to the consequences of colonialism, globalization and neocolonialism, and efforts to combat these impediments to development have often been undermined by scarcity at the state level (Altbach, 2001; Bloom, et. al., 2006; Bollag, 2001; Ngome, 2003; Puplampu, 2006; TFHE, 2000; Tikly, 2001). Yet recent initiatives, such as the United Nations Development Programmeâ  s Millennium Development Goals (2000), reveal that higher education institutions have an important role to play in development, particularly in developing nations. Therefore new forms of higher education associations should be considered to bolster an institutionâ  s ability to support development in its national context and cultivate agency in development. Regional efforts through networks may have the capability to overcome paucities at the national level and direct development in Africa. The present study was designed to explore notions of development and the role of the Association of African Universities (AAU) a higher education network, in promoting development. It also examined how faculty and administrators at two African universities perceive development.  <p>  My findings indicated that through the lens of policy entrepreneurship, the AAU, as a higher education network, acted as an agent in development by undertaking activities aimed at addressing development priorities when using higher education as a point of intervention. By sustaining creative, strategic, and mobilization activities across organizational initiatives, the AAU generated sponsorship for their policy solutions among stakeholders. In fact the participatory nature of policy entrepreneurship may allow higher education networks to put the \"African\"  in African development as they respond to community needs and attempt to adapt policy innovations to fit African development challenges.   <p>  Data from Kenyatta University and the University of Nairobi in Kenya illuminated how university reforms at both institutions reflect academic capitalism, a phenomenon researched predominately in developed countries. Faculty and administrators'  personally held beliefs about development and the university's role in development in Kenya have impacted the way that academic capitalism is both perceived and manifested. In the West, the infusion of academic capitalism in higher education has come at the expense of the public good. In Kenya, a new model has emerged in which both development and marketization are served and are complementary. This study also demonstrates that academic capitalism can also produce social and cultural \"revenue,\"   particularly when the individuals that make up the academic workforce of an institution prioritize development needs.",
  "description_provenance": [
    "Author Email: atj@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: browder@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: janosik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:31Z (GMT). No. of bitstreams: 1  ATJ_Dissertation_04.21.2009.pdf: 581820 bytes, checksum: 10e4cac552ca68f6542039ca569f9587 (MD5)    Previous issue date: 2009-03-17"
  ],
  "handle": "26510",
  "identifier_other": "etd-03262009-121832",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03262009-121832/",
  "identifier_uri": "http://hdl.handle.net/10919/26510",
  "publisher": "Virginia Tech",
  "relation_haspart": "ATJ_Dissertation_04.21.2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "development",
    "higher education",
    "policy entrepreneurship",
    "Africa",
    "networks",
    "academic capitalism"
  ],
  "title": "Mobilizing Higher Education for Development in Africa: A Case Study of the Association of African Universities",
  "type": "Dissertation"
}