{
  "contributor_author": "Roberts, Jonathan E.",
  "contributor_committeechair": "Bell, Martha Ann",
  "contributor_committeemember": [
    "Hauenstein, Neil M. A.",
    "Cooper, Robin K. Panneton",
    "Franchina, Joseph J.",
    "Friedman, Bruce H."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:08:32Z",
  "date_adate": "2001-03-29",
  "date_available": "2014-03-14T20:08:32Z",
  "date_issued": "2001-02-09",
  "date_rdate": "2002-03-29",
  "date_sdate": "2001-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In adult populations, it is generally accepted there is an overall male advantage on spatial tasks and an overall female advantage on verbal tasks.  These differences are inconsistent in children.  The present study examined relations among age, sex, EEG hemispheric activation, and performance on spatial and verbal tasks.  Thirty-two eight-year-olds (16 boys) and 32 college students (16 men) had EEG recorded at baseline and while performing a computerized 2-dimensional Gingerbread Man mental rotation task, a computerized 2-dimensional Alphanumeric mental rotation task, a computerized 3-dimensional Basketball Player mental rotation task, and a computerized Lexical Decision-Making task.  Additionally, participants completed a paper-and-pencil Water Level task and an oral Verbal Fluency task.  On the 2-dimensional Alphanumeric and 3-dimensional Basketball Player mental rotation tasks men performed better than boys, but the performance of women and girls did not differ.  On the Lexical Decision-Making and Water level tasks, men performed better than women, while there was no difference between boys and girls.  No sex differences were found on the 2-dimensional Gingerbread Man mental rotation task or Verbal Fluency task.  Analyses of task-related data also indicate that computer familiarization or computer related task demands might contribute to sex differences on computerized tasks.  EEG analyses indicated that, on the 2-dimensional Alphanumeric mental rotation task, men exhibited more left posterior temporal activation than women, while there were no differences between boys and girls.  Additionally, there was evidence that simple, or 2-dimensional, mental rotation tasks are associated with left posterior brain activation, while 3-dimensional mental rotation tasks are associated with right posterior brain activation.  On the 2-dimensional Gingerbread Man mental rotation task, males exhibited more activation of the left parietal area than females, while on the 2-dimensional Alphanumeric mental rotation task, men exhibited more activation of the left posterior temporal area than women.  On the 3-dimensional Basketball player mental rotation task, all participants exhibited greater activation of the right parietal area than the left parietal area.",
  "description_provenance": [
    "Author Email: jorober5@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: rpcooper@vt.edu",
    "Advisor Email: jjfranch@vt.edu",
    "Advisor Email: bhfriedm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:32Z (GMT). No. of bitstreams: 1 ETD-JR.pdf: 369736 bytes, checksum: dcffba666bb5301540d0f1e0503ef3ca (MD5)   Previous issue date: 2001-02-09"
  ],
  "handle": "26514",
  "identifier_other": "etd-03272001-114239",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272001-114239/",
  "identifier_uri": "http://hdl.handle.net/10919/26514",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD-JR.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Mental Rotation",
    "Sex Differences",
    "Verbal Fluency",
    "EEG"
  ],
  "title": "The Effects of Age and Sex on Mental Rotation Performance, Verbal Performance, and Brain Electrical Activity",
  "type": "Dissertation"
}