{
  "contributor_author": "Wang, Xianqin",
  "contributor_committeechair": "Oyama, Shigeo Ted",
  "contributor_committeemember": [
    "Deck, Paul A.",
    "Cox, David F.",
    "Saraf, Ravi F.",
    "Hanson, Brian E."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:08:32Z",
  "date_adate": "2002-03-27",
  "date_available": "2014-03-14T20:08:32Z",
  "date_issued": "2002-03-21",
  "date_rdate": "2003-03-27",
  "date_sdate": "2002-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A series of iron, cobalt and nickel transition metal phosphides was synthesized by means of temperature-programmed reduction (TPR) of the corresponding phosphates.  The same materials, Fe2P, CoP and Ni2P, were also prepared on a silica (SiO2) support.  The phase purity of these catalysts was established by x-ray diffraction (XRD), and the surface properties were determined by N2 BET specific surface area (Sg) measurements and CO chemisorption.  The activities of the silica-supported catalysts were tested in a three-phase trickle bed reactor for the simultaneous hydrodenitrogenation (HDN) of quinoline and hydrodesulfurization (HDS) of dibenzothiophene using a model liquid feed at realistic conditions (30 atm, 370 oC).  The reactivity studies showed that the nickel phosphide (Ni2P/SiO2) was the most active of the catalysts.  Compared with a commercial Ni-Mo-S/g-Al2O3 catalyst at the same conditions, Ni2P/silica had a substantially higher HDS activity (100 % vs. 76 %) and HDN activity (82 % vs. 38 %).   <p>        Because of their good hydrotreating activity, an extensive study of the preparation of silica supported nickel phosphides, Ni2P/SiO2, was carried out.  The parameters investigated were the phosphorus content and the weight loading of the active phase.  The most active composition was found to have a starting synthesis Ni/P ratio close to 1/2, and the best loading of this sample on silica was observed to be 18 wt.%.          </p>  <p>   Extended x-ray absorption fine structure (EXAFS) and x-ray absorption near edge spectroscopy  (XANES) measurements were employed to determine the structures of the supported samples.  The main phase before and after reaction was found to be Ni2P, but some sulfur was found to be retained after reaction.           </p>  <p>  A comprehensive scrutiny of the HDN reaction mechanism was also made over the Ni2P/SiO2 sample (Ni/P = 1/2) by comparing the HDN activity of a series of piperidine derivatives of different structure.  It was found that piperidine adsorption involved an a-H activation and nitrogen removal proceeded mainly by means of a b-H activation though an elimination (E2) mechanism.  The relative elimination rates depended on the type and number of b-hydrogen atoms.  Elimination of b-H atoms attached to tertiary carbon atoms occurred faster than those attached to secondary carbon atoms.  Also, the greater the number of the b-H atoms, the higher the elimination rates.  The nature of the adsorbed intermediates was probed by Fourier transform infrared spectroscopy (FTIR) and temperature-programmed desorption (TPD) of the probe molecule, ethylamine.  This measurement allowed the determination of the likely steps in the hydrodenitrogenation reaction. </p>",
  "description_provenance": [
    "Author Email: xiwang2@vt.edu",
    "Advisor Email: pdeck@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Advisor Email: rsaraf@vt.edu",
    "Advisor Email: hanson@vt.edu",
    "Advisor Email: oyama@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:32Z (GMT). No. of bitstreams: 1 Xianqin-ETD.pdf: 1232219 bytes, checksum: db3862688bde38431314b074a751cefb (MD5)   Previous issue date: 2002-03-21"
  ],
  "handle": "26516",
  "identifier_other": "etd-03272002-001809",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272002-001809/",
  "identifier_uri": "http://hdl.handle.net/10919/26516",
  "publisher": "Virginia Tech",
  "relation_haspart": "Xianqin-ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Hydrodenitrogenation mechanism",
    "Hydrodenitrogenation",
    "Hydrodesulfurization",
    "Phosphorus effect",
    "Iron group phosphide",
    "EXAFS",
    "Structure-sensitivity"
  ],
  "title": "Novel, High Activity Hydroprocessing Catalysts: Iron Group Phosphides",
  "type": "Dissertation"
}