{
  "contributor_author": "Grove, Tina Moler",
  "contributor_committeecochair": [
    "Marcy, Joseph E.",
    "Hackney, Cameron Raj"
  ],
  "contributor_committeemember": [
    "Duncan, Susan E.",
    "Bishop, J. Russell",
    "Jones, Gerald M."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:08:31Z",
  "date_adate": "2000-04-04",
  "date_available": "2014-03-14T20:08:31Z",
  "date_issued": "1998-11-24",
  "date_rdate": "2001-04-04",
  "date_sdate": "2000-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The effects of natamycin, oxygen scavengers and a 25% CO<sub>2</sub>:75% N<sub>2</sub> modified atmosphere on the growth of <I>Penicillium roqueforti</I> in shredded cheddar and mozzarella cheese stored at 10<sup>o</sup>C for 0, 60, 120, or 180 day was studied.  Microbiological and sensory testing was assessed on 0, 7, 14 and 21 days after opening. Carbon dioxide decreased (P<0.05) as O<sub>2</sub> (P>0.05) and N<sub>2</sub>  (P>0.05) increased throughout storage. Cheddar and mozzarella cheeses were stored for 180 and 60 days, respectively without significant (P> 0.05) increases in yeast and mold populations.  Fungal populations increased significantly (P< 0.05) after packages were opened.  Differences in yeast and mold (YM) counts during storage and once the packages were opened were independent of natamycin application and presence, O<sub>2</sub> scavengers and inoculated <I>Penicillium roqueforti</I> for both types of cheeses.  <p> Growth of <I>Penicillium roqueforti, Aspergillus niger, Geotrichum candidum</I> and <I>Neosartorya fischeri</I> were evaluated in atmospheres of 0:30:70, 0.5:29.5:70, 1:29:70, 2:28:70, and 5:25:70, O<sub>2</sub>:CO<sub>2</sub>:N<sub>2</sub> over a 5-day period.  Spores were cultured on antibiotic-supplemented potato dextrose agar (pH 5.6, a<sub>w</sub> 0.95) and incubated at 25<sup>o</sup>C.  All four molds germinated and grew at 0.5:29.5:70.   Extent of mycelia growth diameter (mm) increased significantly (P<0.05) as oxygen concentration increased from 0.5% to 5%.  All growth was inhibited at 0:30:70, but germination and growth occurred once cultures were exposed to 20.9% atmospheric O<sub>2</sub>, indicating that a modified atmosphere containing no residual O<sub>2</sub> is fungistatic.  <p> Yeast and mold growth was seen in ultra-pasteurized (UP) extended shelf-life fluid milk stored at (7.2<sup>o</sup>C).  Ten half-pint, pint, quart and half gallon filled cartons were randomly selected from all UP products available.  Samples, pulled at random on day 0, 15, 30, 45, and 60, were plated on Yeast and Mold Petrifilm<sup>TM</sup>.  Forty-seven percent of the UP products stored for 45 days tested positive for mold.  Fungal growth was apparent down the side and along the bottom of the 5th panel.  Contamination was traced to the presence of yeast and mold spores in paperboard cartons.  Pinholes were present in the polyethylene coating and wicking occurred at the unskived 5th panel. Fungi of similar origin and fatty acid profile were isolated from UP milk products and the paperboard cartons.",
  "description_provenance": [
    "Author Email: hokie.holsteins@erols.com",
    "Advisor Email: jmarcy@vt.edu",
    "Advisor Email: duncans@vt.edu",
    "Advisor Email: hackneyc@vt.edu",
    "Advisor Email: jrbishop@cdr.wisc.edu",
    "Advisor Email: gmjones@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:31Z (GMT). No. of bitstreams: 1 etd.PDF: 200805 bytes, checksum: 649b02432d7c92a2ad3ae78077b3222d (MD5)   Previous issue date: 1998-11-24"
  ],
  "handle": "26512",
  "identifier_other": "etd-03272000-19160052",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272000-19160052/",
  "identifier_uri": "http://hdl.handle.net/10919/26512",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Natamycin",
    "Modified Atmosphere Packaging",
    "oxygen scavenger",
    "UP Milk",
    "Shredded Cheese",
    "Fungi"
  ],
  "title": "Use of Antimycotics, Modified Atmospheres, and Packaging to Affect Mold Spoilage in Dairy Products",
  "type": "Dissertation"
}