{
  "contributor_author": "Hallab, Zaher A. A.",
  "contributor_committeechair": "Uysal, Muzaffer S.",
  "contributor_committeemember": [
    "Khan, Mahmood A.",
    "Hertzler, Ann A.",
    "Hawkins, Donald E.",
    "Murrmann, Suzanne K."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:08:32Z",
  "date_adate": "2000-04-25",
  "date_available": "2014-03-14T20:08:32Z",
  "date_issued": "1999-07-15",
  "date_rdate": "2001-04-25",
  "date_sdate": "2000-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In the field of travel and tourism, scholars with interest in consumer behavior studies have explored different variables and linked them with the individual's behavior.  Variables such as destination image, environmental awareness, service preception, preferences, and motivations for travel are commonly used to understand and predict destination selections and travel behavior.  There is also enough evidence to suggest that healthy-living is positively associated with travel beahvior.  If any, little empirical research has been done to explore and examine the relationship between healthy-living and travel behavior.  The guidelines to healthy-living have not been introduced in the literature of travel and tourism.  This study is intended to shed some light on this issue and contribute to knowledge in this area.  The objective of this study was twofold: (1) to develop a healthy-living attitudinal construct, and (2) examine the relationship between healthy-living behavioral and attitudinal constructs and  selected travel behavior variables. <p>   Pearson's correlation coefficient analysis was undertaken to test the relationship between healthy-living and travel behavior variables.  In addition, using ANOVA, the study examined if there were differences between healthy-living (behavioral and attitudinal) and socio-demographic variables; and by using Tukey's multiple comparison test, significant differences between the different groups were revealed.  Finally, multiple regression analysis was undertaken with the objective to find the degree with which healthy-living alone influences travel behavior while socio-demographic variables are constant or controlled for. <p>   The overall findings of the study revealed that there seems to be a relationship between a healthy-living lifestyle and the individual travel behavior.  However, the direction and strength of this relationship shows variations with respect to different dimensions of the healthy-living construct and selected travel behavior questions. <p>   The perceived importance of the interaction between healthy-living behavior and travel also implies that certain habits and practices of individuals may correspond to certain benefits and expectations that are both valued and obtained from travel experiences and at the destination site.  Such information combined with demographic information may be of great help in understanding better the behavior of travelers to destinations.  This research contributes to lifestyle studies in tourism and sheds further light on the complex nature of travel behavior.",
  "description_provenance": [
    "Author Email: Zaher.Hallab@usm.edu",
    "Advisor Email: Mahmood@vt.edu",
    "Advisor Email: Hertzler@vt.edu",
    "Advisor Email: DHawk@gwu.edu",
    "Advisor Email: Samil@vt.edu",
    "Advisor Email: Smurrm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:32Z (GMT). No. of bitstreams: 1 hallab.pdf: 734675 bytes, checksum: 8b3d4ba3ecdda90531f880cb62f3c084 (MD5)   Previous issue date: 1999-07-15"
  ],
  "handle": "26513",
  "identifier_other": "etd-03272000-20080000",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272000-20080000/",
  "identifier_uri": "http://hdl.handle.net/10919/26513",
  "publisher": "Virginia Tech",
  "relation_haspart": "hallab.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "hospitality",
    "travel behavior",
    "tourism marketing",
    "healthy-living"
  ],
  "title": "An Exploratory Study of the Relationship Between Healthy-Living and Travel Behavior",
  "type": "Dissertation"
}