{
  "contributor_author": "Parham, Creda Pamler Joe",
  "contributor_committeecochair": [
    "Belli, Gabriella M.",
    "Combs, Letitia A."
  ],
  "contributor_committeemember": [
    "Madison-Colmore, Octavia D.",
    "Wiswell, Albert W.",
    "Boucouvalas, Marcie"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:08:32Z",
  "date_adate": "2003-04-29",
  "date_available": "2014-03-14T20:08:32Z",
  "date_issued": "2003-03-18",
  "date_rdate": "2004-04-29",
  "date_sdate": "2003-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine the attributions and responses that managers make to poor performance using the construct of enabling from the field of substance abuse.  Approximately 200 government and 55 non-government managers responded to a three-part questionnaire exploring managersâ   enabling behaviors, attribution of the causes of poor performance for a current or previous poor performer, and demographics of the managers and their selected poor performing subordinate.   The research data showed that there was no appreciable relationship between the managersâ   demographics and the managersâ   enabling or non-enabling behaviors toward the poor performer. The data also indicated that managers attribute poor performance to internal attributions instead of external attributions.  Furthermore, there was no evidence from the data that attribution played a part in which enabling or non-enabling behavior the managers exhibited toward the poor performer. Analysis of the data showed that managers chose the enabling behavior of micromanaging the poor performer by providing close, daily support; eliminating the employeeâ  s responsibilities by extending the deadline; and transferring the problem by transferring the employee to another office. Additionally, some managers indicated that they would reward the poor performance by doing things such as giving ratings commensurate with the norm of the office, before avoiding the poor performance by reducing the requirements of the task.  Managers also chose non-enabling behaviors. When combined with enabling behaviors, non-enabling behaviors were the second choice, after micromanaging and before eliminating the employeesâ   responsibilities.  The top three non-enabling  behaviors used by the managers were giving an oral warning, consulting with management, and giving a written warning.   The research not only showed that managers exhibited enabling and non-enabling behaviors towards poor performing employees, it clearly indicated that a continuum of enabling behavior exists.  At one end of the continuum are non-enabling behaviors in which managers require poor performers to accept the consequences for their poor performance.  At the opposite end of the continuum are behaviors in which managers do not attempt to do anything about either the performance issue or the poor performer.",
  "description_provenance": [
    "Author Email: credapj@talk21.com",
    "Advisor Email: omadison@vt.edu",
    "Advisor Email: awiswell@vt.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: lcombs@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:32Z (GMT). No. of bitstreams: 1 diss2VATech3.pdf: 775264 bytes, checksum: 53404f29ee625de075ec911e5f0542dd (MD5)   Previous issue date: 2003-03-18"
  ],
  "handle": "26517",
  "identifier_other": "etd-03272003-142605",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272003-142605/",
  "identifier_uri": "http://hdl.handle.net/10919/26517",
  "publisher": "Virginia Tech",
  "relation_haspart": "diss2VATech3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Office of Personnel Management (OPM)",
    "Federal Government",
    "Substance Abuse",
    "Non-Enabling",
    "Performance Management"
  ],
  "title": "The Construct of Substance Abuse Enabling Applied to Poor Performance Management: How Managers Deal With Poor Performing Employees",
  "type": "Dissertation"
}