{
  "contributor_author": "Bixler, Larry",
  "contributor_committeecochair": [
    "Hohenshil, Thomas H.",
    "Fortune, Jimmie C."
  ],
  "contributor_committeemember": [
    "Curcio, Claire Cole Vaught",
    "Getz, Hilda M.",
    "Scartelli, Joseph P."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:08:32Z",
  "date_adate": "2001-03-28",
  "date_available": "2014-03-14T20:08:32Z",
  "date_issued": "2001-02-26",
  "date_rdate": "2002-03-28",
  "date_sdate": "2001-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This study was designed to ascertain the current status of the use of music in the counseling work of elementary school counselors. The sample for this study consisted of  counselors who were employed full-time as elementary school counselors, and who were current members of the Virginia Counselors Association. Data were collected through mailed survey packets consisting of a questionnaire regarding counselors' use of music over the past year, and a stamped, self-addressed return envelope. A total of 255 counselors were mailed survey materials. This mailing resulted in 147 usable returns.  <p>Overall, counselors indicated they used music in their work with students. Results showed the 73% of counselors who used music, incorporated it mostly into classroom guidance sessions with kindergarten through second graders, and used mostly commercially produced materials/activities. Respondent who used music were 90% female and 10% male, averaged over 16 years employment in the field of education, and averaged nearly 9 years as elementary school counselors. The majority were currently assigned to one school, and indicated previous elementary school teaching experience in the regular education area. These counselors strongly believed in the ability of music to improve: focus and maintenance of attention; group participation; student/counselor rapport; and retention of concepts taught. A large majority held masters degrees, and perceived themselves as very or somewhat proficient in the use of music as a counseling tool. Nearly all counselors indicated they had received no criticism for using music in their work.  <p>Nearly all survey respondents indicated graduate training in the use of music as a counseling tool as either existent but inadequate, or non-existent. Counselors also saw training through workshops as unavailable. Respondents, however, indicated a strong desire to pursue more training in the use of music as a counseling tool if it was available.  <p>Several recommendations were drawn from the study. These included: the need for more training in the use of music as a counseling tool in both graduate schools and professional workshops; the need for counselors to keep abreast of music materials/activities incorporating music which are, and will become available; and, the need for more research to measure the effects of music when used as a counseling tool with elementary school students.",
  "description_provenance": [
    "Author Email: bixlerl@yahoo.com",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: vaughtc@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: jscartel@runet.edu",
    "Made available in DSpace on 2014-03-14T20:08:32Z (GMT). No. of bitstreams: 1 Bixler-Larry.pdf: 178001 bytes, checksum: 94a04d51d5b27e466c03a86f92b4ef68 (MD5)   Previous issue date: 2001-02-26"
  ],
  "handle": "26515",
  "identifier_other": "etd-03272001-201742",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272001-201742/",
  "identifier_uri": "http://hdl.handle.net/10919/26515",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bixler-Larry.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "music",
    "school counseling",
    "counseling"
  ],
  "title": "The Status of the Use of Music As a Counseling Tool By Elementary School Counselors In Virginia",
  "type": "Dissertation"
}