{
  "contributor_author": "Stimpson, Matthew",
  "contributor_committeechair": "Janosik, Steven M.",
  "contributor_committeecochair": "Miyazaki, Yasuo",
  "contributor_committeemember": [
    "Hirt, Joan B.",
    "Bonner, Cynthia"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:34Z",
  "date_adate": "2009-04-23",
  "date_available": "2014-03-14T20:08:34Z",
  "date_issued": "2009-03-23",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examined whether measures of social capital were significant predictors of enrollment in postsecondary education for students from a low SES background. Results take the form of two articles. The first article addresses enrollment in four-year institutions of postsecondary education, and the second article addresses enrollment in two-year institutions of postsecondary education. The research questions for this study were:<ol> <li>\tDoes probability of enrollment in a four-year postsecondary institution or a two-year postsecondary institution for low SES students differ by mean school SES? <li>\tDoes probability of enrollment in a four-year postsecondary institution or a two-year postsecondary institution for low SES students differ by school locale? <li>\tWhen controlling for contextual or environmental variables and student background characteristics, are low SES students with higher levels of social capital more likely to enroll in a four-year postsecondary institution or a two-year postsecondary institution than low SES students with lower levels of social capital? <li>\tWhen controlling for contextual or environmental variables, background characteristics, and level of social capital does probability of enrollment in a four-year institution of postsecondary education or a two-year postsecondary institution vary by race for low SES students?</li></ol> When controlling for school level variables, academic achievement and preparation, and select background characteristics, low SES students with higher levels of social capital are more likely to enroll in a four-year college. Students whose parents expected them to obtain more education and those students who obtained more information about attending college were more likely to enroll in a four-year university. In the analysis of enrollment in four-year institutions of postsecondary education, African American low SES students were three times more likely to enroll in a four-year college or university than low SES Caucasian students.    <p> Only one measure of social capital, information acquisition, was significantly related to enrollment in a two-year institution of postsecondary education. No significant variability in probability of enrollment in a two-year institution of postsecondary education was observed by either of the school level variables used. Race was not a significant factor when controlling for background characteristics and the measures of social capital used in this study.",
  "description_provenance": [
    "Author Email: stimpson@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: cbonner@vt.edu",
    "Advisor Email: yasuom@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:34Z (GMT). No. of bitstreams: 1 M_Stimpson_Dissertation.pdf: 565233 bytes, checksum: 3251fd31ab9a577b788130ccf1c22bba (MD5)   Previous issue date: 2009-03-23"
  ],
  "handle": "26525",
  "identifier_other": "etd-03272009-144458",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272009-144458/",
  "identifier_uri": "http://hdl.handle.net/10919/26525",
  "publisher": "Virginia Tech",
  "relation_haspart": "M_Stimpson_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Social Capital",
    "Hierarchical Linear Modeling",
    "Low SES",
    "Enrollment in Postsecondary Education"
  ],
  "title": "Examining Social Capital as a Predictor of Enrollment in Postsecondary Education for Low SES Students: A Multilevel Analysis",
  "type": "Dissertation"
}