{
  "contributor_author": "Hudgins, Cathy Mills",
  "contributor_committeechair": "Keeling, Margaret L.",
  "contributor_committeemember": [
    "Mancini, Jay A.",
    "Mann, Jeff A.",
    "Piercy, Fred P."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:08:33Z",
  "date_adate": "2008-04-23",
  "date_available": "2014-03-14T20:08:33Z",
  "date_issued": "2008-02-15",
  "date_rdate": "2009-04-23",
  "date_sdate": "2008-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Environmentally-constructed, regional culture as defined by geographic place is not generally included in family therapy research and training concerning race, ethnicity, gender, sexual orientation, and other contextual factors. This grounded theory research project explores how practitioners working with families acknowledge, access, and use region as a cultural context in their service delivery, specifically in the New River Valley region of Southwest Virginia. Ecological theory, social construction theory, family systems theory, and cultural competency perspectives were used to frame the research questions, to develop the interview protocol, and to support the analysis of the properties and dimensions of the concepts and categories that emerged from the data analysis. The resulting grounded theory revealed that clinicians working with regionally distinct clients combine a client-centered approach with multiple-layers of regional knowledge and self-awareness.",
  "description_provenance": [
    "Author Email: hudginsc@vt.edu",
    "Advisor Email: mkeeling@vt.edu",
    "Advisor Email: mancini@vt.edu",
    "Advisor Email: jeffmann@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:33Z (GMT). No. of bitstreams: 1 disserationdraft2cmh40708final.pdf: 418895 bytes, checksum: 4e0ca985a71d3c9cae5f186060b3b587 (MD5)   Previous issue date: 2008-02-15"
  ],
  "handle": "26521",
  "identifier_other": "etd-03272008-121844",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272008-121844/",
  "identifier_uri": "http://hdl.handle.net/10919/26521",
  "publisher": "Virginia Tech",
  "relation_haspart": "disserationdraft2cmh40708final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Marriage and Family Therapy",
    "regional identity",
    "cultural competency",
    "rural mental health"
  ],
  "title": "Region as a Cultural Context in Family Therapy",
  "type": "Dissertation"
}