{
  "contributor_author": "Byrd, C.  Noel",
  "contributor_committeechair": "Doolittle, Peter E.",
  "contributor_committeecochair": "Jones, Brett D.",
  "contributor_committeemember": [
    "Williams, Thomas O. Jr.",
    "Asselin, Susan B."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:08:33Z",
  "date_adate": "2009-05-04",
  "date_available": "2014-03-14T20:08:33Z",
  "date_issued": "2009-03-20",
  "date_rdate": "2012-04-27",
  "date_sdate": "2009-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Educational research contains many data-driven implications for inservice educational professionals including those who work closely with students with disabilities, special educators. Although special education professionals are under increasing directives to make use of this body of literature in the form of evidence-based practices, they historically strive for self-improvement and often look to research information for strategies as well as innovative approaches to help improve student achievement. Therefore, developing a comprehensive understanding of the issues related to the use of and perceived barriers to educational research information is critical to cultivating a more synergistic relationship between academia and inservice educational professionals. <p>  The current study queried 130 inservice special education professionals using an online, anonymous survey instrument. Participants were asked to respond to items that related to four main variables that may exert influence over their interaction with educational research information: general perceptions about educational research, perceived barriers to the use of educational research, typical sources of educational research information, and self-efficacy in the context of information literacy. Self-efficacy, as measured by confidence ratings, was investigated through two contexts: (a) finding information (general vs. research information), and (b) specific steps in the information literacy skill set.  <p> The resulting data were analyzed using descriptive and inferential statistics including t-tests and Analysis of Variance (ANOVA). Results indicated that teachers generally hold positive perceptions of educational research, use a wide variety of sources for research information, and believe three main barriers exist to their use of research information: time, access, and the manageability of information. Although self-efficacy ratings were higher for finding general information versus research information, no differences were present between the steps of the information literacy skill set.",
  "description_provenance": [
    "Author Email: cnbyrd@vt.edu",
    "Advisor Email: brettjones@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: thwilli1@vt.edu",
    "Advisor Email: sasselin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:33Z (GMT). No. of bitstreams: 1 CNoelByrdDissertationrevised.pdf: 2414468 bytes, checksum: dd03fdf5e501f65fac2ce845a3205819 (MD5)   Previous issue date: 2009-03-20"
  ],
  "handle": "26523",
  "identifier_other": "etd-03272009-110050",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272009-110050/",
  "identifier_uri": "http://hdl.handle.net/10919/26523",
  "publisher": "Virginia Tech",
  "relation_haspart": "CNoelByrdDissertationrevised.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "special education",
    "information literacy",
    "educational research",
    "evidence-based practice",
    "teachers",
    "self-efficacy"
  ],
  "title": "Teachers' Perceptions of Educational Research: A Self-Efficacy Perspective",
  "type": "Dissertation"
}