{
  "contributor_author": "Ober, Christopher Patrick",
  "contributor_committeechair": "Jones, Jeryl C.",
  "contributor_committeemember": [
    "Elster, Allen D.",
    "Larson, Martha Moon",
    "Wyatt, Christopher L.",
    "lanz, Otto I."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:08:34Z",
  "date_adate": "2009-04-24",
  "date_available": "2014-03-14T20:08:34Z",
  "date_issued": "2009-03-17",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Injury of the manus is an important cause of morbidity and function loss in dogs, especially working breeds. These injuries may cause foreign body retention and can lead to persistent infection. Accurate methods for diagnosis and localization of pathology in this anatomically complex region are critical to minimize patient morbidity, guide surgical planning, and improve case outcomes. <p>      The anatomy of the canine manus was evaluated with computed tomography (CT), magnetic resonance imaging (MRI), and transverse anatomic sections. Most structures identified on transverse sections were visible on both CT and MRI images. Detail in the osseous structures was better in CT images, while MRI provided increased contrast of soft-tissue structures. <p>      To test the hypothesis that diagnostic accuracies of CT, MRI, and ultrasound differ for detection of acute wooden foreign bodies in the canine manus, we inserted wooden splinters into canine cadaver manus and imaged each manus with all three modalities. Receiver operating characteristic curve analysis demonstrated that CT was most accurate for detection of acute wooden foreign bodies, followed in turn by ultrasound and MRI. <p>      Diseases in the human hand and foot are often confined by soft-tissue spaces, but similar structures have not been described in the dog. To determine if these spaces are present in the canine manus, we injected contrast medium into likely spaces and compartments in cadaver specimens, imaged the limbs with CT, and dissected the injected manus specimens. We found thirteen discrete soft-tissue spaces and five myofascial compartments that are similar to those described in the human hand. <p>      To test the hypothesis that spread of disease in the canine manus can be modeled and predicted, we injected cadaver interdigital web spaces with contrast medium, imaged them with CT, and dissected them. We found that the pattern of contrast agent spread, as a model of infection, was predictable and unique to the initial injection site.<p>       Findings from these cadaver studies improve our understanding of anatomy, imaging of wooden foreign bodies, and likely patterns of disease extension in the canine manus.  Future studies are needed to test the utility of this information for surgical planning in affected clinical patients.",
  "description_provenance": [
    "Author Email: ober@vt.edu",
    "Advisor Email: aelster@wfubmc.edu",
    "Advisor Email: moonm@vt.edu",
    "Advisor Email: jcjones@vt.edu",
    "Advisor Email: clwyatt@vt.edu",
    "Advisor Email: olanz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:34Z (GMT). No. of bitstreams: 1 OberDissertationFinal.pdf: 58142120 bytes, checksum: 9cb79ff8bd12d2fe59b1a6a00051085f (MD5)   Previous issue date: 2009-03-17"
  ],
  "handle": "26524",
  "identifier_other": "etd-03272009-121924",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272009-121924/",
  "identifier_uri": "http://hdl.handle.net/10919/26524",
  "publisher": "Virginia Tech",
  "relation_haspart": "OberDissertationFinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "magnetic resonance imaging",
    "soft-tissue space",
    "myofascial compartment",
    "computed tomography",
    "ultrasound"
  ],
  "title": "Diagnostic Imaging of Foreign Bodies and Compartmentalization in the Canine Manus",
  "type": "Dissertation"
}