{
  "contributor_author": "Zhao, Haiyan",
  "contributor_committeechair": "Oyama, Shigeo Ted",
  "contributor_committeemember": [
    "Cox, David F.",
    "Achenie, Luke E.",
    "Tanko, James M."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:08:34Z",
  "date_adate": "2009-05-06",
  "date_available": "2014-03-14T20:08:34Z",
  "date_issued": "2009-03-19",
  "date_rdate": "2009-05-06",
  "date_sdate": "2009-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation describes two related studies on hydrogenation and hydrodesulfurization of heterocyclic S-containing compounds. Alkyl substituted thiophenes are promising candidates for hydrogen carriers as the dehydrogenation reactions are known to occur under mild conditions.  Four types of catalysts including supported noble metals, bimetallic noble metals, transition metal phosphides and transition metal sulfides have been investigated for 2-methylthiophene (2MT) hydrogenation and ring opening.  The major products were tetrahydro-2-methylthiophene (TH2MT), pentenes and pentane, with very little C5-thiols observed.   The selectivity towards the desired product TH2MT follows the order:  noble metals > bimetallics > phosphides > sulfides.  The best hydrogenation catalyst was 2% Pt/Al2O3 which exhibited relatively high reactivity and selectivity towards TH2MT at moderate temperatures.   Temperature-programmed desorption (TPD) of hydrogen indicated that the H2 desorption amount was inversely related to the rate of TH2MT formation. Temperature programmed reaction (TPR) experiments revealed that pentanethiol became the major product, especially with HDS catalysts like CoMoS/Al2O3 and WP/SiO2, which indicates that poisoned or modified conventional HDS catalysts would be good candidates for further 2MT hydrogenation studies. The role of tetrahedral Ni(1) sites and square pyramidal Ni(2) sites in Ni2P hydrotreating catalysts was studied by substitution of Ni with Fe.  The Fe component was deemed as a good probe because Ni2P and Fe2P adopt the same hexagonal crystal structure, yet Fe2P is completely inactive for hydrodesulfurization (HDS).  For this purpose a series of NiFeP/SiO2 catalysts were prepared with different Ni:Fe molar ratios (1:0, 3:1, 1:1, 1:3, and 0:1) and investigated in the HDS of 4,6-dimethyldibenzothiophene at 300 and 340 oC.  The uniformity of the NiFe series was demonstrated by x-ray diffraction analysis and by Fourier transform infrared (FTIR) spectroscopy of adsorbed CO.  The position of substitution of Fe was determined by extended X-ray absorption fine structure (EXAFS) analysis.  It was found that at 300 oC the HDS activity of the catalysts decreased with increasing Fe content and that this could be explained by the substitution of Fe at the more active Ni(2) sites.   As temperature was raised to 340 oC, the activity of the Fe-containing samples increased, although not to the level of Ni2P, and this could be understood from a reconstruction of the NiFe phase to expose more Ni(2) sites.  This was likely driven by the formation of surface Ni-S bonds, which could be observed by EXAFS in spent samples.",
  "description_provenance": [
    "Author Email: zhaohy@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Advisor Email: achenie@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: oyama@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:34Z (GMT). No. of bitstreams: 1 dissertation5-5-2009.pdf: 2066310 bytes, checksum: 327c61c05a970cf7407257b6e2a46931 (MD5)   Previous issue date: 2009-03-19"
  ],
  "handle": "26526",
  "identifier_other": "etd-03272009-233526",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272009-233526/",
  "identifier_uri": "http://hdl.handle.net/10919/26526",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation5-5-2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "FTIR",
    "EXAFS",
    "Phosphides",
    "Bimetallic",
    "H2 storage",
    "2MT",
    "HYD",
    "HDS",
    "ROP"
  ],
  "title": "Catalytic Hydrogenation and Hydrodesulfurization of Model Compounds",
  "type": "Dissertation"
}