{
  "contributor_author": "Robinson, Rose Marie",
  "contributor_committeechair": "Williams, Kimberly Forsten",
  "contributor_committeemember": [
    "Van Cott, Kevin E.",
    "Huckle, William R.",
    "Davis, Richey M.",
    "Akers, Robert Michael"
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:08:33Z",
  "date_adate": "2006-08-24",
  "date_available": "2014-03-14T20:08:33Z",
  "date_issued": "2004-04-23",
  "date_rdate": "2006-08-24",
  "date_sdate": "2006-03-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Understanding how insulin-like growth factor-I (IGF-I) signaling in mammary epithelial cells may be modified or interrupted by modifications in the cellular environment may lead to 1) methods to increase the growth and proliferation of normal mammary epithelial cells for an increase in the amount of milk produced on a per animal basis or to 2) the development of medical interventions to disrupt the growth and proliferation of cancerous mammary epithelial cells.  IGF-I, a signaling protein provided by stromal cells and through the bloodstream, stimulates the proliferation of mammary epithelial cells and is crucial for mammary development.  Collagen I is an extracellular matrix protein (ECM) found in skin and in other connective tissues throughout the body.  The guiding question in this dissertation was how IGF-I signaling and how binding protein profile were influenced by autocrine IGF-I and by collagen I.  The MAC-T cell line was chosen as the cell model utilized in these investigations because it is an immortalized bovine mammary epithelial cell line known to retain hormonal responsiveness to IGF-I.<p>  It was hypothesized that the production of IGF-I by mammary epithelial cells (autocrine secretion) would alter the response of these cells to additional IGF-I by de-sensitizing the IGF-I receptor on the cell surface.  The normal mammary epithelial cell does not produce IGF-I and responds to IGF-I supplied either by stromal cells (paracrine pathway) or through the bloodstream (endocrine pathway).  The IGF-I secreting bovine mammary epithelial cell line was investigated for the response of the cells to autocrine IGF-I, and the response was compared to the normal, parental cell line.  To examine the effect of autocrine IGF-I on the cells, IGF-I was added both to MAC-T cells and to cells transfected to secrete IGF-I (SV40-IGF-I).  The cell response of the two cell lines was compared using microphysiometry, a tool that measures IGF-IR stimulation by detecting resultant extracellular acidification.  It was found that the SV40-IGF-I cell line retains IGF-I receptor sensitivity, yet, unlike the parental cell line, does not proliferate in response to IGF-I.  Both cell lines exhibited increased protein synthesis in response to IGF-I as measured by amino acid uptake (AIB incorporation), but the lack of a proliferation response to additional IGF-I in the SV40-IGF-I cell line suggested that the autocrine cell line exhibited an un-coupling of IGF-IR stimulation with downstream cell proliferation.  Both autocrine IGF-I and added IGF-I increased the amount of IGFBP-3 secreted by the cells into growth media.<p>  Additionally, it was hypothesized that the presence of collagen I, an important ECM protein, would alter the cell production of insulin-like binding protein-3 (IGFBP-3), a protein that modulates IGF-I interaction with the IGF-I receptor (IGF-IR).  The literature reports that surface substrate can affect the phenotypic expression of cells, presumably via interaction with integrins, the cell surface receptors that connect cells to ECM proteins and that are responsible for cell adhesion and for cell migration.  It was hypothesized that the MAC-T cells would interact with a collagen I surface (possibly via the a2b1 integrin) and that the stimulation of this transmembrane signaling molecule would in turn impact the IGF-I signaling pathway.  Comparison studies on tissue culture plastic, collagen I BIOCOAT, and collagen I gel were performed.  It was found that collagen I gel increased IGFBP-3 secretion and decreased insulin-like binding protein-2 (IGFBP-2) secretion in MAC-T cells. The collagen I BIOCOAT did not induce this response.  <p>  Additional studies were performed to determine if there were differences in IGF-IR phosphorylation, exogenous IGF-I utilization, and IGFBP mRNA production by cells cultured on the three different substrates.  IGF-IR phosphorylation was only evident following the addition of IGF-I to MAC-T cells on all three substrates.  Measurement of residual IGF-I present in the cultured media of cells on all three substrates by radioimmunoassay did not reveal any differences in the amount of IGF-I present.  Northern blot analysis revealed that the addition of IGF-I caused an increase in detected IGFBP-3 mRNA and a decrease in detected IGFBP-2 mRNA across all three surfaces.  As measured by ligand blot analysis, cells cultured on all three surfaces showed an increase in IGFBP-3 protein in the media with IGF-I addition, and the collagen I gel showed more IGFBP-3 protein than the other two surfaces.  However, cells cultured on collagen I gel showed a decrease in IGFBP-2 protein expression compared to cells cultured on tissue culture both with and without the addition of IGF-I.  Cells cultured on tissue culture plastic and on collagen I BIOCOAT did not show a decrease in IGFBP-2 to correspond with the decreased IGFBP-2 mRNA detected in the presence of IGF-I on all three substrates.  DNA assays to detect cell proliferation revealed no differences in cell DNA content in the absence of exogenous IGF-I and revealed similar increases in response to IGF-I addition on all three substrates.<p>  In conclusion, it was found that autocrine IGF-I un-couples increased IGF-IR stimulation by exogenous IGF-I from a downstream cell proliferation response.  IGFBP-3 inhibits the ability of IGF-I to interact with the IGF-IR in MAC-T cells and inhibits subsequent cell proliferation.  Collagen I gel increases IGFBP-3 secretion and decreases IGFBP-2 secretion by MAC-T cells.  <p>  The relevance of this work is that it adds to the body of knowledge in understanding cellular function in mammary epithelial cells.  It is known that the growth and the maintenance of living tissue are dependent on an intricate system of intercellular and intracellular responses which are orchestrated by the movement and secretion of proteins and other molecules.  Goals of understanding mammary epithelial cell function include having the means to find ways to increase cell functionality via bioengineering and having the means to find ways to restore cells to normal function in disease processes such as cancer. <p>",
  "description_provenance": [
    "Author Email: rorobin3@vt.edu",
    "Advisor Email: kvancott2@unlnotes.unl.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: rma@vt.edu",
    "Advisor Email: kfw@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:33Z (GMT). No. of bitstreams: 4 Robinson3of3.pdf: 3974018 bytes, checksum: c54bd770af4f202b05beb431d28afa7b (MD5) Robinson2of3.pdf: 1330791 bytes, checksum: f2b5f476d8c0268310a862dfe6a12bfe (MD5) Robinson1of3.pdf: 121216 bytes, checksum: f99757783cdc469e9ebd73304db8e794 (MD5) RobinsonTitle.pdf: 52697 bytes, checksum: 3b099011d6210000398e8492c15081b8 (MD5)   Previous issue date: 2004-04-23"
  ],
  "handle": "26520",
  "identifier_other": "etd-03272006-200540",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03272006-200540/",
  "identifier_uri": "http://hdl.handle.net/10919/26520",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Robinson3of3.pdf",
    "Robinson2of3.pdf",
    "Robinson1of3.pdf",
    "RobinsonTitle.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Collagen I",
    "IGF-I",
    "Insulin-Like Growth Factor Binding Protein-2",
    "Insulin-Like Growth Factor Binding Protein-3",
    "Insulin-Like Growth Factor-I",
    "IGFBP-3",
    "MAC-T",
    "IGFBP-2",
    "Collagen I Gel"
  ],
  "title": "Regulation of Bovine Mammary Epithelial Cell Response by Autocrine IGF-I and by Collagen I",
  "type": "Dissertation"
}