{
  "contributor_author": "DePasquale, Jason P.",
  "contributor_committeechair": "Geller, E. Scott",
  "contributor_committeemember": [
    "Foti, Roseanne J.",
    "Hauenstein, Neil M. A.",
    "Finney, Jack W.",
    "Donovan, John J."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:08:34Z",
  "date_adate": "2000-04-25",
  "date_available": "2014-03-14T20:08:34Z",
  "date_issued": "1999-09-24",
  "date_rdate": "2001-04-25",
  "date_sdate": "2000-03-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Structural equation modeling procedures were used to further the current understanding of the construct 창  personal responsibility창  . Broadly defined, personal responsibility is a state in which an individual feels a sense of obligation to a situation or event (Cummings & Anton, 1990; Dose & Klimoski, 1995). Behaviors performed due to personal responsibility are performed for internal as opposed to external reasons. It was hypothesized that feelings of personal responsibility could be influenced by both individual (interdependent self-construal, group cohesion, and trust) and organizational (personal control) variables. More so, it was proposed that employees창   feelings of personal responsibility would be significantly associated with participation in an organization창  s safety process. <p>Participants were 219 employees of a bearings plant located in southwest Virginia. Only one variable, trust in management, predicted employee feelings of personal responsibility to participate in a behavior-based safety (BBS) process. Contrary to expectations, in the structural model there was no significant relationship between feelings of personal responsibility to be involved in the process and levels of involvement (b = .24). Involvement in the current investigation was assessed with two self-report survey items and by tracking employee observations performed with a critical behavior checklist (CBC). <p>Interestingly, feelings of personal responsibility was predictive of safety observations performed, as well as self reported involvement in the process, when these two involvement variables were looked at in separate regression equations. Furthermore, personal responsibility was predictive of these variables over and above the similar variable conscientiousness. <p>The current study also investigated the impact of voluntary participation in a behavior-based safety process on frequency of safe behavior performance, both on the job and while driving. Unfortunately, the number of employees participating in the process was minimal (n = 7). A visual inspection of the data did not indicate any apparent changes in self-reports of safe behavior for either work-related or driving behaviors as a function of participation in the safety process. <p>In conclusion, the current investigation can be considered an initial step in the empirical study of the personal responsibility construct. It is suggested that a number of relationships may not have been found because of the short-term nature of the current project. Future research is needed that is more longitudinal in nature.",
  "description_provenance": [
    "Author Email: Jasond@isrsurveys.com",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: esgeller@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: donovan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:34Z (GMT). No. of bitstreams: 1 depasquale.PDF: 292164 bytes, checksum: c40b60608b1953578764bc1019c0eafd (MD5)   Previous issue date: 1999-09-24"
  ],
  "handle": "26528",
  "identifier_other": "etd-03282000-15590036",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03282000-15590036/",
  "identifier_uri": "http://hdl.handle.net/10919/26528",
  "publisher": "Virginia Tech",
  "relation_haspart": "depasquale.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "industrial-organizational psychology",
    "organizations",
    "participation",
    "responsibility"
  ],
  "title": "Exploring Personal Responsibility for Participation in Organizational Processes: Antecedents and Consequences",
  "type": "Dissertation"
}