{
  "contributor_author": "Kiersey, Nicholas Jeremiah",
  "contributor_committeechair": "Luke, Timothy W.",
  "contributor_committeemember": [
    "Toal, Gerard",
    "Watson, R. Janell",
    "Nelson, Scott C."
  ],
  "contributor_department": "Planning, Governance, and Globalization",
  "date_accessioned": "2014-03-14T20:08:35Z",
  "date_adate": "2007-04-11",
  "date_available": "2014-03-14T20:08:35Z",
  "date_issued": "2007-03-23",
  "date_rdate": "2010-04-11",
  "date_sdate": "2007-03-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation explores how different understandings of power in IR theory lead to different understandings of world order. In particular, I examine how notions of power have informed recent 'debate about empireâ   and what the term empire might usefully mean in the context of contemporary international relations. I start by investigating how power is understood in relation to the role of shared understandings. Mainstream or â  Rationalistâ   scholars of IR have argued that shared norms and principles are epiphenomenal, existing only to the extent that sovereign states find utility in them. 'Reflectivist' scholars, on the other hand, have suggested that we attribute a much greater degree of autonomy to what they call â  constitutive knowledgeâ  . That is, the intersubjective and historically contingent truths about world politics that inform the values and norms of state behavior. What is noteworthy about the recent debates about â  empireâ   is that, for better or for worse, Rationalist scholars have tended to explain Americaâ  s recent unilateralism in terms of a return to the logic of political realism which gives primacy to state power. However, following the Reflectivist argument, I argue that it is a mistake to limit the analytic scope of unilateralism to the egoistic agency of any one state. Instead, it may be more precise to situate American unilateralism in the context of an emerging regime or formation of shared understandings which is more global in scope. To explore this possibility, I turn to Foucaultâ  s theory of power which explores how liberal governments both direct their populations and rationalize the use of certain forms of violence. I turn also to Hardt and Negri who, taking their lead from Foucault, offer a novel definition of the term empire as a quality or condition of the practice of global governance particular to late modernity. Hardt and Negri define empire as a new form of global sovereignty that has emerged along with the global market and global circuits of production. My research explores how this definition can be used to refine such key concepts and categories of IR theory research as sovereignty, political economy and security. Through the reinterpretation of these key categories, I show how theories based on constitutive knowledge are capable of recognizing that there is in fact a great deal more going on in contemporary global power relations than American unilateralism.",
  "description_provenance": [
    "Author Email: nkiersey@vt.edu",
    "Advisor Email: toalg@vt.edu",
    "Advisor Email: rjwatson@vt.edu",
    "Advisor Email: scnelson@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:35Z (GMT). No. of bitstreams: 1 kiersey.pdf: 1139492 bytes, checksum: 97c096e4d9ff55f5022a9f09c58c84cc (MD5)   Previous issue date: 2007-03-23"
  ],
  "handle": "26534",
  "identifier_other": "etd-03282007-171817",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03282007-171817/",
  "identifier_uri": "http://hdl.handle.net/10919/26534",
  "publisher": "Virginia Tech",
  "relation_haspart": "kiersey.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "war",
    "ethics",
    "international relations theory",
    "imperialism",
    "empire",
    "globalization",
    "governmentality",
    "unilateralism",
    "world order",
    "legitimacy",
    "war on terror",
    "disciplinarity",
    "biopower",
    "biopolitics"
  ],
  "title": "Power and International Relations Theory; Why the 'Debate About Empire' Matters?",
  "type": "Dissertation"
}