{
  "contributor_author": "Baditoi, Barbara E.",
  "contributor_committeechair": "Crockett, Jean B.",
  "contributor_committeemember": [
    "Isaacson, Judith",
    "Belli, Gabriella M.",
    "Parson, Stephen R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:35Z",
  "date_adate": "2005-04-14",
  "date_available": "2014-03-14T20:08:35Z",
  "date_issued": "2005-02-10",
  "date_rdate": "2005-04-14",
  "date_sdate": "2005-03-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Students Placed At-Risk of School Failure In An Era of Educational Reform: Implications for Staff Development  Barbara E. Baditoi\t Dr. Jean B. Crockett, Chair (ABSTRACT) The face of Americaâ  s schools is changing. An increasingly diverse and challenging population of students blends assorted ethnic backgrounds, varied approaches to learning, and different socio-economic backgrounds into one student body. Faced with the realities of environmental and educational stressors, some students may find the educational milieu difficult. One particular group of students who may fit this category are those placed at-risk of school failure. The No Child Left Behind Act of 2001, the latest government reform in education to affect our nationâ  s schools, created additional pressures on educators and students alike. In this climate of increased testing and accountability, educators must be trained to work with todayâ  s students. Staff development is one method of assisting educators to become knowledgeable about the needs of students placed at-risk of school failure in the current reform era. Guiding issues for this study were the nature of staff development with regard to students placed at-risk of school failure in an era of educational reform as viewed through staff development. Guiding questions were how many staff development courses were aimed at meeting the needs of students placed at-risk of school failure and how much of this training was done relative to content-based staff development. Staff development offices were chosen because they are the conduits through which school district employees often gain substantial knowledge and training, and because of their importance in the field of training and professional development. The method used in this study was a content analysis of staff development course documents from the 100 largest school districts in the United States. The intent of this quantitative content analysis was to explore how school district staff development offices approach the task of educating their employees to work with a complex, diverse school population, often seen as at-risk of school failure. This study was important to the field of educational leadership because it provided essential and useful information, both for educators working with an increasingly diverse student population, especially students at-risk of school failure, and for district leaders whose task it is to provide staff development for those who teach our children. Quantitative analyses of the staff development course documents showed no relationship between school district size and number of courses with coded words; the total number of courses a school district offered was, however, a predictor for the total number of targeted courses. All but one of the school districts sampled had at least one course with a coded word. A qualitative analysis of the coding of the categories and indicators revealed that the coded words were applied broadly to the themes and patterns that emerged. School district staff development offices continue to play a positive role in the training of educators striving to meet the needs of a diverse student body in the 21st century.",
  "description_provenance": [
    "Author Email: bbaditoi@vt.edu",
    "Advisor Email: Judith.Isaacson@fcps.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:35Z (GMT). No. of bitstreams: 1 Baditoi.pdf: 360640 bytes, checksum: 0633c9598ce4e4152d2c09ac5eb02155 (MD5)   Previous issue date: 2005-02-10"
  ],
  "handle": "26531",
  "identifier_other": "etd-03282005-194752",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03282005-194752/",
  "identifier_uri": "http://hdl.handle.net/10919/26531",
  "publisher": "Virginia Tech",
  "relation_haspart": "Baditoi.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "At-Risk Students",
    "School Reform",
    "Staff Development"
  ],
  "title": "Students Placed At-Risk of School Failure In An Era of Educational Reform: Implications for Staff Development",
  "type": "Dissertation"
}