{
  "contributor_author": "Brazeau, Randi Hope",
  "contributor_committeechair": "Edwards, Marc A.",
  "contributor_committeemember": [
    "Falkinham, Joseph O. III",
    "Pruden-Bagchi, Amy Jill",
    "Pearce, Annie R."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:08:35Z",
  "date_adate": "2012-04-24",
  "date_available": "2014-03-14T20:08:35Z",
  "date_issued": "2012-03-23",
  "date_rdate": "2012-04-24",
  "date_sdate": "2012-03-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Residential water heating is linked to the primary source of waterborne disease outbreaks in the United States, and accounts for greater energy demand than the combined water/wastewater utility sector. To date, there has been little research that can guide decision-making with regards to water heater selection and operation to minimize energy costs and the likelihood of waterborne disease.   <p> We have outlined three types of systems that currently dominate the marketplace: 1) a standard hot water tank with no hot water recirculation (STAND), 2) a hot water tank with hot water recirculation (RECIRC), and 3) an on-demand tankless hot water system with no hot water recirculation (DEMAND).   <p> Not only did the standard system outperform the hot water recirculation system with respect to temperature profile during flushing, but STAND also operated with 32 â   36% more energy efficiency.  Although RECIRC did in fact save some water at the tap, when factoring in the energy efficiency reductions and associated water demand, RECIRC actually consumed up to 7 gpd more and cost consumers more money.  DEMAND operated with virtually 100% energy efficiency, but cannot be used in many circumstances dependent on scaling and incoming water temperature, and may require expensive upgrades to home electrical systems. <p> RECIRC had greater volumes at risk for pathogen growth when set at the lower end of accepted temperature ranges, and lower volumes at risk when set at the higher end when compared to STAND.  RECIRC also tended to have much lower levels of disinfectant residual (40 -850%), 4-6 times as much hydrogen, and 3-20 times more sediment compared to standard tanks without recirculation.  DEMAND had very small volumes of water at risk and relatively high levels of disinfection. <p> A comparison study of optimized RECIRC conditions was compared to the baseline modes of operation.  Optimization increased energy efficiency 5.5 â   60%, could save consumers 5 â   140%  and increased the disinfectant residual up to 560% higher disinfectant residual as compared to the baseline RECIRC system.  STAND systems were still between 3 â   55% more energy efficient and could save consumers between $19 - $158 annual on water and electrical costs.  Thus, in the context of â  greenâ   design, RECIRC systems provide a convenience to consumers in the form of nearly instant hot water, at a cost of higher capital, operating and overall energy costs.",
  "description_provenance": [
    "Author Email: randihl@vt.edu",
    "Advisor Email: edwardsm@vt.edu",
    "Advisor Email: jofiii@vt.edu",
    "Advisor Email: apruden@vt.edu",
    "Advisor Email: apearce@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:35Z (GMT). No. of bitstreams: 1 Brazeau_RH_D_2012.pdf: 2310595 bytes, checksum: b35ded30ff6c19d781aad4f1da5cafc1 (MD5)   Previous issue date: 2012-03-23"
  ],
  "handle": "26537",
  "identifier_other": "etd-03282012-125558",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03282012-125558/",
  "identifier_uri": "http://hdl.handle.net/10919/26537",
  "publisher": "Virginia Tech",
  "relation_haspart": "Brazeau_RH_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "water quality",
    "Water-energy nexus",
    "water heaters",
    "pathogens",
    "premise plumbing",
    "energy efficiency"
  ],
  "title": "Sustainability of Residential Hot Water Infrastructure: Public Health, Environmental Impacts, and Consumer Drivers",
  "type": "Dissertation"
}