{
  "contributor_author": "Bermudez, Judith Maria",
  "contributor_committeechair": "Protinsky, Howard O. Jr.",
  "contributor_committeemember": [
    "Singh, Kusum",
    "Prouty, Anne M.",
    "Johnson, Scott W.",
    "Fu, Victoria R."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:08:36Z",
  "date_adate": "2002-04-16",
  "date_available": "2014-03-14T20:08:36Z",
  "date_issued": "2002-02-15",
  "date_rdate": "2003-04-16",
  "date_sdate": "2002-03-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT Conflict resolution style was examined with 191 married Latino couples residing in Houston and Dallas, Texas, representing 21 different nationalities.  The purpose of this research study was to examine conflict resolution styles most predominant among the Latino couples in the sample and to examine if various demographic data correlated with the couples conflict resolution style.  The dependent variables were conflict resolution style (avoidance, volatile, and validator) using Gottmanâ  s MSI (Marital Conflict Scale, 1994).  Using the same items on the MSI, and direct statements about Latinoâ  s communication from the Marriage adn Family Therapy literature, other dependent variables were identified (unity, harmony, autonomy, conservatism and passion) with factor analysis and content analysis.  The statistically significant independent variables were religion, language, education, and country of birth.  The majority of this sample identified them selves as having a validating style of conflict resolution.  Clinical implications for family therapists are discussed.",
  "description_provenance": [
    "Author Email: mbermudez@hs.ttu.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: hprotins@vt.edu",
    "Advisor Email: aprouty@uri.edu",
    "Advisor Email: SWJ@vt.edu",
    "Advisor Email: vfu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:36Z (GMT). No. of bitstreams: 5 Ch5Ref.pdf: 184415 bytes, checksum: e9911157b7a0297f88baea20c864b620 (MD5) Ch4.pdf: 388604 bytes, checksum: 55fc4898fe943f33ca72b4db05ae0e1e (MD5) Appendices.pdf: 787515 bytes, checksum: b7d7d13e4679d0f61a0da9efe6f01aa8 (MD5) tableofcontents.pdf: 19505 bytes, checksum: bf578dcac60572757f1e8d78288a2da0 (MD5) Ch123.pdf: 125074 bytes, checksum: c5cfdb81383bb97d51fe5599a4438bb1 (MD5)   Previous issue date: 2002-02-15"
  ],
  "handle": "26539",
  "identifier_other": "etd-03292002-132211",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03292002-132211/",
  "identifier_uri": "http://hdl.handle.net/10919/26539",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Ch5Ref.pdf",
    "Ch4.pdf",
    "Appendices.pdf",
    "tableofcontents.pdf",
    "Ch123.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "conflict resolution",
    "marriage therapy",
    "Latinos"
  ],
  "title": "Conflict Resolution among Latino Couples",
  "type": "Dissertation"
}