{
  "contributor_author": "Robertson, Donald",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Soltner, Eugene",
    "Roberts, James T.",
    "Salmon, Richard G.",
    "Byers, Larry"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:35Z",
  "date_adate": "2007-04-24",
  "date_available": "2014-03-14T20:08:35Z",
  "date_issued": "2007-03-21",
  "date_rdate": "2010-04-24",
  "date_sdate": "2007-03-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A CASE STUDY OF: A PRINCIPAL PREPARATION PROGRAM IN ONE SCHOOL DISTRICT By Donald E. Robertson Travis Twiford, Chair Educational Leadership and Policy Studies (ABSTRACT) The primary role of the principal has expanded over the past two decades from one of manager to one of manager and instructional leader. With the expanded role of instructional leader, the principal of the twenty-first century is faced with increased levels of accountability for student achievement as evidenced by national legislation, revised state standards, and an ever-increasing scrutiny by shareholders. Six years ago research indicated that approximately one fourth of practicing principals were eligible for retirement in the next three to four years (Lauder, 2000). School districts across the country are finding it more and more difficult to attract qualified candidates with the requisite instructional leadership skills for available principal positions and have chosen to address this crisis by creating principal preparation programs aligned with current needs and based on key practices. The purpose of this qualitative case study was to determine whether school personnel who participate in AAA Public Schoolâ  s leadership training program are better prepared for the principalship than those school personnel who did not participate in this leadership training program. Data collection included (a) focus group interview comprised of a random sample of assistant principals and principals who had participated in the leadership training program (N = 6), (b) focus group interview comprised of a random sample of assistant principals and principals who had not participated in the leadership training program (N = 6), (c) focus group interview with the population of assistant superintendents who evaluate principals (N = 4), (d) leadership academy training documents, and (e) observations. Study results found that administrators who participated in this leadership training program were better prepared, more confident in their leadership, and were more knowledgeable in the roles and responsibilities which principals face.",
  "description_provenance": [
    "Author Email: derobert@vbschools.com",
    "Advisor Email: eugene.soltner@vbschools.com",
    "Advisor Email: roberji@cps.k12.va.us",
    "Advisor Email: rsalmon@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: lbyers@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:35Z (GMT). No. of bitstreams: 1 dissertation.pdf: 735634 bytes, checksum: d35e3c455753f9e79203a182590af914 (MD5)   Previous issue date: 2007-03-21"
  ],
  "handle": "26532",
  "identifier_other": "etd-03282007-102921",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03282007-102921/",
  "identifier_uri": "http://hdl.handle.net/10919/26532",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "educational leadership",
    "school administration",
    "principal preparation",
    "school leadership"
  ],
  "title": "A Case Study Of: A Principal Preparation Program in One School District",
  "type": "Dissertation"
}