{
  "contributor_author": "Neely, Helen Meek",
  "contributor_committeechair": "Crockett, Jean B.",
  "contributor_committeemember": [
    "Bays, Debora",
    "Parson, Stephen R.",
    "Burge, Penny L."
  ],
  "contributor_department": "Administration and Supervision of Special Education",
  "date_accessioned": "2014-03-14T20:08:34Z",
  "date_adate": "2005-04-13",
  "date_available": "2014-03-14T20:08:34Z",
  "date_issued": "2005-02-08",
  "date_rdate": "2005-04-13",
  "date_sdate": "2005-03-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "ABSTRACT Research studies and commentaries have analyzed the formal mechanisms associated with special education conflict such as the use of mediation and impartial hearings to resolve disputes. However, specific information regarding the management of special education conflict at the school level is in shorter supply. This study addresses special education conflicts between school personnel and parents of children with disabilities to understand better how these conflicts might be managed more successfully. The purpose of this study was to develop recommendations and implications for managing special education conflicts at the school building level. Multi-vocal synthesis methods were used to collect and to analyze data in an iterative process incorporating results from a content analysis of previous research with analysis of interviews with stakeholders having a vested interest in managing special education conflict at the school level (Gersten & Baker, 2000; Ogawa & Malen, 1992).  \tFindings suggest that providing parents with evidence that their childâ  s needs are being met would pave the way for successful school-based special education conflict management. In conclusion, the participants indicated that conflicts could be avoided or managed successfully if school personnel could provide parents with clear evidence (a) that their childâ  s IEP was being followed in the classroom; (b) that accommodations were provided; (c) that staff were knowledgeable about providing services in an inclusive environment; (d) that administrators were knowledgeable about special education compliance issues; and (e) that staff would be held accountable for providing an appropriate education and for demonstrating trustworthy behavior.",
  "description_provenance": [
    "Author Email: rhneely@verizon.net",
    "Advisor Email: crockettj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:34Z (GMT). No. of bitstreams: 1 Neely.pdf: 403803 bytes, checksum: 23466ba09c5ab4baf379a10f9b445fd2 (MD5)   Previous issue date: 2005-02-08"
  ],
  "handle": "26530",
  "identifier_other": "etd-03282005-141427",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03282005-141427/",
  "identifier_uri": "http://hdl.handle.net/10919/26530",
  "publisher": "Virginia Tech",
  "relation_haspart": "Neely.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "specialized services",
    "conflict resolution",
    "IDEA",
    "mediation",
    "due process hearing",
    "parents",
    "partnerships",
    "accountability",
    "disabilities"
  ],
  "title": "Special Education Conflict Management at the School Building Level: A Multi-vocal Synthesis",
  "type": "Dissertation"
}