{
  "contributor_author": "Krishen, Anjala Selena",
  "contributor_committeechair": "Nakamoto, Kent",
  "contributor_committeemember": [
    "Brinberg, David L.",
    "Herr, Paul M.",
    "Klein, Noreen M."
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:08:35Z",
  "date_adate": "2007-04-13",
  "date_available": "2014-03-14T20:08:35Z",
  "date_issued": "2007-03-19",
  "date_rdate": "2007-04-13",
  "date_sdate": "2007-03-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this dissertation, I propose that there are multiple factors, such as the education process and the consumption environment, which work to simultaneously create an opposition framework.  People are constantly exposed to rival products, which are positioned to be opposites even when they are often extremely similar in chemical content and physical appearance.  Thus, the implications of the recency-frequency model of activation (Higgins, Bargh and Lombardi 1985) would be that these proximal factors could, in some sense, prime dichotomous thinking.  Dichotomous or oppositional thinking, as it is defined in this dissertation, pertains to the flattening of dimensions present in a choice set such that the items can be graphically depicted at two ends of one dimension (see Figure 2 and Figure 3). I will first explore the impact of a dichotomous mindset on making a decision and then expand to the realm of opposition in choice set structures.",
  "description_provenance": [
    "Author Email: anjala@vt.edu",
    "Advisor Email: dbrinber@vt.edu",
    "Advisor Email: nakamoto@vt.edu",
    "Advisor Email: Paul.Herr@Colorado.EDU",
    "Advisor Email: nklein@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:35Z (GMT). No. of bitstreams: 1 AKDissertation041107.pdf: 1957707 bytes, checksum: c0d13999f937aa131963bf5aea1e9da4 (MD5)   Previous issue date: 2007-03-19"
  ],
  "handle": "26533",
  "identifier_other": "etd-03282007-155556",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03282007-155556/",
  "identifier_uri": "http://hdl.handle.net/10919/26533",
  "publisher": "Virginia Tech",
  "relation_haspart": "AKDissertation041107.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "information processing",
    "opposition",
    "dichotomy",
    "decision making",
    "choice",
    "information overload",
    "consumer behavior"
  ],
  "title": "When Comparison Becomes Contrast:  Choice in an Oppositional Framework",
  "type": "Dissertation"
}