{
  "contributor_author": "Wang, FeiHong",
  "contributor_committeechair": "John K. Burton",
  "contributor_committeemember": [
    "Lockee, Barbara B.",
    "Jones, Brett D.",
    "Michael A. Evans"
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:08:37Z",
  "date_adate": "2010-04-08",
  "date_available": "2014-03-14T20:08:37Z",
  "date_issued": "2010-03-18",
  "date_rdate": "2013-05-21",
  "date_sdate": "2010-03-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This sequential, mixed methods study explored studentsâ   attitudes towards collaborative learning and their responses to collaborative learning problems in relation to their identity salience. Identities are motivators of human actions that impact an individualâ  s self-esteem and behavioral tendencies (Stryker, 1968). An individual has three identity aspects that are related to different behavioral tendencies: individual, relational, and collective aspects. The identity aspect that an individual acts out across a variety of situations is their identity salience. Implied by the identity salience theory, studentsâ   behaviors may be detrimental or beneficial to the effectiveness of collaborative learning based on their identity salience. Results of the study revealed a possible relationship between studentsâ   identity salience and their attitudes, prior experiences, working preferences, and priorities in collaborative learning. In addition, results of the study also disclosed studentsâ   behavioral tendencies in dealing with collaborative learning problems including group tension, the free-rider effect, and role taking in relation to studentsâ   identity salience. Findings of this study can be used to support further investigations on personalized student grouping for effective collaborative learning.",
  "description_provenance": [
    "Author Email: fwang06@vt.edu",
    "Advisor Email:  lockeebb@vt.edu",
    "Advisor Email:  jburton@vt.edu",
    "Advisor Email:  brettjones@vt.edu",
    "Advisor Email: mae@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:37Z (GMT). No. of bitstreams: 2 Feihong_Wang_IRB_approval_letter.pdf: 254004 bytes, checksum: c5a32a87c841efac1ac6874b49311d8b (MD5) Wang_Feihong_D_2010.pdf: 1054601 bytes, checksum: 67fe1520a069598b019c4ae6f38cd7eb (MD5)   Previous issue date: 2010-03-18"
  ],
  "handle": "26546",
  "identifier_other": "etd-03292010-144406",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03292010-144406/",
  "identifier_uri": "http://hdl.handle.net/10919/26546",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Feihong_Wang_IRB_approval_letter.pdf",
    "Wang_Feihong_D_2010.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "collaborative learning",
    "identity salience"
  ],
  "title": "Effects of Studentsâ   Identity Salience on Their Attitudes Toward and Experience in Face-to-face Peer Collaborative Learning Activities",
  "type": "Dissertation"
}