{
  "contributor_author": "Ghorbal-Blal, Ines",
  "contributor_committeechair": "Olsen, Michael D.",
  "contributor_committeemember": [
    "Murrmann, Suzanne K.",
    "Gnyawali, Devi R.",
    "Perdue, Richard R."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:08:37Z",
  "date_adate": "2008-05-02",
  "date_available": "2014-03-14T20:08:37Z",
  "date_issued": "2008-03-17",
  "date_rdate": "2008-05-02",
  "date_sdate": "2008-03-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study is to explore the management of expansion strategy in the hotel industry using the control approach as presented in the literature of organizational theory. This integration illustrates that the management of risk in expansion strategy is intertwined with control. <p> The question â  How does control intervene in the management of risk in expansion strategy?â   was the operationalization of the overarching question of strategy and structure. The answers to this question are summarized in a framework and four propositions.<p> The contribution of this work to academia is threefold. First, this work provides a detailed, theories-driven documentation about how expansion strategies are conducted in the international hotel context. Second, this research integrates three different fields of research and directs to multiple new research tracks in both fields of strategic management and organization theory. Third, this study offers a new approach to measure the alignment between strategy and structure. From a managerial standpoint, this research offers guidance for the comprehension of the determinants of risk in the expansion strategy for international hotel chains.",
  "description_provenance": [
    "Author Email: ighorbal@vt.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: devi@vt.edu",
    "Advisor Email: olsenmd@vt.edu",
    "Advisor Email: Rick.Perdue@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:37Z (GMT). No. of bitstreams: 1 Dissertation_ETD.pdf: 2624351 bytes, checksum: d39649b208125c2d687b734a5e5e7661 (MD5)   Previous issue date: 2008-03-17"
  ],
  "handle": "26544",
  "identifier_other": "etd-03292008-160532",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03292008-160532/",
  "identifier_uri": "http://hdl.handle.net/10919/26544",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "control",
    "structure",
    "strategy",
    "expansion",
    "International hotel chains",
    "risk"
  ],
  "title": "An exploration of the role of the construct of control in expansion strategy of hotel chains: A multiple-case study.",
  "type": "Dissertation"
}