{
  "contributor_author": "Anderson, Dennis Earl",
  "contributor_committeechair": "Madigan, Michael L.",
  "contributor_committeemember": [
    "Nussbaum, Maury A.",
    "West, Robert L. Jr.",
    "Granata, Kevin P.",
    "Hendricks, Scott L.",
    "Grant, John Wallace"
  ],
  "contributor_department": "Engineering Science and Mechanics",
  "date_accessioned": "2014-03-14T20:08:37Z",
  "date_adate": "2010-04-16",
  "date_available": "2014-03-14T20:08:37Z",
  "date_issued": "2010-03-26",
  "date_rdate": "2012-04-24",
  "date_sdate": "2010-03-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Hip fractures are serious injuries that are associated with high rates of morbidity and mortality in older adults. While much of the increased risk of hip fracture with age can be explained by age-related decreases in bone mineral density, muscles and motor control are altered by aging as well. Muscles forces in vivo are thought to have a prophylactic effect that can reduce shear and bending in the femur. This is beneficial because bone is stronger in compression than in shear or tension, and shear plays an important role in fatiguing bone. Understanding how aging and muscular loads affect strains in the proximal femur could lead to improvements in clinical screening and preventative measures for hip fracture.  <p> Three studies were performed to investigate age-related changes in neuromuscular function during gait and how these changes affect strains in the proximal femur. Study 1 examined age differences in peak lower extremity joint torques during walking with controlled speed and step length. Studies 2 and 3 applied muscle forces estimated during gait to finite element models of the femur. Study 2 examined age differences in femoral strains, and Study 3 examined the sensitivity of strains to individual muscle forces.  <p> The results support the idea that older adults walk with reduced contributions from the ankle plantar flexors and increased contributions from the hip extensors. Interactions between age and speed indicate that older adults utilized a different neuromuscular strategy than young adults to vary the speed of their gait. No age differences were found for the largest magnitude strains in the proximal femur. However, young adults were able to apply larger loads to the femur without corresponding increases in femoral strains. Strains in the femoral neck were found to be sensitive to muscle forces, particularly hip abductor forces. Strains in the sub-trochanteric region tended to be larger than those in the femoral neck, and less sensitive to muscle forces. These results increase our understanding of neuromuscular changes that occur with age, and the effects of these changes on the femur.",
  "description_provenance": [
    "Author Email: dennisa@vt.edu",
    "Advisor Email: nussbaum@vt.edu",
    "Advisor Email: westrl@vt.edu",
    "Advisor Email: hndrxsl@vt.edu",
    "Advisor Email: jgrant@vt.edu",
    "Advisor Email: mlm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:37Z (GMT). No. of bitstreams: 1 Anderson_DE_D_2010.pdf: 2197207 bytes, checksum: f4c29356ad3ed8f1b0b6d4f6a3130c31 (MD5)   Previous issue date: 2010-03-26"
  ],
  "handle": "26545",
  "identifier_other": "etd-03292010-141129",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03292010-141129/",
  "identifier_uri": "http://hdl.handle.net/10919/26545",
  "publisher": "Virginia Tech",
  "relation_haspart": "Anderson_DE_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hip fractures",
    "walking",
    "joint torque",
    "femur",
    "finite element modeling",
    "aging"
  ],
  "title": "An examination of age-related differences in lower extremity joint torques and strains in the proximal femur during gait",
  "type": "Dissertation"
}