{
  "contributor_author": "Sykes, Jr., Randolph",
  "contributor_committeecochair": [
    "Earthman, Glen I.",
    "Parks, David J."
  ],
  "contributor_committeemember": [
    "Richards, Robert R.",
    "Parson, Stephen R.",
    "Koonce, Glenn L."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:37Z",
  "date_adate": "1999-04-23",
  "date_available": "2014-03-14T20:08:37Z",
  "date_issued": "1998-12-11",
  "date_rdate": "1999-04-23",
  "date_sdate": "1999-03-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to evaluate the Employment Plus Program in the Chesapeake(VA)Public Schools by determining the extent to which the program was effective in achieving its goals.  Six questions were addressed: (1)  What proportion of the students completed in each year between 1991 and 1997 all five parts of the GED test at a passing level? (2) To what extent did the program change the behavior of the students?  (3) What pre-employment skills of the students were developed as a result of participation in the program? (4) What employment skills of the students were developed as a result of participation in the program? (5)  What basic living skills of the students improved as a result of participation in the program? (6) To what extent did the program provide hope for the students to graduate in the Employment Plus Program?  \tExcept for the data on the first question-- the propor- tion of students passing the GED between 1991-97, forty randomly selected students (50 percent) from the 1993-94 school year were the focus of this study. This was the first year that the program was in all five high schools in the school division.  \tData were obtained through teacher, student, and employer interviews and through a review of written program materials. Data were analyzed thematically and findings were shared through tables and narrative summaries. \tThe researcher reported the Employment Plus Program findings to be (in order of importance): 71.6 percent of the students passed the GED in the years 1991-97, only two students were dismissed for discipline infractions in 1993- 94, four of the Employment Plus students that started working in 1993-94 are still working in the same job today.  \tIn the years 1991 through 1996, progress has been made in the number of students obtaining their GED.  One year, 1996-97, showed a regression of students obtaining their GED.  The researcher concluded as a result of the findings that the Employment Plus Program is meeting the majority of the stated goals. \tThe 1993-94 baseline data should be used for future comparisons.  Variables which affect the Employment Plus Program that could be manipulated to increase the number of students in obtaining their GED would be to improve upon the student truancy and drop-out rates.  Educators should use this information to continue to help the students obtain their GED in the future.",
  "description_provenance": [
    "Author Email: rsykes@vt.edu",
    "Advisor Email: robertr@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: gkounce@pen.k12.va.us",
    "Made available in DSpace on 2014-03-14T20:08:37Z (GMT). No. of bitstreams: 4 THESIS5.PDF: 735963 bytes, checksum: fb5c2ed370b36ef93b5e40c889b0aafe (MD5) TITLEPAG.PDF: 2352 bytes, checksum: 162c4cf9fd4e9d42c166eec139096e8c (MD5) ABSTRACT.PDF: 6952 bytes, checksum: 1c58e99f82bfd3237b5517a6ab7b5ab4 (MD5) CONTENT2.PDF: 10416 bytes, checksum: 4bc264e666c0bf6c7ff57389b2f4b86c (MD5)   Previous issue date: 1998-12-11"
  ],
  "handle": "26552",
  "identifier_other": "etd-032999-170532",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-032999-170532/",
  "identifier_uri": "http://hdl.handle.net/10919/26552",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "THESIS5.PDF",
    "TITLEPAG.PDF",
    "ABSTRACT.PDF",
    "CONTENT2.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "GRADUATION",
    "GED",
    "WORK STUDENT"
  ],
  "title": "An Evaluation of the Chesapeake Public Schools Employment Program",
  "type": "Dissertation"
}