{
  "contributor_author": "Pautz, Michelle Catherine",
  "contributor_committeechair": "Hult, Karen M.",
  "contributor_committeemember": [
    "Wernstedt, Kris F.",
    "Eikenberry, Angela M.",
    "Stephenson, Max O. Jr."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:08:38Z",
  "date_adate": "2008-04-15",
  "date_available": "2014-03-14T20:08:38Z",
  "date_issued": "2008-03-17",
  "date_rdate": "2008-04-15",
  "date_sdate": "2008-03-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Environmental policy debates are gaining momentum in the public square from scholars and citizens alike.  From all sides of the debate, a growing consensus is emerging that advocates a shift in the environmental regulatory system in the United States from one that emphasizes command and control regulations to one that advocates collaboration between the regulator and regulatee.  Although this dialogue is expanding, the research literature largely remains silent on a critical component of the environmental regulatory system â   the individuals on the front-lines.  Most notably, these front-line workers are environmental compliance inspectors and the individuals that inspectors deal with at regulated facilities.  Inspectors and facility personnel are largely responsible for the implementation of environmental regulation in the U.S., yet they are overlooked in the discussion of regulation, past and present.  These key actors are of tremendous significance and must be considered in discussions of environmental policy.  In particular, the interactions of these two important groups of actors merit exploration.  This research examines the interactions of inspectors and facility personnel in Virginia and investigates contentions that the relationships in the environmental regulatory system lack trust.  One-on-one interviews were conducted with nearly four dozen inspectors and facility personnel in Virginia to seek answers to the question:  How does trust factor into the relationships between environmental compliance inspectors and facility personnel in Virginia?  In contrast to presumptions in the literature, this study finds evidence of positive relationships between these two seeming adversaries and asserts that trust is present in these interactions.  Accordingly, there are potentially significant implications of these findings for future environmental policy.  These implications include the realization that the relationships are positive, that there may indeed be differences between relationships at the state versus federal level and the experiences at one level dominate prevailing perceptions, and that traditional assumptions of command and control regulations may not be as valid as previously thought.",
  "description_provenance": [
    "Author Email: mpautz@vt.edu",
    "Advisor Email: krisw@vt.edu",
    "Advisor Email: aeikenberry@mail.unomaha.edu",
    "Advisor Email: mstephen@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:38Z (GMT). No. of bitstreams: 4 s07-176.pdf: 194745 bytes, checksum: 57d14ab59c5afe326d7a0d81b945fc83 (MD5) s07-176_amend_1[1].pdf: 251515 bytes, checksum: 0b8de9ff392eab77f9abbdae56f555f6 (MD5) Pautz_Dissertation_15_April.pdf: 1508371 bytes, checksum: d2be62b45484ad70d4c1584cc5ee94fa (MD5) pautzdoc.pdf: 5870541 bytes, checksum: 4968871f1b95ae6ba695c8e4b19b10a3 (MD5)   Previous issue date: 2008-03-17"
  ],
  "handle": "26558",
  "identifier_other": "etd-03302008-104743",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03302008-104743/",
  "identifier_uri": "http://hdl.handle.net/10919/26558",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "s07-176.pdf",
    "s07-176_amend_1[1].pdf",
    "Pautz_Dissertation_15_April.pdf",
    "pautzdoc.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "trust",
    "state environmental regulation",
    "environmental policy",
    "front-line workers"
  ],
  "title": "There's Something Happening Here:  What is Really Happening on the Front-lines of Environmental Regulation",
  "type": "Dissertation"
}