{
  "contributor_author": "Tyberg, Christy Sensenich",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "Ward, Thomas C.",
    "Hedrick, Jeffrey C.",
    "Lesko, John J.",
    "McGrath, James E."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:08:38Z",
  "date_adate": "2000-04-04",
  "date_available": "2014-03-14T20:08:38Z",
  "date_issued": "2000-03-22",
  "date_rdate": "2001-04-04",
  "date_sdate": "2000-03-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Phenolic resins are important components of the composite industry because of their excellent flame retardance and cost effectiveness.  However, the common procedure for curing phenolic novolac resins uses hexamethylenetetramine (HMTA) and releases volatiles during the cure, which produce networks with numerous voids.  This results in materials that lack the toughness necessary for structural applications.  An alternative to curing with HMTA is to crosslink the pendant phenolic groups in the novolac resin with epoxy reagents.  This reaction proceeds by nucleophilic addition without the release of any volatiles, thereby creating a void-free network. Flame retardance can be achieved by using an excess of the phenolic component.  Network densities can also be controlled to maximize both toughness and stiffness by tailoring the stoichiometry of the reagents.<p>      Structure-property relationships of phenolic/epoxy networks have been investigated.  Glass transitions decreased, and toughness increased, as the phenolic content in the network was increased.  Both results could be correlated to the decrease in network densities along this series, which was investigated by measuring the rubbery moduli well above T<sub>g</sub>.  Fracture toughness of phenolic/epoxy networks measured by K<sub>1c</sub> reached 1.03 MPa-m<sup>1/2</sup>, compared with an epoxy control with K<sup>1c</sup> = 0.62 MPa-m<sup>1/2</sup> and phenolic control with K<sub>1c</sub> = 0.16 MPa-m<sup>1/2</sup>.   In addition, an increase in novolac content improves flame retardance rather dramatically.  The peak heat release rate (PHRR) dropped from 1230 kW/m<sup>2</sup> for the epoxy control to 260 kW/m<sup>2</sup> for the phenolic/epoxy networks, which approached that of a phenolic resol (PHRR = 116 kW/m<sup>2</sup>).  Phenolic/epoxy composite flame retardance also showed significant improvement when compared to epoxy composites.<p>       Melt processability of phenolic/epoxy composites has been achieved through the use of latent nucleophilic initiators.  Kinetics of the phenolic/epoxy cure reactions with latent initiators demonstrated that monomeric phosphine initiators yielded faster cure reactions as compared to polymeric initiators.  These latent initiators allow composite melt processing, such as prepregging or pultrusion, without premature curing.  In addition, cure cycles can be reduced from 4 hours to less than 30 minutes.  Composites prepared using these latent initiators had toughness exceeding that of epoxy composites and fatigue limits significantly higher than those of vinyl ester composites. </p> <p><i>Vita removed, June 10, 2013, per author's request. GMc</i></p>",
  "description_provenance": [
    "Author Email: tyberg@us.ibm.com",
    "Advisor Email: tward@chemserver.chem.vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: jhedrick@us.ibm.com",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: jemcgrath@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:38Z (GMT). No. of bitstreams: 1 01Dissertation.pdf: 2808135 bytes, checksum: 0dcc33db1fbe4fb7554056ec7adc4bc1 (MD5)   Previous issue date: 2000-03-22"
  ],
  "handle": "26554",
  "identifier_other": "etd-03302000-20270052",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03302000-20270052/",
  "identifier_uri": "http://hdl.handle.net/10919/26554",
  "publisher": "Virginia Tech",
  "relation_haspart": "01Dissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "composite",
    "flame-retardant",
    "latent initiator",
    "phenolic",
    "epoxy"
  ],
  "title": "Void-Free Flame Retardant Phenolic Networks: Properties and Processability",
  "type": "Dissertation"
}