{
  "contributor_author": "Winters, Katherine Elaine",
  "contributor_committeechair": "Matusovich, Holly",
  "contributor_committeemember": [
    "Williams, Christopher B.",
    "Paretti, Marie C.",
    "Newbill, Phyllis"
  ],
  "contributor_department": "Engineering Education",
  "date_accessioned": "2014-03-14T20:08:37Z",
  "date_adate": "2012-04-23",
  "date_available": "2014-03-14T20:08:37Z",
  "date_issued": "2012-03-19",
  "date_rdate": "2012-04-23",
  "date_sdate": "2012-03-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Much of engineering education research focuses on improving undergraduate engineering education. However, in order to help new engineers prepare for and successfully transition to the workplace, and therefore improve retention within the engineering practice, it is vitally important to understand the experiences of these early career engineers. The purpose of this study is to identify and explain the career goals and actions of early career engineering graduates. To accomplish this goal, this research addressed the question 창  What factors influence early career engineering graduates창   career goals near the end of their undergraduate engineering studies, career-related actions taken in the subsequent four years, and their future career plans?창     Data were predominantly qualitative. Thirty participants were interviewed and surveyed near the end of their undergraduate studies, then completed pre-questionnaires and an interview as early career engineering graduates. Participants were graduates from three different universities and were diverse with respect to sex, race, and undergraduate major. Data analysis was framed by Social Cognitive Career Theory, as developed by Lent, Brown, and Hackett, and followed case study methods.  Results show that early career engineering graduates had diverse goals and interests, but similar influencing factors. They generally wanted to find appealing work and acted towards that goal. Relationships with faculty and expectations of positive outcomes heavily influenced participants창   decisions to pursue graduate degrees, and family commitments geographically constrained career choices while also increasing the desire for stability. The economic downturn impacted job availability for most participants, but many participants were able to broaden their career searches to find interesting and fulfilling work. Participants that exhibited an ability to adapt to changing conditions reported the greater levels of satisfaction with their careers.  The findings of this research provide important information to engineering educators and employers as they mentor the next generation of engineers, and early career engineering graduates themselves as they seek to achieve their goals.",
  "description_provenance": [
    "Author Email: kewint@vt.edu",
    "Advisor Email: cbwill@vt.edu",
    "Advisor Email: mparetti@vt.edu",
    "Advisor Email: pnewbill@vt.edu",
    "Advisor Email: matushm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:37Z (GMT). No. of bitstreams: 1 Winters_KE_D_2012.pdf: 3187338 bytes, checksum: b7c6d25a0e02f40879f033562c65e5a3 (MD5)   Previous issue date: 2012-03-19"
  ],
  "handle": "26550",
  "identifier_other": "etd-03292012-111315",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03292012-111315/",
  "identifier_uri": "http://hdl.handle.net/10919/26550",
  "publisher": "Virginia Tech",
  "relation_haspart": "Winters_KE_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Engineering Graduates",
    "Engineering Careers",
    "Goals"
  ],
  "title": "Career Goals and Actions of Early Career Engineering Graduates",
  "type": "Dissertation"
}