{
  "contributor_author": "Mazumder, Raja",
  "contributor_committeechair": "Benoit, Robert E.",
  "contributor_committeecochair": "Phelps, Tomm J.",
  "contributor_committeemember": [
    "Claus, G. William",
    "Krieg, Noel R.",
    "Yousten, Allan A."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:08:37Z",
  "date_adate": "2000-04-08",
  "date_available": "2014-03-14T20:08:37Z",
  "date_issued": "2000-03-06",
  "date_rdate": "2001-04-08",
  "date_sdate": "2000-03-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Low substrate regulated microaerophilic behavior (LSRMB), as measured by changes in microaerophilic band formation in semi-solid medium, was observed in several aerobic bacteria isolated from subsurface soils, Antarctic dry valley soils, an eutrophic pond, a mesophilic pond, an oligotrophic lake and activated sludge. Similar behavior was also exhibited by five Pseudomonas and two Bacillus type strains from culture collection. Isolates identified with LSRMB formed a typical band of growth below the surface of low substrate (10 mg/l of peptone, tryptone, yeast extract and glucose) semi-solid medium. Surface growth was obtained when the substrate concentration was increased (1000 mg/l of each of the above mentioned substrates). LSRMB was observed in phylogenetically disparate groups, with all the Pseudomonas and two Bacillus species testing positive for the trait. One of the Gram-negative isolates, strain VT10, was identified by phylogenetic analysis based on its 16S rDNA sequence. High 16S rDNA sequence similarity (99%) was observed with the recently discovered Pseudomonas jessenii (CIP 105274T) type strain. Strain VT10 was used as a model to examine this LSRMB, and show the relationship between oxygen stress and low-substrate growth media. The concentration of 17:0 cyclopropane fatty acid, a common stress indicator, increased 5-fold, and four additional proteins were produced when P. jessenii strain VT10 was grown at low-substrate levels and when the dissolved oxygen concentration was increased from 26 microM to 241 microM. The stress responses by P. jessenii could be due its LSRMB. This study shows that low-substrate regulated microaerophilic behavior helps some microorganisms to track the oxygen minima in their habitat and thus effectively move to an environment, which allows them to thrive. In addition to the above mentioned taxis in response to oxygen concentration, organisms may use chemotaxis to a chemical compound. Quantification of chemotaxis can be extremely difficult. To quantify chemotaxis in an easier fashion, a simplified capillary chemotaxis assay, utilizing a hypodermic needle, syringe and disposable pipette tip was developed. The method was applied to two strains of subsurface microaerophilic bacteria. Strain VT10 was chemotactically attracted toward dextrose, glycerol, and phenol, which could be used as sole carbon sources, and toward maltose, which could not be used. The deep subsurface isolate MR100 (phylogenetically related to P. mendocina) showed no tactic response to these compounds although it could use dextrose, maltose, and glycerol as carbon sources. The chemotaxis results obtained by the new method were verified by using the swarm plate assay technique. The simplified technique may be useful for routine chemotactic testing.",
  "description_provenance": [
    "Author Email: rmazumde@vt.edu",
    "Advisor Email: clausgw@vt.edu",
    "Advisor Email: rbenoit@vt.edu",
    "Advisor Email: nrk@vt.edu",
    "Advisor Email: tkp@ornl.gov",
    "Advisor Email: yousten@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:37Z (GMT). No. of bitstreams: 1 etd.pdf: 356136 bytes, checksum: 309750a69fff3287e06b2508646067f7 (MD5)   Previous issue date: 2000-03-06"
  ],
  "handle": "26553",
  "identifier_other": "etd-03302000-14230006",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03302000-14230006/",
  "identifier_uri": "http://hdl.handle.net/10919/26553",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Low substrate regulated microaerophilic behavior",
    "oxygen stress",
    "Pseudomonas jessenii strain VT10"
  ],
  "title": "Substrate Regulated Microaerophily and Chemotaxis by Pseudomonas jessenii strain VT10",
  "type": "Dissertation"
}