{
  "contributor_author": "Vokoun, Melinda M",
  "contributor_committeechair": "Amacher, Gregory S.",
  "contributor_committeemember": [
    "Wear, David N.",
    "Alwang, Jeffrey R.",
    "Sullivan, Jay",
    "Prisley, Stephen P."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:08:38Z",
  "date_adate": "2005-04-11",
  "date_available": "2014-03-14T20:08:38Z",
  "date_issued": "2005-03-07",
  "date_rdate": "2007-04-11",
  "date_sdate": "2005-03-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research examines how the harvesting behavior of nonindustrial private forest landowners, and their use of forestland for non-timber amenities, is affected by adjacent landowner behavior.  The uncertainty an individual landowner has regarding adjacent landownersâ   preferences, and how the production of non-timber amenities on their own stands relies on the condition of adjacent stocks, is specifically addressed.  Economic characterizations of substitutes and complements are employed to investigate the differences in optimal stock levels at the steady state in the production of amenities under various levels of cooperation among landowners.  It is shown that there are externalities present when landowners do not coordinate management actions when parcels are spatially interdependent.  The effects of spatial interdependencies on landowner behavior are further explored using data from a survey of forest landowners in Central Virginia.  Findings suggest that forest landowners are willing to coordinate activities, and such decisions are determined by similar characteristics that function in predicting landowner behavior regarding timber harvesting.  Further, landownersâ   decisions to use own and adjacent parcels were correlated, hinting at the spatial interdependencies of stocks in amenity valuations.  Both the theoretical and empirical analyses suggest that the lack of coordination among landowners and its effects on stock management would be best addressed through the use of incentives to drive spatially efficient outcomes.",
  "description_provenance": [
    "Author Email: mejones@vt.edu",
    "Advisor Email: dwear@fs.fed.us",
    "Advisor Email: alwangj@vt.edu",
    "Advisor Email: gamacher@vt.edu",
    "Advisor Email: jsulliv@vt.edu",
    "Advisor Email: prisley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:38Z (GMT). No. of bitstreams: 1 mvdissertation2.pdf: 813647 bytes, checksum: 777a27193dba7e31b3c9e79250c908f3 (MD5)   Previous issue date: 2005-03-07"
  ],
  "handle": "26556",
  "identifier_other": "etd-03302005-210644",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03302005-210644/",
  "identifier_uri": "http://hdl.handle.net/10919/26556",
  "publisher": "Virginia Tech",
  "relation_haspart": "mvdissertation2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "spatial interdependence",
    "coordination",
    "amenity services",
    "nonindustrial landowners",
    "adjacent",
    "externality"
  ],
  "title": "Investigating the Cooperative Behavior of Nonindustrial Private Forest Landowners when Stands are Spatially Interdependent",
  "type": "Dissertation"
}