{
  "contributor_author": "Ruder, Gary J.",
  "contributor_committeechair": "Wiswell, Albert W.",
  "contributor_committeemember": [
    "Belli, Gabriella M.",
    "Boucouvalas, Marcie",
    "Morris, Linda E.",
    "Endlich, Norman"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:08:39Z",
  "date_adate": "2003-04-21",
  "date_available": "2014-03-14T20:08:39Z",
  "date_issued": "2003-03-24",
  "date_rdate": "2004-04-21",
  "date_sdate": "2003-03-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "THE RELATIONSHIP AMONG ORGANIZATIONAL JUSTICE, TRUST, AND ROLE BREADTH SELF-EFFICACY   Gary J. Ruder  Committee Chairperson: Albert K. Wiswell Human Development  (Abstract)   The purpose of this study was to examine whether organizational practicesâ  fairness (also known as organizational justice) and trustâ  contribute to the enhancement of role breadth self-efficacy (RBSE), a form of proactive behavior. The sample consisted of 226 white-collar professionals in large and small organizations. Approximately 70% held a college degree.  An a priori path model based on theoretical literature was generated to represent causal relationships among the variables. Two paths were explored: a) the relationship among procedural justice, trust in organization, and RBSE; and b) the relationship among interactional justice, trust in supervisor, and RBSE.  Findings indicated a statistically significant relationship between procedural justice and trust in organization. The relationships between procedural justice and RBSE and trust in organization and RBSE were not significant. Interactional justice had a statistically significant relationship with trust in supervisor, but not with RBSE. The relationship between trust in supervisor and RBSE was not significant. Respondents expressed a strong trust in their organization, and a stronger trust in their immediate supervisor. The most important discovery in this study was the statistically significant relationship between education and RBSE. Individuals with graduate degrees reported the highest level of RBSE, followed by people with Bachelorâ  s degrees. Globalization and technology are fueling demands for ever-increasing employee skills and higher levels of education. Organizations need highly educated, proactive individuals in order to be successful. Future research should continue to investigate variables and constructs that may enhance RBSE in the workplace.",
  "description_provenance": [
    "Author Email: ruder@erols.com",
    "Advisor Email: wiswell@vt.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: linda_morris11495@yahoo.com",
    "Advisor Email: endl@erols.com",
    "Made available in DSpace on 2014-03-14T20:08:39Z (GMT). No. of bitstreams: 1 TheRelationshipAmongOrganizationalJusticeTrustandRoleBreadthSelfEfficacy.pdf: 756954 bytes, checksum: a10f49878038bdbeb5dbf2002a02bf24 (MD5)   Previous issue date: 2003-03-24"
  ],
  "handle": "26565",
  "identifier_other": "etd-03312003-125551",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03312003-125551/",
  "identifier_uri": "http://hdl.handle.net/10919/26565",
  "publisher": "Virginia Tech",
  "relation_haspart": "TheRelationshipAmongOrganizationalJusticeTrustandRoleBreadthSelfEfficacy.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "distributive justice",
    "procedural justice",
    "interactional justice",
    "proactive behavior"
  ],
  "title": "The Relationship Among Organizational Justice, Trust, and Role Breadth Self-Efficacy",
  "type": "Dissertation"
}