{
  "contributor_author": "Reese, Debbie Denise",
  "contributor_committeechair": "Burton, John K.",
  "contributor_committeemember": [
    "Holmes, Glen A.",
    "Doolittle, Peter E.",
    "Carroll, John M.",
    "Singh, Kusum"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:39Z",
  "date_adate": "2003-04-04",
  "date_available": "2014-03-14T20:08:39Z",
  "date_issued": "2003-03-21",
  "date_rdate": "2004-04-04",
  "date_sdate": "2003-03-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Through a direct application of two cognitive science theories, conceptual metaphor (Lakoff &amp; Johnson, 1980, 1999) and structure mapping (Gentner, 1983, 1989; Gentner &amp; Markman, 1995), this project defined an instructional design model for the design, development, and assessment of metaphor-enhanced, computer-mediated learning environments. It used the model to produce an instructional product with a metaphor-based interface. The project also built a parallel learning environment that employed a concept map interface. To test the metaphor-based productâ  s effectiveness at enabling learners to build rich mental models of a complex, abstract concept, the project ran fifty-seven preservice teachers (55 female, 2 male; mean age of 21) through the instruction, randomly assigning half to the concept map interface environment and half to the metaphor-based interface environment. Participants completed four essay-type assessment questions. Trained raters, blind to participant assignment, isolated any of the 13 targeted concepts present within participantsâ   protocols and, through consensus, constructed a concept map for each participant, representing that participantâ  s mental model of the targeted domain. Map attributes were translated into four weighted subscores (nodes, branches, levels, and cross-links) and summed. Comparison across the two groups indicated no significant difference for richness of mental model, t(55)=-.72, p&gt; .05, although the discussion suggests methods for increasing the power in subsequent experimental sessions. A significant interaction between Subscore and Achievement, F(3,51)=33.42, p&lt; .01, suggests that concept map cross-links are much more sensitive to differences in domain integration and the general richness of a participantâ  s mental model than the level and branch subscores. This result has implications for classroom application. Concept maps have taken a place as a learnerâ  s, a teacherâ  s, and a researcherâ  s tool. With cross-domain validation and domain-specific extensions, specification of the relative sensitivity of various subscales, that is, the structure of the concept map, will enable educators to justify weighting scales and identify learner achievement. Credible concept map weighting scales also enhance learnersâ   self-reliant and impartial assessment of personal growth in domain-specific knowledge. Results suggest that learners who have difficulty integrating domain concepts require direct, explicit instruction to help them to make connections between disparate conceptual strands.",
  "description_provenance": [
    "Author Email: dereese2@vt.edu",
    "Advisor Email: gholmes@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: jcarroll@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:39Z (GMT). No. of bitstreams: 1 Reese_D_D.pdf: 2762901 bytes, checksum: 658d3e83a8f1a87f607f53eb18040f09 (MD5)   Previous issue date: 2003-03-21"
  ],
  "handle": "26564",
  "identifier_other": "etd-03312003-115151",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03312003-115151/",
  "identifier_uri": "http://hdl.handle.net/10919/26564",
  "publisher": "Virginia Tech",
  "relation_haspart": "Reese_D_D.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "concepts",
    "structure mapping",
    "Gentner",
    "interface",
    "metaphor",
    "analogy",
    "instructional design",
    "Lakoff",
    "conceptual metaphor"
  ],
  "title": "Metaphor and Content: An Embodied Paradigm for Learning",
  "type": "Dissertation"
}