{
  "contributor_author": "Callison, Myrna",
  "contributor_committeechair": "Nussbaum, Maury A.",
  "contributor_committeemember": [
    "Huang, Grant D.",
    "Babski-Reeves, Kari L.",
    "Smith-Jackson, Tonya L.",
    "Lopez, Mary S."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:08:39Z",
  "date_adate": "2009-04-20",
  "date_available": "2014-03-14T20:08:39Z",
  "date_issued": "2007-03-19",
  "date_rdate": "2009-04-20",
  "date_sdate": "2009-03-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Work-related musculoskeletal disorders (WMSDs) are prevalent among health care workers worldwide and underreporting among nurses may mask the true impact of these injuries. Nursing staff are consistently among the top 10 occupations at risk for experiencing WMSDs and patient-handling tasks are the precipitating event in the majority of back injuries experienced among nursing staff.   <p> Existing research has focused on patient-handling issues within long-term care facilities, and identifying physically demanding patient-handling tasks.  The first study in this dissertation (Chapter 3) was conducted to determine whether nurses in acute care facilities are exposed to the same hazards as their cohorts in long-term care.  The aim was to identify the top 10 patient-handling tasks being conducted and to rank these tasks by perceived physical demand.  This two-phase study consisted of a procedural task analysis of patient-handling activities, and a questionnaire to identify the characteristics of the study population and obtain a ranking of physically demanding patient-handling tasks.  All nurses providing direct inpatient care were recruited to participate in both phases of this study.  Compared to long-term care facilities, in which the majority of tasks have been shown to be associated with performance of ADL tasks, the most frequently observed tasks in the acute care facility were repositioning tasks.  Therefore, it is important to determine the patient-handling demands and needs that are unique to each type of healthcare facility.  Generalizing across facilities or units may lead to incorrect assumptions and conclusions about physical demands being placed on nurses.  <p> A laboratory simulation was used for the second study (Chapter 4).  The top four physically demanding patient-handling tasks (taken from Chapter 3) were simulated to determine the effect of an assistive device and assistance from another person.  Sixteen nurse volunteers were recruited and provided perceptual responses regarding exertion and injury risk.  Nurses perceived that assistance decreased their physical exertion and injury risk; however they consistently perceived exertion to be relatively higher than their injury risk.   <p> The aim of the third study (Chapter 5) was to determine the level of agreement between and within different expert groups.  Three groups of participants were involved, with different levels of ergonomics expertise (i.e. researchers, consultants, and graduate students).  These groups viewed digitized video clips from the laboratory simulation (Chapter 4) and provided ratings of perceived exertion, perceived injury risk and common WMSD risk factors (effort, posture, and speed).  The major finding from this study was that poor agreement existed between nurses and the other expert groups (researchers, consultants and students).   <p> The current research laid the groundwork for measuring the magnitude of physical exposure to injury risk in the patient-handling environment.  The research supports earlier evidence that suggests nurses underreport their discomfort and injury, which, in turn, contributes to increased exposure and risk.  This knowledge will enable practitioners to focus interventions and designs on those factors in the work environment that contribute significantly to increased exposure and thereby more effectively reduce WMSD risk.",
  "description_provenance": [
    "Author Email: myrna.callison@us.army.mil",
    "Advisor Email: grant.huang@hq.med.va.gov",
    "Advisor Email: nussbaum@vt.edu",
    "Advisor Email: kari@ise.msstate.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: mary.lopez1@us.army.mil",
    "Made available in DSpace on 2014-03-14T20:08:39Z (GMT). No. of bitstreams: 1 MCCallisonDissertation.pdf: 827636 bytes, checksum: 894142e849a7ea157ae219900bb79224 (MD5)   Previous issue date: 2007-03-19"
  ],
  "handle": "26561",
  "identifier_other": "etd-03302009-161650",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03302009-161650/",
  "identifier_uri": "http://hdl.handle.net/10919/26561",
  "publisher": "Virginia Tech",
  "relation_haspart": "MCCallisonDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Ergonomics",
    "Patient Handling",
    "Physical Demand",
    "Exertion",
    "Expert Ratings"
  ],
  "title": "Identification, Evaluation and Control of Physically Demanding Patient-Handling Tasks in an Acute Care Facility",
  "type": "Dissertation"
}