{
  "contributor_author": "Parhizkar, Omid",
  "contributor_committeechair": "Smith, Robert L.",
  "contributor_committeemember": [
    "Hammett, Alfred L. Tom",
    "Han, JongKoo",
    "Miller, Chad R.",
    "Kline, D. Earl"
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:08:39Z",
  "date_adate": "2008-08-28",
  "date_available": "2014-03-14T20:08:39Z",
  "date_issued": "2008-03-21",
  "date_rdate": "2008-08-28",
  "date_sdate": "2008-03-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Transportation and competitiveness practices of hardwood lumber exporters and other firms were studied and compared to determine the most important factors associated with exporting hardwood products.  It was found that exporters differed significantly in their transportation methods, marketing activities, and production profiles from those other hardwood lumber firms.  They also were significantly larger than expected in their total production and employment. As the forest products business continues to become more global, an analysis of the importance of these factors can be used how firms can begin exporting, or increase sales in international markets.  It was found that certain elements of a sawmillâ  s marketing strategy are a major determinant to the likelihood of its being an exporter.  Results from logistic regression methods showed that transportation factors such as using intermodal transportation and inland port facilities and competitiveness factors such as species selection, marketing practices, and using government export assistance programs increased the probability of a firmâ  s high involvement in international markets.    Finally, data from exporting hardwood sawmills to Mexico, Europe, and Asia were analyzed to determine what makes successful exporting to these markets. Factors including export distribution methods, relationship with export distribution partner, competitiveness, transportation, and export assistance were analyzed. Such information might be useful for government agencies that wish to promote business commitment to sawmills throughout the United States for the following international markets. Hardwood sawmills should be encouraged by state officials to plan more aggressively to enter the Mexico market.  Efforts are needed from U.S. trade associations to better identify the Mexican market segments, sources of market demand, and credit opportunities for US sawmills.",
  "description_provenance": [
    "Author Email: parhiza@vt.edu",
    "Advisor Email: rsmith4@vt.edu",
    "Advisor Email: himal@vt.edu",
    "Advisor Email: hanjongk@vt.edu",
    "Advisor Email: chadm@vt.edu",
    "Advisor Email: kline@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:39Z (GMT). No. of bitstreams: 1 OmidParhizkar_Dissertation.pdf: 3365043 bytes, checksum: f9a4b8c01d45be43be75770f17fe35c8 (MD5)   Previous issue date: 2008-03-21"
  ],
  "handle": "26560",
  "identifier_other": "etd-03302008-192642",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03302008-192642/",
  "identifier_uri": "http://hdl.handle.net/10919/26560",
  "publisher": "Virginia Tech",
  "relation_haspart": "OmidParhizkar_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Transportation Factors",
    "Distribution Channel Management",
    "Hardwood Lumber",
    "Export Performance",
    "Competitiveness Factors"
  ],
  "title": "Identifying Impact Factors on Successful Exporting of the United States Hardwood Industries to Mexico, Asia, and Europe",
  "type": "Dissertation"
}