{
  "contributor_author": "Weidman, Justin  Earl",
  "contributor_committeechair": "Young-Corbett, Deborah E.",
  "contributor_committeemember": [
    "Fiori, Christine M.",
    "Miller, Kevin R.",
    "Koebel, Charles Theodore"
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:08:39Z",
  "date_adate": "2012-04-11",
  "date_available": "2014-03-14T20:08:39Z",
  "date_issued": "2012-03-22",
  "date_rdate": "2012-04-11",
  "date_sdate": "2012-03-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An intervention to improve adoption of dust control technology is designed, implemented and evaluated using three theoretical frameworks: the Health Belief Model (HBM), Diffusion of Innovation, and the Technology Acceptance Model. A quasi-experimental design (pretest-posttest, with control group) was used to evaluate the effectiveness of the intervention. An integrated conceptual model, employing key constructs from these frameworks, was developed to predict and describe 창  adoption readiness창  . Adoption readiness combines the attitudes and perceptions about a technology with the capacity to implement the technology. The primary hypothesis was that the key construct scores of the three theoretical models would improve post-intervention, particularly, 창  adoption readiness창  . Workers in the drywall finishing industry have been found to be at risk of developing respiratory disease and disability. Studies have shown that drywall finish workers have been subject to overexposure to dust concentrations that contain respiratory heath hazardous particles including silica, talc, mica, and calcite. Prevention through Design (PtD) solutions, which are effective at reducing dust levels, do exist for these operations. Some of these PtD solutions include using vacuum sanders, wet sanding methods, pole sanding and using low dust joint compound in lieu of using personal protective equipment (PPE) as a primary form of exposure protection. Previous studies have determined barriers to adoption of current PtD solutions for dust exposure reduction. Usability, productivity, quality of finish and cost were all identified as barriers to adoption. An intervention directed at those involved in the drywall industry is needed to increase the usage of engineered dust control.  This dissertation project developed, implemented, and evaluated three interventions to address the barriers to adoption through education and marketing strategies. Development of the interventions included strategies to improve industry usage of dust control technologies. The interventions targeted workers, small companies, and large companies involved in drywall finishing.",
  "description_provenance": [
    "Author Email: justinweidman@gmail.com",
    "Advisor Email: cfiori@vt.edu",
    "Advisor Email: kmiller@byu.edu",
    "Advisor Email: dyoung@vt.edu",
    "Advisor Email: tkoebel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:39Z (GMT). No. of bitstreams: 3 Weidman_JE_f2_2012.pdf: 219190 bytes, checksum: 767f2f19c79f6898f3accfe2f21dfc90 (MD5) Weidman_JE_f1_2012.pdf: 88249 bytes, checksum: cb99b606e122bc842fd6534e687b382c (MD5) Weidman_JE_D_2012.pdf: 9282642 bytes, checksum: cb90a166e2a2e3a6618e05e8dc373c73 (MD5)   Previous issue date: 2012-03-22"
  ],
  "handle": "26562",
  "identifier_other": "etd-03302012-121441",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03302012-121441/",
  "identifier_uri": "http://hdl.handle.net/10919/26562",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Weidman_JE_f2_2012.pdf",
    "Weidman_JE_f1_2012.pdf",
    "Weidman_JE_D_2012.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "drywall dust",
    "interventions",
    "safety",
    "Construction"
  ],
  "title": "Dust Control Usage: Strategic Technology Interventions",
  "type": "Dissertation"
}