{
  "contributor_author": "Mish, Patrick Francis",
  "contributor_committeechair": "Devenport, William J.",
  "contributor_committeemember": [
    "Glegg, Stewart A. L.",
    "Simpson, Roger L.",
    "Burdisso, Ricardo A.",
    "Schetz, Joseph A.",
    "Ragab, Saad A."
  ],
  "contributor_department": "Aerospace and Ocean Engineering",
  "date_accessioned": "2014-03-14T20:08:40Z",
  "date_adate": "2003-04-15",
  "date_available": "2014-03-14T20:08:40Z",
  "date_issued": "2003-02-06",
  "date_rdate": "2004-04-15",
  "date_sdate": "2003-03-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation presents measurements of unsteady surface pressure on airfoils encountering flow disturbances.  Analysis of measurements made on an airfoil immersed in turbulence and comparisons with inviscid theory are presented with the goal of determining the effect of angle of attack on an airfoils inviscid response.  Unsteady measurements made on the surface of a linear cascade immersed in periodic flow are presented and analyzed to determine the relationship between the blades inviscid response and tip leakage vortex strength.    Measurements of fluctuating surface pressure were made on a NACA 0015 airfoil immersed in grid generated turbulence.  The airfoil model has a 2' chord and spans the 6' Virginia Tech Stability Wind Tunnel test section.  Two grids were used to investigate the effects of turbulence length scale on the surface pressure response.  A large grid which produced turbulence with an integral scale 13% of the chord and a smaller grid which produced turbulence with an integral scale 1.3% of the chord.  Measurements were performed at angles of attack from 0Âº to 20Âº.  An array of microphones mounted subsurface was used to measure the unsteady surface pressure.  The goal of this measurement was to characterize the effects of angle of attack on the inviscid response.   Lift spectra calculated from pressure measurements at each angle of attack revealed two distinct interaction regions; for reduced frequencies < 10 a reduction in unsteady lift of up to 7 decibels (dB) occurs while an increase occurs for reduced frequencies > 10 as the angle of attack is increased.  The reduction in unsteady lift at low reduced frequencies with increasing angle of attack is a result that has never before been shown either experimentally or theoretically.  The source of the reduction in lift spectral level appears to be closely related to the distortion of inflow turbulence based on analysis of surface pressure spanwise correlation length scales.  Furthermore, while the distortion of the inflow appears to be critical in this experiment, this effect does not seem to be significant in larger integral scale (relative to the chord) flows based on the previous experimental work of McKeough (1976) suggesting the airfoils size relative to the inflow integral scale is critical in defining how the airfoil will respond under variation of angle of attack.   A prediction scheme is developed that correctly accounts for the effects of distortion when the inflow integral scale is small relative to the airfoil chord.  This scheme utilizes Rapid Distortion Theory to account for the distortion of the inflow with the distortion field modeled using a circular cylinder.  Measurement of the unsteady surface pressure response of a linear cascade in periodic disturbance is presented.  Unsteady pressure was measured on the suction and pressure side of two cascade blades with an array of 24 microphones (12 per blade side) mounted subsurface.  The periodic disturbance was generated using a pair of vortex generators attached to a moving end wall.  Measurements were made for 8 tip gaps (t/c = 0.00825, 0.0165, 0.022, 0.033, 0.045, 0.057, 0.079, 0.129) and phased averaged with respect to the vortex generator pair position.  This measurement was motivated by the results presented by Ma (2003).  The work of Ma (2003) suggested that tip leakage vortex shedding in the presence of a periodic disturbance is heavily influenced by the inviscid response of the cascade blade.  This conclusion was arrived at by Maâ  s (2003) observation that as the tip gap is increased the amount of fluctuation in the tip leakage vortex circulation increases dramatically, in fact, many times the circulation in the inflow vortices. Unsteady pressure measurements reveal that the blade response involves a complex interaction of both inviscid response and viscous phenomena.   However, a close relationship between unsteady tip loading and tip leakage vortex circulation is revealed suggesting the inviscid response is significant in determining the tip leakage vortex circulation.  Additionally, predictions using inviscid theory agree well with measured levels of unsteady tip loading.  As such, inviscid theory may be useful for predicting the tip leakage circulation and perhaps, pressure fluctuations in the tip leakage vortex.",
  "description_provenance": [
    "Author Email: pmish@vt.edu",
    "Advisor Email: glegg@oe.fau.edu",
    "Advisor Email: simpson@aoe.vt.edu",
    "Advisor Email: rburdiss@vt.edu",
    "Advisor Email: devenport@aoe.vt.edu",
    "Advisor Email: ptiger@vt.edu",
    "Advisor Email: ragab@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:40Z (GMT). No. of bitstreams: 17 CpSpan_2200.avi: 1743360 bytes, checksum: fad82889e5c969ec127e7f3ddd65d030 (MD5) CpSpan_4500.avi: 1669120 bytes, checksum: 1092d6e5a58223a7225151370f707e61 (MD5) CpSpan_12900.avi: 1702912 bytes, checksum: cdb5c33b512fa7dfc45253f4b7dfea15 (MD5) CpChord_825.avi: 1510400 bytes, checksum: 8aed38b1bde83785db9cce9de8e99641 (MD5) CpSpan_825.avi: 1680896 bytes, checksum: 207cad602c39af3002337dcc81b943be (MD5) CpChord_12900.avi: 1543680 bytes, checksum: 6581b30a55d164584dba93d7fb3059ff (MD5) CpChord_7900.avi: 1601536 bytes, checksum: 1e59194e846f44289c34d1d22564ddff (MD5) CpChord_5700.avi: 1680384 bytes, checksum: 2289520642542ab9d01a02a834c86f80 (MD5) CpChord_1650.avi: 1603584 bytes, checksum: 5625a167fcc980fd687307b6f374d1db (MD5) CpChord_3300.avi: 1633280 bytes, checksum: fd9dba62ce7f039f86f08fbf1f40a6da (MD5) CpChord_4500.avi: 1631744 bytes, checksum: 25c8cfaa62d6ca5f745383d20dbe393c (MD5) PFMDissertation.pdf: 16897725 bytes, checksum: 802f103db37f38e9942185f5cb23a8f9 (MD5) CpSpan_7900.avi: 1665536 bytes, checksum: bff60ce8cbfea29284682c7fe2fcbecf (MD5) CpChord_2200.avi: 1601536 bytes, checksum: c267fd85727fdb7c58cd91a7bafa68ff (MD5) CpSpan_1650.avi: 1756672 bytes, checksum: 8b4f1e1e793916f03016a1b05e5e3a57 (MD5) CpSpan_3300.avi: 1725952 bytes, checksum: 6ed315ce76f43cbd44c143fe974c24a0 (MD5) CpSpan_5700.avi: 1662464 bytes, checksum: c5366dc15379b9babb2788d63f4f8991 (MD5)   Previous issue date: 2003-02-06"
  ],
  "handle": "26567",
  "identifier_other": "etd-03312003-173021",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03312003-173021/",
  "identifier_uri": "http://hdl.handle.net/10919/26567",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CpSpan_2200.avi",
    "CpSpan_4500.avi",
    "CpSpan_12900.avi",
    "CpChord_825.avi",
    "CpSpan_825.avi",
    "CpChord_12900.avi",
    "CpChord_7900.avi",
    "CpChord_5700.avi",
    "CpChord_1650.avi",
    "CpChord_3300.avi",
    "CpChord_4500.avi",
    "PFMDissertation.pdf",
    "CpSpan_7900.avi",
    "CpChord_2200.avi",
    "CpSpan_1650.avi",
    "CpSpan_3300.avi",
    "CpSpan_5700.avi"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "aeroacoustic",
    "unsteady loading",
    "cascade response",
    "airfoil in turbulence",
    "inviscid response",
    "unsteady surface pressure"
  ],
  "title": "An Experimental Investigation of Unsteady Surface Pressure on Single and Multiple Airfoils",
  "type": "Dissertation"
}