{
  "contributor_author": "Xu, Yue",
  "contributor_committeechair": "Trani, Antoino A.",
  "contributor_committeecochair": "Baik, Hojong",
  "contributor_committeemember": [
    "Flintsch, Gerardo W.",
    "Koelling, Charles Patrick"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:08:41Z",
  "date_adate": "2008-04-21",
  "date_available": "2014-03-14T20:08:41Z",
  "date_issued": "2008-03-28",
  "date_rdate": "2009-04-21",
  "date_sdate": "2008-03-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The aim of this study is to establish a nation-wide cost-benefit framework for aviation projection appraisal. This framework is built upon Transportation System Analysis Model developed at Virginia Tech Air Transportation System Model (TSAM). Both supply and demand characteristics and their inter-dependence are investigated. It attempts to solve the absence of supply constraints in aviation demand forecast in the literature. In addition, external costs in term of noise and emission are also considered. A national environmental impact analysis introduced by new generation small aircraft system is conducted. Two case studies are discussed to illustrate the framework. The first one is based on the GPS Wide Area Augmentation System (WAAS) Lower Landing Minima capability. It represents a nation-wide cost-benefit analysis with examination of both supply and demand. System-wide benefit of accessibility improvement and infrastructure cost are scrutinized at the same time. A prioritized set of candidate airports for this technology is provided as a result. The second study focuses on New York area. Benefits brought by DataComm technology are evaluated by multi-iteration simulations. DataComm is projected to reduce entry point intrail and final approach separation. The improvements are modeled at individual airport and New York airspace. Consumer surplus is estimated based on demand and delay relationship using TSAM.",
  "description_provenance": [
    "Author Email: yue_xu@msn.com",
    "Advisor Email: flintsch@vt.edu",
    "Advisor Email: koelling@vt.edu",
    "Advisor Email: baikh@mst.edu",
    "Advisor Email: vuela@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:41Z (GMT). No. of bitstreams: 1 Dissertation_V6.pdf: 9990747 bytes, checksum: 31ec4e32dd1dfa0caa6c36fffdba8d8a (MD5)   Previous issue date: 2008-03-28"
  ],
  "handle": "26568",
  "identifier_other": "etd-03312008-112617",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03312008-112617/",
  "identifier_uri": "http://hdl.handle.net/10919/26568",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_V6.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Data Communication",
    "Lower Land Minima",
    "Transportation Systems Analysis Model",
    "Transportation Appraisal",
    "Cost-Benefit Analysis"
  ],
  "title": "Development of Nation Wide Cost-Benefit Analysis Framework for Aviation Decision Making Using Transportation Systems Analysis Model",
  "type": "Dissertation"
}