{
  "contributor_author": "Smith, Troy Scott",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Herndon, Michael K.",
    "Lepczyk, Billie F.",
    "Redican, Kerry J."
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:08:41Z",
  "date_adate": "2010-05-05",
  "date_available": "2014-03-14T20:08:41Z",
  "date_issued": "2010-02-01",
  "date_rdate": "2010-05-05",
  "date_sdate": "2010-03-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to discuss and validate the benefits of surf camps. Additionally, the results of this study will aid the further research of adolescents achieving higher self-esteem levels, increased positive self-worth, and behavior change through non-traditional sports. The primary research question asked for this study is â  How do non-traditional sports, such as surfing, affect self worth, self-esteem, and positive behavior change?â   A survey was used to collect data among surf camp subjects. The participants, ranging from ages 8 to 18, consisted of two focus groups totaling 33 participants, with 17 subjects used for the final data collection. Participants were enrolled in the week long surf camp with Titus International Surf School in Virginia Beach, Virginia. Results suggested that obstacles, such as funding and legislation continue to challenge educational leaders, so the physical education systems that have been put into place must be reevaluated. Non-traditional sports can increase self-esteem, self-worth levels, and behavior change. This exploratory study begins with the development of alternative health and physical education programs, which will help the advancement of health regimens already in place. Some progress has been made in schools since the late 1990â  s, but advancement in new programs and research are slow and minimal.  The results of this study also indicated the need for more positive role models in education, physical education classes, and sports. There is a need for increased parental involvement at home as well as the implementation of year-round health, exercise, and new non-traditional sport programs.",
  "description_provenance": [
    "Author Email: troysmith4jesuschrist@gmail.com",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: mherndon@exchange.vt.edu",
    "Advisor Email: lepczyk@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:41Z (GMT). No. of bitstreams: 1 Smith_TS_D_2010.pdf: 577958 bytes, checksum: 58a7ba8dd1daeb37401052228943dafe (MD5)   Previous issue date: 2010-02-01"
  ],
  "handle": "26573",
  "identifier_other": "etd-03312010-113403",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03312010-113403/",
  "identifier_uri": "http://hdl.handle.net/10919/26573",
  "publisher": "Virginia Tech",
  "relation_haspart": "Smith_TS_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Behavior",
    "Self-worth",
    "Surf Camps",
    "Perceptions"
  ],
  "title": "Exploratory Study of Participants' Perceptions of the Benefits of Surf Camps",
  "type": "Dissertation"
}