{
  "contributor_author": "Klysubun, Prapong",
  "contributor_committeechair": "Indebetouw, Guy J.",
  "contributor_committeemember": [
    "Ritter, Alfred L.",
    "Mizutani, Tetsuro",
    "Zallen, Richard H.",
    "Heflin, James R."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:08:42Z",
  "date_adate": "2002-04-03",
  "date_available": "2014-03-14T20:08:42Z",
  "date_issued": "2002-03-28",
  "date_rdate": "2003-04-03",
  "date_sdate": "2002-04-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nematic liquid crystals possess large optical nonlinearities owing to their large refractive index anisotropy coupled with the collective molecular reorientation. Doping absorbing dyes into liquid crystals increases their optical responses significantly due to increased absorption in the visible region, absorption-induced intermolecular torque, cis-trans photoisomerization, and other guest-host effects. The guest-host mixtures can be employed in display applications, optical storage devices, and others. In this dissertation, nonlinear optical studies were carried out on dye-doped nematic liquid crystal cells. The main objectives of the studies were to distinguish and characterize the several processes that can lead to the formation of dynamic gratings of different types in the samples, and to study the photorefractive and the orientational responses of these samples. Furthermore, we tried to explain and model the dynamical behaviors of the observed grating formations.  The experimental techniques employed in this study include asymmetric two-beam coupling, forced light scattering, and polarization holographic method. The asymmetric two-beam coupling experiments revealed that the induced grating was a photorefractive phase grating created by the nematic director reorientation within the plane of incidence. The dynamics of the beam coupling showed that two different mechanisms with different temporal responses were involved. The grating translation technique identified both gratings as pure photorefractive index gratings with phase shifts of ~ p/2 between the grating and the interference pattern. In addition, the dynamical behavior of the grating formation, obtained from forced light scattering experiments, also exhibited a two-time constant response. The dynamical behaviors of the build-up and decay of the photocurrent were investigated. The two dynamics exhibited both a two-time constant behavior, suggesting that the origin of the two-time constant dynamics observed in the two-beam coupling and the forced light scattering experiments resides in the process of photo-charge generation. The photorefractive gain coefficients were found to be in the range of 100 â   400 cm-1. The values of the nonlinear optical Kerr index   (~ 0.08 cm2/W) measured in samples with certain dye/liquid crystal combinations are higher than what has been observed in other dye-doped nematics and other liquid crystal/polymer systems. All the samples showed a threshold behavior with respect to the magnitude of the applied electric field. This threshold behavior was observed both in forced light scattering experiments and polarization holographic experiments. We believe that the origin of this threshold lies in the process of photogeneration, which was found to exhibit the same threshold behavior at the same value of the applied voltage. An asymmetry of the photorefractive gain with respect to the direction of the applied electric field was observed in samples with high dye concentration. This was attributed to the beam fanning effect, which has also been observed in other high-gain photorefractive materials. Polarization holographic measurements showed that the dye enhancement effect is primarily due to the intermolecular interaction between the dye molecules and the liquid crystal host, and that the trans-cis photoisomerization plays a lesser role. The photoinduced orientational response was also studied using polarization holographic experiments. A number of observations confirmed that the birefringent grating is due to the nematic director reorientation within the plane of incidence, under the combined effect of the applied electric field and the optical field. The diffraction efficiency was found to depend linearly on the writing beam power, while the dependence of the self-diffraction efficiency on the writing beam power roughly assumes a cubic relationship. The dynamical behavior of the birefringent grating formation was investigated. The build-up dynamics was found to be best modeled as a double-time constant response, while the decay is best fitted by a single exponential. The response of the samples to an oscillating electric field was studied as a function of the modulation frequency. Very interesting and reproducible dynamics was observed, revealing the complex dynamical response of the liquid crystal director to the magnitude and rate of change of an applied electric field. The small signal response was also measured, but did not reveal any sign of a resonance behavior. The conductivity and the photoconductivity of the samples were measured. The relationship between the measured current and the applied voltage was found to be cubic at low applied voltage, and to become linear at higher applied voltage. We could explain this behavior using a double-charge-injection-in-a-weak-electrolyte model, but this is only one of the possible mechanisms that could explain this behavior. The photocurrent was found to increase linearly with the illumination power, which indicates that the charge carrier recombination rate is proportional to the carrier density. The measured electrical conductivity was found to be proportional to the square root of the dye concentration, confirming the validity of the proposed charge-injection model.",
  "description_provenance": [
    "Author Email: prapong@vt.edu",
    "Advisor Email: aritter@vt.edu",
    "Advisor Email: mizutani@vpihe1.phys.vt.edu",
    "Advisor Email: rzallen@vt.edu",
    "Advisor Email: gindebet@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:42Z (GMT). No. of bitstreams: 1 Klysubun_ETD.pdf: 2101144 bytes, checksum: 74b740dbebb949b45a8bdf8aa985ad49 (MD5)   Previous issue date: 2002-03-28"
  ],
  "handle": "26577",
  "identifier_other": "etd-04012002-152209",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04012002-152209/",
  "identifier_uri": "http://hdl.handle.net/10919/26577",
  "publisher": "Virginia Tech",
  "relation_haspart": "Klysubun_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "forced light scattering",
    "two-beam coupling",
    "nonlinear optics",
    "polarization grating",
    "photorefractive effect",
    "dye-doped liquid crystals"
  ],
  "title": "Nonlinear optical studies of dye-doped nematic liquid crystals",
  "type": "Dissertation"
}