{
  "contributor_author": "Mariano, Gina",
  "contributor_committeechair": "Doolittle, Peter E.",
  "contributor_committeemember": [
    "Hicks, David",
    "Williams, Thomas O. Jr.",
    "Sherman, Thomas M."
  ],
  "contributor_department": "Learning Sciences and Technologies",
  "date_accessioned": "2014-03-14T20:08:41Z",
  "date_adate": "2008-04-10",
  "date_available": "2014-03-14T20:08:41Z",
  "date_issued": "2008-03-28",
  "date_rdate": "2008-04-10",
  "date_sdate": "2008-03-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to determine the effects of segmentation on immediate and delayed recall and transfer in a multimedia learning environment. The independent variables of segmentation and non-segmentation, and immediate and delayed assessments were manipulated to assess the effects of segmentation on the participantsâ   ability to recall and transfer information from the multimedia tutorial. Data was analyzed using a 2X2 factorial design. The results of this study found that segmentation of multimedia tutorials did not result in significant differences in recall or transfer. The results also revealed that the time period between when a tutorial was viewed and when the recall and transfer assessments were taken did significantly affect participants ability to recall and transfer information.",
  "description_provenance": [
    "Author Email: finalydr@vt.edu",
    "Advisor Email: hicks@vt.edu",
    "Advisor Email: thwilli1@vt.edu",
    "Advisor Email: tsherman@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:41Z (GMT). No. of bitstreams: 2 MarianoIRBApprovalETD.pdf: 208432 bytes, checksum: 25ad2f36b9c5c292096373e8783ef715 (MD5) MarianoDissertationETDFinal.pdf: 149744 bytes, checksum: b68315da5a429bb594f0e07f42f3fbc7 (MD5)   Previous issue date: 2008-03-28"
  ],
  "handle": "26570",
  "identifier_other": "etd-03312008-231514",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03312008-231514/",
  "identifier_uri": "http://hdl.handle.net/10919/26570",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "MarianoIRBApprovalETD.pdf",
    "MarianoDissertationETDFinal.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Segmentation",
    "Transfer",
    "Multimedia Learning"
  ],
  "title": "An Investigation of the Effect of Segmentation on Immediate and Delayed Knowledge Transfer in a Multimedia Learning Environment",
  "type": "Dissertation"
}