{
  "contributor_author": "Parker, Suzanne M.",
  "contributor_committeecochair": [
    "Uttech, Melanie R.",
    "Stratton, Richard K."
  ],
  "contributor_committeemember": [
    "Poole, Jon R.",
    "Rice, Lisa",
    "Baffi, Charles R."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:42Z",
  "date_adate": "2002-04-16",
  "date_available": "2014-03-14T20:08:42Z",
  "date_issued": "2002-03-29",
  "date_rdate": "2003-04-16",
  "date_sdate": "2002-04-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>S. Parker Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body bgcolor=\"#FFFFFF\" text=\"#000000\"> By law, physical education (PE) teachers must provide direct service to children  with disabilities in the least restrictive environment, which, whenever feasible,  is a regular PE class. Traditionally, the adapted physical education (APE) specialist  was responsible for teaching students with severe disabilities and the PE teacher  was responsible for teaching students with mild disabilities. Today, however,  many students with disabilities must be taught in a regular PE setting minimizing  the need for the APE specialist. Now PE teachers are having to teach all students  with disabilities, but some teacher preparation programs are not providing preservice  teachers with opportunities to work with these students before their student teaching  experience. A qualitative study was conducted to investigate preservice PE teachers'  in-class experiences teaching students with emotional/ behavioral disorders (EBD)  in a general education setting. Multiple interviews and observations were conducted  with four preservice teachers throughout the span of their student teaching experience  to examine their thoughts, feelings, and concerns about teaching students with  EBD as well as examining their interactions with these students. The participants  indicated that in order to feel more qualified to teach students with EBD, they  needed more experience. Further, they struggled with issues of inclusion while  they encountered a gamut of emotions throughout their experiences. These findings  point to the need to enhance preservice PE teachers' experiences with more related  fieldwork.<br> <br> </body> </html>",
  "description_provenance": [
    "Author Email: suparker@vt.edu",
    "Advisor Email: jpoole@radford.edu",
    "Advisor Email: uttech@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: ehess@gwu.edu",
    "Advisor Email: baffic@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:42Z (GMT). No. of bitstreams: 1 Sparkerfinal.pdf: 643751 bytes, checksum: eced6d52d16ec3fcb301f56006628cb2 (MD5)   Previous issue date: 2002-03-29"
  ],
  "handle": "26576",
  "identifier_other": "etd-04012002-140335",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04012002-140335/",
  "identifier_uri": "http://hdl.handle.net/10919/26576",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sparkerfinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Emotional/Behavioral Disorders",
    "Physical Education",
    "Preservice"
  ],
  "title": "Preservice Physical Education Teachers' Perceptions Toward Teaching Students With Emotional/Behavioral Disorders in a General Education Setting",
  "type": "Dissertation"
}