{
  "contributor_author": "Sherfy, Mark Huffman",
  "contributor_committeechair": "Kirkpatrick, Roy L.",
  "contributor_committeemember": [
    "Webb, Kenneth E. Jr.",
    "Voshell, J. Reese Jr.",
    "Vaughan, Michael R.",
    "Stauffer, Dean F."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:08:42Z",
  "date_adate": "1999-04-23",
  "date_available": "2014-03-14T20:08:42Z",
  "date_issued": "1998-04-16",
  "date_rdate": "2000-04-23",
  "date_sdate": "1999-03-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "NUTRITIONAL VALUE AND MANAGEMENT OF WATERFOWL AND SHOREBIRD FOODS IN ATLANTIC COASTAL MOIST-SOIL IMPOUNDMENTS by Mark H. Sherfy Roy L. Kirkpatrick, Chair Fisheries and Wildlife Sciences   ABSTRACT \tThe mid-Atlantic coast region, an area of continental significance to migratory and wintering waterfowl and shorebirds, contains numerous moist-soil impoundments that are managed for waterbirds.  Positive relationships between nonbreeding body condition and subsequent survival and reproduction have been documented for waterfowl, yet few evaluations of habitat management consider nutritional value of foods.  I assessed 2 types of impoundment manipulation, using nutritional data as a basis for evaluation. \tInvertebrate and plant seed production were measured in disced and control plots in impoundments at Back Bay National Wildlife Refuge.  Seed production was higher (P = 0.0614) in disced (1052 ± 468 kg / ha) than in control (529 ± 226 kg / ha) plots.  Discing produced higher Chironomid larva abundance during spring, and higher abundance of Amphipods and non-Chironomid Diptera during fall.  Waterbird predation reduced abundance of Chironomid larvae, non-Chironomid Diptera, and Amphipods.  The predation effect on Total Invertebrate dry mass was 2x higher in disced than in control areas. \tInvertebrate production also was measured in habitats denuded by foraging greater snow geese (Anser caerulescens atlantica) at Prime Hook National Wildlife Refuge.  Chironomid larvae were 2 -6x more abundant in vegetated habitats than in areas where geese had foraged intensively, but exclosure data showed little effect of shorebird predation on invertebrate abundance.  These results suggest that high goose populations can reduce waterbird food availability, and that shorebird use of invertebrates in denuded habitats is low. \tMean true metabolizable energy (TME) of moist-soil seeds and invertebrates in blue-winged teal (Anas discors) ranged from -0.18 - 3.47 kcal / g.  Correction of means for fiber concentration eliminated negative values, thereby enhancing their practical value. \tPotential duck use-days predicted using TME and seed production data were about 2x higher for disced than for control areas at Back Bay.  Magnitude of the discing effect on duck use-days was largely insensitive to different estimates of seed nutritional value, although substantial variation in absolute measures of potential carrying capacity occurred.  Discing positively influenced invertebrate abundance, and quantity and quality of moist-soil seeds produced, and should be considered a viable habitat management approach for both shorebirds and waterfowl.",
  "description_provenance": [
    "Author Email: msherfy@usgs.gov",
    "Advisor Email: rlkirk@vt.edu",
    "Advisor Email: webbk@vt.edu",
    "Advisor Email: rvoshell@vt.edu",
    "Advisor Email: mvaughan@vt.edu",
    "Advisor Email: dstauffe@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:42Z (GMT). No. of bitstreams: 8 front.pdf: 72275 bytes, checksum: 390bc6241c954a20e8a49c0f18999a8c (MD5) chapter3.pdf: 139050 bytes, checksum: 9b37b2ccb3bce7869c3ab1e6a32d68fe (MD5) appende.pdf: 41167 bytes, checksum: 833b5d478f361bc461f22ecf2000641a (MD5) appendad.pdf: 4131578 bytes, checksum: 4ab245798796384ecb4c10c4d0b9ef35 (MD5) chapter1.pdf: 154851 bytes, checksum: 6e02339eb42827e190d4c0e97fd4ff60 (MD5) chapter2.pdf: 1011028 bytes, checksum: 90cddf92a0c882b89ca39caa3507b6ae (MD5) chapter5.pdf: 33316 bytes, checksum: 07aa2b10b3f2bfe4b43b580767cb4c19 (MD5) chapter4.pdf: 2605385 bytes, checksum: dd927083460933a23fe210dd87b2a7db (MD5)   Previous issue date: 1998-04-16"
  ],
  "handle": "26575",
  "identifier_other": "etd-033199-130907",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-033199-130907/",
  "identifier_uri": "http://hdl.handle.net/10919/26575",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "front.pdf",
    "chapter3.pdf",
    "appende.pdf",
    "appendad.pdf",
    "chapter1.pdf",
    "chapter2.pdf",
    "chapter5.pdf",
    "chapter4.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "moist-soil management",
    "Shorebirds",
    "blue-winged teal",
    "nutrition",
    "waterfowl",
    "impoundment",
    "metabolizable energy"
  ],
  "title": "Nutritional Value and Management of Waterfowl and Shorebird Foods in Atlantic Coastal Moist-Soil Impoundments.",
  "type": "Dissertation"
}