{
  "contributor_author": "Learman, Sarah Sebring",
  "contributor_committeechair": "Walker, Richard A.",
  "contributor_committeemember": [
    "Cimini, Daniela",
    "Sible, Jill C.",
    "Wojcik, Edward J.",
    "Kim, Sunyoung"
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:08:42Z",
  "date_adate": "2008-04-15",
  "date_available": "2014-03-14T20:08:42Z",
  "date_issued": "2008-03-21",
  "date_rdate": "2009-04-15",
  "date_sdate": "2008-04-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Mitosis, or cell division, is the mechanism by which cells divide and is an intricate process requiring the action and control of numerous proteins.  Such proteins serve either as structural entities within the mitotic spindle, or perform the 창  work창   within the apparatus.  In particular, Kinesin-5 motor proteins, a subset within the kinesin motor protein superfamily, are primarily responsible for organization of microtubules (MTs) within the mitotic apparatus, and are consequently vital for efficient mitosis.  These proteins utilize energy from ATP hydrolysis in order to 창  walk창   along antiparallel MTs, positioning them into the bipolar mitotic spindle.  Loss of Kinesin-5 activity results in formation of a monoastral spindle and subsequent cell cycle arrest.  Recently, a wide variety of small molecules have been identified that possess the ability to inhibit certain Kinesin-5 motors.  Such compounds, including monastrol (the first Kinesin-5 inhibitor identified), have been employed to study Kinesin-5 activity.  A thorough understanding of Kinesin-5 function, combined with the ability to specifically target these proteins with small molecules, may provide the capability to control cell division and may therefore have significant implications in anti-cancer therapies. The following dissertation describes research that utilizes small molecules to probe the function (ATPase activity and MT interactions) of various Kinesin-5 proteins and provides information that will lead to a better understanding of exactly how such proteins function in vivo.  Further, a greater knowledge of Kinesin-5 protein activity as well as specific interactions with small-molecule compounds, may lead to the development of more potent, less toxic anti-cancer drugs.",
  "description_provenance": [
    "Author Email: slearman@vt.edu",
    "Advisor Email: cimini@vt.edu",
    "Advisor Email: siblej@vt.edu",
    "Advisor Email: rawalker@vt.edu",
    "Advisor Email: ewojci@lsuhsc.edu",
    "Advisor Email: skim3@lsuhsc.edu",
    "Made available in DSpace on 2014-03-14T20:08:42Z (GMT). No. of bitstreams: 1 SSLearmanDissertation2.pdf: 7071925 bytes, checksum: c11468b1d0ae25e10fbfb3e0d9529f0b (MD5)   Previous issue date: 2008-03-21"
  ],
  "handle": "26579",
  "identifier_other": "etd-04012008-102118",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04012008-102118/",
  "identifier_uri": "http://hdl.handle.net/10919/26579",
  "publisher": "Virginia Tech",
  "relation_haspart": "SSLearmanDissertation2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "albumin",
    "ATPase",
    "HsEg5",
    "inhibitor",
    "kinesin",
    "microtubule(s)",
    "mitosis",
    "monastrol"
  ],
  "title": "Small-Molecule Control of Kinesin-5 Proteins",
  "type": "Dissertation"
}