{
  "contributor_author": "Shifflett, Jr., Douglas Wayne",
  "contributor_committeechair": "Cash, Carol S.",
  "contributor_committeemember": [
    "Earthman, Glen I.",
    "Creighton, Theodore B.",
    "Twiford, Travis W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:41Z",
  "date_adate": "2010-04-08",
  "date_available": "2014-03-14T20:08:41Z",
  "date_issued": "2010-03-17",
  "date_rdate": "2010-04-08",
  "date_sdate": "2010-03-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to investigate and report teacher perceptions during a renovation project.  A quantitative analysis of six demographic variables and a 24 item survey questionnaire provided information related to school renovation, school leadership, student academic achievement, and teacher morale.  This phenomenological study included survey responses from 74 out of a possible 76 teachers who were present during one of the two almost identical high school renovation projects in a rural school division in Virginia.  These two high schools had the same renovation timeline, floor plan, architectural design team, and construction company.  Independent sample t-tests and one-way Analysis of Variances (ANOVA) were used to determine differences in teacher satisfaction, schools, or demographic variables. The first major finding found overall teacher satisfaction was minimally affected by the renovation project (satisfied 36.5%, neutral 59.5%, and dissatisfied 4%).  Factors that may have affected this finding include: lapse in teacher memory due to collection of data 10 months after the completion of the project, a feeling of ambivalence by the teachers, or the fact that the principal of one of the schools was also the researcher which may have caused survey responses to be more neutral.  Both males and females felt satisfied but the females were less satisfied regarding safety, cleanliness, job satisfaction, and school rating.  Differences between satisfied and dissatisfied teachers involving cleanliness, considering relocating during the project, seeking a transfer to avoid another project, and room temperature were found to have significance and moderate effect sizes.  The schools had differences in overall satisfaction levels with one school having more satisfied teachers   versus more teachers coded as neutral at the other school. While teachers at both schools felt safe during the renovation project and odor had an effect on satisfaction, satisfaction levels were different at each school.  The last finding was a difference in job satisfaction levels between the age categories of 21-25 and  26-35 which could affect teacher retention.  This study also concludes the need for doctoral and principal preparation programs to include information regarding the leadership role during a renovation project and how decisions may affect teacher satisfaction.",
  "description_provenance": [
    "Author Email: dwshiffl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:41Z (GMT). No. of bitstreams: 1 Shifflett_DW_D_2010.pdf: 1701829 bytes, checksum: a79ba41924470bbe0b927dd717f2d82c (MD5)   Previous issue date: 2010-03-17"
  ],
  "handle": "26572",
  "identifier_other": "etd-03312010-105646",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-03312010-105646/",
  "identifier_uri": "http://hdl.handle.net/10919/26572",
  "publisher": "Virginia Tech",
  "relation_haspart": "Shifflett_DW_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "renovation project",
    "teacher satisfaction",
    "teacher experiences",
    "teacher recommendations"
  ],
  "title": "A Study of Teacher Experiences During a Renovation Project",
  "type": "Dissertation"
}