{
  "contributor_author": "Cai, Ting",
  "contributor_committeechair": "Dorn, Harry C.",
  "contributor_committeemember": [
    "Gibson, Harry W.",
    "Carlier, Paul R.",
    "Troya, Diego",
    "Taylor, Larry T."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:08:43Z",
  "date_adate": "2008-04-21",
  "date_available": "2014-03-14T20:08:43Z",
  "date_issued": "2008-03-26",
  "date_rdate": "2009-04-21",
  "date_sdate": "2008-04-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Endohedral metallofullerenes (EMF) have attracted increasing attention during past decades for their potential applications in the fields of biomedicine and nanomaterials. Trimetallic nitride template endohedral metallofullerenes (TNT EMFs) are some of the most promising fullerene-based materials (e.g., as MRI and X-ray contrast agents) because of their high yields compared to classic endohedral metallofullerenes. This dissertation addresses the chemical reactivity and regioselectivity of TNT EMFs. Based on the extraordinarily high stability of TNT EMFs relative to empty cage fullerenes and classic endohedral metallofullerenes, macroscopic quantities of high purity TNT EMFs were obtained directly from crude soot in a single facile step by using a cyclopentadiene-functionalized resin to trap the more reactive species via Diels-Alder reactions, allowing the TNT EMFs to pass through. We also developed a support-free chemical separation method of TNT EMFs from Sc- and Lu-based soot extract that makes use of the differing solubilities of unreacted TNT EMFs versus 9-methylanthracene-derivatized empty cage fullerenes.  The exohedral functionalization of metallofullerenes can fine-tune their chemical and physical properties.  The first N-methylpyrrolidino derivatives of TNT EMFs (Ih Sc3N@C80 and Ih Er3N@C80) were synthesized via 1,3-dipolar cycloaddition of N-methylazomethine ylides (Prato reaction). The demonstration of planar symmetry in the N-methylpyrrolidino derivatives by 13C NMR spectroscopy suggested that the reaction exclusively took place at the 5,6-ring junction. However, both 5,6-ring and 6,6 ring junction adducts were obtained when Ih Sc3N@C80 reacted with N-triphenylmethyl-5-oxazolidinone, as characterized by NMR spectroscopy and X-ray crystallography. The kinetically favored 6,6-ring junction adduct was converted to the thermodynamic product, the 5,6-ring junction adduct, upon thermal equilibration. The synthesis of pyrrolidino derivatives was also extended to two other Sc-based TNT EMFs, D5h Sc3N@C80 and Sc3N@C78.  The reactivity and regioselectivity of D5h Sc3N@C80 and Sc3N@C78 were demonstrated by NMR spectroscopy, X-ray crystallography and theoretical calculations. Another type of reaction, the Bingel-Hirsch cyclopropanation was carried out with D3h Sc3N@C78 for the first time, yielding a single Cs-symmetric monoadduct and a dominant C2v-symmetric diadduct for the first time. The symmetric diadduct clearly demonstrates the remarkable regioselectivity control exerted by the encapsulated Sc3N cluster. We employed a LUMO electron density surface computational approach to predict multiadduct docking sites on the ellipsoidal fullerene cage surface. We also successfully synthesized the first derivative of a non-IPR fullerene, the diethyl malonate derivative of Sc3N@C68 by a Bingel-Hirsch reaction. The reactivity and regioselectivity of Sc3N@C68 were investigated by NMR spectroscopy and theoretical calculations.",
  "description_provenance": [
    "Author Email: caitinn@vt.edu",
    "Advisor Email: hdorn@vt.edu",
    "Advisor Email: hwgibson@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Advisor Email: troya@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:43Z (GMT). No. of bitstreams: 1 DissertationTC.pdf: 14037253 bytes, checksum: 78612a7f0e8aab5768d48871dfa04bab (MD5)   Previous issue date: 2008-03-26"
  ],
  "handle": "26583",
  "identifier_other": "etd-04012008-221158",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04012008-221158/",
  "identifier_uri": "http://hdl.handle.net/10919/26583",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationTC.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Fullerene",
    "Metallofullerene",
    "Endohedral",
    "Functionalization",
    "Reactivity",
    "Regioselectivity",
    "Scandium Nitride"
  ],
  "title": "Chemical Reactivity and Regioselectivity of Trimetallic Nitride Endohedral Metallofullerenes",
  "type": "Dissertation"
}