{
  "contributor_author": "Wilder, Frederick Durand",
  "contributor_committeechair": "Clauer, C. Robert",
  "contributor_committeemember": [
    "Scales, Wayne A.",
    "Ruohoniemi, J. Michael",
    "Baker, Joseph B. H.",
    "Pratt, Timothy J.",
    "Simonetti, John H."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:08:45Z",
  "date_adate": "2011-05-05",
  "date_available": "2014-03-14T20:08:45Z",
  "date_issued": "2011-03-29",
  "date_rdate": "2011-05-05",
  "date_sdate": "2011-04-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The polar electric potential imposed on the ionosphere by coupling between the earthâ  s magnetosphere and the solar wind has been shown to have a non-linear response to the interplanetary electric field (IEF). This dissertation presents an empirical study of this polar cap potential saturation phenomenon. First, the saturation of the reverse convection potential under northward is demonstrated using bin-averaged SuperDARN data. Then, the saturation reverse convection potential is shown to saturate at a higher value at higher solar wind plasma beta. The reverse convection flow velocity is then compared with cross-polar cap flows under southward IMF under summer, winter and equinox conditions. It is demonstrated that the reverse convection flow exhibits the opposite seasonal behavior to cross polar cap flow under southward IMF. Then, an interhemispheric case study is performed to provide an explanation for the seasonal behavior of the reverse convection potential. It is found using DMSP particle precipitation data that the reverse convection cells in the winter circulate at least partially on closed field lines. Finally, SuperDARN and DMSP data are merged to provide polar cap potential measurements for a statistical study of polar cap potential saturation under southward IMF. It is found that the extent of polar cap potential saturation increases with increasing Alfvenic Mach number, and has no significant relation to Alfven wing transmission coefficient or solar wind dynamic pressure.",
  "description_provenance": [
    "Author Email: fwilder@vt.edu",
    "Advisor Email: rclauer@vt.edu",
    "Advisor Email: wscales@vt.edu",
    "Advisor Email: mikeruo@vt.edu",
    "Advisor Email: bakerjb@vt.edu",
    "Advisor Email: tipratt@vt.edu",
    "Advisor Email: jhs@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:45Z (GMT). No. of bitstreams: 1 Wilder_FD_D_2011.pdf: 171229256 bytes, checksum: ad2aa75a581db26ef3ac13dcaa2225e2 (MD5)   Previous issue date: 2011-03-29"
  ],
  "handle": "26586",
  "identifier_other": "etd-04012011-110034",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04012011-110034/",
  "identifier_uri": "http://hdl.handle.net/10919/26586",
  "publisher": "Virginia Tech",
  "relation_haspart": "Wilder_FD_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Solar Wind",
    "Ionosphere",
    "Magnetosphere",
    "Electromagnetics",
    "Plasma Physics"
  ],
  "title": "The Non-Linear Electrodynamic Coupling Between the Solar Wind, Magnetosphere and Ionosphere",
  "type": "Dissertation"
}