{
  "contributor_author": "Lin, Hui",
  "contributor_committeechair": "Fan, Weiguo Patrick",
  "contributor_committeemember": [
    "Killough, Larry N.",
    "Wallace, Linda G.",
    "Sheetz, Steven D.",
    "Cobb, Anthony Terry"
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:08:43Z",
  "date_adate": "2008-04-23",
  "date_available": "2014-03-14T20:08:43Z",
  "date_issued": "2008-03-19",
  "date_rdate": "2009-04-23",
  "date_sdate": "2008-04-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Knowledge has long been recognized as one of the most valuable assets in an organization.  Managing and organizing knowledge has become an important corporate strategy for organizations to gain and maintain competitive advantages in the information age.  Electronic knowledge repositories (EKRs) have become increasingly popular knowledge sharing tools implemented by organizations to promote knowledge reuse.  The goal of this study is to develop and test a research model that explains usersâ   continued usage behavior of EKRs in public accounting firms.  Theoretically grounded in the expectation-confirmation model (ECM) and commitment-based model, the research model presented in this study integrates both of these theoretical perspectives to study usersâ   EKR continuance intentions.     This study surveyed 230 EKR users from four large public accounting firms.  Partial least squares regression was used to test the hypotheses and the explanatory power of the model.  Results indicate that perceived usefulness and commitment exhibit a sustained positive influence on continuance intention.  Additionally, subjective norms are positively related to calculative commitment and moral commitment.  Organizational identification is positively related to affective commitment and moral commitment.  Perceived usefulness is positively related to affective commitment and calculative commitment.  The model comparisons with the technology acceptance model (TAM) and ECM demonstrated that the integrated model presented in this research explained 1.6% and 0.8% additional variance in continuance intention than both ECM and TAM respectively.  Additional multi-group analyses were also conducted to examine the differences between knowledge seekers and contributors and the differences between knowledge novices and experts.    This study raises theoretical implications in the area of knowledge management in general and EKRs in particular.  It represents one of the first attempts to empirically examine usersâ   continuance intention of knowledge management applications.  This study has presented a different perspective on technology acceptance/continued usage by introducing commitment to explain continued IS usage.  By integrating commitment and ECM, this study offers a useful framework for future studies on technology use.  It demonstrates that both user commitment and perceived usefulness are strong predictors of EKR continuance intention.  The results also raise interesting implications for practitioners interested in knowledge management and particularly for public accounting firms how to leverage EKRs to gain a competitive advantage.",
  "description_provenance": [
    "Author Email: anon142@vt.edu",
    "Advisor Email: larry@vt.edu",
    "Advisor Email: wfan@vt.edu",
    "Advisor Email: wallacel@vt.edu",
    "Advisor Email: sheetz@vt.edu",
    "Advisor Email: tcobb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:43Z (GMT). No. of bitstreams: 1 EKR_Dissertation_Final_HLin.pdf: 309389 bytes, checksum: 68b0c8459ea56375a200d45810bba1d7 (MD5)   Previous issue date: 2008-03-19"
  ],
  "handle": "26582",
  "identifier_other": "etd-04012008-171258",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04012008-171258/",
  "identifier_uri": "http://hdl.handle.net/10919/26582",
  "publisher": "Virginia Tech",
  "relation_haspart": "EKR_Dissertation_Final_HLin.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "electronic knowledge repositories",
    "IS continued usage",
    "IS continuance",
    "commitment",
    "expectation-confirmation model"
  ],
  "title": "Examining the Continued Usage of Electronic Knowledge Repositories: An Integrated Model",
  "type": "Dissertation"
}