{
  "contributor_author": "Cook, Don Lloyd",
  "contributor_committeechair": "Sirgy, M. Joseph",
  "contributor_committeemember": [
    "Brown, James R.",
    "Ozanne, Julie L.",
    "Hiller, Janine S.",
    "Barkhi, Reza"
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:08:45Z",
  "date_adate": "2003-04-25",
  "date_available": "2014-03-14T20:08:45Z",
  "date_issued": "2001-12-12",
  "date_rdate": "2004-04-25",
  "date_sdate": "2003-04-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Many consumers seem to be uncomfortable or unwilling in making online transactions.  This lack of trust stems in part from the online exchange process itself where consumers are deprived of many traditional cues that they would use to evaluate this process.  This research focuses on consumer perceptions of regulatory governance in online exchanges and how signals of governance might act to increase consumer trust in online transac-tions.  An experimental methodology was used to examine the effects of different types of structures on consumer perceptions and to provide direction for public policy makers as well as online businesses and private regulatory entities.",
  "description_provenance": [
    "Author Email: docook@vt.edu",
    "Advisor Email: jamesb@vt.edu",
    "Advisor Email: jozanne@vt.edu",
    "Advisor Email: jhiller@vt.edu",
    "Advisor Email: sirgy@vt.edu",
    "Advisor Email: reza@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:45Z (GMT). No. of bitstreams: 1 COOK_DISSERTATION_REVISED.pdf: 1029165 bytes, checksum: 8dcf8f4da80b062223b47282c6509e6d (MD5)   Previous issue date: 2001-12-12"
  ],
  "handle": "26589",
  "identifier_other": "etd-04022003-153657",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04022003-153657/",
  "identifier_uri": "http://hdl.handle.net/10919/26589",
  "publisher": "Virginia Tech",
  "relation_haspart": "COOK_DISSERTATION_REVISED.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "online",
    "governance",
    "privacy",
    "regulation"
  ],
  "title": "Governance Mechanisms as a Means of Increasing Consumer Trust in Online Exchanges:  A Signaling Perspective",
  "type": "Dissertation"
}