{
  "contributor_author": "Lomax, Franklin Delano",
  "contributor_committeechair": "Nelson, Douglas J.",
  "contributor_committeemember": [
    "Ellis, Michael W.",
    "Vandsburger, Uri",
    "Liu, Y. A.",
    "von Spakovsky, Michael R."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:08:45Z",
  "date_adate": "2001-04-06",
  "date_available": "2014-03-14T20:08:45Z",
  "date_issued": "2001-03-16",
  "date_rdate": "2006-03-16",
  "date_sdate": "2001-04-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Principles of concurrent development are applied to the design of a small-scale device for converting natural gas or liquefied petroleum gas into hydrogen.  The small hydrogen generator is intended for serial production for application in the production of industrial hydrogen, fueling stationary fuel cell power systems and refueling hydrogen-fueled fuel cell electric vehicles.  The concurrent development process is contrasted with the traditional, linear development process for petrochemical systems and equipment, and the design is benchmarked against existing small hydrogen generators as well as industrial hydrogen production apparatus.  A novel system and hardware design are described, and a single cycle of concurrent development is applied in the areas of catalyst development, thermodynamic optimization, and reactor modeling and design.  The impact of applying concurrent development techniques is assessed through economic modeling, and directions for future development work are identified.",
  "description_provenance": [
    "Author Email: Lomax@H2Gen.com",
    "Advisor Email: mwellis@vt.edu",
    "Advisor Email: Doug.Nelson@vt.edu",
    "Advisor Email: uri@shakti.me.vt.edu",
    "Advisor Email: design@vt.edu",
    "Advisor Email: vonspako@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:45Z (GMT). No. of bitstreams: 1 FinalSubmission.pdf: 4979203 bytes, checksum: de70e6df60e49e8dca188c51c1a43335 (MD5)   Previous issue date: 2001-03-16"
  ],
  "handle": "26587",
  "identifier_other": "etd-04022001-175519",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04022001-175519/",
  "identifier_uri": "http://hdl.handle.net/10919/26587",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalSubmission.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hydrogen",
    "steam reformer",
    "concurrent engineering",
    "fuel cell"
  ],
  "title": "Application of Concurrent Development Practices to Petrochemical Equipment Design",
  "type": "Dissertation"
}