{
  "contributor_author": "Ratnaparkhe, Supriya M",
  "contributor_committeechair": "Egertsdotter, E. M. Ulrika",
  "contributor_committeecochair": "Flinn, Barry S.",
  "contributor_committeemember": [
    "Clark, Ian M.",
    "Brunner, Amy M."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:08:43Z",
  "date_adate": "2009-04-22",
  "date_available": "2014-03-14T20:08:43Z",
  "date_issued": "2009-03-19",
  "date_rdate": "2012-04-12",
  "date_sdate": "2009-04-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Extracellular matrix (ECM) modifications occur during plant growth, development, and in response to environmental stimuli.  Key modulators of ECM modification in vertebrates, the extracellular matrix metalloproteinases (MMPs), have also been described in a few plants.  Here, we report the identification of Loblolly pine (Pinus taeda) Pta1-MMP and its characterization during seed development and germination.  The Pta1-MMP protein has the structural characteristics of other plant MMPs, and a recombinant protein (rPta-MMP) generated by using EST sequences for a seed-expressed MMP exhibits Zn2+-dependent protease activity, and is inhibited by the active site-binding hydroxamate inhibitor GM6001 and EDTA.  The Pta1-MMP gene is expressed during embryo development, with transcript levels increasing from proembryo to early cotyledonary stage, then declining during late cotyledonary expansion and maturation drying.  Protein extracts exhibited similar developmental-stage MMP-like activity.  Seed imbibition in water facilited germination, which was stimulated by GA3 and inhibited by ABA.  The timing of germination was mirrored by the presence of MMP-like protease activity in both water- and GA3-imbibed embryos.  Pta1-MMP transcript levels increased in association with germination for both GA3- and water-treated embryos, in agreement with MMP-like activity.  In contrast, by 10 days after imbibition, Pta1-MMP transcripts in ABA-treated embryos were at levels similar to the other treatments, although MMP-like activity was not observed. The application of GM6001 during Loblolly pine seed imbibition inhibited germination in a dose-dependent manner.  Our results suggest that Pta1-MMP is required for ECM modification, facilitating the cell division and expansion required for both embryo development and germination.  To our knowledge, this is the first report of an MMP in any gymnosperm and also its involvement in embryo development and subsequent germination.",
  "description_provenance": [
    "Author Email: supriyar@vt.edu",
    "Advisor Email: I.Clark@uea.ac.uk",
    "Advisor Email: abrunner@vt.edu",
    "Advisor Email: ulrika.egertsdotter@biology.gatech.edu",
    "Advisor Email: barry.flinn@ialr.org",
    "Made available in DSpace on 2014-03-14T20:08:43Z (GMT). No. of bitstreams: 1 SRETD3.pdf: 3703270 bytes, checksum: 15d8d29dff9db1455060c80c6e31be60 (MD5)   Previous issue date: 2009-03-19"
  ],
  "handle": "26584",
  "identifier_other": "etd-04012009-191500",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04012009-191500/",
  "identifier_uri": "http://hdl.handle.net/10919/26584",
  "publisher": "Virginia Tech",
  "relation_haspart": "SRETD3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Embryo development",
    "Germination",
    "Extracellular matrix",
    "Proteolysis",
    "Matrix metalloproteinase",
    "Pinus taeda L."
  ],
  "title": "Identification and characterization of a matrix metalloproteinase (Pta1-MMP) expressed during Loblolly pine (Pinus taeda) seed development and germination",
  "type": "Dissertation"
}