{
  "contributor_author": "Mount, Marianne Evans",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeecochair": "Hultgren, Francine H.",
  "contributor_committeemember": [
    "Klunk, Clare D.",
    "Renard, Paul D.",
    "Moore, Michael Grahame"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:08:46Z",
  "date_adate": "2008-04-15",
  "date_available": "2014-03-14T20:08:46Z",
  "date_issued": "2008-03-19",
  "date_rdate": "2008-04-15",
  "date_sdate": "2008-04-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Marianne Evans Mount Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>The purpose of this hermeneutic phenomenological study was to better understand the ways that adult learners studying Catholic theology become present to one another, strengthen bonds of community, and contemplate the face of Christ in computer-mediated, text-based distance education. Ten geographically dispersed learners seeking undergraduate or graduate degrees in Catholic theology participated in the study. There was no face-to-face interaction.</p> <p>Through a password protected site specifically designed for the research, participants engaged in eight weeks of text-based, online conversation. They reflected on emergent themes about technology and the ways that it alters time, place, presentation of self, and relationships. Text as sacred, relational, presentational, communal, and transformational was explored, as was the nature and meaning of community, especially the spiritual quest to contemplate the face of Christ in an online community. The study offers a deep understanding of the meaning of presence and the development of community in the context of faith.</p> <p>Serving as the philosophical methodological foundation were the writings of Martin Heidegger (1927/1993), Hans-Georg Gadamer (1960/1999), Gabriel Marcel (1937/1967), John Paul II as Cardinal Carol Wojtyla (1976), and Robert Sokolowski (1993). The phenomenological method of Max van Manen (2003) guided data collection and analysis through the dynamic interplay of six research activities: (a) turning to the phenomenon which seriously interests us and commits us to the world; (b) investigating experience as we live it rather than as we conceptualize it; (c) reflecting on the essential themes which characterize the phenomenon; (d) describing the phenomenon through the art of writing and rewriting; (e) maintaining a strong and oriented pedagogical relation to the phenomenon; (f) balancing the research context by considering parts and whole.</p> Recommendations for practitioners of computer-mediated education are explored; suggestions for future research include longitudinal studies of theology students in fully online programs, ways of introducing transcendent presence in online learning communities, how language bears on learning and presence, and the role of non-text based media and virtual environments on presence and the spiritual quest.</body>  </html>",
  "description_provenance": [
    "Author Email: mmount@vt.edu, mmount@cdu.edu",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: fh@umd.edu",
    "Advisor Email: cdklunk@yahoo.com",
    "Advisor Email: prenard@vt.edu",
    "Advisor Email: mgmoore@psu.edu",
    "Made available in DSpace on 2014-03-14T20:08:46Z (GMT). No. of bitstreams: 1 MEMountETD.pdf: 2027483 bytes, checksum: 8d1d4197ad3b3dc239bbe129aca62521 (MD5)   Previous issue date: 2008-03-19"
  ],
  "handle": "26595",
  "identifier_other": "etd-04022008-075155",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04022008-075155/",
  "identifier_uri": "http://hdl.handle.net/10919/26595",
  "publisher": "Virginia Tech",
  "relation_haspart": "MEMountETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "presence",
    "computer-mediated education",
    "online learning community",
    "distance education",
    "adult spirituality",
    "faith formation"
  ],
  "title": "Presence in Distance: the Lived Experience of Adult Faith Formation in an Online Learning Community",
  "type": "Dissertation"
}