{
  "contributor_author": "Kreb, Sigrid Gunild",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Stratton, Richard K.",
    "Lockee, Barbara B.",
    "Potter, Kenneth R.",
    "Jones, Brett D."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:47Z",
  "date_adate": "2008-04-23",
  "date_available": "2014-03-14T20:08:47Z",
  "date_issued": "2008-03-20",
  "date_rdate": "2009-04-23",
  "date_sdate": "2008-04-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Student-athletes must constantly balance their athletic, academic, and social roles. Their dual career can easily be overwhelming. Missing classes because of intense travel can be disruptive to the flow of classes and material. Online education is one way to provide a personalized, portable, on-demand learning environment that is flexible regarding both time and location, doesnâ  t require travel to and from campus, is self-paced, and is provided at the learnerâ  s convenience.   The purpose of this study was to determine general concerns experienced by Virginia Tech student-athletes, as well as their perceptions and practices about online education. Understanding student-athletesâ   needs and wants can help promote high quality online course development. In addition, it allows educators to tailor marketing specifically to student-athletes and increases the likelihood that students will experience positive online learning experiences.   Data was collected using focus group discussions, key informant interviews, and a demographic questionnaire. Student-athletes from all varsity teams were purposively selected for two revenue sports sessions and two non-revenue sports sessions targeting 6-8 athletes in each group. Five key informant interviews were conducted with personnel from the athletic department.    Participants seemed to want the best of both worlds, preferring the convenience of online courses, but also desiring regular contact and interaction with faculty and other class members (social component). The non-revenue athletes preferred taking classes in a traditional classroom to learn material. They preferred taking online classes when they travel, for time issues, or easy credit. Though all student-athletes stated that they took advantage of online classes, the revenue athletes seemed to appreciate them more and were more willing to take more online classes to help ease their schedule. A purely online education program would not result in balance.",
  "description_provenance": [
    "Author Email: gkreb@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: brettjones@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:47Z (GMT). No. of bitstreams: 1 kreb_dissertation.pdf: 909127 bytes, checksum: b0974885b8ffb7b782feab6899168e96 (MD5)   Previous issue date: 2008-03-20"
  ],
  "handle": "26596",
  "identifier_other": "etd-04022008-081909",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04022008-081909/",
  "identifier_uri": "http://hdl.handle.net/10919/26596",
  "publisher": "Virginia Tech",
  "relation_haspart": "kreb_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Student-Athletes",
    "Online Education",
    "Focus Groups"
  ],
  "title": "Gaining Gold Medals and Gowns: Equilibrating the Dual Career of Student-Athletes with Online Education",
  "type": "Dissertation"
}