{
  "contributor_author": "Kamen, Gale Ellen",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Morris, Linda E.",
    "Klunk, Clare D.",
    "Combs, Letitia A.",
    "Cline, Marvin Gerald"
  ],
  "contributor_department": "Adult Learning and Human Resource Development",
  "date_accessioned": "2014-03-14T20:08:45Z",
  "date_adate": "2004-04-15",
  "date_available": "2014-03-14T20:08:45Z",
  "date_issued": "2004-03-02",
  "date_rdate": "2004-04-15",
  "date_sdate": "2004-04-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Gale Kamen</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>Historically, oppression has been and continues to be a serious issue of concern worldwide in both developed and underdeveloped countries. The structure of Indian society, with its hierarchies and power structures, is an ideal place to better understand the experience of oppression. Women throughout the long established Indian hierarchy, and members of the lower castes and classes, have traditionally born the force of oppression generated by the Indian social structure. The focus of this research explored the way the way class, caste, and gender hierarchies coalesce to influence the life choices and experiences of an Indian woman born into the lowest level of the caste and class structure. This research specifically addressed the female <em>Dalit </em> cobbler (leatherworker), who exists among a caste and class of people who have been severely oppressed throughout Indian history. O ne female Dalit cobbler from a rural village was studied. Her life represents three levels of oppression: females (gender), Dalits (caste), and cobblers (class). This study was based on three interconnected research questions that attempted to uncover the way class, caste, and gender hierarchies influence the lives of Dalit female cobblers: what the Dalit female cobbler has experienced in terms of economic, personal, and social struggle; how the Dalit female cobbler manages to get through her day-to-day struggles; and where the Dalit female cobbler sees herself in the future. Participant observation and triangulation were major components in the design of this study, as it was important to view the local daily life of this individual. Detailed field notes were colleted and recorded, interviews based on open-ended questions were conducted, and site documents were gathered. The findings that have become evident throughout this observation have increasingly exposed one continuous theme in particular: the â  lived' experience and position that one must accept his or her station in life without question. This dissertation, however, has shown how acceptance does not mean that one stops trying to thrive. On the contrary, the life of this particular female Dalit cobbler exemplifies the ingenuity and perseverance of people who are not members of the dominant social structure. It demonstrates how one individual had the ability to negotiate multiple levels of oppression and succeed in sustaining herself, her family, and her community. </p> </body> </html>",
  "description_provenance": [
    "Author Email: Gkamen@aol.com",
    "Advisor Email: linda_morris11495@yahoo.com",
    "Advisor Email: cdlkunk@vt.edu",
    "Advisor Email: letitia@letitiacombs.net",
    "Advisor Email: mgcline@aol.com",
    "Advisor Email: marcie@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:45Z (GMT). No. of bitstreams: 1 galeetd.pdf: 420470 bytes, checksum: 5a1434c4bfed4dbd0ab56c8b689040fd (MD5)   Previous issue date: 2004-03-02"
  ],
  "handle": "26590",
  "identifier_other": "etd-04022004-141635",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04022004-141635/",
  "identifier_uri": "http://hdl.handle.net/10919/26590",
  "publisher": "Virginia Tech",
  "relation_haspart": "galeetd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Keywords: Dalit",
    "oppression",
    "hierarchy",
    "caste",
    "untouchable"
  ],
  "title": "The Status, Survival, and Current Dilemma of a Female Dalit Cobbler of India",
  "type": "Dissertation"
}