{
  "contributor_author": "Travieso-Parker, Lourdes Lucia",
  "contributor_committeechair": "Shrum, Judith L.",
  "contributor_committeemember": [
    "Tilley-Lubbs, Gresilda A.",
    "Lockee, Barbara B.",
    "Burge, Penny L.",
    "Bixler, Jacqueline E."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:45Z",
  "date_adate": "2006-04-11",
  "date_available": "2014-03-14T20:08:45Z",
  "date_issued": "2006-03-20",
  "date_rdate": "2006-04-11",
  "date_sdate": "2006-04-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this qualitative case study was to analyze the impact of the policies of the No Child Left Behind Act (2001) on the teaching and learning of 10 Latino English language learners (ELLs) in an urban high school in Virginia. Using ethnographic methodology, the researcher examined the nexus of the policy of the No Child Left Behind Act (NCLB) (2001) with the pedagogy of the English as a Second Language (ESL) and content area teachers, and the practices employed by teachers to enable students to acquire a second language in an academic setting. This enabled the researcher to examine the contextual framework of a large urban school and factors converging to help Latino ELLs learn academic English to succeed in high school. By reviewing the policy, pedagogy, and practices used in this school, I observed the connectedness of an entire school and the relationships fostered by students and faculty to support a learning climate for ELLs. The findings of this study show that the sociocultural environment and the educational experiences play a significant role in the adaptive process of learning a second language for Latino English language learners. Pedagogy that was built on respect for the Latino English language learnersâ   cultural identity, linguistic abilities, and critical thinking skills helped learners become actively engaged, and facilitated learning in the second language that was academically rigorous. The practices of caring teachers enabled them to serve as advocates for ELLs, helped forge relationships of respect and trust, and encouraged Latino ELLs to succeed academically as they navigated the high school environment.",
  "description_provenance": [
    "Author Email: ltravies@vt.edu",
    "Advisor Email: glubbs@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: jshrum@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: jbixler@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:45Z (GMT). No. of bitstreams: 3 bodymatter.pdf: 330510 bytes, checksum: e577b3c4ab19a3feac90e18ea977c4e6 (MD5) backmatter.pdf: 1260734 bytes, checksum: da7d7869d48b114b0ab64c3ea6a73f2a (MD5) frontmatter.pdf: 87805 bytes, checksum: 06d7ec11d7753a9c2c32813c06891d0b (MD5)   Previous issue date: 2006-03-20"
  ],
  "handle": "26593",
  "identifier_other": "etd-04022006-235059",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04022006-235059/",
  "identifier_uri": "http://hdl.handle.net/10919/26593",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "bodymatter.pdf",
    "backmatter.pdf",
    "frontmatter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Latino English Language Learners",
    "Caring Teacher",
    "School Climate",
    "Ethnic Identity",
    "No Child Left Behind Act",
    "Second Language Acquisition"
  ],
  "title": "Policies, Pedagogy, and Practices:  Educational Experiences of Latino English Language Learners in Virginia",
  "type": "Dissertation"
}