{
  "contributor_author": "Murphy, Pamela Ford",
  "contributor_committeechair": "Chang, Mido",
  "contributor_committeemember": [
    "Wolfe, Edward W.",
    "Singh, Kusum",
    "Miyazaki, Yasuo"
  ],
  "contributor_department": "Educational Research and Evaluation",
  "date_accessioned": "2014-03-14T20:08:47Z",
  "date_adate": "2009-04-22",
  "date_available": "2014-03-14T20:08:47Z",
  "date_issued": "2009-03-25",
  "date_rdate": "2009-04-22",
  "date_sdate": "2009-04-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An independent learner is one who actively takes responsibility for his or her own acquisition of knowledge, skills, and expertise. The capacity to self-regulate oneâ  s own learning is a necessity for success in higher education. Researchers have found that characteristics of independent learners begin to emerge in young children and continue to develop throughout childhood and adolescence as students grow into self-governing adults.      The purpose of this study is to assess studentsâ   levels of independent learning attitudes and behaviors and to examine the relationships among parentsâ   actions, family structure, independent learning, and academic achievement. Using a national sample of 10th grade students from the Education Longitudinal Study of 2002, several statistical analyses were performed in order to answer these research questions:   1. How do parentsâ   actions relate to childrenâ  s independent learning characteristics?   2. How do studentsâ   independent learning behaviors and attitudes correlate with their academic achievement?   3. How are parentsâ   actions associated with their childrenâ  s academic achievement?   4. Are single-parent children less likely to have developed characteristics of independent learning by grade 10 than children living with both of their parents?      Exploratory factor analysis was conducted to arrange the available variables into appropriate subscales to be used in the statistical procedures for this study. Canonical correlations were used to measure the magnitude of relationships between three pairs of concepts: parentsâ   actions and studentsâ   independent learning; studentsâ   independent learning and academic achievement; and parentsâ   actions and studentsâ   academic achievement.      Structural equation modeling was employed to test the hypothesized model of relationships among parentsâ   actions, studentsâ   independent learning behaviors, and academic achievement. Finally, multivariate analysis of variance was used to compare the independent learning scores of students living in four different family structures to determine if a significant difference in the development of independent learning between groups exists. Results suggest actions that parents can take to help their children develop as independent learners and succeed in the academic realm.",
  "description_provenance": [
    "Author Email: pfmurphy@vt.edu",
    "Advisor Email: ed.wolfe@pearson.com",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: yasuom@vt.edu",
    "Advisor Email: mchang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:47Z (GMT). No. of bitstreams: 1 Pamela_Ford_Murphy_Dissertation_Linked.pdf: 446827 bytes, checksum: e58543eabb20a7a43d229bda35ff5e14 (MD5)   Previous issue date: 2009-03-25"
  ],
  "handle": "26599",
  "identifier_other": "etd-04022009-174950",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04022009-174950/",
  "identifier_uri": "http://hdl.handle.net/10919/26599",
  "publisher": "Virginia Tech",
  "relation_haspart": "Pamela_Ford_Murphy_Dissertation_Linked.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "achievement",
    "family structure",
    "parenting style",
    "independent learning",
    "self-regulated learning"
  ],
  "title": "Relationships of Parenting Practices, Independent Learning, Achievement, and Family Structure",
  "type": "Dissertation"
}