{
  "contributor_author": "Lusk, Danielle Leigh",
  "contributor_committeechair": "Doolittle, Peter E.",
  "contributor_committeemember": [
    "Evans, Michael A.",
    "Sherman, Thomas M.",
    "Jones, Brett D."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:49Z",
  "date_adate": "2008-04-24",
  "date_available": "2014-03-14T20:08:49Z",
  "date_issued": "2008-03-19",
  "date_rdate": "2008-04-24",
  "date_sdate": "2008-04-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Multimedia learning theory, and the research that has supported it, is largely focused on the cognitive elements of learning. Although motivation has been mentioned as a factor in learning in a multimedia environment, motivation has not been measured as a distinctive variable in most studies. Specific attributes of multimedia, including seductive details and segmentation, have been hypothesized to increase interest; however, only studies examining these attributesâ   effects on learning (measured by recall and transfer) have been conducted. The present study aimed to extend the examination of the use of seductive details and segmentation in multimedia learning by measuring interest in addition to recall and transfer.   The participants were 167 undergraduate students who were randomly assigned to four treatment groups involving a tutorial on the formation of lightning, which differed according to the multimedia attributes featured in the tutorial. Treatment groups included seductive details and segmentation (SD+S), seductive details and no segmentation (SD+NS), no seductive details and segmentation (NSD+S), and no seductive details and no segmentation (NSD+NS). Participants took an interest questionnaire before engaging with the tutorial and immediately following the tutorial. Tests of recall and transfer were used to measure learning after the tutorial. Two trained raters evaluated responses.   Data from the study were analyzed using Analysis of Variance (ANOVA) and correlation procedures. The results of the study revealed no significant differences among treatment groups in regards to interest, recall, or transfer. There was no significant relationship between interest and recall or interest and transfer. Although the results did not provide support for existing literature on seductive details and segmentation effects or reveal that these attributes increase interest, the implications of the findings present several valuable areas for future research.",
  "description_provenance": [
    "Author Email: daanders@vt.edu",
    "Advisor Email: mae@vt.edu",
    "Advisor Email: tsherman@vt.edu",
    "Advisor Email: brettjones@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:49Z (GMT). No. of bitstreams: 1 etd.pdf: 566558 bytes, checksum: 5f725b82a159c4f7ac5b1545c004cd4f (MD5)   Previous issue date: 2008-03-19"
  ],
  "handle": "26609",
  "identifier_other": "etd-04032008-092756",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04032008-092756/",
  "identifier_uri": "http://hdl.handle.net/10919/26609",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "learner control",
    "segmentation",
    "seductive details",
    "multimedia",
    "interest",
    "coherence effect"
  ],
  "title": "The Effects of Seductive Details and Segmentation on Interest, Recall and Transfer in a Multimedia Learning Environment",
  "type": "Dissertation"
}