{
  "contributor_author": "Catina, Kathryn L.",
  "contributor_committeechair": "Creighton, Theodore B.",
  "contributor_committeemember": [
    "Cash, Carol S.",
    "Tripp, Norman Wayne",
    "Twiford, Travis W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:47Z",
  "date_adate": "2010-05-03",
  "date_available": "2014-03-14T20:08:47Z",
  "date_issued": "2010-03-26",
  "date_rdate": "2010-05-03",
  "date_sdate": "2010-04-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Catina Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>The purpose of this study was to record and analyze experiences of teachers implementing a sheltered collaborative teaching model for second language learners. This study also analyzed the effect of this model on the on-time graduation rate of limited English proficient students. Discussing the experiences of teachers involved in this model provided valuable information that can be used to refine instruction and improve ELLs cultural assimilation, self-motivation, and involvement in co-curricular activities. </p> <p>The mixed methods design study taking both a phenomenological and quasi-experimental case study approach focused on collecting experiences from teachers and graduation data to determine the outcomes of the collaborative instructional model. The context of this study was two high schools in a suburban school district in central Virginia. The participants were seven teachers who have implemented the collaborative model within the last two years. Triangulation of the data sources included interviews with the participants, field notes, and archival data. Both NVivo and Statistical Package for Social Sciences were used in coding and describing the data. </p> <p>Results of this study are presented in narrative descriptions of the experiences of the participants and a descriptive report of the graduation data. Themes resulting from the analysis across all the narratives are discussed within the framework of ELL academic success. Both graduation data and teacher reports are discussed to determine the effect of this instructional model on the on-time graduation rate. </p> </body> </html>",
  "description_provenance": [
    "Author Email: Kathryn_Catina@ccpsnet.net",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:47Z (GMT). No. of bitstreams: 1 Catina_ETD.pdf: 353867 bytes, checksum: cfd7142074685fd78da426b83ebea9cc (MD5)   Previous issue date: 2010-03-26"
  ],
  "handle": "26600",
  "identifier_other": "etd-04022010-125411",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04022010-125411/",
  "identifier_uri": "http://hdl.handle.net/10919/26600",
  "publisher": "Virginia Tech",
  "relation_haspart": "Catina_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ESOL",
    "ELL",
    "SIOP"
  ],
  "title": "Outcomes of a Sheltered Collaborative Teaching Model for English Language Learners",
  "type": "Dissertation"
}