{
  "contributor_author": "Asmatulu, Ramazan",
  "contributor_committeechair": "Yoon, Roe-Hoan",
  "contributor_committeemember": [
    "Wightman, James P.",
    "Reynolds, William T. Jr.",
    "Luttrell, Gerald H.",
    "Adel, Gregory T."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:08:48Z",
  "date_adate": "2001-04-05",
  "date_available": "2014-03-14T20:08:48Z",
  "date_issued": "2001-03-12",
  "date_rdate": "2002-04-21",
  "date_sdate": "2001-04-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In the present work, novel dewatering aids and a novel centrifuge configuration were developed and applied for the purpose of dewatering fine particles. Three different types dewatering reagents were tested in different filtration and centrifugation units. These chemicals included low-HLB surfactants, naturally occurring lipids, and modified lipids.  Most of these reagents are insoluble in water; therefore, they were used in solutions of appropriate solvents, such as light hydrocarbon oils and short-chain alcohols.  The role of these reagents was to increase the hydrophobicity of the coal and selected mineral particles (chalcopyrite, sphalerite, galena, talc, clay, phosphate, PCC and silica) for the dewatering.  In the presence of these reagents, the water contact angles on the coal samples were increased up to 90o.  According to the Laplace equation, an increase in contact angle with the surfactant addition should decrease the capillary pressure in a filter cake, which should in turn increase the rate of dewatering and help reduce the cake moisture.  The use of the novel dewatering aids causes a decrease in the surface tension of water and an increase in the porosity of the cake, both of which also contribute to improved dewatering. A series of batch-scale dewatering tests were conducted on a variety of the coal and mineral samples using the novel dewatering aids.  The results obtained with a Buchner funnel and air pressure filters showed that cake moistures could be reduced substantially, the extent of which depends on the particle size, cake thickness, drying time, reagent dosage, conditioning time, reagent type, sample aging, water chemistry, etc.  It was determined that use of the novel dewatering aids could reduce the cake formation time by a significant degree due to the increased kinetics of dewatering.  At the same time, the use of the dewatering aids reduced the cake moistures by allowing the water trapped in smaller capillaries of the filter cake.  It was found that final cake moistures could be reduced by 50% of what can be normally achieved without using the reagents.  However, the moisture reduction becomes difficult with increasing cake thickness.  This problem can be minimized by applying a mechanical vibration to the cake, spraying a short-chain alcohol on the cake and by adding a small amount of an appropriate coagulant, such as alum and CaCl2 to the coal and mineral slurries. The novel dewatering aids were also tested using several different continuous filters, including a drum filter, disc filter and horizontal belt filter (HBF).  The results obtained with these continuous filtration devices were consistent with those obtained from the batch filters.  Depending on the coal and mineral samples and the type of the reagent, 40 to 60% reductions in moisture were readily achieved. When using vacuum disc filters, the cake thickness increased substantially in the presence of the novel dewatering aids, which could be attributed to the increased kinetics of dewatering.  A dual vacuum system was developed in the present work in order to be able to control the cake thickness, which was necessary to achieve lower cake moistures.  It was based on using a lower vacuum pressure during the cake formation time, while a full vacuum pressure was used during the drying cycle time.  Thus, use of the dual vacuum system allowed the disc filter to be used in conjunction with the novel dewatering aids.  Its performance was similar to that of HBF, which is designed to control cake thickness and cake formation time independently. The effectiveness of using the novel dewatering aids were also tested in a full-continuous pilot plant, in which coal samples were cleaned by a flotation column before the flotation product was subjected to the disc filter.  The tests were conducted with and without using novel dewatering aids.  These results were consistent with those obtained from the laboratory and batch-scale tests.  The novel centrifuge developed in the present work was a unit, which combined a gravity force and air pressure. The new centrifuge was based on increasing the pressure drop across the filter cake formed on the surface of the medium (centrifuge wall). This provision made it possible to take advantage of Darcy s law and improve the removal of capillary water, which should help lower the cake moisture. A series of tests were conducted on several fine coal and mineral particles and obtained more than 50% moisture reduction even at very fine particle size (2 mm x 0). Based on the test results obtained in the present work, two proof-of-concept (POC) plants have been designed.  The first was for the recovery of cyclone overflows that are currently being discarded in Virginia, and the other was for the recovery of fines from a pond in southern West Virginia.  The former was designed based on the results of the plant tests conducted in the present work.  Cost vs. benefit analyses were conducted on the two POC plants.  The results showed very favorable internal rates of return when using the novel dewatering aids. Surface chemistry studies were conducted on the coal samples based on the results obtained in the present investigation.  These consisted mainly of the surface characterization of the coal samples (surface mineral composition, surface area, zeta potential, x-ray photoelectron microscopy (XPS)), acid-base interactions of the solids and liquids, dewatering kinetic tests, contact angle measurements of the coal samples and surface force measurements using AFM. In addition, carbon coating on a silica plate using palsed laser deposition (PLD) and Langmuir-Blodgett (LB) film deposition tests were conducted on the sample to better understand the surfactant adsorption and dewatering processes. The test results showed that the moisture reductions on the fine particles agree well with the surface chemistry results.",
  "description_provenance": [
    "Author Email: raasmatu@vt.edu",
    "Advisor Email: wightman@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: luttrell@vt.edu",
    "Advisor Email: adel@vt.edu",
    "Advisor Email: ryoon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:48Z (GMT). No. of bitstreams: 9 01Main.pdf: 207365 bytes, checksum: 4d4b820d7458feab74e7d47b877f91ac (MD5) 03Chapter2.pdf: 251898 bytes, checksum: 70e65b8365b9a97eb03a6670f9896b87 (MD5) 04Chapter3.pdf: 187157 bytes, checksum: 8c3069d698290d48a67d40633b6b12cf (MD5) 02Chapter1.pdf: 408987 bytes, checksum: 7b1ce667e493859ab44cd8fd43ee8ea7 (MD5) 09Vita.pdf: 45876 bytes, checksum: 434c2342e800be2b5318aea4ba088400 (MD5) 08Appendices.pdf: 1096642 bytes, checksum: caf67dd4013c6c09490f7254d47e70ef (MD5) 06Chapter5.pdf: 574667 bytes, checksum: 5cd97d63143fa39b5c3ec0ffa3745366 (MD5) 07Chapter6&7.pdf: 83874 bytes, checksum: 49b29abb7ba18726a3445fb299a187e4 (MD5) 05Chapter4.pdf: 1443244 bytes, checksum: a739d2990bca4adffcb26002b6932d40 (MD5)   Previous issue date: 2001-03-12"
  ],
  "handle": "26604",
  "identifier_other": "etd-04032001-224955",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04032001-224955/",
  "identifier_uri": "http://hdl.handle.net/10919/26604",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01Main.pdf",
    "03Chapter2.pdf",
    "04Chapter3.pdf",
    "02Chapter1.pdf",
    "09Vita.pdf",
    "08Appendices.pdf",
    "06Chapter5.pdf",
    "07Chapter6&7.pdf",
    "05Chapter4.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Wettability",
    "Flotation",
    "Oxidation",
    "Talc",
    "PCC",
    "XPS",
    "Silica",
    "Phosphate",
    "Acid-Base Interaction",
    "Fine Particles",
    "Coal",
    "HBF",
    "Sphalerite",
    "Surface Analysis",
    "Hydrophilicity",
    "Centrifugation",
    "Hydrophobic Force",
    "Moisture",
    "Surface Tension",
    "Filtration",
    "Galena",
    "Contact Angle",
    "Polymer",
    "Clay",
    "Buchner Filter",
    "Coating",
    "Surfactant",
    "Disc",
    "Drum",
    "Dewatering Kinetics and Modeling.",
    "Hydrophobicity",
    "Dewatering",
    "Chalcopyrite",
    "AFM",
    "Electrolyte",
    "Coagulation",
    "BET",
    "PZC"
  ],
  "title": "Advanced Chemical-Mechanical Dewatering of Fine Particles",
  "type": "Dissertation"
}