{
  "contributor_author": "Johnston, Alexis Larissa",
  "contributor_committeechair": "Wilkins, Jesse L. M.",
  "contributor_committeemember": [
    "Norton, Anderson H. III",
    "Kreye, Bettibel C.",
    "Doolittle, Peter E."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:47Z",
  "date_adate": "2012-04-26",
  "date_available": "2014-03-14T20:08:47Z",
  "date_issued": "2012-03-23",
  "date_rdate": "2012-04-26",
  "date_sdate": "2012-04-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Over the past twenty years, journal writing has become more common in mathematics classes at all age levels.  However, there has been very little empirical research about journal writing in college mathematics (Speer, Smith, & Horvath, 2010), particularly concerning the relationship between journal writing in college mathematics and college studentsâ   motivation towards learning mathematics.  The purpose of this dissertation study is to fill that gap by implementing homework journals, which are a journal writing assignment based on Powell and Ramnauthâ  s (1992) â  multiple-entry log,â   in a college mathematics course and studying the relationship between homework journals and studentsâ   motivation towards learning mathematics as grounded in self-determination theory (Ryan & Deci, 2000).  Self-determination theory predicts intrinsic motivation by focusing on the fundamental needs of competence, autonomy, and relatedness (Ryan & Deci, 2000).  In addition, the purpose of this dissertation study is to explore and describe the relationship between homework journals and studentsâ   attitudes towards writing in mathematics.  A pre-course and post-course survey was distributed to students enrolled in two sections of a college mathematics course and then analyzed using a 2Ã 2 repeated measures ANOVA with time (pre-course and post-course) and treatment (one section engaged with homework journals while the other did not) as the two factors, in order to test whether the change over time was different between the two sections.  In addition, student and instructor interviews were conducted and then analyzed using a constant comparative method (Anfara, Brown, & Mangione, 2002) in order to add richness to the description of the relationship between homework journals and studentsâ   motivation towards learning mathematics as well as studentsâ   attitudes towards writing in mathematics.  Based on the quantitative analysis of survey data, no differences in rate of change of competence, autonomy, relatedness, or attitudes towards writing were found.  However, based on the qualitative analysis of interview data, homework journals were found to influence studentsâ   sense of competence, autonomy, and relatedness under certain conditions.  In addition, studentsâ   attitudes towards writing in mathematics were strongly influenced by their likes and dislikes of homework journals and the perceived benefits of homework journals.",
  "description_provenance": [
    "Author Email: alexis05@vt.edu",
    "Advisor Email: norton3@vt.edu",
    "Advisor Email: bkreye@vt.edu",
    "Advisor Email: wilkins@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:47Z (GMT). No. of bitstreams: 1 Johnston_AL_D_2012.pdf: 4072267 bytes, checksum: 8808019ceff463094f14f963d104f47b (MD5)   Previous issue date: 2012-03-23"
  ],
  "handle": "26602",
  "identifier_other": "etd-04022012-142632",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04022012-142632/",
  "identifier_uri": "http://hdl.handle.net/10919/26602",
  "publisher": "Virginia Tech",
  "relation_haspart": "Johnston_AL_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Undergraduate Mathematics",
    "Motivation",
    "Self-Determination Theory",
    "Writing in Mathematics"
  ],
  "title": "Homework Journaling in Undergraduate Mathematics",
  "type": "Dissertation"
}