{
  "contributor_author": "Jenkins, Anthony L.",
  "contributor_committeecochair": [
    "Janosik, Steven M.",
    "Miyazaki, Yasuo"
  ],
  "contributor_committeemember": [
    "Hirt, Joan B.",
    "Cross, Landrum L."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:49Z",
  "date_adate": "2007-05-16",
  "date_available": "2014-03-14T20:08:49Z",
  "date_issued": "2007-03-26",
  "date_rdate": "2007-05-16",
  "date_sdate": "2007-04-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of the study was to compare a freshman cohort of first and non first-generation college students enrolled in an urban university and to identify characteristics that distinguish the two groups in terms of selected demographics, pre-college behaviors and beliefs (expectations and personal traits). Moreover, the study sought to identify variables whose distribution indicated a significant difference between the two groups and rank those variables by order of the strength of association.  Data analysis for this study consisted of a combination of chi-square and descriptive discriminate analysis using logistic regression. Chi-square analysis was the preliminary statistical procedure used in this study. I relied on a sequence of chi-square analyses to help identify a list of statistically significant variables to be used in the subsequent descriptive discriminate logistic regression model. Descriptive discriminate analysis was used because its primary function is designed to reveal projected differences among groups (Huberty, 1994).  The results revealed seven important characteristics (Reading for pleasure (Hpw0111), Household income (Income), Asked teacher for advise (Act0114), Rate computer skills (Rate0103), Get a bachelorâ  s degree (Futact11), Change major field of study (Futact01) and Obtain recognition by colleague (Goal0103) were commonly statistically significant student characteristics across all race/ethnicity groups, and three (Gain a general education (Reason05), High school grade point average (HSGPA) and Felt overwhelmed (Act0110) were unique to one or some of the groups. These variables can also be viewed as predictors that help identify the likelihood that a student is first-generation. Results of this study had implications for the practice of high school guidance counselors, student and academic affairs practitioners and specifically support services personnel and financial aid officers.",
  "description_provenance": [
    "Author Email: jenkinsa@uhcl.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: llcross@exchange.vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: yasuom@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:49Z (GMT). No. of bitstreams: 1 ALJDisserationFG.pdf: 237585 bytes, checksum: 2a9bd44d7c9a13507e2d2941eab8c520 (MD5)   Previous issue date: 2007-03-26"
  ],
  "handle": "26607",
  "identifier_other": "etd-04032007-235708",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04032007-235708/",
  "identifier_uri": "http://hdl.handle.net/10919/26607",
  "publisher": "Virginia Tech",
  "relation_haspart": "ALJDisserationFG.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Race",
    "Ethnicity",
    "First-Generation College Students",
    "Students of Color"
  ],
  "title": "Assessing Factors that Distinguish First-Generation College Students from Non First-Generation College Students at an Urban Comprehensive University",
  "type": "Dissertation"
}