{
  "contributor_author": "Dula, Chris S.",
  "contributor_committeechair": "Geller, E. Scott",
  "contributor_committeemember": [
    "Axsom, Daniel K.",
    "Eisler, Richard M.",
    "Winett, Richard A.",
    "Jones, Russell T."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:08:48Z",
  "date_adate": "2003-04-10",
  "date_available": "2014-03-14T20:08:48Z",
  "date_issued": "2003-03-26",
  "date_rdate": "2004-04-10",
  "date_sdate": "2003-04-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Validity and Reliability Assessment of a Dangerous Driving Self-Report Measure Chris S. Dula (ABSTRACT) The Dula Dangerous Driving Index (DDDI) was created to measure driversâ   self-reported propensity to drive dangerously (Dula & Ballard, in press). In the early stages of development, the DDDI and each of its subscales (Dangerous Driving Total, Aggressive Driving, Negative Emotional Driving, and Risky Driving) were found to have strong internal reliability (alphas from .83 to .92), and there was evidence of construct validity.  In Study One, the alpha coefficient of .91 for the DDDI Total scale indicated excellent internal reliability for the measure and good internal reliability was demonstrated for its subscales with coefficient alphas equal to .81 for the DDDI Risky Driving subscale, .79 for the DDDI Negative Emotional subscale, and the DDDI Aggressive Driving subscale. Additionally, convergent and divergent validity was shown for the DDDI, but evidence was weaker for the validity of the separate subscales. Factor analysis demonstrated that the DDDI seemed to measure a unitary construct.  In Study Two, coefficients of stability were generated from a four-week test-retest procedure, which were .76 for the DDDI Risky Driving subscale, .68 for the DDDI Negative Emotional subscale, .55 for the DDDI Aggressive Driving subscale, and .73 for the DDDI Total. In Study Three, the percentage of variance accounted for in criterion variables by different models ranged from 13.6% to 47.7%, where the DDDI Negative Emotional and DDDI Total scales frequently accounted for large portions of variance. In Study Four, the percent of variance accounted for in criterion variables by different models ranged from 22.0% to 65.6%, where some of the DDDI scales were regularly found to account for significant variance. Thus, it was concluded that the DDDI is a measure with high levels of internal reliability and reasonable stability across time, and that face, construct, and predictive validity was demonstrated. However, the evidence in support of the present division of subscales was weak, though present. Therefore, should further data fail to produce more substantial evidence for the validity of the DDDI subscales, a singular dangerous driving measure would be warranted, and the number of items should be shortened as guided by results from factorial analysis.",
  "description_provenance": [
    "Author Email: cdula@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Advisor Email: esgeller@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Advisor Email: rtjones@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:48Z (GMT). No. of bitstreams: 1 Dissertation2.pdf: 2477142 bytes, checksum: 9e96aa51995a5f2b103acb7e227012a2 (MD5)   Previous issue date: 2003-03-26"
  ],
  "handle": "26606",
  "identifier_other": "etd-04032003-171656",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04032003-171656/",
  "identifier_uri": "http://hdl.handle.net/10919/26606",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Road Rage",
    "Risky Driving",
    "Aggressive Driving",
    "Dangerous Driving",
    "Negative Emotional Driving"
  ],
  "title": "Validity and Reliability Assessment of a Dangerous Driving Self-Report Measure",
  "type": "Dissertation"
}