{
  "contributor_author": "Gantzer, Paul Anthony",
  "contributor_committeechair": "Little, John C.",
  "contributor_committeemember": [
    "Mobley, Mark",
    "Benninger, Robert W.",
    "Grizzard, Thomas J.",
    "Edwards, Marc A.",
    "Gallagher, Daniel L."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:08:49Z",
  "date_adate": "2008-04-23",
  "date_available": "2014-03-14T20:08:49Z",
  "date_issued": "2008-03-26",
  "date_rdate": "2008-04-23",
  "date_sdate": "2008-04-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Hypolimnetic oxygenation systems, such as linear bubble-plume diffusers, are used to improve raw water quality.  Linear bubble-plume diffusers were installed in Spring Hollow Reservoir (SHR) and Carvins Cove Reservoir (CCR).  Diffusers induce mixing that aids distribution of oxygen throughout the hypolimnion.  The induced mixing also creates an undesirable effect by increasing hypolimnetic oxygen demand (HOD).  Nevertheless, oxygenation systems are commonly used and long-term oxygenation is hypothesized to actually decrease HOD.  Increased oxygen concentrations in combination with the induced mixing affect the location of the oxic/anoxic boundary relative to the sediment water interface.  If the oxic/anoxic boundary is pushed beneath the sediment/water interface, the concentrations of soluble iron and manganese in the bulk water are reduced.  This work was performed to further validate a recently published bubble-plume model that predicts oxygen addition rates and the elevation in the reservoir where the majority of the oxygen is added.  Also, the first field observations of a theoretically expected secondary plume are presented.  Model predicted addition rates were compared to observed accumulation rates to evaluate HOD over a wide range of applied gas flow rates.  Observations in both reservoirs showed evidence of horizontal spreading that correlated well with plume-model predictions and of vertical spreading below diffuser elevations, showing oxygen penetration into the sediment.  Experimental observations of a theoretically expected secondary plume structure also correlated well with model predictions.  Plume-induced mixing was shown to be a function of applied gas flow rates, and was observed to increase HOD.  HOD was also observed to be independent of bulk hypolimnion oxygen concentration, indicating that the increase in oxygen concentration is not the cause of the increased HOD.  Long-term oxygenation resulted in an overall decrease in background HOD as well as a decrease in induced HOD during diffuser operation.  Elevated oxygen concentrations and mixing, which occur naturally during destratification and artificially during oxygenation, were observed to coincide with low dissolved metal concentrations in CCR.  Movement of the oxic/anoxic boundary out of the sediment, which is also common during stratified periods, appears to facilitate transport of reduced Mn to the overlying waters.  Hypolimnetic oxygenation increased oxygen concentrations throughout the hypolimnion, including down to the SWI, and induced mixing, although not to the extent observed during destratification.  Subsequently, elevated Mn concentrations were observed to be restricted to the benthic waters located immediately over the sediments, while bulk (hypolimnion) water Mn concentrations remained low.  The good agreement between the model and the experimental data show that the model can be used as a predictive tool when designing and operating bubble-plume diffusers.  Linear bubble-plume diffusers provide sufficient horizontal and vertical spreading to enable oxygen to reach the sediments.  Hypolimnetic oxygenation, despite the increased HOD, is a viable method to manage the negative consequences of hypolimnetic anoxia in water-supply reservoirs.",
  "description_provenance": [
    "Author Email: Paul.Gantzer@gmail.com",
    "Advisor Email: mark@mobleyengineering.com",
    "Advisor Email: Robert.Benninger@WesternVaWater.org",
    "Advisor Email: tgrizzar@vt.edu",
    "Advisor Email: edwardsm@vt.edu",
    "Advisor Email: dang@vt.edu",
    "Advisor Email: jcl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:49Z (GMT). No. of bitstreams: 1 Gantzer_PhD_Dissertation_rev_final.pdf: 2543102 bytes, checksum: ca1d17205e0e7b176dcc4f9378fd0aee (MD5)   Previous issue date: 2008-03-26"
  ],
  "handle": "26610",
  "identifier_other": "etd-04032008-135241",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04032008-135241/",
  "identifier_uri": "http://hdl.handle.net/10919/26610",
  "publisher": "Virginia Tech",
  "relation_haspart": "Gantzer_PhD_Dissertation_rev_final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hypolimnion",
    "manganese",
    "oxygenation",
    "spreading",
    "bubble-plume",
    "diffuser"
  ],
  "title": "Controlling Dissolved Oxygen, Iron and Manganese in Water-Supply Reservoirs using Hypolimnetic Oxygenation",
  "type": "Dissertation"
}