{
  "contributor_author": "Homyack, Jesica Anne",
  "contributor_committeechair": "Haas, Carola A.",
  "contributor_committeemember": [
    "Stauffer, Dean F.",
    "Hopkins, William A.",
    "Jones, Robert H.",
    "Fox, Thomas R."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:08:49Z",
  "date_adate": "2009-04-30",
  "date_available": "2014-03-14T20:08:49Z",
  "date_issued": "2009-03-20",
  "date_rdate": "2009-04-30",
  "date_sdate": "2009-04-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In forested ecosystems, salamanders occupy important ecological roles as predator, prey and as potential regulators of ecological processes.  The effects of forest management, particularly clearcut harvesting, on salamanders have been well documented; removal of overstory trees negatively affects abundances of salamanders.  However, the length of time that salamander populations remain depressed following forest harvesting and factors limiting population recovery have been a source of controversy in the literature and are the goal of this dissertation.  As part of the Southern Appalachian Silviculture and Biodiversity (SASAB) project (Chapter 1), a long-term replicated field experiment designed to evaluate a range of silvicultural treatments on biodiversity, I evaluated specific hypotheses related to salamander populations, their prey, and their habitat.    First, I examined long-term trends in salamander abundances across a range of silvicultural treatments to determine whether negative effects of forest harvesting persisted for 13-years after harvest (Chapter 2) and to document the effects of multiple harvests on salamanders (Chapter 3).  The relative abundances of terrestrial salamanders were quantified in six silvicultural treatments and an unharvested control and on six replicated field sites with night-time, area-constrained searches.  Across 13-years of post-harvest data, terrestrial salamander abundances generally were lower in silvicultural treatments with some disturbance to the canopy (group selection harvest through silvicultural clearcut).  Further, a comparison of demography of common species of salamanders suggested that differences in habitat quality existed between harvested and unharvested experimental units (EUs).  A second harvest in the shelterwood plots to remove overwood had a cumulative negative effect on salamanders at one of two sites studied.  Additionally, I conducted a sensitivity and elasticity analysis for eastern red-backed salamanders (Plethodon cinereus) and modeled population growth to evaluate the contribution of demographic parameters to population recovery. These analyses indicated that adult survival was the parameter with the greatest influence on the population growth rate and that >60 years would be required for recovery of salamander populations to preharvest levels even if habitat conditions were restored to preharvest conditions immediately.    Next, I quantified the bioenergetics of salamanders across a disturbance gradient to evaluate whether changes to (1) invertebrate prey, (2) energy expenditure for basic maintenance costs, and or (3) an index to body condition could help explain observed changes to abundances or demography of salamanders from forest harvesting (Chapter 4).  Although I did not detect a difference in abundances of invertebrates along the disturbance gradient, I determined that salamanders in recently disturbed forest stands expended approximately 33% more energy for basic maintenance costs in an active season and the body condition of salamanders was greater at one of two sites in disturbed EUs.  Thus, the bioenergetics of terrestrial salamanders may have been affected by increasing temperatures from silvicultural disturbance and may cause salamanders to allocate less energy to reproduction or growth because of increased maintenance costs.      In collaboration with Eric Sucre, Department of Forestry at Virginia Tech, I examined the effects of salamanders on invertebrates and ecosystem processes, specifically leaf litter decomposition.  We constructed 12 in situ field mesocosms and I manipulated densities of red-backed salamanders into zero, low, and high density treatments.  From June 2006-June 2008, I estimated invertebrate abundances, rates of leaf litter decomposition and food habits of salamanders across treatments.  I found that invertebrate abundances were more affected by season than by the density of salamanders and that rates of leaf litter decomposition did not differ among salamander treatments.  Salamanders were euryphagic and consumed more (by abundance and volume) herbivorous invertebrates than predators or detritivores.         Finally, I modeled habitat relationships of terrestrial salamanders at two spatial scales on the SASAB study sites (Chapter 6).  I quantified abundance of salamanders with area-constrained searches during warm rainy nights and measured forest characteristics related to foraging or refugia habitats or that described the overstory and understory of forest stands.  At the scale of the 30 m2 transect and the 10 m2 sub-transect, abundance of salamanders was best described by models that incorporated descriptors of canopy cover and woody and herbaceous understory vegetation.  Thus, terrestrial salamanders may have responded positively to forest stands with a mature overstory and structurally diverse understory for foraging habitat.    Collectively, these data suggest that recovery of salamander populations after forest harvesting will take approximately 60 years, and that life history characteristics (low fecundity, late sexual maturity) and possibly changes to bioenergetics may contribute to the slow recovery.  Further, silvicultural practices that retain some canopy trees through a rotation may have a more rapid return of salamander populations to preharvest levels and may encourage development of understory structure for salamander foraging.  Although these data fill some gaps in knowledge of relationships between silviculture and terrestrial salamanders, many questions about long-term effects of disturbances on populations and habitats remain.  My modeling of recovery of salamander populations depended on estimates of a survival from a congener, and I did not document whether forest harvesting decreases survival of terrestrial salamanders.  Lastly, the influence of stochastic events on population dynamics particularly in disturbed stands was not examined in this dissertation.  Therefore, future research on the SASAB study sites should continue to track abundances and demography across the disturbance gradient, acquire age-specific estimates of survival, determine whether salamanders exhibit density dependence, develop estimates of entire energy budgets, and use manipulative laboratory experiments to describe the role of plethodontid salamanders in ecosystem functions.",
  "description_provenance": [
    "Author Email: jhomyack@vt.edu",
    "Advisor Email: dstauffe@vt.edu",
    "Advisor Email: hopkinsw@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: trfox@vt.edu",
    "Advisor Email: cahaas@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:49Z (GMT). No. of bitstreams: 2 RightslinkPrintableLicense.Ch2.Homyack.copyright.pdf: 39700 bytes, checksum: f87c9f437942c5ea4918af57b5ce98f9 (MD5) Homyack.ETD3.pdf: 775584 bytes, checksum: d9e224087c1716558064e2860683f559 (MD5)   Previous issue date: 2009-03-20"
  ],
  "handle": "26614",
  "identifier_other": "etd-04032009-083005",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04032009-083005/",
  "identifier_uri": "http://hdl.handle.net/10919/26614",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "RightslinkPrintableLicense.Ch2.Homyack.copyright.pdf",
    "Homyack.ETD3.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "forest management",
    "invertebrates",
    "litter decomposition",
    "silviculture",
    "bioenergetics",
    "Appalachia",
    "salamander",
    "plethodontid"
  ],
  "title": "Effects of Forest Regeneration Methods on Salamander Populations in Central Appalachia",
  "type": "Dissertation"
}