{
  "contributor_author": "Hedrick, James E.",
  "contributor_committeecochair": [
    "Alexander, David",
    "Sughrue, Jennifer A."
  ],
  "contributor_committeemember": [
    "Pociask, Joseph",
    "Wiita, Teresa C.",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:51Z",
  "date_adate": "2002-04-08",
  "date_available": "2014-03-14T20:08:51Z",
  "date_issued": "2002-03-11",
  "date_rdate": "2003-04-08",
  "date_sdate": "2002-04-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This paper provides a historical analysis of the desegregation of George Washington High School and Langston High School in Danville, Virginia in 1970. The author focuses on the related desegregation litigation on a national, state, and local level as well as the historical context for desegregation in the Commonwealth of Virginia.  In August of 1970, Danville, Virginia embarked on a new era in education as its schools would be totally desegregated. It would no longer operate under the freedom of choice plan that had been in effect since 1965 and permitted African-American parents to send their children to the all-white schools. The school system was to be fully integrated and operating as a unitary system.  Using newspaper accounts, correspondence from key figures, and interviews with key people in Danville in 1970, the author addresses four areas of research: (a) What led to the desegregation of schools in Danville, Virginia? (b) Who were the key players in the desegregation movement? (c) How were the community, the students, and the staff prepared for desegregation? and (d) What were the attitudes and the concerns about desegregation? The data was collected and analyzed using qualitative methodology. The constant-comparative method espoused by Maykut and Morehouse was used to analyze the data and Bronfenbrennerâ  s concept of the â  nested environmentâ   was the theoetical model used to organize the data.",
  "description_provenance": [
    "Author Email: hedrick@worldnet.att.net",
    "Advisor Email: jpociask@kgps.k12.va.us",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: twitta@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: jsugh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:51Z (GMT). No. of bitstreams: 5 5.pdf: 133339 bytes, checksum: 37182aaae2f6be3bbb6d6d69de274bf4 (MD5) 1.pdf: 16721 bytes, checksum: 74df29817f38684fc18c516f2f247b22 (MD5) 2.pdf: 44253 bytes, checksum: 277fa004263f02b79abd9233127bd381 (MD5) 4.pdf: 155457 bytes, checksum: 117a41e13951a5a01e88711ea75e2aa6 (MD5) 3.pdf: 152226 bytes, checksum: 635f76b88c525c676cd23cd5298f7ec2 (MD5)   Previous issue date: 2002-03-11"
  ],
  "handle": "26624",
  "identifier_other": "etd-04042002-203119",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04042002-203119/",
  "identifier_uri": "http://hdl.handle.net/10919/26624",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "5.pdf",
    "1.pdf",
    "2.pdf",
    "4.pdf",
    "3.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "desegregation",
    "high school integration"
  ],
  "title": "A Case Study in the Desegregation of George Washington High School and Langston High School in Danville, Virginia during the 1970-1971 School Year",
  "type": "Dissertation"
}