{
  "contributor_author": "Capogrossi, Kristen Lynn",
  "contributor_committeechair": "You, Wen",
  "contributor_committeemember": [
    "Estabrooks, Paul A.",
    "Ge, Suqin",
    "Boyle, Kevin J."
  ],
  "contributor_department": "Economics (Agriculture and Life Sciences)",
  "date_accessioned": "2014-03-14T20:08:51Z",
  "date_adate": "2012-05-03",
  "date_available": "2014-03-14T20:08:51Z",
  "date_issued": "2012-03-29",
  "date_rdate": "2012-05-03",
  "date_sdate": "2012-04-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Both types of childhood misnourishment, overweight/obesity and underweight, are accompanied by serious health consequences and a heavy economic burden. In 2008, 19.6% of US children aged 6 to 11 and 18.1% of adolescents aged 12 to 19 were obese equating to 13 million children.  Furthermore, in 2006, 2.7% of US children aged 6 to 11 and 3.9% of adolescents aged 12 to 19 were underweight translating to 2.4 million children.  This dissertation contains three essays on the relationship between child weight, school meal program participation and academic performance.  Chapter II examines how childrensâ   weight impacts their academic performance using a quantile analysis while controlling for potential simultaneity between weight and school outcomes.  Results indicate that programs targeting child weight could potentially have positive spillover effects on academic performance leading to the question of what can be done to mitigate the problem.  Since children consume one-third to one-half of their daily calories while in school each day, school level programs are natural policy instruments to tackle misnourishment.  Specifically, the School Breakfast Program (SBP) and National School Lunch Program (NSLP) are two federally-funded programs providing meals to over 31.7 million children daily. Chapter III examines the impact that these programs have on child weight using a multiple simultaneous treatment analysis controlling for self-selection into the programs. Chapter IV then investigates whether these programs have spillover effects on academic performance through the mediator of child weight using structural equation modeling and multiple simultaneous equation methodologies.  Each of these essays provides further insight to the relationship between child weight, school meal program participation and academic performance offering potential policy implications to tackle child misnourishment.",
  "description_provenance": [
    "Author Email: kris86@vt.edu",
    "Advisor Email: wenyou@vt.edu",
    "Advisor Email: estabrkp@vt.edu",
    "Advisor Email: ges@vt.edu",
    "Advisor Email: kjboyle@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:51Z (GMT). No. of bitstreams: 1 Capogrossi_KristenL_D_2012.pdf: 1566438 bytes, checksum: f02ce8207b683c3e7ea27aea2b95283d (MD5)   Previous issue date: 2012-03-29"
  ],
  "handle": "26622",
  "identifier_other": "etd-04032012-215410",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04032012-215410/",
  "identifier_uri": "http://hdl.handle.net/10919/26622",
  "publisher": "Virginia Tech",
  "relation_haspart": "Capogrossi_KristenL_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Education",
    "School Meal Programs",
    "Childhood Weight"
  ],
  "title": "Childhood Misnourishment, School Meal Programs and Academic Performance",
  "type": "Dissertation"
}