{
  "contributor_author": "Stone, Mark Adam",
  "contributor_committeechair": "Taylor, Larry T.",
  "contributor_committeecochair": "McNair, Harold M.",
  "contributor_committeemember": [
    "Dorn, Harry C.",
    "Viers, Jimmy W.",
    "Tanko, James M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:08:51Z",
  "date_adate": "2001-04-19",
  "date_available": "2014-03-14T20:08:51Z",
  "date_issued": "2001-02-08",
  "date_rdate": "2002-04-19",
  "date_sdate": "2001-04-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "\"Improving Off-line and On-line Supercritical Fluid Extraction Techniques by Elevating the Post-Restrictor Pressure\".   Mark Adam Stone.   The high flow rate that results as fluid decompresses through the restrictor is arguably the single greatest problem with supercritical fluid extraction techniques. As a result of these high flow rates, solvent trapping is not efficient in many cases, and the more complicated sorbent trapping technique must be used. In addition, loss of the collection solvent may occur during the process making it difficult to work with small volumes, which are desirable from the standpoint of sensitivity, cost, and environmental concerns.  Similarly, these high decompressed flows have made it difficult to directly interface supercritical fluid extraction methods with separation techniques. This is unfortunate as supercritical extractions are ideal for on-line coupling in other respects, such as the fact that the fluid becomes gaseous upon depressurization and that supercritical fluids generally extract less contaminant material. In this thesis we have shown that, by elevating the post-restrictor pressure, the decompressed flow rate can be reduced, and these problems can be minimized, considerably.  Off-line trapping becomes much simpler when working at elevated pressures as the need for sorbent trapping is virtually eliminated and solvent trapping may be conducted with much less difficulty.  Elevated post-restrictor pressures were found to be very beneficial for on-line work as well. SFE/GC was carried out with complete transfer of the extraction effluent to a capillary GC column, which has not previously been demonstrated. Likewise the use of an open-tubular column interface, maintained at moderately elevated pressures, allowed SFE/HPLC to be conducted with quantitative analyte transfer, even in the presence of 10% modifier. In all cases - but especially for the on-line methods - more practical extraction parameters were possible, including extraction vessel volume, extraction flow rate, and dynamic extraction time.  Another benefit of elevating the post-restrictor pressure is that higher extraction flow rates will generally be possible. The benefits of this were not evaluated in the research presented here, however, the effect that the extraction flow rate can have on extraction time is considered, from a theoretical standpoint, in Chapter five.",
  "description_provenance": [
    "Author Email: mastone@vt.edu",
    "Advisor Email: hdorn@chemserver.chem.vt.edu",
    "Advisor Email: jviers@chemserver.chem.vt.edu",
    "Advisor Email: jtanko@chemserver.chem.vt.edu",
    "Advisor Email: hmcnair@chemserver.chem.vt.edu",
    "Advisor Email: ltaylor@chemserver.chem.vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:51Z (GMT). No. of bitstreams: 1 ImprovingSFE.pdf: 2765183 bytes, checksum: 7ff40365b44d4b2b5c9e037b64f2da90 (MD5)   Previous issue date: 2001-02-08"
  ],
  "handle": "26623",
  "identifier_other": "etd-04042001-122603",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04042001-122603/",
  "identifier_uri": "http://hdl.handle.net/10919/26623",
  "publisher": "Virginia Tech",
  "relation_haspart": "ImprovingSFE.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Supercritical",
    "Post-Restrictor Pressure",
    "Extraction",
    "Trapping Efficiency"
  ],
  "title": "Improving Off-line and On-line Supercritical Fluid Extraction Techniques by Elevating the Post-Restrictor Pressure",
  "type": "Dissertation"
}