{
  "contributor_author": "Liu, Ning",
  "contributor_committeechair": "Mitchell, James K.",
  "contributor_committeemember": [
    "Brandon, Thomas L.",
    "Filz, George M.",
    "Mauldon, Matthew",
    "de Wolf, David A."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:08:54Z",
  "date_adate": "2007-05-08",
  "date_available": "2014-03-14T20:08:54Z",
  "date_issued": "2007-03-27",
  "date_rdate": "2007-05-08",
  "date_sdate": "2007-04-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Success in geotechnical analysis, design, and construction invariably requires that we have proper knowledge and understanding of (1) the strength, (2) the fluid flow properties, and (3) the stress-deformation behavior of the earth materials. These important engineering properties are primarily determined by the components and structure of a soil, which also dictate the soilâ  s responses in an electromagnetic field. As a nondestructive technique, the electromagnetic property measurement offers a promising approach to characterize earth materials and identify the effects of changes in environments.  However, despite many investigations in the last several decades, the relationship between the frequency-dependent electromagnetic properties of soils and their components and structure are still not well understood. Hence, estimation of engineering properties of a soil in a quantitative way from electromagnetic measurements can be uncertain.  In this research several tasks have been accomplished: (1)\tDevelopment of a physically based model that provides a means of investigating the coupled effects of important polarization mechanisms on soil electromagnetic properties, and a means of relating the electromagnetic properties of a soil to its fines content, clay mineralogy, anisotropy, degree of flocculation and pore fluid chemistry; (2)\tProposal of a practically applicable method to determine the volumetric water content, specific surface area and pore fluid salt concentration simultaneously from the dielectric spectrum; (3)\tDeduction of the wide-frequency electromagnetic properties of a soil by measuring its responses to a step pulse voltage using time domain reflectometry (TDR); (4) Establishment of the relationships between the specific surface area and compressibility, residual shear strength and hydraulic conductivity.  This study establishes a framework for quantifying soil engineering properties from their electromagnetic properties. If properly determined and interpreted, the electromagnetic properties can also provide insights into the causes of soil property changes over time and can be very useful in studying the effects of biological factors in geotechnical engineering, a field that may offer great potential for future advances.",
  "description_provenance": [
    "Author Email: niliu1@vt.edu",
    "Advisor Email: jkm@vt.edu",
    "Advisor Email: tbrandon@vt.edu",
    "Advisor Email: filz@vt.edu",
    "Advisor Email: mauldon@vt.edu",
    "Advisor Email: dadewolf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:54Z (GMT). No. of bitstreams: 13 05Chapter3.pdf: 1151844 bytes, checksum: f0a4fe3e03d578c41e3974495a87d220 (MD5) 04Chapter2.pdf: 833765 bytes, checksum: 7c298d7ef0012fde14c98c956d209547 (MD5) 03Chapter1.pdf: 67214 bytes, checksum: dd66d64bd1b09d6630a14c6bacf4a552 (MD5) 02Acknowlegement_Synopsis.pdf: 125473 bytes, checksum: 98a79842ca36d7f505da94f513b44d74 (MD5) 12References.pdf: 120408 bytes, checksum: 8c57f764a46da8bf44db83b19201bcc1 (MD5) 11Chapter9.pdf: 75219 bytes, checksum: 08008abee40082733653e4aae75554b4 (MD5) 10Chapter8.pdf: 723765 bytes, checksum: c97e016299b8fd41c7bbff40f6682bf8 (MD5) 09Chapter7.pdf: 1340010 bytes, checksum: 93a5b9dd4d5b2f1c5e092a78404ee867 (MD5) 08Chapter6.pdf: 1661259 bytes, checksum: bed9ebffd1ded22172fbc1fa0c860c81 (MD5) 07Chapter5.pdf: 392811 bytes, checksum: d81ec3433b79e6ebd121115df126c1e0 (MD5) 06Chapter4.pdf: 1690921 bytes, checksum: e0a02fe0f75de50b3574c5a51cee95d0 (MD5) 01Title_Abstract.pdf: 59586 bytes, checksum: 55a4e5db26810d521df6f64c3e182ea3 (MD5) 13Appendix.pdf: 71381 bytes, checksum: 599949c8ee82e177f00000b792380636 (MD5)   Previous issue date: 2007-03-27"
  ],
  "handle": "26627",
  "identifier_other": "etd-04042007-182854",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04042007-182854/",
  "identifier_uri": "http://hdl.handle.net/10919/26627",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "05Chapter3.pdf",
    "04Chapter2.pdf",
    "03Chapter1.pdf",
    "02Acknowlegement_Synopsis.pdf",
    "12References.pdf",
    "11Chapter9.pdf",
    "10Chapter8.pdf",
    "09Chapter7.pdf",
    "08Chapter6.pdf",
    "07Chapter5.pdf",
    "06Chapter4.pdf",
    "01Title_Abstract.pdf",
    "13Appendix.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "transmission line",
    "EGME",
    "liquid limit",
    "Dielectric dispersion"
  ],
  "title": "Soil and Site Characterization Using Electromagnetic Waves",
  "type": "Dissertation"
}