{
  "contributor_author": "Dong, Lin",
  "contributor_committeechair": "Xiao, Shuhai",
  "contributor_committeemember": [
    "Scheckler, Stephen E.",
    "Read, James Fredrick",
    "Kowalewski, Michal",
    "Dove, Patricia M."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:08:53Z",
  "date_adate": "2007-04-18",
  "date_available": "2014-03-14T20:08:53Z",
  "date_issued": "2007-03-27",
  "date_rdate": "2010-04-18",
  "date_sdate": "2007-04-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This thesis makes several contributions to improve our understanding of Proterozoic-Cambrian evolution of eukaryote life. Chapter 1 provides, for the first time, a quantitative characterization of the evolutionary trends of Proterozoic macroalgae. The analysis reveals that morphological disparity of Paleoproterozoic macroalgae was low but increased in the Mesoproterozoic and Ediacaran, with a plateau in between. There was also a significant increase in thallus surface/volume ratio and maximum canopy height of the Ediacaran macroalgal communities. The prolonged plateau between the Mesoproterozoic and Ediacaran may be related to either nutrient stress or the absence of animal grazing pressure. The Ediacaran increase in surface/volume ratio and morphological complexity may have been driven by decreasing pCO2 levels and increasing animal grazing pressure. Chapter 2 presents a systematic re-examination of the carbonaceous compression fossils Protoarenicola baiguashanensis Wang, 1982, Pararenicola huaiyuanensis Wang, 1982, and Sinosabellidites huainanensis Zheng, 1980, from the early Neoproterozoic Liulaobei and Jiuliqiao formations in northern Anhui, North China. These fossils were previously interpreted as worm-like metazoans. Our study reveals new morphological features that weaken the metazoan interpretation. Instead, the new data indicate that these fossils can be alternatively interpreted as erect epibenthic organisms, possibly coenocytic algae. Chapter 3 examines two important eukaryote fossils: Horodyskia Yochelson and Fedonkin, 2000, and Palaeopascichnus Palij, 1976, from the upper Ediacaran chert of the Liuchapo Formation in central Guizhou, South China. These exceptionally preserved fossils offer us a unique opportunity to investigate their body constructions and affinities. The morphologies of Horodyskia and Palaeopascichnus support a phylogenetic relationship with agglutinated foraminifers, shedding new light on the divergence of bikont eukaryotes, the rise of rhizarians, and the ecological importance of heterotrophic eukaryotes in Proterozoic ecosystems. Chapter 4 focuses on Cambrian microfossils that represent the primary producersâ  cyanobacteria and eukaryotic phytoplankton (acritarchs). Careful investigation of the basal Cambrian Yanjiahe Formation in the Yangtze Gorges area and the Yurtus Formation in the Aksu area revealed abundant acanthomorphic acritarchs, clustered coccoidal microfossils, filamentous cyanobacteria, and tubular microfossils. This study confirms previous stratigraphic correlation between the Yanjiahe and Yurtus formations and suggests that animals and phytoplankton radiated in tandem during the Cambrian explosion.",
  "description_provenance": [
    "Author Email: lindong@vt.edu",
    "Advisor Email: scheckler@vt.edu",
    "Advisor Email: jread@vt.edu",
    "Advisor Email: xiao@vt.edu",
    "Advisor Email: michalk@vt.edu",
    "Advisor Email: dove@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:53Z (GMT). No. of bitstreams: 1 DongDissertation2007final.pdf: 166231800 bytes, checksum: f9ba69c44fef65593a8c04f1f6566203 (MD5)   Previous issue date: 2007-03-27"
  ],
  "handle": "26626",
  "identifier_other": "etd-04042007-122740",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04042007-122740/",
  "identifier_uri": "http://hdl.handle.net/10919/26626",
  "publisher": "Virginia Tech",
  "relation_haspart": "DongDissertation2007final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Ediacaran",
    "South China",
    "Protoarenicola",
    "Pararenicola",
    "Sinosabellidites",
    "heterotrophic"
  ],
  "title": "Contributions to the Proterozoic and Cambrian Evolution of Eukaryotes",
  "type": "Dissertation"
}