{
  "contributor_author": "Holbrook, Heather Anne",
  "contributor_committeecochair": [
    "Cennamo, Katherine",
    "Burton, John K."
  ],
  "contributor_committeemember": [
    "Potter, Kenneth R.",
    "Brill, Jennifer M."
  ],
  "contributor_department": "Instructional Design and Technology",
  "date_accessioned": "2014-03-14T20:08:51Z",
  "date_adate": "2012-05-02",
  "date_available": "2014-03-14T20:08:51Z",
  "date_issued": "2012-03-23",
  "date_rdate": "2012-05-02",
  "date_sdate": "2012-04-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An Exploration of High-Fidelity Virtual Training Simulators on Learnersâ   Self-Efficacy:  A Mixed Methods Study Heather A. Holbrook Abstract  In this world of fast-paced learning, training agencies often require their learners to acquire the knowledge and skills needed for a job at an expedited rate. Because of this rapid form of training, learners are sometimes uncertain about their abilities to execute task-based performances. This uncertainty can lead to a decrease in learnersâ   self-efficacy on expected task performance. In order to help with this training, trainers are using a variety of simulations and simulators to provide learnersâ   valuable and necessary training experiences. This mixed methods study explored the influence of high-fidelity virtual training simulators on learnersâ   self-efficacy. It used pre- and post-simulation-use surveys that combined general self-efficacy questions (Schwarzer & Jerusalem, 1995) and task-specific self-efficacy questions (Bandura, 1977, 1997, 2006; Bandura, Adams, Hardy, & Howells, 1980). This study had a sample size of 18 participants. It was assumed that the intent of providing learners with the vital experience needed to perform specific tasks in a high-fidelity virtual training simulator was to increase their self-efficacy on task-specific criteria. Instead, through surveys, observations, and interviews, the research revealed a decrease in learnersâ   self-efficacy due to heightened emotional arousal stemming from the learnersâ   experiences with the level of realism the simulator provide, as well as with breakdowns within the simulator. The breakdowns and the realism were the most influential aspects that influenced self-efficacy in this study. The significance of these findings shows that despite learners wanting to use high-fidelity virtual training simulators, improperly  functioning simulators can negatively influence learnersâ   self-efficacy in task-based performances.",
  "description_provenance": [
    "Author Email: hahphd@gmail.com",
    "Advisor Email: cennamo@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: jmbrill@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:51Z (GMT). No. of bitstreams: 4 Holbrook_HA_D_2012.pdf: 8319014 bytes, checksum: 00aa93e0ff202686b5a43a087a2e1a34 (MD5) H1.pdf: 34615 bytes, checksum: efe2769c62b919a2614f1be4bc428072 (MD5) H2.pdf: 531116 bytes, checksum: a2ff972e5870eddbd4556a957b1af7ee (MD5) H3.pdf: 115377 bytes, checksum: e36a03a1a05d292b653ef3a481e0e64c (MD5)   Previous issue date: 2012-03-23"
  ],
  "handle": "26621",
  "identifier_other": "etd-04032012-200839",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04032012-200839/",
  "identifier_uri": "http://hdl.handle.net/10919/26621",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Holbrook_HA_D_2012.pdf",
    "H1.pdf",
    "H2.pdf",
    "H3.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "self-efficacy",
    "high-fidelity",
    "simulator"
  ],
  "title": "An Exploration of High-Fidelity Virtual Training Simulators on Learners' Self-Efficacy: A Mixed Methods Study",
  "type": "Dissertation"
}