{
  "contributor_author": "Keeney, Michael Stewart",
  "contributor_committeecochair": [
    "Cook, Brian J.",
    "Hult, Karen M."
  ],
  "contributor_committeemember": [
    "Dull, Matthew Martin",
    "Jensen, Laura S."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:08:55Z",
  "date_adate": "2012-04-13",
  "date_available": "2014-03-14T20:08:55Z",
  "date_issued": "2012-03-23",
  "date_rdate": "2012-04-13",
  "date_sdate": "2012-04-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Each of the fifty U.S. state constitutions establishes a fundamental framework for governmental operations within the state.  Described by previous scholarship as the stateâ  s political technology, state constitutions delineate formal gubernatorial and legislative authority.  Extant literature has focused on gubernatorial and legislative relations from the standpoint of the contemporary contextual political factors associated with individuals serving in the respective offices.  Although useful, this focus limits a deeper understanding about how state constitutions, as a point of departure, might affect the way in which governors and legislators interact in the policy process.  Specifically examined by this research is how variation in design might impact the ability of governors and state legislatures to achieve preferred policy alternatives.  This is addressed through the divergence between the governorâ  s proposed budget and the state legislatureâ  s enacted budget.  To analyze potential influences of this divergence, state budgets from 27 U.S. states over a recent period of eleven years were collected and coded according to policy areas.  Data were used to test hypothesized effects of state constitutional design of formal authority. Based on Tobit model estimation and predicted values of divergence derived from alternative constitutional design scenarios, some state constitutional factors affect the ability of governors and state legislatures to achieve preferred policy alternatives.  Salient constitutional variables include gubernatorial and legislative budget authority, institutional control, and duration in service factors.  The empirical focus of this research contributes to a more enriched understanding of state constitutions as political technologies.  In essence, the design of state constitutional authority has the potential to affect how governors and state legislatures interact in the policy process.  In addition to contributing to state constitutional theory, these findings enrich the understanding of the design of authority by reformers and citizens.",
  "description_provenance": [
    "Author Email: keeney@vt.edu",
    "Advisor Email: mdull@vt.edu",
    "Advisor Email: jensen7@vt.edu",
    "Advisor Email: brml27@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:55Z (GMT). No. of bitstreams: 1 Keeney_MS_D_2012.pdf: 1215802 bytes, checksum: 4ff70d202b00407458ab962a1484458c (MD5)   Previous issue date: 2012-03-23"
  ],
  "handle": "26636",
  "identifier_other": "etd-04042012-001332",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04042012-001332/",
  "identifier_uri": "http://hdl.handle.net/10919/26636",
  "publisher": "Virginia Tech",
  "relation_haspart": "Keeney_MS_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "state constitutional design",
    "state budget policy",
    "state legislatures",
    "governors",
    "formal authority"
  ],
  "title": "The Effects of State Constitutional Design of Gubernatorial and Legislative Authority in State Budget Policy",
  "type": "Dissertation"
}