{
  "contributor_author": "Gatling, Veleka Studivant",
  "contributor_committeechair": "Billingsley, Bonnie S.",
  "contributor_committeemember": [
    "Williams, Thomas O. Jr.",
    "Myers-Daub, Roni",
    "Parks, David J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:54Z",
  "date_adate": "2009-05-08",
  "date_available": "2014-03-14T20:08:54Z",
  "date_issued": "2009-03-26",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-04-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The reauthorization of the Individuals with Disabilities Act (IDEA) in 1997 increased educational standards and accountability for the education of students with disabilities. Specifically, the amendments of IDEA 1997 were directed at improving the results for all children served in Part B (early childhood special education) and Part C (early intervention). IDEA 1997 required that states develop a plan, including transition policy, procedures and practices to create a smooth transition from Part C (early intervention) to Part B (early childhood special education) services. IDEA 1997 also required that parents, school  administrators, service coordinators, and special educators be involved in the transition process. <p>  In 2004, IDEA 1997 was amended and is now known as IDEA 2004. Among the many amendments of this legislation are increased emphasis on early intervention services and transition. This suggests that the transition process from Part C to Part B should be revisited by all agencies involved to ensure that smooth transitions occur. Few studies have addressed the transition process and no studies were found that looked comprehensively at the transition process among parents, administrators, and other service providers.  The purpose of this study was to better understand the facilitators and inhibitors to successful transitions through the perceptions of all stakeholders involved in the process using three case studies. Major findings indicate that factors that may interfere with a smooth successful transition process include: (1) parentsâ   concerns about services, (2) confusion about meetings, and (3) lack of information, while factors that facilitate a successful transition include: (1) meaningful involvement and communication among all parents and school representatives and (2) having adequate information for decision-making. The findings reveal that although the school system was in compliance with the transition process, there were clear areas for improvement.",
  "description_provenance": [
    "Author Email: vgatling@vt.edu",
    "Advisor Email: thwilli1@vt.edu",
    "Advisor Email: bbilling@vt.edu",
    "Advisor Email: rmyersdaub@nps.k12.va.us",
    "Advisor Email: parksd@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:54Z (GMT). No. of bitstreams: 1 GatlingDissertationfinal.pdf: 1358354 bytes, checksum: 240d165e1941f23c85ca6441800e2f3c (MD5)   Previous issue date: 2009-03-26"
  ],
  "handle": "26632",
  "identifier_other": "etd-04042009-110847",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04042009-110847/",
  "identifier_uri": "http://hdl.handle.net/10919/26632",
  "publisher": "Virginia Tech",
  "relation_haspart": "GatlingDissertationfinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "special education",
    "transition",
    "early childhood education",
    "early intervention"
  ],
  "title": "The Transition from Early Intervention to Early Childhood Special Education: Three Case Studies",
  "type": "Dissertation"
}