{
  "contributor_author": "Sun, Pengwei",
  "contributor_committeechair": "Lai, Jih-Sheng Jason",
  "contributor_committeemember": [
    "Nelson, Douglas J.",
    "Centeno, Virgilio A.",
    "Meehan, Kathleen",
    "Yu, Wensong"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:08:55Z",
  "date_adate": "2012-04-16",
  "date_available": "2014-03-14T20:08:55Z",
  "date_issued": "2012-03-28",
  "date_rdate": "2012-04-16",
  "date_sdate": "2012-04-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Renewable energy and distributed generation are getting more and more popular, including photovoltaic modules (PV), wind turbines, and fuel cells. The renewable energy sources need the power electronics interface to the utility grid because of different characteristics between the sources and the grid. No matter what renewable energy source is utilized, inverters are essential in the microgrid system. Thanks to flexible modular design, transformerless connection, extended voltage and power output, less maintenance and higher fault tolerance, the cascade inverters are good candidates for utility interface of various renewable energy sources.  This dissertation proposes a new type of cascade inverters based on dual-buck topology and phase-shift control scheme. Compared to traditional cascade inverters, they have enhanced system reliability thanks to no shoot-through problems and lower switching loss with the help of using power MOSFETs. With phase-shift control, it theoretically eliminates the inherent current zero-crossing distortion of the single-unit dual-buck type inverter. In addition, phase-shift control can greatly reduce the ripple current or cut down the size of passive components by increasing the equivalent switching frequency.   An asymmetrical half-cycle unipolar (AHCU) PWM technique is proposed for dual-buck full-bridge inverter. The proposed approach is to cut down the switching loss of power MOSFETs by half. At the same time, this AHCU PWM leads to current ripple reduction, and thus reducing ripple-related loss in filter components. Therefore, the proposed PWM strategy results in significant efficiency improvement. Additionally, the AHCU PWM also compensates for the zero-crossing distortion problem of dual-buck full-bridge inverter. Several PWM techniques are analyzed and compared, including bipolar PWM, unipolar PWM and phase-shifted PWM, when applied to the proposed cascade dual-buck full-bridge inverter. It has been found out that a PWM combination technique with the use of two out of the three PWMs leads to better performance in terms of less output current ripple and harmonics, no zero-crossing distortion, and higher efficiency.  A grid-tie control system is proposed for cascade dual-buck inverter with both active and reactive power flow capability in a wide range under two types of renewable energy and distributed generation sources. Fuel cell power conditioning system (PCS) is Type I system with active power command generated by balance of plant (BOP) of each unit; and photovoltaic or wind PCS is Type II system with active power harvested by each front-end unit through maximum power point tracking (MPPT). Reactive power command is generated by distributed generation (DG) control site for both systems. Selective harmonic proportional resonant (PR) controller and admittance compensation controller are first introduced to cascade inverter grid-tie control to achieve better steady-state and dynamic performances.",
  "description_provenance": [
    "Author Email: spw21st@vt.edu",
    "Advisor Email: laijs@vt.edu",
    "Advisor Email: doug.nelson@vt.edu",
    "Advisor Email: virgilio@vt.edu",
    "Advisor Email: kameehan@vt.edu",
    "Advisor Email: wensong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:55Z (GMT). No. of bitstreams: 1 Sun_P_D_2012.pdf: 8240650 bytes, checksum: b2e6a9f5bfccb2fdceb698a2d49e5c9c (MD5)   Previous issue date: 2012-03-28"
  ],
  "handle": "26637",
  "identifier_other": "etd-04042012-103018",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04042012-103018/",
  "identifier_uri": "http://hdl.handle.net/10919/26637",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sun_P_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cascade",
    "dual-buck",
    "inverter",
    "phase-shift",
    "PWM",
    "grid-tie"
  ],
  "title": "Cascade Dual-Buck Inverters for Renewable Energy and Distributed Generation",
  "type": "Dissertation"
}