{
  "contributor_author": "Alday, Kerry N.",
  "contributor_committeechair": "Creighton, Theodore B.",
  "contributor_committeemember": [
    "Cash, Carol S.",
    "Tripp, Norman Wayne",
    "Twiford, Travis W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:55Z",
  "date_adate": "2011-04-27",
  "date_available": "2014-03-14T20:08:55Z",
  "date_issued": "2011-03-21",
  "date_rdate": "2011-04-27",
  "date_sdate": "2011-04-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<head> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" /> <title>Kerry Alday Abstract</title> </head> This study examines the historical evolution and legislative valuation of the National Teacher Certification Incentive Reward Program and Fund in the Commonwealth of Virginia. This fund offers stipends to teachers who earn National Board Certification from the National Board of Professional Teaching Standards. This research project included three steps of data collection. First, the legislative history of Virginia's National Teacher Certification Incentive Reward Program and Fund, which covered the General Assembly Session in 1999, was reviewed. The second step was open-ended interviews with legislators and a representative from the Virginia Education Association who participated in the creation of the \"Fund.\"  The third step was to collect and report the incentives that are offered by the local education agencies for teachers who earn National Board Certification. The study reported that the initial plan devised by the Carnegie Forum on Education and the Economy in the report, A Nation Prepared (1986) that National Board Certification was not implemented with fidelity in the Commonwealth of Virginia, according to the intended design when it pertained to both how to strategically use the skills of NBCTs and how to ensure NBCTs are working with the students most in need of help. As supported by the interview data, the study shows those interviewed value great teachers and are willing to support them with financial incentives.  <body> </body> </html>",
  "description_provenance": [
    "Author Email: kerry9er@aol.com",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: ccash@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:55Z (GMT). No. of bitstreams: 1 Alday_KA_D_2011.pdf: 1915997 bytes, checksum: 25066f3a817152ff3bdf23346cfff00e (MD5)   Previous issue date: 2011-03-21"
  ],
  "handle": "26633",
  "identifier_other": "etd-04042011-111339",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04042011-111339/",
  "identifier_uri": "http://hdl.handle.net/10919/26633",
  "publisher": "Virginia Tech",
  "relation_haspart": "Alday_KA_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "National Board Certification",
    "Teacher Leadership",
    "Improving Low-Performing Schools",
    "Effective Teachers",
    "National Board for Professional Teaching Standards"
  ],
  "title": "An Historical Analysis of the Development of National Board Certification Stipends in Virginia",
  "type": "Dissertation"
}