{
  "contributor_author": "Rogers, Kipp D.",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Cash, Carol S.",
    "Edwards, Stephen H.",
    "Tripp, Norman Wayne"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:54Z",
  "date_adate": "2009-04-28",
  "date_available": "2014-03-14T20:08:54Z",
  "date_issued": "2009-03-24",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-04-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The major purpose of this study was to gain an understanding of the instructional leadership role and responsibilities of middle school assistant principals and their level of involvement in instructional leadership.  Specifically, this study determined the extent of involvement of the middle school assistant principal as an instructional leader in the Commonwealth of Virginia.  The data gathered compared instructional leadership tasks to various demographic variables and determined the amount of time spent performing the instructional leadership tasks. <p> The Sources of Instructional Leadership(SOIL) survey instrument was revised and used in addition to a demographic survey to collect the data.  A total of 396 surveys were mailed to middle school assistant principals across the state of Virginia.  The SOIL survey includes 31 instructional leadership tasks that describe the instructional leadership responsibilities of assistant principals.   <p> The research design is non-experimental and descriptive.  The methodology was a modification of the methodology used in a study conducted by Bush (1997).  The design used a demographic survey, the SOIL survey and time study to collect data.  The data collected answered the following research questions: <ol> <li>What instructional leadership roles and responsibilities are performed by middle school assistant principals in Virginia? <li>What is the relationship between instructional leadership responsibilities performed and specific demographic variables? <li>How much time do middle school assistant principals spend on instructional issues each week? </li></ol>  Conclusions from the data reveal the primary instructional leadership responsibilities of Virginia middle school assistant principals are: (1) developing a school climate that is conducive to learning (2) improving student discipline, and (3) communicating a concern for student achievement.  The data also indicate that older assistant principals are more involved in observing and evaluating staff than younger assistant principals.  Additionally, the study found that the more instructional leaders in a school, the more involved assistant principals are with tasks that are associated with developing an academic climate.  Furthermore, almost 80% of the participants indicated they spent between 10-30% of their instructional task time developing an academic climate each week.  Nearly 50% of the participants spent the least amount of time on tasks that focus on coordinating the instructional program.",
  "description_provenance": [
    "Author Email: kdrogers@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: stevewedwards@comcast.net",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:54Z (GMT). No. of bitstreams: 1 kipprogersdissertation.pdf: 782402 bytes, checksum: 64e5987477308f2b57f460bfd0be705f (MD5)   Previous issue date: 2009-03-24"
  ],
  "handle": "26631",
  "identifier_other": "etd-04042009-085135",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04042009-085135/",
  "identifier_uri": "http://hdl.handle.net/10919/26631",
  "publisher": "Virginia Tech",
  "relation_haspart": "kipprogersdissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Instructional Leadership",
    "Middle School",
    "Assistant Principal"
  ],
  "title": "Instructinoal Leadership Role and Responsibilities of Middle School Assistant Principals in Virginia",
  "type": "Dissertation"
}