{
  "contributor_author": "Somjetlertcharoen, Amornchai",
  "contributor_committeechair": "Smith, Stephen A.",
  "contributor_committeemember": [
    "Holladay, Steven D.",
    "Ehrich, Marion F.",
    "Robertson, John L.",
    "Helfrich, Louis A."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:08:56Z",
  "date_adate": "2001-04-11",
  "date_available": "2014-03-14T20:08:56Z",
  "date_issued": "2001-03-23",
  "date_rdate": "2002-04-11",
  "date_sdate": "2001-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Ceftiofur sodium, a third generation cephalosporin, was studied to determine the potential of this drug as an alternative bacterial therapeutic agent for the aquaculture and ornamental fish industry. Grass carp, Ctenopharyngodon idella have been selected as the fish model for this study since they are a good representative for both foodfish and ornamental fish and are one of the major species grown worldwide. Pharmacokinetics of ceftiofur sodium after various routes of administration, histopathologic observations to detect possible toxic effects on the tissues involved in its metabolism and excretion, and the effects on the non-specific immune response were investigated in grass carp. For the pharmacokinetic studies, ceftiofur sodium was administered a single time to grass carp by four different routes : intracardiac (IC), intraperitoneal (IP), intramuscular (IM) and oral (PO) at a dosage of 8 mg/kg body weight. Serial blood samples were obtained and plasma samples were analyzed by high performance liquid chromatography for ceftiofur (as measured its metabolite, desfuroylceftiofur (DFC) and DFC-related metabolite concentrations). Disposition pharmacokinetic data were best described by a two compartment open model for IC and by a non-compartment model with no lag time for IP and IM administrations. Oral absorption of ceftiofur was not observed in this species. Following IC, IP and IM ceftiofur sodium administration, the final elimination half-lives, maximum plasma concentration, time to reach maximum concentration, volume of  distribution and plasma clearance were 0.38, 0.45 and 13.86 hours ; 157.09, 31.54 and 8.86 mg/ml ; 0, 0.25 and 0.5 hours ; 0.09, 0.17, 0.53 l/kg ; and 0.21, 0.26, 0.26 ml/min.kg, respectively. Desfuroylceftiofur metabolite was highly bound with plasma protein at pH 7.0 and 8.0. For the histopathological studies, a single intramuscular dose of ceftiofur sodium at three different concentrations, 8 (1X), 40 (5X) and 80 (10X) mg/kg was administered to  separate groups of grass carp for evaluation of the potential toxicity to major tissues involved in metabolism and excretion of this drug. These included the anterior kidney, posterior kidney, liver, and spleen. After 48 hours, lesions were seen in the posterior kidney at the highest dose of ceftiofur (10X). Morphological alterations observed microscopically included increased number of renal tubules, tubular necrosis and infiltration of inflammatory cells. No adverse effects on the glomeruli were observed at any concentration of the drug. For the immunotoxicity studies on the non-specific immune response, dosages of either 8 or 40 mg/kg body weight were administered intramuscularly. After 24 and 48 h, leukocyte number, phagocytic ability and H2O2 production were examined in the cells of the pronephros. The  results showed that neither dosage had an effect on the number of leukocytes in the pronephros. Phagocytosis was also not significantly altered at either dosage in macrophages from the pronephros. Hydrogen peroxide  production was not altered in the pronephros of fish dosed at 8 mg/kg, while at a dosage of 40 mg/kg, H2O2 production was significantly  increased.  In summary, ceftiofur sodium has potential as an efficacious  chemotherapeutic agent for controlling bacterial infection in brood stock and ornamental fish at the recommended dose of 8 mg/kg. A dose as high as 40 mg/kg can be use with careful consideration. This dosage may not directly injure the posterior kidney but it may affect the non-specific immune response of the fish.",
  "description_provenance": [
    "Author Email: amorn@vt.edu",
    "Advisor Email: holladay@vt.edu",
    "Advisor Email: marion@vt.edu",
    "Advisor Email: stsmith7@vt.edu",
    "Advisor Email: drbob@vt.edu",
    "Advisor Email: lhelfric@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:56Z (GMT). No. of bitstreams: 2 Dissertation.pdf: 512208 bytes, checksum: 2d1fadb0d4321281ab90c6e2fd522773 (MD5) Abstract.pdf: 14939 bytes, checksum: 521cac59dfd562279e534ca56b000660 (MD5)   Previous issue date: 2001-03-23"
  ],
  "handle": "26639",
  "identifier_other": "etd-04052001-122730",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04052001-122730/",
  "identifier_uri": "http://hdl.handle.net/10919/26639",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation.pdf",
    "Abstract.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "grass carp",
    "Ctenopharyngodon idella",
    "ceftiofur sodium"
  ],
  "title": "Evaluation of ceftiofur sodium as a chemotherapeutic agent in grass carp (Ctenopharyngodon idella)",
  "type": "Dissertation"
}