{
  "contributor_author": "Gwynne-Atwater, Angela",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeecochair": "Mallory, Walter D.",
  "contributor_committeemember": [
    "Tripp, Norman Wayne",
    "Cash, Carol S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:55Z",
  "date_adate": "2011-04-29",
  "date_available": "2014-03-14T20:08:55Z",
  "date_issued": "2011-03-28",
  "date_rdate": "2011-04-29",
  "date_sdate": "2011-04-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Educational Leadership is faced with the requirements designated under the No Child Left Behind (NCLB) Act of 2001.  Included in this legislation are the requirements of administrators to ensure that children with disabilities make academic progress and meet the legal mandates of the Individuals with Disabilities Education Improvement Act (IDEIA) of 2004. States receiving federal funding must provide free, multidisciplinary diagnosis, evaluation, and appropriate public preschool education for special needs children.  The demand on administrators to prepare teachers and develop appropriate early intervention programs is especially significant for preschool classrooms that serve children who have been diagnosed with a developmental delay.  This study investigated the effectiveness of the professional development that was provided for teachers of preschoolers who have been diagnosed on the autism spectrum or have been identified with a developmental delay that presents autistic-like characteristics.  The purpose of this study was to conduct an evaluation of the professional development program of a large Mid-Atlantic school divisionâ  s preschool special education autism program.  The researcher surveyed teachers regarding their perceptions of preparedness to teach this group of children.  By using the Provus Evaluation Model, the researcher examined the program and evaluated whether its implementation was consistent with the program's design.  It was expected that the researcher would be able to determine the teachersâ   perceptions of their level of knowledge, skills and abilities in teaching the child who has been diagnosed on the autism spectrum, or who presents with autistic-like behaviors.  A review of the literature and the interviews of the program managers found five areas or themes: communication, behavior, academics, social and self-help.  The findings led to the following conclusions: a discrepancy existed only in one area, self-help skills.  No conclusive evidence was found regarding the influence of years of experience on teacher perceptions of effectiveness in the five areas.  Future research should include a larger sample and inclusion of other school districts.  By obtaining this information, the researcher is able to provide school leaders with data that could potentially have a direct impact on the future of planned professional development opportunities as well as future program expansion.",
  "description_provenance": [
    "Author Email: agatwater@verizon.net",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:55Z (GMT). No. of bitstreams: 1  Atwater_A_D_2011.pdf: 1163655 bytes, checksum: 315f1dabcc9ef14fb9832df0757ce4d8 (MD5)    Previous issue date: 2011-03-28"
  ],
  "handle": "26635",
  "identifier_other": "etd-04042011-184433",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04042011-184433/",
  "identifier_uri": "http://hdl.handle.net/10919/26635",
  "publisher": "Virginia Tech",
  "relation_haspart": "Atwater_A_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "preschool special education",
    "autism",
    "program evaluation",
    "professional development"
  ],
  "title": "An Evaluation of a Special Education Preschool Program Serving Children   With Autism or Autistic-Like Behaviors",
  "type": "Dissertation"
}