{
  "contributor_author": "Bott, Charles Briddell",
  "contributor_committeechair": "Love, Nancy G.",
  "contributor_committeemember": [
    "Stevens, Ann M.",
    "Gregory, Eugene M.",
    "Knocke, William R.",
    "Novak, John T.",
    "Schneiter, R. Wane"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:08:56Z",
  "date_adate": "2001-04-16",
  "date_available": "2014-03-14T20:08:56Z",
  "date_issued": "2001-04-04",
  "date_rdate": "2002-04-16",
  "date_sdate": "2001-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The overall hypothesis of this work is that the physiological microbial stress response could serve as a rapid, sensitive, and mechanistically-based indicator of process upset in biological wastewater treatment systems that receive sporadic shock loads of toxic chemicals.  The microbial stress response is a set of conserved and unique biochemical mechanisms that an organism activates or induces under adverse conditions, specifically for the protection of cellular components or the repair of damaged macromolecules.  Using traditional immunochemical analysis techniques, the heat shock protein, GroEL, was found to be induced in activated sludge cultures exposed to perturbations of chemicals at all concentrations tested (cadmium, pentachlorophenol, and acetone) or heat stress.  As total cadmium concentrations increased above 5 mg/L, there was a significant and consistent increase in effluent volatile suspended solids concentrations from activated sludge sequencing batch reactors relative to unstressed controls, but there was no additional increase in GroEL levels.    Stress proteins may serve as sensitive and rapid indicators of mixed liquor toxicity which can adversely impact treatment process performance, but GroEL may not be a good candidate protein for this purpose due to the lack of a dose/response relationship.  Additionally, production of stress proteins did not explain the significant deflocculation upsets that were characteristic of many of the industrially-relevant chemicals tested, including pentachlorophenol and cadmium.  Although the purpose of stress response mechanisms is protective at the cellular level, the effect may be disruptive at the macroscopic level in engineered bioreactor systems.    The goal of the second research phase was to determine whether the bacterial glutathione-gated, electrophile-induced potassium efflux system is responsible for deflocculation observed due to shock loads of toxic electrophilic (thiol reactive) chemicals.  The results indicate significant K+ efflux from the activated sludge floc structure to the bulk liquid in response to shock loads of 1-chloro-2,4-dinitrobenzene (CDNB), N-ethylmaleimide (NEM), 2,4-dinitrotoluene (DNT), 1,4-benzoquinone (BQ), and Cd2+ to a bench-scale sequencing batch reactor (SBR) system.  In most cases, the stressor chemicals caused significant deflocculation, as measured by an increase in effluent volatile suspended solids (VSS), at concentrations much less than that required to reduce the maximum specific oxygen uptake rate by 50% (IC50).  This suggests that electrophile-induced activated sludge deflocculation is caused by a protective bacterial stress mechanism (as hypothesized) and that the upset event may not be detectable by aerobic respirometry.  More importantly, the amount of K+ efflux appeared to correlate well with the degree of deflocculation.    The transport of other cations including sodium, calcium, magnesium, iron, and aluminum, either to or from the floc structure, was negligible as compared to K+ efflux.  In bench-scale SBRs, it was also determined that the K+ efflux occurred immediately (within minutes) after toxin addition and then was followed by an increase in effluent turbidity.  K+ efflux and deflocculation responses were similar for bench-scale SBRs and continuous-flow reactor systems, indicating that the periods of elevated exogenous substrate levels typical in SBR systems are not required to activate electrophile-induced K+ efflux or deflocculation.  This also suggests that the initial and rapid efflux of K+ immediately following electrophile addition is the factor that leads to deflocculation, not the increase in bulk liquid K+.  Sphingomonas capsulata, a bacterium consistent with that found in biological wastewater treatment systems, Escherichia coli K-12, and activated sludge cultures exhibited very similar dynamic efflux/uptake/efflux responses due to the electrophilic stressors, NEM and CDNB, and the thiol reducing agent, dithiothreitol (DTT).    The polyether ionophore antibiotic, nigericin, was used to artificially stimulate K+ efflux from S. capsulata and activated sludge cultures.  Thus, glutathione-gated K+ efflux (GGKE) activity may cause K+ release from the cytoplasm of activated sludge bacteria into the floc structure and extracellular polymeric substances (EPS) and then diffusion-limited transport into the bulk liquid.  It was not possible to resolve the effect of the GGKE system on changes in bulk liquid or floc-associated pH.  However, calculations indicate that the localized K+ concentration within the floc structure immediately after chemical stress is consistent with that known to induce floc disruption as a result of KCl addition.  Using alkaline phosphatase as a periplasmic marker as well as fluorescent membrane-permeable and impermeable nucleic acid stains, it was determined that a negligible amount of the K+ efflux response was due to lysis of activated sludge microorganisms.  The current results are very promising and are the first to suggest that activated sludge upset (i.e. deflocculation) may be caused by a specific protective stress response in bacteria.",
  "description_provenance": [
    "Author Email: cbott@vt.edu",
    "Advisor Email: nlove@vt.edu",
    "Advisor Email: ams@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Advisor Email: knocke@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Advisor Email: wane@vmi.edu",
    "Made available in DSpace on 2014-03-14T20:08:56Z (GMT). No. of bitstreams: 1 etd_C_Bott.pdf: 786837 bytes, checksum: a8cc99362d955ea62ad4c05da4cd92a8 (MD5)   Previous issue date: 2001-04-04"
  ],
  "handle": "26641",
  "identifier_other": "etd-04052001-153955",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04052001-153955/",
  "identifier_uri": "http://hdl.handle.net/10919/26641",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd_C_Bott.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "process upset",
    "potassium efflux",
    "xenobiotic",
    "deflocculation",
    "activated sludge",
    "microbial stress response",
    "glutathione",
    "GroEL",
    "Hsp60",
    "stress protein",
    "biological wastewater treatment"
  ],
  "title": "Elucidating the Role of Toxin-Induced Microbial Stress Responses in Biological Wastewater Treatment Process Upset",
  "type": "Dissertation"
}