{
  "contributor_author": "Bryant, Bradley Wayne",
  "contributor_committeechair": "Hillison, John H.",
  "contributor_committeemember": [
    "Anderson, Glenn A.",
    "Stewart, Daisy L.",
    "McDaniel, Alan R.",
    "White, John M."
  ],
  "contributor_department": "Vocational and Technical Education",
  "date_accessioned": "2014-03-14T20:08:56Z",
  "date_adate": "2001-04-29",
  "date_available": "2014-03-14T20:08:56Z",
  "date_issued": "2001-03-22",
  "date_rdate": "2007-10-13",
  "date_sdate": "2001-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Part of this research focused on the predecessors of the FFA by outlining the history and purposes of agricultural organizations formed since the late 1700s.  The past two centuries of American agricultural history is rich with efforts to educate and improve agricultural practices through organized groups of farmers and other rural leaders.  Early in the development of agricultural societies, experimentation and successful practices were shared with others in the local organization and works were often published in journals or newspapers for educational and informational purposes.  Regular meetings and fellowship were also a major focus of the early groups.  The national organizations that formed later such as the Grange, included the fraternal, social, and educational aspects while maintaining a focus on the economics of farming. </p><p> The boysâ   and girlsâ   club movement provided opportunities for youth to meet, learn, and participate in agricultural competitions.  The center of activities for youth organizations quickly shifted from community groups to agricultural education programs in the public schools.  Clubs that formed within agricultural education programs in Virginia soon united to create the Future Farmers of Virginia.  The FFV and FFA that followed initiated the use of certain symbols, colors, and ritual ceremonies that can be traced directly to the agricultural societies.  This research identified many agricultural societies and youth clubs that had a profound influence on the development of the National FFA Organization. </p><p> The major purpose of this study was to describe the establishment of the Future Farmers of American and to document the accomplishments of Virginia FFA members at the state and national levels.  The objectives of the study were:  </p> <ol><li> To describe the historical events and circumstances that led to the establishment of the Future Farmers of Virginia and the Future Farmers of America, </li><li> To document Virginia FFA history by recording achievements of members and chapters at the state level, </li><li>To document the achievements of Virginia FFA members and chapters at the national level, and </li><li>To provide a history of the Virginia FFA Association from 1925 to the present.</li> </ol><p> The Virginia FFA Association is rich with historical information that ranges from the formation of the Future Farmers of Virginia in 1925, the forming of a national organization in 1928, and 75 years of accomplishments by Virginia FFA members.  </p>",
  "description_provenance": [
    "Author Email: bwbryant@vt.edu",
    "Advisor Email: hillison@vt.edu",
    "Advisor Email: ganderso@pen.k12.va.us",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: alanmcd@vt.edu",
    "Advisor Email: jmwhite@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:56Z (GMT). No. of bitstreams: 2 VAFFAHistory.PDF: 1442173 bytes, checksum: fd72ac3c0fc96385327c48b073c73464 (MD5) VAFFApartialappendices.PDF: 508468 bytes, checksum: 4edf5839e9620d83e7c735d372bf852c (MD5)   Previous issue date: 2001-03-22"
  ],
  "handle": "26640",
  "identifier_other": "etd-04052001-123815",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04052001-123815/",
  "identifier_uri": "http://hdl.handle.net/10919/26640",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "VAFFAHistory.PDF",
    "VAFFApartialappendices.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Future Farmers of America",
    "agricultural education",
    "Virginia FFA"
  ],
  "title": "History of the Virginia FFA Association",
  "type": "Dissertation"
}