{
  "contributor_author": "Grugle, Nancy Lynn",
  "contributor_committeechair": "Kleiner, Brian M.",
  "contributor_committeemember": [
    "Babski-Reeves, Kari L.",
    "Balkin, Thomas",
    "Smith-Jackson, Tonya L.",
    "Wesensten, Nancy"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:08:56Z",
  "date_adate": "2005-04-21",
  "date_available": "2014-03-14T20:08:56Z",
  "date_issued": "2005-03-14",
  "date_rdate": "2005-04-21",
  "date_sdate": "2005-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Both sleep deprivation and loss of situation awareness (SA) have been cited as primary causal factors contributing to the accident and injury rate in the military and civilian sector (e.g., transportation).  Despite the numerous references to both factors as causal in nature, much of the literature on the effects of sleep deprivation on executive function is anecdotal.  Research has produced mixed results regarding the nature and extent of performance degradation on a variety of lower-level and executive function tasks.  Similarly, although SA has been cited as a significant contributor to operational performance, there is still considerable debate over the definition and construct validity of SA.  Thus, a 29-hour hour sleep deprivation study was conducted to analyze the effects of sleep deprivation on both lower-order cognitive tasks (e.g., attention and working memory) and executive function tasks (e.g., reasoning, planning, decision making, and SA).  In conjunction with the sleep deprivation analysis, the relationships among lower level cognition, executive function, and situation awareness were analyzed to form hypotheses about the SA construct and its relationship to complex task performance.   Forty-eight participants were administered a series of cognitive tasks during baseline and sleep deprived testing sessions.  Paired t-tests and additional post hoc analyses were conducted to determine the effects of sleep deprivation on cognition.  Regression and factor analysis were used analyze the relationship among lower-order cognition, executive function, situation awareness, and complex task performance.  Paired t-test results showed degraded vigilance in response to sleep deprivation, but did not indicate degraded executive function.  Results of additional post-hoc analyses on executive function data indicated a trend toward degraded decision making and a trend toward increased planning errors in response to sleep deprivation.  The results of the regression and factor analyses provided initial support for a dynamic, process definition of SA and illustrated the importance of considering SA as part of information processing as a whole in order to improve performance prediction.  Based on the results of this dissertation, engineering recommendations were made for developing an â  idealâ   SA measurement technique and improving existing SA measurement techniques.  Additionally, future sleep deprivation and situation awareness research directions were suggested.",
  "description_provenance": [
    "Author Email: ngrugle@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: kbabski@vt.edu",
    "Advisor Email: thomas.balkin@us.army.mil",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: nancy.wesensten@us.army.mil",
    "Made available in DSpace on 2014-03-14T20:08:56Z (GMT). No. of bitstreams: 1 NancyGrugleETD2.pdf: 2632336 bytes, checksum: e65f4b2d463263e9510d42c4d2a4aa63 (MD5)   Previous issue date: 2005-03-14"
  ],
  "handle": "26645",
  "identifier_other": "etd-04052005-155911",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04052005-155911/",
  "identifier_uri": "http://hdl.handle.net/10919/26645",
  "publisher": "Virginia Tech",
  "relation_haspart": "NancyGrugleETD2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Situation Awareness",
    "Sleep Deprivation",
    "Executive Function"
  ],
  "title": "Understanding the Effects of Sleep Deprivation on Executive Function, Complex Task Performance and Situation Awareness",
  "type": "Dissertation"
}