{
  "contributor_author": "Barco, Margaret Jackson",
  "contributor_committeechair": "Earthman, Glen I.",
  "contributor_committeemember": [
    "Driscoll, Lisa G.",
    "Salmon, Richard G.",
    "Martin, Rosalie Marie"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:57Z",
  "date_adate": "2007-05-02",
  "date_available": "2014-03-14T20:08:57Z",
  "date_issued": "2007-03-27",
  "date_rdate": "2007-05-02",
  "date_sdate": "2007-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT                                                                 The purpose of this study was to examine the relationship between teacher efficacy and attitudes of secondary general education teachers towards teaching learning disabled students in the inclusive classroom setting. An online survey, along with a telephone interview was conducted with secondary teachers as a means to gathering data regarding teacher attitudes and efficacy toward inclusion.       Results from the online survey suggested that secondary teachers have both positive and negative attitudes toward inclusion. These attitudes varied when it came to issues of making accommodations and modifications for disabled students, whether part time or full time in the inclusive classroom setting. Responses to items concerning sufficient/insufficient training to teach disabled students brought about differences in responses from male and female participants. The female respondents were undecided as to whether or not they had sufficient training to teach learning disabled students in the inclusive classroom setting. The female respondents also were undecided as to whether or not more undergraduate classes would have given them more confidence working with learning disabled students in the inclusive classroom.       As for efficacy, making adaptations, and training, female teachers tended to have a greater degree of confidence in teaching disabled students in the regular classroom setting in comparison to the male teachers whose confidence levels were lower than their female counterparts. The same can be seen with the rural and urban/suburban teacher groups in regards to adaptations and training. Both urban/ suburban teachers tended to project positive attitudes towards making accommodations and modifications for disabled students. They tended to respond in a positive manner when it came to modifying teaching style and adapting the curriculum for disabled students in the inclusive classroom setting.         Results from the telephone interview survey concluded that secondary teachers feel that inclusion works for some disabled students, but not others. Some respondents felt that inclusion is responsible for teachers 창  dummying down창   lessons. The respondents also suggested that they have had positive, as well as, negative experiences with inclusion.   The positive experiences included making methodological and curricular changes in teaching styles, employing best teaching practices, and reorienting the way assignments are given. The respondents found these changes to be positive for all students, which in turn, helped to change the mindset that lessons were being 창  dummied down.창   Negative experiences included not having a voice in which students would benefit from the inclusion construct.       This study concluded that inclusion does have its benefits, as well as it flaws, but its success rests on the attitudes of the teachers in the classroom. The study also concluded that a relationship does exist between teacher self-efficacy and teacher attitudes as they relate to teaching learning disabled students in the inclusive setting.",
  "description_provenance": [
    "Author Email: mjbarco@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: rosemartin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:57Z (GMT). No. of bitstreams: 1 MJBARCO.pdf: 1664606 bytes, checksum: 1083b8420ba200b08f9447badac6f4c9 (MD5)   Previous issue date: 2007-03-27"
  ],
  "handle": "26648",
  "identifier_other": "etd-04052007-131310",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04052007-131310/",
  "identifier_uri": "http://hdl.handle.net/10919/26648",
  "publisher": "Virginia Tech",
  "relation_haspart": "MJBARCO.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Mainstreaming",
    "Inclusion",
    "Learning Disabled",
    "Teacher Attitude",
    "Student Achievement",
    "Efficacy"
  ],
  "title": "The Relationship Between Secondary General Education Teachers Self-Efficacy and Attitudes As They Relate To Teaching Learning Disabled Students In The Inclusive Setting",
  "type": "Dissertation"
}