{
  "contributor_author": "Kolo, Emmanuel",
  "contributor_committeechair": "Finch, Curtis R.",
  "contributor_committeemember": [
    "Asselin, Susan B.",
    "Burton, John K.",
    "Skaggs, Gary E."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:08:56Z",
  "date_adate": "2006-05-08",
  "date_available": "2014-03-14T20:08:56Z",
  "date_issued": "2006-03-13",
  "date_rdate": "2006-05-08",
  "date_sdate": "2006-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to determine if Automotive Service Excellence (ASE) certification of automotive service technicians in independent dealerships enhanced job performance.  Descriptive survey methodology was used to gather information for 100 automotive technicians (50 ASE-certified and 50 non-certified technicians) located in 50 different work sites. Each siteâ  s service manager was asked to complete a questionnaire and a rating scale for two technicians, one ASE certified and one non-certified.  The questionnaire was designed using expert opinions of automotive service managers and community college automotive instructors in the Triad area of North Carolina.  The 28-item Minnesota Satisfactoriness Scales (MSS) were used to assess job satisfactoriness.  Responses to 95 completed questionnaires and accompanying MSS were included in statistical analyses.  The role of these variables in predicting ratings of job performance was further examined by including the regression analyses of only those who had four or less years of on-the-job experience.  Among certified technicians, higher scale scores and longer years of experience positively predicted ratings of job performance, as well as decreased numbers of customer complaints.  Overall, certified technicians had higher mean job performance ratings than non-certified technicians.  Attendance and employee recognition did not significantly predict ratings of job performance in either category of technicians.  Results indicated that the number of technicians receiving customer complaints was directly dependent on certification status.  Variables such as awards and number of months of perfect attendance had minimal effect on both categories of technician job performance rating.",
  "description_provenance": [
    "Author Email: ekolo@martincc.edu",
    "Advisor Email: crfinch@vt.edu",
    "Advisor Email: sasselin@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:56Z (GMT). No. of bitstreams: 1 KoloDissertation.pdf: 381783 bytes, checksum: 13e80e64e093dcc6addb304e56f32172 (MD5)   Previous issue date: 2006-03-13"
  ],
  "handle": "26646",
  "identifier_other": "etd-04052006-133702",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04052006-133702/",
  "identifier_uri": "http://hdl.handle.net/10919/26646",
  "publisher": "Virginia Tech",
  "relation_haspart": "KoloDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Job Performance",
    "ASE",
    "Automotive Service Industry",
    "Certification"
  ],
  "title": "Does Automotive Service Excellence (ASE) Certification Enhance Job Performance of Automotive Service Technicians?",
  "type": "Dissertation"
}