{
  "contributor_author": "Cavalcanti, Bianor Scelza",
  "contributor_committeecochair": "Wamsley, Gary L.",
  "contributor_committeemember": [
    "Wolf, James F.",
    "White, Orion F. Jr.",
    "Dudley, Larkin S.",
    "Rohr, John A."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:08:56Z",
  "date_adate": "2005-04-08",
  "date_available": "2014-03-14T20:08:56Z",
  "date_issued": "2004-09-07",
  "date_rdate": "2005-04-08",
  "date_sdate": "2005-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this dissertation is to understand the managerial â  actionâ   of public administrators in the management of their organizations within the brazilian context. It seeks to understand the relationships between managers and formal management mechanisms  by exploring the complementary nature of the effective managerial action in the face of structural deficiencies and flaws, considering the possibility of overcoming the structuralism-subjectivism dichotomy present in the construction of the Theory of Organizations. Initially, the study provides a review of the  literature on organizational design. It highlights the â  goodness of fitâ   proposition on strategic choice issues concerning the main organizational variables design and organizational goal attainment. It also calls special attention to the emerging interest of designing theorists on interpretivist aproachs to the matter, such that of Karl Weick. A review of the the administrative reforms in Brazil is made from the perspective of the main stream organizational design conceptual framework. It highlights the complex dynamics of a constant search for differenciation and flexibilization subject to patherns of advances and reversals, due to the centrality, streng and pervasiveness of the bureaucratic model. It is concluded that in no single given moment, a public manager and his team, may count on a formal organizational design wich attends the â  congruencyâ   criteria, devised by organizational design conceptual frameworks,  to explain organizational results in different environmental sets. Although this conclusion may explain failure at the public sector, it can not provide understanding on the many instances of significative success attained by government operations in spite of inadequate formal administrative structures. This point calls for a better understanding from the interpretivist aproach, on how public administrators, strongly associated with good organizational results, engage into transformative action, in order to superate administrative structures flaws and disfuncional cultural patherns of conduct, structurally present  and constantly reproduced, in vigorous develloping countries, such as Brazil.  The dissertation transcribes the testimony of four outstanding public administrators, doing a deep incursion in the managerial real world of public administration, as subjectivelly defined by them and transformed by their engagement into action.Through the thematic version of the Oral History methodology, full segments of the complete enterviews are cathegorized into the thirty two managerial strategies captured wich are presented on a recathegorized manner under eight main strategies: (1) Interchanging Frames  of Reference; (2) Exploring the Formal Limits; (3) Playing the Bureaucracy Game; (4) Inducing the Inclusion of Others (5)Promoting Internal Cohesion; (6) Creating Shields against Transgressions; (7) Overcoming Internal Restrictions; (8) Letting the Structures Blossom. Each one of these eight blocks of strategies presented, deserves further reflexive interpretation by the author, on the light of the interpretivist aproach to organizational design. A final effort is made, now on theory building, for improuving understanding on the matter. In order to find a significant meaning underlining all the strategies extracted from the â  practical constiounessâ   of the enterviweers as revealed in their report, the author resort to a methafor. This methafor helps to: (1) better describe and understand a not adequately treated phenomenon, namely, good results under inadequate structural social and organizational conditions; (2) reveal the logic and the meaning underlining all the strategies adopted to generate results under these unfaithfull conditions; (3) name, accordingly to the nature of  the managerial transformative social action envolved, an open ended class of managerial interventions of a pragmatic sort driven by an ethics of results much common to good managers, that is, the concept of â  managerial equalizationâ  ; and (4) give back to public administrators, represented by the enterviwees, to be incorporated in  their â  discursive counciousnessâ  , something the most effective and experienced public managers already have as tacit knowledge built in their â  practical counsciousnessâ  , and so, help the education and development of new talents.",
  "description_provenance": [
    "Author Email: bianor@fgv.br",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: humpty@vt.edu",
    "Advisor Email: mcswite@sbcglobal.net",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: jrohr@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:56Z (GMT). No. of bitstreams: 1 tese05Nov.pdf: 733130 bytes, checksum: e64ac1b81c50e5e06b05a82fab0a0731 (MD5)   Previous issue date: 2004-09-07"
  ],
  "handle": "26644",
  "identifier_other": "etd-04052005-104540",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04052005-104540/",
  "identifier_uri": "http://hdl.handle.net/10919/26644",
  "publisher": "Virginia Tech",
  "relation_haspart": "tese05Nov.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "education and devellopment of public managers.  Ag",
    "equalizer manager",
    "equalizing management",
    "unfaithfull structural conditions",
    "metaphor",
    "discursive cousciousness",
    "discourse",
    "practical cosciousness",
    "tacit knowledge",
    "agency",
    "intentionality",
    "ethics",
    "empirical bases",
    "improvising",
    "equalizing",
    "theory building",
    "meaning",
    "agent",
    "desining",
    "patrimonialism",
    "reflexive interpretation",
    "organizing",
    "inclusion",
    "cohesion",
    "transgression",
    "corruption",
    "clientelism",
    "nepotism",
    "cognitive maps",
    "deponents",
    "frames of reference",
    "transformative action",
    "explanation",
    "understanding",
    "oral history",
    "flexbilization",
    "decentralization",
    "uniformity",
    "conceptual frameworks",
    "organizational change",
    "goodness of fit",
    "congruency in organizational strategic choice",
    "organizational results",
    "organizational performance",
    "differentiation",
    "uncertainty",
    "Brazil",
    "develloping countries",
    "administrative reform",
    "bureaucratic model",
    "centralization",
    "organizational design",
    "organizational theory",
    "interpretivist approach",
    "subjectivism",
    "funcionalism",
    "paradigms",
    "cultural patterns reproduction",
    "structural flaws",
    "public manager",
    "public administrator",
    "formal management mechanisms",
    "Action",
    "managerial action",
    "public administration and management",
    "public sector",
    "public policy",
    "public programs"
  ],
  "title": "The \"Equalizer\" Administration: Managerial Strategies in the Public Sector",
  "type": "Dissertation"
}