{
  "contributor_author": "Huntley, John Warren",
  "contributor_committeechair": "Kowalewski, Michal",
  "contributor_committeemember": [
    "Xiao, Shuhai",
    "Read, James Fredrick",
    "Eriksson, Kenneth A.",
    "Kelley, Patricia H."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:08:57Z",
  "date_adate": "2007-05-09",
  "date_available": "2014-03-14T20:08:57Z",
  "date_issued": "2007-03-22",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Body size is one of the most fundamental quantifiable traits of living or fossil organisms, and understanding it in various temporal and spatial contexts can offer key insights into the process of evolution.  This volume examines body size of eukaryotes and its correlates in various temporal and spatial contexts in three distinct studies.  The first study investigates the relationship between parasitism and body size of modern bivalve hosts.  Individuals of Protothaca staminea were extensively parasitized (86%) by two types of trace-producing parasites.  The only significant relationship between parasitism and body size was that spionid mudblister infested clams from one environment were slightly, yet significantly, smaller than their non-infested counterparts.  The most obvious pattern regarding body size was that clams from a lagoon were significantly larger than clams from a tidal creek.  This size discrepancy could be related to environmental stress, durophagous predators, differing hydrodynamic conditions, or the comparison of differing cohorts. Even though there was no discernible impact of trematode parasitism on bivalve body size, their traces were abundant and easy to identify.  Investigators of body size in the fossil record should be aware of these organisms and their possible ramifications for body size studies. The second study, using Quaternary terrestrial gastropods from the Canary Islands, tests the hypothesis of limiting similarity, the idea that two closely related species will alter their size/morphology in order to minimize competition. By integrating amino acid geochronology, stable isotope estimates, and morphometric techniques I was able to more adequately test whether limiting similarity is an evolutionary process or a transient ecological phenomenon.  The first prediction of limiting similarity, character displacement, was confirmed.  The second prediction of limiting similarity, character release, was not confirmed. It appears that changing climate at the end of the Pleistocene may be responsible for the body size trends, but intraspecific competition likely played a secondary role in the evolution of body size of Theba.  The third study addressed the history of body size and morphological disparity of the first 1.3 billion years of acritarch history.  The results reject the idea that acritarch body size increased monotonically through the Proterozoic; in fact they displayed non-directional fluctuation.  Acritarch body size decreased significantly following the first appearance of Ediacara organisms and gradually rose during the Cambrian.  Morphological disparity increased a half billion years before the first taxonomic radiation. Morphological disparity decreased significantly during the snowball earth events and upon the first appearance of Ediacaran organisms suggesting multiple events of selective extinction in the Proterozoic biosphere.  Disparity then increased in step with the diversification of acritarch and metazoans through the Cambrian suggesting ecological links between the two groups.  Ecological processes, whether extrinsic abiotic processes or biotic interactions, influence the body size and evolution of organisms at wide range of spatial and temporal scales.",
  "description_provenance": [
    "Author Email: jhuntley@vt.edu",
    "Advisor Email: michalk@vt.edu",
    "Advisor Email: xiao@vt.edu",
    "Advisor Email: jread@vt.edu",
    "Advisor Email: kaeson@vt.edu",
    "Advisor Email: kelleyp@uncw.edu",
    "Made available in DSpace on 2014-03-14T20:08:57Z (GMT). No. of bitstreams: 1 JohnWarrenHuntleyDissertation.pdf: 4079522 bytes, checksum: 8268135d58cdfadc914795c24389857c (MD5)   Previous issue date: 2007-03-22"
  ],
  "handle": "26647",
  "identifier_other": "etd-04052007-003103",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04052007-003103/",
  "identifier_uri": "http://hdl.handle.net/10919/26647",
  "publisher": "Virginia Tech",
  "relation_haspart": "JohnWarrenHuntleyDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "organismal interactions",
    "morphological disparity",
    "microevolution",
    "body size",
    "macroevolution",
    "climate change"
  ],
  "title": "Trends in Eukaryote Body Size in an Ecological and Evolutionary Context",
  "type": "Dissertation"
}