{
  "contributor_author": "Flora, Bethany Hope",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeemember": [
    "Burge, Penny L.",
    "Dooley, John E.",
    "Niles, Jerome A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:08:59Z",
  "date_adate": "2008-04-30",
  "date_available": "2014-03-14T20:08:59Z",
  "date_issued": "2008-03-24",
  "date_rdate": "2009-04-30",
  "date_sdate": "2008-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Professional Lives of Higher Education Center Administrators  Bethany H. Flora  ABSTRACT   In instances where many universities offer off-campus programs in a single locale, a supplier network exists. These supplier networks, or higher education centers (HECs) are beneficial to students and regions where the programs are delivered (Baus, 2007; Peterson, 2007). Few empirical studies have focused on consortium educational environments, such as HECs and most studies of off-campus education have taken an outsider-looking-in approach.  One window into the world of HECs is to examine the professional lives of administrators who work in the HEC environment. Professional life can be explored by eliciting data about work, relationships and rewards (Hirt, 2006; Hirt et al., 2006; Hirt et al., 2004).The purpose of this case study was to examine the professional lives of administrators who work at a HEC.  Data collection included engaging the participants in four exercises where they created social artifacts. Diagrams, graphs, concept maps and drawings are complementary additions to the traditional interview and encourage contributions from interviewees that might not otherwise be obtained (Crilly, Blackwell, & Clarkson, 2006; Enger, 1998). Data from the social artifacts were used to customize the semi-structured interview protocol.  Findings indicate that those who work at HECs define their work, in large part, by those who benefit from that work: students, communities, and member institutions. The organizational dynamics that drive the work of HEC administrators are competition, collaboration and balance. HEC professionals view their primary role as being the face of their institution or the Center in the local community. They describe their work as a culminating experience that is both rewarding and challenging. At the core of this work are the relationships that HEC professionals establish and sustain with others. These relationships are defined by resource coordination, advocacy, and appreciation. Findings suggest that institutions would benefit from engaging in greater reciprocity with HEC professionals to include expertise reciprocity, relationship reciprocity, and resource reciprocity. In general, professional life at HECs is rich, varied, challenging, but rewarding.",
  "description_provenance": [
    "Author Email: bhflora@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: jdooley@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:59Z (GMT). No. of bitstreams: 1 FloraFinalETD.pdf: 431074 bytes, checksum: 67df9c92d332f98c4cdb93f01b5f35fe (MD5)   Previous issue date: 2008-03-24"
  ],
  "handle": "26651",
  "identifier_other": "etd-04052008-192447",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04052008-192447/",
  "identifier_uri": "http://hdl.handle.net/10919/26651",
  "publisher": "Virginia Tech",
  "relation_haspart": "FloraFinalETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "supplier network",
    "competition",
    "collaboration",
    "educational consortium",
    "higher education center",
    "higher education administration"
  ],
  "title": "The Professional Lives of Higher Education Center Administrators",
  "type": "Dissertation"
}