{
  "contributor_author": "Cummings, Janet R.",
  "contributor_committeechair": "White, Orion F. Jr.",
  "contributor_committeemember": [
    "Rees, Joseph V.",
    "Rohr, John A.",
    "Keller, Jay",
    "McSwain, Cynthia J."
  ],
  "contributor_department": "Center for Public Administration and Policy",
  "date_accessioned": "2014-03-14T20:08:59Z",
  "date_adate": "1999-05-04",
  "date_available": "2014-03-14T20:08:59Z",
  "date_issued": "1999-03-20",
  "date_rdate": "2000-05-04",
  "date_sdate": "1999-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is a case study of an agency attempting to continue to operate in terms of an outmoded paradigm, one whose foundation is based on a reference point for decision and action that does not fit the social, political and organizational conditions of postmodernity. The orientation of the study is toward public administration as political process; a political process which reflects the postmodern condition. Postmodern tendencies in culture and society are characterized by a particularly salient \"thinning\" of reality or development of hyper-reality where communication has lost the check on authenticity found in dialogue. This thinning of the macro culture exists in dialectical contradiction to more robust communities of discourse developing in enclaves in a tendency referred to as neotribalism. These dialectical tendencies lead to \"simulated politics,\" where political entrepreneurs traffic in symbols rather than deeds and substantive policy making is restrained. This development favors those who benefit from the status quo.  The Census Bureau is the focal agency. It is facing a crisis of legitimacy in its standoff with the Republican-controlled Congress over its plan to use sampling and estimation to produce a statistically adjusted apportionment count for Census 2000. The case of the Census 2000 stand-off between technocrats at the Census Bureau, supported by the Democratic Clinton administration and organizations and governmental entities that are adversely affected by census undercounts, and the Republican-dominated Congress, is an example of non-dialogic communication. It is masked by a trafficking in symbols and potentially will most likely lead to maintenance of the status quo in the form of traditional census methodology. This methodology differentially undercounts African Americans, Hispanics, American Indians and Asians, as compared to whites. Republicans compare the Census 2000 plan to use sampling to adjust the census for undercounts to the \"Hillary Health Care Model\" (a derogatory reference to the First Lady's involvement in public policy), describing it as a \"polling technique,\" while Democrats and statisticians cast the argument of Republicans as one of \"politicians trying to preserve their domain,\" and of playing \"racial politics\". The strategy of the Republican Congress appears to be to discredit the expertise of the Census Bureau and to rely on the legal process and a conservative Supreme Court to derail and nullify the plan for Census 2000, thus causing the agency to revert to the \"status quo.\" Curiously, the Census Bureau has set itself up for this potential outcome by taking a strategically counterproductive and disastrously adversarial approach to the Congress. The Census Bureau has fundamentally misperceived the contemporary cultural environment and the politics that goes with it. It no longer can represent its own position as nonpolitical, value-free science, representing truth and moral right. This lack of perspective has critically hampered the agency's ability to negotiate in a political discourse appropriate to postmodernity.  The goal of the study is to make a contribution to furthering organization-environment theory, with emphasis on the political environment. It is this aspect of organization theory generally that has most relevance to Public Administration but that has been least well developed. The dissertation is designed to conform to the traditional Inter-University Case Program (ICP) case study format. As such, the study addresses the broad issue of agency-environment relationship and the role of the public administrator within that environment. As with all ICP-type studies the research does not lead to an \"answer.\" This is especially appropriate now because in the postmodern condition there is no one answer or truth to be found by rational analysis. Rather, ideas, insights, and various conclusions are offered.",
  "description_provenance": [
    "Author Email: Jcummi11@aol.com",
    "Advisor Email: orionwhite@erols.com",
    "Made available in DSpace on 2014-03-14T20:08:59Z (GMT). No. of bitstreams: 1 disautwod.PDF: 395945 bytes, checksum: 615aefae8f1cdac5c3f1d30cb712969a (MD5)   Previous issue date: 1999-03-20"
  ],
  "handle": "26654",
  "identifier_other": "etd-040599-180816",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-040599-180816/",
  "identifier_uri": "http://hdl.handle.net/10919/26654",
  "publisher": "Virginia Tech",
  "relation_haspart": "disautwod.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Postmodern",
    "Science",
    "Paradigm"
  ],
  "title": "The Impeachment of Census 2000",
  "type": "Dissertation"
}