{
  "contributor_author": "Medearis, Dale Garner",
  "contributor_committeechair": "Nelson, Arthur C.",
  "contributor_committeemember": [
    "Beatley, Timothy",
    "Lang, Robert E.",
    "Khademian, Anne Meredith"
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:08:59Z",
  "date_adate": "2007-06-28",
  "date_available": "2014-03-14T20:08:59Z",
  "date_issued": "2007-04-02",
  "date_rdate": "2007-06-28",
  "date_sdate": "2007-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This paper addresses an apparent knowledge vacuum in the U.S. in the area of international urban environmental planning and the transfer of urban environmental planning practices.  This gap is characterized by a dearth of understanding about the process of transfer and adaptation of environmental and urban planning policies into the U.S. from overseas in general, and from Germany in particular.  Little is available or has been articulated about the conditions that support or inhibit the voluntary transfer of urban environmental policies into the U.S. and the outcomes.   Improving understanding of cross-national transfer of urban environmental policies from countries such as Germany may strengthen the testing and application of appropriate and beneficial programs to heal urban environments in the U.S. <p> \tThis dissertation concerns itself with governmental urban environmental policies, ideas and lessons which have evolved in Germany and are candidates for potential voluntary transfer into the U.S.  The intention of this dissertation is to shed light on the process of voluntary policy transfer of urban environmental and planning policies from Germany to the United States.  The specific research questions addressed in this dissertation include: 1) In the context of the voluntary transfer, is the acquisition and use of imported information a more rational or more an anarchic process?; 2) What factors enhance or limit the voluntary transfer of urban environmental planning policies from Germany to the United States?; 3) Are there identifiable effects of voluntary transfer of urban environmental planning policies from Germany to the United States?<p> \tThis dissertation concludes that voluntary transfer of German urban environmental and planning policies is a relatively anarchic process.  The search and testing of policies from Germany to the U.S. is not often conducted in purpose-driven or goal-oriented contexts. This dissertation also posits that voluntary transfer of German urban environmental and planning policies relies on determined policy entrepreneurs with cosmopolite qualities who bridge environmental and planning communities in both countries.  It also suggests that the predominant outcomes of harvesting urban environmental and planning policies are soft transfers of ideas and concepts rather than hard transfers of laws and regulations.  Finally, it is suggested that cross-national policy transfer is a â  knowledge trailâ   comprised of unstructured acquisition of information and intuitive learning characteristics, followed by almost parallel implementation, confirmation and decision processes.",
  "description_provenance": [
    "Author Email: d.medearis@comcast.net;",
    "Advisor Email: acn@vt.edu",
    "Advisor Email: tb6d@virginia.edu",
    "Advisor Email: rlang@vt.edu",
    "Advisor Email: khademian@earthlink.net",
    "Made available in DSpace on 2014-03-14T20:08:59Z (GMT). No. of bitstreams: 4 IRBForm.pdf: 142653 bytes, checksum: 52805b85a193990ae1a77c7498a45458 (MD5) MedearisDissertation2.pdf: 966944 bytes, checksum: bc19f306ef55ffd4b87ca1faca781bb4 (MD5) IRBFORM2.pdf: 454740 bytes, checksum: 4c85a9e5eb05301de74b1ba800ff46c5 (MD5) MedearisDissertation1.pdf: 45280 bytes, checksum: c8906fea577a08a085c49aed0c23a80b (MD5)   Previous issue date: 2007-04-02"
  ],
  "handle": "26650",
  "identifier_other": "etd-04052007-200323",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04052007-200323/",
  "identifier_uri": "http://hdl.handle.net/10919/26650",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "IRBForm.pdf",
    "MedearisDissertation2.pdf",
    "IRBFORM2.pdf",
    "MedearisDissertation1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Urban Planning",
    "Policy Transfer"
  ],
  "title": "Considerations Concering the Transfer of Urban Environmental and Planning Policies From Germany to the United States",
  "type": "Dissertation"
}