{
  "contributor_author": "Agca, Senay",
  "contributor_committeechair": "Chance, Donald M.",
  "contributor_committeemember": [
    "Mozumdar, Abon",
    "Kumar, Raman",
    "Day, Martin V.",
    "Billingsley, Randall S."
  ],
  "contributor_department": "Finance, Insurance, and Business Law",
  "date_accessioned": "2014-03-14T20:09:00Z",
  "date_adate": "2002-05-01",
  "date_available": "2014-03-14T20:09:00Z",
  "date_issued": "2002-03-25",
  "date_rdate": "2005-05-01",
  "date_sdate": "2002-04-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Heath-Jarrow-Morton (HJM) model represents the latest in powerful arbitrage-free technology for modeling the term structure and managing interest rate risk. Yet risk management strategies in the form of immunization portfolios using duration, convexity, and M-square are still widely used in bond portfolio management today. This study addresses the question of how traditional risk measures and immunization strategies perform when the term structure evolves in the HJM manner. Using Monte Carlo simulation, I analyze four HJM volatility structures, four initial term structure shapes, three holding periods, and two traditional immunization approaches (duration-matching and duration-and-convexity-matching). I also examine duration and convexity measures derived specifically for the HJM framework.  In addition I look at whether portfolios should be constructed randomly, by minimizing their M-squares or using barbell or bullet structures. I assess immunization performance according to three criteria. One of these criteria corresponds to active portfolio management, and the other two correspond to passive portfolio management. Under active portfolio management, an asset portfolio is successfully immunized if its holding period return is greater than or equal to the holding period return of the liability portfolio. Under passive portfolio management, the closer the returns of the asset portfolio to the returns of the liability portfolio, the better the immunization performance. The results of the study suggest that, under the active portfolio management criterion, and with the duration matching strategy, HJM and traditional duration measures have similar immunization performance when forward rate volatilities are low. There is a substantial deterioration in the immunization performance of traditional risk measures when there is high volatility. This deterioration is not observed with HJM duration measures.  These results could be due to two factors. Traditional risk measures could be poor risk measures, or the duration matching strategy is not the most appropriate immunization approach when there is high volatility because yield curve shifts would often be large. Under the active portfolio management criterion and with the duration and convexity matching strategy, the immunization performance of traditional risk measures improves considerably at the high volatility segments of the yield curve.  The improvement in the performance of the HJM risk measures is not as dramatic. The immunization performance of  traditional duration and convexity measures, however, deteriorates at the low volatility segments of the yield curve. This deterioration is not observed when HJM risk measures are used. Overall, with the duration and convexity matching strategy, the immunization performance of portfolios matched with traditional risk measures is very close to that of portfolios matched with the HJM risk measures.  This result suggests that the duration and convexity matching approach should be preferred to duration matching alone. Also the result shows that the underperformance of traditional risk measures under high volatility is not due to their being poor risk measures, but rather due to the reason that the duration matching strategy is not an appropriate immunization approach when there is high volatility in the market.  Under the passive portfolio management criteria, the performances of traditional and HJM measures are similar with the duration matching strategy. Less than 29% of the duration matched portfolios have returns within one basis point of the target yield, whereas almost all are within 100 basis points of the target yield. These results suggest that the duration matching strategy might not be sufficient to generate cash flows close to those of the target bond. The duration measure assumes a linear relation between the bond price and the yield change, and the nonlinearities that are not captured by the duration measure might be important. When the duration and convexity matching strategy is used, more than 36% of the portfolios are within one basis point of the target with HJM risk measures. This dramatic improvement in the immunization performance of HJM measures is not guaranteed for traditional risk measures. In fact, there are certain cases in which the performance of traditional risk measures deteriorates with the duration and convexity matching strategy. In this respect, choosing the correct risk measure is more important than the immunization strategy when passive portfolio management is pursued. Under active portfolio management criterion, there is no significant difference among bullet, barbell, minimum M-square, and random portfolios with both duration matching and duration and convexity matching strategies. Under the passive portfolio management criterion, bullet portfolios produce closer returns to the target for short holding periods when the duration matching strategy is used. With the duration and convexity matching strategy, bullet, barbell and minimum M-square portfolios produce closer returns to the target for short holding periods. Random portfolios perform as well as bullet, barbell and minimum M-square portfolios for medium to long holding periods. These results suggest that when the duration matching strategy is used, bullet portfolios are preferable to other portfolio formation strategies for short holding periods. When the duration and convexity matching strategy is used, no portfolio formation strategy is better than the other. Under the active portfolio management criterion, minimum M-square portfolios are successfully immunized under each yield curve shape and volatility structure considered. Under the passive portfolio management criterion, minimum M-square portfolios perform better for short holding periods, and their performance deteriorates as the holding period increases, irrespective of the volatility level. This suggests that the performance of minimum M-square portfolios is more sensitive to the holding period rather than the volatility. Therefore, minimum M-square portfolios would be preferred in the markets when there are large changes in volatility.  Overall, the results of the study suggest that, under the active portfolio management criterion and with the duration matching strategy, traditional duration measures underperform their HJM counterparts when forward rate volatilities are high. With the duration and convexity matching strategy, this underperformance is not as dramatic.  Also no particular portfolio formation strategy is better than the other under the active portfolio management criterion. Under the passive portfolio management criterion, the duration matching strategy is not sufficient to generate cash flows closer to those of the target bond. The duration and convexity matching strategy, however, leads to substantial improvement in the immunization performance of the HJM risk measures. This improvement is not guaranteed for the traditional risk measures. Under the passive portfolio management criterion, bullet portfolios are preferred to other portfolio formation strategies for short holding periods. For medium to long holding periods, however, the portfolio formation strategy does not significantly affect immunization performance. Also, the immunization performance of minimum M-square portfolios is more sensitive to the holding period rather than the volatility.",
  "description_provenance": [
    "Author Email: sagca@vt.edu",
    "Advisor Email: abon@vt.edu",
    "Advisor Email: raman@vt.edu",
    "Advisor Email: day@calvin.math.vt.edu",
    "Advisor Email: dmc@vt.edu",
    "Advisor Email: randall@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:00Z (GMT). No. of bitstreams: 1 SenayAgcaDissertation.pdf: 1573345 bytes, checksum: 5619b260b6dae02d04c3898987021cb1 (MD5)   Previous issue date: 2002-03-25"
  ],
  "handle": "26655",
  "identifier_other": "etd-04062002-025744",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04062002-025744/",
  "identifier_uri": "http://hdl.handle.net/10919/26655",
  "publisher": "Virginia Tech",
  "relation_haspart": "SenayAgcaDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Arbitrage-free Pricing",
    "Interest Rate Risk Measures",
    "Portfolio Formation Strategies",
    "Term Structure Models",
    "Immunization Strategies"
  ],
  "title": "The Performance Of Alternative Interest Rate Risk Measures And Immunization Strategies Under A Heath-Jarrow-Morton Framework",
  "type": "Dissertation"
}