{
  "contributor_author": "Schaupp , Gretchen  Lina",
  "contributor_committeechair": "Cobb, Anthony Terry",
  "contributor_committeemember": [
    "Arthur, Jeffrey B.",
    "Briner, Robert",
    "Carlson, Kevin D."
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:08:59Z",
  "date_adate": "2012-05-25",
  "date_available": "2014-03-14T20:08:59Z",
  "date_issued": "2012-03-23",
  "date_rdate": "2012-05-25",
  "date_sdate": "2012-04-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Although the psychological contract has been a popular topic in managerial research for the past twenty years, recent critiques of the research in this area point to several shortcomings. These are believed to result primarily from the overwhelming use of field studies, survey questionnaires, and other correlational procedures in the study of this construct. One particular research question that has generated mixed results involves the effect that oneâ  s underlying contract (either transactional or relational) has on individualsâ   perceptions of contract breach and feelings of violation following an employerâ  s breach. This study sought to gain insight into this question by using an experimental study design to assess the impact that exchange congruence â   or the match between the nature of the underlying contract and the nature of the breach â   has on employeesâ   perceptions of breach and feelings of violation.    An experimental design was used and data was collected from 421 subjects in six treatment groups and two control groups. The treatment groups examined the effects of withdrawal breach (without resource substitutions) and both congruent and incongruent resource substitutions in transactional and relational work contexts. Also, two control groups in which no psychological breach was induced were examined. The results of the experiment differ for the transactional and relational treatments. No significant differences in perceptions of breach or violation were found with regard to the type of breach induced among the transactional treatments. Among the relational treatments, subjects that received incongruent resource substitutions perceived significantly higher levels of breach and violation than those that received congruent substitutions. Also, among the relational treatments, levels of perceived breach were significantly higher for the incongruent substitute treatment than for the withdrawal breach treatment. Therefore, the results of this study indicate that breach perceptions and feelings of violation vary for employees depending not only on the type of contract they hold, but the type of breach that they experience. In addition, the study demonstrated that an experimental design is applicable to this literature and that it could advance our understanding of the psychological contract in ways that are not possible with cross-sectional field studies.",
  "description_provenance": [
    "Author Email: gschaupp@vt.edu",
    "Advisor Email: tcobb@vt.edu",
    "Advisor Email: jearthur@vt.edu",
    "Advisor Email: rbb25@management.bath.ac.uk",
    "Advisor Email: kevinc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:08:59Z (GMT). No. of bitstreams: 2 Schaupp_GL_D_2012_f2.pdf: 246224 bytes, checksum: decf1397a6d291b1287557a13c67a453 (MD5) Schaupp_GL_D_2012_f1.pdf: 2984196 bytes, checksum: 239ae0316d17218250d86907dc9cca09 (MD5)   Previous issue date: 2012-03-23"
  ],
  "handle": "26652",
  "identifier_other": "etd-04052012-152413",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04052012-152413/",
  "identifier_uri": "http://hdl.handle.net/10919/26652",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Schaupp_GL_D_2012_f2.pdf",
    "Schaupp_GL_D_2012_f1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "psychological contract",
    "social exchange theory",
    "substitution",
    "exchange congruence",
    "breach"
  ],
  "title": "An Experimental Study of Psychological Contract Breach: The Effects of Exchange Congruence in the Employer - Employee Relationship",
  "type": "Dissertation"
}