{
  "contributor_author": "Arnett, Natalie Yolanda",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Riffle, Judy S.",
    "Moore, Robert B.",
    "Dillard, John G.",
    "Harrison, William"
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:09:01Z",
  "date_adate": "2009-05-08",
  "date_available": "2014-03-14T20:09:01Z",
  "date_issued": "2009-03-26",
  "date_rdate": "2012-03-27",
  "date_sdate": "2009-04-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The results described in this dissertation focus on the synthesis and utilization of several disulfonated poly(arylene ether) random copolymer membranes in fuel cell and reverse osmosis applications.  Poly(arylene ether)s were prepared by direct step copolymerization using a third monomer 3,3â  -disulfonated 4,4â  -dichlorodiphenylsulfone.  The membrane properties of a 4,4â  -biphenol-based disulfonated poly (arylene ether sulfone) random copolymer (BPS-35), optionally blended with various fluorine containing polymers or unsulfonated biphenol-based poly (arylene ether sulfone)s (Radel R) were investigated for fuel cell applications.  Fluorine containing copolymers used included with 2,2â  -hexafluoroisopropylidene 4,4â  -biphenol based unsulfonated (6F-00) or disulfonated (6FS-35 and 6FS-60) PAES,  hexafluoroisopropylidene biphenol based 4,4â  -difluoro phenyl phosphine oxide) (6FPPO), and poly(vinylidene fluoride) (KynarÂ®). Tapping mode atomic force microscopy (TM-AFM) images of the membranes with 10 wt% of fluorinated copolymers showed macroscopic phase separation.  Good miscibility between the copolymers at low concentrations was also confirmed by the observation of only one glass transition temperature. Compared to the benchmark Nafion 1135, the 10wt% blends of the fluorinated copolymers afforded a considerable reduction in the methanol permeabilities, which is important for direct methanol fuel cells (DMFC).  The best DMFC performance with 0.5 M methanol fuel was illustrated with blends containing 10 wt% 6FS-00.  At higher methanol concentrations (up to 2.0 M) BPS-35/6FS-00 (90/10) membranes outperformed both Nafion membranes.  <p> Blends of BPS-35 blends with 6FS-35 or Radel R were also used as RO membranes.  The highest salt rejections of 97.2 and 98.0% were obtained from BPS35/Radel R (90:10) and BPS-35/6FS-35 (95:5) blends, respectively in the salt form. <p>  A systematic study of the preparation of BPS-20 random copolymer skin-core asymmetric membranes by diffusion induced phase separation (DIPS) from various polar aprotic solvent or cosolvent systems is reported.   The best aprotic solvents to generate an asymmetric structure were NMP and DMAc whereas tetrahydrofuran (THF)/ formamide (FAm) (80/20 v/v) mixtures proved to be the best co-solvent systems.   Acetone was the best non-solvent to prepare asymmetric membranes from both aprotic solvents and co-solvent mixtures.  Overall, asymmetric membranes prepared from THF/FAm co-solvent mixtures illustrated the most stable phase separated morphology that was free of macrovoids.  However, thicker skins (~5 Âµm) were formed due to the high volatility of THF.  Therefore, ultra-thin skin thin film composites (TFC) based on BPS-20 in diethylene glycol (Di(EG) were prepared.  Thermal treatment of these TFC was conducted at 90 oC and the addition of 20 wt% glycerin to the casting formulation helped to prevent pore collapse in the porous Udel polysulfone.  A minimum of three coats was required to obtain a dense, smooth, and pinhole free skin layer. The generation of three dimensional (ternary) solubility parameter phase diagrams based on experimental data was formulated and a region of solubility based on the solubility parameters of the aprotic solvents and the different co-solvent systems was established for BPS-20.",
  "description_provenance": [
    "Author Email: narnett@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: rbmoore3@vt.edu",
    "Advisor Email: john.dillard@vt.edu",
    "Advisor Email: wharrison@nanosonic.com",
    "Advisor Email: jmcgrath@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:01Z (GMT). No. of bitstreams: 1 NatalieYArnettDisseratationMay72009.pdf: 7069026 bytes, checksum: e7f09d5475922607eb1923210c1852ae (MD5)   Previous issue date: 2009-03-26"
  ],
  "handle": "26662",
  "identifier_other": "etd-04062009-220556",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04062009-220556/",
  "identifier_uri": "http://hdl.handle.net/10919/26662",
  "publisher": "Virginia Tech",
  "relation_haspart": "NatalieYArnettDisseratationMay72009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fuel cell",
    "reverse osmosis",
    "disulfonated copolymers",
    "phase diagrams",
    "copolymer blends",
    "diffusion induced phase separation (DIPS)",
    "asymmetric membranes",
    "proton exchange membrane",
    "thin film composites",
    "poly(arylene ether sulfone)",
    "random",
    "morphology"
  ],
  "title": "SYNTHESIS AND CHARACTERIZATION OF DISULFONATED POLY(ARYLENE ETHER SULFONE) RANDOM COPOLYMERS AS MULTIPURPOSE MEMBRANES FOR REVERSE OSMOSIS AND FUEL CELL APPLICATIONS",
  "type": "Dissertation"
}