{
  "contributor_author": "Kavlock, Katherine Dulaney",
  "contributor_committeechair": "Goldstein, Aaron S.",
  "contributor_committeemember": [
    "Vlachos, Pavlos P.",
    "Love, Brian J.",
    "Lee, Yong Woo",
    "Huckle, William R."
  ],
  "contributor_department": "Biomedical Engineering",
  "date_accessioned": "2014-03-14T20:09:01Z",
  "date_adate": "2009-04-30",
  "date_available": "2014-03-14T20:09:01Z",
  "date_issued": "2009-03-27",
  "date_rdate": "2009-04-30",
  "date_sdate": "2009-04-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Bone is the second most transplanted tissue after blood and the need for bone graft materials continues to rise at an average annual growth rate of over 18%.  An engineered bone substitute consisting of a bone-like extracellular matrix deposited on the internal pores of a resorbable biomaterial scaffold is postulated to stimulate normal bone remodeling when implanted in vivo.  Part one of this engineering strategy, the deposition of bone-like extracellular matrix, can be achieved by the directed differentiation of progenitor cells such as bone marrow stromal cells (BMSCs).  Part two of the engineering strategy, the biomaterial scaffold, can be fabricated with the appropriate mechanical properties using a synthetic polymer system with tunable properties like polyurethanes.  Finally, BMSCs seeded within the biomaterial scaffold can be cultured in a perfusion flow bioreactor to stimulate osteoblastic differentiation and the deposition of bioactive factors.  Using the three-part engineering strategy described, I hypothesize that the extracellular matrix produced by BMSCs can be modulated by two stimuli: the stiffness of the scaffold and perfusion flow.  First, I propose that culturing BMSCs on polyurethane scaffolds with increasing stiffness will increase markers of osteoblastic differentiation.  Secondly, I suggest that mechanically stimulating BMSCs with novel perfusion strategies will also increase markers of osteoblastic differentiation. In aim 1, a family of segmented degradable poly(esterurethane urea)s (PEUURs) were synthesized.  The modulus of the PEUUR materials was systematically increased from 0.18 to 0.80 MPa by systematically increasing the molecular weight of the poly(ε-caprolactone) (PCL) soft segment from 1425 to 2700 Da.  BMSCs were cultured on both rigid polymer films and on porous foam scaffolds to dissociate the effect of variation in polymer chemistry from the effect of scaffold modulus on cell phenotype.  These studies demonstrated changes in osteoblastic differentiation as measured by prostaglandin E2 production, alkaline phosphatase activity (ALP) activity, and osteopontin gene expression.  However, the increased levels of these phenotypic markers on the PCL 2700 material could not be attributed to scaffold chemistry or modulus.  Instead, the differences may be related to polymer crystallinity or surface topography. In aim 2, novel dynamic perfusion strategies were used to investigate the influence of frequency on osteoblastic differentiation.  BMSCs were seeded on porous foam scaffolds and exposed to both steady perfusion and pulsatile perfusion at 0.017, 0.050, and 0.083 Hz frequencies.  The data presented here demonstrated that while some markers of osteoblastic phenotype such as ALP activity are enhanced by 0.05 Hz pulsatile flow over continuous flow, they are insensitive to frequency at low frequencies.  Therefore, future studies will continue to investigate the effect of a larger range of frequencies. Additionally, fluid flow has also been shown to stimulate the deposition of bioactive factors such as BMP-2 and VEGF-A, and these growth factors are known to significantly enhance healing in bone defect models.  Therefore, we plan to investigate the effect of dynamic flow strategies on the deposition of these bioactive factors. We propose that an engineered bone graft material containing a bone-like extracellular matrix and producing these growth factors will show more rapid formation of bone when implanted in vivo.",
  "description_provenance": [
    "Author Email: kate_kavlock@vt.edu",
    "Advisor Email: pvlachos@vt.edu",
    "Advisor Email: bjlove@umich.edu",
    "Advisor Email: ywlee@vt.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: goldst@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:01Z (GMT). No. of bitstreams: 1 Kavlock_Dissertation_revised.pdf: 1926486 bytes, checksum: 9b4ae4fa50536d42c2935c8eeda60280 (MD5)   Previous issue date: 2009-03-27"
  ],
  "handle": "26660",
  "identifier_other": "etd-04062009-125328",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04062009-125328/",
  "identifier_uri": "http://hdl.handle.net/10919/26660",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kavlock_Dissertation_revised.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Perfusion",
    "Polyurethane",
    "Bone Marrow Stromal Cells",
    "Osteoblastic Differentiation"
  ],
  "title": "Effect of Mechanical Environment on the Differentiation of Bone Marrow Stromal Cells for Functional Bone Tissue Engineering",
  "type": "Dissertation"
}