{
  "contributor_author": "Griffin, Robert Paul",
  "contributor_committeechair": "Wolf, James F.",
  "contributor_committeemember": [
    "Khademian, Anne Meredith",
    "Dull, Matthew Martin",
    "Dudley, Larkin S."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:09:01Z",
  "date_adate": "2010-04-21",
  "date_available": "2014-03-14T20:09:01Z",
  "date_issued": "2010-03-30",
  "date_rdate": "2010-04-21",
  "date_sdate": "2010-04-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "At its heart, homeland security is a challenge of coordination;(Kettl 2003; Kettl 2004; Waugh and Tierney 2007) however, coordination is an ambiguous term that is difficult to define or measure (Selznick 1984).  To build a coordinated homeland security system, the federal government has introduced a number of policy changes including introduction of the Urban Area Security Area Initiative (UASI). (DHS, 2007)  Given that over 80% of the nationâ  s population lives in metropolitan urban regions, (Bureau 2008) homeland security threat, risk, and funding is weighed heavily towards protecting these areas.  UASI provides funding to high risk/high population urban areas and is designed to build coordinated regional metropolitan homeland security systems.   To meet UASI funding requirements, the nationâ  s largest and most vulnerable metropolitan areas have formed regional homeland security networks.  While the National Capital Region (NCR) UASI is representative of the challenges other areas face, the nature of metropolitan regionalism and distilled federalism creates complexity few other homeland security networks face.  Policy and service delivery co-exist at the operational/technical levels of the sub-network and better understanding how agencies, functions, and nodes coordinate is important to shaping future homeland security policies.   This research studies how one functional node of the regional metropolitan homeland security network, the NCR fire service, coordinates its UASI funding requests throughout the Fiscal Year (FY) 2008 grant cycle.  Examining the historical context of regional coordination and formal structures and informal elements the research identified nine characteristics of coordination as it is practiced at the operational/technical level of the network.  These characteristics include elements such as standardized national policy direction, leadership, organizational commitment, trusted relationships, shared purpose, political support, time, balance of formal and informal elements, and balance between operational and administrative responsibilities. The research builds on Kettlâ  s concept of contingent coordination by describing how the practice of coordination occurs within the homeland security network and begins to expand our understanding of how we organize, integrate, and coordinate a national model.  The research also provides important insight into the translation of policy to operations by describing how technical subject matter experts coordinate both operationally and administratively within the homeland security network.",
  "description_provenance": [
    "Author Email: rogriffi@vt.edu",
    "Advisor Email: akhademien@vt.edu",
    "Advisor Email: mdull@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: JFWolf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:01Z (GMT). No. of bitstreams: 3 Griffin_RP_D_2010.pdf: 2901257 bytes, checksum: 70eaf8505c4af8c53c5c58523c66a07a (MD5) Griffin_IRBapproval_letter[1].pdf: 253890 bytes, checksum: 3f24861d2d2859d1280cefb6276f38c1 (MD5) Griffin_RP_ETDform.pdf: 989305 bytes, checksum: 902f607fcdff73cb05d3fb9318d29d2c (MD5)   Previous issue date: 2010-03-30"
  ],
  "handle": "26663",
  "identifier_other": "etd-04062010-073933",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04062010-073933/",
  "identifier_uri": "http://hdl.handle.net/10919/26663",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Griffin_RP_D_2010.pdf",
    "Griffin_IRBapproval_letter[1].pdf",
    "Griffin_RP_ETDform.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Homeland Security",
    "Coordination",
    "Networks",
    "Metropolitan Government",
    "Regional Government",
    "Fire Service"
  ],
  "title": "Characteristics of the National Capital Region Homeland Security Network: A Case Study of the Practice of Coordination at the Regional Metropolitan Level.",
  "type": "Dissertation"
}