{
  "contributor_author": "Arnold, Kristy Michelle",
  "contributor_committeechair": "Day-Vines, Norma L.",
  "contributor_committeemember": [
    "Hein, Serge F.",
    "Bodenhorn, Nancy E.",
    "Brand, Brenda R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:01Z",
  "date_adate": "2010-05-06",
  "date_available": "2014-03-14T20:09:01Z",
  "date_issued": "2010-03-25",
  "date_rdate": "2010-05-06",
  "date_sdate": "2010-04-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Although many counselors consider themselves to be culturally aware, research has shown that deliberately and respectfully addressing race, culture, and ethnicity창  particularly with clients of color창  does not occur as consistently as it should, despite empirical evidence which documents that discussions about how racial and cultural factors shape the client창  s presenting problem contribute to favorable counseling outcomes. This exploratory study used a qualitative method to examine professional African American counselors창   experiences of discussing racial, ethnic, and cultural issues with their culturally diverse clients. Critical race theory functioned as the research paradigm that guided this study. As a result, this study produced seven categories and four subcategories that explored the influences, thoughts, and understandings that came to bear on their efforts to discuss race, ethnicity, and culture with clients of color. Participants found that candid discussions about racial and cultural matters, in combination with a willingness to explore counselor-client differences, greatly enhanced the therapeutic rapport with clients. Furthermore, participants provided suggestions for graduate counseling programs to improve their multicultural curriculum, and they discussed the importance of counselors exercising multicultural competency both within and outside of clinical sessions. Essentially, this study examined the strategies that African American counselors use to explore cultural dynamics with clients of color. Implications for the counseling field are also recommended based on the findings.",
  "description_provenance": [
    "Author Email: kmarnold@vt.edu",
    "Advisor Email: shein@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: bbrand@vt.edu",
    "Advisor Email: ndayvine@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:01Z (GMT). No. of bitstreams: 1 Arnold_KMA_D_2010.pdf: 1305698 bytes, checksum: 97d61079f0de795c211bc84f940ea852 (MD5)   Previous issue date: 2010-03-25"
  ],
  "handle": "26667",
  "identifier_other": "etd-04062010-181936",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04062010-181936/",
  "identifier_uri": "http://hdl.handle.net/10919/26667",
  "publisher": "Virginia Tech",
  "relation_haspart": "Arnold_KMA_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "clients of color",
    "cultural",
    "racial"
  ],
  "title": "A Qualitative Examination of African American Counselors' Experiences of Addressing Issues of Race, Ethnicity, and Culture with Clients Of Color",
  "type": "Dissertation"
}