{
  "contributor_author": "Svedberg, Mary Kathryn",
  "contributor_committeecochair": [
    "Belli, Gabriella M.",
    "Klunk, Clare D."
  ],
  "contributor_committeemember": [
    "Combs, Letitia A.",
    "Renard, Paul D.",
    "Boyle, Jon"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:01Z",
  "date_adate": "2010-04-23",
  "date_available": "2014-03-14T20:09:01Z",
  "date_issued": "2010-03-31",
  "date_rdate": "2010-04-23",
  "date_sdate": "2010-04-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "SELF-DIRECTED LEARNING AND PERSISTENCE IN ONLINE ASYNCHRONOUS PROGRAMS  Mary Kay Svedberg  ABSTRACT  The retention literature concerning online education suggests a dropout crisis among most institutions offering online courses and programs.  Despite the fact that online courses and programs are making it easier than ever before for students to have access to college education, students are dropping out of online classes at a much faster pace than the traditional brick and mortar or on-ground classes.  It would benefit these institutions to understand why students are not finishing their courses in an effort to improve persistence and therefore retention in online education.  Furthermore, to increase program retention in online education, it is important to determine what factors are related to course completion and non-completion so that at-risk students can be identified and offered support services.  The characteristic of self-direction is an important concept in understanding student readiness for online education.   The purpose of this study was to analyze the difference in self-direction, as measured by the Oddi Continuing Learning Inventory (OCLI), between students who persist and those who donâ  t persist in an undergraduate online asynchronous program.  The data were gathered from undergraduate students at a four-year baccalaureate degree-granting college that has both an online campus and on-ground campuses across the United States.   Although self-directed learning as measured by the total score on the OCLI was not statistically significant, the foundation was laid in this study for important future research.  GPA and how the student connects to the internet from home were statistically significant.  Further research is needed to ascertain (1) whether self-direction is in fact related to persistence in online programs and (2) what other variables are related to student persistence.  Institutions may be able to implement some mechanisms within the online course with the intention of increasing student persistence and therefore retention in asynchronous online programs.",
  "description_provenance": [
    "Author Email: mksvedberg@comcast.net",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: prenard@vt.edu",
    "Advisor Email: cdklunk@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:01Z (GMT). No. of bitstreams: 1 Svedberg_MK_D_2010.pdf: 1003777 bytes, checksum: 1b06efb00910e0c729b2c475dacf634e (MD5)   Previous issue date: 2010-03-31"
  ],
  "handle": "26666",
  "identifier_other": "etd-04062010-173223",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04062010-173223/",
  "identifier_uri": "http://hdl.handle.net/10919/26666",
  "publisher": "Virginia Tech",
  "relation_haspart": "Svedberg_MK_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "distance education",
    "self-directed learning",
    "self-direction",
    "persistence",
    "online retention",
    "course completion"
  ],
  "title": "Self-Directed Learning and Persistence in Online Asynchronous Undergraduate Programs",
  "type": "Dissertation"
}