{
  "contributor_author": "Thorpe, Steven Brandon",
  "contributor_committeechair": "Santos, Webster L.",
  "contributor_committeemember": [
    "Carlier, Paul R.",
    "Tanko, James M.",
    "Kingston, David G. I."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:09:02Z",
  "date_adate": "2012-05-03",
  "date_available": "2014-03-14T20:09:02Z",
  "date_issued": "2012-03-23",
  "date_rdate": "2012-05-03",
  "date_sdate": "2012-04-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The first successful synthesis and isolation of a boronic acid was reported in 1860 by Frankland in the pursuit of novel organometallic compounds. For more than a century, further studies of boronic acids were sparsely published. Suzuki and Miyaura jumpstarted the field in 1979 with an innovative carbon-carbon bond forming reaction employing an organoboronic acid and a carbon halide under palladium catalysis. Indeed, the Nobel Prize in Chemistry was awarded to Professor Akira Suzuki, along with Professors Richard Heck and Ei-ichi Negishi, in 2010 for their important contributions in palladium-catalyzed cross-coupling chemistry. Over the last 30 years, reports on organoboron compounds have increased exponentially. This dissertation describes the authorâ  s contributions to the development of preparative methods for organoboronic acid derivatives using transition metal-catalyzed reactions of diboron reagents.  A unique â  mixedâ   diboron reagent was developed (PDIPA diboron) that contains sp2- and sp3-hybridized boron atoms, unambiguously confirmed by X-ray crystallography. PDIPA diboron is sufficiently activated internally through a dative-bonding amine to selectively transfer the sp2-hybridized boron regioselectively, in the presence of copper, to electron deficient alkenes including Î±,Î²-unsaturated ketones, esters, amides, aldehydes, and nitriles to provide the corresponding boratohomoenolates. A unique Î²,Î²-diboration of an Î±,Î²-acetylenic ketone was also discovered.  The scope of PDIPA diboron reactions was then expanded to a set of substrates with a more complex structural backbone. Allenoates are Î±,Î²,Î³-unsaturated esters with orthogonal pi systems, which pose several possible difficulties with the regioselectivity of addition, not to mention known isomerizations catalyzed by copper. However, we successfully installed the boron moiety regioselectively on the Î²-carbon of a variety of allenoates, providing a vinyl boronic ester, and also observed exclusive formation of the (Z)-isomer from racemic starting materials. The resulting vinyl boronic ester was then shown to be an excellent Suzuki-Miyaura cross-coupling partner, affording a diastereopure, trisubstituted alkene in quantitative yield.  Commercially available bis(pinacolato)diboron has shown remarkable stability towards hydrolysis and autoxidation. Using this reagent, we developed a copper- and amine-catalyzed boration protocol performed entirely in water and open to air. Using only 1 mol% copper, extraordinary activity was observed. UV-Vis, 11B NMR, and solvent kinetic isotope experiments were employed to gain insight into the mechanism, which showed the possibility of autocatalysis. Attempts to control stereoselectivity were not successful, although these results were rationalized by a dynamic catalyst structure.",
  "description_provenance": [
    "Author Email: sthorpe@vt.edu",
    "Advisor Email: santosw@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:02Z (GMT). No. of bitstreams: 2 Thorpe_SB_D_2012.pdf: 5679073 bytes, checksum: 19c5f1b61122c2abcf292f88fea74de4 (MD5) Thorpe_SB_D_2012_Copyright.pdf: 577596 bytes, checksum: 08610c06ae27dc38c7cc9df64e2dddfa (MD5)   Previous issue date: 2012-03-23"
  ],
  "handle": "26669",
  "identifier_other": "etd-04062012-171609",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04062012-171609/",
  "identifier_uri": "http://hdl.handle.net/10919/26669",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Thorpe_SB_D_2012.pdf",
    "Thorpe_SB_D_2012_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "borylation",
    "diboron reagent",
    "boronic ester",
    "conjugate addition",
    "copper catalysis"
  ],
  "title": "Activation of diboron reagents: The development of mild conditions for the synthesis of unique organoboron compounds",
  "type": "Dissertation"
}