{
  "contributor_author": "Snyder, Warren E.",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Weinstein, Stuart H.",
    "Combs, Letitia A.",
    "Morris, Linda E.",
    "Lichtman, Marilyn V."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:03Z",
  "date_adate": "2003-04-14",
  "date_available": "2014-03-14T20:09:03Z",
  "date_issued": "2003-03-26",
  "date_rdate": "2005-04-14",
  "date_sdate": "2003-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract The purpose of this qualitative case study was to better understand how the diffusion (spread) and adoption (acceptance) of SkillSoftÂ® (an e-learning product) occurred among employees of one military organization and to distill individual perceptions regarding influences that affected the process. This case study focused on the process and its challenges. Relating personal perceptions of the process and how various categories of influences (personal, organizational, technological, mandated policy, change) may have affected the process in a military organization provides a unique account that has been lacking in the literature.   \tThe results of this case study resonate with earlier research by Rogers (1983), Weinstein (1981), Sherry (1997), and Schein (1985), which found that influences (personal, organizational and technological) can have a dynamic effect on the diffusion and adoption of an innovation such as SkillSoftÂ®. The study findings revealed that interviewees preferred job related e-learning experiences which support prior research by Bonk and Wisher (2000), and research by Thomerson and Smith (1996) who found that change in the way training is delivered can have an effect on the individualâ  s willingness to adopt an e-learning program like SkillSoftÂ®.  The study augments previous findings by Berge, (1997) indicating that culture can be a barrier to the implementation of on-line learning.  The findings illuminated that awareness of the organizationâ  s environment (culture, mission, organization structure, decision-making process, communications channels, skills of employees), usersâ   requirements, as well as the productâ  s (SkillSoftÂ®) fit with individual learning styles, are key elements to be considered when implementing an e-learning product in a military setting.  Post Script With the acquisition of SMARTFORCEÂ®, SkillSoftÂ® Corporation was able to diversify its e-learning training opportunities (course library) to better meet the learning requirements of military personnel since the initiation of this case study. Currently the 2003 SkillSoftÂ® SMARTFORCEÂ® library of courses is available free of charge on-line and is enhancing the knowledge and skills of active duty, reserve military personnel and Department of Defense government civilians.",
  "description_provenance": [
    "Author Email: snyderschneider@earthlink.net",
    "Advisor Email: weinstein_stu@bah.com",
    "Advisor Email: lcombs@vt.edu",
    "Advisor Email: linda_morris11495@yahoo.com",
    "Advisor Email: marcie9@attglobal.net",
    "Advisor Email: mlichtma@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:03Z (GMT). No. of bitstreams: 10 Chapter2.pdf: 88215 bytes, checksum: 360be27c164933b1b0819962274facde (MD5) AbstractContents.pdf: 29227 bytes, checksum: 14539c41ec5d4484769d2c4061fc5626 (MD5) References.pdf: 31687 bytes, checksum: d8f761f4e4ded0d0d856b5d524f8e8c8 (MD5) Chapter3.pdf: 63201 bytes, checksum: cb7671aeca6e0ab94de48e5d2e962c17 (MD5) AppendCDEFGHIJ.pdf: 56591 bytes, checksum: 58d39004b7df7fecd40aa5bb8c75856c (MD5) Chapter4.pdf: 113477 bytes, checksum: 80bef741610ca29a331a15751d4c20f1 (MD5) AppendAB.pdf: 76066 bytes, checksum: 2df663499f636c6b214666b13984cb35 (MD5) Chapter5.pdf: 64952 bytes, checksum: db934dd281441017a303b8d86aa36240 (MD5) Chapter1.pdf: 55560 bytes, checksum: c2f249a08d7d18eba7ac2fb20e87e7b6 (MD5) VITA.pdf: 7625 bytes, checksum: c8e4099c40403c8022ba8966ee039206 (MD5)   Previous issue date: 2003-03-26"
  ],
  "handle": "26675",
  "identifier_other": "etd-04072003-193511",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072003-193511/",
  "identifier_uri": "http://hdl.handle.net/10919/26675",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter2.pdf",
    "AbstractContents.pdf",
    "References.pdf",
    "Chapter3.pdf",
    "AppendCDEFGHIJ.pdf",
    "Chapter4.pdf",
    "AppendAB.pdf",
    "Chapter5.pdf",
    "Chapter1.pdf",
    "VITA.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Distance Learning",
    "Diffusion",
    "Perceptions",
    "e-learning",
    "Adoption"
  ],
  "title": "Perceptions on the Diffusion and Adoption of SkillSoftÂ®, an e-learning program: A Case Study of a Military Organization",
  "type": "Dissertation"
}