{
  "contributor_author": "Sweeney, Anthony P.",
  "contributor_committeecochair": [
    "Fortune, Jimmie C.",
    "Hohenshil, Thomas H."
  ],
  "contributor_committeemember": [
    "Curcio, Claire Cole Vaught",
    "Talbutt, Lou",
    "Brown, Michael B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:02Z",
  "date_adate": "2000-04-11",
  "date_available": "2014-03-14T20:09:02Z",
  "date_issued": "2000-03-27",
  "date_rdate": "2001-04-11",
  "date_sdate": "2000-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Job Satisfaction Among Employee Assistance Program Professionals In the United States  Anthony P. Sweeney  Dissertation submitted to the Faculty of the Virginia Polytechnic Institute and State University in partial fulfillment of the requirements for the degree of Doctor of Philosophy In Counselor Education  Thomas H. Hohenshil, Co-Chair Jimmie C. Fortune, Co-Chair Claire Cole Vaught Lou Talbutt M. B. Brown  March 27, 2000 Blacksburg, Virginia  Keywords: Employee Assistance, EAP, Job Satisfaction, Advancement Copyright 2000, Anthony P. Sweeney Job Satisfaction Among Employee Assistance Program Professionals  In the United States Anthony P. Sweeney  (ABSTRACT)  This study was designed to examine and describe the levels of job satisfaction, the sources of job satisfaction and the relationship between the variables in a national sample of employee assistance program (EAP) professionals.  The sample for this study consisted of EAP professionals who worked full-time, and who were members of the Employee Assistance Professionals Association.\t Data were collected through mailed surveys consisting of and an Individual Information Form and the Minnesota Satisfaction Questionnaire (MSQ).  A total of 354 EAP professionals were mailed survey materials.  This mailing resulted in 211 completed returns. Overall, EAP professionals indicated that they were moderately satisfied with their jobs.  MSQ questionnaire results show that 9% of respondents scored in the very satisfied category, and 71% scored in the satisfied category.  The average MSQ total score was within the satisfied range. Demographic variables had mixed results on job satisfaction.  EAP external organization respondents were, as a group, more satisfied with their jobs than those respondents who worked in an internal EAP.  Age, gender, race of respondent, rural versus non-rural work setting and national certification/recognition had no statistically significant impact on job satisfaction.   \tSeveral recommendations and implications were drawn from the study.  These included the need for open lines of communication with regard to career advancement and company policies; gender inequity issues are seen as barriers to job satisfaction and the masters degree is seen as the logical choice for the entry level EAP professional.",
  "description_provenance": [
    "Author Email: answeene@vt.edu",
    "Advisor Email: vaughtc@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: BROWNMI@MAIL.ECU.EDU",
    "Made available in DSpace on 2014-03-14T20:09:02Z (GMT). No. of bitstreams: 2 SweeneyBody.pdf: 258558 bytes, checksum: a01e92e0d49a02b6d9599baeef9b908f (MD5) sweeneyAbstractTitle.pdf: 14272 bytes, checksum: bd84e9284db0eb47509a89e9b6369c0c (MD5)   Previous issue date: 2000-03-27"
  ],
  "handle": "26671",
  "identifier_other": "etd-04072000-12570023",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072000-12570023/",
  "identifier_uri": "http://hdl.handle.net/10919/26671",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "SweeneyBody.pdf",
    "sweeneyAbstractTitle.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "counseling",
    "advancement",
    "Employee Assistance Program",
    "job satisfation"
  ],
  "title": "Job Satisfaction of Employee Assistance Professionals in the United States",
  "type": "Dissertation"
}