{
  "contributor_author": "Smith, Paige Elizabeth",
  "contributor_committeechair": "Kleiner, Brian M.",
  "contributor_committeemember": [
    "Watford, Bevlee A.",
    "Van Aken, Eileen M.",
    "Nussbaum, Maury A.",
    "Meredith, Joe  Jr."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:03Z",
  "date_adate": "2004-04-12",
  "date_available": "2014-03-14T20:09:03Z",
  "date_issued": "2004-03-24",
  "date_rdate": "2005-04-12",
  "date_sdate": "2004-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this research was to determine how team design and project management (planning and tracking) affected planning and design performance and the people involved in the process.  A laboratory study was conducted to evaluate three factors: team design (individuals versus groups of three), project support (no project support versus manual project support versus automated project support), and the engineering design life-cycle, which includes conceptual design, preliminary design, and detailed design.  There were six observations per treatment, involving a total of 72 undergraduate engineering students.  The impact of these factors were evaluated for planning time, design cycle time, cost effectiveness, cost variance, schedule variance, mental workload, and job satisfaction.  For treatments that called for groups, group process was evaluated in addition to group workload.  The results showed groups took 61% more time to plan their projects compared to individuals (p<0.01).  Planning time was 31% longer for participants with manual support compared to those with automated project support (p<0.01).  Schedule variance (p<0.01) and cost variance (p<0.001) decreased 24% and 23%, respectively, over time during the design process.  The design cycle time was 17% longer for participants without project support compared to those with automated project support (p<0.05).  During design, groups and individuals allocated their time differently (p<0.05).  Mental workload, measured with the NASA Task Load Index (TLX), showed workload increased 16% over time (p<0.001).  In addition, the combination of design phase and project tracking support affected the TLX (p<0.01).  Job satisfaction was 5% lower at the end of the design project compared to the beginning of design (p<0.05).  From the analysis on group process, the type of project support affected the group process during planning.  Groups with manual support interacted 83% more than those with automated support (effective behaviors: p<0.01; ineffective behaviors: p<0.05).  During design, the roles individuals played within the group affected how much they contributed to the groupâ  s process (effective behaviors: p<0.0001; ineffective behaviors: p<0.01).    There were several practical implications that can be drawn from this study.  In the decision to use teams versus groups, there was evidence that groups were able to attend to more of the design requirements than individuals, which resulted in the design of systems with higher reliability.  However the tradeoff of using groups were in the labor cost and in longer planning and status report meetings.  Therefore the organizationâ  s goals need to be carefully considered before selecting the team design.  For project support, there were clear benefits to automating the planning process.  Automation resulted in better Gantt chart and planning sessions that were completed more quickly compared to those with manual support.  Furthermore, systems designed with automated support resulted in lower design costs compared to systems designed without project support.",
  "description_provenance": [
    "Author Email: pesmith@umd.edu",
    "Advisor Email: deuce@vt.edu",
    "Advisor Email: evanaken@vt.edu",
    "Advisor Email: nussbaum@vt.edu",
    "Advisor Email: joe.meredith@vtcrc.com",
    "Advisor Email: bkleiner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:03Z (GMT). No. of bitstreams: 2 Appendix.pdf: 648807 bytes, checksum: 92c1271648242d6b4f62dcb61f5fec01 (MD5) ETD.pdf: 1142832 bytes, checksum: 86be7654a4cfb55ed2b4fdf6807dab0c (MD5)   Previous issue date: 2004-03-24"
  ],
  "handle": "26677",
  "identifier_other": "etd-04072004-153724",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072004-153724/",
  "identifier_uri": "http://hdl.handle.net/10919/26677",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Appendix.pdf",
    "ETD.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Project Management",
    "Engineering Design",
    "Teams",
    "Macroergonomics"
  ],
  "title": "Tools to Improve the Process of Engineering Design:  An Analysis of Team Configuration and Project Support",
  "type": "Dissertation"
}