{
  "contributor_author": "Horcher, Andy",
  "contributor_committeechair": "Visser, J. M. Rien",
  "contributor_committeemember": [
    "Prisley, Stephen P.",
    "Shaffer, Robert M. Jr.",
    "Oderwald, Richard G.",
    "Rummer, Robert"
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:09:03Z",
  "date_adate": "2008-04-29",
  "date_available": "2014-03-14T20:09:03Z",
  "date_issued": "2008-04-03",
  "date_rdate": "2008-04-29",
  "date_sdate": "2008-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Despite its relatively high cost, helicopter yarding has become a common means of timber extraction where site sensitivity, access, or regulations limit the use of less costly alternatives.  The high costs associated with helicopter yarding, as well as the desire to expand the application of this system to extract lower value timber, increases the need for innovation to improve the operations.    The cost or benefit of a particular harvest prescription or innovative technique is commonly assessed with a time and motion study. Capturing time study data require additional personnel or an imposition on the operator to record additional information.  Onboard GPS can reduce or eliminate the need for additional personnel and/or operator input providing a rapid means of assessing and improving helicopter operations.   This research employed onboard GPS in helicopter yarding to assess the potential of developing time studies using GPS data. Three helicopter models were sampled on a total of nine sites.  Three of the sites have both experienced and inexperienced pilot data.  Hemispherical canopy images were sampled at three sites.  This complement of data permitted the following analysis:  assessment of differences between experienced and inexperienced pilots, assessment of canopy cover on hook time, and the development of production models.  The results indicate onboard GPS and the automated processing methods are suitable for creating time study data.  Specifically, in all three case studies quantitative results were obtained, analyzed and opportunities for improvement identified. The time penalty suffered from using inexperienced pilots created 64 to 94% additional turn time.  Increasing canopy cover correlated with increased hook time at two sites for the zenith angle segment 0 â   15Â°.  Regressions assessing production show distance, slope, and choker delivery to be significant. This research shows the combination of onboard GPS, the automation process, and commonly collected turn information presents a number of opportunities, enabling the assessment of a wide range of helicopter yarding conditions.",
  "description_provenance": [
    "Author Email: ahorcher@fs.fed.us",
    "Advisor Email: visser@vt.edu",
    "Advisor Email: prisley@vt.edu",
    "Advisor Email: rshaffer@vt.edu",
    "Advisor Email: oderwald@vt.edu",
    "Advisor Email: rrummer@fs.fed.us",
    "Made available in DSpace on 2014-03-14T20:09:03Z (GMT). No. of bitstreams: 1 Horcher_Final_Dissertation2.pdf: 3101831 bytes, checksum: 323a3f5cfa8720cfec3b14482ada0a21 (MD5)   Previous issue date: 2008-04-03"
  ],
  "handle": "26678",
  "identifier_other": "etd-04072008-143747",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072008-143747/",
  "identifier_uri": "http://hdl.handle.net/10919/26678",
  "publisher": "Virginia Tech",
  "relation_haspart": "Horcher_Final_Dissertation2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Helicopter Logging",
    "Helicopter Yarding",
    "GPS",
    "Time Study",
    "Canopy Cover",
    "Production Model"
  ],
  "title": "Improving Helicopter Yarding with Onboard GPS",
  "type": "Dissertation"
}