{
  "contributor_author": "Brown, Barbara B",
  "contributor_committeechair": "Wiswell, Albert W.",
  "contributor_committeemember": [
    "Combs, Letitia A.",
    "Belli, Gabriella M.",
    "Banks, George",
    "McCollum, Eric E."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:03Z",
  "date_adate": "2003-04-23",
  "date_available": "2014-03-14T20:09:03Z",
  "date_issued": "2003-03-25",
  "date_rdate": "2004-04-23",
  "date_sdate": "2003-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Employeesâ   Organizational Commitment and Their Perception of Supervisorsâ   Relations-Oriented and Task-Oriented Leadership Behaviors   by  Barbara B. Brown Albert Wiswell, Chair  (ABSTRACT)  The purpose of this research was to investigate the relationship between employeesâ   perceptions of their immediate supervisorsâ   relations-oriented and task-oriented leadership behaviors and different types of organizational commitment. Bass & Avolio's (1995) Multifactor Leadership Questionnaire (MLQ Form 5X) was used to measure relations-oriented and task-oriented leadership behaviors.  Meyer & Allenâ  s (1997) Organizational Commitment Questionnaire (OCQ) was used to measure organizational commitment. Participants in the research included 361 employees who worked for the city of Charlottesville, Virginia.  These employees were located in eight departments that varied in the area of technical functioning, size, and academic levels.   Factor analyses, with principal component extraction and varimax rotation, were performed to determine how the MLQ Form 5X items would load onto a 2-factor model of relations-oriented and task-oriented leadership behaviors.  The task-oriented items of contingent reward loaded with the relations-oriented items, and the non-leadership items of laissez-faire loaded with the task-oriented items.  These findings resulted in an arrangement of relations-oriented and task-oriented subscales that was different than the arrangement proposed by Bass & Avolio (1995).   Correlations for the MLQ Form 5X revealed multicollinearity among all the relations-oriented subscales and two of the task-oriented subscales, preventing any interpretations about the amount of variance that any particular type of relations-oriented or task-oriented leadership behavior might explain in organizational commitment.   Factor scores were used to perform regressions and investigate the amount of variance relations-oriented leadership behaviors and task-oriented leadership behaviors explained in organizational commitment.   Relations-oriented leadership behaviors explained the greatest amount of variance in affective commitment, somewhat less variance in normative commitment, and no variance in continuance commitment.   The results for task-oriented leadership behaviors revealed the same pattern of relationships with the different types of organizational commitment, only weaker.",
  "description_provenance": [
    "Author Email: Barbara@Leader-Learning.com",
    "Advisor Email: Wiswell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:03Z (GMT). No. of bitstreams: 1 BarbaraBrown-4-22-03.pdf: 311782 bytes, checksum: 52f1b45c4df284676f9a99d10a2e78d9 (MD5)   Previous issue date: 2003-03-25"
  ],
  "handle": "26676",
  "identifier_other": "etd-04072003-224349",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072003-224349/",
  "identifier_uri": "http://hdl.handle.net/10919/26676",
  "publisher": "Virginia Tech",
  "relation_haspart": "BarbaraBrown-4-22-03.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Commitment",
    "Leadership",
    "Task-Oriented",
    "Relations-Oriented"
  ],
  "title": "Employees' Organizational Commitment and Their Perceptions of Supervisors' Relations-Oriented and Task-Oriented Leadership Behaviors",
  "type": "Dissertation"
}