{
  "contributor_author": "Abaza, Hussein Fuad",
  "contributor_committeechair": "Beliveau, Yvan J.",
  "contributor_committeecochair": "Jones, James R.",
  "contributor_committeemember": [
    "Thabet, Walid",
    "Cao, Quinsan",
    "Mills, Thomas H."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:09:02Z",
  "date_adate": "2002-04-30",
  "date_available": "2014-03-14T20:09:02Z",
  "date_issued": "2002-04-22",
  "date_rdate": "2005-04-30",
  "date_sdate": "2002-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research proposes a computer evaluation model that assists architects and designers in producing buildings with low energy consumption.  The model is based on computer-designer interaction. Here, the designer suggests a range of design alternatives, and, in turn, the computer evaluation model generates a matrix of design solutions and performs various environmental simulations.  The performances of the various design solutions then analyzed by a statistical analysis package that derives relationships.  These relationships explain the impact that the different building components have on energy consumption. The relationships are represented in the form of statistical relations and interactive data charts. The evaluation model was tested and used to support new ventilation strategies for the Beliveau House in Blacksburg, Virginia.  The designer of this house implemented strategies for integrating solar radiation, thermal mass, thermal insulation, and air ventilation to conserve energy. A field study and computer simulation were conducted to monitor the actual performance of the house and to validate the evaluation model results.  Based on the evaluation model results, this research suggests new direct and indirect ventilation control strategies to reduce cooling energy and to improve comfort. The research also suggests general design guidelines to improve the energy performance of buildings and to enhance thermal comfort. These design guidelines are based on a holistic view of integrating the building components that has significant impact on buildings thermal performance.",
  "description_provenance": [
    "Author Email: habaza@vt.edu",
    "Advisor Email: jajone10@vt.edu",
    "Advisor Email: wthabet@vt.edu",
    "Advisor Email: qcao@vt.edu",
    "Advisor Email: yvan@vt.edu",
    "Advisor Email: tmills@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:02Z (GMT). No. of bitstreams: 2 appendix11.pdf: 382300 bytes, checksum: 2e753d2662f5c0a9d0df9fe5232b7fa4 (MD5) research311.pdf: 1895623 bytes, checksum: e13d986a08f98a34822d8e99d3039f1a (MD5)   Previous issue date: 2002-04-22"
  ],
  "handle": "26672",
  "identifier_other": "etd-04072002-093147",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072002-093147/",
  "identifier_uri": "http://hdl.handle.net/10919/26672",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "appendix11.pdf",
    "research311.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "integration",
    "energy consrvation",
    "building evaluation",
    "simulation",
    "dehumidification"
  ],
  "title": "A Design Framework for Integrated Design and Control Strategies in Energy Efficient Buildings",
  "type": "Dissertation"
}