{
  "contributor_author": "Otis, Jeffrey Scott",
  "contributor_committeechair": "Williams, Jay H.",
  "contributor_committeemember": [
    "Grange, Robert W.",
    "Moore, David",
    "Robertson, John L.",
    "Huckle, William R."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:09:02Z",
  "date_adate": "2003-04-09",
  "date_available": "2014-03-14T20:09:02Z",
  "date_issued": "2003-04-04",
  "date_rdate": "2006-04-09",
  "date_sdate": "2003-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Cancer cachexia is a debilitating, paraneoplastic syndrome commonly associated with late stage malignancy.  It is estimated that ~25% of cancer-related deaths are due directly to complications arising from cachexia (Barton, 2001).  Cachexia manifests as severe body wasting, primarily due to the loss of skeletal muscle mass.   This study tested the hypothesis that muscle atrophy associated with cancer cachexia could be attenuated by using a unilateral, functional overload (FO) model applied concurrently with tumor development.  To accomplish this, Morris hepatoma MH-7777 cells were implanted in adult female, Buffalo rats (n = 12) and allowed to incubate for 6 weeks.  FO surgeries (n = 12) were performed five days prior to MH-7777 cell implantation.  Over the course of six weeks, healthy, age, sex and strain-matched, vehicle-injected rats (n = 12) gained ~5% of body weight compared to tumor-bearing rats that lost ~6% of body weight when adjusted for tumor mass.  Tumor-bearing animals experienced significant atrophy to gastrocnemius, tibialis anterior, extensor digitorum longus, plantaris and diaphragm muscles.  FO successfully reversed plantaris muscle atrophy in cachectic, tumor-bearing rats (n=5).  FO plantaris masses were ~24% larger than contralateral controls.  However, this hypertrophic response was not as great as FO plantaris muscles from healthy, sham-operated controls (~44% larger than contralateral controls, n=5).  FO plantaris muscles from tumor-bearing rats had ~1.5 fold increase in myonuclei/fiber ratios compared those of sham-operated, tumor-bearing controls (n = 6).  Therefore, cancer cachexia did not prevent myonuclear accretion necessary for skeletal muscle hypertrophy. Little data exists on adaptations to myosin heavy chain (MHC) isoforms in cachectic skeletal muscle.  Plantaris muscles from tumor-bearing rats displayed decreased percentages of MHC type I compared to plantaris muscles from vehicle-injected controls (7% vs. 3%, respectively).  However, FO plantaris muscles from tumor-bearing rats had an increased percentage of MHC type I and decreased percentage of MHC type IIb compared to sham-operated tumor-bearing rats, adaptations commonly seen in trained muscles.  Therefore, cancer cachexia did not prevent the capability of skeletal muscle to respond normally to hypertrophic stimuli.   This study also attempted to characterize a mechanism responsible for the hypertrophic response, increased myonuclei/fiber ratio and transition toward a slower MHC profile in FO plantaris muscles from tumor-bearing rats.  Recently, the Ca2+/calmodulin-dependent protein phosphatase, calcineurin, has been suggested as a critical factor regulating skeletal muscle growth and fiber-type dependent gene expression (Chin, 1998; Wu, 2000; Olson, 2000; Otis, 2001).  The protein content of the catalytic subunit (CaNa) and the regulatory subunit (CaNb) of calcineurin were unchanged in plantaris muscles from tumor-bearing animals compared to healthy controls.  Furthermore, total and specific (normalized to CaNa protein content) calcineurin phosphatase activity were not altered in any group.  Therefore, calcineurin activity did not appear to be associated with the regulation of the morphological and physiological response of hypertrophying plantaris muscles in cachectic, tumor-bearing rats.  Overall, this study indicated that atrophied plantaris muscles from tumor-bearing animals have a reduced capacity to hypertrophy potentially due to a decreased myonuclei/fiber ratio.  Furthermore, it is unlikely that changes to mass and MHC isoform expression are associated with calcineurin phosphatase activity.",
  "description_provenance": [
    "Author Email: otis@vt.edu",
    "Advisor Email: rgrange@vt.edu",
    "Advisor Email: jhwms@vt.edu",
    "Advisor Email: moored@vt.edu",
    "Advisor Email: drbob@vt.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:02Z (GMT). No. of bitstreams: 1 JSOtis.pdf: 1029227 bytes, checksum: fd2758d6239274938821055551307c28 (MD5)   Previous issue date: 2003-04-04"
  ],
  "handle": "26673",
  "identifier_other": "etd-04072003-132702",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072003-132702/",
  "identifier_uri": "http://hdl.handle.net/10919/26673",
  "publisher": "Virginia Tech",
  "relation_haspart": "JSOtis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cancer cachexia",
    "calcineurin",
    "myosin heavy chain",
    "skeletal muscle"
  ],
  "title": "Skeletal muscle adaptations in cachectic, tumor-bearing rats",
  "type": "Dissertation"
}