{
  "contributor_author": "Johnson, Kayenda Tenise",
  "contributor_committeechair": "Smith-Jackson, Tonya L.",
  "contributor_committeemember": [
    "Klein, Bradley G.",
    "Scales, Glenda Rose",
    "Babski-Reeves, Kari L.",
    "Pérez-Quiñones, Manuel A."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:04Z",
  "date_adate": "2008-04-30",
  "date_available": "2014-03-14T20:09:04Z",
  "date_issued": "2008-03-24",
  "date_rdate": "2009-04-30",
  "date_sdate": "2008-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research addresses a problem that centers on the persistent disparities in computer use and access among racial minorities, particularly African-Americans and Latinos, and persons of low socio-economic status (SES) here in the USA.  â  Accessâ   to computer technology maintains a dual meaning.  Access may refer to having a computer and software available for use or it may refer to having a computer interface that effectively facilitates user learning.  This study conceptualizes â  accessâ   as the latter â   having an interface that facilitates user learning.  One intervention for this problem of access, from a Human Factors perspective, is in recognizing and accounting for cultureâ  s influence on oneâ  s cognition.  Both qualitative and quantitative approaches were integrated to effectively determine a process for engaging typically marginalized groups, interface metaphor preferences of African-Americans, and user performance with varying types of interface metaphors.  The qualitative aspects of this study provided a basis for understanding how entry was obtained into the participantsâ   community and for obtaining richer descriptions of user successes and challenges with the various interface designs.    The researcher developed a culturally valid interface design methodology, i.e., Acculturalization Interface Design (A.I.D.) methodology, which was used to identify meaningful computer interface metaphors for low SES African-Americans. Through the A.I.D. methodology and an associated field study, a group of African-American novice computer users determined that the home, the bedroom and comfort were meaningful computer interface metaphors to integrate into a letter writing task.  A separate group of African-Americans performed benchmark tasks on an interface design that utilized the home, bedroom and comfort metaphors or Microsoft Word 2003.  The African-American group performed significantly better on the novel interface than on Microsoft Word 2003 for several benchmark tasks.  Qualitative analyses showed that low acculturation African-Americans were particularly challenged with those same tasks.  Regression analyses used to determine the relationship between psychosocial characteristics and user performance were inconclusive.      Subject matter experts (SME), representing low SES Latinos, discussed potential learnability issues for both interface designs.  Furthermore, results from the African-American group and the SMEs highlight the critical importance of using terminology (i.e., verbal metaphors) and pictorial metaphors that are culturally and socially valid.",
  "description_provenance": [
    "Author Email: kajohns5@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: gscales@vt.edu",
    "Advisor Email: kari@ise.msstate.edu",
    "Advisor Email: mperezqu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:04Z (GMT). No. of bitstreams: 1 KTJ_ETD.pdf: 1851317 bytes, checksum: 49520907990c17743d466ecaaf16fa5c (MD5)   Previous issue date: 2008-03-24"
  ],
  "handle": "26682",
  "identifier_other": "etd-04072008-235903",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072008-235903/",
  "identifier_uri": "http://hdl.handle.net/10919/26682",
  "publisher": "Virginia Tech",
  "relation_haspart": "KTJ_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Human-Computer Interaction",
    "Computer Interface Metaphors",
    "Culture and Interface Design",
    "Interface Design Methodology"
  ],
  "title": "Process, Preference and Performance: Considering Ethnicity and Socio-Economic Status in Computer Interface Metaphor Design",
  "type": "Dissertation"
}