{
  "contributor_author": "Powell, Jimmy Lee",
  "contributor_committeechair": "Morris, Linda E.",
  "contributor_committeemember": [
    "Laker, Dennis R.",
    "Klunk, Clare D.",
    "Broad, Mary L.",
    "Boucouvalas, Marcie"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:04Z",
  "date_adate": "2009-05-04",
  "date_available": "2014-03-14T20:09:04Z",
  "date_issued": "2009-02-27",
  "date_rdate": "2009-05-04",
  "date_sdate": "2009-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Allocating money and resources to improve employeesâ   performance can be costly.  The 2008 Industry Report of ASTD (formerly the American Society for Training and Development) showed that U.S. organizations spent $134.39 billion on employee learning and performance.  Because learning and development are expensive, time consuming and often disruptive for workflow, training professionals need to show credible and sustainable methods for proving the value of their training programs.    This research study examines the effects of employeesâ   perceptions of transfer intentions, General Self-efficacy (GSE) and supervisor support to better identify the conditions for actual transfer.  An increased understanding of the conditions of transfer provided a new perspective for a county government agency.  Data were collected immediately after training and later in the work environment from 36 subjects who participated in a three-day Employee Leadership Institute (ELI) in December 2007.  The study built upon and extended existing data collected in December 2006, March 2007, and September 2007.  The data analysis approach consisted of Chi-square computation, Analysis of Variance (ANOVA), bivariate correlation and hierarchical regression analysis.  SPSS was used to conduct the data analysis.  The results suggest that General Self-efficacy (GSE) was the most important influence on transfer intentions up to six months after ELI.  Then, transfer intentions was a better predictor than supervisor support and GSE to significantly influence the actual initiation of skills on the job obtained from ELI at six, nine months and one year.  Once employees actually attempted to apply skills on the job, transfer intentions was a better predictor at six months for maintaining those skills over time (transfer maintenance); however, transfer initiation was a better predictor at nine months and one year.  Due to a small sample size and self-reported data, the study results should be interpreted with some caution.",
  "description_provenance": [
    "Author Email: jipowell@vt.edu",
    "Advisor Email: drlaker@mail.widener.edu",
    "Advisor Email: cdklunk@vt.edu",
    "Advisor Email: marybroad@verizon.net",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: linda_morris11495@yahoo.com",
    "Made available in DSpace on 2014-03-14T20:09:04Z (GMT). No. of bitstreams: 1 DissertationETD.pdf: 525390 bytes, checksum: 64f84c6e60107f5f5c6616fce50b0267 (MD5)   Previous issue date: 2009-02-27"
  ],
  "handle": "26684",
  "identifier_other": "etd-04072009-114726",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072009-114726/",
  "identifier_uri": "http://hdl.handle.net/10919/26684",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "transfer",
    "initiation and maintenance",
    "training",
    "supervisor support",
    "general self-efficacy",
    "transfer intentions"
  ],
  "title": "Transfer Initiation and Maintenance of Training: Employeesâ   Perception of the Relative Influences of Transfer Intentions, General Self-efficacy (GSE) and Supervisor Support.",
  "type": "Dissertation"
}