{
  "contributor_author": "Montague, Enid Nicole Headen",
  "contributor_committeecochair": [
    "Kleiner, Brian M.",
    "Winchester, Woodrow W. III"
  ],
  "contributor_committeemember": [
    "Hausman, Bernice L.",
    "Smith-Jackson, Tonya L."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:04Z",
  "date_adate": "2008-04-22",
  "date_available": "2014-03-14T20:09:04Z",
  "date_issued": "2008-03-25",
  "date_rdate": "2009-04-22",
  "date_sdate": "2008-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Understanding how patients and operators trust medical technology will provide insight into the role, implementation and use of technology in health systems. Models developed in aviation and manufacturing that predict operatorsâ   trust or distrust in technology (Biros, 2004; Jian, Bisantz, Drury, & Llinas, 1998; Lee & See, 2004; Muir & Moray, 1996; Parasuraman, 1997) may not be applicable to medical technology and health systems. The first objective of this research was to empirically define the construct trust in medical technology by differentiating it from trust in technology and providing a model of itâ  s factors. The second objective of this research was to generate a theory of how patients and health care providers construct trust in medial technology in an applied context. The third objective of this research was to develop and validate an instrument to measure patientsâ   trust in medical technology. The results of these combined studies identified 30 factors of trust in medical technology and provided evidence to support the hypothesis that trust in technology and trust in medical technology are different constructs. A grounded theory was developed that shows that patientsâ   trust in medical technology is based on a combination of characteristics from the technology, providers and how the providers use the technology, while physiciansâ   trust is constructed from the trustworthiness of the system and trust in their own abilities. An 80 item instrument for measuring trust in medical technology was developed and validated. Recommendations for the design of obstetric work systems are discussed.",
  "description_provenance": [
    "Author Email: enid.nicole@vt.edu",
    "Advisor Email: bhausman@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: wwwinche@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:04Z (GMT). No. of bitstreams: 2 02_Body_revised.pdf: 3417033 bytes, checksum: 5b19048c09bf838dbab63c35eee7a319 (MD5) 01Abstractrevised.pdf: 111405 bytes, checksum: 76e9fecbf335537c3c4aa617052bd46a (MD5)   Previous issue date: 2008-03-25"
  ],
  "handle": "26680",
  "identifier_other": "etd-04072008-233305",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072008-233305/",
  "identifier_uri": "http://hdl.handle.net/10919/26680",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "02_Body_revised.pdf",
    "01Abstractrevised.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Trust",
    "Technology",
    "Instrument Development",
    "Human Factors",
    "Obstetrics",
    "Automation",
    "Health Care",
    "Medical"
  ],
  "title": "Understanding Trust in Medical Technology: Using the Example of Obstetrics",
  "type": "Dissertation"
}