{
  "contributor_author": "Newswander, Lynita Kay",
  "contributor_committeechair": "Luke, Timothy W.",
  "contributor_committeemember": [
    "Thadhani, Rupa G.",
    "La Berge, Ann F.",
    "Borrego, Maura Jenkins"
  ],
  "contributor_department": "Planning, Governance, and Globalization",
  "date_accessioned": "2014-03-14T20:09:04Z",
  "date_adate": "2009-05-21",
  "date_available": "2014-03-14T20:09:04Z",
  "date_issued": "2009-04-01",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation offers an analysis of two American religionsâ  the Church of Christ, Scientist (CS), and the Church of Jesus Christ of Latter-day Saints (LDS)â  and the ways that their particular/peculiar ideologies regarding the body govern the everyday realities of their respective memberships. Biopower is the political power used to control bodies and bodily actions, such as the care of oneself, and the details of personal family life.  Belief can act as an especially powerful agent of biopolitical power as it inspires a lived faithfulness through its various theologies.  What is more, the effects of biopolitical belief are often complicated by the mixed interests of Church and State, leaving the territory of the individual body a disputed claim.  <p> To better understand these disputes, this project utilizes a Foucaultian interpretation of the CS and LDS churches to better understand the roots of the biopolitical conflicts they confront.  Specifically, the histories and contemporary practices of these religious organizations are analyzed through a genealogical method, using Foucaultian interpretations of the biopolitical, pastoral, and psychiatric powers they use to effectively govern the minds, bodies, and spirits of their people.  A historical background of the CS and LDS churches traces the emergence of the biopolitical practices of each group by evaluating their groundedness in their current social-political milieus, and by making connections between their respective religious beliefs, practices, and government and the broader Jacksonian American political culture into which they were born.  Additionally, this particular form of analysis poses important questions for the study of religion and politics today.  Although most of the examples used in this study are historical, both the LDS and CS churches continue to hold on to many if not all of the theologies and doctrines which historically brought them into conflict with the US government.  What has changed is not the belief itself, but the embodiment of it, and also the state and federal government reaction to it.  Therefore, the theological histories and founding stories of these religions remain relevant to their contemporary status as extra-statal biopolitical forces within the US today.",
  "description_provenance": [
    "Author Email: nitanews@vt.edu",
    "Advisor Email: rthadhani@vt.edu",
    "Advisor Email: alaberge@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Advisor Email: mborrego@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:04Z (GMT). No. of bitstreams: 1 NewswanderETD.pdf: 1443380 bytes, checksum: a43222cf17aa6720e57e65167e6b1a43 (MD5)   Previous issue date: 2009-04-01"
  ],
  "handle": "26685",
  "identifier_other": "etd-04072009-174920",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072009-174920/",
  "identifier_uri": "http://hdl.handle.net/10919/26685",
  "publisher": "Virginia Tech",
  "relation_haspart": "NewswanderETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "governance",
    "ideology",
    "religion and politics",
    "Mormonism",
    "Christian Science",
    "comparative religion",
    "Foucault",
    "biopolitics"
  ],
  "title": "Biopolitics and Belief:  Governance in the Church of Christ, Scientist, and the Church of Jesus Christ of Latter-day Saints",
  "type": "Dissertation"
}