{
  "contributor_author": "Dorosz, Sven",
  "contributor_committeechair": "Pleimling, Michel J. F.",
  "contributor_committeemember": [
    "Tauber, Uwe C.",
    "Takeuchi, Tatsu",
    "Khodaparast, Giti A."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:09:05Z",
  "date_adate": "2010-04-28",
  "date_available": "2014-03-14T20:09:05Z",
  "date_issued": "2010-03-26",
  "date_rdate": "2010-04-28",
  "date_sdate": "2010-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Fluctuations are of great importance in systems of small length and energy scales. Measuring  the pulling of single molecules or the stationary ï¬ ow of mesospheres dragged through a viscous media enables the direct analysis of work and entropy distributions. These probability distributions are the result of a large number of repetitions of the same experiment. Due to the small scale of these experiments, the outcome can vary significantly from one realization to the next. Strong theoretical predictions exist, collectively called Fluctuation Theorems, that restrict the shape of these distributions due to an underlying time reversal symmetry of the microscopic dynamics. Fluctuation Theorems are the strongest existing statements on the entropy production of systems that are out of equilibrium. <p> Being the most important ingredient for the Fluctuation Theorems, the probability distribution of the entropy change is itself of great interest. Using numerically exact methods we characterize entropy distributions for various stochastic reaction-diffusion systems that present different properties in their underlying dynamics. We investigate these systems in their steady states and in cases where time dependent forces act on them. This study allows us to clarify the connection between the microscopic rules and the resulting entropy production. The present work also adds to the discussion of the steady state properties of stationary probabilities and discusses a non-equilibrium current amplitude that allows us to quantify the distance from equilibrium. The presented results are part of a greater endeavor to ï¬ nd common rules that will eventually lead to a general understanding of non-equilibrium  systems.",
  "description_provenance": [
    "Author Email: sdorosz@vt.edu",
    "Advisor Email: tauber@vt.edu",
    "Advisor Email: takeuchi@vt.edu",
    "Advisor Email: khodapar@vt.edu",
    "Advisor Email: michel.pleimling@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:05Z (GMT). No. of bitstreams: 1 Dorosz_Sven_D_2010.pdf: 3213523 bytes, checksum: 5777c2038d1d21a5f58ac9fed61fec2e (MD5)   Previous issue date: 2010-03-26"
  ],
  "handle": "26687",
  "identifier_other": "etd-04072010-132215",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072010-132215/",
  "identifier_uri": "http://hdl.handle.net/10919/26687",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dorosz_Sven_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Large Deviation Functions",
    "Fluctuation Relations",
    "Entropy Production"
  ],
  "title": "Fluctuation Relations for Stochastic Systems far from Equilibrium",
  "type": "Dissertation"
}