{
  "contributor_author": "Lineburg, Paul Norman",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Arnold, Douglas E.",
    "Tripp, Norman Wayne",
    "Stewart, Daisy L."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:05Z",
  "date_adate": "2010-05-06",
  "date_available": "2014-03-14T20:09:05Z",
  "date_issued": "2010-05-30",
  "date_rdate": "2010-05-06",
  "date_sdate": "2010-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Since the 1980s, researchers have suggested that principals are an integral part of school effectiveness through their actions as instructional leaders. Standardized testing and strict accountability, which heavily influence todayâ  s public schools, make principals responsible for student achievement. They fulfill this responsibility by influencing and guiding the quality of teaching and learning in their schools. The purpose of this study was to measure how high school principals influenced change in teachersâ   instructional practices; however, other factors influencing classroom instruction surfaced. A two-step methodology was used. The first step was a qualitative study in which interviews with 9 principals and 9 teachers from high schools across the country were conducted. The purpose of this step was to collect data that helped develop a questionnaire that was used in a quantitative study. The constant-comparative method was used to analyze data collected from the interviews. The influence of principals on change in teachersâ   instructional practices was limited. Several other factors emerged as influences on teachers. The original theory was modified and the new theory guided the development of the questionnaire.  Step two of the methodology was a quantitative study in which a questionnaire was distributed to a national sample of teachers. Multiple regression analysis was used to analyze data collected from the questionnaire. Two of the five predictor variables were significantly related to change in teachersâ   instructional practices. The strongest predictor of change in teachersâ   instructional practices was pressure influences. External growth influences was the other variable significantly related to change in teachersâ   instructional practices. The remaining variables, administrative influence, peer influence, and self/family/student influence, were not predictors of change in teachersâ   instructional practices. Issuing directives, one of the pressure influences, was the only principal influence significantly related to change in teachersâ   instructional practices. Results indicated that teachers were influenced by many variables, many of which are outside of the principalâ  s control.",
  "description_provenance": [
    "Author Email: plinebur@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: darnold@ehc.edu",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:05Z (GMT). No. of bitstreams: 1 Lineburg_PN_D_2010.pdf: 1138143 bytes, checksum: 824d611f08774dc116a738818d0c96dd (MD5)   Previous issue date: 2010-05-30"
  ],
  "handle": "26688",
  "identifier_other": "etd-04072010-140111",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072010-140111/",
  "identifier_uri": "http://hdl.handle.net/10919/26688",
  "publisher": "Virginia Tech",
  "relation_haspart": "Lineburg_PN_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Teachers",
    "Instructional Practices",
    "Principals",
    "Instructional Leadership"
  ],
  "title": "The Influence of the Instructional Leadership of Principals on Change in Teachers' Instructional Practices.",
  "type": "Dissertation"
}