{
  "contributor_author": "Dorsey, William Mark",
  "contributor_committeechair": "Zaghloul, Amir I.",
  "contributor_committeemember": [
    "Murray-Tuite, Pamela M.",
    "Midkiff, Scott F.",
    "Brown, Gary S.",
    "Davis, William A.",
    "Weiss, Steven J."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:09:04Z",
  "date_adate": "2009-05-06",
  "date_available": "2014-03-14T20:09:04Z",
  "date_issued": "2009-04-03",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Dual-band antenna elements that support dual-polarization provide ideal performance for applications including space-based platforms, multifunction radar, wireless communications, and personal electronic devices.  In many communications and radar applications, a dual-band, dual-polarization antenna array becomes a requirement in order to produce an electronically steerable, directional beam capable of supporting multiple functions.  The multiple polarizations and frequency bands allow the array to generate multiple simultaneous beams to support true multifunction radar.  Many of the applications in spaced-based systems and personal electronic devices have strict restraints on the size and weight of the antenna element, favoring a low-profile, lightweight device.<p> The research performed in this dissertation focuses on the design of a dual-band, dual-polarized antenna element capable of operating as an isolated element or in an array environment.  The element contains two concentric, dual-polarized radiators.  The low band radiator is a shorted square ring antenna, and the high band radiator is a square ring slot.  Each constituent element achieves circular polarization through the introduction of triangular perturbations into opposing corners of the radiating element.  This technique has been shown to introduce two, near-degenerate modes in the structure that â   when excited in phase quadrature â   combine to form circular polarization.  The perturbations allow circular polarized operation with only a single feed point.  The sense of the circular polarization is determined by the location of the feed point with respect to the perturbations.  Both senses of circular polarization are excited by the introduction of orthogonal feeds for each of the two radiating elements.  Thus, dual-ban, dual-circular polarization is obtained.<p> The element achieves a low-profile from its printed circuit board realization.  The high band square ring slot is realized in stripline.  The orthogonal feeding transmission lines are printed on opposing sides of an electrically thin dielectric layer to allow them to cross without physically intersecting.  This thin feeding substrate is sandwiched between two dielectric layers of matched dielectric constant.  A ground plane is located on the top and bottom of the sandwiched dielectric structure, and the top ground plane contains the square ring slot with perturbed corners.  Slotted stripline structures have been shown in the literature to excite a parallel-plate mode that can degrade overall performance of the antenna.  Plated through holes are introduced at the outer perimeter of the square ring slot to short out this parallel-plate mode.  The plated through holes (also called vias) serve as the shorting mechanism for the low band microstrip shorted square ring radiator.  This element also contains triangular perturbations at opposing corners to excite circular polarization with a single feed point.  In this element, orthogonal probe feeds are present to excite both senses of circular polarization.<p> A dual-band, dual-polarized antenna element was built, tested, and compared to simulations.  The constructed element operated at two distinct industrial, scientific, and medical (ISM) frequency bands due to their popularity in low power communications.  The antenna element was realized in a multilayer printed circuit layout.  A complex design procedure was developed and submitted to a printed circuit board company who manufactured the antenna element.  The s-parameters of the antenna were measured using a Network Analyzer, and the results show good agreement with simulations.  The radiation and polarization characteristics were measured in a compact range facility.  These results also agreed well with simulations.  The measured results verify the simulation models that were used in the simulations and establish a confidence level in the feasibility of constructing this element.  The dual-band, dual-polarization nature of this element was established through the construction and measurement of this element.<p> A novel size reduction technique was developed that allows for significant reduction of the elementâ  s footprint.  This size reduction facilitates the placement of this element within an array environment.  The loading technique utilizes a structure analogous to a parallel-plate capacitor to drastically reduce the overall size of the low frequency shorted square ring.  The loading structure uses a substrate that is separate from that of the radiating elements.  This allows the load to use a high dielectric material to achieve a high capacitance without requiring the radiating elements to be printed on high dielectric material that is potentially expensive and lossy at microwave frequencies.<p> The two frequency bands were selected to be in separate industrial, scientific, and medical (ISM) bands.  These frequency bands are increasingly popular in low power communication devices because unlicensed operation is permitted.  The 2.45 GHz and 5.8 GHz ISM bands are commonly used for applications including Bluetooth technology, multiple 801.11 protocol, cellular phone technology, and cordless phones.  The ISM bands were chosen for this antenna element due to their popularity, but this antenna is not restricted to these bands.  The frequency ratio can be altered by controlling the dielectric constant used in the printed circuit board design, the parameters of the capacitive loading structure, and the size of the constituent elements that are used.<p> After the size reduction technique is applied, the dual-band, dual-polarized elements can be placed in an array environment resulting in an array capable of generating both senses of circular polarization in the two, distinct ISM bands.  This provides an aperture capable of supporting multiple functions.  Depending on the applications required, the frequency bands of the antenna element can be altered to suit the particular system needs.<p> The array analysis performed in this dissertation used a unique hybrid calculation technique that utilizes nine active element patterns to represent the patterns of the individual elements within a large antenna array.  A common first look at array performance is achieved by multiplying the element pattern of an isolated element by an array factor containing the contributions of the geometrical arrangement of the antenna elements.  This technique neglects mutual coupling between elements in the array that can alter the impedance match and radiation characteristics of the elements in the array.  The active element pattern defines the radiation pattern of a given element in an array when all other elements are terminated in a matched impedance load.  The active element pattern is unique for each element in an array.  When these patterns are summed, the exact array pattern is obtained.  While this technique has the advantage of accuracy, it is not ideal because it requires the simulation, calculation, or measurement of the pattern for each element in the array environment.  The technique developed in this dissertation uses only nine active element patterns.  These elements are then assigned to represent the active element patterns for all elements in the array depending on the geometrical region where the given element resides.  This technique provides a compromise between the speed of using a single element pattern and the accuracy of using the unique active element pattern for each element in the array.<p> The application of these two concentric, coplanar radiators along with the capacitive loading technique provides a unique contribution to the field of antenna engineering.  The majority of dual-band antenna elements in the literature operate with a single polarization in each band.  The ones that operate with dual-polarization in each band are typically limited to dual-linear polarization.  Circular polarization is preferable to linear in many applications because it allows flexible orientation between the transmitting antenna and receiving antenna in a communications system, while also mitigating multipath effects that lead to signal fading.  The ability to operate with two, orthogonal senses of circular polarization allows a system to reuse frequencies and double system capacity without requiring additional bandwidth.  The uniqueness of this element lies in its ability to provide dual-circular polarization in two separate frequency bands for an individual element or an antenna array environment.  The arrangement of the two element geometries with the addition of the novel capacitive loading technique is also unique.  The performance of this element is achieved while maintaining the light weight, low profile design that is critical for many wireless communications applications.<p> This dissertation provides a detailed description of the operation of this dual-band, dual-polarized antenna element.  The design of the constituent elements is discussed for several polarization configurations to establish an understanding of the building blocks for this element.  The dual-band, dual-polarized element is presented in detail to show the impedance match, isolation, and axial ratio performance.  The capacitive loading technique is applied to the dual-band, dual-polarized element, and the performance with the loading in place is compared to the performance of the unloaded element.  Next, there is an in-depth description of the array calculation technique that was developed to incorporate mutual coupling effects into the array calculations.  This technique is then applied to the dual-band, dual-polarized array to show the performance of several array sizes.",
  "description_provenance": [
    "Author Email: wmdorsey@vt.edu",
    "Advisor Email: murraytu@vt.edu",
    "Advisor Email: midkiff@vt.edu",
    "Advisor Email: randem@vt.edu",
    "Advisor Email: wmdorsey@vt.edu",
    "Advisor Email: wadavis@vt.edu",
    "Advisor Email: sweiss@arl.army.mil",
    "Made available in DSpace on 2014-03-14T20:09:04Z (GMT). No. of bitstreams: 1 Dorsey_Dissertation_DBDCP_Antenna_050409.pdf: 9312263 bytes, checksum: 1767276f4f62dad611105cac5be4fd49 (MD5)   Previous issue date: 2009-04-03"
  ],
  "handle": "26683",
  "identifier_other": "etd-04072009-092151",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072009-092151/",
  "identifier_uri": "http://hdl.handle.net/10919/26683",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dorsey_Dissertation_DBDCP_Antenna_050409.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "dual-band",
    "multifunction array",
    "printed circuit antenna",
    "circularly polarized antennas",
    "low profile antenna",
    "antennas",
    "antenna array",
    "dual-polarization"
  ],
  "title": "Low Profile, Printed Circuit, Dual-Band, Dual-Polarized Antenna Elements and Arrays",
  "type": "Dissertation"
}