{
  "contributor_author": "Lipp, Jane H",
  "contributor_committeecochair": [
    "Mallory, Walter D.",
    "Glenn, William J."
  ],
  "contributor_committeemember": [
    "Brott, Pamelia E.",
    "Caldwell, M. Teressa"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:05Z",
  "date_adate": "2011-04-29",
  "date_available": "2014-03-14T20:09:05Z",
  "date_issued": "2011-03-30",
  "date_rdate": "2011-04-29",
  "date_sdate": "2011-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "A pertinent educational issue in our country today is the minority achievement gap.   One specific program that has been developed and implemented over the last several years in an effort to provide strong academic curriculum and to raise student achievement, including minority student achievement, is the College Boardâ  s Advanced Placement (AP) Program.  The AP Program courses are widely recognized as providing students with academically challenging curriculum, facilitating their acceptance to colleges and supporting their preparation for and performance in post-secondary education.  The emphasis of this research relates to the specific concern that although the AP Program has been in existence for several decades and is an integral part of most high schoolsâ   curriculum for at least ten years, there is an under-representation of minority students in high school Advanced Placement (AP) Program courses.  This qualitative research involved completing an in-depth case study of a designated secondary school in the Mid-Atlantic region that has been successful in recruiting and enrolling students, majority and minority, in the AP Program.  Guiding questions for this case study related to identifying the individuals who influenced enrollment, as well as the policies, procedures, interventions, and strategies used to recruit students and increase their enrollment in AP courses. These research findings revealed various key factors that contributed to the success of increasing student enrollment in these academic courses and the factors are similar to those identified in the literature and other research studies.  These factors include: (a) shared and distributed leadership demonstrated across the school; (b) collaborative vision and mission; (c) an AP Program with high expectations and a relevant and rigorous curriculum; (d) strong academic advisement, data-driven decision making, and specific school policies and procedures related to the AP Program; (e) extended student learning opportunities and individualized support; and (f) varied professional development and training for faculty.  This case study highlights a group of dedicated and committed leaders with collaborative vision who implemented an academic program with focused initiatives and interventions. Between 2003 and 2009, this school increased overall student enrollment in the AP Program by 15.2%, with the Black student enrollment increasing by 11.9% and the Hispanic student enrollment increasing by 10.5%. They accomplished their goal and commitment to increasing minority enrollment in the AP Program and providing enriched academic learning opportunities for all students.",
  "description_provenance": [
    "Author Email: Jane.Lipp@fcps.edu",
    "Advisor Email: pbrott@vt.edu",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: mcaldwel@vt.edu",
    "Advisor Email: wglenn@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:05Z (GMT). No. of bitstreams: 3 Lipp_JH_D_2011.pdf: 629945 bytes, checksum: 1bbfa87f8af1a6555db677eef2eb7b2b (MD5) Lipp_JH_D_2011_IRB2.pdf: 247283 bytes, checksum: 8e4a4d3344e67ee662cd16eca95f82de (MD5) Lipp_JH_D_2011_IRB1.pdf: 258872 bytes, checksum: b26c6ef193af915598bae5dbb36ce1b2 (MD5)   Previous issue date: 2011-03-30"
  ],
  "handle": "26689",
  "identifier_other": "etd-04072011-140549",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04072011-140549/",
  "identifier_uri": "http://hdl.handle.net/10919/26689",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Lipp_JH_D_2011.pdf",
    "Lipp_JH_D_2011_IRB2.pdf",
    "Lipp_JH_D_2011_IRB1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Minority Students",
    "AP Program Enrollment"
  ],
  "title": "Examining Educational Initiatives to Increase Minority Student Enrollment in Advanced Placement Program Courses",
  "type": "Dissertation"
}