{
  "contributor_author": "Liu, Xingsheng",
  "contributor_committeechair": "Lu, Guo-Quan",
  "contributor_committeemember": [
    "Guido, Louis J.",
    "van Wyk, Daan",
    "Borojevich, Dushan",
    "Reynolds, William T. Jr.",
    "Suchicital, Carlos T. A."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:09:05Z",
  "date_adate": "2001-04-18",
  "date_available": "2014-03-14T20:09:05Z",
  "date_issued": "2001-02-27",
  "date_rdate": "2002-04-18",
  "date_sdate": "2001-04-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Circuit assembly and packaging technologies for power electronics have not kept pace with those for digital electronics.  Inside those packaged power devices as well as the state-of-the-art power modules, interconnection of power chips is accomplished with wirebonds.  Wirebonds in power devices and modules are prone to resistance, noise, parasitic oscillations, fatigue and eventual failure.  Furthermore, there has been an increase demand for higher power density and better efficiency for power converters.  Power semiconductor suppliers have been concentrating on improving device structure, density, and process technology to lower the on-resistance of MOSFETs and voltage drop of IGBTs.  Recent advances made in power semiconductor technology are pushing packaging technology to the limits for performance of these power systems since the resistance and parasitics contribution by the package and the wirebonds are roughly the same as that on the silicon.  In recent years, an integrated systems approach to standardizing power electronics components and packaging techniques in the form of power electronics building blocks has emerged as a new concept in the area of power electronics.  As a result, it has been envisioned that the packaging of three-dimensional high-density multichip modules (MCMs) can meet the requirement for future power electronics systems.  However, the conventional wirebond interconnected power devices are excluded from three-dimensional MCMs because of their large size, limited thermal management, and incompatible processing techniques.  On the other hand, advanced solder joint area-array technologies, such as flip-chip technology, has emerged in microelectronics industry due to increased speed, higher packaging density, and performance, improved reliability and low cost these technologies offer.  With all these benefits to offer, solder joint area-array technology has yet to be implemented for power electronics packaging.  Therefore, the first objective of this study is to design and develop a solder joint area-array interconnection technique for power chips.  Solder joint reliability is a major concern for area array technologies and power chip interconnection, thus the second objective of this study is to evaluate solder joint reliability, investigate the fatigue failure behavior of solder joint and improve solder joint reliability by developing a new solder bumping process for improved solder joint geometry, underfilling solder joint with encapsulant and applying flexible substrate in the assembly.  The third objective is the implementation of solder joint interconnection technique in developing chip-scale power packages and a three-dimensional integrated power electronics module structure.   Solder joint area array interconnection for power chips has been designed with the considerations of parasitic resistance and inductance reduction, current handling capability, thermal management, reliability improvement and manufacturability.  A new solder joint fabrication process, which is able to produce high standoff hourglass-shaped solder joint that consists of an inner cap, middle ball and outer cap, as well as the conventional solder bumping process have been successfully developed for power chips by using stencil printing.  This solder bumping technology is compatible with the existing surface-mount assembly operations and potentially low cost.  The fabricated solder joints have been characterized for their structure integrity, mechanical strength and electrical performances.   Solder joint reliability has been improved by optimizing solder joint geometry, underfilling flipped power chip and utilizing compliant substrate.  Solder joint reliability was evaluated using accelerated temperate cycling and adhesion tests.  The interfaces of the triple-stacked solder joints were examined using scanning electron microscopy (SEM) and energy dispersive X-ray analysis (EDX) for the integrity of the joint.  Acoustic microscopy imaging (nondestructive evaluation) was utilized to examine the quality of the bonded interfaces and to detect cracks and other defects before and during accelerated fatigue tests.  Adhesion strength of both single bump barrel-shaped and stacked hourglass-shaped solder joints to bonding pads was characterized and analyzed.  It was found that stacked hourglass-shaped solder joint have higher fracture stress than barrel-shaped solder joint.  This verifies that hourglass-shaped solder joint has lower stress singularity at the interface between the solder bump and the silicon die as well as at the interface between the solder bump and substrate than barrel-shaped solder joint, especially around the corners of the interfaces.  Furthermore, the adhesion strength of barrel-shaped solder joint decreases much faster than that of high standoff hourglass-shaped solder joint under temperature cycling, which indicates that the latter has high reliability than the former.  Our accelerated temperature cycling test clearly shows that solder joint fatigue failure process consists of three phases: crack initiation, crack propagation and catastrophic failure.  Solder joint geometry, underfilling and substrate flexibility were proved to affect solder joint reliability.  The effects of solder joint shape and standoff height on reliability have been systematically studied experimentally for the first time.  Our experimental results indicated that both hourglass shape and great standoff height could improve solder joint fatigue lifetime, with standoff height being the more effective factor.  The fatigue lifetime of high standoff hourglass-shaped solder joint is improved mainly by prolonged crack propagation time, with slight improvement in crack initiation time.  Experimental data suggested that shape is the dominant factor affecting crack initiation time while standoff height is the major factor influencing crack propagation time.  Underfilling and flexible substrate improved the lifetime of both barrel and hourglass-shaped solder joints.  The effect of underfill on solder joint reliability is well known in microelectronics packaging field.  However, for the first time, it is reported in this study that flex substrate could improve solder joint reliability.  It has been found that flex substrate bucks during temperature cycling and thus reduces thermal strain in solder joints, which in turn improves solder joint fatigue lifetime.   Chip scale packaging can enable a few very important concepts and advantages in power electronics packaging.  It offers high silicon to package footprint ratio, provides a known good die solution to power chips, improves electrical as well as thermal performance and creates an opportunity for power component standardization.  Two kinds of chip-scale power packages have been developed in this research.  One is called cavity down flip chip on flex; the other is termed Die Dimensional Ball Grid Array (D2BGA).  Both utilize solder joint as chip-level interconnection.  Electrical tests show that the VCE(sat) of the high speed IGBT chip-scale packages is improved by 20% to 30% by eliminating the device¡¯s wirebonds and other external interconnections, such as leadframe.  Double-sided cooling is realized in these CSPs.  Temperature cycling test shows that the CSPs are reliable.   Integrated power electronics modules (IPEMs) are envisioned as integrated power modules consisting of power semiconductor devices, power integrated circuits, sensors, and protection circuits for a wide range of power electronics applications, such as inverters for motor drives and converters for power processing equipment.  We have developed a three-dimensional approach, termed flip chip on flex (FCOF), for packaging high-performance IPEMs.  The new concept is based on the use of solder joint (D2BGA chip scale package), not bonding wires, to interconnect power devices.  This packaging approach has the potential to produce modules having superior electrical and thermal performance and improved reliability.  We have demonstrated the feasibility of this approach by constructing half-bridge converters (consisting of two IGBTs, two power diodes, and a simple gate driver circuitry) which have been successfully tested at power levels over 30 kW.  Switching tests have shown that parasitic inductance of the FCOF module has been reduced by 40% to 50% over conventional wire bond power modules.  Better thermal management can be achieved in this three-dimensional power module structure.  Compared with the state-of-the-art half-bridge power modules, the volume of the half-bridge FCOF power module is reduced by at least 65%.  Reliability test shows that this flip chip on flex power module structure is potentially more reliable than wire bond power module.",
  "description_provenance": [
    "Author Email: xiliu4@vt.edu",
    "Advisor Email: gqlu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:05Z (GMT). No. of bitstreams: 11 Chapter-5.PDF: 2928085 bytes, checksum: cf7b6d5ef09ce405c067e01a91cd69da (MD5) Appendix-A.PDF: 15157 bytes, checksum: 57285858db05b3a56e65c8aa17fe3a93 (MD5) Chapter-2.PDF: 2325060 bytes, checksum: f57629f854d364d5fa25cba9211ba94a (MD5) Appendix-B.PDF: 127977 bytes, checksum: f5960aed44bec5e5ca50275fd5ef014b (MD5) Chapter-3.PDF: 4213123 bytes, checksum: 68c81cb317513a31caaee58d6d437d46 (MD5) FrontPages.PDF: 84837 bytes, checksum: 00a5e4439a2a78455761838785709dcf (MD5) Vita.PDF: 5410 bytes, checksum: 5fc90930c6d4dac52cf93f0055f78e23 (MD5) Chapter-1.PDF: 3613266 bytes, checksum: b2011af90aa854975a762408df8a3717 (MD5) Chapter-6.PDF: 1257961 bytes, checksum: 17fdb8eb54dc9f1c33a081b63bb7e3ac (MD5) Chapter-4.PDF: 1339721 bytes, checksum: 3894d9083e15b8e379257f4e10875f41 (MD5) Chapter-7.PDF: 18054 bytes, checksum: c1274649b2546b77d66ce42de76a1777 (MD5)   Previous issue date: 2001-02-27"
  ],
  "handle": "26691",
  "identifier_other": "etd-04082001-204805",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04082001-204805/",
  "identifier_uri": "http://hdl.handle.net/10919/26691",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter-5.PDF",
    "Appendix-A.PDF",
    "Chapter-2.PDF",
    "Appendix-B.PDF",
    "Chapter-3.PDF",
    "FrontPages.PDF",
    "Vita.PDF",
    "Chapter-1.PDF",
    "Chapter-6.PDF",
    "Chapter-4.PDF",
    "Chapter-7.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Power Electronics Packaging",
    "Power Module",
    "Chip-Scale Power Package",
    "Solder Joint",
    "Reliability"
  ],
  "title": "Processing and Reliability Assessment of Solder Joint Interconnection for Power Chips",
  "type": "Dissertation"
}