{
  "contributor_author": "Keller, Scott Wayne",
  "contributor_committeechair": "Marcy, Joseph E.",
  "contributor_committeemember": [
    "Hackney, Cameron Raj",
    "Carter, Walter Hans Jr.",
    "Lacy, George H.",
    "Blakistone, Barbara A."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:09:05Z",
  "date_adate": "1999-04-09",
  "date_available": "2014-03-14T20:09:05Z",
  "date_issued": "1998-08-18",
  "date_rdate": "2000-09-04",
  "date_sdate": "1999-04-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT \tThis study was divided into four sections: the literature review; the mechanism by which a package defect becomes a leak; and the imposed pressures generated within a package during distribution; comparison of the threshold leak size to the critical leak size and their effect on loss of package sterility; and the relationships between microorganism characterisitics and the threshold leak size, and their effect on the critical leak size. \tSection II. The mechanism by which a package defect converts to a leaker in an effort to develop a relationship between the threshold leak size and loss of package sterility was studied.  The threshold leak size is the hole size at which the onset of leakage occurs.  The threshold pressure is that which is required to initiate a leak.  Leak initiation was studied in terms of the interaction between three components: liquid attributes of liquid food products, defect size, and pressures required to initiate liquid flow.   \tLiquid surface tension, viscosity, and density were obtained for sixteen liquids.  The imposed pressures (Po) required to initiate flow through microtubes of IDs 0, 2, 5, 7, 10, 20 or 50  m, were measured using 63 test cells filled with safranin red dye, tryptic soy broth, and distilled water with surface tensions of 18.69 mN/m, 44.09 mN/m, and 64.67 mN/m, respectively.  Significant differences were found between observed threshold pressures for safranin red dye, tryptic soy broth, and distilled water  (p < 0.05).  Liquids with small surface tensions such as safranin red dye required significantly lower threshold imposed pressures than liquids with large surface tensions such as distilled water (p < 0.05).  An equation was developed to quantify the relationship between liquid surface tension, threshold imposed pressure, and defect size.  Observed threshold pressures were not significantly different (p > 0.05) than those predicted by the equation. \tImposed pressures and vacuums generated within packages during random vibration and sweep resonance tests were measured for brick-style aseptic packages (250 ml),  metal cans size 76.2-mm x 114.3-mm (425 ml), quart gable top packages (946 ml), one-half gallon gable top packages (1.89 L) and one-gallon milk jugs (4.25 L).  Significant differences were found between packages for observed generated pressures during vibration testing (p < 0.05).  An equation to calculate the threshold like size based on liquid surface tension and imposed pressure was established. \tSection III.  The onset of liquid flow through a defect as a result of imposed positive pressures or vacuum were linked to the sterility loss of a package.  Five-hundred sixty-three test cells, each with microtubes of 0, 2, 5, 7, 10, 20 or 50  m, manufactured to simulate packages with defects,  were biochallenged via an aerosol concentration of 106 cells/cm3 of  Pseudomonas fragi Lacy-1052, under conditions of imposed positive pressure or vacuum of 20.7, 13.8, 6.9, 0, -6.9, -13.8, -20.7 kPa, respectively and temperatures of 4 , 25  and 37 C.  A statistically significant relationship between loss of sterility due to microbial ingress in test cells and the initiation of liquid flow were found (p < 0.05).  Microbial ingress was not found in test cells with microtube IDs of 2  m.  Leak sizes critical to the sterility maintenance were found to be different based on the liquid surface tension, and imposed package pressures.  The threshold leak size where the onset of liquid flow was initiated, and the critical leak size at which loss of sterility occured were not significantly different (p > 0.05).  \tSection IV.  The effects of microorganism size and motility, and the imposed pressure required to initiate liquid flow, on the leak size critical to the sterility of a package were measured.  Pseudomonas fragi Lacy-1052,  Bacillus atrophaeus ATCC 49337, and Enterobacter aerogenes ATCC 29007 were employed to indicate loss of package sterility.  One hundred twenty-six microtubes with interior diameters (I.D.s) of  5, 10, and 20  m and 7 mm in length were used as the manufactured defects.  Forty-two solid microtubes were used as a control.  An equation was used to calculate imposed pressures sufficient to initiate the flow of tryptic soy broth through all defects.  No significant differences were found for loss of sterility as a result of microbial ingress into test cells with microtube ID sizes of 5, 10, and 20  m between the test organisms (p > 0.05).   Interactions between the initiation of liquid flow as a result of imposed pressures, and the sterility loss of test cells were significant (p < 0.05).",
  "description_provenance": [
    "Author Email: skeller@ball.com",
    "Made available in DSpace on 2014-03-14T20:09:05Z (GMT). No. of bitstreams: 1 Kelleretd.pdf: 1149888 bytes, checksum: 0efe98b4dc31f230a0205df304897031 (MD5)   Previous issue date: 1998-08-18"
  ],
  "handle": "26690",
  "identifier_other": "etd-040799-175608",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-040799-175608/",
  "identifier_uri": "http://hdl.handle.net/10919/26690",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kelleretd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "microbial ingress",
    "Key words: imposed pressure",
    "imposed vacuum",
    "critical leak size",
    "sterility maintenance",
    "package defect",
    "surface tension",
    "package sterility",
    "threshold leak size"
  ],
  "title": "Determination of the Leak Size Critical to Package Sterility Maintenance",
  "type": "Dissertation"
}