{
  "contributor_author": "Battaglia, Marjorie M. Kaminski",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Rosen, Karen H.",
    "Klunk, Clare D.",
    "Morris, Linda E.",
    "Cline, Marvin Gerald"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:06Z",
  "date_adate": "2002-04-22",
  "date_available": "2014-03-14T20:09:06Z",
  "date_issued": "2002-03-20",
  "date_rdate": "2003-04-22",
  "date_sdate": "2002-04-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<FORMAT = CENTER><P> <STRONG> Abstract </STRONG> </FORMAT> </P>  <P> A Hermeneutic Historical Study of Kazimierz Dabrowski and his Theory of Positive Disintegration</P> <P>Marjorie M. Kaminski Battaglia </P> <P>The inquiry is a hermeneutic historical study of the historical factors in the life of Kazimierz Dabrowski which contributed to the shaping of his Theory of Positive Disintegration.  Relatively little information has been written on the life and theory of Kazimierz Dabrowski.  The researcher contends that knowledge of Dabrowski, the man, will aid in an understanding of his theory. </P>  <P>The journey in which an individual \"develops\" to the level at which \"the other\" becomes a higher concern than the self, is the \"stuff\" of Kazimierz Dabrowski's  Theory of Positive Disintegration.  It is a paradoxical theory of human development, based on the premise that \"good can follow from bad.\"  Crisis and suffering act as the propellents into an internal as well as external battle with self and environment to move out of the \"what is\" and travel to the \"what ought to be.\"  Illuminated within this study, is how the life of Dabrowski demonstrates this moral and psychic struggle.</P>  <P>Data collection for this qualitative study was accomplished over a four year period through a \"deep\" reading of the works of Dabrowski and a search for biographical material.  The researcher was the first to utilize a ten volume file on Dabrowski housed in the National Archives of Ottawa in Canada which houses a plethora of Dabrowski's books and papers.  The researcher, following a hermeneutic research approach, traveled to Poland to \"walk in Dabrowski's footsteps.\" Within this journey, the researcher utilized the facilities of many archives in Poland - at libraries, and within prisons.  Given the researcher's Polish heritage, a basic knowledge of the Polish language aided the researcher greatly in these endeavors.  The journey served to deepen the researcher's understanding of Dabrowski, the man - his history and his country.  Finally, the researcher interviewed several of Dabrowski's friends, co-authors, students and associates. </P>  <P>This study serves as a baseline endeavor for additional research. The researcher's purpose was to aid in understanding Dabrowski - the man and his theory.  The research journey was an attempt by the researcher to keep alive and renew interest in a theory of human development that is in danger of being forgotten. </P>",
  "description_provenance": [
    "Author Email: battagliamarj@aol.com",
    "Advisor Email: marcie@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:06Z (GMT). No. of bitstreams: 2 Photos_from_the_journey.pdf: 3640327 bytes, checksum: 093cd1c70a5be30cb367c0d0010fcc35 (MD5) Dissertation.pdf: 2690590 bytes, checksum: 0332afc37264b7badaddc0a53dfc7693 (MD5)   Previous issue date: 2002-03-20"
  ],
  "handle": "26692",
  "identifier_other": "etd-04082002-204054",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04082002-204054/",
  "identifier_uri": "http://hdl.handle.net/10919/26692",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Photos_from_the_journey.pdf",
    "Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "TPD",
    "positive disintegration",
    "Dabrowski",
    "transpersonal",
    "developmental psychology"
  ],
  "title": "A Hermeneutic Historical Study of Kazimierz Dabrowski and his Theory of Positive Disintegration",
  "type": "Dissertation"
}