{
  "contributor_author": "Hershey, J. H.",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Stratton, Richard K.",
    "Lepczyk, Billie F.",
    "Burnett, Audrey K."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:09:08Z",
  "date_adate": "2011-05-05",
  "date_available": "2014-03-14T20:09:08Z",
  "date_issued": "2011-03-22",
  "date_rdate": "2011-05-05",
  "date_sdate": "2011-04-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The present study implemented Mobilizing for Action through Planning and Partnerships (MAPP)â  a comprehensive, multi-component, strategic planning model and toolâ  in the New River Valley (NRV), Virginia to mobilize the NRV community to improve its own health status and the quality of life of its residents. The current mixed methods study represents one of the first to utilize MAPP in southwest Virginia and Virginia and is the most comprehensive community health needs assessment and strategic planning effort to date in the NRV. Through MAPP, the NRV community strived to determine the most effective ways to achieve optimal community health by considering its unique circumstances and needs, prioritizing public health system issues, identifying resources, and then developing integrated plans and forming effective partnerships for strategic action. The NRV MAPP process provided a solid framework for creating a community-driven needs assessment and strategic planning approach and initiative that brought together diverse public, private, non-profit, and voluntary organizations/agencies, businesses, faith communities,  academia, local government, community members, and others who shared the commitment to and had a role in the NRV communityâ  s health and overall well-being.  The current study also reviews the specific findings, summarizes the benefits and successes, and highlights lessons learned (including challenges and limitations) from the NRV MAPP experience, as well as makes recommendations for current practice and future research.  Additionally, it provides a step-by-step overview of the entire MAPP process for potential users as applied to a real-world community, specifically the NRV.",
  "description_provenance": [
    "Author Email: jher1956@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: lepczyk@vt.edu",
    "Advisor Email: burnetaj@jmu.edu",
    "Advisor Email: kredican@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:08Z (GMT). No. of bitstreams: 2 Hershey_JH_D_2011_f1.pdf: 8500798 bytes, checksum: 545b98c4c6b73f8cb53d78bbb112d1d6 (MD5) Hershey_JH_D_2011_f2.pdf: 218214 bytes, checksum: a52c31d558b57a891e8e1b3ef101759d (MD5)   Previous issue date: 2011-03-22"
  ],
  "handle": "26705",
  "identifier_other": "etd-04082011-012806",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04082011-012806/",
  "identifier_uri": "http://hdl.handle.net/10919/26705",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Hershey_JH_D_2011_f1.pdf",
    "Hershey_JH_D_2011_f2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "strategic planning",
    "New River Valley",
    "MAPP",
    "needs assessment",
    "community health improvement"
  ],
  "title": "Implementing MAPP (Mobilizing for Action through Planning and Partnerships) in the New River Valley, Virginia: A Planning Approach to Improve the Community's Health and Quality of Life through Mobilized Partnerships and Strategic Action",
  "type": "Dissertation"
}