{
  "contributor_author": "Surace, Michael Joseph",
  "contributor_committeechair": "Li, Liwu",
  "contributor_committeemember": [
    "Ehrich, Marion F.",
    "Lee, Yong Woo",
    "Schubot, Florian D."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:09:07Z",
  "date_adate": "2010-04-23",
  "date_available": "2014-03-14T20:09:07Z",
  "date_issued": "2010-03-25",
  "date_rdate": "2010-04-23",
  "date_sdate": "2010-04-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Macrophages can be activated by a variety of extracellular signals to polarize to either the M1 (inflammatory and antimicrobial) or to the M2 (wound repair and inflammation resolution) phenotype. Expression of arginase 1 in macrophages is a key marker of the M2 phenotype. Arginase 1 expression is induced by interleukin 4 (IL-4), a cytokine secreted by Th2 helper cells. All-trans retinoic acid (ATRA) is a product of metabolism of dietary retinol (vitamin A). In a manner analogous to hormones, ATRA binds to nuclear receptors in cells and influences gene expression and cell physiology. ATRA is important in the resolution of inflammation systemically and on the cellular level, however it has not been linked to M2 activation or arginase 1 expression. Testing the hypothesis that ATRA can induce arginase 1 in macrophages either directly or indirectly, it was found that ATRA alone cannot cause murine bone marrow-derived macrophages (BMDM) to activate in the M2 phenotype (as indicated by arginase 1 expression), however it can dramatically potentiate induction of arginase 1 expression and activity by IL-4. This is the first observation positively linking ATRA to arginase 1. Lipopolysaccharide (LPS), is a conserved structural component of the outer membrane of Gram negative bacteria, and a potent pyrogen. In metabolic endotoxemia, LPS concentration in the blood is slightly elevated, and over the long term this contributes to diverse inflammatory diseases such as atherosclerosis, obesity, and diabetes. LPS promotes the M1 phenotype and suppresses the M2 phenotype, but its contribution at low doses such as those found in metabolic endotoxemia are not well studied. In order to investigate mechanisms of LPS suppression at low doses, mice deficient in IRAK1 and tollip, key mediators or proinflammatory LPS signaling, were used to study IL-4, ATRA, and LPS crosstalk. LPS suppression of arginase 1 was found to be dependent on IRAK1 and tollip, but only at low doses of LPS.",
  "description_provenance": [
    "Author Email: SuraceMJ@vt.edu, MikeSurace@gmail.com",
    "Advisor Email: marion@vt.edu",
    "Advisor Email: ywlee@vt.edu",
    "Advisor Email: fschubot@vt.edu",
    "Advisor Email: lwli@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:07Z (GMT). No. of bitstreams: 1 Surace_MJ_D_2010.pdf: 16755102 bytes, checksum: 9ff387a0fda1810a3f415a487acbc200 (MD5)   Previous issue date: 2010-03-25"
  ],
  "handle": "26704",
  "identifier_other": "etd-04082010-152209",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04082010-152209/",
  "identifier_uri": "http://hdl.handle.net/10919/26704",
  "publisher": "Virginia Tech",
  "relation_haspart": "Surace_MJ_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "LPS",
    "Lipopolysaccharide",
    "ATRA",
    "Interleukin 4",
    "IL-4",
    "All-trans Retinoic Acid",
    "Arginase",
    "Macrophage",
    "M2",
    "Alternative"
  ],
  "title": "Signaling Cross-Talk Regulating the Expression of Arginase 1 in Murine Macrophages",
  "type": "Dissertation"
}