{
  "contributor_author": "Epler, Cory Michael",
  "contributor_committeechair": "Broyles, Thomas W.",
  "contributor_committeemember": [
    "Skaggs, Gary E.",
    "Wildman, Terry M.",
    "Westfall-Rudd, Donna M."
  ],
  "contributor_department": "Agricultural and Extension Education",
  "date_accessioned": "2014-03-14T20:09:08Z",
  "date_adate": "2011-04-26",
  "date_available": "2014-03-14T20:09:08Z",
  "date_issued": "2011-03-28",
  "date_rdate": "2011-11-08",
  "date_sdate": "2011-04-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The intent of this two-phase, sequential explanatory mixed methods study was to examine the role teachersâ   beliefs play when making instructional decisions.  The population included in-service teachers representing four Career and Technical Education disciplines located within the commonwealth of Virginia.  Using a stratified random sample, 622 teachers were selected for the quantitative strand, and employing a system of four contacts, quantitative data were collected from 292 participants.  Dweckâ  s Theories of Intelligence scale assessed the nature of in-service teachersâ   beliefs about intelligence, and the Epistemic Belief Inventory was used to measure their epistemological beliefs.  Finally, the participants rated their use of teacher-centered and student-centered teaching methods.  In the second phase, qualitative data were collected from nine participants to further understand how in-service teachersâ   beliefs are related to the teaching practices they use.  The quantitative and qualitative data were combined to determine if the descriptions of teaching method used, beliefs about intelligence, and epistemological beliefs aligned with the outcomes of the quantitative questionnaire.   Significant correlations existed between the Theories of Intelligence scale and the Epistemic Belief Inventory.  A significant positive relationship existed between the Epistemic Beliefs Inventory and the overall teaching practices score, indicating in-service teachersâ   advanced epistemological beliefs are related to the use of student-centered teaching practices.  A regression analysis indicated that teaching discipline,   epistemological beliefs, teaching experience, and highest level of education completed predicted the teaching practices in-service teachersâ   select.  The qualitative data supported the claim that beliefs about intelligence and epistemological beliefs influence teaching practices.  Six themes emerged from the qualitative data, and the themes were used as a framework for organizing the findings.  The researcher acknowledges that teachers possess a variety of beliefs, and those beliefs influence how teachers teach.  The researcher recommends that teacher educators attempt to identify the beliefs pre-service teachers hold, and if modifications of beliefs are needed, facilitate interventions to modify those beliefs.  While some have labeled the direct relationship between teacher beliefs and teaching practices as â  messyâ  , the evidence indicates the two, are in fact, related.",
  "description_provenance": [
    "Author Email: cepler@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Advisor Email: mooredm@vt.edu",
    "Advisor Email: tbroyles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:08Z (GMT). No. of bitstreams: 1 Epler_CM_D_2011.pdf: 1705618 bytes, checksum: 898917443b82138ff45d2e0ebd7ffe82 (MD5)   Previous issue date: 2011-03-28"
  ],
  "handle": "26706",
  "identifier_other": "etd-04082011-154026",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04082011-154026/",
  "identifier_uri": "http://hdl.handle.net/10919/26706",
  "publisher": "Virginia Tech",
  "relation_haspart": "Epler_CM_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "instructional decision-making",
    "student-centered teaching practices",
    "epistemological beliefs",
    "theories of intelligence",
    "Career and Technical Education",
    "teacher beliefs"
  ],
  "title": "The Relationship Between Implicit Theories of Intelligence, Epistemological Beliefs, and the Teaching Practices of In-service Teachers: A Mixed Methods Study",
  "type": "Dissertation"
}