{
  "contributor_author": "Liang, Chengya",
  "contributor_committeechair": "Prater, Mary Renee",
  "contributor_committeemember": [
    "Li, Yunbo",
    "Ehrich, Marion F.",
    "Holladay, Steven D."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:09:07Z",
  "date_adate": "2009-04-22",
  "date_available": "2014-03-14T20:09:07Z",
  "date_issued": "2009-04-03",
  "date_rdate": "2012-10-01",
  "date_sdate": "2009-04-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Adult exposure to high fat diet (HFD) has been linked to increased risk of musculoskeletal, cardiovascular, and metabolic diseases; however, the contribution of gestational HFD to elevated oxidative stress (OS), perinatal cardiovascular, skeletal, and metabolic dysfunction as well as long-term effects on adult offspring are incompletely understood.  Pathophysiologic mechanisms linking gestational HFD, OS, and insulin resistance to perinatal development and adult-onset chronic diseases are explored in the present study, and maternal antioxidant (quercetin) is offered as a potential preventive dietary supplement to reduce fetal and maternal sequelae of HFD.  Female C57BL/6 mice were fed â  cafeteria-styleâ   HFD (including 32.1% saturated fat to mimic a typical fast food menu) with or without quercetin for one month prior to conception, and throughout gestation. HFD dams developed gestational diabetes with significantly increased placental OS and vasculopathy.  Neonates were smaller at birth than age-matched controls, and surviving offspring developed type 2 diabetes, hypertension and osteoporosis during adulthood, despite having been fed healthy diet throughout their postnatal life.  Additional measures of bone using three-dimensionally reconstructed computed tomographic image analysis (microCT) revealed microarchitectural changes of bone at birth, and at 6 and 12 months postnatally.  Fetuses from HFD dams displayed diminished bone mineral density (BMD) and disrupted endochondral and intramembranous ossification with significantly shortened distal limb lengths, as compared to offspring of standard rodent chow dams.  Skeletal malformation persisted into adulthood despite the fact that both control and HFD offspring were fed conventional rodent chow throughout postnatal life. The offspring gestationally exposed to HFD showed significant decreased femoral BMD at 6 months of age and dysregulation of distal femoral trabecular architecture at 12 months of age, indicating development of osteoporosis. We were able to reduce incidence of placental vasculopathy, fetal maldevelopment and adult-onset type 2 diabetes, hypertension and osteoporosis with concurrent maternal quercetin supplementation during pregnancy.  Collectively, these data suggested that maternal HFD increases placental OS    and vascular damage during pregnancy, which are associated with fetal malformation and elevated adult-onset multisystemic chronic diseases. Maternal quercetin supplementation must be further explored as a potential dietary intervention for improved placental integrity, fetal development and lifelong health.",
  "description_provenance": [
    "Author Email: cliang@vt.edu",
    "Advisor Email: yli@vcom.vt.edu",
    "Advisor Email: marion@vt.edu",
    "Advisor Email: sdholl@uga.edu",
    "Advisor Email: mrprater@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:07Z (GMT). No. of bitstreams: 1 CHENGYALIANGDissertation.pdf: 2310964 bytes, checksum: 442bc625f57df45a84bc91b9101a1524 (MD5)   Previous issue date: 2009-04-03"
  ],
  "handle": "26700",
  "identifier_other": "etd-04082009-160602",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04082009-160602/",
  "identifier_uri": "http://hdl.handle.net/10919/26700",
  "publisher": "Virginia Tech",
  "relation_haspart": "CHENGYALIANGDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Gestational Diabetes",
    "Placental Vasculopathy",
    "Fetal Malformation",
    "Developmental Origins of Health and Disease",
    "High Saturated Fat Diet"
  ],
  "title": "High Saturated Fat Diet Induces Gestational Diabetes, Perinatal Skeletal Malformation and Adult-Onset Chronic Diseases",
  "type": "Dissertation"
}