{
  "contributor_author": "Hurd, Charles C.",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Blumenthal, Martha",
    "Cash, Carol S.",
    "Tripp, Norman Wayne"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:07Z",
  "date_adate": "2010-05-03",
  "date_available": "2014-03-14T20:09:07Z",
  "date_issued": "2010-03-26",
  "date_rdate": "2010-05-03",
  "date_sdate": "2010-04-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract This case study examined the principles of a professional learning community (PLC) in an elementary school setting and their impact on instructional practices and effect on the reading achievement of English Language Learner (ELL) students. The cohort of students in this study was followed from grades three through five.  The data sources included a principal interview, a focus group discussion with teachers, classroom observations and the Standards of Learning reading scores for ELL students.   The data from transcripts were analyzed using triangulation and coding techniques. The results of this study are a narrative description of a professional learning community used to impact instructional practices and reading achievement, the perceptions of a principal and teachers, and classroom observations.  The data from interviews and the focus group suggest that teacher and principal perceptions of the professional learning community and its principles support their instructional practice. There appeared to be no consistent pattern of performance of individual scores during the study period. The PLC principles of collaboration, collective inquiry and continuous improvement were identified most often to be perceived as effective in the delivery of instruction.  Staff development and providing adequate planning time for teachers are recommended as essential practices to a professional learning community.",
  "description_provenance": [
    "Author Email: hurdc@vt.edu",
    "Advisor Email: Mgblumen@henrico.k12.va.us",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:07Z (GMT). No. of bitstreams: 3 Hurd_CC_D_2010.pdf: 464339 bytes, checksum: 7a169b1ad53ffac42c79ddbf98ca10d1 (MD5) hurdirbapp08.pdf: 236715 bytes, checksum: 5aea5296ce7eb59634506e91083f99db (MD5) hurdirbapproval09.pdf: 234197 bytes, checksum: 7b704a58dae60b3fcffa2ec86c18decd (MD5)   Previous issue date: 2010-03-26"
  ],
  "handle": "26703",
  "identifier_other": "etd-04082010-121516",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04082010-121516/",
  "identifier_uri": "http://hdl.handle.net/10919/26703",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Hurd_CC_D_2010.pdf",
    "hurdirbapp08.pdf",
    "hurdirbapproval09.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Collaboration",
    "English Language Learner",
    "Professional Learning Community"
  ],
  "title": "The Effect of Professional Learning Community Principles on English Language Learner Instructional Practices and Reading Achievement",
  "type": "Dissertation"
}