{
  "contributor_author": "Ward, Ella Porter",
  "contributor_committeecochair": [
    "Dawson, Christina M.",
    "Richards, Robert R."
  ],
  "contributor_committeemember": [
    "Giddings, Valerie L.",
    "Parson, Stephen R.",
    "Hoffler-Riddick, Pamela"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:08Z",
  "date_adate": "1999-04-24",
  "date_available": "2014-03-14T20:09:08Z",
  "date_issued": "1999-03-18",
  "date_rdate": "2000-04-24",
  "date_sdate": "1999-04-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>One of the many attempts to solve problems that plague America's schools is the implementation of uniform dress code policies. Those who favor uniforms contend that uniforms will increase attendance, enhance academic achievement, and improve classroom environment. Prior research studies ( Behling, 1991;  Hughes, 1996; and Hoffler-Riddick, 1998) on the effects of mandatory school uniforms have been inconclusive in their findings. The purpose of this study was to examine the impact of mandatory uniform dress codes on student attendance, student achievement, and teachers' perceptions of classroom environment in two middle schools.  The dependent variables were student attendance, student achievement, and teachers' perceptions of classroom environment. The independent variables were gender, race/ethnicity and time/years of teaching experience. Descriptive statistics and Analyses of Variance were used to analyze the data. Repeated Measures Analyses of Variance was used to analyze the attendance data in School A for three consecutive years. Analyses of Variance was used to measure the attendance and achievement data in School B for two consecutive years. A self-report questionnaire was designed to measure teachers' perceptions of the impact of uniforms on four domains of classroom environment: student attendance, student behavior, student achievement, and students' self-image. Three-way Analysis of Variance was used to analyze the data collected from the questionnaire.  \t\t\t\t\t\t</p>\t<p>\t\t\t\t\t\t \tThe results of this study determined that there were no statistically significant differences in overall student attendance or achievement in School A. There were improvements in student achievement in School B after the change in dress to school uniforms. There were inconsistent differences between race/ethnicity and gender with respect to attendance after uniform implementation in schools A and B. Absences increased in School A after the second year with uniforms. Student achievement  improved for students in School B, but showed no change in School A.  Based on the results of the Uniform Survey administered to teachers in both schools, the perception of classroom environment after uniforms was generally positive. Teachers overwhelmingly supported the uniform policy, but they were inconsistent in their opinions of the overall impact on classroom environment. Teachers in School A felt that student achievement and student self-image improved after the implementation of school uniforms, but they saw no improvements in student attendance or behavior. Teachers in School B felt that student attendance declined after the first year of  uniform implementation; however, they felt that there were improvements in student behavior, student achievement, and student self-image. Future research should examine the impact of mandatory uniform dress codes on school climate, students' self-esteem, and the perceptions of parents, students and members of the community.  </p>",
  "description_provenance": [
    "Author Email: epwhlw@worldnet.att.net",
    "Advisor Email: vgidding@vt.edu",
    "Advisor Email: tdawson@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: robertr@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:08Z (GMT). No. of bitstreams: 3 FRONT.pdf: 19129 bytes, checksum: 1af4c493c4b8aca319a42878013fcbb6 (MD5) DISFINAL.pdf: 200513 bytes, checksum: 6f070d71b4ebef279804b30e2b56b9af (MD5) APPEND.pdf: 176883 bytes, checksum: 90cee506a7e51bd04a613df9909fae74 (MD5)   Previous issue date: 1999-03-18"
  ],
  "handle": "26707",
  "identifier_other": "etd-040899-143901",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-040899-143901/",
  "identifier_uri": "http://hdl.handle.net/10919/26707",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "FRONT.pdf",
    "DISFINAL.pdf",
    "APPEND.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Uniform dress code",
    "classroom environment",
    "self-image"
  ],
  "title": "Mandatory Uniform Dress Code Implementation and the Impact on  Attendance, Achievement, and Perceptions of Classroom Environment",
  "type": "Dissertation"
}