{
  "contributor_author": "Williams, Jr., Robert Hillis",
  "contributor_committeechair": "Graham, Richard Terry",
  "contributor_committeemember": [
    "Carico, Kathleen M.",
    "Kelly, Patricia Proudfoot",
    "Fortune, Jimmie C.",
    "Clowes, Darrel A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:10Z",
  "date_adate": "1999-04-17",
  "date_available": "2014-03-14T20:09:10Z",
  "date_issued": "1999-02-11",
  "date_rdate": "2000-04-17",
  "date_sdate": "1999-04-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The author reflects upon and examines his own educational memories, his personal and professional and historical relationship to public education, and his life as a learner. This reflection and examination - complete with connections to many strands of inquiry in broadly accepted educational, sociological, and psychological theory - culminates in both an enhanced self-awareness and in this document, this ethnographic and autobiographic statement of past experiences, present educational frustrations and celebrations, and future educational goals, hopes, and dreams. Likewise, the author argues that this autobiographic statement, this studied articulation, is both an artifact of and a necessary co-requisite to his educational identity. He further asserts the absolute necessity of just such autobiographical writing for his own sanity in the face of multiple institutional mores unrelated to authentic, student-centered learning in public education, for genuine self-awareness and ethical practice for all educational professionals, and for enhanced learning opportunities for all learners at various levels of maturity everywhere.",
  "description_provenance": [
    "Author Email: rwilliams@naxs.com",
    "Advisor Email: kcarico@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: rgraham@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: clowes@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:10Z (GMT). No. of bitstreams: 1 Thesis.pdf: 197500 bytes, checksum: 2c254af31d121835f28496945c68d98b (MD5)   Previous issue date: 1999-02-11"
  ],
  "handle": "26709",
  "identifier_other": "etd-040899-195944",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-040899-195944/",
  "identifier_uri": "http://hdl.handle.net/10919/26709",
  "publisher": "Virginia Tech",
  "relation_haspart": "Thesis.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Composition",
    "English",
    "Autobiography",
    "Reading",
    "Writing",
    "Secondary",
    "Narrative",
    "Learning",
    "Identity",
    "Psycholinguistics",
    "Curriculum",
    "Ethnography",
    "Education"
  ],
  "title": "Presumed Teacher: an Autobiographic Articulation of a Personal and Professional Educational Identity",
  "type": "Dissertation"
}