{
  "contributor_author": "Ragheb, Ragy Tadros",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "Turner, S. Richard",
    "Davis, Richey M.",
    "McGrath, James E."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:09:12Z",
  "date_adate": "2008-04-21",
  "date_available": "2014-03-14T20:09:12Z",
  "date_issued": "2008-03-28",
  "date_rdate": "2008-04-21",
  "date_sdate": "2008-04-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Polylactide homopolymers with pendent carboxylic acid functional groups have been designed and synthesized to be studied as magnetite nanoparticle dispersion stabilizers.  Magnetic nanoparticles are of interest for a variety of biomedical applications including magnetic field-directed drug delivery and magnetic cell separations. Small magnetite nanoparticles are desirable due to their established biocompatibility and superparamagnetic (lack of magnetic hysteresis) behavior. For in-vivo applications, it is important that the magnetic material be coated with biocompatible organic materials to afford dispersion characteristics or to further modify the surfaces of the complexes with biospecific moieties. The acid-functionalized silane endgroup was utilized as the dispersant anchor to adsorb onto magnetite nanoparticle surfaces and allowed the polylactide to extend into various solvents to impart dispersion stability. The homopolymers were complexed with magnetite nanoparticles by electrostatic adsorption of the carboxylates onto the iron oxide surfaces, and these complexes were dispersible in dichloromethane. The polylactide tailblocks extended into the dichloromethane and provided steric repulsion between the magnetite-polymer complexes. The resultant magnetite-polymer complexes were further incorporated into controlled-size nanospheres. The complexes were blended with poly(ethylene oxide-b-D,L-lactide) diblock copolymers to introduce hydrophilicity on the surface of the nanospheres with tailored functionality. Self-assembly of the PEO block to the surface of the nanosphere was established by utilizing an amine terminus on the PEO to react with FITC and noting fluorescence.",
  "description_provenance": [
    "Author Email: rragheb@vt.edu",
    "Advisor Email: srturner@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:12Z (GMT). No. of bitstreams: 1 RTRaghebDissertation.pdf: 120390194 bytes, checksum: 222d769f46d25c6e18dd0b195b9642da (MD5)   Previous issue date: 2008-03-28"
  ],
  "handle": "26719",
  "identifier_other": "etd-04092008-121127",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04092008-121127/",
  "identifier_uri": "http://hdl.handle.net/10919/26719",
  "publisher": "Virginia Tech",
  "relation_haspart": "RTRaghebDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "confined impingement jet mixing",
    "nanoprecipitation",
    "surface-functionalized",
    "nanospheres",
    "magnetic",
    "magnetite",
    "poly(ethylene oxide)",
    "L-lactide)",
    "poly(D",
    "polylactide"
  ],
  "title": "Synthesis and Characterization of Surface-Functionalized Magnetic Polylactide Nanospheres",
  "type": "Dissertation"
}