{
  "contributor_author": "Richardson, Robert Jeryl",
  "contributor_committeechair": "Wilson, Henry P.",
  "contributor_committeemember": [
    "Hagood, Edward Scott Jr.",
    "Orcutt, David M.",
    "Parrish, David J.",
    "Hatzios, Kriton K."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:09:10Z",
  "date_adate": "2002-04-29",
  "date_available": "2014-03-14T20:09:10Z",
  "date_issued": "2002-04-01",
  "date_rdate": "2003-04-29",
  "date_sdate": "2002-04-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Incorporating the Experimental Herbicide CGA 362622 into Cotton Weed Management Programs in Virginia Robert J. Richardson (ABSTRACT)      As the importance of cotton (Gossypium hirsutum L.) to Virginia crop growers has increased, so has the need for more efficient weed control programs.  Current cotton herbicides do not control all broadleaf weeds over the entire growing season, and many cotton herbicides must be applied at specific growth stages in order to reduce crop injury.  CGA 362622 is an experimental sulfonylurea herbicide that controls many broadleaf weeds at low use rates.  Field, greenhouse, and laboratory studies were conducted to evaluate the potential benefit of CGA 362622 to Virginia cotton growers.  Postemergence applications of CGA 362622 resulted in moderate crop response that proved transient in all instances and did not affect cotton yield.  Broadleaf weed control from herbicide combinations with CGA 362622 generally controlled weeds more consistently than individual herbicide applications.  Timely applications of CGA 362622 controlled common ragweed (Ambrosia artemisiifolia L.), common lambsquarters (Chenopodium album L.), annual morningglory species (Ipomoea spp.), and common cocklebur (Xanthium strumarium L.).  However, CGA 362622 applications generally did not control spurred anoda (Anoda cristata (L.) Schlecht.), jimsonweed (Datura stramonium L.), velvetleaf (Abutilon theophrasti Medicus), or annual grass species, but combination treatments of CGA 362622 plus pyrithiobac did control velvetleaf, spurred anoda, and jimsonweed.  Combinations of CGA 362622 plus glyphosate controlled common lambsquarters and smooth pigweed (Amaranthus hybridus L.) better than glyphosate alone, and in most instances controlled annual morningglory species better than glyphosate applied alone.  Timely applications of CGA 362622 plus bromoxynil controlled velvetleaf, smooth pigweed, common ragweed, common lambsquarters, and common cocklebur.  Spurred anoda control was generally not acceptable from CGA 362622, bromoxynil, or CGA 362622 and bromoxynil combinations.  In laboratory studies, results supported differential absorption, translocation, and metabolism as the main factors for differential tolerance of cotton, spurred anoda, and smooth pigweed to CGA 362622.  Rapid translocation and a slow rate of metabolism likely explains the susceptibility of smooth pigweed to this herbicide, while reduced absorption and translocation plus rapid metabolism contribute to CGA 362622 tolerance in cotton.  Limited translocation may also explain the intermediate tolerance of spurred anoda to the herbicide CGA 362622.",
  "description_provenance": [
    "Author Email: rorichar@vt.edu",
    "Advisor Email: shagood@vt.edu",
    "Advisor Email: dmorcutt@vt.edu",
    "Advisor Email: hwilson@vt.edu",
    "Advisor Email: dparrish@vt.edu",
    "Advisor Email: hatzios@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:10Z (GMT). No. of bitstreams: 11 rorichar_cga_04_chapter_1.pdf: 2800675 bytes, checksum: 3f363c9f84cb7691d6e2f677070a7dab (MD5) rorichar_cga_08_chapter_5.pdf: 50314 bytes, checksum: 6ae84a5cf5a85244b2fd4506845ee7da (MD5) rorichar_cga_09_chapter_6.pdf: 2624415 bytes, checksum: fa525916c457aaf87d7475084f1df5fd (MD5) rorichar_cga_05_chapter_2.pdf: 47132 bytes, checksum: e45cc58002ad24b47852b30ddd0404da (MD5) rorichar_cga_03_toc_etal.pdf: 20734 bytes, checksum: 7528c7421302d30470a51a4f0e879d64 (MD5) rorichar_cga_10_chapter_7.pdf: 13519 bytes, checksum: 63b2ed8a479258dcc5263b6cc10a665a (MD5) rorichar_cga_01_title.pdf: 11560 bytes, checksum: 619e8086b1bb05297551410a6cfd69e6 (MD5) rorichar_cga_07_chapter_4.pdf: 58549 bytes, checksum: 01029558874a2269c3cddc2b68b101d9 (MD5) rorichar_cga_02_acknowledgements.pdf: 9671 bytes, checksum: eb1b0a484097a3d6f4a39045f280220e (MD5) rorichar_cga_06_chapter_3.pdf: 63403 bytes, checksum: d4266cb22a33ed1f179cf0424fc57099 (MD5) rorichar_cga_11_vitae.pdf: 11314 bytes, checksum: 9a8e56c4a9ccddb9a023652b117805d0 (MD5)   Previous issue date: 2002-04-01"
  ],
  "handle": "26711",
  "identifier_other": "etd-04092002-141602",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04092002-141602/",
  "identifier_uri": "http://hdl.handle.net/10919/26711",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "rorichar_cga_04_chapter_1.pdf",
    "rorichar_cga_08_chapter_5.pdf",
    "rorichar_cga_09_chapter_6.pdf",
    "rorichar_cga_05_chapter_2.pdf",
    "rorichar_cga_03_toc_etal.pdf",
    "rorichar_cga_10_chapter_7.pdf",
    "rorichar_cga_01_title.pdf",
    "rorichar_cga_07_chapter_4.pdf",
    "rorichar_cga_02_acknowledgements.pdf",
    "rorichar_cga_06_chapter_3.pdf",
    "rorichar_cga_11_vitae.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "sulfonylurea",
    "CGA 362622",
    "cotton weed control"
  ],
  "title": "Incorporating the Experimental Herbicide CGA 362622 into Cotton Weed Management Programs in Virginia",
  "type": "Dissertation"
}