{
  "contributor_author": "Smith, Jonathan Cole",
  "contributor_committeechair": "Sherali, Hanif D.",
  "contributor_committeemember": [
    "Nachlas, Joel A.",
    "Sarin, Subhash C.",
    "Bish, Ebru K.",
    "Trani, Antoino A."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:10Z",
  "date_adate": "2000-04-20",
  "date_available": "2014-03-14T20:09:10Z",
  "date_issued": "2000-04-04",
  "date_rdate": "2001-04-20",
  "date_sdate": "2000-04-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In formulating discrete optimization problems, it is not only important to have a correct mathematical model, but to have a well structured model that can be solved effectively.  Two important characteristics of a general integer or mixed-integer program are its size (the number of constraints and variables in the problem), and its strength or tightness (a measure of how well it approximates the convex hull of feasible solutions).  In designing model formulations, it is critical to ensure a proper balance between compactness of the representation and the tightness of its linear relaxation, in order to enhance its solvability.  In this dissertation, we consider these issues pertaining to the modeling of mixed-integer 0-1 programming problems in general, as well as in the context of several specific real-world applications, including a telecommunications network design problem and an airspace management problem. <p>   We first consider the Reformulation-Linearization Technique (RLT) of Sherali and Adams  and explore the generation of reduced first-level representations for mixed-integer 0-1 programs that tend to retain the strength of the full first-level linear programming relaxation.  The motivation for this study is provided by the computational success of the first-level RLT representation (in full or partial form) experienced by several researchers working on various classes of problems.  We show that there exists a first-level representation having only about half the RLT constraints that yields the same lower bound value via its relaxation.  Accordingly, we attempt to a priori predict the form of this representation and identify many special cases for which this prediction is accurate.  However, using various counter-examples, we show that this prediction as well as several variants of it are not accurate in general, even for the case of a single binary variable.  Since the full first-level relaxation produces the convex hull representation for the case of a single binary variable, we investigate whether this is the case with respect to the reduced first-level relaxation as well, and show similarly that it holds true only for some special cases.  Empirical results on the prediction capability of the reduced, versus the full, first-level representation demonstrate a high level of prediction accuracy on a set of random as well as practical, standard test problems.     <p>   Next, we focus on a useful modeling concept that is frequently ignored while formulating discrete optimization problems.  Very often, there exists a natural symmetry inherent in the problem itself that, if propagated to the model, can hopelessly mire a branch-and-bound solver by burdening it to explore and eliminate such alternative symmetric solutions.  We discuss three applications where such a symmetry arises.  For each case, we identify the indistinguishable objects in the model which create the problem symmetry, and show how imposing certain decision hierarchies within the model significantly enhances its solvability.  These hierarchies render an otherwise virtually intractable formulation computationally viable using commercial software.  For the first problem, we consider a problem of minimizing the maximum dosage of noise to which workers are exposed while working on a set of machines.  We next examine a problem of minimizing the cost of acquiring and utilizing machines designed to cool large facilities or buildings, subject to minimum operational requirements.  For each of these applications, we generate realistic test beds of problems.  The decision hierarchies allow all previously intractable problems to be solved relatively quickly, and dramatically decrease the required computational time for all other problems.  For the third problem, we investigate a network design problem arising in the context of deploying synchronous optical networks (SONET) using a unidirectional path switched ring architecture, a standard of transmission using optical fiber technology.  Given several rings of this type, the problem is to find a placement of nodes to possibly multiple rings, and to determine what portion of demand traffic between node pairs spanned by each ring should be allocated to that ring.  The constraints require that the demand traffic between each node pair should be satisfiable given the ring capacities, and that no more than a specified maximum number of nodes should be assigned to each ring.  The objective function is to minimize the total number of node-to-ring assignments, and hence, the capital investment in add-drop multiplexer equipments.  We formulate the problem as a mixed-integer programming model, and propose several alternative modeling techniques designed to improve the mathematical representation of this problem.  We then develop various classes of valid inequalities for the problem along with suitable separation procedures for tightening the representation of the model, and accordingly, prescribe an algorithmic approach that coordinates tailored routines with a commercial solver (CPLEX).  We also propose a heuristic procedure which enhances the solvability of the problem and provides bounds within 5-13% of the optimal solution.  Promising computational results that exhibit the viability of the overall approach and that lend insights into various modeling and algorithmic constructs are presented. <p>   Following this we turn our attention to the modeling and analysis of several issues related to airspace management.  Currently, commercial aircraft are routed along certain defined airspace corridors, where safe minimum separation distances between aircraft may be routinely enforced.  However, this mode of operation does not fully utilize the available airspace resources, and may prove to be inadequate under future National Airspace (NAS) scenarios involving new concepts such as Free-Flight.  This mode of operation is further compounded by the projected significant increase in commercial air traffic.  (Free-Flight is a paradigm of aircraft operations which permits the selection of more cost-effective routes for flights rather than simple traversals between designated way-points, from various origins to different destinations.)   <p>   We begin our study of Air Traffic Management (ATM) by first developing an Airspace Sector Occupancy Model (AOM) that identifies the occupancies of flights within three dimensional (possibly nonconvex) regions of space called sectors.  The proposed iterative procedure effectively traces each flight's progress through nonconvex sector modules which comprise the sectors.  Next, we develop an Aircraft Encounter Model (AEM), which uses the information obtained from AOM to efficiently characterize the number and nature of blind-conflicts (i.e., conflicts under no avoidance or resolution maneuvers) resulting from a selected mix of flight-plans. Besides identifying the existence of a conflict, AEM also provides useful information on the severity of the conflict, and its geometry, such as the faces across which an intruder enters and exits the protective shell or envelope of another aircraft, the duration of intrusion, its relative heading, and the point of closest approach.  For purposes of evaluation and assessment, we also develop an aggregate metric that provides an overall assessment of the conflicts in terms of their individual severity and resolution difficulty.  We apply these models to real data provided by the Federal Aviation Administration (FAA) for evaluating several Free-Flight scenarios under wind-optimized and cruise-climb conditions.   <p>   We digress at this point to consider a more general collision detection problem that frequently arises in the field of robotics.  Given a set of bodies with their initial positions and trajectories, we wish to identify the first collision that occurs between any two bodies, or to determine that none exists.  For the case of bodies having linear trajectories, we construct a convex hull representation of the integer programming model of Selim and Almohamad, and exhibit the relative effectiveness of solving this problem via the resultant linear program.  We also extend this analysis to model a situation in which bodies move along piecewise linear trajectories, possibly rotating at the end of each linear translation.  For this case, we again compare an integer programming approach with its linear programming convex hull representation, and exhibit the relative effectiveness of solving a sequence of problems based on applying the latter construct to each time segment. <p>   Returning to Air Traffic Management, another future difficulty in airspace resource utilization stems from a projected increase in commercial space traffic, due to the advent of Reusable Launch Vehicle (RLV) technology.  Currently, each shuttle launch cordons off a large region of Special Use Airspace (SUA) in which no commercial aircraft are permitted to enter for the specified duration.  Of concern to airspace planners is the expense of routinely disrupting air traffic, resulting in circuitous diversions and delays, while enforcing such SUA restrictions.  To provide a tool for tactical and planning purposes in such a context within the framework of a coordinated decision making process between the FAA and commercial airlines, we develop an Airspace Planning Model (APM).  Given a set of flights for a particular time horizon, along with (possibly several) alternative flight-plans for each flight that are based on delays and diversions due to special-use airspace (SUA) restrictions prompted by launches at spaceports or weather considerations, this model prescribes a set of flight-plans to be implemented.  The model formulation seeks to minimize a delay and fuel cost based objective function, subject to the constraints that each flight is assigned one of the designated flight-plans, and that the resulting set of flight-plans satisfies certain specified workload, safety, and equity criteria.  These requirements ensure that the workload for air-traffic controllers in each sector is held under a permissible limit, that any potential conflicts which may occur are routinely resolvable, and that the various airlines involved derive equitable levels of benefits from the overall implemented schedule.  In order to solve the resulting 0-1 mixed-integer programming problem more effectively using commercial software (CPLEX-MIP), we explore the use of various facetial cutting planes and reformulation techniques designed to more closely approximate the convex hull of feasible solutions to the problem.  We also prescribe a heuristic procedure which is demonstrated to provide solutions to the problem that are either optimal or are within 0.01% of optimality.  Computational results are reported on several scenarios based on actual flight data obtained from the Federal Aviation Administration (FAA) in order to demonstrate the efficacy of the proposed approach for air traffic management (ATM) purposes.  In addition to the evaluation of these various models, we exhibit the usefulness of this airspace planning model as a strategic planning tool for the FAA by exploring the sensitivity of the solution provided by the model to changes both in the radius of the SUA formulated around the spaceport, and in the duration of the launch-window during which the SUA is activated.",
  "description_provenance": [
    "Author Email: josmit13@vt.edu",
    "Advisor Email: hanifs@vt.edu",
    "Advisor Email: nachlas@vt.edu",
    "Advisor Email: sarins@vt.edu",
    "Advisor Email: ebru@vt.edu",
    "Advisor Email: vuela@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:10Z (GMT). No. of bitstreams: 1 etd.pdf: 1591082 bytes, checksum: 01f302fb8345d653b787e342f153c764 (MD5)   Previous issue date: 2000-04-04"
  ],
  "handle": "26710",
  "identifier_other": "etd-04092000-10070034",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04092000-10070034/",
  "identifier_uri": "http://hdl.handle.net/10919/26710",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Mathematical Modeling",
    "Reformulation-Linearization Technique",
    "Cutting Plane Generation",
    "Telecommunications",
    "Integer Programming"
  ],
  "title": "Tight Discrete Formulations to Enhance Solvability with Applications to Production, Telecommunications, and Air Transportation Problems",
  "type": "Dissertation"
}