{
  "contributor_author": "Hogan, Shelly Patricia",
  "contributor_committeechair": "Zhou, Kequan Kevin",
  "contributor_committeemember": [
    "Duncan, Susan E.",
    "O'Keefe, Sean F.",
    "Bevan, David R.",
    "Liu, Dongmin"
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:09:13Z",
  "date_adate": "2009-04-30",
  "date_available": "2014-03-14T20:09:13Z",
  "date_issued": "2009-04-02",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-04-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Research was conducted to investigate the effect of phenolic compounds derived from inherently rich antioxidant grape extracts (GE) on α-glucosidase inhibitory activity in vitro and in vivo blood glucose control, oxidative stress, and inflammation associated with obesity-induced type 2 diabetes. Because intestinal α-glucosidase plays a key role in the digestion and absorption of complex carbohydrates, the inhibition of this enzyme is a metabolic target for managing diabetes by improving post-prandial blood glucose control. Initially, red Norton wine grape (Vitis aestivalis) and pomace extracts were evaluated and determined to have notable phenolic content and antioxidant properties. Next, grape skin (GSE) and pomace extract (GPE) were tested and both had in vitro yeast and mammalian α-glucosidase inhibitory activity. The GSE was 32-times more potent at inhibiting yeast α-glucosidase than acarbose, a commercial oral hypoglycemic agent. From HPLC and LC-MS analysis, three phenolics from the GSE (resveratrol, ellagic acid, and catechin) were identified as active inhibitory compounds. The acute administration of GPE (400 mg/kg bw) to mice reduced postprandial blood glucose level by 35% following an oral glucose tolerance test compared to the control. The daily supplementation (250 mg/kg bw) of GSE and GPE for 12-weeks to mice affected fasting blood glucose levels, oxidative stress, and inflammatory biomarkers associated with obesity and type 2 diabetes. At the end of the study, the GSE group gained significantly (P < 0.05) more weight (24.6 g) than the control, high fat, or GPE groups (11.2, 20.2, 19.6 g, respectively).  Both GSE and GPE groups had lower fasting blood glucose levels (119.3 and 134.2 mg/dL, respectively) compared to the high fat group (144.6 mg/dL). The 12-week supplementation of GSE was associated with a higher plasma oxygen radical absorbance capacity (ORAC), lower liver lipid peroxidation as measure by TBARS, and lower levels of inflammation as measured by plasma C-reactive protein compared to the high fat group. In conclusion, our collective observations from these studies provide insight into the potential effects of antioxidant rich grape extracts on diabetes-related biomarkers through a dual mechanism of antioxidant protection and specific inhibition of intestinal α-glucosidases.",
  "description_provenance": [
    "Author Email: hogans@vt.edu",
    "Advisor Email: duncans@vt.edu",
    "Advisor Email: kzhou@vt.edu",
    "Advisor Email: okeefes@vt.edu",
    "Advisor Email: drbevan@vt.edu",
    "Advisor Email: doliu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:13Z (GMT). No. of bitstreams: 1 HoganPhD_ETD_2.pdf: 1374105 bytes, checksum: c082d1098fa1179af254e1feebf9dadd (MD5)   Previous issue date: 2009-04-02"
  ],
  "handle": "26725",
  "identifier_other": "etd-04092009-154109",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04092009-154109/",
  "identifier_uri": "http://hdl.handle.net/10919/26725",
  "publisher": "Virginia Tech",
  "relation_haspart": "HoganPhD_ETD_2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "oxidative stress",
    "diabetes",
    "bioactive phenolic compounds",
    "alpha-glucosidase",
    "enzyme kinetics",
    "macromolecule",
    "Functional foods"
  ],
  "title": "Grape Extracts for Type 2 Diabetes Treatment Through Specific Inhibition of α-Glucosidase and Antioxidant Protection",
  "type": "Dissertation"
}