{
  "contributor_author": "Nielson, L. Reece",
  "contributor_committeechair": "Meszaros, Peggy S.",
  "contributor_committeecochair": "Miyazaki, Yasuo",
  "contributor_committeemember": [
    "Dolbin-MacNab, Megan L.",
    "Piercy, Fred P."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:13Z",
  "date_adate": "2009-05-01",
  "date_available": "2014-03-14T20:09:13Z",
  "date_issued": "2009-03-26",
  "date_rdate": "2009-05-01",
  "date_sdate": "2009-04-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Families play a key role in psychiatric emergency services (PES). Given the cost of PES in terms of dollars and restrictiveness, clients, families, providers, payers, and policymakers involved in these services need more understanding of how families affect these key PES outcomes. Marriage and family therapy theories offer frameworks for understanding family and provider system dynamics in PES. This study explores how family presence and family quality influence restrictiveness and cost of PES dispositions, and how they moderate the effect of suicide risk, homicide risk, and inability to care for self on those outcomes. The sample of 306 clients and 33 clinicians was drawn from the records of a mobile PES unit serving a rural area. A regression-based, quantitative methodology, Hierarchical Linear Modeling (HLM), was employed to explore associations between restrictiveness and client risk and family factors, as well as differences in dispositions between PES clinicians. In order to extend practical implications, the same questions were also examined in monetary terms by translating restrictiveness into cost of dispositions. Results show inability to care for self and suicide risk to be the strongest predictors of increased restrictiveness and cost. Family quality appeared to reduce restrictiveness but not cost and only when not considering interactions with individual risk factors. When interactions were considered, family quality exhibited a statistically significant disordinal interaction with inability to care for self. That is, when clients were unable to care for self, positive family quality worked toward increasing restrictiveness and cost, perhaps due to families seeking help for the client. However, when clients were able to care for self, positive family quality worked in the opposite direction (i.e., toward reducing restrictiveness and cost). Theoretical and practical implications of this interaction were considered. There was found no significant variability in dispositions and associated costs between clinicians, which may be evidence of standardized clinician training and procedures. Non-standardized instrumentation, lack of comparison with other programs or sites, and limited cell sample size are limitations of the study. This study shows the complexity of family systems in PES and provides basis for recommendations for future research and clinical practice.",
  "description_provenance": [
    "Author Email: nielson@vt.edu",
    "Advisor Email: yasuom@vt.edu",
    "Advisor Email: meszaros@vt.edu",
    "Advisor Email: mdolbinm@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:13Z (GMT). No. of bitstreams: 2 DISSERTATION-LReeceNielson-ETD-4-30-09.pdf: 1737241 bytes, checksum: 55799266b1403da30a789755eb0f2eca (MD5) DISSERTATION-IRBAPPROVAL-LReeceNielson-ETD-4-9-09.pdf: 253892 bytes, checksum: ad21831be7da1ea63738b77c4e6d8e60 (MD5)   Previous issue date: 2009-03-26"
  ],
  "handle": "26724",
  "identifier_other": "etd-04092009-112104",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04092009-112104/",
  "identifier_uri": "http://hdl.handle.net/10919/26724",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "DISSERTATION-LReeceNielson-ETD-4-30-09.pdf",
    "DISSERTATION-IRBAPPROVAL-LReeceNielson-ETD-4-9-09.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cost",
    "clinicians",
    "psychiatric emergency services",
    "marriage and family therapy",
    "Hierarchical Linear Modeling"
  ],
  "title": "Family and Clinician Effects on Costs of Psychiatric Emergency Services Dispositions",
  "type": "Dissertation"
}