{
  "contributor_author": "Hardy, Steven",
  "contributor_committeechair": "Vogelaar, Robert Bruce",
  "contributor_committeemember": [
    "Pitt, Mark L.",
    "Takeuchi, Tatsu",
    "Raghavan, Ramaswamy"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:09:14Z",
  "date_adate": "2010-05-06",
  "date_available": "2014-03-14T20:09:14Z",
  "date_issued": "2010-04-02",
  "date_rdate": "2010-05-06",
  "date_sdate": "2010-04-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Borexino solar neutrino detector is a real-time liquid scintillator detector designed to measure sub-MeV neutrinos. With its unprecedented level of radio-purity, Borexino is poised to provide the most precise measurements to-date of solar neutrino and geo-antineutrino ï¬ uxes. However, in order to reduce the systematic errors to sub-5% levels, the detector must be care- fully calibrated to understand, among other things, the position and energy reconstructions. To that end, the Virginia Tech component of the Borexino collaboration has constructed a system for deploying and locating calibration sources within the detector. The system was used in four separate calibration campaigns and deployed numerous sources in almost 300 locations throughout the detector. The data from the calibrations have already resulted in the reduction of several sources of systematic error by a factor of two or more. With the results from the calibration, the Borexino detector has entered a new era of low- energy, high-precision, neutrino detection. This work was supported by NSF Grant 0802114",
  "description_provenance": [
    "Author Email: shardy@vt.edu",
    "Advisor Email: vogelaar@vt.edu",
    "Advisor Email: pitt@vt.edu",
    "Advisor Email: takeuchi@vt.edu",
    "Advisor Email: raghavan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:14Z (GMT). No. of bitstreams: 2 Hardy_SE_D_2010.pdf: 15282532 bytes, checksum: 48443797756ffdfea5186a93a078495f (MD5) Hardy_SE_D_2010_Copyright.pdf: 545040 bytes, checksum: 1963ada3ed7b4a698d392153731839c3 (MD5)   Previous issue date: 2010-04-02"
  ],
  "handle": "26728",
  "identifier_other": "etd-04092010-132651",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04092010-132651/",
  "identifier_uri": "http://hdl.handle.net/10919/26728",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Hardy_SE_D_2010.pdf",
    "Hardy_SE_D_2010_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "source development",
    "calibration",
    "neutrino physics"
  ],
  "title": "Measuring the 7Be Neutrino Flux From the Sun: Calibration of the Borexino Solar Neutrino Detector",
  "type": "Dissertation"
}