{
  "contributor_author": "Volk Burgess, Susan Lizrene",
  "contributor_committeechair": "Curcio, Joan L.",
  "contributor_committeemember": [
    "Parson, Stephen R.",
    "Salmon, Richard G.",
    "Roesch, Maryanne",
    "Lewis, Mary Anne"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:15Z",
  "date_adate": "1999-04-20",
  "date_available": "2014-03-14T20:09:15Z",
  "date_issued": "1997-03-17",
  "date_rdate": "2000-04-20",
  "date_sdate": "1999-04-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to examine the events, processes, perceptions and changes that occurred as an elementary school faculty and a university faculty collaborated in a partnership formed by the creation of a Professional Development Academy (PDA).  The study described how an elementary school faculty and a university faculty collaborated as they implemented a PDA.  Research questions were:  (1) What contributing factors led to the school and university facultiesÆ Â­ collaboration during the first three years of the pilot PDA, 1993-1996?  (2) How did the school and university faculties collaborate for change during the first three years of the pilot PDA?  (3) As a result of collaboration between the school and university faculties during the first three years of the pilot PDA, what changes occurred at the school and university?  A descriptive case study approach was used to explore behaviors within these groups during the three pilot years of the PDA.  The study included interviews, and a review of documents and artifacts. Four classroom teachers were randomly selected from the elementary school, four professors were selected from the university and two administrators: one from the school and one from the university, were interviewed.  Responses from the interviewees were initially categorized into KaganÆ Â­s (1991) six categories of collaboration and into three sections: before the PDA began, during the three years of the PDA, and reflections at the end of the three pilot years of the PDA.  KaganÆ Â­s categories for collaboration are: formation, conceptualization, development, implementation, evaluation, and termination/reformation stages.  Documentation from the participants and PDA files were analyzed.   Six factors were found to contribute to collaboration between faculties: a wish to know the other colleagues personally; maintenance of  Æ Â±weÆ Â­re in this togetherÆ Â° attitude; willingness to accept additional responsibilities; investment in making the PDA work; discovery of opportunities for leadership and input; and synergy between coordinators and administrators.  There was evidence that collaboration occurred because of a welcoming and supportive climate; open communication; active involvement by both faculties; validation of teachers and professors; and support for goals and recommendations.",
  "description_provenance": [
    "Author Email: sburgess@cstone.net",
    "Advisor Email: sparson@vt.edu",
    "Advisor Email: gsalmon@vt.edu",
    "Advisor Email: jcurcio@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:15Z (GMT). No. of bitstreams: 1 Burgess.PDF: 407983 bytes, checksum: 8857d9a83f50d2898e93c0fe5c3e9cff (MD5)   Previous issue date: 1997-03-17"
  ],
  "handle": "26734",
  "identifier_other": "etd-040999-111319",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-040999-111319/",
  "identifier_uri": "http://hdl.handle.net/10919/26734",
  "publisher": "Virginia Tech",
  "relation_haspart": "Burgess.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Professional Development Academy",
    "Internship",
    "Staff Development",
    "Collaboration",
    "Student Teaching",
    "Colleagueship"
  ],
  "title": "A Study of the Collaboration Between School And University Faculties In A Professional Development Academy",
  "type": "Dissertation"
}