{
  "contributor_author": "Murphy, LaShonia Michelle",
  "contributor_committeecochair": "Wolf, James F.",
  "contributor_committeemember": [
    "Koebel, Charles Theodore",
    "Dudley, Larkin S.",
    "Dull, Matthew Martin"
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:09:14Z",
  "date_adate": "2012-04-26",
  "date_available": "2014-03-14T20:09:14Z",
  "date_issued": "2012-03-29",
  "date_rdate": "2012-04-26",
  "date_sdate": "2012-04-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examines the allocation of funds over the entire tenure of the HOPE VI, a public housing competitive grant, to determine if the program adhered to its program goals.  This study focuses on the application and selection phases of HOPE VI.  Moreover, this study looks to the scholarship on redistributive politics to gain an understanding of any deviations from projected program results.  Within the context of an institutional policy analysis approach, this dissertation explores the consequences of using competitive grants as a policy tool for the HOPE VI program and postulates on its effects on program outcomes.  An empirical analysis of the grant applicants and grant recipients finds that overall, large developments had a better rate in receiving grants and received more grants on their initial attempt.  However, small public housing developments, which were not the focus of the HOPE VI program, submitted four times as many applications with a success rate of fifty-two percent.  Overtime, cities with smaller populations are awarded more grants.",
  "description_provenance": [
    "Author Email: lamurph1@vt.edu",
    "Advisor Email: tkoebel@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: mdull@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:14Z (GMT). No. of bitstreams: 1 Murphy_LM_D_2012.pdf: 2642735 bytes, checksum: ae0caf0f8d155bd5580fab1dfbd24a61 (MD5)   Previous issue date: 2012-03-29"
  ],
  "handle": "26731",
  "identifier_other": "etd-04092012-115502",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04092012-115502/",
  "identifier_uri": "http://hdl.handle.net/10919/26731",
  "publisher": "Virginia Tech",
  "relation_haspart": "Murphy_LM_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "recipients",
    "applicants",
    "competitive grants",
    "HOPE VI"
  ],
  "title": "The Allocation of Funds within HOPE VI: Applicants and Recipients",
  "type": "Dissertation"
}