{
  "contributor_author": "Uttaro, Michael T.",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Hamilton, P.",
    "Cline, Marvin Gerald",
    "Wiswell, Albert K.",
    "Morris, Linda E."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:16Z",
  "date_adate": "2002-04-17",
  "date_available": "2014-03-14T20:09:16Z",
  "date_issued": "2002-03-26",
  "date_rdate": "2003-04-17",
  "date_sdate": "2002-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research explored the process by which several experienced and successful law enforcement officials arrive at the most effective method of decision-making.  It draws from traditional decision theory models, but uses the naturalistic decision-making (NDM) paradigm as its guide.   Studies framed by the NDM model have included fighter and commercial pilots, health care professionals, battle commanders, and others.  Missing, however, are studies of law-enforcement officers making judgments and decisions under operational conditions.  This examination utilized qualitative case study methods of participant observation and focused interviews to collect data and followed Lincoln and Guba's case study structure by identifying the problem, the context, the issues, and the lessons learned.  Coding and analysis of the data conformed to the model initially outlined by Strauss (1987) and later redefined by Corbin and Strauss (1990), including open coding, axial coding, and selective coding.   The findings on the decision-making/judgments processes of three experienced law enforcement officials revealed that each officer strived to control the impending event utilizing a number of rational and intuitive processes.  One practice was scanning for detail embedded in the situation and utilizing this information for subsequent development of a cognitive map.  Additionally, all the officers pursued a comprehensive preparation phase that consisted of the creation of worst-case scenarios and planning tactics to effectively respond to these cases.  When decision-making was required, the information available through the scanning process and the preparation phases acted as the foundation for the development of the cognitive map that led each officer to successful resolution of their respective cases.   This study concluded with areas requiring further research and made recommendation that seek to improve police training practices.",
  "description_provenance": [
    "Author Email: mikeuttaro@cs.com",
    "Made available in DSpace on 2014-03-14T20:09:16Z (GMT). No. of bitstreams: 3 Appendices.pdf: 2684659 bytes, checksum: b018d32e1c8886dc1d717c7768393bf1 (MD5) Chapters_1-5.pdf: 865367 bytes, checksum: 32960f2c103bc6a7a0279b55eabab69e (MD5) TOC.pdf: 126494 bytes, checksum: b2daca80285bd8216f1c1b35cb1156f2 (MD5)   Previous issue date: 2002-03-26"
  ],
  "handle": "26739",
  "identifier_other": "etd-04102002-114630",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102002-114630/",
  "identifier_uri": "http://hdl.handle.net/10919/26739",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Appendices.pdf",
    "Chapters_1-5.pdf",
    "TOC.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Law Enforcement",
    "Police",
    "Decisions"
  ],
  "title": "NATURALISTIC DECISION-MAKING IN LAW ENFORCEMENT PRACTICE â   EXPLORING THE PROCESS",
  "type": "Dissertation"
}