{
  "contributor_author": "Kretzer, Sandra A.",
  "contributor_committeechair": "Glenn, William J.",
  "contributor_committeemember": [
    "Mallory, Walter D.",
    "Patrizio, Kami M.",
    "Payne, Elizabeth T."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:14Z",
  "date_adate": "2012-04-13",
  "date_available": "2014-03-14T20:09:14Z",
  "date_issued": "2012-03-28",
  "date_rdate": "2012-04-13",
  "date_sdate": "2012-04-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The use and analysis of data has become a keystone in national policy for educational improvement and a foundational condition in the award of federal grant monies (U.S. Department of Education, 2008, 2009a, 2009b, 2010).  Principals are expected to lead their schools in the use of data and are accountable for adequate yearly progress (AYP) for the No Child Left Behind Act (NCLB).  Effective use of data can move educators toward student centric learning plans and interventions which improve achievement.  While current literature emphasizes the importance of assessment data used to guide sound instructional decisions, gathering scores and generating reports by grade and level does little at individual schools unless there is strong site-based leadership to guide faculty and staff in targeting areas of improvement, implementing a plan, monitoring progress, and adjusting actions.       This qualitative case study describes how the principalâ  s leadership guided a journey of data-focused decision making at one middle school.  This dissertation describes use of data in decision-making processes to promote student learning from the perspective of a school which has been implementing data-focused decision making for several years and was selected for its established use of student assessment data.  This research focused on the processes individuals and groups use to better understand and use data within a school context and the role of school leaders in supporting these actions.      The intent of this case study is to describe and understand how school leaders make the use of data an integral part of the operation within a middle school in a large suburban mid-Atlantic school district.  By looking at how principals embed data analysis and interpretation in the decision-making processes of the school and engage teachers in the use of data to promote student learning, findings could be useful as a guide to other educational leaders as they implement site based actions and related professional development for school-based leaders and teachers.",
  "description_provenance": [
    "Author Email: sandk07@vt.edu",
    "Advisor Email: wglenn@vt.edu",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: kpatrizi@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:14Z (GMT). No. of bitstreams: 3 Kretzer_SA_D_2012_IRB.pdf: 799355 bytes, checksum: 8eb5bc0d7c39ea321b69555407366c80 (MD5) Kretzer_SA_D_2012_Copyright.pdf: 145261 bytes, checksum: 5639cddac75fc389513a1b5e6be8c604 (MD5) Kretzer_SA_D_2012.pdf: 1788115 bytes, checksum: 1a45a6e0a195aa55c171d200acd72e70 (MD5)   Previous issue date: 2012-03-28"
  ],
  "handle": "26733",
  "identifier_other": "etd-04092012-144506",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04092012-144506/",
  "identifier_uri": "http://hdl.handle.net/10919/26733",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Kretzer_SA_D_2012_IRB.pdf",
    "Kretzer_SA_D_2012_Copyright.pdf",
    "Kretzer_SA_D_2012.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "professional learning communities",
    "data-driven decision making",
    "school improvement",
    "data use"
  ],
  "title": "Data-Focused Decision Making: One School's Journey",
  "type": "Dissertation"
}