{
  "contributor_author": "Bolt, Melesa Altizer",
  "contributor_committeechair": "Killough, Larry N.",
  "contributor_committeemember": [
    "Brown, Robert M.",
    "Anderson, John C.",
    "Brinberg, David L.",
    "Sen, Tarun K."
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:09:15Z",
  "date_adate": "1999-04-16",
  "date_available": "2014-03-14T20:09:15Z",
  "date_issued": "1999-02-12",
  "date_rdate": "2000-04-16",
  "date_sdate": "1999-04-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The need to develop appropriate computer training techniques has led to an explosion of research in information systems.  One of the most recent studies was conducted by Compeau and Higgins (1995) in which two training methods were examined in the context of Social Cognitive Learning Theory (Bandura, 1977, 1978).  The training methods examined were traditional lecture-based training and behavior modeling.   <p> \tBased on various anomalies found in the Compeau and Higgins study, this paper introduced a moderating variable, task complexity, into their model and also attempted to replicate their original experiment.  This study also incorporated an additional training method, Computer Aided Instruction (CAI), which was examined in an experiment by Gist, Schwoerer, and Rosen (1989). <p> \tIt was hypothesized that task complexity has a moderating effect on the relationships between behavior modeling and performance, between behavior modeling and self-efficacy, and between self-efficacy and performance.  Finally, an empirical investigation was performed to determine the relative effectiveness of the three training methods examined. <p> \tTo test these hypothesized relationships, an experiment was conducted that examined prior performance, self-efficacy, outcome expectations, and actual performance at two levels of task complexity for each of the three training methods. <p> \tThe data were analyzed using a combination of multivariate and univariate analyses of variance and a structural equation modeling software package, AMOS©.  Five of the original nine hypotheses from the Compeau and Higgins study were fully supported; however, none of the task complexity and only one of the avoidance behavior hypotheses were supported.  Possible causes of this lack of support were multi-dimensionality of constructs or the need to examine task dimensions other than complexity. <p> \tRelevant findings in this study included (1) a positive significant relationship between behavior modeling and final performance, (2) a positive significant relationship between prior performance and the endogenous constructs in the model:  computer self-efficacy, outcome expectations, and final performance, and (3) a ranking of the three training methods in terms of effectiveness.  Although behavior modeling produced the best performance results at all levels of task complexity, CAI was equally effective when the level of complexity was high.  For low complexity tasks, however, CAI was the least effective method examined.",
  "description_provenance": [
    "Author Email: maltizer@kenan.com",
    "Advisor Email: larry@vt.edu",
    "Advisor Email: dbrinber@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:15Z (GMT). No. of bitstreams: 11 APPENDB.pdf: 23057 bytes, checksum: ea7f2bdbae43b8075c3548e406623509 (MD5) APPENDA.PDF: 58890 bytes, checksum: c3a7f0b5b3046f78901477efc2d48d5e (MD5) BIBLIO.PDF: 9927 bytes, checksum: f89de7504107b2954d97404f23a7cbc8 (MD5) CHP7.PDF: 16650 bytes, checksum: 15e301b99472f1e7c5d2ae2abcdcbb55 (MD5) CHP6.PDF: 105822 bytes, checksum: d1ae9985d5de1611af1ec5dd3a3daec3 (MD5) CHP5.PDF: 27193 bytes, checksum: c1822053b203502d43eb88727acb0f83 (MD5) CHP4.PDF: 18717 bytes, checksum: 207616f7289875380b1679604dcfea99 (MD5) CHP3.PDF: 9881 bytes, checksum: 9ab32729653c0ddfb19461b7daee9798 (MD5) CHP2.PDF: 21705 bytes, checksum: ed65c34d4a8b08393dfa3d3f5af93d55 (MD5) CHP1.PDF: 50108 bytes, checksum: 6d08c0ca7f317365cb180d6e5e5eb31c (MD5) ETD.PDF: 17559 bytes, checksum: 3acb915d6cedcd87d47c87f6460a7250 (MD5)   Previous issue date: 1999-02-12"
  ],
  "handle": "26736",
  "identifier_other": "etd-040999-201108",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-040999-201108/",
  "identifier_uri": "http://hdl.handle.net/10919/26736",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "APPENDB.pdf",
    "APPENDA.PDF",
    "BIBLIO.PDF",
    "CHP7.PDF",
    "CHP6.PDF",
    "CHP5.PDF",
    "CHP4.PDF",
    "CHP3.PDF",
    "CHP2.PDF",
    "CHP1.PDF",
    "ETD.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "task complexity",
    "self-efficacy",
    "behavior modeling",
    "CAI",
    "social cognitive"
  ],
  "title": "The Social Cognitive Model for Computer Training:  An Experimental Investigation",
  "type": "Dissertation"
}