{
  "contributor_author": "McGee, Michael K.",
  "contributor_committeechair": "Barfield, Woodrow S.",
  "contributor_committeemember": [
    "Kleiner, Brian M.",
    "Hix, Deborah S.",
    "Dingus, Thomas A.",
    "Bohn, Jan Helge"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:15Z",
  "date_adate": "2000-04-24",
  "date_available": "2014-03-14T20:09:15Z",
  "date_issued": "1999-09-24",
  "date_rdate": "2001-04-24",
  "date_sdate": "2000-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Augmented reality, the superimposing of graphics or text onto an actual visual scene, is intended to enhance a user's understanding of the real world.  This research examines the  perceptual, cognitive, and human factors implications of combining integrally designed computer-generated imagery with real world scenes.  Three experiments were conducted to test the theoretical and practical consequences of integral perception in augmented reality.   <p> The first experiment was a psychophysical study that had participants subjectively assess the integrality of 32 scenes comprising four different augmented reality object environments (computer, brain, text, and liquid dynamic model), projected at two transparency levels (opaque, and semi-transparent), and presented with four different graphic textures (color, grayscale, white, and wireframe).   <p> The second experiment expanded the psychophysical integrality assessment of augmented scenes to 32 different images composed of four new environments (housing development, computer lab, planetary photo, and trees in countryside), with multiple computer-generated graphics (two, four, six, and eight), at two levels of integrality as defined by experiment one (high, low).    <p> The third experiment was an applied study that had two phases: 1) learning tasks using three augmented environments; and, 2) assembly tasks using eight augmented video instructions.  The computer-generated graphics for each phase of experiment three were presented at two levels of integrality (high, low) as defined by experiment one.   <p>\t\t\t\t\t\t\t\t The primary results of the three experiments show that augmented reality scenes with computer-generated imagery presented transparently and in color were perceived most integrally; increasing the number of graphics from two to eight decreased integral perception; and, high integral graphics aided performance in learning and real assembly tasks.   <p> From the statistical results and experimenter observation of the three experiments, guidelines for designing integrally perceived graphics in augmented environments were compiled based on principles of human factors, perception, and graphic design.  The key themes of the design guidelines were: 1) maintaining true shape information in the computer-generated graphics  2) using highly realistic graphics for naturalistic augmented settings; 3) considering the hardware limitations of the augmented system, particularly the display; and, 4) designing appropriately for the task (simple, complex, hands-on, cognitive, dynamic, static, etc.).",
  "description_provenance": [
    "Author Email: mmcgee_mkm@hotmail.com",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: hix@vt.edu",
    "Advisor Email: tdingus@ctr.vt.edu",
    "Advisor Email: bohn@vt.edu",
    "Advisor Email: barfield@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:15Z (GMT). No. of bitstreams: 1 mcgee.PDF: 1979311 bytes, checksum: e0c3c71a2ae73826cfb202b200a75a3b (MD5)   Previous issue date: 1999-09-24"
  ],
  "handle": "26737",
  "identifier_other": "etd-04102000-02150054",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102000-02150054/",
  "identifier_uri": "http://hdl.handle.net/10919/26737",
  "publisher": "Virginia Tech",
  "relation_haspart": "mcgee.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "augmented reality",
    "augmented environments",
    "integral perception"
  ],
  "title": "Integral Perception in Augmented Reality",
  "type": "Dissertation"
}