{
  "contributor_author": "Manley, Robert Adam",
  "contributor_committeechair": "Price, William T. Jr.",
  "contributor_committeemember": [
    "Vogler, Daniel E.",
    "Redican, Kerry J.",
    "Clark, Steven",
    "Stewart, Daisy L."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:09:14Z",
  "date_adate": "2010-04-27",
  "date_available": "2014-03-14T20:09:14Z",
  "date_issued": "2010-03-26",
  "date_rdate": "2010-04-27",
  "date_sdate": "2010-04-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to identify the impact the 1990 amendments to Carl D. Perkins Career and Applied Technology Act within-state allocation of federal funds had on the operational infrastructure of career and technical education (CTE) in Virginia as specifically related to the overall quality of secondary CTE programs. In the 1990 Perkins Act, Section 102 mandated that 75% of the within-state allotment go directly to local secondary and postsecondary institutions that offered CTE programs. The remaining 25% of funding was divided among the following state-administered programs and agencies: (a) state administration (5%), (b) state leadership (8.5%), (c) corrections (1%), and (d) equity programs (10%) (AVA, 1992; U.S. Congress, 1984). This change to the within-state allocation formula was significantly different from previous Perkins Acts as well as the trends in educational policy at that time (NCRVE, 1991). In the 1998 reauthorization of Perkins, the localities allotment increased to 85% of within-state funding. A three round modified Policy Delphi technique was used to identify and rate the consequences of the within-state allocation amendments from a panel of CTE local administrators, state administrators, and university researchers and/or teacher educators. These participants worked within their CTE positions in Virginia before and after the enactment of 1990 Perkins Act. A total of 54 participants began Round 1 and 30 completed Round 3 for a 56% participation rate. A total of 223 unique consequences were identified and rated for relevancy to the within-state funding formula change and effect on the operation of CTE in Virginia.  One hundred sixty-one consequences were deemed relevant within and/or between all position levels (local, state, and university). All position levels deemed 42 consequences as relevant to the within-state funding formula change.  Of those 42 consequences, 35 received the same effect (positive or negative) among all position levels.  The findings of this study suggest that the changes to the within-state funding formula and its accompanying amendments did have a negative effect on the operation of secondary CTE in Virginia. More specifically, the changes to the Perkins Act this study examined seemed to adversely effect CTE teacher education, state-level CTE research initiatives, and state-level CTEâ  s ability to provide localities with hands-on technical assistance, professional and leadership development, and coordination. The findings also suggest the legislative changes negatively altered the manner in which program evaluation occurred within the state by decreasing the state-level assistance for developing methods of program evaluation. In other words, the findings of this study seem to suggest there is a lack of leadership, development, and direction within Virginiaâ  s CTE program. The researcher recommends that members of Congress charged with reauthorizing the Perkins legislation should review the current within-state funding formula to determine if it is the most effective funding formula for helping local and state-level CTE carry out the purpose of the legislation.",
  "description_provenance": [
    "Author Email: adam.manley@wmich.edu",
    "Advisor Email: wprice@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:14Z (GMT). No. of bitstreams: 1 Manley_RA_D_2010.pdf: 3339596 bytes, checksum: 066d8b9e671b1b21884e5e7a4e1253d3 (MD5)   Previous issue date: 2010-03-26"
  ],
  "handle": "26730",
  "identifier_other": "etd-04092010-161241",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04092010-161241/",
  "identifier_uri": "http://hdl.handle.net/10919/26730",
  "publisher": "Virginia Tech",
  "relation_haspart": "Manley_RA_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Policy Delphi",
    "Career Technical Education",
    "Policy Impact Analysis",
    "Perkins Act"
  ],
  "title": "The intended and unintended consequences of the 1990 Carl D. Perkins Vocational and Applied Technology Act Within-state Funding Formula Change: A Modified Policy Delphi Study",
  "type": "Dissertation"
}