{
  "contributor_author": "Lyons, Daniel E.",
  "contributor_committeecochair": [
    "Fortune, Jimmie C.",
    "Alexander, M. David"
  ],
  "contributor_committeemember": [
    "Polakiewicz, Frank J.",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:17Z",
  "date_adate": "2006-04-17",
  "date_available": "2014-03-14T20:09:17Z",
  "date_issued": "2006-04-03",
  "date_rdate": "2006-04-17",
  "date_sdate": "2006-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "ABSTRACT More than thirty years ago Congress passed the Educational Amendments to ensure fair treatment for all students. Specifically, Title IX provided that [N]o person in the United States shall, on the basis of sex, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any education program or activity receiving federal financial assistance (Educational Amendments of 1972,p. 7).  The number of court cases against colleges and high schools for violating various aspects of Title IX continues to increase. This study looked at court cases involving high school and college athletes claiming violations of Title IX, then six schools were selected in Virginia to determine if these schools met the legal standards, as determined by the Code of Federal Regulations.  An analysis of judicial opinions for cases on Title IX formed the foundation of this study.  The six schools were visited, records reviewed, principals, and coaches were interviewed   The information and data gathered from site visits and interviews as well as the statistical data generated by the statistical software were used to determine if these schools were in compliance with Title IX of the Educational Amendments of 1972.",
  "description_provenance": [
    "Author Email: delyons@lexedu.org",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:17Z (GMT). No. of bitstreams: 1 NewFinal.pdf: 421780 bytes, checksum: 715bc165f506fd9490a051a1be944888 (MD5)   Previous issue date: 2006-04-03"
  ],
  "handle": "26747",
  "identifier_other": "etd-04102006-081046",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102006-081046/",
  "identifier_uri": "http://hdl.handle.net/10919/26747",
  "publisher": "Virginia Tech",
  "relation_haspart": "NewFinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Virginia High Schools",
    "Compliance",
    "Title IX",
    "Educational Amendments",
    "Code of Federal Regulations"
  ],
  "title": "Title IX Compliance in Virginia High Schools",
  "type": "Dissertation"
}