{
  "contributor_author": "Hoffmeister, Alan P.",
  "contributor_committeechair": "Kowalewski, Michal",
  "contributor_committeemember": [
    "Read, James Fredrick",
    "Bambach, Richard K.",
    "Kelley, Patricia H.",
    "Scheckler, Stephen E."
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:09:16Z",
  "date_adate": "2002-04-11",
  "date_available": "2014-03-14T20:09:16Z",
  "date_issued": "2002-03-13",
  "date_rdate": "2003-04-11",
  "date_sdate": "2002-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Drilling predation presents a rare opportunity to quantify ecological and evolutionary interactions in the fossil record.  To date, most of this research has been done on Late Mesozoic and Cenozoic deposits, and large-scale studies have focused on temporal rather than spatial patterns.  However, drilling predation occurs throughout the entire Phanerozoic, and patterns in spatial variability may mask secular trends. These issues are addressed in a series of projects presented here. An extensive survey of museum specimens and bulk materials indicate that drilling predation in Late Paleozoic brachiopod prey is relatively rare (<1% of fossil specimens are drilled) but widespread and continuously present. The intensity of drilling predation on Late Paleozoic bivalve mollusks (this is the first quantitative report of this kind) is much higher than that seen for contemporaneous brachiopod prey, but lower than what is common for Late Mesozoic and Cenozoic mollusks. Drilling intensity varies significantly between taxa and across localities, (e.g., a sample of the Pennsylvanian brachiopod Cardiarina cordata produced an estimate of 32.7%, which is an intensity similar to that seen in Cenozoic mollusks and the highest yet reported for any brachiopod). However, data for the brachiopod genus Composita, which appears to be a preferred brachiopod prey in many Late Paleozoic assemblages, show that although this genus is subject to drilling predation continuously throughout its geologic range, the over all intensity is very low (less than 1%) and at no time does the intensity ever exceed 10%. Spatial variation in Miocene assemblages from Europe is shown to be on the same order as temporal variation throughout the Cenozoic. Significant variation in drilling intensity is also documented for the Paleozoic. This emphasizes the point that to fully understand patterns of predation through time, both spatial and temporal distribution must be considered.",
  "description_provenance": [
    "Author Email: aph@vt.edu",
    "Advisor Email: jread@vt.edu",
    "Advisor Email: michalk@vt.edu",
    "Advisor Email: rbambach@oeb.harvard.edu",
    "Advisor Email: kelleyp@uncw.edu",
    "Advisor Email: stephen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:16Z (GMT). No. of bitstreams: 1 APHetdrev.pdf: 3734341 bytes, checksum: 1dcf9ce87645e494d6bcc0e464217fc9 (MD5)   Previous issue date: 2002-03-13"
  ],
  "handle": "26741",
  "identifier_other": "etd-04102002-144726",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102002-144726/",
  "identifier_uri": "http://hdl.handle.net/10919/26741",
  "publisher": "Virginia Tech",
  "relation_haspart": "APHetdrev.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mollusk",
    "Paleozoic",
    "brachiopod",
    "drilling predation",
    "Cenozoic"
  ],
  "title": "Quantitative Analysis of Drilling Predation Patterns in the Fossil Record: Ecological and Evolutionary Implications",
  "type": "Dissertation"
}