{
  "contributor_author": "Crook, Jeffrey Ray",
  "contributor_committeecochair": [
    "Twiford, Travis W.",
    "Earthman, Glen I."
  ],
  "contributor_committeemember": [
    "Salmon, Richard G.",
    "Byers, Larry",
    "Cash, Carol S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:17Z",
  "date_adate": "2006-04-17",
  "date_available": "2014-03-14T20:09:17Z",
  "date_issued": "2006-03-30",
  "date_rdate": "2007-04-17",
  "date_sdate": "2006-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to examine the relationship between the percentages of students passing the Standards of Learning (SOL) examinations and current building condition of the high schools in the Commonwealth of Virginia. The first research question examined the relationship between the percentages of students passing the SOL examinations in school buildings that are assessed as substandard and standard. The second research question examined the difference between the percentages of students passing the SOL examinations in school buildings that are assessed structurally as substandard or standard. The third research question examined the difference in the percentages of students passing the SOL examinations in school buildings that are assessed as cosmetically substandard and standard.   <p>This study consisted of three major data components. The first component was the percentages of students passing the SOL examinations in the high schools in the Commonwealth of Virginia. The second component was the responses of principals to the Commonwealth Assessment of Physical Environment (CAPE) assessment. This instrument required an assessment of the condition of the school building. The final data was the percentage of students participating in the free and reduced lunch program which served as a measure of control for the socioeconomic status of each student body.</p><p>  The CAPE responses were used to compile descriptive statistics, pair-wise comparisons, and correlations. Schools were given a rating and placed into either standard or substandard condition based on the principals' responses on the CAPE. Once the two categories were identified, the percentages of students passing specific subtests of the SOL examinations were compared in standard and substandard condition to determine the relationship. </p><p>   The findings in this study indicate there is a significant relationship between building conditions and the percentages of students passing the English writing and reading SOL examinations. This study supports previous research studies that found that building condition does have a relationship with student achievement. As the need for high quality educational experiences increases, school boards should examine the available research relating to the condition of the educational facility and its impact on student achievement. </p>",
  "description_provenance": [
    "Author Email: jcrook@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: lbyers@vt.edu",
    "Advisor Email: ccash@hcps.us",
    "Made available in DSpace on 2014-03-14T20:09:17Z (GMT). No. of bitstreams: 1 CrookETD.pdf: 511812 bytes, checksum: 52af27574060ed2be347c4fa39bc06f3 (MD5)   Previous issue date: 2006-03-30"
  ],
  "handle": "26748",
  "identifier_other": "etd-04102006-093814",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102006-093814/",
  "identifier_uri": "http://hdl.handle.net/10919/26748",
  "publisher": "Virginia Tech",
  "relation_haspart": "CrookETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Facility Assessment",
    "Educational Facilities",
    "Building Condition of Schools",
    "Student Achievement"
  ],
  "title": "The Relationship between the Percentage of Students Passing the Standards of Learning examinations and the Condition of the Educational Facilities in the High Schools in the Commonwealth of Virginia",
  "type": "Dissertation"
}