{
  "contributor_author": "Cain, Darrell L.",
  "contributor_committeechair": "Creamer, Donald G.",
  "contributor_committeemember": [
    "Dika, Sandra L.",
    "Sanders, Karen Eley",
    "Cross, Landrum L."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:17Z",
  "date_adate": "2005-04-19",
  "date_available": "2014-03-14T20:09:17Z",
  "date_issued": "2005-04-01",
  "date_rdate": "2005-04-19",
  "date_sdate": "2005-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "There has been an increasing growth in the use of technology resources in traditional classroom styled higher education courses. This growth has received with both optimism and criticism. One of the issues critics have posed is that the use of technology resources does little, if anything, to improve student learning. As a result, this research examined if the use of technology contributes to student learning outcomes and student engagement activities, above and beyond student demographic variables. Specifically, this study investigated if the use of computer mediated conferencing (CMC) tools (i.e., email and electronic discussion boards) and computer aided instructional (CAI) resources (i.e., use of the computer and the Internet) contribute to student learning. Included in the sample were 2000 college students, which were randomly drawn from the 2003 College Student Experience Questionnaire database. The survey included 53 Likert scale items with reliability ranges from .78 to .88 on each of the composite scales.  For the data analysis, eight multiple regressions were conducted on student learning outcomes and student learning engagement. Student learning outcomes included four composite scales, measuring students' personal and social development, general education gains, intellectual development, science and technology gains, and vocational preparation. The student engagement scale was comprised of three composite scales, which included faculty interactions, social, political and scientific discussions, and diversity and social interactions. The findings revealed that the use of technology resources does contribute to student learning, above and beyond student's background variables. The model inclusive of technology variables explained 4% to 7% of the gains in student learning, while student background variables contributed .03% to 2% of the gains. The findings suggest incorporating the use of technology can aid students in the learning process, though the effect size was fairly modest in most cases. The use of computer mediated conferencing and computer assisted learning tools should be used in combination with traditional classroom instructions to have the best effects.",
  "description_provenance": [
    "Author Email: caind@bellsouth.net",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: Sandra_Dika@brown.edu",
    "Advisor Email: kesanders@vt.edu",
    "Advisor Email: llcross@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:17Z (GMT). No. of bitstreams: 1 D.CainDissertationFinalVersion.pdf: 311331 bytes, checksum: 18e068d5912317c137aaf2b608d5d196 (MD5)   Previous issue date: 2005-04-01"
  ],
  "handle": "26746",
  "identifier_other": "etd-04102005-125105",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102005-125105/",
  "identifier_uri": "http://hdl.handle.net/10919/26746",
  "publisher": "Virginia Tech",
  "relation_haspart": "D.CainDissertationFinalVersion.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Technology",
    "Constructivism",
    "Computer Assisted Instruction",
    "Computer Mediated Conferencing",
    "Student Engagement",
    "Learning Outcomes",
    "Internet",
    "Email"
  ],
  "title": "The Explained Effects of Computer Mediated Conferencing on Student Learning Outcomes and Engagement",
  "type": "Dissertation"
}