{
  "contributor_author": "Dunlap, Daniel Ray",
  "contributor_committeechair": "Pitt, Joseph C.",
  "contributor_committeemember": [
    "Fuhrman, Ellsworth R.",
    "Reeves, Barbara J.",
    "De Laet, Marianne K.",
    "Bentley, Michael",
    "Garrison, James W."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:09:16Z",
  "date_adate": "2002-04-22",
  "date_available": "2014-03-14T20:09:16Z",
  "date_issued": "2002-01-14",
  "date_rdate": "2003-04-22",
  "date_sdate": "2002-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation presents a case study the Learning in Networked Communities (LiNC) project.  The focus of the study is on the social processes involved in the development and deployment of technologies associated with the LiNC project.  These processes involved the work of university investigators, software developers, teachers and other researchers.  The technologies that were developed and deployed were collaborative computer network-based software tools for use in several local high school and middle school science classrooms.    I discuss methodological implications for the study of the social construction of technology in the field of Science and Technology Studies in regards to my methodological approach to the study of this project.  I describe the political context of surrounding the National Science Foundation and the funding of research and development programs related to the Internet.  I trace the historical infrastructure development of Internet technologies especially as they relate to the technology developed in the LiNC project.  I describe the execution of the main grant that funded the LiNC project, the methods employed in that study, and the activities of researchers, teachers, and students focusing on their perspectives, interactions, and understandings of the events of that period of time.  Finally, I draw conclusions about such study of technological development, university research, teaching, the field of Human-Computer Interaction, and the prospects for future research in these areas.",
  "description_provenance": [
    "Author Email: dunlapd@vt.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Advisor Email: reeves@vt.edu",
    "Advisor Email: delaet@its.caltech.edu",
    "Advisor Email: mbentley@southlandtech.net",
    "Advisor Email: jcpitt@vt.edu",
    "Advisor Email: wesley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:16Z (GMT). No. of bitstreams: 3 Body.pdf: 1165862 bytes, checksum: 0c21f2d60744f97e230c18f7be69884a (MD5) Abstract.pdf: 89741 bytes, checksum: 1ef5d43bffe0aa1af15c342e02edeadd (MD5) Front.pdf: 83129 bytes, checksum: 32b4d9e7349535997c0c030839711fa7 (MD5)   Previous issue date: 2002-01-14"
  ],
  "handle": "26740",
  "identifier_other": "etd-04102002-120926",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102002-120926/",
  "identifier_uri": "http://hdl.handle.net/10919/26740",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Body.pdf",
    "Abstract.pdf",
    "Front.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Technology",
    "Computer",
    "Education",
    "Collaboration"
  ],
  "title": "A Study of the LiNC Project:  Collaboration, Teaching, Research, and the Social Construction of Technology",
  "type": "Dissertation"
}