{
  "contributor_author": "Mujagic, Ubejd",
  "contributor_committeechair": "Easterling, William Samuel",
  "contributor_committeemember": [
    "Rojiani, Kamal B.",
    "Cousins, Thomas E.",
    "Murray, Thomas M.",
    "Roberts-Wollmann, Carin L."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:09:16Z",
  "date_adate": "2004-04-15",
  "date_available": "2014-03-14T20:09:16Z",
  "date_issued": "2004-04-06",
  "date_rdate": "2004-04-15",
  "date_sdate": "2004-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study consists of three self-standing parts, each dealing with a different aspect of design of composite steel-concrete flexural members. \tThe first part deals with a new type of shear connection in composite joists.  Composite steel-concrete flexural members have increasingly become popular in design and construction of floor systems, structural frames, and bridges. A particularly popular system features composite trusses (joists) that can span large lengths and provide empty web space for installation of typical utility conduits.  One of the prominent problems with respect to composite joists has been the installation of welded shear connection due to demanding welding requirements and the need for significant welding equipment at the job site.  This part of the study presents a new type of shear connection developed at Virginia Tech â   standoff screws.  Results of experimental and analytical research are presented, as well as the development of a recommended design methodology. \tThe second part deals with reliability of composite beams.  Constant research advances in the field of composite steel-concrete beam design have resulted in numerous enhancements and changes to the American design practice, embodied in the composite construction provisions of the AISC Specification (AISC 1999).  Results of a comprehensive reliability study of composite beams are presented.  The study considers specification changes since the original reliability study by Galambos et al. (1976), considers a larger database of experimental data, and analyses recent proposals for changes in design of shear connection.  Comparison of three different design methods is presented based on a study of 15,064 composite beam cases.  A method to consider effect of degree of shear connection on strength reduction factor is proposed. \tFinally, while basic analysis theories between the two are similar, requirements for determining the strength of composite beams in Eurocode 4 (CEN 1992) and 1999 AISC Specification (AISC 1999) differ in many respects.  This is particularly true when considering the design of shear connections.    This part of the dissertation explores those differences through a comparative step-by-step discussion of major design aspects, and accompanying numerical example.  Several shortcomings of 1999 AISC Specification are identified and adjustments proposed.",
  "description_provenance": [
    "Author Email: umujagic@vt.edu",
    "Advisor Email: krojiani@vt.edu",
    "Advisor Email: tcousins@vt.edu",
    "Advisor Email: thmurray@vt.edu",
    "Advisor Email: wollmann@vt.edu",
    "Advisor Email: seaster@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:16Z (GMT). No. of bitstreams: 10 J.Manuscript_III.pdf: 206988 bytes, checksum: 59f66e6f5351490afaca0d99168a2c7a (MD5) H.Manuscript_I.pdf: 1431409 bytes, checksum: 7fbcf80407279d1a8480ff858f8c9411 (MD5) G.Review_of_Literature.pdf: 967494 bytes, checksum: 54ff65e1b031aedb4740fd6eead8d494 (MD5) F.Executive_Summary.pdf: 9743 bytes, checksum: 54d824dab737c69e377320d5e7dee8cb (MD5) A.Front_Matter.pdf: 8090 bytes, checksum: 112e67e5dc2f4218a7e9af312e261d50 (MD5) B.Acknowledgements.pdf: 7148 bytes, checksum: 28b255c4c4c2af65b512ad5afd3dd71b (MD5) C.Table_of_Contents.pdf: 8767 bytes, checksum: 499a77b8dea8f0c89b6f51167fbc73af (MD5) D.List_of_Tables.pdf: 7159 bytes, checksum: 0e06caeada0dcf343dcb174dc1518dc1 (MD5) E.List_of_Figures.pdf: 9572 bytes, checksum: dc6ba44ac7e2d49eb1a4f11f027fa269 (MD5) I.Manuscript_II.pdf: 1809803 bytes, checksum: 813c49865b7263591d58bcd13885a6a9 (MD5)   Previous issue date: 2004-04-06"
  ],
  "handle": "26745",
  "identifier_other": "etd-04102004-231341",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102004-231341/",
  "identifier_uri": "http://hdl.handle.net/10919/26745",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "J.Manuscript_III.pdf",
    "H.Manuscript_I.pdf",
    "G.Review_of_Literature.pdf",
    "F.Executive_Summary.pdf",
    "A.Front_Matter.pdf",
    "B.Acknowledgements.pdf",
    "C.Table_of_Contents.pdf",
    "D.List_of_Tables.pdf",
    "E.List_of_Figures.pdf",
    "I.Manuscript_II.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "AISC",
    "Ductility and Fracture of Shear Connectors",
    "Composite Joists",
    "Composite Beams",
    "Eurocode",
    "Finite Element Analysis",
    "Headed Shear Studs",
    "Numerical Analysis",
    "Shear Connectors",
    "Shear Connection",
    "Standoff Screws",
    "Reliability",
    "Steel-Concrete Composites"
  ],
  "title": "DESIGN and BEHAVIOR of COMPOSITE STEEL-CONCRETE FLEXURAL MEMBERS with a FOCUS on SHEAR CONNECTORS",
  "type": "Dissertation"
}