{
  "contributor_author": "Abbey, Elizabeth Lea",
  "contributor_committeechair": "Rankin, Janet L. Walberg",
  "contributor_committeemember": [
    "Davy, Brenda M.",
    "Frisard, Madlyn I.",
    "Lee, Yong Woo"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:09:19Z",
  "date_adate": "2009-05-07",
  "date_available": "2014-03-14T20:09:19Z",
  "date_issued": "2009-03-31",
  "date_rdate": "2012-03-27",
  "date_sdate": "2009-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Over 270 million people play soccer worldwide, and its popularity grows every day.  In team sport exercise, fatigue may result from numerous factors including limited fuel, depleted energy stores and production of compounds that promote an inflammatory response.  While inflammation is an essential mechanism for repairing damaged muscle tissue with exercise, prolonged inflammation leads to increased production of reactive oxygen species that can damage cell membranes, muscle, and signaling proteins.  To prevent this response and improve performance, athletes are increasingly looking to nutritional interventions.  Carbohydrate and antioxidant supplementation have both shown evidence of producing an ergogenic effect and attenuating inflammation and oxidative stress with prolonged endurance exercise.  Less is known about how these interventions may influence intermittent, high-intensity exercise characteristic of soccer.  In particular, this exercise presents a unique challenge in that opportunities for nutrient intake are limited to pre-game and half-time.  In our first study, we had 10 male collegiate soccer players perform a 90-min. soccer-simulation test, that we developed, which was followed by a progressive shuttle run (PSR) test to exhaustion.  They consumed a honey-sweetened beverage (H), a sports drink (S), or a placebo (P) before and half-way through the protocol.  Both H and S provided 1.0 gâ  kg-1 carbohydrate and ~17.6 mLâ  kg-1 total volume for each trial.  Overall, the test resulted in increased fatigue and production of inflammatory markers and antioxidant capacity. There was no significant difference between treatments for any performance measure.  Mean times for a high intensity run and rating of perceived exertion increased with time, and there was an overall decrease in PSR time compared to baseline (-22.9%).  There was a rise in glucose (15.6%), IL-6 (548%), IL-1ra, IL-10 (514%) and ORAC (15%) post-test but no change in cortisol.  Insulin was significantly lower by 1 h-post.  IL-1ra levels increased post-test for H (25.8%), S (65.5%), and P (63.9%), but the change for H was less than the other treatments.  No treatment effects for the other blood measures were observed. The lack of an ergogenic effect of carbohydrate on soccer performance calls into question the benefit of supplementation at a frequency typical of a regulation soccer match in highly trained athletes with adequate energy stores.  Since acute carbohydrate ingestion in the first study did not attenuate some markers of inflammation (e.g. IL-6), we chose to focus on an alternative theory for the rise in inflammatory markers with strenuous exercise in our second study.  One aspect of soccer, repeated sprinting, results in increased ROS production partially through the activation of the enzyme xanthine oxidase (XO).  Quercetin, a flavonol in plants that has shown some ergogenic effects with endurance exercise, inhibits XO in vitro.  The effect of quercetin on team sport exercise had not been studied.  We gave recreationally active males a commercial sports drink (S) or S + 500 mg of quercetin (Q) 2x/d for 1 wk prior to a repeated sprint test (RST).  Sprint times increased (5.9%) for both treatments as did plasma XO activity (47%), IL-6 (77%), and uric acid (25%) from pre-test to post-test.  Q supplementation did not attenuate plasma XO activity or IL-6 and actually increased one calculated index of fatigue, percent fatigue decrement (5.1%- Q and 3.8%- P).  These findings add to the growing body of literature that quercetin supplementation does not attenuate exercise-induced inflammation and oxidative stress in vivo.  Collectively, this research has practical implications for sports drink companies who are exploring the use of flavonoid compounds in product formulation.  Specifically, they should reconsider adding quercetin to their beverages if they are marketing to team sport athletes.  Also, soccer players should be made aware that, at ingestion frequencies typical of a soccer match, they may not expect a significant performance benefit from acute carbohydrate supplementation.",
  "description_provenance": [
    "Author Email: eabbey@vt.edu",
    "Advisor Email: jrankin@vt.edu",
    "Advisor Email: bdavy@vt.edu",
    "Advisor Email: frisardm@vt.edu",
    "Advisor Email: ywlee@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:19Z (GMT). No. of bitstreams: 1 AbbeyETDFinal.pdf: 6070378 bytes, checksum: 23c39ca416c59b6548842933199f05c0 (MD5)   Previous issue date: 2009-03-31"
  ],
  "handle": "26759",
  "identifier_other": "etd-04102009-124248",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102009-124248/",
  "identifier_uri": "http://hdl.handle.net/10919/26759",
  "publisher": "Virginia Tech",
  "relation_haspart": "AbbeyETDFinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "oxidative stress",
    "inflammation",
    "quercetin",
    "cytokines",
    "honey",
    "soccer"
  ],
  "title": "The Effects of Carbohydrate and Quercetin on Team Sport Athletic Performance and Exercise-Induced Inflammation and Oxidative Stress",
  "type": "Dissertation"
}