{
  "contributor_author": "Watson, Charles Edward",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_committeemember": [
    "Doolittle, Peter E.",
    "Burton, John K.",
    "Wildman, Terry M.",
    "Moore, David Michael",
    "Head, J. Thomas"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:17Z",
  "date_adate": "2007-04-19",
  "date_available": "2014-03-14T20:09:17Z",
  "date_issued": "2007-04-05",
  "date_rdate": "2012-10-11",
  "date_sdate": "2007-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Situated within the belief that faculty development is a key institutional mechanism through which colleges and universities will be able to meet emerging social, cultural, and technological challenges in the coming years, this study sought to better understand the underlying psychological processes that facilitate the adoption of innovations by teaching faculty and GTAs in higher education.  Specifically, three types of self-efficacy (college teaching, teaching with technology, and general) were considered in light of demographic variables and Rogersâ   model of the innovation-decision process.  Most significant among the findings were that women have significantly higher college teaching self-efficacy and general self-efficacy than men; however, men have higher teaching with technology self-efficacy.  Those in their forties, fifties and sixties have higher college teaching self-efficacy than those in their twenties.  Full-time instructors have higher college teaching self-efficacy than doctoral GTAs and assistant professors.  Those who rate themselves as having higher computer skills also have higher teaching with technology self-efficacy. When considering teaching with technology self-efficacy and instructional technology-based innovation-decision stage, it was found that this type of self-efficacy differs significantly between most stages and consistently increases from the knowledge stage through the confirmation stage.",
  "description_provenance": [
    "Author Email: edwatson@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: thead@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:17Z (GMT). No. of bitstreams: 1 Watson_Dissertation.pdf: 7194171 bytes, checksum: c787fc8698c7da0a067f09668d9cfba4 (MD5)   Previous issue date: 2007-04-05"
  ],
  "handle": "26751",
  "identifier_other": "etd-04102007-220540",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102007-220540/",
  "identifier_uri": "http://hdl.handle.net/10919/26751",
  "publisher": "Virginia Tech",
  "relation_haspart": "Watson_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "faculty development",
    "innovation-decision process",
    "self-efficacy",
    "higher education",
    "change",
    "diffusion of innovations"
  ],
  "title": "Self-efficacy, the Innovation-Decision Process, and Faculty in Higher Education:  Implications for Faculty Development",
  "type": "Dissertation"
}