{
  "contributor_author": "Koontz, John L",
  "contributor_committeechair": "Marcy, Joseph E.",
  "contributor_committeemember": [
    "Long, Timothy E.",
    "Duncan, Susan E.",
    "O'Keefe, Sean F."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:09:19Z",
  "date_adate": "2008-04-23",
  "date_available": "2014-03-14T20:09:19Z",
  "date_issued": "2008-04-04",
  "date_rdate": "2009-04-23",
  "date_sdate": "2008-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Synthetic antioxidants have traditionally been added directly to food products in a single initial dose to protect against oxidation of lipids and generation of free radicals.  Natural antioxidants have been shown to undergo loss of activity and become prooxidants at high concentrations; therefore, a need exists to develop active packaging which can gradually deliver antioxidants in a controlled manner.  The objectives of this research were to (1) form and characterize cyclodextrin inclusion complexes with the natural antioxidants, alpha-tocopherol and quercetin, (2) incorporate cyclodextrin inclusion complexes of natural antioxidants into linear low density polyethylene (LLDPE), and (3) measure the release kinetics of inclusion complexes of natural antioxidants from LLDPE into a model food system.  Cyclodextrin inclusion complexes of alpha-tocopherol and quercetin were formed by the coprecipitation method and characterized in the solid state by NMR, IR spectroscopy, and thermal analyses.  Solid inclusion complex products of alpha-tocopherol:beta-cyclodextrin and quercetin:gamma-cyclodextrin had molar ratios of 1.7:1 as determined by UV spectrophotometry, which were equivalent to 18.1% (w/w) alpha-tocopherol and 13.0% (w/w) quercetin.  Free and cyclodextrin complexed antioxidant additives were compounded with a twin-screw mixer into two LLDPE resin types followed by compression molding into films.  Release of alpha-tocopherol and quercetin from LLDPE films into coconut oil at 30 °C was quantified by HPLC during 4 weeks of storage.  The total release of alpha-tocopherol after 4 weeks was 70% from the free form and 8% from the complexed form averaged across both LLDPE resins.  The mechanism by which alpha-tocopherol was released was modified due to its encapsulation inside the beta-cyclodextrin cavity within the LLDPE matrix as indicated by its diffusion coefficient decreasing by two orders of magnitude.  Molecular encapsulation of natural antioxidants using cyclodextrins may be used as a controlled release mechanism within polymer food packaging to gradually deliver an effective antioxidant concentration to a food product, thereby, limiting oxidation, maintaining nutritional quality, and extending shelf life.",
  "description_provenance": [
    "Author Email: jkoontz@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: duncans@vt.edu",
    "Advisor Email: okeefes@vt.edu",
    "Advisor Email: jmarcy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:19Z (GMT). No. of bitstreams: 2 01_DissertationBody_etd.pdf: 3449529 bytes, checksum: 397be13a64f63be8374c2eb3e0cd2cab (MD5) 00_FrontMatter_etd.pdf: 137084 bytes, checksum: 4fa1f77b6abfdb2d087a442f15f30e5c (MD5)   Previous issue date: 2008-04-04"
  ],
  "handle": "26757",
  "identifier_other": "etd-04102008-194434",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102008-194434/",
  "identifier_uri": "http://hdl.handle.net/10919/26757",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01_DissertationBody_etd.pdf",
    "00_FrontMatter_etd.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "alpha-tocopherol",
    "natural antioxidant",
    "inclusion complex",
    "packaging",
    "polymer",
    "linear low density polyethylene",
    "controlled release",
    "cyclodextrin",
    "quercetin"
  ],
  "title": "Controlled Release of Natural Antioxidants from Polymer Food Packaging by Molecular Encapsulation with Cyclodextrins",
  "type": "Dissertation"
}