{
  "contributor_author": "Mhango, Ndalapa Adrian C.",
  "contributor_committeechair": "Glasson, George E.",
  "contributor_committeemember": [
    "Shadle, Brett L.",
    "Brand, Brenda R.",
    "Tlou, Josiah S."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:09:18Z",
  "date_adate": "2008-04-23",
  "date_available": "2014-03-14T20:09:18Z",
  "date_issued": "2008-03-25",
  "date_rdate": "2008-04-23",
  "date_sdate": "2008-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of public schooling in many democratic nation-states is the preparation of an active participatory citizenry. For this reason, educators advocate the use of participatory classroom practices for instilling in students knowledge, skills, values, and attitudes for active civic responsibilities. In this connection, Malawi has since the re-introduction of democracy in 1994, reformed the primary school curricula to emphasize participatory classroom practices. Therefore, the aim of this study was to explore how primary school teachers in Malawi planned and implemented social studies lessons for the preparation of competent citizens in a democratic civil society. The study used a case study genre of qualitative research involving three senior grade teachers as research participants. The study yielded four major results based on four generic research questions. The first result was that the social studies primary school curriculum has content and pedagogical approaches that are appropriate for the preparation of active participatory citizens. The second result was that the three teachers displayed limited understanding of the concept of participatory learning that was suggested to them in the curriculum documents. As such, their planning of lessons was largely teacher-centered, which they thought was participatory in approach. The third result was that the teachers’ limited conception of participatory learning, as reflected in the teaching plans, was transferred to their classrooms. In this way, the teacher-centered classroom practices caused a lot of missed opportunities for the students’ development of skills in critical thinking, problem solving, and rational decision-making that are necessary for active participation in a shared democratic political community. The last result was that state policies on the use of English as the medium of class instruction and the grade eight mandated examinations negatively contributed to the decisions that the teachers made in the organization of participatory classroom practices. Thus, the general picture based on these research results showed that there was a discrepancy between the state’s intended curriculum and the teachers’ enacted curriculum.",
  "description_provenance": [
    "Author Email: nmhango@vt.edu, ndalapa@yahoo.co.uk",
    "Advisor Email: shadle@vt.edu",
    "Advisor Email: bbrand@vt.edu",
    "Advisor Email: tlou@vt.edu",
    "Advisor Email: glassong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:18Z (GMT). No. of bitstreams: 1  mhango_nac.pdf: 2228512 bytes, checksum: 44895115d122f1aec6191491dfa3e4dc (MD5)    Previous issue date: 2008-03-25"
  ],
  "handle": "26755",
  "identifier_other": "etd-04102008-141811",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102008-141811/",
  "identifier_uri": "http://hdl.handle.net/10919/26755",
  "publisher": "Virginia Tech",
  "relation_haspart": "mhango_nac.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "enacted curriculum",
    "pedagogies",
    "participatory classroom practices",
    "active participatory citizens",
    "democracy",
    "intended curriculum"
  ],
  "title": "An Exploration of How Primary School Teachers in Malawi Plan and Implement Social Studies Lessons for the Preparation of Active Participatory Citizens in a Democratic Society",
  "type": "Dissertation"
}