{
  "contributor_author": "Lewis, Tracie Olds",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_committeemember": [
    "Moore, David Michael",
    "Burton, John K.",
    "Doolittle, Peter E.",
    "Meszaros, Peggy S."
  ],
  "contributor_department": "Learning Sciences and Technologies",
  "date_accessioned": "2014-03-14T20:09:17Z",
  "date_adate": "2007-04-27",
  "date_available": "2014-03-14T20:09:17Z",
  "date_issued": "2007-04-02",
  "date_rdate": "2007-04-27",
  "date_sdate": "2007-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study used a qualitative approach to explore how faculty were prepared to teach online at institutions of higher education.  Six participants, including experienced (with three or more years of experience teaching online) and non-experienced (with less than two years of experience teaching online), were purposely selected to participate.  The participants were interviewed concerning their preparation experiences, the preparation activities that were most beneficial to them, and the areas in which they wanted further development for teaching online.  Data from the interviews were coded and analyzed.  Findings revealed that although institutions were providing activities that faculty members found to be beneficial, workshops and one-to-one assistance, activities that incorporated both technical and pedagogical strategies were still necessary.  This study provides information that can be used to assist faculty when preparing to teach online and to assist institutions in redesigning and developing faculty development activities for preparing faculty to teach online.",
  "description_provenance": [
    "Author Email: tolds@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: meszaros@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:17Z (GMT). No. of bitstreams: 2 Dissertation_Body_TracieLewis.pdf: 527076 bytes, checksum: 70d2cf1da8cf852cfb10b58092100a9d (MD5) TracieLewis.pdf: 27777 bytes, checksum: 06bf0e99136c515425d66aa56da87e62 (MD5)   Previous issue date: 2007-04-02"
  ],
  "handle": "26750",
  "identifier_other": "etd-04102007-150601",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102007-150601/",
  "identifier_uri": "http://hdl.handle.net/10919/26750",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation_Body_TracieLewis.pdf",
    "TracieLewis.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "teaching online",
    "distance learning",
    "online teaching",
    "distance education",
    "faculty preparation",
    "faculty development"
  ],
  "title": "The Preparation of Faculty to Teach Online:  A Qualitative Approach",
  "type": "Dissertation"
}