{
  "contributor_author": "Moon, Elizabeth Wedemeyer",
  "contributor_committeechair": "Sawyers, Janet K.",
  "contributor_committeemember": [
    "Denton, Wayne H.",
    "Prouty, Anne M.",
    "Johnson, Scott W.",
    "Piercy, Fred P."
  ],
  "contributor_department": "Marriage and Family Therapy",
  "date_accessioned": "2014-03-14T20:09:20Z",
  "date_adate": "2003-04-21",
  "date_available": "2014-03-14T20:09:20Z",
  "date_issued": "2003-04-02",
  "date_rdate": "2004-04-21",
  "date_sdate": "2003-04-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Flow: Family Dynamics and Adolescent Participation in Soccer  ABSTRACT    \tThe purpose of this research was to conduct an exploratory study of parental involvement in youth sports. The Flow Model developed by Mihalyi Csikszentmihalyi is used as the basis of my theory behind the research. Although there has been recognition that it is important to study young athletes, little is known about parental involvement. Thus, my three main research questions are: (a) How do adolescents experience their participation in soccer? (b) What are the family dynamics, as expressed by parents, related to challenging and supporting their children? And (c) How do adolescents experience the relationship between these family dynamics and their participation in soccer?  \tMy methods of inquiry of this study included collecting data through two questionnaires: (a) Experience Sampling Method (ESM) and (b) Support/Challenge Questionnaire (SCQ). I also conducted in-depth interviews. My participants included 11 males and 10 females 14-15 years of age. Each of these participants were administered the two questionnaires. Of these 21 participants, eight adolescent athletes and their parents were followed up with in-depth interviews.   \tThe results of this research are organized into four main categories including communication, family interaction, goals and beliefs, and expectations. From these themes, three categories for implications were developed to encompass soccer implications, therapy implications, and research implications. Ultimately, acknowledging how adults affect the outcomes of children's stress and enjoyment, parents can deal more successfully with the social, emotional, and psychological needs of their young athletes (Scanlan & Lewthwaite, 1986).",
  "description_provenance": [
    "Author Email: ewedemey@vt.edu",
    "Advisor Email: Denton@wfubmc.edu",
    "Advisor Email: Prouty@attbi.edu",
    "Advisor Email: Swj@vt.edu",
    "Advisor Email: Piercy@vt.edu",
    "Advisor Email: Sawyers@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:20Z (GMT). No. of bitstreams: 1  Main.pdf: 652735 bytes, checksum: 2a8766615ab9fe829bca9e906cce091e (MD5)    Previous issue date: 2003-04-02"
  ],
  "handle": "26767",
  "identifier_other": "etd-04112003-102110",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04112003-102110/",
  "identifier_uri": "http://hdl.handle.net/10919/26767",
  "publisher": "Virginia Tech",
  "relation_haspart": "Main.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "sports",
    "Flow",
    "family dynamics",
    "support",
    "challenge"
  ],
  "title": "Flow: Family Dynamics and Adolescent Experiences in Soccer",
  "type": "Dissertation"
}