{
  "contributor_author": "Edwards, Scott Alan",
  "contributor_committeechair": "Prouty, Anne M.",
  "contributor_committeemember": [
    "Getz, Hilda M.",
    "Johnson, Scott W.",
    "Arditti, Joyce A.",
    "Protinsky, Howard O. Jr."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:20Z",
  "date_adate": "2001-04-16",
  "date_available": "2014-03-14T20:09:20Z",
  "date_issued": "2001-04-09",
  "date_rdate": "2002-04-16",
  "date_sdate": "2001-04-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this Delphi study was to explore and identify a panel of experts' opinions of essential elements for successful multi-family group therapy (MFGT) and to propose the identified elements as guidelines for future MFGT theoretical and program development. Multi-family group therapy continues to be implemented while there is little empirical research to support how it is effective and with what populations and presenting problems it is best employed. A panel of MFGT experts identified 35 essential elements for successful MFGT. Many of the identified elements coincided with elements identified in the relevant literature. However, elements specific to MFGT were distinguished. The essential elements are presented as guidelines for MFGT theoretical and program development. The implications of this study for theory, research, and practice are discussed.",
  "description_provenance": [
    "Author Email: sedwards@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:20Z (GMT). No. of bitstreams: 1 1scott.pdf: 211429 bytes, checksum: eea7bcc54e3ba1d0768ae36d0412de8c (MD5)   Previous issue date: 2001-04-09"
  ],
  "handle": "26765",
  "identifier_other": "etd-04112001-164258",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04112001-164258/",
  "identifier_uri": "http://hdl.handle.net/10919/26765",
  "publisher": "Virginia Tech",
  "relation_haspart": "1scott.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Delphi Study",
    "Program Guidelines",
    "Multi-Family Group Therapy",
    "Therapy Process and Outcome",
    "Marriage and Family Therapy"
  ],
  "title": "The Essential Elements of Multi-family Group Therapy: A Delphi Study",
  "type": "Dissertation"
}