{
  "contributor_author": "Moore, Michael Bryan",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeecochair": "Skaggs, Gary E.",
  "contributor_committeemember": [
    "Mickle, Angela",
    "Redican, Kerry J.",
    "Johnson, Jay"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:20Z",
  "date_adate": "2005-04-13",
  "date_available": "2014-03-14T20:09:20Z",
  "date_issued": "2005-03-31",
  "date_rdate": "2005-04-13",
  "date_sdate": "2005-04-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Traditional fracture testing in the field of athletic training relies heavily on subjective responses of the athlete.  Percussion and compression type tests rely on the athlete stating an increase in pain which represents a positive symptom of a possible fracture.  The tuning fork and stethoscope method relied purely on a subjective assessment from the examiner.  The purpose of the study was to determine if the use of a 128Hz tuning fork and stethoscope were effective evaluation tools in the assessment of possible fractures as compared to the traditional fracture tests that are used in the athletic training field.  A vibrating 128 Hz tuning fork was placed on the bone/area where swelling was minor to facilitate good cortical bone contact. Then the conical bell of a stethoscope was placed on the opposite end on the bone or bones.  A diminished sound arising from the injured bone as compared to the uninjured represented a positive sign for a possible fracture.  Traditional fracture testing was performed and noted.  An x-ray, diagnosed by an orthopedic physician, supported the validity of the tuning fork and traditional fracture testing methods.  The attempt was to see what testing method, the tuning fork and stethoscope or traditional fracture testing, was a more valid evaluation tool when it comes to fractures.  This study was performed at a universityâ  s athletic training room and a local orthopedic center.  The study consisted of any subject between the ages of 18-85 that presented with a suspected fracture at either testing facilities.    The current study examined 37 male and female subjects whose age ranged from 18-85 years old.  The long bones that were tested in this research were as follows:  the phalanges of the hand and foot, metacarpals, metatarsals, humerus, radius, ulna, fibula (including the lateral malleolus), and tibia (including the medial malleolus).  The tuning fork and stethoscope was shown to be an effective and valid tool for evaluating possible fractures by yielding a success rate of 89.2% when compared to an x-ray.  The percussion and compression fracture testing methods yielded only a success rate of 67.6% and 64.9% respectively.",
  "description_provenance": [
    "Author Email: mbmoore@radford.edu",
    "Advisor Email: ammickle@radford.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: jajohnso@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:20Z (GMT). No. of bitstreams: 1 MooreDissertation.pdf: 3700618 bytes, checksum: 6dafecc719c99a33dd44fac2ef9bfdc6 (MD5)   Previous issue date: 2005-03-31"
  ],
  "handle": "26769",
  "identifier_other": "etd-04112005-204138",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04112005-204138/",
  "identifier_uri": "http://hdl.handle.net/10919/26769",
  "publisher": "Virginia Tech",
  "relation_haspart": "MooreDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Fractures",
    "Clinical Fracture Testing",
    "Stethoscope",
    "Tuning Fork"
  ],
  "title": "The Use of a Tuning Fork and Stethoscope Versus Clinical Fracture  Testing in Assessing Possible Fractures",
  "type": "Dissertation"
}