{
  "contributor_author": "Jones, Asia Rocheâ",
  "contributor_committeechair": "Creighton, Theodore B.",
  "contributor_committeemember": [
    "Craig, James R.",
    "Day-Vines, Norma L.",
    "Harris, E. Wayne",
    "Tripp, Norman Wayne"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:19Z",
  "date_adate": "2011-04-21",
  "date_available": "2014-03-14T20:09:19Z",
  "date_issued": "2011-03-28",
  "date_rdate": "2011-04-21",
  "date_sdate": "2011-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<head> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" /> <title>Asia Roche' Jones Abstract</title> </head>   <body> <p>The African-American male national on-time  graduation rate data are evidence that systemic changes must occur to address  the academic failure they experience.Â  A  significant gap in achievement exists when compared to the on-time graduation  rate of their White male peers.Â  It is  possible that some students do not graduate on-time due to retention that may  occur after they have entered the ninth grade.Â   The African-American male students in this study failed to graduate on-time  because they did not persist to successfully complete their twelfth grade year;  instead, they dropped out.Â  While factors  associated with societal issues and familial dynamics contribute to this  problem, factors associated with public school practices and procedures are the  focus of this study.Â  </p> <p>The educational records of 125  African-American male high school dropouts were analyzed to identify school  factors that may explain why they did not persist to graduate.Â  These students dropped out from an urban  school division in Virginia during the 2009 and 2010 school years.Â  A mixed methods approach was used to answer  the research questions posed in this study.Â   The conceptual framework, a road map for the study, proposes discipline  sanctions, curriculum programming, instructional experiences and school  relationships as factors for review.</p> <p>Quantitative research methods were  used to analyze longitudinal data and qualitative methods were used to analyze  survey data on student perception of teacher relationships.Â  Findings  from the study will enable school principals, counselors and teachers to make  informed instructional decisions that may prevent African-American males from  dropping out of one urban school division in Virginia.Â  While not generalizable to all school  settings, strategies associated with discipline sanctions, curriculum  programming, instructional experiences and school relationships are provided.</p> <br clear=\"all\" /> </body> </html>",
  "description_provenance": [
    "Author Email: asiarochejones@gmail.com",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: jcraig44@vt.edu",
    "Advisor Email: ndayvine@vt.edu",
    "Advisor Email: ewharris@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:19Z (GMT). No. of bitstreams: 1 Jones_AR_D_2011.pdf: 611290 bytes, checksum: 4b2d9af3a80472a71dd13e9f933638e4 (MD5)   Previous issue date: 2011-03-28"
  ],
  "handle": "26761",
  "identifier_other": "etd-04102011-132411",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102011-132411/",
  "identifier_uri": "http://hdl.handle.net/10919/26761",
  "publisher": "Virginia Tech",
  "relation_haspart": "Jones_AR_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "African-American male",
    "curriculum programming",
    "discipline sanctions",
    "dropout",
    "instructional experiences",
    "student-teacher relationship"
  ],
  "title": "Practices and Procedures that Influence African-American Males to  Drop Out from Public School",
  "type": "Dissertation"
}