{
  "contributor_author": "Kreye, Bettibel Carson",
  "contributor_committeechair": "Wilkins, Jesse L. M.",
  "contributor_committeemember": [
    "Bannister, Vanessa R. Pitts",
    "Lloyd, Gwendolyn M.",
    "Brill, Jennifer M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:19Z",
  "date_adate": "2009-04-30",
  "date_available": "2014-03-14T20:09:19Z",
  "date_issued": "2009-03-31",
  "date_rdate": "2009-04-30",
  "date_sdate": "2009-04-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this evaluation was to determine the effectiveness of an Externship as the capstone experience of a Master창  s degree program in preparing seventeen teachers to be Mathematics Specialists. This formative evaluation was based on the teacher창  s perspective and was naturalistic in design utilizing both qualitative and quantitative research methods. Data sources included a teacher survey, teacher interviews, writing prompts, teacher observations, and teacher final project presentations. This evaluation was designed to answer the question: Do the teachers feel that the requirements of this Masters창   Degree Externship have prepared them for their role as a Mathematics Specialist? The success and effectiveness of the Externship was tied directly to the teachers chosen school-based experiences which were designed based on a mathematics needs assessment of their schools. Teachers were found to be involved in all five of the essential components of an externship as outlined in the theoretical framework 창   application, collaboration, reflection, expectations, and the cohort structure. In addition, teachers were found to integrate their leadership and teaching skills through the engagement of their school colleagues in the improvement of educational experiences for all students. Overall, the teachers felt that the experiences throughout the Externship adequately prepared them for their roles of a mathematics specialist; working effectively with stakeholders; working with issues around curriculum and instruction; planning and delivering professional development; and working as leaders within their schools.",
  "description_provenance": [
    "Author Email: bkreye@vt.edu",
    "Advisor Email: vrpitts@vt.edu",
    "Advisor Email: lloyd@vt.edu",
    "Advisor Email: jmbrill@vt.edu",
    "Advisor Email: wilkins@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:19Z (GMT). No. of bitstreams: 1 KREYEETD.pdf: 1364149 bytes, checksum: 1bea2aab65c25303338c59f38e4ca682 (MD5)   Previous issue date: 2009-03-31"
  ],
  "handle": "26760",
  "identifier_other": "etd-04102009-162951",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04102009-162951/",
  "identifier_uri": "http://hdl.handle.net/10919/26760",
  "publisher": "Virginia Tech",
  "relation_haspart": "KREYEETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "teacher leaders",
    "mathematics specialists",
    "externship"
  ],
  "title": "EVALUATION OF THE EXTERNSHIP WITHIN A MASTER'S DEGREE PROGRAM FOR MATHEMATICS SPECIALISTS AT VIRGINIA TECH",
  "type": "Dissertation"
}