{
  "contributor_author": "Smith, Pamela C.",
  "contributor_committeechair": "Seago, W. Eugene",
  "contributor_committeemember": [
    "Yardley, James A.",
    "Callihan, Debra S.",
    "Brown, Robert M.",
    "Major, Raymond L."
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:09:20Z",
  "date_adate": "2001-04-16",
  "date_available": "2014-03-14T20:09:20Z",
  "date_issued": "2001-04-09",
  "date_rdate": "2002-04-16",
  "date_sdate": "2001-04-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examines debt ratios, profitability, and commercial activity of the following hospitals:  (i) for-profit hospitals [FP hospitals], (ii) nonprofit hospitals engaging in joint ventures [JV NP hospitals], and (iii) nonprofit hospitals that do not engage in joint ventures [Non-JV NP hospitals].  Financial variables are measured using Form 990 tax return data of nonprofit hospitals and audited financial statements of for-profit hospitals.  The purpose of the study is to compare:  (1) JV NP hospitals versus FP hospitals and (2) JV NP hospitals versus Non-JV NP hospitals.  Potential similarities between FP and JV NP hospitals may indicate nonprofit partners are becoming indistinguishable from for-profit entities, which may further call into question the applicability of tax-exempt status for these nonprofit hospitals.    Results indicate significant differences exist in debt ratios between FP and JV NP hospitals.  A lack of significant differences in profitability lends support to the argument that JV NP hospitals may exhibit similarities in financial characteristics to for-profit hospitals.   Regarding comparisons within the nonprofit sector, significant differences were found in profitability and unrelated business income percentages.  Differences in debt ratios were not found between the two groups - which fail to support Internal Revenue Service (IRS) arguments that there is something 'special' about JV NP hospitals.  JV NP hospitals reported lower profitability on all measures than Non-JV NP hospitals.  Findings of lower profitability are consistent with arguments that JV NP hospitals are attempting to improve their financial condition by partnering with for-profit hospitals.  Significant differences were not found in contributions received as a percentage of total revenue between the nonprofit hospital groups.  This dissertation contributes to existing literature that compares nonprofit and for-profit hospitals through reliance on tax return data of nonprofit hospitals.  Tax returns serve as a primary source for the public and IRS to scrutinize a nonprofit organization's financial operations.  The IRS uses tax return data to evaluate a hospital's activities, measure its charitable activities and scrutinize the organizations' tax-exempt status.  Investigating these differences using actual tax return data provides support to the argument that nonprofit hospitals engaging in joint ventures exhibit similarities to for-profit hospitals.",
  "description_provenance": [
    "Author Email: pcsmith@vt.edu",
    "Advisor Email: jyardley@vt.edu",
    "Advisor Email: callihan@vt.edu",
    "Advisor Email: moren@vt.edu",
    "Advisor Email: rmajor@vt.edu",
    "Advisor Email: seago@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:20Z (GMT). No. of bitstreams: 1 pcsmith-4-09.PDF: 459256 bytes, checksum: 78329125d8eb8d4c1fc2efb4f3c8d175 (MD5)   Previous issue date: 2001-04-09"
  ],
  "handle": "26766",
  "identifier_other": "etd-04112001-214524",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04112001-214524/",
  "identifier_uri": "http://hdl.handle.net/10919/26766",
  "publisher": "Virginia Tech",
  "relation_haspart": "pcsmith-4-09.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "For-Profit",
    "Joint Venture",
    "Hospitals",
    "Nonprofit"
  ],
  "title": "An Empirical Investigation of Joint Ventures Between For-Profit and Tax-Exempt Nonprofit Hospitals",
  "type": "Dissertation"
}