{
  "contributor_author": "Tavernier, Mark D.",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Rayfield, James D.",
    "Byers, Larry",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:20Z",
  "date_adate": "2005-04-13",
  "date_available": "2014-03-14T20:09:20Z",
  "date_issued": "2005-04-05",
  "date_rdate": "2006-04-13",
  "date_sdate": "2005-04-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Formative Elementary Reading Program Assessment: An Interim Tool For Improvement   Mark D. Tavernier  ABSTRACT  The purpose of this study was to develop and test a classroom observation inventory as a formative program implementation tool. This formative study of a districtâ  s primary (kindergarten through second grade) literacy program implementation was conducted in an effort to provide information that will improve and hopefully strengthen the program and serve as a tool for other districts that are implementing similar programs.  The passage of the No Child Left Behind Act by Congress in 2002 (Public Law 107-110) signaled the beginning of a renewed emphasis on the impact of educational programs, specifically literacy instruction and assessment. All states that accept NCLB monies must create standards and design an assessment system that will measure adequate yearly progress (AYP) for all students, with the goal of all students being proficient in reading by the 2014 fiscal year. In an effort to meet this federal mandate, school districts will continue to pour even more money into programs that promise to escalate the literacy achievement of all students. The general concepts of program evaluation are reviewed as they relate to the context of this study as well as several studies that have been designed to determine the effective components of specific literacy programs that focus instruction and ultimately improve student achievement.  \tThe classroom observation tool that was used in this study, while unobtrusive, is highly structured with protocols for recording specific attributes focused around five domains of effective literacy instruction.  A quantitative rating for each item on the instrument was assigned. Results of the observation are reported using descriptive and inferential statistics that compare the observation instrument elements by grade level and school type within each of the instrumentâ  s domains.",
  "description_provenance": [
    "Author Email: mtavernier@aol.com",
    "Advisor Email: rayfiji@cps.k12.va.us",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: lbyers@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:20Z (GMT). No. of bitstreams: 3 openingpages.pdf: 57196 bytes, checksum: c2dc9fc1c62f391a2927f47eb0bcf012 (MD5) document.pdf: 506887 bytes, checksum: 17e036c51719fba12c1731659a724e9e (MD5) ttlpageabstract2.pdf: 52614 bytes, checksum: 58983934202ec2d8f32a01273fdfd21f (MD5)   Previous issue date: 2005-04-05"
  ],
  "handle": "26770",
  "identifier_other": "etd-04112005-214041",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04112005-214041/",
  "identifier_uri": "http://hdl.handle.net/10919/26770",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "openingpages.pdf",
    "document.pdf",
    "ttlpageabstract2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "program implementation",
    "elementary reading methodology"
  ],
  "title": "Formative Reading Program Assessment: An Interim Tool for Improvement",
  "type": "Dissertation"
}