{
  "contributor_author": "Oguro, Yasue",
  "contributor_committeechair": "Shrum, Judith L.",
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Tilley-Lubbs, Gresilda A.",
    "Jordahl, Patricia"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:22Z",
  "date_adate": "2008-05-12",
  "date_available": "2014-03-14T20:09:22Z",
  "date_issued": "2008-03-12",
  "date_rdate": "2008-05-12",
  "date_sdate": "2008-04-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "In the midst of debate over the treatment of culture in foreign language education and the increased exposure to culture in the global economy, the knowledge of other cultures is more significant than ever. In order to improve teaching culture, materials have been examined and revised. The purpose of this exploratory study is to describe how culture is addressed in the fourteen high school EFL reading textbooks in Japan, that were approved by the Ministry of Education, Culture, Sports, Science and Technology (MEXT) at the time of this study.  In previous studies on EFL textbooks in Japan by Kitao (1979, 1988) and Iwata, Ogawa, Wen, Sakamoto, Takarada, Horio, Muto, and Mogi (2001) among others, the findings included the cultural elements categorized by various criteria, defining topics and types of reading texts and illustrations, classifying the student activities regarding culture, the descriptions of societies represented, the unnatural use of the English language that are edited for grammatical correctness, and the lack of elements that are usually present in the natural course of conversations or in the authentic passages. This study of the reading passages and pre- and post-reading activities was guided by several theories and studies: First, the authentic use of a language reflects the writerâ  s culture (Brown, 1987; Byrnes, 1990; Gilmore, 2004; Honeyfield, 1977; Kramsch, 1993; Lamie, 1998; McKay, 1982; Shrum & Glisan, 2005; Swaffar, 1985), and the culture is reflected in the vocabulary (Sapir, 1949). Second, the readersâ   own cultural knowledge (C1) should be activated in understanding the culture of others (C2), comparing and contrasting C1 and C2 so that the differences and similarities will be more evident (Byrnes, 1990; Kolb, 1984; Kramsch, 1993; National Standards in Foreign Language Education Project [NSFLEP], 2005). The results show 1) that the reading passages were edited mostly by deleting and altering portions of the originals, and thus the culture was not present as in the original passages, and 2) pre-reading and post-reading activities/questions were literal and not designed to foster cultural understanding.",
  "description_provenance": [
    "Author Email: yasueoguro262@hotmail.com",
    "Advisor Email: jshrum@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: glubbs@vt.edu",
    "Advisor Email: jordahl@roanoke.edu",
    "Made available in DSpace on 2014-03-14T20:09:22Z (GMT). No. of bitstreams: 3 body.pdf: 265326 bytes, checksum: 69b9db868ce4ca53cbafb4f814a71996 (MD5) back.pdf: 281065 bytes, checksum: 16be11ff1784f6ce232e140723f72b2a (MD5) Front.pdf: 15896 bytes, checksum: 5999ab4089cd47dacd780c487c6621c1 (MD5)   Previous issue date: 2008-03-12"
  ],
  "handle": "26778",
  "identifier_other": "etd-04112008-122932",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04112008-122932/",
  "identifier_uri": "http://hdl.handle.net/10919/26778",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "body.pdf",
    "back.pdf",
    "Front.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "MEXT",
    "edited material",
    "authentic material",
    "Japan",
    "EFL",
    "culture",
    "reading"
  ],
  "title": "Presentation of culture in English as a foreign language reading textbooks in Japan",
  "type": "Dissertation"
}