{
  "contributor_author": "Phiri, Absalom Dumsell Keins",
  "contributor_committeechair": "Glasson, George E.",
  "contributor_committeemember": [
    "Triplett, Cheri F.",
    "Brand, Brenda R.",
    "Downey, Gary L.",
    "Brandt, Carol"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:22Z",
  "date_adate": "2008-05-02",
  "date_available": "2014-03-14T20:09:22Z",
  "date_issued": "2008-03-27",
  "date_rdate": "2008-05-02",
  "date_sdate": "2008-04-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Moving out of theoretical academic constructs, the indigenous movement has attracted the attention of the Malawian education system to explore the value for contextualizing science by way of indigenous technologies.  This is a milestone decision but the beginning is not smooth.  However, indigenizing the curriculum has a promise of hope to invigorate science educators to pursue the search for the science out of indigenous technologies out of the â  taken for grantedâ   and â  place-basedâ   traditional knowledge systems.  This is only the beginning of the journey in pursuit of local sciences that bear a promise for sustainability in development without relying exclusively on the outcomes of globalization.  This study sought to unravel the issues that surrounded implementation of ground braking primary school science and technology curriculum, which has integrated indigenous knowledge in the learning of science.  Commencing prior to the implementation of the new curriculum, this was a pilot study strategically conceptualized and timed to inform the curriculum developers and other stakeholders about issues to pay attention to as the curriculum implementation process unfolds. The study revealed that teachers are likely to face multiple challenges stemming from the design of the curriculum, teachers background knowledge in academic science, pedagogical knowledge, and cultural foundations.  The outcome of teaching was negatively affected by the design of the curriculum, teachersâ   knowledge of science, and attitudes toward indigenous knowledge.  Recommendations for improving the integration of indigenous knowledge and science in the curriculum include the need to better articulate the scientific principles involved in indigenous technologies and to involve learners in meaningful â  practical workâ   in science lessons, supported by further research.",
  "description_provenance": [
    "Author Email: aphiri@vt.edu",
    "Advisor Email: cftriplet@radford.edu",
    "Advisor Email: bbrand@vt.edu",
    "Advisor Email: glassong@vt.edu",
    "Advisor Email: downeyg@vt.edu",
    "Advisor Email: cbbrandt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:22Z (GMT). No. of bitstreams: 1 PhiriDissertationResubmited2May08.pdf: 2618150 bytes, checksum: a765baa32fb261b48baa6d59d43403c2 (MD5)   Previous issue date: 2008-03-27"
  ],
  "handle": "26777",
  "identifier_other": "etd-04112008-115442",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04112008-115442/",
  "identifier_uri": "http://hdl.handle.net/10919/26777",
  "publisher": "Virginia Tech",
  "relation_haspart": "PhiriDissertationResubmited2May08.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "technology",
    "Indigenous knowledge",
    "science",
    "integration",
    "primary school",
    "curriculum implementation"
  ],
  "title": "Exploring the Integration of Indigenous Science in the Primary School Science Curriculum in Malawi",
  "type": "Dissertation"
}