{
  "contributor_author": "Gardner, Robert Matthew",
  "contributor_committeechair": "Liu, Yilu",
  "contributor_committeemember": [
    "Abbott, A. Lynn",
    "Mili, Lamine M.",
    "Thorp, James S.",
    "Russell, David L."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:09:24Z",
  "date_adate": "2008-04-23",
  "date_available": "2014-03-14T20:09:24Z",
  "date_issued": "2008-03-28",
  "date_rdate": "2009-04-23",
  "date_sdate": "2008-04-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Classically, wide-area synchronized power system monitoring has been an expensive task requiring significant investment in utility communications infrastructures for the service of relatively few costly sensors.  The purpose of this research is to demonstrate the viability of power system monitoring from very low voltage levels (120 V).  Challenging the accepted norms in power system monitoring, the document will present the use of inexpensive GPS time synchronized sensors in mass numbers at the distribution level.  In the past, such low level monitoring has been overlooked due to a perceived imbalance between the required investment and the usefulness of the resulting deluge of information.  However, distribution level monitoring offers several advantages over bulk transmission system monitoring.  First, practically everyone with access to electricity also has a measurement port into the electric power system.  Second, internet access and GPS availability have become pedestrian commodities providing a communications and synchronization infrastructure for the transmission of low-voltage measurements.  Third, these ubiquitous measurement points exist in an interconnected fashion irrespective of utility boundaries.  This work offers insight into which parameters are meaningful to monitor at the distribution level and provides applications that add unprecedented value to the data extracted from this level.  System models comprising the entire Eastern Interconnection are exploited in conjunction with a bounty of distribution level measurement data for the development of wide-area disturbance detection, classification, analysis, and location routines. The main contributions of this work are fivefold:  the introduction of a novel power system disturbance detection algorithm; the development of a power system oscillation damping analysis methodology; the development of several parametric and non-parametric power system disturbance location methods, new methods of power system phenomena visualization, and the proposal and mapping of an online power system event reporting scheme.",
  "description_provenance": [
    "Author Email: rgardner@vt.edu",
    "Advisor Email: abbott@vt.edu",
    "Advisor Email: lmili@vt.edu",
    "Advisor Email: yilu@vt.edu",
    "Advisor Email: jsthorp@vt.edu",
    "Advisor Email: dlr@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:24Z (GMT). No. of bitstreams: 1 GARDNER_Dissertation_Pub_X.pdf: 33143266 bytes, checksum: d9c8e55b5bafbf9c1ad31106feb5d124 (MD5)   Previous issue date: 2008-03-28"
  ],
  "handle": "26779",
  "identifier_other": "etd-04112008-132017",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04112008-132017/",
  "identifier_uri": "http://hdl.handle.net/10919/26779",
  "publisher": "Virginia Tech",
  "relation_haspart": "GARDNER_Dissertation_Pub_X.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "TDOA",
    "FNET",
    "FDR",
    "GPS",
    "Wide-Area monitoring",
    "wide-area measurements",
    "power system event",
    "power system",
    "load shedding",
    "generation trip",
    "eastern interconnection",
    "wams",
    "ems",
    "nerc",
    "ercot",
    "wecc",
    "parzen window",
    "interconnection islanding",
    "PMU",
    "half-plane method",
    "least squares",
    "event trigger",
    "generation-load mismatch",
    "electromechanical wave",
    "wave propagation",
    "time delay of arrival",
    "oscillation trigger",
    "modal analysis",
    "electric grid",
    "transmission network",
    "transmission system",
    "hypocenter",
    "frequency",
    "matrix pencil",
    "mahalanobis distance"
  ],
  "title": "A Wide-Area Perspective on Power System Operation and Dynamics",
  "type": "Dissertation"
}