{
  "contributor_author": "Yilmaz, Harun",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_committeecochair": "Potter, Kenneth R.",
  "contributor_committeemember": [
    "Ogle, Gwendolyn J.",
    "Burton, John K."
  ],
  "contributor_department": "Learning Sciences and Technologies",
  "date_accessioned": "2014-03-14T20:09:22Z",
  "date_adate": "2007-04-25",
  "date_available": "2014-03-14T20:09:22Z",
  "date_issued": "2007-03-28",
  "date_rdate": "2010-04-25",
  "date_sdate": "2007-04-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Because of the rapid development of the use of computers in education, as well as the introduction of the World Wide Web (WWW), a growing number of web-based educational applications/tools have been developed and implemented to help both educators and administrators in the field of education. In order to assist program directors and faculty members in determining whether or not there is a gap between the current situation of the program and the desired situation of the program and whether or not program objectives meet accreditation standards, there is a need for a tool that works effectively and efficiently.  However, literature review showed that there is no automated tool specifically used for determining strengths and weaknesses of an academic program, and there is a lack of research in this area.  In Chapter 1, the authorâ  s intent is to discuss the purpose behind this developmental research and to provide a literature review that serves as the basis for the design of such an automated tool. This review investigates the following issues: objectives related to programs and courses, taxonomies of educational objectives, curriculum evaluation, accreditation and standards, automated tools, and a brief collaborative create-adapt-generalize model. Chapter 2 discusses the design and development of the automated tool as well as methodology focusing on the instructional design model and its steps. Chapter 3 presents the results of the expert review process and possible solutions for the problems identified during the expert review process. Also the Appendices include the documentation used during the expert review process.",
  "description_provenance": [
    "Author Email: hayilmaz@vt.edu",
    "Advisor Email: gwen.ogle@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:22Z (GMT). No. of bitstreams: 1 Dissertation-Yilmaz-finalized.pdf: 1423936 bytes, checksum: 32bf0545c1cd780f13934d2db5cacc96 (MD5)   Previous issue date: 2007-03-28"
  ],
  "handle": "26774",
  "identifier_other": "etd-04112007-144403",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04112007-144403/",
  "identifier_uri": "http://hdl.handle.net/10919/26774",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-Yilmaz-finalized.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "instructional design and development",
    "database driven web-based tool",
    "developmental research",
    "program evaluation",
    "accreditation tool"
  ],
  "title": "Identification of Academic Program Strengths and Weaknesses through Use of a Prototype Systematic Tool",
  "type": "Dissertation"
}