{
  "contributor_author": "Seibert, Horace Alan",
  "contributor_committeechair": "Gillespie, Diane Newkirk",
  "contributor_committeemember": [
    "Dawson, Christina M.",
    "Crockett, Jean B.",
    "Worner, Wayne Dempsey",
    "Smith, Barbara S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:26Z",
  "date_adate": "2000-04-13",
  "date_available": "2014-03-14T20:09:26Z",
  "date_issued": "2000-04-04",
  "date_rdate": "2001-04-13",
  "date_sdate": "2000-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Child Study as a Prereferral Mechanism at the Elementary Level in a Southwestern Virginia Local Education Agency <p> By <p> Horace Alan Seibert <p> Committee Chair: Diane Newkirk Gillespie <p> Educational Leadership and Policy Studies <p> <p> ABSTRACT <p> The purpose of this study was to investigate the child study process in a local education agency (LEA) with four elementary schools.  These data determine the extent that prereferral interventions are being implemented and whether these strategies influence the outcome of the Child Study Committee (CSC) decision. <p> All referrals to the CSC for the 1998-1999 school year (n=108) at the elementary level were examined to describe the students who are referred according to four primary independent variables of gender, grade level, ethnicity, and socioeconomic status (SES).  Free or reduced lunch was used as the measure for SES.  Students referred were members of the total elementary population of 1884 students in the LEA.  The total population was described according to gender, grade level, ethnicity, and SES.  Using cross tabulation techniques, the percentages of CSC referrals in each category are compared to the population.  Chi-square analysis was used to determine the significance (p<.05) of any differences in the observed distribution of this mutually exclusive categorical data. <p> Records of CSC meetings were reviewed to identify the presence of prereferral interventions.  Prereferral interventions are recommendations given by the CSC to help remedy a student's problem before referral for evaluation for special education is made.  Two independent raters examined the reason for referral and the recommendations made by the CSC.  The reasons and recommendations were categorized according to academic problems, behavioral problems, or one of three possible combinations of both.  Inter-rater reliability was measured using percent agreement across all categories and Cohen's kappa was calculated to provide additional rater validation.  Rater results were used to check for congruence between the problems leading to the referral and the interventions recommended.  Records of students who were referred for evaluation for special education were studied to determine the percentages found eligible and ineligible, and were examined according to gender, grade level, ethnicity, and SES. <p> Compared to the population, the group of students referred to the CSC during the 1998-1999 school year was over-representative of males and of students with low SES.  Most referrals to the CSC were for academic reasons.   In cases where the CSC did not recommend a full evaluation for consideration of special education services, the committee recommended prereferral interventions.  The recommendations of the committee typically were congruent with the reason for referral, but often did not specifically state who was responsible for implementing the interventions recommended. <p>",
  "description_provenance": [
    "Author Email: aseibert@salem.k12.va.us",
    "Advisor Email: tdawson@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: wworner@vt.edu",
    "Advisor Email: bssmith@runet.edu",
    "Advisor Email: dgilles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:26Z (GMT). No. of bitstreams: 1 etdv2.pdf: 1347779 bytes, checksum: 006aedd28f5e655c8d96c9e0d991e82d (MD5)   Previous issue date: 2000-04-04"
  ],
  "handle": "26787",
  "identifier_other": "etd-04122000-08260025",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122000-08260025/",
  "identifier_uri": "http://hdl.handle.net/10919/26787",
  "publisher": "Virginia Tech",
  "relation_haspart": "etdv2.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "IDEA",
    "evaluation",
    "appropriate evaluation",
    "functional assessment",
    "intervention",
    "at-risk students",
    "assessment"
  ],
  "title": "Child Study as a Prereferral Mechanism at the Elementary Level in a Southwestern Virginia Local Education Agency",
  "type": "Dissertation"
}