{
  "contributor_author": "Pierce, Meghan",
  "contributor_committeechair": "Brinberg, David L.",
  "contributor_committeecochair": "Bagchi, Rajesh",
  "contributor_committeemember": [
    "Weaver, Kimberlee D.",
    "Jaccard, James J."
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:09:25Z",
  "date_adate": "2012-05-02",
  "date_available": "2014-03-14T20:09:25Z",
  "date_issued": "2012-03-30",
  "date_rdate": "2012-05-02",
  "date_sdate": "2012-04-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Each time we meet a new person, we draw inferences based on our impressions. The first thing we are likely to notice is a personâ  s face. The face functions as one source of information, which we combine with the spoken word, body language, past experience, and the context of the situation to form judgments. Facial expressions serve as pieces of information we use to understand what another person is thinking, saying, or feeling. While there is strong support for the universality of emotion recognition, the ability to identify and interpret facial expressions varies by individual. Existing scales fail to include the dynamicity of the face. Five studies are proposed to examine the viability of the Facial Expression Intelligence Scale (FEIS) to measure individual ability to identify and interpret facial expressions. Consumer behavior implications are discussed.",
  "description_provenance": [
    "Author Email: mpierce@vt.edu",
    "Advisor Email: kdweaver@vt.edu",
    "Advisor Email: jjaccard@gmail.com",
    "Advisor Email: rbagchi@vt.edu",
    "Advisor Email: brinberg@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:25Z (GMT). No. of bitstreams: 1 Pierce_ME_D_2012.pdf: 4329761 bytes, checksum: e5bba69107abe61981012f4a0e4521c7 (MD5)   Previous issue date: 2012-03-30"
  ],
  "handle": "26786",
  "identifier_other": "etd-04112012-141952",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04112012-141952/",
  "identifier_uri": "http://hdl.handle.net/10919/26786",
  "publisher": "Virginia Tech",
  "relation_haspart": "Pierce_ME_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "facial expressions",
    "person perception",
    "emotion"
  ],
  "title": "Facial Expression Intelligence Scale (FEIS): Recognizing and Interpreting Facial Expressions and Implications for Consumer Behavior",
  "type": "Dissertation"
}