{
  "contributor_author": "Gorman, Thomas Andrew",
  "contributor_committeechair": "Haas, Carola A.",
  "contributor_committeemember": [
    "Aust, Wallace Michael",
    "Walters, Jeffrey R.",
    "Stauffer, Dean F.",
    "Kelly, Marcella J."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:09:24Z",
  "date_adate": "2009-04-30",
  "date_available": "2014-03-14T20:09:24Z",
  "date_issued": "2009-03-30",
  "date_rdate": "2009-04-30",
  "date_sdate": "2009-04-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Globally, amphibian species have been in decline and a wide range of factors have been purported to be driving the decline.  The Gulf Coastal Plain of Florida has a high degree of endemism and rarity and the biodiversity in the region includes a diverse suite of amphibian species.  Degradation of habitat has been considered by many to be a major part of amphibian declines, however amphibian declines are complex and in many cases multiple factors are occurring in concert.  My dissertation research examined aspects of habitat ecology and occupancy for two rare amphibians, Florida Bog Frog (Rana okaloosae) (Chapter 1, 2, and 3) and Reticulated Flatwoods Salamander (Ambystoma bishopi) (Chapter 5), that are both restricted to the Northern Gulf Coastal Plain.  Further, for R. okaloosae I examined the influence of a sympatric congener, Bronze Frog (R. clamitans clamitans), on microhabitat selection (Chapter 1) and growth of tadpoles (Chapter 4).  My overall goal was to be able to elucidate factors that limit the geographic range of R. okaloosae and A. bishopi and to identify habitat characteristics that managers could maintain or create to conserve or increase populations of these species.    My first chapter examined the microhabitat relationships between R. okaloosae and R. c. clamitans.  Rana okaloosae is endemic to northwestern Florida and is sympatric with R. c. clamitans, a more common and widely distributed congener.  Further, the two species appeared to be syntopic, have overlapping breeding seasons, and are known to hybridize.  The objectives of this chapter were to assess the microhabitat selection of both species and to assess differences in microhabitat use of males of both species during the breeding season.  My modeling of habitat selection and comparison of variables used by each species suggests that males of these species select different resources when calling.  Therefore, these sympatric ranids select for different resources at a fine scale, however there does appear to be some overlap among some selected habitat characteristics.    In Chapter 2, I assessed the habitat use of R. okaloosae at multiple spatial scales.  I surveyed for R. okaloosae and evaluated habitat characteristics at used sites and sites where I had no detections to develop among- and within-stream habitat models for R. okaloosae.  Rana okaloosae used habitats with high amounts of emergent vegetation at both the among-stream scale and the within-stream scale.  Emergent vegetation appears frequently in models of anuran habitat selection, particularly those that occur in fire-dominated landscapes.  Further understanding the habitat requirements of R. okaloosae will allow land managers to use appropriate management activities (e.g., prescribed fire) that will increase emergent vegetation and potentially restore habitat that may help increase populations of R. okaloosae.  In Chapter 3, I conducted aural surveys for R. okaloosae at two different spatial scales: range-wide and stream-level scales to understand how occupancy and colonization of R. okaloosae may be influenced by scale.  My results suggest that at both spatial scales occupancy of R. okaloosae was best described by the presence of mixed forest wetlands at survey sites.  At the range-wide scale, colonization and detection were constant across years, however, at the stream-level scale, colonization was predicted by the number of years since last fire and detection was best predicted by the additive combination of relative humidity and temperature.  Occupancy of R. okaloosae was patchy at the range-wide and at the stream-level scales and colonization was low at both scales, while derived estimates of local extinction were moderately high.  While R. okaloosae still occur in 3 watersheds where they were initially observed in the 1980â  s, one of the three watersheds appears to be very isolated and detections there are becoming very infrequent.  In Chapter 4, I experimentally evaluated the effects of R. c. clamitans tadpoles on R. okaloosae tadpoles.  My results suggest that there was limited influence of R. c. clamitans on R. okaloosae.  Conversely, it appeared that Rana c. clamitans was more susceptible to intraspecific competition than interspecific competition.  The lack of a strong competitive effect of Rana c. clamitans on Rana okaloosae suggests that competitive interactions among tadpoles may have a limited effect at the densities I examined.    In Chapter 5, our objectives were to evaluate a suite of within-pool factors (i.e., vegetation structure, water level, and an index to presence of fish) that could influence occupancy of breeding wetlands by larval flatwoods salamanders on Eglin Air Force Base in Florida, USA.  Site occupancy over a 4 year period was best described by a model that incorporated high herbaceous vegetation cover and open canopy cover.  Detection probability was assessed, but it varied among years and was not included in the model.  Our study suggests that managing the breeding habitat of flatwoods salamander for open canopies and dense herbaceous vegetation may contribute to this speciesâ   recovery.    In conclusion, Chapters 1-3 of my dissertation contribute to a growing understanding about the habitat ecology of R. okaloosae.  I have evaluated habitat use of R. okaloosae at multiple spatial scales.  At the finest spatial scale R. okaloosae selected for sites that had an abundance of cover probably decreasing their risk of predation (Chapter 1).  Similarly, in Chapter 2 at two spatial scales, among and within-streams, R. okaloosae selected for emergent vegetation.  Finally, at the broadest spatial scale, range-wide, R. okaloosae were found to be associated with mixed forest wetlands (Chapter 3).  I did not find strong support for competition between R. okaloosae and R. c. clamitans tadpoles, although there was some evidence of asymmetric competition (Chapter 4).  Further, adult males of each species did not select the same habitat characteristics for calling sites, so there appeared to be some resource partitioning (Chapter 1).  Finally, the presence of A. bishopi larvae was found to be associated with herbaceous vegetation and moderate amounts of canopy cover (Chapter 5).  Results from Chapter 2 and 5 suggest that both R. okaloosae and A. bishopi are associated with habitat conditions that are likely a result of fire penetrating wetland areas.",
  "description_provenance": [
    "Author Email: gormant@vt.edu",
    "Advisor Email: cahaas@vt.edu",
    "Advisor Email: waust@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: dstauffe@vt.edu",
    "Advisor Email: makelly2@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:24Z (GMT). No. of bitstreams: 1 Gorman.Dissertation.pdf: 1410983 bytes, checksum: d6f7bef45c8889bbc9407dd9e1b13487 (MD5)   Previous issue date: 2009-03-30"
  ],
  "handle": "26780",
  "identifier_other": "etd-04112009-101226",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04112009-101226/",
  "identifier_uri": "http://hdl.handle.net/10919/26780",
  "publisher": "Virginia Tech",
  "relation_haspart": "Gorman.Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Ambystoma bishopi",
    "Ambystoma cingulatum",
    "Fire",
    "Florida",
    "Florida Bog Frog",
    "Habitat",
    "Occupancy",
    "Rana clamitans clamitans",
    "Rana okaloosae",
    "Reticulated Flatwoods Salamander"
  ],
  "title": "Ecology of Two Rare Amphibians of the Gulf Coastal Plain",
  "type": "Dissertation"
}