{
  "contributor_author": "Wang, Sheng",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Wightman, James P.",
    "Riffle, Judy S.",
    "Kingston, David G. I.",
    "Long, Gary L."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:09:26Z",
  "date_adate": "2000-04-13",
  "date_available": "2014-03-14T20:09:26Z",
  "date_issued": "2000-03-06",
  "date_rdate": "2001-04-13",
  "date_sdate": "2000-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Phosphorus-containing high performance polymers have been extensively studied during the last 10 years. These materials are of interest for a variety of optical and fire resistant properties, as well as for their ability to complex with the inorganic salts. This dissertation has focused on the nature of the phosphonyl group interactions with hydroxyl containing polymers, such as the poly(hydroxy ether)s. These may be considered linear models of epoxy resins and are also closely related to dimethacrylate (vinyl ester) matrix resins that are important for composite systems. It has been shown that bisphenol A poly(arylene ether phosphine oxide/sulfone) homo- or statistical copolymers are miscible with a bisphenol A-epichlorohydrin based poly(hydroxy ethers) (PHE), as shown by dynamic mechanical analysis (DMA) and differential scanning calorimetry (DSC), infrared spectroscopy and , solid state cross polarization-magic angle spinning nuclear magnetic resonance (CP-MAS). These measurements illustrate the strong hydrogen bonding between the phosphonyl groups of the copolymers and the pendent hydroxyl groups of the PHE as the miscibility inducing mechanism. Complete miscibility at all blend compositions was achieved with as little as 20 mole% of phosphine oxide units in the poly(arylene ether) copolymer. Replacement of the bisphenol A moiety by other diphenols, such as hydroquinone, hexafluorobisphenol A and biphenol did not significantly affect blend miscibilities. Miscible polymer blends with PHE were also made by blending poly(arylene thioether phosphine oxide), and fully cyclized phosphine oxide containing polyimides based on (prepared from 2,2'-bis[4-(3,4-dicarboxyphenoxy)phenyl]propane dianhydride (BPADA) and bis(m-aminophenyl) methyl phosphine oxide (DAMPO)) or bis(m-aminophenyl) phenyl phosphine oxide). <p>Additional research has focused on the influence of these materials on the property characteristics of vinyl ester matrix resins and has shown that the concentration of phosphonyl groups controls the homogeneity of both oligomers and the resulting networks. Scanning electron microscopy (SEM), transmission electron microscopy (TEM), and fracture toughness measurements further confirmed the qualitative observations.  <p>Metal salts, such as CoCl2 and CuCl2 had earlier been demonstrated to form complexes/nanocomposites with phosphorus-containing poly(arylene ethers). It has been possible to prepare transparent films with 100 mol% of metal chlorides, based upon the phosphonyl groups. The films are transparent, unlike the opaque polysulfone control systems. FTIR results suggested the formation of inorganic salt and polymer complexes at low concentrations. TEM showed homogeneous morphology at low concentrations and excellent dispersion even at high mole % of salts. Cobalt materials reinforce the basic poly(arylene ether)s to provide higher modulus values and influence positively the char yield generated after TGA experiments in air. The cobalt salt/BPADA-DAMPO polyimide composites also yield transparent films, implying very small dimensions. <p>Silica-polymer nanocomposites were also produced by mixing commercial silica colloid/N,N-dimethylacetamide (DMAc) fine dispersions (~ 12 nm) with bisphenol A poly(arylene ether phenyl phosphine oxide). The dry films produced by solution casting are transparent and silica colloids are evenly dispersed (~ 12 nm) into the polymer matrix as shown by TEM. These nanocomposites increased char yield compared with the polymer control, suggesting their fire retardant character. In comparison, the silica/polysulfone hybrid films prepared by the same methods were opaque and the char yield was not improved. This different phase behavior has been explained to be due to the hydrogen bonding between phosphonyl groups and silanol hydroxyl groups on the surface of the nanosilica.",
  "description_provenance": [
    "Author Email: sheng.wang@dowcorning.com",
    "Advisor Email: wightman@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: dkingston@chemserver.chem.vt.edu",
    "Advisor Email: long@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:26Z (GMT). No. of bitstreams: 2 SWANG-THESIS.pdf: 17112484 bytes, checksum: 530021de0b3eaac229d68649a02f1855 (MD5) SWANG-VITA.pdf: 2724 bytes, checksum: 195bd12c4699bb59d6baa3033225feee (MD5)   Previous issue date: 2000-03-06"
  ],
  "handle": "26789",
  "identifier_other": "etd-04122000-14030017",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122000-14030017/",
  "identifier_uri": "http://hdl.handle.net/10919/26789",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "SWANG-THESIS.pdf",
    "SWANG-VITA.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Phosphorus-containing Polymer",
    "Silica",
    "Polymer Blend",
    "Phosphonyl",
    "Complex",
    "Nanocomposite",
    "Hydrogen Bonding",
    "Poly(arylene ether)",
    "Polyimide",
    "Hybrid",
    "Miscibility"
  ],
  "title": "PHOSPHORUS-CONTAINING POLYMERS, THEIR BLENDS, AND HYBRID NANOCOMPOSITES WITH POLY(HYDROXY ETHER), METAL CHLORIDES, AND SILICA COLLOIDS",
  "type": "Dissertation"
}