{
  "contributor_author": "Goodin, Jeremy Lee",
  "contributor_committeechair": "Rutherford, Charles L.",
  "contributor_committeemember": [
    "Stevens, Ann M.",
    "Denbow, Cynthia J.",
    "Wong, Eric A.",
    "Sible, Jill C."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:09:26Z",
  "date_adate": "2002-04-19",
  "date_available": "2014-03-14T20:09:26Z",
  "date_issued": "2002-04-03",
  "date_rdate": "2003-04-19",
  "date_sdate": "2002-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The LNCaP cell line is a versatile and useful model that is suitable for the study of human prostate cancer in vitro.  The elevation of LNCaP intracellular cAMP levels through the addition of membrane permeable cAMP analogues, phosphodiesterase inhibitors, adenylate cyclase activators, or components of the cAMP signal transduction pathway can induce reversible neuroendocrine differentiation.  Elucidation of those genes that are differentially expressed between undifferentiated prostate cancer cells and prostate cancer cells that have been induced to differentiate may present new insights for the molecular mechanisms governing neuroendocrine differentiation, early detection of prostate cancer, and/or potential targets for gene therapy.  In this study, differential display PCR was used to identify 226 differentially expressed PCR products.  Twelve of the differential display PCR products were confirmed by Northern blot analysis and cloned.  DNA sequencing and database comparisons were performed.  Among the differentially expressed genes, the human ribosomal S3a gene was identified as down regulated in response to LNCaP differentiation.  In order to better ascertain the mechanism by which HRS3a gene expression is decreased during differentiation, the promoter region for this gene was analyzed.  Electrophoretic mobility shift assay, antibody supershift assays, site-directed mutagenesis, and luciferase reporter gene analysis were employed to authenticate the roles of several transcription factors in the regulation of the HRS3a gene.  Two cyclic AMP response elements, a Sp1 element and a GA-binding protein element, were involved in the regulation of HRS3a gene expression.  In order to ascertain the effect of HRS3a down regulation in LNCaP cells, antisense phosphorothioate oligonucleotides were designed to inhibit HRS3a gene expression.  Treatment of LNCaP cells with antisense HRS3a oligonucleotides did not influence cAMP induced neuroendocrine differentiation but antisense treatment did result in a decrease in LNCaP cell growth.  In addition, it was determined that morphological changes associated with cAMP induced differentiation of LNCaP cells from the epithelial to the neuroendocrine state may not require alterations in gene expression nor the expression of novel proteins.",
  "description_provenance": [
    "Author Email: jergood@hotmail.com",
    "Advisor Email: ams@vt.edu",
    "Advisor Email: cdenbow@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: rutherfo@vt.edu",
    "Advisor Email: siblej@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:26Z (GMT). No. of bitstreams: 1 jergood3.pdf: 10473848 bytes, checksum: 16c62281e2f216420cdcce81db8cccac (MD5)   Previous issue date: 2002-04-03"
  ],
  "handle": "26791",
  "identifier_other": "etd-04122002-005459",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122002-005459/",
  "identifier_uri": "http://hdl.handle.net/10919/26791",
  "publisher": "Virginia Tech",
  "relation_haspart": "jergood3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "differentiation",
    "prostate cancer",
    "LNCaP",
    "cAMP",
    "neuroendocrine"
  ],
  "title": "Characterization of Gene Expression During Adenosine 3':5'-Cyclic Monophosphate Induced Neuroendocrine Differentiation in Human Prostatic Adenocarcinoma",
  "type": "Dissertation"
}