{
  "contributor_author": "Lee, Fei-sheng",
  "contributor_committeechair": "Piilonen, Leo E.",
  "contributor_committeemember": [
    "Simonetti, John H.",
    "Kinoshita, Kay",
    "Abashian, Alexander",
    "Chang, Lay Nam"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:09:26Z",
  "date_adate": "2001-04-29",
  "date_available": "2014-03-14T20:09:26Z",
  "date_issued": "2001-04-03",
  "date_rdate": "2002-04-29",
  "date_sdate": "2001-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This experiment attempts to measure the Michel parameter Rho in normal muon decay Mu to e nu_{e} nu_{mu} with a precision of 0.001.  The Standard Model with pure V-A interaction gives 0.75 for this parameter. The world average value is 0.7518 +/- 0.0026. A deviation of the value of Rho from 0.75 will indicate new physics.  The experiment, RHO, was carried out at the Los Alamos Meson Physics Facility (LAMPF) of Los Alamos National Laboratory (LANL) in New Mexico, USA, in 1993.  The existing experimental set-up that was built for the MEGA experiment was used for the RHO measurement.  The experiment was a collaboration of about 50 physicists from Los Alamos National Laboratory, Stanford University, Fermi National Accelerator Laboratory, Virginia Tech, Texas A University, Indiana University, Valparaiso University, University of Houston, University of Chicago and University of Virginia.  The result of the experiment is in agreement with Standard Model. The precision of this measurement was dominated by systematic uncertainties due to the fact that the positron spectrometer used in the measurement was designed for another experiment. Thus, the data analysis here focused mainly on the determination of systematic errors.",
  "description_provenance": [
    "Author Email: leefs1@yahoo.com",
    "Advisor Email: jhs@vt.edu",
    "Advisor Email: kayk@physics.uc.edu",
    "Advisor Email: abashian@vt.edu",
    "Advisor Email: laynam@vt.edu",
    "Advisor Email: piilonen@vpihe1.phys.vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:26Z (GMT). No. of bitstreams: 1 etd.pdf: 4756324 bytes, checksum: 3b73453faf7d1988b027bb933516508b (MD5)   Previous issue date: 2001-04-03"
  ],
  "handle": "26790",
  "identifier_other": "etd-04122001-101532",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122001-101532/",
  "identifier_uri": "http://hdl.handle.net/10919/26790",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Standard Model",
    "V-A Theory",
    "Michel Parameter",
    "Muon Decay"
  ],
  "title": "Measurement of the Michel Parameter Rho Using the MEGA Positron Spectrometer",
  "type": "Dissertation"
}