{
  "contributor_author": "O'Sickey, Matthew J.",
  "contributor_committeechair": "Wilkes, Garth L.",
  "contributor_committeemember": [
    "Saraf, Ravi F.",
    "Riffle, Judy S.",
    "Davis, Richey M.",
    "Marand, Eva"
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:09:27Z",
  "date_adate": "2002-05-22",
  "date_available": "2014-03-14T20:09:27Z",
  "date_issued": "2002-01-18",
  "date_rdate": "2003-05-22",
  "date_sdate": "2002-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Poly(urethane)s and poly(urethane-urea)s (PUU) are nearly ubiquitous, having been in existence since before the Second World War.  Spandex, a poly(urethane-urea) elastomeric fiber, is found in nearly all articles of apparel as well as in an increasing array of other consumer items.  The technology and chemistry of spandex is largely unchanged since its inception in the late 1950s, with the majority of spandex employing poly(tetramethylene ether glycol) as soft segments.  Recent developments in catalyst technology have resulted in the production of ultra-low monol content poly(propylene glycol) (PPG), which is nearly difunctional (f=1.95+).  This enhancement in difunctionality has potentially enabled the use of PPG as a spandex soft segment with potential spandex processing, performance, and economic benefits.<p> PPG-based spandex elastomers were evaluated in both film and fiber form for the purpose of investigating morphological, orientational, mechanical, and thermal properties with the goal of understanding relationships between chemistry, morphology and properties.  Key variables of interest were soft segment molecular weight (MW), molecular weight distribution (MWD), and composition, and hard segment content and composition.  Of those, the influence of the molecular weight distribution of the polyol used for soft segments was of foremost interest and had previously been largely neglected during the course of poly(urethane) and poly(urethane-urea) research.<p> It was found that over the range of PUU compositions suitable for production of spandex, that hard segment content and composition had little effect upon the morphology and thermal and mechanical properties.  Appreciable trends as functions of soft segment molecular weight were observed.  The soft segment MWD was adjusted through the addition of a low molecular weight homolog of PPG, tri(propylene glycol) (TPG), decreasing the number average soft segment MW.  The results of these experiments were contrary to those for variation of soft segment molecular weight.  It was determined that the low MW portion of the polyol MWD contributes to the building of hard segments in addition to or in lieu of soft segments.<p> Incorporation of TPG in the PUUs resulted in larger, presumably less cohesive, hard domains and increased hard segment content.  The TPG containing materials had enhanced tensile properties, less permanent set, and less residual orientation after deformation.  These materials proved quite comparable to those using PTMEG soft segments.<p> Comparison of film and fiber PUUs revealed only minor differences, implying that the trends and conclusions drawn from the study of films with spandex-like compositions would also hold for fibers.  The key difference between films and fibers is that fibers maintain some residual ordering and orientation due to drawing of the fibers during processing.  Of the processing variables investigated, none impacted the morphology as determined from small angle x-ray scattering.<p> It was concluded, that of the various compositional variables germane to spandex, the polyol MW and MWD played key roles in development of morphology, and hence properties.  The role of polyol MWD had been woefully neglected during the development of spandex previously, and was observed to be a critical variable.<p>",
  "description_provenance": [
    "Author Email: mosickey@vt.edu",
    "Advisor Email: rsaraf@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: emarand@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:27Z (GMT). No. of bitstreams: 10 chapter_3.pdf: 172427 bytes, checksum: aa771d04e0b2dbb707e1e12a3dba4883 (MD5) title_abstract_TOC_TOF.pdf: 82409 bytes, checksum: 8696b8a214839ad60d74a3a40817ee87 (MD5) chapter_6.pdf: 851727 bytes, checksum: c37c2f1e5fec483d5bc9be0376965048 (MD5) chapter_2.pdf: 919468 bytes, checksum: 4dda8442f8bcc30e4eadf0c7e933dfe2 (MD5) chapter_1.pdf: 13007 bytes, checksum: 52d70d1136987d52ad43eb79a6b1e154 (MD5) chapter_5.pdf: 551178 bytes, checksum: fbedd467988b05788d8e77c0d279c04e (MD5) chapter_4.pdf: 999427 bytes, checksum: ec65089c5a6218c5182063f2f77f4542 (MD5) chapter_8.pdf: 2094754 bytes, checksum: 3bd416a266fad18dbaa5fc1114ce0ae6 (MD5) chapter_9.pdf: 21162 bytes, checksum: 19e4e336971864e77e8975404a106a77 (MD5) chapter_7.pdf: 141234 bytes, checksum: 8030d257a93a8bd4cc695c6143bed8de (MD5)   Previous issue date: 2002-01-18"
  ],
  "handle": "26792",
  "identifier_other": "etd-04122002-012440",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122002-012440/",
  "identifier_uri": "http://hdl.handle.net/10919/26792",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chapter_3.pdf",
    "title_abstract_TOC_TOF.pdf",
    "chapter_6.pdf",
    "chapter_2.pdf",
    "chapter_1.pdf",
    "chapter_5.pdf",
    "chapter_4.pdf",
    "chapter_8.pdf",
    "chapter_9.pdf",
    "chapter_7.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ultra-low monol PPG",
    "PPG",
    "spandex",
    "polyurethane"
  ],
  "title": "Characterization of Structure-Property Relationships of Poly(urethane-urea)s for Fiber Applications",
  "type": "Dissertation"
}