{
  "contributor_author": "Quagraine, Victor Kwesi",
  "contributor_committeechair": "Beliveau, Yvan J.",
  "contributor_committeecochair": "Brandenburg, Stephanie",
  "contributor_committeemember": [
    "Mills, Thomas H.",
    "Thabet, Walid",
    "O'Brien, Michael J."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:09:28Z",
  "date_adate": "2007-05-07",
  "date_available": "2014-03-14T20:09:28Z",
  "date_issued": "2007-03-29",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Ghana, like many African countries, is plagued with unemployment, poverty and annual trade deficits. Unemployment and poverty have led to a socio-economic breakdown. They are believed to be among the causes that led to the 1994 Rwanda genocide. Despite the abundance of an unemployed labor force, Ghana continues to depend on imported equipment, costing $174 million annually for its earthmoving and construction activities. In 1986, the Government of Ghana, the World Bank, the International Labor Organization and the United Nations Development Program introduced labor-based road rehabilitation program in Ghana to help create more jobs and reduce the high unemployment and poverty incidence. The program has not been patronized due to the casual labor usage and labor organizational and management problems.</p><p> This research formulates the Family-Based Labor Management (FBLM) concept (also referred to as the HPWT-FBLM concept) by incorporating High Performance Work Team (HPWT), the Ghana Family System, and Roles and Responsibilities Matrix (RRM) concepts to make the program more attractive to labor and management. The FBLM concept would equip local contractors with the managerial skills to increase average monthly production from 1.33km to between 4km and 6km gaining competitive advantage over the 3.07km monthly production of the equipment-intensive contractor. Since the HPWT-FBLM concept has not been used, the related concepts HPWT and RRM concepts are used to validate the newly formulated recruitment, training, work method, communication and reward strategies. When adopted, the HPWT-FBLM concept would annually invest 10% of the $174 million for five years and yield employment increase of 23,000-34,000 the first year, growing to a total of 116,000-170,000 in five years. This concept will help reduce import deficit, conserve foreign exchange, and develop a pool of skilled workers and managers in Ghana. It has the potential of boosting the Ghanaian manufacturing industry for making hand-tools in lieu of purchasing imported equipment. The HPWT-FBLM concept can be adopted by the agriculture and building construction and other industries in Ghana that use large supplies of unskilled and semi-skilled labor. </p>",
  "description_provenance": [
    "Author Email: victorq@vt.edu",
    "Advisor Email: brandenburg_stef@yahoo.com",
    "Advisor Email: thommill@vt.edu",
    "Advisor Email: yvan@vt.edu",
    "Advisor Email: thabet@vt.edu",
    "Advisor Email: mjobrien@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:28Z (GMT). No. of bitstreams: 1 VictorQuagraineDissertation05MayETD.pdf: 1825319 bytes, checksum: 8352e9675b53058616dc988cc877d7ec (MD5)   Previous issue date: 2007-03-29"
  ],
  "handle": "26799",
  "identifier_other": "etd-04122007-204129",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122007-204129/",
  "identifier_uri": "http://hdl.handle.net/10919/26799",
  "publisher": "Virginia Tech",
  "relation_haspart": "VictorQuagraineDissertation05MayETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "economic multiplier",
    "labor organization",
    "labor management",
    "gravel roads",
    "family-based teams",
    "employment creation"
  ],
  "title": "New strategies to improve the management capacity of contractors for labor-based methods in road rehabilitation in Ghana",
  "type": "Dissertation"
}