{
  "contributor_author": "Yun, Myoung  Hui",
  "contributor_committeechair": "Chevone, Boris I.",
  "contributor_committeemember": [
    "Seiler, John R.",
    "Orcutt, David M.",
    "Hess, John L.",
    "Baudoin, Antonius B. A. M."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:09:27Z",
  "date_adate": "2007-05-09",
  "date_available": "2014-03-14T20:09:27Z",
  "date_issued": "2007-03-12",
  "date_rdate": "2007-05-09",
  "date_sdate": "2007-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Ozone is known to be the most widespread phytotoxic air pollutant. Ozone causes visible injury, reductions in photosynthesis, growth, and yield. Plant response to ozone may vary with species, varieties, and physiological age. Comparison between sensitive and tolerant cultivars has a key role in assessing ozone damage, investigating the sites of cellular injury, and identifying ozone tolerance mechanism. The objectives of this study were to investigate the effects of high ozone concentration (200 ppb) as well as ambient ozone concentrations (under field conditions) on net CO2 assimilation and PSII function in plants with different sensitivities to ozone. Two species of plants, tobacco (Nicotiana tabacum L.) and black cherry (Prunus serotina) were studied. Gas exchange analysis and chlorophyll fluorometry were utilized to characterize physiological function.   Two tobacco cultivars, Bel-B and Bel-W3, tolerant and sensitive to ozone, respectively, were grown in a greenhouse supplied with charcoal filtered air and then exposed to 200 ppb ozone for 4hr. Effects on chlorophyll fluorescence, net photosynthesis, and stomatal conductance are described. Quantum yield was calculated from chlorophyll fluorescence and the initial slope of the assimilation-light curve measured by the gas exchange method. Only the sensitive cultivar, Bel-W3, developed visible injury symptoms involving up to 50% of the 5th leaf. The maximum net photosynthetic rate of ozone-treated plants of the tolerant cultivar was reduced 40% compared to control plants immediately after ozone fumigation; however, photosynthesis recovered by 24 hr post fumigation and remained at the same level as control plants. In the sensitive cultivar, on the other hand, ozone exposure reduced maximum net photosynthesis up to 50%, with no recovery, apparently causing permanent damage to the photosystem. Reductions in apparent quantum efficiency, calculated from the assimilation-light curve, differed between cultivars. Bel-B showed an immediate depression of 14% compared to controls, whereas Bel-W3 showed a 27% decline. Electron transport rate (ETR), at saturating light intensity, decreased 58% and 80% immediately after ozone treatment in Bel-B and Bel-W3, respectively. Quantum yield decreased 28% and 36% in Bel-B and Bel-W3, respectively. It can be concluded that ozone caused a greater relative decrease in linear electron transport than maximum net photosynthesis, suggesting greater damage to PSII than the carbon reduction cycle.  Two different sensitivity classes of black cherry, tolerant and sensitive, growing under natural environmental conditions in Giles County, VA were assessed for physiological responses to ambient ozone concentrations. Additional measurements were made at two other sites near Blacksburg. Leaf gas exchange rates and visible foliar injury were determined monthly during the growing seasons of 2000, 2001, and 2002 to characterize the relationship of injury to altered photosynthetic function. Ambient ozone levels were sufficient to induce visible symptoms which were highly correlated with a reduction in PnMAX (maximum net photosynthetic rate under saturating light conditions) and Ã CO2 (quantum yield for carbon reduction) only in sensitive black cherry. Electron transport rate (ETR) and quantum yield of PSII (Ã PSII) were also reduced in sensitive black cherry. Maximum photochemical efficiency (Fv/Fm) in sensitive trees was severely damaged by ambient ozone. There were positive correlations between increasing cumulative ozone concentration and substantial reductions in PnMAX and in Ã CO2 of sensitive trees compared to tolerant trees. There was a negative correlation between chlorophyll content and percent leaf injury in sensitive black cherry",
  "description_provenance": [
    "Author Email: myun@vt.edu, giniani@hotmail.com",
    "Advisor Email: dmorcutt@vt.edu",
    "Advisor Email: jlhess@vt.edu",
    "Advisor Email: bchevone@vt.edu",
    "Advisor Email: abaudoin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:27Z (GMT). No. of bitstreams: 1 dissertation-newtitlefinal.pdf: 733036 bytes, checksum: 678fd3757523489b6aa4aac1471cd0e4 (MD5)   Previous issue date: 2007-03-12"
  ],
  "handle": "26797",
  "identifier_other": "etd-04122007-163336",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122007-163336/",
  "identifier_uri": "http://hdl.handle.net/10919/26797",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation-newtitlefinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Chlorophyll Fluorescence",
    "Photosynthetic Activity",
    "Black cherry",
    "Tobacco",
    "Ozone",
    "Foliar Visible Injury",
    "Gas Exchange"
  ],
  "title": "Effect of Ozone on CO2 Assimilation and PSII Function in Plants with Contrasting Pollutant Sensitivities",
  "type": "Dissertation"
}