{
  "contributor_author": "McPherson, Melinda Kay",
  "contributor_committeechair": "Morris, John R.",
  "contributor_committeemember": [
    "Brewer, Karen J.",
    "Taylor, Larry T.",
    "Tissue, Brian M.",
    "Anderson, Mark R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:09:27Z",
  "date_adate": "2005-04-13",
  "date_available": "2014-03-14T20:09:27Z",
  "date_issued": "2005-04-06",
  "date_rdate": "2005-04-13",
  "date_sdate": "2005-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The reactivity of chemical warfare agents (CWAs) and CWA simulants on organic and oxide surfaces is not currently well understood, but is of substantial importance to the development of effective sensors, filters and sorbent materials.  Polyurethane coatings are used by the armed forces as chemical agent resistive paints to limit the uptake of CWAs on surfaces, while the use of metal oxides has been explored for decontamination and protection purposes.  To better understand the chemical nature of the interactions of organophosphonate simulants with these surfaces, an ultra-high vacuum environment was used to isolate the target interactions from environmental gaseous interferences. The use of highly-characterized surfaces, coupled with molecular beam and dosing capabilities, allows for the elucidation of adsorption, desorption, and reaction mechanisms of CWA simulants on a variety of materials.     Model urethane-containing organic coatings were designed and applied toward the creation of well-ordered thin films containing carbamate linkages.  In addition, novel trisilanolphenyl-polyhedral oligomeric silsesquioxane (POSS) molecules were used to create Langmuir-Blodgett films containing reactive silanol groups that have potential use as sensors and coatings.  The uptake and reactivity of organophosphonates and chlorophosphates on these surfaces is the focus of this study.     Surfaces were characterized before and after exposure to the phosphates using a number of surface sensitive techniques including:  contact angle goniometry, reflection-absorption infrared spectroscopy (RAIRS), X-ray photoelectron spectroscopy (XPS) and temperature-programmed desorption (TPD) measurements.  In conjunction with surface probes, uptake coefficients were monitored according to the King and Wells direct reflection technique.  The integration of these analytical techniques provides insight and direction towards the design of more effective chemical agent resistant coatings and aids in the development of more functional strategies for chemical warfare agent decontamination and sensing.",
  "description_provenance": [
    "Author Email: mefergus@vt.edu",
    "Advisor Email: kbrewer@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: tissue@vt.edu",
    "Advisor Email: mark.anderson@vt.edu",
    "Advisor Email: morris@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:27Z (GMT). No. of bitstreams: 1 MelindaMcPhersonETD.pdf: 2590610 bytes, checksum: 07af6c61f8e354fcd2b44847f2e09793 (MD5)   Previous issue date: 2005-04-06"
  ],
  "handle": "26793",
  "identifier_other": "etd-04122005-110302",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122005-110302/",
  "identifier_uri": "http://hdl.handle.net/10919/26793",
  "publisher": "Virginia Tech",
  "relation_haspart": "MelindaMcPhersonETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "chemical warfare agent simulant",
    "trisilanolphenyl-polyhedral oligomeric silsesquiox",
    "self-assembled monolayers",
    "Langmuir-Blodgett film",
    "carbamate",
    "organophosphonate"
  ],
  "title": "The Reactivity of Chemical Warfare Agent Simulants on Carbamate Functionalized Monolayers and Ordered Silsesquioxane Films",
  "type": "Dissertation"
}