{
  "contributor_author": "Sheehy, Lauren Elizabeth",
  "contributor_committeecochair": [
    "Alexander, M. David",
    "Mallory, Walter D."
  ],
  "contributor_committeemember": [
    "Byers, Larry",
    "Farling, Alice"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:27Z",
  "date_adate": "2007-05-25",
  "date_available": "2014-03-14T20:09:27Z",
  "date_issued": "2007-02-07",
  "date_rdate": "2007-05-25",
  "date_sdate": "2007-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Educational leadership is challenged with meeting the requirements of No Child Left Behind (NCLB) and the Individuals with Disabilities Education Act (IDEA) legislation which mandates an education for all students. The focus on accessibility and accountability has resulted in more students with disabilities being served in the general education setting. The co-teaching service delivery model is offered in the school environment to provide an education for all students and is intended to include instruction that is specially designed for students with disabilities. Instructional leadership is essential to a successful implementation and maintenance of inclusive practices.  \tThis study sought to provide a better understanding of instructional leadership practices of the co-teaching service delivery model. The purpose of the study was to describe and explain how leaders support co-teaching. A distributed perspective based on the combination of activity and distributed cognition theories has been developed to study school leadership. This distributed perspective views leadership practice as an interaction between leaders, followers, and the situation (Spillane, Halverson, and Diamond 2004). This study examined instructional leadership practices of the co-teaching service delivery model at the elementary level. \tData were collected through a qualitative design, using interviews, observations, and review of documents. Interviews were conducted with administrators responsible for the direct supervision of the co-teaching model and with co-teachers, both general and special educators. Observations occurred in the school setting and related documents were collected and analyzed. The distributed leadership perspective guided the data collection focusing on leadership tasks and functions, task-enactment, and social and situational distribution of leadership practice. The data revealed leadership tasks that included forming the team, scheduling, assigning instructional roles, allocating resources, and developing the co-teacher relationship. Leadership was shared between the administrators and teachers with both providing leadership. School environment, organizational arrangements with available resources, and participantsâ   profile were identified as factors influencing the leadership practice of co-teaching. It is hoped by understanding the leadership roles and responsibilities of co-teaching, educators may better understand and nurture a co-teaching model that supports students in an inclusive environment.",
  "description_provenance": [
    "Author Email: lauren.sheehy@fcps.edu",
    "Advisor Email: mdavid@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:27Z (GMT). No. of bitstreams: 1 LaurenSheehysETDMay2007.pdf: 449784 bytes, checksum: 9b27513baf4071cf21cc9ebd7cb86432 (MD5)   Previous issue date: 2007-02-07"
  ],
  "handle": "26798",
  "identifier_other": "etd-04122007-165757",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122007-165757/",
  "identifier_uri": "http://hdl.handle.net/10919/26798",
  "publisher": "Virginia Tech",
  "relation_haspart": "LaurenSheehysETDMay2007.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Co-teaching",
    "Special Education",
    "Leadership Practices",
    "Shared Leadership"
  ],
  "title": "Leadership for Co-teaching: A Distributed Perspective",
  "type": "Dissertation"
}