{
  "contributor_author": "Kittle, Joshua Daniel",
  "contributor_committeechair": "Esker, Alan R.",
  "contributor_committeemember": [
    "Troya, Diego",
    "Morris, John R.",
    "Madsen, Louis A."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:09:29Z",
  "date_adate": "2012-05-02",
  "date_available": "2014-03-14T20:09:29Z",
  "date_issued": "2012-04-02",
  "date_rdate": "2012-07-04",
  "date_sdate": "2012-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As the two most abundant natural polymers on earth, cellulose and chitin have attracted increasing attention as a source of renewable energy and functional materials. Thin films of cellulose and chitin are useful for studying interactions of these materials with other natural and synthetic molecules via techniques such as quartz crystal microbalance with dissipation monitoring (QCM-D) and surface plasmon resonance (SPR). Because of the difficulty of extracting native cellulose, regenerated cellulose (RC), sulfated nanocrystalline cellulose (SNC), and desulfated nanocrystalline cellulose (DNC) thin films are often studied in its place. <p> In this work, QCM-D solvent exchange studies showed that water contents of RC, SNC and DNC films were proportional to the film thickness (d). Accessibility and degradation of the films was further analyzed via substrate exposure to cellulase. Cellulase adsorption onto RC films was independent of d, whereas cellulase adsorption onto SNC and DNC films increased with d. Enhanced access to guest molecules for SNC and DNC films relative to RC films revealed they are more porous. The porosity of these cellulose films aided in understanding the observed differences of xyloglucan (XG) adsorption onto their surfaces.  <p>Xyloglucan adsorption onto RC, SNC, and DNC was studied by QCM-D and SPR. The amount of adsorbed XG increased in the order RC < SNC < DNC. XG adsorption onto RC films was independent of d, whereas XG adsorption was weakly dependent upon d for SNC films and strongly dependent upon d for DNC films. However, XG adsorbed onto \"monolayer\" thin films of RC, SNC, and DNC in approximately the same amount. These results suggested that the morphology and surface charge of the cellulose substrate had a limited effect upon XG adsorption and that accessible surface area of the cellulose film may be the factor leading to apparent differences in XG adsorption for different surfaces. <p> The porosity and surface charge of SNC films presented a unique opportunity to examine polyelectrolyte adsorption and subsequent dewatering of the SNC substrate. The adsorption of a series of cationically derivatized dextran (cDex) polyelectrolytes with various degrees of substitution (DS) onto SNC was studied using QCM-D and SPR. As the hydrophobic character of the cDex samples increased, the water content of the adsorbed cDex layer decreased. For cDex with the greatest hydrophobic content, nearly 50% by mass of the initial water present in the porous SNC film was removed upon cDex adsorption. This study indicated that the water content of the film could be tailored by controlling the DS and hydrophobic character of the polyelectrolyte. <p> This work also presents the first report of smooth, homogeneous, ultrathin chitin films, opening the door to surface studies of binding interactions, adsorption kinetics, and enzymatic degradation. The chitin films were formed by spincoating trimethylsilyl chitin onto gold or silica substrates, followed by regeneration to a chitin film. The utility of these chitin films as biosensors was evident from QCM-D and SPR studies that revealed bovine serum albumin adsorbed as a monolayer.",
  "description_provenance": [
    "Author Email: jokittle@vt.edu",
    "Advisor Email: troya@vt.edu",
    "Advisor Email: jrmorris@vt.edu",
    "Advisor Email: lmadsen@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:29Z (GMT). No. of bitstreams: 2 Kittle_JD_D_2012_Copyright.pdf: 89791 bytes, checksum: dc59697e85dc48e2d0931fe3d204eee9 (MD5) Kittle_JD_D_2012.pdf: 3611053 bytes, checksum: 6eab947ccf2f65283bd9792d05db4e70 (MD5)   Previous issue date: 2012-04-02"
  ],
  "handle": "26806",
  "identifier_other": "etd-04122012-080620",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122012-080620/",
  "identifier_uri": "http://hdl.handle.net/10919/26806",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Kittle_JD_D_2012_Copyright.pdf",
    "Kittle_JD_D_2012.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Chitin",
    "Cellulose",
    "Surface Plasmon Resonance",
    "Quartz Crystal Microbalance",
    "Xyloglucan",
    "Dextran"
  ],
  "title": "Characterization of Cellulose and Chitin Thin Films and Their Interactions with Bio-based Polymers",
  "type": "Dissertation"
}