{
  "contributor_author": "Waiswa, Daniel",
  "contributor_committeechair": "Prisley, Stephen P.",
  "contributor_committeemember": [
    "Wynne, Randolph H.",
    "Copenheaver, Carolyn A.",
    "Stern, Marc J.",
    "Radtke, Philip J."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:09:28Z",
  "date_adate": "2011-04-29",
  "date_available": "2014-03-14T20:09:28Z",
  "date_issued": "2011-03-29",
  "date_rdate": "2011-04-29",
  "date_sdate": "2011-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Despite the important values forests play in the tropics, sustainable forest management still remains a challenge as manifested through continued forest loss. The objective of this study was to provide information on the dynamics of forest cover and their drivers vital for enhancing sustainable forest management in the Lake Victoria crescent, Uganda. Several methodologies including remote sensing and Geographic Information Systems techniques, analysis of landscape patterns and various social science techniques were integrated in working towards the stated goal. Results showed that the Lake Victoria crescent, Uganda covering an area of about 1,509,228 ha, experienced a decline in forest cover from 9.0% in 1989 to 4.4% in 2009. This was in comparison with non-forest cover which increased from 58.7% in 1989 to 63.5% in 2009 while open water coverage generally remained unchanged averaging 32.3% from 1989 to 2009. Mean annual deforestation rate from 1989 to 2009 decreased with a weighted mean rate of 2.56%. Both deforestation and afforestation declined between 1989 and 2009 although deforestation still exceeded afforestation. In addition to deforestation, the Lake Victoria crescent also experienced forest fragmentation from 1989 to 2009. Forests greater than 100 ha in size were the most vulnerable to forest fragmentation yet they still constituted a big proportion of forest cover in 2009. Deforestation was a consequence of proximate causes which were triggered by a number of underlying drivers acting singly or in combination, with underlying drivers being more influential. In a bid to promote sustainable forest management, there is a need to continue with efforts to curb deforestation and forest fragmentation, especially amongst forests greater than 100 ha. This could be achieved through empowerment of local communities to take a core role in sustainable management of forest resources.",
  "description_provenance": [
    "Author Email: dwaiswa@vt.edu",
    "Advisor Email: prisley@vt.edu",
    "Advisor Email: wynne@vt.edu",
    "Advisor Email: ccopenhe@vt.edu",
    "Advisor Email: mjstern@vt.edu",
    "Advisor Email: pradtke@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:28Z (GMT). No. of bitstreams: 1 Waiswa_D_D_2011.pdf: 4903373 bytes, checksum: 0e51aa537cea0ded1159e13046f96b73 (MD5)   Previous issue date: 2011-03-29"
  ],
  "handle": "26803",
  "identifier_other": "etd-04122011-144641",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122011-144641/",
  "identifier_uri": "http://hdl.handle.net/10919/26803",
  "publisher": "Virginia Tech",
  "relation_haspart": "Waiswa_D_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Sustainable Forest Management",
    "Landscape Metrics",
    "Landsat Imagery",
    "Proximate and Underlying Causes",
    "Deforestation"
  ],
  "title": "Dynamics of Forest Cover Extent, Forest Fragmentation and Their Drivers in the Lake Victoria Crescent, Uganda From 1989 to 2009",
  "type": "Dissertation"
}