{
  "contributor_author": "Alkandari, Mohammad  A.",
  "contributor_committeecochair": [
    "Bohner, Shawn A.",
    "Edwards, Stephen H."
  ],
  "contributor_committeemember": [
    "Cao, Yong",
    "Gracanin, Denis",
    "Wallace, Linda G."
  ],
  "contributor_department": "Computer Science and Applications",
  "date_accessioned": "2014-03-14T20:09:29Z",
  "date_adate": "2012-04-24",
  "date_available": "2014-03-14T20:09:29Z",
  "date_issued": "2012-04-02",
  "date_rdate": "2012-04-24",
  "date_sdate": "2012-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In todayâ  s world of global software teams, managing members from multiple countries and cultures adds to an already complex mix of software productivity issues. While software team compositions have been researched based on tasks, personality, and role descriptions, few models exist to help software project managers reason about software teams with respect to culture. As more culturally diverse teams develop software products, software project managers need to manage teams based on cultural factors that will inevitably arise. This research examines the effect of culture on software project team management, and its impacts on software productivity, especially as it pertains to requirements engineering tasks. The main objective is to investigate how individuals from different cultures work together in software development projects, and to use that understanding to formulate a model for reasoning about key cultural factors. Communication is a critical part of software project team effectiveness. Hence, this research examines how cultural factors (e.g., language, attitudes, roles, social organization, and time) affect the communication process in software development projects. Based on an initial survey of multicultural teams, this research examines some of the issues that arise from diverse teams working together. The survey results led to language and attitudes as dominant aspects of communication that impact software productivity. Time, roles, and social organization also had considerable influence from the preliminary results. From these results, the research approach was refined and more specific survey instruments were designed to aid in identifying the critical factors that impact software productivity. The results of the second set of the surveys showed that various cultures have different attitudes and behaviors, which in turn have distinct impacts on productivity in terms of more rework and delay. Furthermore, multicultural teams have miscommunication issues with respect to differences in languages, attitudes, roles, time, and social organization. The effect of some cultural factors on communication and productivity vary from culture to culture. Based on the results of the surveys, a model for Multicultural Software Project Team Management is described. This model was substantiated with further surveys using software professionals with experience working on multicultural teams.",
  "description_provenance": [
    "Author Email: mkandari@vt.edu",
    "Advisor Email: sbohner@vt.edu",
    "Advisor Email: edwards@cs.vt.edu",
    "Advisor Email: yongcao@vt.edu",
    "Advisor Email: gracanin@vt.edu",
    "Advisor Email: wallacel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:29Z (GMT). No. of bitstreams: 1 Alkandari_MA_D_2012.pdf: 4258678 bytes, checksum: 09fc134505d60074043426abfeb87ddb (MD5)   Previous issue date: 2012-04-02"
  ],
  "handle": "26808",
  "identifier_other": "etd-04122012-175907",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122012-175907/",
  "identifier_uri": "http://hdl.handle.net/10919/26808",
  "publisher": "Virginia Tech",
  "relation_haspart": "Alkandari_MA_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "software project",
    "team management",
    "requirements engineering",
    "culture"
  ],
  "title": "A Model of Multicultural Software Project Team Management applied in Requirements Engineering",
  "type": "Dissertation"
}