{
  "contributor_author": "Ginieczki, Michael Boyce",
  "contributor_committeechair": "Hult, Karen M.",
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "Wolf, James F.",
    "Farquhar, Marybeth"
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:09:28Z",
  "date_adate": "2010-05-03",
  "date_available": "2014-03-14T20:09:28Z",
  "date_issued": "2010-03-31",
  "date_rdate": "2010-05-03",
  "date_sdate": "2010-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT  In the U.S. Congress, the authorization-appropriation process is the formal model that establishes the separation between legislative and funding bills.  Additionally, it determines the jurisdiction of the congressional committees that oversee those bills. However, a number of scholars have concluded that the authorization-appropriations dichotomy is substantially different in practice than the model suggests.  Research in this area has shown that broad changes over the years have altered the roles of the authorization and appropriations committees.   At different times, members of the appropriations committees have been regarded as guardians of the federal treasury, advocates of federal funds for their congressional district, or partisans in support of a political agenda (Adler, 2000).   In addition to these roles, appropriators evidently have become more active in policymaking -- a role that traditionally has been the domain of the authorizing committees.  \t To further explore the policymaking role of appropriators, this dissertation used a case study approach that traced appropriatorsâ   interactions with the executive branch, focusing on a federal agency and its links with the appropriations subcommittees that have oversight and funding jurisdiction over the agencyâ  s programs.  Specifically, the study analyzed the relationship between the House and Senate Subcommittees on Labor, Health and Human Services, Education, and Related Agencies (L/ HHS) and the U.S. Department of Health and Human Servicesâ   Agency for Healthcare Research and Quality (AHRQ) during the period from 1989-2009.  Through an examination of critical incidents and contextual elements, this dissertation examined whether the Subcommittees on L/HHS increasingly have become significant players in shaping AHRQâ  s policies and direction.   In addition, the dissertation examined the impacts on AHRQ and possible reciprocal [Agency] influences on the Subcommittees.   This research has the potential to build on existing works related to the dynamics of the authorization-appropriations process.  Moreover, this research could provide a conceptual framework for analyzing the roles that the other congressional appropriations subcommittees play in relation to the executive branch agencies under their jurisdictions.",
  "description_provenance": [
    "Author Email: boyce.ginieczki@ahrq.hhs.gov",
    "Advisor Email: khult@vt.edu",
    "Advisor Email: ldudley@vt.edu",
    "Advisor Email: jwolf@vt.edu",
    "Advisor Email: mfarquhar@qualityforum.org",
    "Made available in DSpace on 2014-03-14T20:09:28Z (GMT). No. of bitstreams: 2 Ginieczki_MB_D_2010.pdf: 757343 bytes, checksum: f87f80040b75df18c31f54d2fd29ba08 (MD5) irbapprovalletterginieczki2010.pdf: 208893 bytes, checksum: cc111f341b7f1bc23a72b3d471ab20b1 (MD5)   Previous issue date: 2010-03-31"
  ],
  "handle": "26802",
  "identifier_other": "etd-04122010-142730",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122010-142730/",
  "identifier_uri": "http://hdl.handle.net/10919/26802",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Ginieczki_MB_D_2010.pdf",
    "irbapprovalletterginieczki2010.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "authorization",
    "congressional committees",
    "policymaking",
    "appropriations",
    "Agency for Healthcare Research and Quality"
  ],
  "title": "Are Appropriators Actually Authorizers in Sheepâ  s Clothing? A Case Study of the Policymaking Role of the House and Senate Appropriations Subcommittees on Labor, Health and Human Services, Education, and Related Agencies",
  "type": "Dissertation"
}