{
  "contributor_author": "Wallingford, Anna Kate",
  "contributor_committeechair": "Kuhar, Thomas P.",
  "contributor_committeecochair": "Schultz, Peter B.",
  "contributor_committeemember": [
    "Pfeiffer, Douglas G.",
    "Tholl, Dorothea B.",
    "Freeman, Joshua H."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:09:29Z",
  "date_adate": "2012-05-04",
  "date_available": "2014-03-14T20:09:29Z",
  "date_issued": "2012-03-30",
  "date_rdate": "2012-05-04",
  "date_sdate": "2012-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Harlequin bug (HB), Murgantia histrionica (Hahn), is a pest of cole crops.  Alternative control strategies were investigated for control of HB, including trap cropping and systemic neonicotinoid insecticide applications. Potential trap crops, mustard (Brassica juncea â  Southern Giant Curledâ  ), rapeseed (B. napus â  Athenaâ  ), rapini (B. rapa) and arugula (Eruca sativa) were preferred over collard (B. oleracea â  Championâ  ), and a non-brassica control, bean (Phaseolus vulgaris â  Broncoâ  ) in field-cage choice tests.  Harlequin bug could not complete development on bean, developed poorly on arugula but was found to complete development on mustard, collard, rapeseed and rapini.   In the field, mustard was found to be an effective trap crop for reducing HB feeding injury on collard at three experimental sites in 2010 and 2011.  Augmentation of the mustard trap crop with a systemic, neonicotinoid insecticide did not increase the level of control of harlequin bug for the duration of the ten week growing period. In olfactometer choice tests, male HB responded to plant volatiles of bean, collard and mustard, but preferred Brassica volatiles over those from bean.  Female response to plant volatiles alone was weak and inconsistent. Both males and females preferred volatiles from other males feeding on Brassica host plant over plant volatiles alone, and were deterred by volatiles from males feeding on bean versus the plant alone. Laboratory toxicity assays revealed that the neonicotinoid insecticides imidacloprid, thiamethoxam, dinotefuran, and clothianidin were toxic to HB nymphs; LC50 = 0.57, 0.52, 0.39, and 0.39 mg ai/liter, respectively.  Field experiments were conducted to evaluate the efficacy of these insecticides over time when applied as a one-time drench, and all were found to provide significantly higher mortality of HB for at least 14 days after application.",
  "description_provenance": [
    "Author Email: awalling@vt.edu",
    "Advisor Email: tkuhar@vt.edu",
    "Advisor Email: schultzp@vt.edu",
    "Advisor Email: dgpfeiff@vt.edu",
    "Advisor Email: tholl@vt.edu",
    "Advisor Email: joshfree@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:29Z (GMT). No. of bitstreams: 2 Wallingford_SEDcert.pdf: 81826 bytes, checksum: b98a5e3f4197afaea64106761584ba92 (MD5) WallingfordAK2012D.pdf: 631387 bytes, checksum: 800f4ce4e7522d7e782211edb44eca0b (MD5)   Previous issue date: 2012-03-30"
  ],
  "handle": "26807",
  "identifier_other": "etd-04122012-170653",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122012-170653/",
  "identifier_uri": "http://hdl.handle.net/10919/26807",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Wallingford_SEDcert.pdf",
    "WallingfordAK2012D.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "olfactometer",
    "harlequin bug",
    "Murgantia histrionica",
    "trap crop",
    "choice test",
    "neonicotinoid",
    "plant volatile",
    "murgantiol"
  ],
  "title": "Investigating host plant selection of harlequin bug, Murgantia histrionica (Hahn), in order to improve a trap cropping system for its management.",
  "type": "Dissertation"
}