{
  "contributor_author": "Yen, Chih-Lun",
  "contributor_committeechair": "Murrmann, Suzanne K.",
  "contributor_committeemember": [
    "McCleary, Ken W.",
    "Murrmann, Kent F.",
    "Perdue, Richard R."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:09:29Z",
  "date_adate": "2011-05-04",
  "date_available": "2014-03-14T20:09:29Z",
  "date_issued": "2011-03-30",
  "date_rdate": "2011-05-04",
  "date_sdate": "2011-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The hospitality industry continuously seeks to recruit available talents from a variety of sources in order to provide uniquely satisfying services to customers. This has become a more challenging task with companies expanding their business into markets where cultures are dissimilar to those of the US, and the customers are more diversified.  Although various studies have discussed different aspects of recruitment, they have not examined the relationship between recruitment messages and cultural difference extensively.  Additionally, the current understanding with regard to person-organization (PO) fit perception is limited as well.  This study aims to investigate the influence of context orientation, which is defined as the level of information explicitness in the transmitted communications (Hall, 1977), on job seekersâ   preference for recruitment messages, PO fit, and job application intention.  Measurement items were developed based on a review of the literature.  Using a paper-based questionnaire, a total of 350 college students majoring in hospitality and tourism management from three universities located in US and Taiwan, were sampled.  Factor analysis was employed to identify the underlying structure among measurement items.  Overall, eleven factors were extracted: six factors measured context orientation, three factors measured recruitment messages preference, and two factors measured PO fit.  Structural equation modeling and multiple regression analysis were then incorporated to examine proposed relationships between constructs.     Results from the statistical analysis indicated the relationships between context orientation, preferences for recruitment messages, PO fit, and job application intention were all positively related.  Additionally, individuals who exhibited the qualities of low-context orientation were found more likely to prefer recruitment messages that incorporated a higher level of detail, precision, and directness.  However, the proposed theoretical model was validated with the US group only.  This study did not find support with the Taiwan group and with both groups combined.      The findings provided some insight into the study of recruitment in the hospitality industry and its relationship with cultural differences. Further, the managerial implications were explored and a discussion of both the limitations of and suggestion for future research were discussed.",
  "description_provenance": [
    "Author Email: cny091@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:29Z (GMT). No. of bitstreams: 1 Yen_CL_D_2011.pdf: 2741893 bytes, checksum: 191a11405e235f44bafeec75d66f1117 (MD5)   Previous issue date: 2011-03-30"
  ],
  "handle": "26804",
  "identifier_other": "etd-04122011-215449",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122011-215449/",
  "identifier_uri": "http://hdl.handle.net/10919/26804",
  "publisher": "Virginia Tech",
  "relation_haspart": "Yen_CL_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Context Orientation",
    "Recruitment Messages",
    "Person-Organization Fit",
    "College Recruitment"
  ],
  "title": "The Influence of Context Orientation on Recruitment in the Hospitality Industry",
  "type": "Dissertation"
}