{
  "contributor_author": "Gervich, Curt Dawe",
  "contributor_committeecochair": [
    "Stern, Marc J.",
    "Stephenson, Max O. Jr."
  ],
  "contributor_committeemember": [
    "Bailey, Carol A.",
    "Dudley, Larkin S."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:09:28Z",
  "date_adate": "2010-04-26",
  "date_available": "2014-03-14T20:09:28Z",
  "date_issued": "2010-04-01",
  "date_rdate": "2010-04-26",
  "date_sdate": "2010-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Sustainable development assistance organizations (SDAOs) are designed to help interested producers conduct market research, identify clients and more effectively manage the process of moving products to market. Producers of sustainable products are often small business owners and grassroots entrepreneurs that produce and sell natural resource-based goods and services.  The broad research question this dissertation explored was whether the decision-making processes employed by producers, staff and board members in an SDAO hold implications for their collective achievement of sustainability. Data collection focused on understanding the various frames through which producers, staff and board members approach their work with, and decision making within, the SDAO as well as how they conceptualize sustainability.  This research employed semi-structured, in-depth interviews with growers, staff members and board members involved in one SDAO.  The analysis found that producers, staff and board members held a number of competing frames regarding the purposes and objectives of the SDAO as well as concerning the meaning of sustainability. Frames influence the ways that each stakeholder group perceived and participated in decision-making and lead to the institutionalization of tacitly supported decision-making practices.  These routines, when viewed through an efficiency lens, lead to quick decision-making, avoided conflict and allowed the SDAO to make decisions with consistency and clarity.  When viewed through an environmental justice lens, however, these practices proved exclusionary, favored some elements of sustainability rather than others, and supported some participants more than others. Taken together, the decision-making practices used by Blue Mountain Organic Vegetables limited the organizationâ  s capacity to develop a learning culture, created divisions among stakeholders and did not empower stakeholders with commitment to, and responsibility for SDAO decision-making.  Consequently, Blue Mountain Organic Vegetables now faces organizational challenges related to the development of commitment, trust and ultimately, resilience, within the organization.  The analysis concludes these concerns are potentially critical as these elements are essential for achieving sustainability, as they are also central to the organizationâ  s ability to respond to, and overcome, challenges.",
  "description_provenance": [
    "Author Email: cgervich@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: mjstern@vt.edu",
    "Advisor Email: mstephen@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:28Z (GMT). No. of bitstreams: 1 Gervich_CD_D_2010.pdf: 3562765 bytes, checksum: f5fa9418518c124cb404b0ca088f28bd (MD5)   Previous issue date: 2010-04-01"
  ],
  "handle": "26801",
  "identifier_other": "etd-04122010-115858",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122010-115858/",
  "identifier_uri": "http://hdl.handle.net/10919/26801",
  "publisher": "Virginia Tech",
  "relation_haspart": "Gervich_CD_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "environmental justice",
    "sustainability",
    "organic farming",
    "frames",
    "decision making"
  ],
  "title": "Exploring the Dynamics of Decision-Making in an Organic Farming Cooperative Amidst Competing Frames of Sustainability",
  "type": "Dissertation"
}