{
  "contributor_author": "Cheever, Beth Marie",
  "contributor_committeechair": "Webster, Jackson R.",
  "contributor_committeemember": [
    "Barrett, John E.",
    "Benfield, Ernest Fredrick",
    "Dolloff, C. Andrew",
    "Valett, H. Maurice"
  ],
  "contributor_department": "Biological Sciences",
  "date_accessioned": "2014-03-14T20:09:29Z",
  "date_adate": "2012-04-24",
  "date_available": "2014-03-14T20:09:29Z",
  "date_issued": "2012-03-30",
  "date_rdate": "2012-06-22",
  "date_sdate": "2012-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "I investigated the drivers of nutrient cycling by heterotrophic microbes during leaf decomposition in streams. My research addressed two overarching questions: 1) how do exogenous and endogenous factors interact to drive microbial nitrogen (N) cycling during organic matter decomposition in stream ecosystems, and 2) what affect will the global increase in biologically active N have on these factors and resulting fluxes? I conducted studies in natural streams and laboratory mesocosms to address these questions and used general stoichiometric theory to conceptualize diverse microbial assemblages as a single functional unit within stream ecosystems.  First, I described spatial and temporal patterns of N and phosphorus uptake and mineralization by leaf-associated microbial assemblages in five southern Appalachian streams which spanned a gradient of nitrate availability. I found wide variations in nutrient fluxes across time and space, perhaps due to macroinvertebrate-induced changes in microbial assemblage composition. Secondly, I explored the roles of endogenous and exogenous N in meeting microbial requirements. I isolated microbial biomass from leaves that had been labeled with N-15 and incubated in the same five Appalachian streams. The importance of exogenous N increased as decomposition progressed and was particularly important in streams with high N availability. Finally, I tested potential interactions between two exogenous drivers of microbial nutrient cycling: N availability and animal activity. I used mesocosms to test the effects of consumer nutrient recycling (CNR) and grazing by two shredders on microbial uptake under different N regimes. Animals only influenced microbial uptake under low N conditions. Shredder CNR generally stimulated uptake while grazing had a negative effect. My research provides a robust model describing N cycling by detritus-associated microbes over the course of decomposition. According to this model, microbes assimilate endogenous N during the initial stages of decomposition and immobilization of exogenous N becomes more important as decomposition progresses. The labeled substrate technique that I used to generate this model is an elegant way of testing the applicability of this model in other ecosystems. My results also suggest that anthropogenic activities that increase exogenous N availability have implications for N and C cycling in lotic systems.",
  "description_provenance": [
    "Author Email: bcheever@vt.edu",
    "Advisor Email: jwebster@vt.edu",
    "Advisor Email: jebarre@vt.edu",
    "Advisor Email: benfield @vt.edu",
    "Advisor Email: adoll@vt.edu",
    "Advisor Email: maury.valett@flbs.umt.edu",
    "Made available in DSpace on 2014-03-14T20:09:29Z (GMT). No. of bitstreams: 2 Cheever_BM_D_2012_Copyright.pdf: 197801 bytes, checksum: 3a09577304773202dc9db3d03f9f7490 (MD5) Cheever_BM_D_2012.pdf: 1030803 bytes, checksum: bc8b41ef8677f03ed5c32e7881c8f00e (MD5)   Previous issue date: 2012-03-30"
  ],
  "handle": "26809",
  "identifier_other": "etd-04122012-195537",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122012-195537/",
  "identifier_uri": "http://hdl.handle.net/10919/26809",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Cheever_BM_D_2012_Copyright.pdf",
    "Cheever_BM_D_2012.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "organic matter decomposition",
    "consumer nutrient recycling",
    "ecological stoichiometry",
    "streams",
    "nitrogen cycling"
  ],
  "title": "Microbial and metazoan effects on nutrient dynamics during leaf decomposition in streams.",
  "type": "Dissertation"
}