{
  "contributor_author": "Bryant, Lauren H",
  "contributor_committeechair": "Jones, Brett D.",
  "contributor_committeemember": [
    "Doolittle, Peter E.",
    "Sherman, Thomas M.",
    "Parkes, Kelly",
    "Wilkins, Jesse L. M."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:09:29Z",
  "date_adate": "2012-05-02",
  "date_available": "2014-03-14T20:09:29Z",
  "date_issued": "2012-03-30",
  "date_rdate": "2012-05-02",
  "date_sdate": "2012-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Psychosocial interventions to cultivate functional motivational beliefs in students are becoming increasingly popular.  However, in education it is easy to prematurely place hope in promising, emerging techniques and ideas before they are fully explored through research.  This study seeks to add to the body of knowledge examining psychosocial interventions by investigating one of the constructs popularly targeted in these interventions: self-theories of intelligence (STIs).  Within this study, STIs are explored within a previously tested model of motivational variables (goal orientations, effort beliefs, interest, causal attributions, and failure response).  The addition of metacognition to this model of achievement motivation is also investigated.  Because research has suggested that STIs may be domain-specific, this study focused on STIs in the domain of science.  Within this study, I used a self-report instrument comprised of seven subscales (each representing one motivational variable) to collect information on the achievement motivation of rural middle school students in the domain of science.  Students from three schools in two counties in rural southwest Virginia participated in the study (n = 367).  Independent and paired-samples t-tests, confirmatory factor analysis, mediational analyses, and structural equation modeling were used to answer the following four research questions.  1.\tTo what extent are rural middle school studentsâ   self-theories of intelligence fixed or malleable in the domain of science? 2.\tTo what extent do rural middle schools students have metacognitive knowledge and skills in the domain of science? 3.\tDoes metacognition mediate the relationship between a malleable belief of intelligence and positive effort beliefs? 4.\tTo what extent does the Blackwell, Trzesniewski, and Dweck (2007) model fit data obtained from rural middle school students in the domain of science? The results showed that the participants expressed a significant malleable view of intelligence, and demonstrated moderate amounts of metacognitive knowledge and skills.  Metacognition was shown to be a significant mediator of STIs and effort beliefs.  Standardized path coefficients for the achievement motivation model were significant; however, model fit indices revealed that this model may not be an adequate fit for these studentsâ   beliefs in the domain of science.",
  "description_provenance": [
    "Author Email: labryant@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: brettjones@vt.edu",
    "Advisor Email: tsherman@vt.edu",
    "Advisor Email: kparkes@vt.edu",
    "Advisor Email: wilkins@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:29Z (GMT). No. of bitstreams: 1 Bryant_LH_D_2012.pdf: 1218634 bytes, checksum: 4838a7d05af65479634d6815659cf72b (MD5)   Previous issue date: 2012-03-30"
  ],
  "handle": "26805",
  "identifier_other": "etd-04122012-075102",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122012-075102/",
  "identifier_uri": "http://hdl.handle.net/10919/26805",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bryant_LH_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "psychosocial interventions",
    "middle school transition",
    "metacognition",
    "achievement",
    "self-theories of intelligence"
  ],
  "title": "Self-Theories of Intelligence and Rural Middle School Students: Examining a Model of Achievement Motivation",
  "type": "Dissertation"
}