{
  "contributor_author": "Black, Aprille Noe",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Burton, John K.",
    "Evans, Michael A.",
    "Falls, Jane Ann",
    "Potter, Kenneth R."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:09:28Z",
  "date_adate": "2009-05-07",
  "date_available": "2014-03-14T20:09:28Z",
  "date_issued": "2009-04-02",
  "date_rdate": "2009-05-07",
  "date_sdate": "2009-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Educators are struggling to meet the ever-increasing challenges of preparing students to meet the demands of a global society.  The importance of collaboration and social interaction in online education has been well documented (Berge, 1998; Brown, Collins& Duguid, 1989, Fulford &Zhang, 1993; Gunawardena & McIssac, 2003; Kanuka & Anderson, 1998; Kearsley & Schneiderman, 1999; Sardamalia & Bereiter, 1994). Teachers and instructional designers are struggling to change the academic environment to meet the needs of millennial learners. The purpose of this study is to develop a theory driven process for designing computer-supported collaborative learning in an online environment. A careful analysis of the process for creating collaborative online instruction is conducted and a design strategy for the process is developed. The study provides suggested guidelines for practitioners to create collaborative online instruction. The design procedures emphasize social interaction to allow learners opportunities to explore, discover, and negotiate meaning in an authentic context. Online instruction requires the coupling of multiple areas of expertise to be successful. Although the pedagogical principles are the same, the global implications of â  flat worldâ   technology require an important weaving of collaborative interaction, graphic design, and pedagogy. Technology provides the transportation for achieving a collaborative environment; and, quality pedagogical practices provide the GPS (guidance positioning system) to direct collaborative instruction to its ultimate destinationâ  knowledge building.",
  "description_provenance": [
    "Author Email: anblack2@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: mae@vt.edu",
    "Advisor Email: jfalls@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:28Z (GMT). No. of bitstreams: 1 finaldissertationetdanblack2.pdf: 4434138 bytes, checksum: 63b1692a53798a5a32338d964680b9cb (MD5)   Previous issue date: 2009-04-02"
  ],
  "handle": "26800",
  "identifier_other": "etd-04122009-183505",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122009-183505/",
  "identifier_uri": "http://hdl.handle.net/10919/26800",
  "publisher": "Virginia Tech",
  "relation_haspart": "finaldissertationetdanblack2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Collaboration",
    "Distance Education",
    "Web-based Instruction",
    "Instructional Design",
    "Online Instruction",
    "Computer-Supported Collaborative Learning"
  ],
  "title": "The Design and Development of a Theory Driven Process for the Creation of Computer-Supported Collaborative Learning in an Online Environment",
  "type": "Dissertation"
}