{
  "contributor_author": "Judd, Jason D",
  "contributor_committeechair": "Sarin, Subhash C.",
  "contributor_committeecochair": "Cundiff, John S.",
  "contributor_committeemember": [
    "Koelling, Charles Patrick",
    "Bish, Douglas R."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:29Z",
  "date_adate": "2012-05-02",
  "date_available": "2014-03-14T20:09:29Z",
  "date_issued": "2012-03-30",
  "date_rdate": "2012-05-02",
  "date_sdate": "2012-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Recently, there has been a surge in the research and application of â  Green energyâ   in the United States.  This has been driven by the following three objectives: (1) to reduce the nationâ  s reliance on foreign oil, (2) to mitigate emission of greenhouse gas, and (3) to create an economic stimulus within the United States.  Switchgrass is the biomass of choice for the Southeastern United States.  In this dissertation, we address a feedstock logistics problem associated with the delivery of switchgrass for conversion into biofuel.   In order to satisfy the continual demand of biomass at a bioenergy plant, production fields within a 48-km radius of its location are assumed to be attracted into production.  The bioenergy plant is expected to receive as many as 50-400 loads of biomass per day.  As a result, an industrialized transportation system must be introduced as early as possible in order to remove bottlenecks and reduce the total system cost.  Additionally, we assume locating multiple bioenergy plants within a given region for the production of biofuel.  We develop mixed integer programming formulations for the feedstock logistics problem that we address and for some related problems, and we solve them either through the use of decomposition-based methods or directly through the use of CPLEX 12.1.0.  The feedstock logistics problem that we address spans the entire system-from the growing of switchgrass to the transporting of bio-crude oil, a high energy density intermediate product, to a refinery for conversion into a final product.  To facilitate understanding, we present the reader with a case study that includes a preliminary cost analysis of a real-life-based instance in order to provide the reader appropriate insights of the logistics system before applying optimization techniques for its solution.  First, we consider the benefits of active versus passive ownership of the production fields.  This is followed by a discussion on the selection of baler type, and then, a discussion of contracts between various business entities.  The advantages of storing biomass at a satellite storage location (SSL) and interactions between the operations performed at the production field with those performed at the storage locations are then established.  We also provide a detailed description of the operations performed at a SSL.  Three potential equipment options are presented for transporting biomass from the SSLs to a utilization point, defined in this study as a Bio-crude Plant (BcP).  The details of the entire logistics chain are presented in order to highlight the need for making decisions in view of the entire chain rather than basing them on its segments.  We model the feedstock logistics problem as a combination of a 2-level facility location-allocation problem and a multiple traveling salesmen problem (mATSP).  The 2-level facility location-allocation problem pertains to the allocation of production fields to SSLs and SSLs to one of the multiple bioenergy plants.  The mATSP arises because of the need for scheduling unloading operations at the SSLs.  To this end, we provide a detailed study of 13 formulations of the mATSP and their reformulations as ATSPs.   First, we assume that the SSLs are always full, regardless of when they are scheduled to be unloaded.  We, then, relax this assumption by providing precedence constraints on the availability of the SSLs.  This precedence is defined in two different ways and, is then, effectively modeled utilizing all the formulations for the mATSP and ATSP.    Given the location of a BcP for the conversion of biomass to bio-crude oil, we develop a feedstock logistics system that relies on the use of SSLs for temporary storage and loading of round bales.  Three equipment systems are considered for handling biomass at the SSLs, and they are either placed permanently or are mobile, and thereby, travel from one SSL to another.  We use a mathematical programming-based approach to determine SSLs and equipment routes in order to minimize the total cost incurred.  The mathematical program is applied to a real-life production region in South-central Virginia (Gretna, VA), and it clearly reveals the benefits of using SSLs as a part of the logistics system.  Finally, we provide a sensitivity analysis on the input parameters that we used.  This analysis highlights the key cost factors in the model, and it emphasizes areas where biggest gains can be achieved for further cost reduction.    For a more general scenario, where multiple BcPs have to be located, we use a nested Bendersâ   decomposition-based method.  First, we prove the validity of using this method.  We, then, employ this method for the solution of a potential real-life instance.  Moreover, we successfully solve problems that are more than an order of magnitude larger than those solved directly by CPLEX 12.1.0.  Finally, we develop a Bendersâ   decomposition-based method for the solution of a problem that gives rise to a binary sub-problem.  The difficulty arises because of the sub-problem being an integer program for which the dual solution is not readily available.  Our approach consists of first solving the integer sub-problem, and then, generating the convex hull at the optimal integer point.  We illustrate this approach for an instance for which such a convex hull is readily available, but otherwise, it is too expensive to generate for the entire problem.  This special instance is the solution of the mATSP (using Bendersâ   decomposition) for which each of the sub-problems is an ATSP.  The convex hull for the ATSP is given by the Dantzig, Fulkerson, and Johnson constraints.  These constraints at a given integer solution point are only polynomial in number.  With the inclusion of these constraints, a linear programming solution and its corresponding dual solution can now be obtained at the optimal integer points.  We have proven the validity of using this method.  However, the success of our algorithm is limited because of a large number of integer problems that must be solved at every iteration.  While the algorithm is theoretically promising, the advantages of the decomposition do not seem to outweigh the additional cost resulting from solving a larger number of decomposed problems.",
  "description_provenance": [
    "Author Email: jjudd@vt.edu",
    "Advisor Email: sarins@vt.edu",
    "Advisor Email: jcundiff@exchange.vt.edu",
    "Advisor Email: koelling@vt.edu",
    "Advisor Email: drb1@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:29Z (GMT). No. of bitstreams: 1 Judd_JD_D_2011.pdf: 4651125 bytes, checksum: f036f52d6511a72a31177b6ad2c65aaf (MD5)   Previous issue date: 2012-03-30"
  ],
  "handle": "26810",
  "identifier_other": "etd-04122012-215055",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04122012-215055/",
  "identifier_uri": "http://hdl.handle.net/10919/26810",
  "publisher": "Virginia Tech",
  "relation_haspart": "Judd_JD_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "multiple asymmetric traveling salesman problem (mA",
    "location-allocation",
    "p-median problem",
    "location-routing problem",
    "Bendersâ   decomposition",
    "nested Bendersâ   decomposition",
    "aggregation",
    "bio-crude oil",
    "logistics",
    "transportation",
    "preprocessing",
    "mix integer programming",
    "supply chain analysis",
    "harvest",
    "storage",
    "transportation",
    "biomass",
    "switchgrass",
    "supply chain logistics",
    "round bale",
    "square bale",
    "biomass contracts"
  ],
  "title": "Modeling and Analysis of a Feedstock Logistics Problem",
  "type": "Dissertation"
}