{
  "contributor_author": "Richardson, Elizabeth DeHart",
  "contributor_committeechair": "Finney, Jack W.",
  "contributor_committeemember": [
    "Cooper, Lee D.",
    "Ollendick, Thomas H.",
    "Jones, Russell T.",
    "Clum, George A. Jr."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:09:30Z",
  "date_adate": "1999-04-20",
  "date_available": "2014-03-14T20:09:30Z",
  "date_issued": "1998-11-18",
  "date_rdate": "2000-04-20",
  "date_sdate": "1999-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The primary objective of the current study was to propose and test a model for conceptualizing changes that occur as a result of adventure-based therapy (ABT), using self-efficacy theory as the conceptual foundation.  Other objectives were to test the effects of ABT on depressive symptomatology and related psychosocial variables (e.g., anxiety, self-esteem).  One-hundred and nine college freshmen participated in the screening procedure.  Subjects who indicated mild to severe depressive symptomatology on a self-report measure and did not report past history of trauma were invited to participate in the study.  Forty-one individuals were randomly assigned to either the adventure-based therapy (ABT) condition (i.e., a one-day ropes course experience) or to a placebo-control condition (i.e., an extended walk outdoors in a group).  Subjects were divided into two cohorts, each with treatment and control groups, because of safety requirements related to capacity on the ropes course.  Self-report instruments were completed immediately prior to participation (i.e., pretest), immediately following participation (i.e., posttest), and at 2-weeks and 2-months post participation. <p> Primary multivariate analyses of variance performed on state and trait dependent measures did not yield statistically significant interactions; therefore, results indicated that ABT may not significantly decrease depressive and anxious symptomatology in late adolescents with depressive symptomatology.  However, data were further analyzed for exploration in light of the generally low statistical power and group differences suggested by graphic displays of data.  Exploratory analyses suggested that ABT may increase efficacy for coping with anxiety created by novel situations and efficacy for working and problem-solving in a group.  It was therefore suggested that self-efficacy theory warrants further consideration as a theoretical framework for explaining changes that occur as a result of ABT.  In addition, exploratory analyses suggested that ABT may also reduce anxiety and general psychological distress.  Finally, depressive symptomatology decreased for individuals in the ABT treatment group and the placebo-control group according to exploratory analyses; however, there were no differences between groups.  Further exploration of the potential effects of ABT on depressive and anxious symptomatology and general psychological distress is warranted.",
  "description_provenance": [
    "Author Email: edrichar@jetson.uh.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: rtjones@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:30Z (GMT). No. of bitstreams: 2 TableFigure.pdf: 233397 bytes, checksum: 2824070e79b027c084a1879733485db7 (MD5) Text.pdf: 245097 bytes, checksum: b082719ccc55ee4cefe1348ea4b885a2 (MD5)   Previous issue date: 1998-11-18"
  ],
  "handle": "26812",
  "identifier_other": "etd-041299-130716",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041299-130716/",
  "identifier_uri": "http://hdl.handle.net/10919/26812",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "TableFigure.pdf",
    "Text.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "depression",
    "adolescence",
    "self-esteem",
    "anxiety"
  ],
  "title": "Adventure-Based Therapy and Self-Efficacy Theory:  Test of a Treatment Model for Late Adolescents with Depressive Symptomatology",
  "type": "Dissertation"
}