{
  "contributor_author": "Galper, Daniel I.",
  "contributor_committeecochair": [
    "Winett, Richard A.",
    "Crawford, Helen J."
  ],
  "contributor_committeemember": [
    "Singh, Kusum",
    "Sturgis, Ellie T.",
    "Stephens, Robert S."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:09:29Z",
  "date_adate": "1999-04-13",
  "date_available": "2014-03-14T20:09:29Z",
  "date_issued": "1999-04-08",
  "date_rdate": "2000-04-13",
  "date_sdate": "1999-04-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Bulimia is often viewed as an extreme expression of eating concerns and body image disturbances that afflicts many adolescent and adult women. The cognitive strategies employed by individuals to inhibit eating and facilitate bingeing and purging are thought to include disattending internal sensations of hunger and satiety while sustaining attention on food, distorted beliefs, and interoceptive experiences (e.g., Heatherton & Baumeister, 1991). To the extent that these attentional and perceptual shifts mediate bulimic symptomatology, individuals with bulimic tendencies should exhibit certain cognitive attributes. Because hypnotizability, dissociation, and absorption have each been invoked (either directly or indirectly) as explanatory constructs for clinical and subclinical bulimia, the present study evaluated the absolute and relative effects of these factors on bulimic symptomatology in a large sample of undergraduate women (N = 309) using structural equation modeling. Following 2 assessments of hypnotic susceptibility (Harvard Group Scale of Hypnotic Susceptibility, Form A [Shor & Orne, 1962] & Group Stanford Hypnotic Susceptibility Scale, Form C [Crawford & Allen, 1982]), participants completed measures of eating disorder symptomatology (Eating Disorders Inventory-2 [Garner, 1991]; Three Factor Eating Questionnaire [Stunkard & Messick, 1985]), dissociation (Dissociative Experiences Scale [Carlson & Putnam, 1986]; Dissociation Questionnaire [Vanderlinden et al., 1993]), and absorption (Tellegen Absorption Scale [Tellegen & Atkinson, 1974]; Differential Attentional Processes Inventory [Crawford, Brown, & Moon, 1993; Grumbles & Crawford, 1981]). A final model including the latent constructs Hypnotizability, Dissociation, Absorption, and Bulimic Symptomatology provided a very good fit to the data (X 2 (58, N = 309) = 31.09, NFI = .932, CFI = .967, & RMSEA = .053). As hypothesized, dissociation was found to a have moderate effect (Standardized coefficient = .32, p < .01) on Bulimic Symptomatology when controlling for Hypnotizability and Absorption. Moreover, contrary to past research, the path between Hypnotizability and Bulimic Symptomatology and the path between Absorption and Bulimic Symptomatology were not significant. Based on these finding, we can now speak with increased confidence of a meaningful link between dissociation and the continuum of bulimic symptomatology. A pathological dissociative style appears to contribute to the development of bulimia.",
  "description_provenance": [
    "Author Email: daniel.calper@utsouthwestern.edu",
    "Advisor Email: rswinett@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:29Z (GMT). No. of bitstreams: 1 danetd.pdf: 126537 bytes, checksum: be89c06dfb3238712e2a63e0bc08ecac (MD5)   Previous issue date: 1999-04-08"
  ],
  "handle": "26811",
  "identifier_other": "etd-041299-114444",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041299-114444/",
  "identifier_uri": "http://hdl.handle.net/10919/26811",
  "publisher": "Virginia Tech",
  "relation_haspart": "danetd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Structural Equation Modeling",
    "Absorption",
    "Hypnosis",
    "Dissociation",
    "Bulimia"
  ],
  "title": "Bulimic Symptomatology in College Women: To What Degree are Hypnotizability, Dissociation, and Absorption of Relevance?",
  "type": "Dissertation"
}