{
  "contributor_author": "Viers-Yaun, Dawn",
  "contributor_committeechair": "Blieszner, Rosemary",
  "contributor_committeemember": [
    "Skaggs, Gary E.",
    "Prouty, Anne M.",
    "Johnson, Scott W.",
    "Piercy, Fred P."
  ],
  "contributor_department": "Marriage and Family Therapy",
  "date_accessioned": "2014-03-14T20:09:31Z",
  "date_adate": "2003-04-16",
  "date_available": "2014-03-14T20:09:31Z",
  "date_issued": "2003-04-02",
  "date_rdate": "2004-04-16",
  "date_sdate": "2003-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this study, I explored the career satisfaction, relationship satisfaction, friendship intimacy, and mentoring functions of female faculty in marriage and family therapy (MFT) programs. Study participants included 111 women affiliated with a MFT program in a research or liberal arts institution or training institute. Participants completed the Faculty Satisfaction Questionnaire (FSQ), Kansas Martial Satisfaction Questionnaire (KMS), Miller Social Intimacy Scale (MSIS), Mentoring Functions Questionnaire, and a demographics section with open-ended questions about their experiences. Faculty women reported higher levels of satisfaction with teaching than with service or research and higher satisfaction with service than research. Faculty who were part of a significant relationship reported high scores on the KMS while faculty who had a close friend indicated moderate intimacy levels on the MSIS. Those with a mentor reported that their mentor provided more psychosocial mentoring functions than career mentoring functions. Characteristics of the mentor and the mentoring relationship predicted the extent of the psychosocial and mentoring functions provided. \tAssociations among career satisfaction, relationship satisfaction, friendship intimacy, mentoring functions, and demographic variables were determined using stepwise multiple regression analyses on a subsample of 37 faculty with complete data on key career and relationship functions. Expanded service duties, psychosocial mentoring functions, being Caucasian, and having received an award for research were associated with greater levels of career satisfaction. Career mentoring functions were associated with reduced levels of career satisfaction. Possession of a doctorate and psychosocial mentoring functions were associated with greater levels of friendship intimacy.  Based on the results of this research and the literature of women in academia, implications and suggestions for improving the academic climate are presented for institutions, MFT programs, the American Association for Marriage and Family Therapy (AAMFT), and the Commission on Accreditation of Marriage and Family Therapy Education (COAMFTE). Limitations and suggestions for future research are also discussed.",
  "description_provenance": [
    "Author Email: daviers@vt.edu",
    "Advisor Email: geskaggs@aol.com",
    "Advisor Email: aprouty@attbi.com",
    "Advisor Email: scottwj@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:31Z (GMT). No. of bitstreams: 6 Front.pdf: 83961 bytes, checksum: 5565c77195092a6995832fcb19d0c6fd (MD5) discussion.pdf: 163531 bytes, checksum: 04cd31b12bb4c46e4a5eb198de82f3cc (MD5) References_Vitae.pdf: 210655 bytes, checksum: 313d3b8a093c54dbf69e835c7923e1d1 (MD5) results.pdf: 252280 bytes, checksum: 489b287dd982c197998c106b6eac529b (MD5) appendices.pdf: 176512 bytes, checksum: cb6d8530922f41a9f15123136f0db922 (MD5) chaper123.pdf: 236243 bytes, checksum: 2fd0a912b65bbb33ed5af640498f90e8 (MD5)   Previous issue date: 2003-04-02"
  ],
  "handle": "26819",
  "identifier_other": "etd-04132003-134548",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132003-134548/",
  "identifier_uri": "http://hdl.handle.net/10919/26819",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Front.pdf",
    "discussion.pdf",
    "References_Vitae.pdf",
    "results.pdf",
    "appendices.pdf",
    "chaper123.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Friendship Intimacy",
    "Career Satisfaction",
    "Relationship Satisfaction",
    "Female Faculty",
    "Mentoring Relationships"
  ],
  "title": "Career and Relationship Satisfaction among Female Faculty in MFT Programs",
  "type": "Dissertation"
}