{
  "contributor_author": "Caravati, Paula Ciavarella",
  "contributor_committeechair": "Hertzler, Ann A.",
  "contributor_committeemember": [
    "Cox, Ruby H.",
    "Winett, Richard A.",
    "Covert, Robert",
    "Southard, Douglas R."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:09:30Z",
  "date_adate": "2001-04-18",
  "date_available": "2014-03-14T20:09:30Z",
  "date_issued": "2001-04-05",
  "date_rdate": "2004-04-18",
  "date_sdate": "2001-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Obesity and relapse after dieting pose a significant threat to an increasing number of adults in this country.  Resistance to treatment and high relapse rates make this problem frustrating for patients and practitioners. There is limited research on relapse causation; research on social and life circumstance factors is uncommon. Given the limitations of existing research, the purpose of this study was to investigate the natural course of obesity relapse.  A purposive sample of eight obese women, ages 31-57, was selected.  All of the women relapsed at least one or more times throughout their lives. A qualitative study design was used to examine and integrate their attributions for relapse.           The qualitative paradigm was selected because it allowed for an inclusive study of relapse without confining the investigation to a predetermined set of responses.  Information was gathered on contributory factors: physical, social and psychological, but not limited to these areas.  These factors were reported in a case study format. Verbatim quotes were used to provide descriptive information and insight into individual cases.  Cases were analyzed for main attributions; key words and phrases were used to develop categories.  Common themes were derived from these categories and examined across the cases.      Conventional wisdom about the factors, which contribute to obesity relapse, was challenged by this research study. Excess calories and decreased physical activity were not the only conditions that were contributory to the respondentsâ   relapses. Diverse social and psychological issues often combined with physical factors to dominate the respondentsâ   attributions. The relapse attribution themes commonly represented in the case studies included: the impact of food restriction, the impact of having personal choice taken away, negative emotions, physiological factors, lifestyle demands and the return to familiar food habits.         Based on this study, it is recommended that obesity practitioners consider assessment and treatment modalities that are holistic. A paradigm shift away from traditional approaches may be a necessary step in providing more effective treatment.  Additional research, which focuses on life circumstances and obesity relapse, is needed.",
  "description_provenance": [
    "Author Email: PCaravati@excite.com",
    "Made available in DSpace on 2014-03-14T20:09:30Z (GMT). No. of bitstreams: 1 final.pdf: 578526 bytes, checksum: 575adcd1669de8c0d44d44ade1e924bb (MD5)   Previous issue date: 2001-04-05"
  ],
  "handle": "26817",
  "identifier_other": "etd-04132001-153828",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132001-153828/",
  "identifier_uri": "http://hdl.handle.net/10919/26817",
  "publisher": "Virginia Tech",
  "relation_haspart": "final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    ":  Obesity",
    "Relapse",
    "Women",
    "Qualitative",
    "Case Studies"
  ],
  "title": "Obesity Relapse in Women",
  "type": "Dissertation"
}