{
  "contributor_author": "Farrell, Inez Hofner",
  "contributor_committeecochair": [
    "Magliaro, Susan G.",
    "Moore, David Michael"
  ],
  "contributor_committeemember": [
    "Lockee, Barbara B.",
    "Burton, John K.",
    "Sherman, Gregory P."
  ],
  "contributor_department": "Instructional Technology",
  "date_accessioned": "2014-03-14T20:09:30Z",
  "date_adate": "2000-04-14",
  "date_available": "2014-03-14T20:09:30Z",
  "date_issued": "2000-03-07",
  "date_rdate": "2001-04-14",
  "date_sdate": "2000-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Navigation tools can be used to direct the amount of learner control and interactivity available in a hypermedia hybrid CD-ROM environment. The purpose of this study was to ascertain if varying the amount of learner control and interactivity through the used of navigation tools would influence the achievement and attitude of learners. The design of the study was a quasi-experimental study with random assignment of three ability levels of students to three navigation tool treatment groups. A 3 (navigation tool treatments) by 3 (ability levels) by 2 (achievement and attitude) factorial design was employed to test the hypotheses. A module titled The Poetry Portal was constructed to test 3 navigation tools (linear, menu and search engine) and their effect on achievement and attitude scores. One hundred forty-six eighth grade students were stratified into 3 ability levels (low, middle, high) by Stanford 9 scores. The module content correlated to the English 8 Virginia Standards of Learning. Results of this study based on the data are derived from descriptive statistics, two-way ANOVA, one-way ANOVA and a Tukey/Kramer Post Hoc test. The level of significance was set at .05. Results show a significant gain in achievement for high ability level students using the navigation tool search engine. Significant difference in attitude was found for all ability levels using the navigation tool menu. Suggestions for further research in this area are included.",
  "description_provenance": [
    "Author Email: ifarrell@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: shermang@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:30Z (GMT). No. of bitstreams: 2 Navigation_Tools.pdf: 1364471 bytes, checksum: 621a6a9bbb3d562957df270573dc028b (MD5) IFResume1.pdf: 66601 bytes, checksum: 726e268203c870cc3e223eac82e2e0b0 (MD5)   Previous issue date: 2000-03-07"
  ],
  "handle": "26815",
  "identifier_other": "etd-04132000-16260041",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132000-16260041/",
  "identifier_uri": "http://hdl.handle.net/10919/26815",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Navigation_Tools.pdf",
    "IFResume1.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Learner Control",
    "Hybrid CD-Rom",
    "Hypermedia",
    "Interactivity",
    "Navigation"
  ],
  "title": "Navigation Toolsâ   Effect on Learnersâ   Achievement and Attitude",
  "type": "Dissertation"
}