{
  "contributor_author": "Lahman, Maria",
  "contributor_committeechair": "Fu, Victoria R.",
  "contributor_committeemember": [
    "Stremmel, Andrew J.",
    "Martin, Doris",
    "Uttech, Melanie R.",
    "Benson, Mark J."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:30Z",
  "date_adate": "2001-04-17",
  "date_available": "2014-03-14T20:09:30Z",
  "date_issued": "2001-02-27",
  "date_rdate": "2006-03-21",
  "date_sdate": "2001-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of the study was to conduct a qualitative inquiry into the teacher-child caring relationship in order to portray a picture of caring possibilities by describing interactions in one public school classroom.  Participant observation, interviews, a dialogic journal and artifact analysis was conducted with a public school preschool class.  Through qualitative inquiry, thematic analysis, and interpretation of the data gathered, along with my reflections, review of the literature, and based on my experiences as a teacher for 10 years, I have gained a deeper understanding of the caring teacher-child relationship.  It is my desire that as I relate this understanding it may inform other teachers about the caring aspect of teaching. The following question helped guide the study.  How is the teacher-child caring relationship manifested through actions, words, thoughts, and feelings?<p>  In keeping with the philosophy, caring engenders care, it is thought that the caring teacher will help children become caring members of their classroom. It can be assumed that when a teacher makes moral decisions in the context of teaching and learning, regarding the child, she creates a culture of care in the classroom in which the child may learn how to be a caring member (Garrison, 1997).  The teacher's daily moral decisions, made in the classroom, are \"hands on\" lessons in caring for children (Bronfenbrenner, 1979; Noddings, 1984, 1992).  As children engage in caring interactions with their teacher they may in turn learn to care for their fellow classmates and their teachers. \"The teacher and student interaction can be reciprocally transformative\" (Garrison, 1997, p. 45) renewing the caring teacher's sense of hope and feeling of success in the possibility of creating a community in her classroom (Noddings, 1984).</p><p>  The study of Sidney's classroom was an inquiry into the process of how, what, why and when Sidney made teaching decisions within the context of her caring relationship with the children in her classroom.  Through examining a particular instance (Sidney's classroom), the whole (all classrooms), are illuminated.  This study will present Sidney's caring through an examination of her classroom environment,  \"atmosphere,\" relationships, teacher practice, advocacy, professional development, and teachers and children saying good-bye at the end of the year.</p>",
  "description_provenance": [
    "Author Email: rsnider@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:30Z (GMT). No. of bitstreams: 1 caring.pdf: 633632 bytes, checksum: 5c4fba95ec3c55c95ab633438ee835ec (MD5)   Previous issue date: 2001-02-27"
  ],
  "handle": "26818",
  "identifier_other": "etd-04132001-174625",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132001-174625/",
  "identifier_uri": "http://hdl.handle.net/10919/26818",
  "publisher": "Virginia Tech",
  "relation_haspart": "caring.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "transitions",
    "advocacy",
    "teacher characteristics",
    "touch"
  ],
  "title": "An Inquiry of Caring in the Classroom: A Teacher Story",
  "type": "Dissertation"
}