{
  "contributor_author": "Hughes, Shawn Dorinda",
  "contributor_committeechair": "Lawson, Gerard F.",
  "contributor_committeemember": [
    "Curcio, Claire Cole Vaught",
    "Bodenhorn, Nancy E.",
    "Creamer, Elizabeth G."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:09:31Z",
  "date_adate": "2008-04-28",
  "date_available": "2014-03-14T20:09:31Z",
  "date_issued": "2008-03-17",
  "date_rdate": "2009-04-28",
  "date_sdate": "2008-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Despite much attention given to school counselors and their roles, minimal research has been conducted with regard to parental expectations of school counselors and no research exists in how expectancy theory relates to parental motivation. The primary purpose of this mixed methods study was to explore parental expectations of the secondary school counselorâ  s roles and to gain an understanding of how expectancy theory influences parental motivation. The following questions were researched: What are the attitudes and general beliefs that parents have regarding expectations of school counselors? What do parents expect their children to gain from working with secondary school counselors? How do parentsâ   prior interactions with school counselors impact their expectations? Is there a relationship between parental expectations and what advice/encouragement parents give their children when consulting school counselors?  The first phase consisted of a qualitative exploration of the expectations of secondary school counselors based on focus group interviews with fifteen parents. Qualitative results revealed that parents expect secondary school counselors to know and guide their child. In addition, parents expect their children to gain information and knowledge from their school counselor. Finally, it was determined that there was a relationship between what parents expect and the encouragement and advice parents gave their children about working with school counselors.  Themes that emerged from the focus groups were used in the development of the Parental Expectation School Counselor Questionnaire (PESCQ) and to confirm the focus group findings. The PESCQ was administered to 450 parents of high school students in grades 9-12 at two SW Virginia high schools. The survey did not detect significant findings between demographic variables but did confirm qualitative findings of parental expectations and child gains. Clearly, parents who had expectations expected their children to gain knowledge and information from their school counselors and those parents were motivated to encourage their children to work with their school counselor.  This study contributed to research on expectancy theory and analysis revealed that parents are motivated to work with counselors because they have shared values of wanting what is best for the child. This positive outcome equals a studentsâ   success. This research also provided implications for parents, school counselors, counselor educators, administrators, and school boards. Parents need to get to know their childâ  s school counselor and become informed about their roles and functions. School counselors need to do their best to get to know their students and evaluate how they can motivate their parents to be more involved. Parents and school counselors share values of wanting the student to be successful. Since parents see the school counselor as a key to success and parents want to meet their childâ  s needs this creates a motivation in working with the school counselor.",
  "description_provenance": [
    "Author Email: shughes0203@yahoo.com",
    "Advisor Email: curciocc@msn.com",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: glawson@vt.edu",
    "Advisor Email: creamere@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:31Z (GMT). No. of bitstreams: 1 ShawnDHughesDiss.pdf: 447792 bytes, checksum: af3f201852ab0bbc6b7be00895533839 (MD5)   Previous issue date: 2008-03-17"
  ],
  "handle": "26826",
  "identifier_other": "etd-04132008-173826",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132008-173826/",
  "identifier_uri": "http://hdl.handle.net/10919/26826",
  "publisher": "Virginia Tech",
  "relation_haspart": "ShawnDHughesDiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "school counselors",
    "parental expectations",
    "mixed methods"
  ],
  "title": "Parental Expectations of Secondary School Counselors",
  "type": "Dissertation"
}