{
  "contributor_author": "Charlton, Angela L",
  "contributor_committeechair": "Brott, Pamelia E.",
  "contributor_committeemember": [
    "Hinson, Kenneth E.",
    "Day-Vines, Norma L.",
    "Eller, John F."
  ],
  "contributor_department": "Counselor Education and Supervision",
  "date_accessioned": "2014-03-14T20:09:32Z",
  "date_adate": "2009-05-06",
  "date_available": "2014-03-14T20:09:32Z",
  "date_issued": "2009-03-30",
  "date_rdate": "2009-05-06",
  "date_sdate": "2009-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Bullying is a major issue facing school systems today. It is important to explore the extent to which school counselors feel confident in providing interventions to address bullying. This research study is designed to fill a gap in the current school counseling literature regarding our understanding of school counselorsâ   self-efficacy to address bullying in elementary schools. The following research questions will guide the study: 1. What is the elementary school counselorâ  s perceived self-efficacy for providing bullying interventions in an elementary school setting, as measured by the Counselor Self-Efficacy and Bullying Interventions Scale (CSBI)? 2. What is the elementary school counselorâ  s perceived self-efficacy regarding his or her counseling skills as measured by the Counseling Self-Estimate Inventory (COSE)? 3. To what extent are (a) years of experience in the field, (b) years of training, (c) bullying-intervention training in graduate school, and (d) participation in professional development activities and/or in-services predictive of a counselorâ  s self-efficacy for providing bullying interventions? Responses from 126 elementary school counselors employed at a large suburban school district in the Mid-Atlantic region were used to explore overall counselor self-efficacy and counselor self-efficacy related to bullying interventions. The Counseling Self-Estimate Inventory (COSE; Larson et al., 1992), and Counselor Self-Efficacy and Bullying Interventions Scale(CSBI adapted from King et al., 1999) were the instruments used to answer the research questions. Participants reported a high (M =185) overall self-efficacy as well as a high (M =71.2) selfâ  efficacy for providing bullying interventions. However, only one variable, years of experience, was found to significantly predict efficacy expectations (B = 0.25, p <.01) and outcome values (B = 0.21, p <.05); none of the variables were found to significantly predict outcome expectations (r-squared=0.06, n.s).",
  "description_provenance": [
    "Author Email: ancharlt@vt.edu",
    "Advisor Email: HINSONKE@pwcs.edu",
    "Advisor Email: ndayvine@vt.edu",
    "Advisor Email: pbrott@vt.edu",
    "Advisor Email: jeller@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:32Z (GMT). No. of bitstreams: 1 Charlton_AL_May_2009[1].pdf: 499312 bytes, checksum: ee83c3df7d91f65c901001c2c1fbf929 (MD5)   Previous issue date: 2009-03-30"
  ],
  "handle": "26828",
  "identifier_other": "etd-04132009-102024",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132009-102024/",
  "identifier_uri": "http://hdl.handle.net/10919/26828",
  "publisher": "Virginia Tech",
  "relation_haspart": "Charlton_AL_May_2009[1].pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Bullying Interventions",
    "Elementary School Counselors",
    "Self-Efficacy"
  ],
  "title": "School Counselors' Perceived Self-Efficacy for Addressing Bullying in the Elementary School Setting",
  "type": "Dissertation"
}