{
  "contributor_author": "Autore, Don M.",
  "contributor_committeecochair": [
    "Kumar, Raman",
    "Shome, Dilip K."
  ],
  "contributor_committeemember": [
    "Chance, Donald M.",
    "Kadlec, Gregory B.",
    "Keown, Arthur J."
  ],
  "contributor_department": "Finance, Insurance, and Business Law",
  "date_accessioned": "2014-03-14T20:09:31Z",
  "date_adate": "2006-04-18",
  "date_available": "2014-03-14T20:09:31Z",
  "date_issued": "2006-03-31",
  "date_rdate": "2006-04-18",
  "date_sdate": "2006-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation consists of two essays. The first provides evidence that the recent revival of shelf equity offers is related to changes in how firms use shelf registration. During 1990-2003 firms that make shelf filings have no immediate intent and low probability of issuance, lower pre-filing returns relative to non-shelf issuers, and often have been certified in prior SEOs. The evidence indicates that the way firms now use shelf offerings resolves the under-certification problem responsible for the shelf demise in the 1980s (Denis, 1991) and results in smaller market penalties and lower underwriter fees relative to non-shelf offerings. This allows firms with greater uncertainty to take advantage of the shelf option to defer or abandon offers. Additionally, firms often use universal shelf filings and choose between debt and equity offerings based on the prevailing relative market conditions.  The second essay examines offer price discounting of traditional and shelf-registered seasoned equity offerings (SEOs). The results indicate that relative to traditional SEOs, shelf discounting during 1982 - June 2004 is similar in magnitude, is influenced by the same factors, and has increased similarly over time. Prior studies attribute the time-series increase of seasoned offer discounting to pre-offer short sale constraints (Rule 10b-21; adopted in 1988). This study provides insights about the effect of Rule 10b-21 by exploiting the fact that shelf-registered offerings were exempt from this regulation until September 2004. The analysis uses the shelf exemption as a control in testing the Rule's effect, and the elimination of the exemption as an \"out-of-sample\" test. The results suggest that Rule 10b-21 is not associated with the increase in seasoned offer discounts. The gradual increase in discounting over the past two decades is largely due to a shift in the composition of issuers toward firms that have greater stock volatility and pre-offer price uncertainty.",
  "description_provenance": [
    "Author Email: dautore@vt.edu",
    "Advisor Email: rkumar@vt.edu",
    "Advisor Email: dchance@lsu.edu",
    "Advisor Email: kadlec@vt.edu",
    "Advisor Email: emily@vt.edu",
    "Advisor Email: dilip@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:31Z (GMT). No. of bitstreams: 3 autore_chapter1_etd.pdf: 346016 bytes, checksum: 2f8639d83bcda95338b20a61efe4e75f (MD5) autore_chapter2_vita_etd.pdf: 308291 bytes, checksum: b28fbee345b882810ccbc5941b1697e0 (MD5) autore_frontmatter_etd.pdf: 85989 bytes, checksum: 4d407f1b266d420aff99273a66ef37a3 (MD5)   Previous issue date: 2006-03-31"
  ],
  "handle": "26823",
  "identifier_other": "etd-04132006-112853",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132006-112853/",
  "identifier_uri": "http://hdl.handle.net/10919/26823",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "autore_chapter1_etd.pdf",
    "autore_chapter2_vita_etd.pdf",
    "autore_frontmatter_etd.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "shelf registration",
    "seasoned equity offering",
    "underwriter certification",
    "due diligence",
    "offer price discounting",
    "SEO underpricing"
  ],
  "title": "Two Essays on Shelf-registered Corporate Equity Offerings",
  "type": "Dissertation"
}