{
  "contributor_author": "Karikari, Afia Sarpong",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "McGrath, James E.",
    "Riffle, Judy S.",
    "Ward, Thomas C.",
    "Thatcher, Craig D."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:09:31Z",
  "date_adate": "2006-04-24",
  "date_available": "2014-03-14T20:09:31Z",
  "date_issued": "2006-04-06",
  "date_rdate": "2006-04-24",
  "date_sdate": "2006-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The ring opening polymerization of D,L-lactide (DLLA) using multifunctional hydroxyl-terminated initiators and catalyst/coinitiator systems based on Sn(Oct)2 afforded the preparation of star-shaped, poly(D,L-lactide)s (PDLLA)s of controlled molar mass, narrow molar mass distributions, and well-defined chain end functionality.  Various modifications of star-shaped PDLLA resulted in macromolecules with tailored functionalities for biomedical applications.  Star-shaped PDLLAs were modified to contain photoreactive methacrylate end groups and subsequent photo-crosslinking was performed.  Photo-crosslinked networks based on methacrylated star-shaped PDLLAs exhibited thermal properties and mechanical performance that were superior to current approved clinical adhesives.  In addition, the thermal and mechanical properties of the networks were strongly dependent on the composition and molar mass of the star-shaped PDLLA precursors.  Tensile strengths in the range of 8-21 MPa were obtained while the Youngâ  s modulus increased from 12 to 354 MPa and were higher for networks based on urethane containing polymers.  Star-shaped PDLLAs bearing complementary adenine and thymine terminal units were also prepared.  The hydrogen bonding associations between complementary PDLLA macromolecules depended strongly on molar mass and hence, the concentration of multiple hydrogen bonding units.  1H NMR spectroscopy confirmed the formation of hydrogen-bonded complexes with a 1:1 optimal stoichiometry and an association constant of 84 M-1.  The hydrogen-bonded complexes also exhibited significantly higher solution viscosities than non-blended polymer solutions of similar molar mass and concentration.  Thermoreversible associations of PDLLA-based complementary polymers were observed in the melt phase and the melt viscosity of a blended complex was consistently an order of magnitude higher than non-functionalized star-shaped PDLLA of similar molar mass.  Furthermore, melt electrospinning of the hydrogen-bonded complexes successfully resulted in fibers of significantly larger diameter (9.8 Â± 2.0 Âµm) compared to the individual precursors (PDLLA-A = 4.0 Â± 0.6 Âµm and PDLLA-T = 4.4 Â± 1.0 Âµm).  These results suggested that thermoreversibility, as well as the strength of the hydrogen bonding interactions between the end groups of the tailored star-shaped PDLLA-based supramolecular polymers controlled the fiber diameter in the melt electrospinning process.   Highly ordered microporous honeycomb structures were developed on photo-functional star-shaped PDLLA surfaces.  The pore dimensions were dependent on polymer solution concentration, polymer molar mass and relative humidity.  The combination of self-organizing and cross-linking techniques resulted in free-standing, PDLLA membranes with high chemical stability as well as higher mechanical strength for further material patterning.  Amikacin, an antibiotic commonly used for treating infections was successfully encapsulated in star-shaped PDLLA fibers that were electrospun from solution.  Preliminary results suggested that molecular architecture influenced the encapsulation of the antibiotic and subsequent drug release profile.",
  "description_provenance": [
    "Author Email: akarikar@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: cthatche@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:31Z (GMT). No. of bitstreams: 1 Afia_Karikari_Dissertation_Revised.pdf: 4752998 bytes, checksum: e4828a49f6b5cb55b981e2dee5c80dce (MD5)   Previous issue date: 2006-04-06"
  ],
  "handle": "26824",
  "identifier_other": "etd-04132006-203953",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132006-203953/",
  "identifier_uri": "http://hdl.handle.net/10919/26824",
  "publisher": "Virginia Tech",
  "relation_haspart": "Afia_Karikari_Dissertation_Revised.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "adenine",
    "multiple hydrogen bonding",
    "ring opening polymerization",
    "bioadhesives",
    "lactide",
    "star-shaped polymers",
    "polyester",
    "breath figures",
    "thymine",
    "electrospinning"
  ],
  "title": "Synthesis and Characterization of Functional Biodegradable Polyesters",
  "type": "Dissertation"
}