{
  "contributor_author": "Nyirongo, Nertha Kate",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:32Z",
  "date_adate": "2009-05-01",
  "date_available": "2014-03-14T20:09:32Z",
  "date_issued": "2009-03-30",
  "date_rdate": "2009-05-01",
  "date_sdate": "2009-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "New electronic technologies like computers and the Internet continue to spread to all parts of the world. Developing nations like Malawi have experienced this thrust in the area of electronic technologies. Mzuzu University, a relatively new university in the Malawian education system has made tremendous efforts in providing computers and the internet to faculty members of the University. It was however not clear if such efforts had resulted in corresponding application and integration of the technologies in teaching and learning. This study ventured to investigate prevailing levels of utilization of the computer technology and the Internet in teaching and learning at the university and uncover factors that facilitate or hinder use and integration of the technologies in teaching and learning. Results of the study revealed that while most faculty members actively engaged with electronic technologies, such engagements often excluded instructional use. Where electronic technologies have been used for instructional purposes, it has been mainly for accessing information for teaching. Factors that affect utilization and integration of electronic technologies comprise limited availability of the technologies; unreliability of the available technologies due to related issues like power outages and poor reception; lack of training; lack of technical, pedagogical and administrative support; and lack of faculty involvement in decision making relating to electronic technologies.",
  "description_provenance": [
    "Author Email: nnyirong@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:32Z (GMT). No. of bitstreams: 1 Nertha_etd_2009.pdf: 556812 bytes, checksum: c40cd927cf112bcf00c4ceb7da04e8b4 (MD5)   Previous issue date: 2009-03-30"
  ],
  "handle": "26827",
  "identifier_other": "etd-04132009-095508",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132009-095508/",
  "identifier_uri": "http://hdl.handle.net/10919/26827",
  "publisher": "Virginia Tech",
  "relation_haspart": "Nertha_etd_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Diffusion and adoption of innovations.",
    "Instructional technology",
    "electronic technologies for teaching and learning",
    "Adoption and Integration of electronic technologie"
  ],
  "title": "Technology Adoption and Integration: A Descriptive Study of a Higher Education Institution in a Developing Nation",
  "type": "Dissertation"
}