{
  "contributor_author": "Sheers, Kelly L",
  "contributor_committeechair": "Eller, John F.",
  "contributor_committeemember": [
    "Bolin, Paul",
    "Tripp, Norman Wayne",
    "Glenn, William J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:32Z",
  "date_adate": "2010-04-29",
  "date_available": "2014-03-14T20:09:32Z",
  "date_issued": "2010-03-17",
  "date_rdate": "2010-04-29",
  "date_sdate": "2010-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Researchers have found that schools that support a studentsâ   sense of community (SOC) positively affect studentsâ   academic achievement, behavior, motivation, and social and emotional competencies (Bryk & Driscoll, 1995; Schaps, 2003; Schaps, Battistich & Solomon, 1997; Goodenow & Grady, 1993; Ladd, 1990; Resnick & Bearman, 1997; Wentzel, 1997). The purpose of this study is to explore, analyze, and describe characteristics of an elementary school that reports a high sense of community among students and to describe adult perceptions on the schoolâ  s program, activities, and practices that are in place to contribute to the SOC. Schools that provide a high SOC appear to have certain collective key characteristics that have been identified in the research literature: respect, trust, and kindness; a sense of belonging; caring; regular contact; shared governance; and order and discipline among the students of the school. The following overall research questions focus this study: 1.\tHow does an elementary school identified as having a strong SOC support its studentsâ   sense of community? 2.\tWhat are the administrator, teacher, and parent perceptions of why the students have a SOC within the selected elementary school?  3.\tWhat evidence is there that these six key characteristics (respect, trust, and kindness; a sense of belonging; caring; regular contact; shared governance; and order and discipline) are present within the selected elementary school? 4.\tWhat similarities and differences are seen between the perceptions of teachers, administrators, and parents regarding these key characteristics (respect, trust, and kindness; a sense of belonging; caring; regular contact; shared governance; and order and discipline) within the selected elementary school? A mixed methods approach was used. The study used surveys, interviews, observations, and document analysis to investigate administrator, teacher, and parent perceptions of the studentsâ   SOC at the selected school. The researcher identified and examined distinct characteristics that can assist schools in supporting a studentâ  s SOC. The study describes a school program and identifies key activities and practices of a school that reports a strong SOC among students.",
  "description_provenance": [
    "Author Email: klsheers@fcps.edu",
    "Advisor Email: jeller@vt.edu",
    "Advisor Email: pebolin@mail.utexas.edu",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: wglenn@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:32Z (GMT). No. of bitstreams: 1 Sheers_KellyS_D_2010.pdf: 1001262 bytes, checksum: 3cec0b88b96de236784846089b16cf07 (MD5)   Previous issue date: 2010-03-17"
  ],
  "handle": "26832",
  "identifier_other": "etd-04132010-192705",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132010-192705/",
  "identifier_uri": "http://hdl.handle.net/10919/26832",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sheers_KellyS_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "climate",
    "caring",
    "teacher student relationship",
    "belonging",
    "elementary school",
    "students",
    "sense of community"
  ],
  "title": "ADMINISTRATOR, TEACHER AND PARENT PERCEPTIONS OF STUDENTSâ   SENSE OF COMMUNITY IN ONE ELEMENTARY SCHOOL",
  "type": "Dissertation"
}