{
  "contributor_author": "Johnson, Patrick Matthew",
  "contributor_committeecochair": [
    "Salmon, Richard G.",
    "Elitharp-Martin, Toni Marie"
  ],
  "contributor_committeemember": [
    "Niles, Jerome A.",
    "Burton, John K."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:33Z",
  "date_adate": "2010-05-07",
  "date_available": "2014-03-14T20:09:33Z",
  "date_issued": "2010-04-02",
  "date_rdate": "2010-05-07",
  "date_sdate": "2010-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This paper presents findings from a study designed to identify skills and strategies students with visual impairments have developed to aid their social integration into higher education campus life.  Attending college provides numerous learning opportunities outside the classroom.  The study explores the process by which students at two universities in the Commonwealth of Virginia were able to identify, navigate, and participate in extra-curricular activities.  Previous research by Roy & MacKay (2002) and Hodges & Keller (1999) provides a quantitative framework from which a qualitative tapestry was woven.  A secondary purpose of the study was to verify the validity of Roy & MacKayâ  s finding that the age that individuals first experience visual disability and the visibility of their visual impairment (the variance in their ability to appear sighted) are valid predictors of social integration of visually impaired students among college students.  This study is important for several reasons, including, (a) to help develop a more inclusive campus environment, (b) to identify factors that have influenced the selection of post-secondary educational experiences by visually-impaired students, and (c) to give a voice to visually impaired students to help administrators understand their needs and desires (Henderson, 2001).",
  "description_provenance": [
    "Author Email: pajohns1@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: telitharp@pcva.us",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: burton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:33Z (GMT). No. of bitstreams: 1 Johnson_PM_D_2010.pdf: 1390661 bytes, checksum: 76e454753f68f228a8dfaf1a22d42270 (MD5)   Previous issue date: 2010-04-02"
  ],
  "handle": "26834",
  "identifier_other": "etd-04132010-225216",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132010-225216/",
  "identifier_uri": "http://hdl.handle.net/10919/26834",
  "publisher": "Virginia Tech",
  "relation_haspart": "Johnson_PM_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "social integration",
    "social accessibility",
    "college students",
    "visually impaired",
    "blindness"
  ],
  "title": "Social Accessibility for Students with Visual-Impairments: A Mixed-Methodological Study of Current Students at a Land-Grant and Regionally-Known University in Western Virginia",
  "type": "Dissertation"
}