{
  "contributor_author": "Spruill, Nicklaus R.",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeemember": [
    "Janosik, Steven M.",
    "Mo, Yun",
    "Singh, Kusum"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:34Z",
  "date_adate": "2011-06-01",
  "date_available": "2014-03-14T20:09:34Z",
  "date_issued": "2011-03-31",
  "date_rdate": "2011-06-01",
  "date_sdate": "2011-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Post-secondary academic achievement in the United States has shifted dramatically over the past 30 years in terms of gender; men are underrepresented within the ivory tower (Postsecondary participation rates by sex and race/ethnicity: 1974 - 2003 , 2005). When the intersection of race and gender is examined, enrollment gaps widen even further. Sixty-five percent of Black college enrollment is comprised of female students while Black men make up only 35%. In comparison, Asian college women outnumber Asian college men 54% to 46%, White women outnumber White men 56% to 44%, and Hispanic/Latina women outnumber Hispanic/Latino men 59% to 41% (Chronicle of Higher Education Almanac, 2009). College enrollment patterns are inextricably linked to academic success (i.e., GPA, degree attainment). Currently, more opportunities are available for African Americans and Hispanics to attend college than ever before; however, GPA and the rate of attainment of a Bachelor of Arts degree are significantly lower for African American and Hispanic men when compared to other ethnic/gender combinations (Carter, 2001; Perna, 2000; Porter, 2006; Strayhorn, 2006). \tThe purpose of this study was to determine what factors predict post-secondary education academic success of male students. Academic success was defined as college GPA and degree attainment. I employed a modified version of the Bandura, et al. (1996) theoretical model that identified four factors that influence self efficacy, hence academic success: SES, familial, peer, and self. In my study, I used SES as a control variable and also controlled for high school preparation, two factors that prior research has revealed influence college GPA and degree attainment (Clark, Lee, Goodman, & Yacco, 2008; Perna, 2000). \tThe findings suggest that race and select parental and peer factors can have both negative and positive effects on the academic achievement and persistence of male students in college. One parental and one peer factor were significantly positively associated with success. The remaining factors were significantly, but negatively associated with academic success.",
  "description_provenance": [
    "Author Email: sprunr02@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: yunm@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:34Z (GMT). No. of bitstreams: 2 Spruill_NR_D_2011.pdf: 1060145 bytes, checksum: 551457ac7cb24536f50af3383ecf73eb (MD5) Spruill_NR_D_2011_IRB.pdf: 247364 bytes, checksum: b4085894aff9b9dcaaf1b8786d5d7245 (MD5)   Previous issue date: 2011-03-31"
  ],
  "handle": "26839",
  "identifier_other": "etd-04132011-184420",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132011-184420/",
  "identifier_uri": "http://hdl.handle.net/10919/26839",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Spruill_NR_D_2011.pdf",
    "Spruill_NR_D_2011_IRB.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "SES",
    "Self- Efficacy",
    "Race/Ethnicity",
    "Academic Achievement",
    "Academic Persistence and Men",
    "Family"
  ],
  "title": "Predicting Academic Achievement of Male College Students",
  "type": "Dissertation"
}