{
  "contributor_author": "McCarty, Ann M",
  "contributor_committeechair": "Glenn, William J.",
  "contributor_committeemember": [
    "Brott, Pamelia E.",
    "Twiford, Travis W.",
    "Berlin, Lois"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:33Z",
  "date_adate": "2010-05-05",
  "date_available": "2014-03-14T20:09:33Z",
  "date_issued": "2010-04-02",
  "date_rdate": "2010-05-05",
  "date_sdate": "2010-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "In the 1980s and 1990s, publications like A Nation at Risk and Prisoners of Time were highly critical of the American public school system.  In response, school administrators reviewed their master schedules to evaluate how time was scheduled and the majority of them chose block scheduling to secure longer, uninterrupted periods of instructional time.  Upon implementing block scheduling, schools noted a need for a change in pedagogy.  Constructivist teaching, shown to be effective with multiple ages, has become a preferred pedagogy for elementary and middle school teachers during a block period.  The review of literature includes a description of the forces behind block scheduling and provides a background of constructivist theory and teaching practices based on the writings of Jean Piaget and Lev Vygotsky.  Combining constructivist teaching with block scheduling creates an environment conducive to young adolescent learning; however, properly preparing teachers through professional development is key to effective implementation.  The purpose of this action research study was to facilitate the professional growth of new teachers by providing job embedded professional development opportunities that were grounded in constructivist practices and demonstrated to be effective with young adolescent learners while teaching in a block period.",
  "description_provenance": [
    "Author Email: annmariemccarty@gmail.com",
    "Advisor Email: wglenn@vt.edu",
    "Advisor Email: pbrott@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:33Z (GMT). No. of bitstreams: 1 McCarty_AM_D_2010.pdf: 1274497 bytes, checksum: 7ec0b241d6b3e2e23741036efc1dd11d (MD5)   Previous issue date: 2010-04-02"
  ],
  "handle": "26833",
  "identifier_other": "etd-04132010-193542",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132010-193542/",
  "identifier_uri": "http://hdl.handle.net/10919/26833",
  "publisher": "Virginia Tech",
  "relation_haspart": "McCarty_AM_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "and Professional Development",
    "Constructivism",
    "Block Scheduling"
  ],
  "title": "Professional Development for New Middle School Teachers to Use Constructivist Pedagogy in the Block Period",
  "type": "Dissertation"
}