{
  "contributor_author": "Fay, Rebecca G",
  "contributor_committeechair": "Jenkins, James Gregory",
  "contributor_committeemember": [
    "Bhattacharjee, Sudip",
    "Brozovsky, John A.",
    "Foti, Roseanne J.",
    "Popova, Velina K."
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:09:33Z",
  "date_adate": "2011-04-26",
  "date_available": "2014-03-14T20:09:33Z",
  "date_issued": "2011-03-28",
  "date_rdate": "2011-04-26",
  "date_sdate": "2011-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study considers the ability of the audit team to configurally process information, that is, to piece together information cues held by individual team members and recognize the underlying pattern in the information. It also examines how the hierarchical structure of the audit team impacts the teamâ  s ability to process information and affects the quality of decisions made by the team. The study also considers the ability of a specific audit procedure, the fraud brainstorming session required by Statement on Auditing Standards No. 99, to overcome barriers to communication and improve team judgments in subsequent tasks. I recruited 57 dyads (114 professional auditors) from public accounting firms to complete an experimental instrument, and employed a 2x2 between-groups ANOVA, manipulating team structure (peer versus hierarchical teams) and the level of the counterfactual prime (team brainstorming session versus individual strategic prompting).<p> I find evidence of a relationship between team structure and judgment quality, but interestingly it is in the opposite direction predicted. Research from other domains suggests differences in status within the hierarchical team may hinder communication and lead to process losses. However, I find the opposite to be true in the accounting domain. When auditors are paired in hierarchical dyads, the senior auditor assumes a leadership role, taking greater interest in the content of his/her teammateâ  s workpapers, asking more questions, and motivating the staff auditor to volunteer a greater amount of information, which results in a higher quality judgment. Thus, this study provides initial evidence that the hierarchical nature of the audit team does not lead to the process losses documented in other domains as the assumption of a leadership role by the senior auditor allows the team to overcome any challenges inherent in the hierarchical structure. <p> This study also considers the ability of the SAS 99 fraud brainstorming session, serving as a counterfactual prime, to lead to improved decisions later in the audit process. As predicted, the brainstorming session conducted during the planning stage of the audit increases the amount and quality of communication during the testing phase and leads to better judgments. These results are of importance for accounting firms as they determine which audit team members are required to participate in the brainstorming session. While a novice auditor may not make significant contributions to the planning decisions made during the brainstorming session, my study finds there are benefits from staff auditors participating in the brainstorming session, over and above what they are able to contribute to the session itself. Participation of staff auditors in the brainstorming session strengthens communication and enhances team-level cognition in subsequent tasks, improving the ability of the audit team to detect fraud throughout the course of the audit. These findings may be relevant for other forms of teamwork, including management teams, audit committees, and interdepartmental taskforces.",
  "description_provenance": [
    "Author Email: rgfay@vt.edu",
    "Advisor Email: greg.jenkins@vt.edu",
    "Advisor Email: sudipb@vt.edu",
    "Advisor Email: jbrozovs@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: velina@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:33Z (GMT). No. of bitstreams: 1 Fay_RG_D_2011.pdf: 2154099 bytes, checksum: 925ca6fac3875c418c4cd70e8c606b20 (MD5)   Previous issue date: 2011-03-28"
  ],
  "handle": "26836",
  "identifier_other": "etd-04132011-130243",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132011-130243/",
  "identifier_uri": "http://hdl.handle.net/10919/26836",
  "publisher": "Virginia Tech",
  "relation_haspart": "Fay_RG_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Brainstorming",
    "Audit Effectiveness",
    "Cascade Effect",
    "Audit Team",
    "Configural Processing"
  ],
  "title": "Facilitating Configural Processing Within the Audit Team: An Additional Benefit of the SAS 99 Fraud Brainstorming Session",
  "type": "Dissertation"
}