{
  "contributor_author": "Lee, William",
  "contributor_committeecochair": [
    "Smith-Jackson, Tonya L.",
    "Winchester, Woodrow W. III"
  ],
  "contributor_committeemember": [
    "Quek, Francis K. H.",
    "Hudlicka, Eva",
    "Kleiner, Brian M."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:32Z",
  "date_adate": "2009-05-11",
  "date_available": "2014-03-14T20:09:32Z",
  "date_issued": "2009-03-27",
  "date_rdate": "2009-05-11",
  "date_sdate": "2009-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objective of this exploratory research was to investigate the interplay among emotion, risk perception, and situation awareness as potential risk factors within the health care domain. To accomplish this objective, a two-phase study approach was employed. In Phase I, a proof-of-concept testbed of the emotional interface concept, namely Wearable Avatar Risk Display (WARD), was tested as the primary communication medium to explore participants' emotional responses and risk choices under the influence of the validated International Affective Picture System (IAPS). Based on the lessons learned, a limited prototype of WARD was further refined and then implemented in a formative evaluation. The formative evaluation employed two medical students from the Edward Via Virginia College of Osteopathic Medicine (VCOM) to investigate their emotional response, risk perception, and situation awareness using the MicroSim InHospital under the influence of the validated film-based Mood Induction Procedures (MIPs). In Phase II, 32 new medical students from VCOM participated in 2 (intervention) x 2 (film) between-subjects study for addressing three research questions. Both quantitative and qualitative data were collected and analyzed. Results from Phase I indicated the need for MIPs, as well as shed light on the feasibility of employing anthropomorphic computer characters as intervention devices.  Participants found anthropomorphic computer characters to be meaningful as virtual assistants in a team environment. The Facial Expression Coding System also indicated that participants experienced high levels of happiness/amusement when a happy and credible anthropomorphic computer character was introduced under angry emotional induction via MIPs. Physiological states results confirmed that participants' heart rate variability was affected significantly after the use of anthropomorphic computer characters, verifying that their utilization was potentially effective.  The lessons I learned from the Phase I results led me to refine procedures and training/evaluation techniques, and to introduce anthropomorphic computer characters with minimal intrusiveness during the Phase II study. Findings from Phase II showed that one particular medical item, wiping contaminated spills, was found to be influenced by induced anger.  Moreover, mixed support for using anthropomorphic computer characters and text interventions was also found for the medical and general risk perception ratings under induced anger.  Sub-constructs within 3-D SART correlated with emotional responses and anthropomorphic computer character intervention. Two additional items, supply of attention and complexity of the situation, were also found to be influenced by anthropomorphic computer character intervention.  Content analysis using the Word-Frequency List method resulted in positive responses for both anthropomorphic computer character and text interventions. Using Two-sample t tests, text based interventions led to a higher level of subjective happiness as measured by PANAS-X.  Multiple regressions were also conducted and resulted in six equations for predicting the influence of emotion on situation awareness and medical based risk perception.",
  "description_provenance": [
    "Author Email: wilee@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: quek@cs.vt.edu",
    "Advisor Email: wwwinche@vt.edu",
    "Advisor Email: hudlicka@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:32Z (GMT). No. of bitstreams: 9 General_RP_WL_permission.pdf: 4597906 bytes, checksum: 6b097c8825621a228e0748700a78fb94 (MD5) PANASX_WL_permission.pdf: 4086525 bytes, checksum: d6b54750a85f4ad5c06ef193ce1dc2d5 (MD5) CDC_UPs_WL_permission.pdf: 65120 bytes, checksum: 4ef1b6dda2d3bd540c49d48f929916ca (MD5) 3D_SART_WL_permission.pdf: 6696511 bytes, checksum: f0de6446e0ac0c7c04c8d8bd40c48455 (MD5) BeckDepressionInventory_II_WL_permission.pdf: 37540 bytes, checksum: dc76c7ae04960d817894dc9f5bcf83a2 (MD5) Endsley_diagram_WL_permission.pdf: 4181838 bytes, checksum: 75820ba1fac92479f35f40da8b03a311 (MD5) Slovic_diagram_WL_permission.pdf: 88258 bytes, checksum: 18577c4fffda110e0abf3694994be2ed (MD5) AffectBalanceScale_WL_permission.pdf: 24923 bytes, checksum: 47e6c8616b6354924239df8a2b1d483a (MD5) ISE_Final_Document-WL-ETD-submitted.pdf: 4335174 bytes, checksum: 70a699fd8d026f87dc2fdeb6398a960d (MD5)   Previous issue date: 2009-03-27"
  ],
  "handle": "26830",
  "identifier_other": "etd-04132009-150141",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132009-150141/",
  "identifier_uri": "http://hdl.handle.net/10919/26830",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "General_RP_WL_permission.pdf",
    "PANASX_WL_permission.pdf",
    "CDC_UPs_WL_permission.pdf",
    "3D_SART_WL_permission.pdf",
    "BeckDepressionInventory_II_WL_permission.pdf",
    "Endsley_diagram_WL_permission.pdf",
    "Slovic_diagram_WL_permission.pdf",
    "AffectBalanceScale_WL_permission.pdf",
    "ISE_Final_Document-WL-ETD-submitted.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Situation Awareness",
    "Emotion",
    "Health Care",
    "Human-Computer Interaction",
    "Anthropomorphic Computer Character",
    "Risk Perception",
    "Decision Making"
  ],
  "title": "The Influence of Emotion on the Risk Perception and Situation Awareness of Clinicians",
  "type": "Dissertation"
}