{
  "contributor_author": "Woods, Daniel  Richard",
  "contributor_committeecochair": [
    "Barksdale, Mary Alice",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_committeemember": [
    "Kajder, Sara B.",
    "Williams, Robert H."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:32Z",
  "date_adate": "2010-04-30",
  "date_available": "2014-03-14T20:09:32Z",
  "date_issued": "2010-03-31",
  "date_rdate": "2010-04-30",
  "date_sdate": "2010-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In a time of high stakes tests and mounting pressures in favor of standardized curricula at all levels, teachers continue to work in the best interests of their students as is evidenced by their statements both public and private, their continued commitment to their profession, and their political actions.  Indeed, many advocate loudly and repeatedly for their students and for maximal opportunities for those same students.  Without doubt, many of these teachers aspire to help learners of all ages and from all sociocultural strata develop into not only critical readers, consumers, and even critical civic participants, but into citizens with active critical consciences and a lively critical consciousness of their own culture and the cultures of others.   In this study, the author observed and interviewed two middle school teachers and two high school teachersâ  all English teachersâ  for purposes of examining the participantsâ   teaching practice for identifiable acts and statements involving the promotion of critical literacy among learners in the teachersâ   classrooms.  The observations and interviews were conducted across a contiguous three-day period for each participant during the same class period each day.  Participants self-selected dates and class period, and also were aware of the purpose of the study, i.e. to look for critical literacy practices in teaching.  All observations and interviews were coded inductively and used Strauss and Corbinâ  s (1998) three-step coding process for grounded theory of open, axial, and selective coding.     Teachersâ   observed actions and statements were subsequently analyzed in a constant comparative analysis.",
  "description_provenance": [
    "Author Email: drwoods@vt.edu",
    "Advisor Email: mbarksda@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: skajder@vt.edu",
    "Advisor Email: rohwilli@radford.edu",
    "Made available in DSpace on 2014-03-14T20:09:32Z (GMT). No. of bitstreams: 1 Woods_DR_D_2010.pdf: 623521 bytes, checksum: 8d95e6ebfdd9fd0fdb4dd7fdc988fa44 (MD5)   Previous issue date: 2010-03-31"
  ],
  "handle": "26831",
  "identifier_other": "etd-04132010-150011",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132010-150011/",
  "identifier_uri": "http://hdl.handle.net/10919/26831",
  "publisher": "Virginia Tech",
  "relation_haspart": "Woods_DR_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "English Instruction",
    "Teaching Methods",
    "Secondary Education.",
    "teacher education",
    "critical literacy practitioners",
    "Critical literacy",
    "Literacy",
    "Critical Theory"
  ],
  "title": "Class Conscious or Conscience Class: The Pedagogical Choices Teachers Make as Critical Literacy Practitioners",
  "type": "Dissertation"
}