{
  "contributor_author": "Stewart, Kelley Christine",
  "contributor_committeechair": "Vlachos, Pavlos P.",
  "contributor_committeemember": [
    "Staples, Anne E.",
    "Paul, Mark R.",
    "Little, William C.",
    "Jung, Sunghwan",
    "Ball, Kenneth S."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:09:33Z",
  "date_adate": "2011-04-29",
  "date_available": "2014-03-14T20:09:33Z",
  "date_issued": "2011-03-30",
  "date_rdate": "2011-04-29",
  "date_sdate": "2011-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Left ventricular diastole (filling) is a complex process with many features and coupled compensatory mechanisms which coordinate to maintain optimal filling and ejection of the left ventricle.  Diastolic filling is controlled by the left ventricular recoil, relaxation, and compliance as well as atrial and ventricular pressures making left ventricular diastolic dysfunction very difficult to understand and diagnose.  An improved understanding of these unique flows is important to both the fundamental mechanics of the cardiac diastolic filling as well as the development of novel and accurate diagnostic techniques.   This work includes studies of in-vivo and in-vitro vortex rings.  Vortex rings created in the left ventricle past the mitral valve during diastole are produced in a confined domain and are influenced by the left ventricular walls.  Therefore, an in-vitro analysis of the formation and decay of vortex rings within confined cylindrical domains using particle image velocimetry was conducted.  Varying mechanisms of vortex ring breakdown were observed over a wide range of Reynolds numbers, and an analytical model for vortex ring circulation decay of laminar vortex rings was developed. Also, in this work a novel method for analyzing color M-mode echocardiography data using a newly developed automated algorithm is introduced which examines the pressure gradients and velocities within the left ventricle.  From this analysis, a new diagnostic filling parameter is introduced which displays a greater probability of detection of diastolic dysfunction over the conventionally used diagnostic parameter.",
  "description_provenance": [
    "Author Email: kelleys@vt.edu",
    "Advisor Email: aestaples@vt.edu",
    "Advisor Email: mrp@vt.edu",
    "Advisor Email: wlittle@wfubmc.edu",
    "Advisor Email: sunnyjsh@vt.edu",
    "Advisor Email: ball@vt.edu",
    "Advisor Email: pvlachos@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:33Z (GMT). No. of bitstreams: 1 Stewart_KC_D_2011.pdf: 14101382 bytes, checksum: bd2d3436abd6901d352b54e1b2b6417b (MD5)   Previous issue date: 2011-03-30"
  ],
  "handle": "26837",
  "identifier_other": "etd-04132011-170815",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132011-170815/",
  "identifier_uri": "http://hdl.handle.net/10919/26837",
  "publisher": "Virginia Tech",
  "relation_haspart": "Stewart_KC_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "heart failure",
    "echocardiography",
    "diastole",
    "vortex rings"
  ],
  "title": "Hydrodynamics of Cardiac Diastole",
  "type": "Dissertation"
}