{
  "contributor_author": "Avdellas, Nicholas John",
  "contributor_committeechair": "Kronenberg, Philip S.",
  "contributor_committeemember": [
    "Badawy, Michael K.",
    "Rees, Joseph V.",
    "Dudley, Larkin S.",
    "Colvard, James E."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:09:35Z",
  "date_adate": "2005-04-20",
  "date_available": "2014-03-14T20:09:35Z",
  "date_issued": "2005-04-11",
  "date_rdate": "2005-04-20",
  "date_sdate": "2005-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Since the end of the Cold War, the Department of Defense (DoD) has been challenged to formulate and make strategic decisions, especially in areas related to the Departmentâ  s â  business operations.â   Strategic decisions are those that focus on setting long-term organizational direction. This has proven difficult because a rather simplistic (and somewhat comforting) DoD organizational orientation toward an â  either/orâ   or â  us versus themâ   decision-making mindset that was once ubiquitous and appropriate, given the nature of political and military threats, has been hard to shake.  This study reviews a particular manifestation of this dilemma: the decision-making arrangements associated with the provision of military depot maintenance services. An historical review of this topic shows a mixture of problems, progress, and promise. A strategic decision-making approach that draws upon Sabatier and Jenkins-Smithâ  s Advocacy Coalition Framework (ACF) is proposed to improve the situation. It addresses key problems identified in the analysis and rests upon an approach to strategic decision making that is politically rational in nature. This approach, called a Strategic Improvement Agenda, is offered as a potential foil to the â  us versus themâ   orientation.",
  "description_provenance": [
    "Author Email: navdellas@lmi.org",
    "Advisor Email: mbadawy@vt.edu",
    "Advisor Email: philkvt@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: jcolvard@crosslink.net",
    "Made available in DSpace on 2014-03-14T20:09:35Z (GMT). No. of bitstreams: 2 02-NICK_apps_FINAL_04_19_05.pdf: 702376 bytes, checksum: 7b647bd51e5895889b6004c457df3b62 (MD5) 01-NICK_chaps_FINAL_04_19_05.pdf: 1062057 bytes, checksum: 0c711b682fbf9b9012d1a891503f406a (MD5)   Previous issue date: 2005-04-11"
  ],
  "handle": "26847",
  "identifier_other": "etd-04142005-085818",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142005-085818/",
  "identifier_uri": "http://hdl.handle.net/10919/26847",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "02-NICK_apps_FINAL_04_19_05.pdf",
    "01-NICK_chaps_FINAL_04_19_05.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "public and private sector roles",
    "advocacy coalitions",
    "depot maintenance",
    "strategic decision making"
  ],
  "title": "The Public-Private Dilemma: A Strategic Improvement Agenda for U.S. Department of Defense Depot Maintenance",
  "type": "Dissertation"
}