{
  "contributor_author": "Howard, Michael D.",
  "contributor_committeechair": "Inzana, Thomas J.",
  "contributor_committeemember": [
    "Gregory, Eugene M.",
    "Buechner-Maxwell, Virginia A.",
    "Schurig, Gerhardt G.",
    "Toth, Thomas E."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:09:35Z",
  "date_adate": "2005-04-20",
  "date_available": "2014-03-14T20:09:35Z",
  "date_issued": "2005-04-05",
  "date_rdate": "2005-04-20",
  "date_sdate": "2005-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Virulent strains of the bovine opportunistic pathogen Haemophilus somnus (Histophilus somni) cause multi-systemic diseases in cattle. One of the reported virulence factors that H. somnus may use to persist in the host is resistance to intracellular killing. It is reported in this dissertation that H. somnus significantly (P <0.001) inhibited production of superoxide anion (O2-) by bovine mammary and alveolar macrophages as well as by polymorphonuclear leukocytes. Inhibition of O2- production was time- and dose-dependent and did not occur after incubation with Escherichia coli, H. influenzae, or Brucella abortus. Non-viable H. somnus, purified lipooligosaccharide (LOS), or cell-free supernatant from mid-log phase cultures did not inhibit O2- production, indicating that O2- inhibition required contact with live H. somnus. Commensal isolates of H. somnus were less capable or incapable of inhibiting macrophage O2- production compared to isolates tested from disease sites. H. somnus shares conserved epitopes in its LOS with Neisseria gonorrhoeae, N. meningitidis, and H. influenzae, and can also undergo structural phase variation of these LOS epitopes. Sialylation of the terminal galactose of H. somnus LOS is another reported virulence mechanism. Current sequencing of the genomes of H. somnus strains 2336 (pathogenic) and 129Pt (commensal) has enabled in silico identification of three open reading frames (ORFs) involved in sialylation. The ORFs-1 (hsst-I) and -2 (hsst-II) had BLASTx homology to sialyltransferases, while ORF-3 (neuAhs) had BLASTx homology to CMP-sialic acid synthetases. These ORFs were amplified by PCR and cloned into the expression vector pCWOri+. Thin layer chromatography of the hsst-I gene product showed this sialyltransferase exhibited preference for sialylation of terminal N-acetyllactosamine (LacNAc, beta-Gal-[1,4]-beta-GlcNAc-R). However, Hsst-II preferentially sialylated lacto-N-biose (LNB, beta-Gal-[1,3]-beta-GlcNAc-R). In this study, phase variation of the terminal linkage in isolate 738 from a 3 linked galactose (LNB) to a 4 linked galactose (LacNac) was demonstrated. Such variation of a glycose linkage appears to be a novel mechanism of LOS phase variation. Furthermore, the ability of sialylated strain 738 LOS vs de-sialylated strain 738 LOS to induce Toll-like receptor 4 signaling was decreased by 28%, as determined by ELISA for Macrophage Inflammatory Protein-2. Therefore, sialylated LOS may aid H. somnus to avoid host innate immunity.",
  "description_provenance": [
    "Author Email: mhoward@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Advisor Email: bmax@vt.edu",
    "Advisor Email: tinzana@vt.edu",
    "Advisor Email: cvmdean@vt.edu",
    "Advisor Email: ttoth@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:35Z (GMT). No. of bitstreams: 1 ETD_MHoward.pdf: 3279048 bytes, checksum: fdf5c5e62987eb11af45e9459beeb8fc (MD5)   Previous issue date: 2005-04-05"
  ],
  "handle": "26848",
  "identifier_other": "etd-04142005-223651",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142005-223651/",
  "identifier_uri": "http://hdl.handle.net/10919/26848",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD_MHoward.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Histophilus somni",
    "Haemophilus somnus",
    "sialic acid",
    "sialylation",
    "microbial immunity",
    "virulence factors",
    "superoxide anion"
  ],
  "title": "Investigation of Haemophilus somnus Virulence Factors: Lipooligosaccharide Sialylation and Inhibition of Superoxide Anion Production",
  "type": "Dissertation"
}