{
  "contributor_author": "Tate, Anthony Scott",
  "contributor_committeechair": "Stephenson, Max O. Jr.",
  "contributor_committeemember": [
    "Leonard, Robert G.",
    "Provo, John",
    "Fine, Elizabeth C."
  ],
  "contributor_department": "Alliance for Social, Political, Ethical, and Cultural Thought",
  "date_accessioned": "2014-03-14T20:09:34Z",
  "date_adate": "2012-05-02",
  "date_available": "2014-03-14T20:09:34Z",
  "date_issued": "2012-03-30",
  "date_rdate": "2012-05-02",
  "date_sdate": "2012-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this ethnographic case study was to explore the construction and alteration of Roanoke Virginiaâ  s cultural imaginary, as well as the engagement of marginal groups and their concerns in those processes.  This research examined these issues through the experiences of key actors involved with the creation of Roanokeâ  s first city-wide arts and cultural plan and the creation and growth of the Roanoke-based Marginal Arts Festival (MAF).  Cities around the globe are increasingly engaged in transnational projects of place identification, reconfiguration, and attraction:  attracting capital, residents, workers, tourists and attention (Cronin & Hetherington, 2008; Hague, 2005; Jensen, 2005, 2007; Pine & Gilmore, 1999; Zukin 1995).  Moreover, cities undertake various kinds of identity projects: on-going, dynamic processes through which spaces are produced and reproduced by conscious strategies of place making and identity building (Nyseth & Viken, 2009). Such initiatives are concerted efforts to establish or extend a particular idea, or imaginary, of a city. This study focused on one kind of urban identity endeavor that has become widespread during the past two decades: the effort to shape and market a creative, culture-rich place, to project a specific urban cultural imaginary.    This analysis also responded to a straightforward problem, that of the manner through which people, in places pursuing arts and culture as a primary focus for development, come to terms with differing understandings of art and its role in development.  This study identified four principal future paths for the analysis of cultural imaginaries and the practice of cultural development: studying and supporting civic tinkering activities, recognizing the relevance of localized imaginaries and urban identity projects, valuing full participation in the project of the city, and conducting place-specific and critical analyses.",
  "description_provenance": [
    "Author Email: atate1@vt.edu",
    "Advisor Email: rhleonar@vt.edu",
    "Advisor Email: jprovo@vt.edu",
    "Advisor Email: bfine@vt.edu",
    "Advisor Email: mstephen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:34Z (GMT). No. of bitstreams: 2 Tate_AnthonyS_D_2012.pdf: 1321793 bytes, checksum: ba40d1611113cc072f2b1e6355c2fd02 (MD5) Tate_AnthonyS_D_2012_Copyright.pdf: 131128 bytes, checksum: 4e0dbcfa599995f218231a26211ebf11 (MD5)   Previous issue date: 2012-03-30"
  ],
  "handle": "26841",
  "identifier_other": "etd-04132012-140503",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132012-140503/",
  "identifier_uri": "http://hdl.handle.net/10919/26841",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Tate_AnthonyS_D_2012.pdf",
    "Tate_AnthonyS_D_2012_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cultural development",
    "marginality",
    "arts and culture",
    "place identity",
    "imaginaries",
    "urban change"
  ],
  "title": "Civic Tinkering in a Small City: Imaginaries and Intersections of Art, Place and Marginality",
  "type": "Dissertation"
}