{
  "contributor_author": "Radhakrishnan, Ravishekhar",
  "contributor_committeechair": "Cothren, Richard D.",
  "contributor_committeemember": [
    "Tsang, Kwok Ping",
    "Haller, Hans H.",
    "Ashley, Richard A."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:09:34Z",
  "date_adate": "2012-05-01",
  "date_available": "2014-03-14T20:09:34Z",
  "date_issued": "2012-04-05",
  "date_rdate": "2012-05-01",
  "date_sdate": "2012-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is comprised of four chapters. Chapter 1 provides an introduction to economic growth and discusses the topics covered in each of the following chapters along with some main results therein.  In Chapter 2, I develop a dynamic general equilibrium of innovation and imitation in which once a higher quality good is developed, there is an exogenously given rate at which the good is targeted for imitation. However, the innovator can undertake expenditure to protect the good from imitation and thereby lower the effective probability of imitation. It is shown that the total expenditure toward property right protection is inversely related to the cost of property right protection and the effectiveness of the property right system.  Moreover, a subsidy that reduces the per unit cost of property right protection leads to an increase in the intensity of innovation. In the long run, the economy exhibits a constant steady state growth. I further show that an improvement in the efficiency of the property right system has an ambiguous effect on overall consumer welfare.  Chapter 3 develops a two-good, closed economy model, that provides a possible explanation for the existence of misallocation of resources and examines the long-run consequences. In the model, inefficiencies arise as a result of lobbying by firms to establish or prevent barriers to the competitive allocation of factors of production (labor). First, I show that the extent of the inefficiency is determined by the relative lobbying power of the firms. The inefficiencies lead to a static welfare loss, which increase in the relative lobbying power of firms seeking to establish barriers. I further show that if the relative lobbying power of firms seeking the barriers is large, the economy will end up producing a ``wrong'' mix of goods in the long-run, relative to the perfectly competitive equilibrium. The resulting welfare loss depends on the elasticity of substitution between the two goods, and in the case when the two goods are poor substitutes, the total utility may go to zero in the long-run.  In Chapter 4, I apply the model of lobbying developed in Chapter 3 to understand the link between misallocation of resources, international trade and economic growth. Misallocation leads to the possibility that the benchmark competitive free trade equilibrium is not achieved. This leads to a reduction in trade volume and consequently to welfare losses even for a country without domestic barriers. Further, domestic barriers cause a reduction in output growth in the short run. In the long run, however, there is a convergence to the competitive growth rates.",
  "description_provenance": [
    "Author Email: ravish@vt.edu",
    "Advisor Email: byront@vt.edu",
    "Advisor Email: haller@vt.edu",
    "Advisor Email: ashleyr@vt.edu",
    "Advisor Email: cothren@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:34Z (GMT). No. of bitstreams: 1 radhakrishnan_r_d_2012.pdf: 2278422 bytes, checksum: 9a92b3168ad04d147b013be3db92fdc5 (MD5)   Previous issue date: 2012-04-05"
  ],
  "handle": "26840",
  "identifier_other": "etd-04132012-095334",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04132012-095334/",
  "identifier_uri": "http://hdl.handle.net/10919/26840",
  "publisher": "Virginia Tech",
  "relation_haspart": "radhakrishnan_r_d_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "intellectual property",
    "patents",
    "imitation",
    "innovation",
    "allocative inefficiency",
    "economic  growth"
  ],
  "title": "Three Essays in Economic Growth",
  "type": "Dissertation"
}