{
  "contributor_author": "Kelting, Daniel Ladd",
  "contributor_committeechair": "Burger, James A.",
  "contributor_committeemember": [
    "Aust, Wallace Michael",
    "Mou, Paul P.",
    "Zelazny, Lucian W.",
    "Seiler, John R."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:09:34Z",
  "date_adate": "1999-04-28",
  "date_available": "2014-03-14T20:09:34Z",
  "date_issued": "1999-02-08",
  "date_rdate": "2000-04-28",
  "date_sdate": "1999-04-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Lower Coastal Plain of the southeastern United States is a major wood producing region.  The region is characterized by a combination of nearly-level topography, poorly-drained soils, and high rainfall, which results in a perched water table in some soils that inundates the surface several times each year.  Harvesting timber under wet site conditions often results in extensive soil compaction, rutting, soil displacement, and waterlogging.  Forest managers are concerned that these visually-displeasing soil disturbances may cause site damage and reduced productivity.  These concerns were addressed in an operational-scale field experiment conducted in South Carolina.  The objectives of this experiment were to determine:  (i) if soil disturbance changes key soil properties and processes;  (ii) if soil disturbance reduces loblolly pine productivity;  and, (iii) if disturbance can be mitigated with site preparation practices?  Three 20-ha, 20-yr-old loblolly pine (Pinus taeda L.) plantations were harvested under wet and dry conditions to create a broad gradient in soil disturbance.  Within each harvested plantation, a subset of 3-ha plots were site prepared by either bedding, or mole-plowing plus bedding, then all sites were established as 3rd -rotation pine plantations.  Prior to site preparation, each plot was classified and mapped using a 5 by 5 soil disturbance (none to churned) by organic debris (none to slash piles) classification matrix.  Within each plot, data were collected on several soil physical, chemical, and biological properties over a 2-yr period following site preparation.  Key soil properties were integrated into a Soil Quality Index (SQI) and compared to aboveground productivity of 2-yr-old loblolly pine trees growing on closely-spaced (30 by 30 cm) bioassay plots planted across the gradient of soil disturbance.  The soil physical properties were used to determine the least limiting water range (LLWR), the range in soil water content within which root growth is not limited.  Soil compaction and deep rutting reduced the LLWR.  Retention of logging slash improved the LLWR for compacted and rutted soils.  Site preparation improved the quality of the soil physical environment across all levels of soil disturbance.  Soil disturbance had no effect on soil chemical or biological properties as evidenced by no change in soil pH, ECEC, base saturation, available P, or net N mineralization with disturbance.  The base saturation exceeded 80 % on all sites, with Ca saturation controlling soil pH.  The high base saturation buffered any redox-induced changes in soil chemistry that would have resulted from disturbance.  The results showed that high fertility is an important mechanism for buffering the potentially-negative effects of soil disturbance on the soil nutritional environment.  Site preparation changed soil chemical properties, but the changes were probably associated with tillage effects on organic matter and clay content, not redox processes.  The SQI showed that surface soil compaction and deep rutting reduced soil quality, mainly by decreasing the LLWR and aeration depth.  Site preparation mitigated the effects of most disturbances on soil quality, evidenced by similar aboveground biomass production among soil disturbance classes after bedding.  A regression model was developed for predicting aboveground biomass production as a function of SQI.  SQI explained 73 % of the variation in aboveground biomass production.  The regression model showed that compression tracks and rutting decreased aboveground biomass production compared to undisturbed soils.  The long-term effect of these disturbances on productivity will depend on natural soil recovery processes. However, these early results suggest that compaction and rutting should be minimized on similar sites, especially if sites will not be bedded before reforestation.  The mole-plow / bedding treatment increased aboveground biomass production, indicating that this experimental treatment may be a viable practice for enhancing productivity.",
  "description_provenance": [
    "Author Email: kelting@cfr.cfr.ncsu.edu",
    "Advisor Email: waust@vt.edu",
    "Advisor Email: pmou@vt.edu",
    "Advisor Email: zelazny@vt.edu",
    "Advisor Email: jseiler@vt.edu",
    "Advisor Email: jaburger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:34Z (GMT). No. of bitstreams: 1 etd.pdf: 741747 bytes, checksum: d0e301ab8375f3ebcc9cf6e19a9d6ab7 (MD5)   Previous issue date: 1999-02-08"
  ],
  "handle": "26842",
  "identifier_other": "etd-041399-112354",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041399-112354/",
  "identifier_uri": "http://hdl.handle.net/10919/26842",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "soil quality",
    "loblolly pine",
    "site preparation",
    "timber harvesting"
  ],
  "title": "Timber Harvesting and Site Preparation Effects on Soil Quality for Loblolly Pine Growing on the Lower Coastal Plain of South Carolina",
  "type": "Dissertation"
}