{
  "contributor_author": "Hodge, John W.",
  "contributor_committeecochair": [
    "Crockett, Jean B.",
    "Twiford, Travis W."
  ],
  "contributor_committeemember": [
    "Stamm, Neil A.",
    "Bodenhorn, Nancy E.",
    "Cash, Carol S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:36Z",
  "date_adate": "2009-05-07",
  "date_available": "2014-03-14T20:09:36Z",
  "date_issued": "2009-03-31",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Resilience is a phenomenon that refers to the ability to overcome risk factors that increase the likelihood of academic or social failure.  Considerable research has been conducted to determine what may enhance or hinder the ability of individuals to overcome adversity. Unfortunately, much of the research has focused primarily on factors that place individuals at greater risk of failure.  Today in the United States, a number of students experience academic failure due to multiple risk factors.  However, the research is clear that there are individuals referred to as resilient who are able to achieve at high levels in spite of many of the same risk factors.  This heuristic phenomenological study provides insight, based on interviews with high risk, African-American, young adults, into those factors that enabled them to exhibit behaviors consistent with resilience in spite of risk factors in the home, school or community.  The study helps to illuminate their challenges and the reasons for their success.",
  "description_provenance": [
    "Author Email: jhodge@ullcschools.com",
    "Advisor Email: Neil.Stamm@nn.k12.va.us",
    "Advisor Email: jcrockett@coe.ufl.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:36Z (GMT). No. of bitstreams: 1 FINALDISSERTATION.pdf: 925206 bytes, checksum: 91118c79ad5e2df5f843d85bbf84e6a6 (MD5)   Previous issue date: 2009-03-31"
  ],
  "handle": "26853",
  "identifier_other": "etd-04142009-075106",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142009-075106/",
  "identifier_uri": "http://hdl.handle.net/10919/26853",
  "publisher": "Virginia Tech",
  "relation_haspart": "FINALDISSERTATION.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Resilience",
    "Risk Factors",
    "African-American",
    "Protective Factors"
  ],
  "title": "Let Our Youth Speak: A Phenomenological Analysis of Resilience in Students with Multiple Risk Factors",
  "type": "Dissertation"
}