{
  "contributor_author": "Austin, Ian O'Brian",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeemember": [
    "Peters, Bevis F.",
    "Creamer, Elizabeth G.",
    "Janosik, Steven M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:36Z",
  "date_adate": "2009-05-07",
  "date_available": "2014-03-14T20:09:36Z",
  "date_issued": "2009-04-02",
  "date_rdate": "2009-05-07",
  "date_sdate": "2009-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Governance is one aspect of university restructuring that in the last 20 years has become ubiquitous worldwide. The restructuring is in part a response to calls for improving governance in higher education. Keller (1983), for example, describes governance in higher education as limiting the capability of universities to make critical strategic decisions.<P>    Higher education researchers are seeking to understand governance restructuring. A few studies have been conducted in the United States of America, the United Kingdom, and Europe. However, developing countries in the Western World have also recognized the limitations of traditional higher education governance and have restructured their systems. This has prompted a need for research on higher education governance restructuring in developing nations. In the English speaking Caribbean, governance restructuring occurred in 1984 and 1996 at the University of the West Indies (UWI) and occurred again between 2004 and 2008.<P>  The purpose of this study was to examine the most recent governance restructuring at the UWI. The focus was on exploring three dimensions of organizational change: the antecedents or the factors that prompted the change in governance, the content of the change, and the change process.<P>  Three categories of antecedents were discovered: organizational, environmental, and relational antecedents. The organizational antecedent had two sub-themes: performance aspiration and institutional coherence. The environmental antecedents were global competition among nation states, competition from other tertiary education providers, and stakeholdersâ   demands for greater access to higher education. The relational antecedent was a desire to strengthen the relationship with external stakeholders.<P> Four themes related to the content of restructuring emerged from the data: (a) incremental change; (b) corporate/managerial decision-making approach; (c) university-wide strategic planning; and (d) responsiveness to stakeholder demands/needs.  Using an archetype approach, the analysis revealed that although the UWI retained the collegiate archetype tradition, elements of another archetype were infused with the collegiate model creating a hybridized governance system. The process of the restructuring revealed three broad stages: initiation, negotiation, and the implementation stage.<P> Collectively, the results suggest that UWI is moving, albeit slowly, away from collegiate governance towards a managerial model. More research is needed to explore the long-term impact of this shift.",
  "description_provenance": [
    "Author Email: iaustin@vt.edu",
    "Advisor Email: bevis.peters@cavehill.uwi.edu",
    "Advisor Email: creamere@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:36Z (GMT). No. of bitstreams: 1 Ian_Austin_ETD_UWI_Version_7_May_4.pdf: 622341 bytes, checksum: 0d19157c0fc042d6a03e8cc546ac0e3f (MD5)   Previous issue date: 2009-04-02"
  ],
  "handle": "26855",
  "identifier_other": "etd-04142009-125549",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142009-125549/",
  "identifier_uri": "http://hdl.handle.net/10919/26855",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ian_Austin_ETD_UWI_Version_7_May_4.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "process of change",
    "contents of change",
    "archetype",
    "higher education governance restructuring",
    "antecedents of change"
  ],
  "title": "Understanding Higher Education Governance Restructuring: The Case of the University of the West Indies",
  "type": "Dissertation"
}