{
  "contributor_author": "Rickman-Rogers, Tonya Patrice",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Lockee, Barbara B.",
    "Cash, Carol S.",
    "Hoover, J. Larry"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:37Z",
  "date_adate": "2009-05-05",
  "date_available": "2014-03-14T20:09:37Z",
  "date_issued": "2009-04-02",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Throughout the last 30 years, there has been a movement to use computer technology in schools to enhance teaching and learning. In recent years, the No Child Left Behind Act of 2001 has mandated that states have a long range strategic educational technology plan that describes the many facets of their technology integration efforts (2002). However, at this time research indicates that technology integration in classrooms is still low tech and infrequent (Cuban, 2001; NCES, 2005a). The purpose of this quantitative study was to gain insight into a teacherâ  s use of computer technology with students in K-5 general education public school classrooms across the state of Virginia. Eleven independent variables (e.g., teaching philosophy, professional development, hardware proficiency, software proficiency) and 2 dependent variables (i.e., frequency and application of technology integration) were selected based on a review of literature and input from educators. A questionnaire, designed to measure variables, was field tested for validity and reliability then administrated to teachers. The population of the study was approximately 16,500 K-5 general education public school teachers from the state of Virginia with active e-mail addresses in the Market Data Retrieval (MDR) database. A systematic sample of 1,400 K-5 teachers was selected from the MDR database. Teachersâ   responses rendered 313 usable questionnaires. Analysis of the data revealed that the majority of independent variables (8), with the exception of 3 independent variables (i.e., technical support, student to computer ratio, technology integration support), yielded significant correlations with the dependent variable frequency of technology integration. Whereas, all independent variables (10), with the exception of technical support, yielded significant correlations with the dependent variable application of technology integration. Multiple linear regression analysis was conducted to determine whether the 11 independent variables were significant predictors of variation in the dependent variables (frequency and application of integration). The results of both regression analyses rendered significant models for the prediction of variation in frequency and application of integration (R2= .16, R2=.39), respectively. The researcher concluded that the predicted variance (R2= .16) of regression model 1 was too small to be considered a viable model for the predication of variation in frequency. Whereas, regression model 2 predicted a greater level of variance (R2=.39), thus it was considered a good predictor of variation in the application of technology integration. Three of the 11 independent variables (i.e., software availability, teaching philosophy, and software proficiency) were among the variables that were significant predictors of variance in the application of technology integration. The strongest predictor was software availability followed by teaching philosophy and software proficiency. Teachers who reported moderate to low variety in the application of technology integration also reported moderate access to software, moderately low software proficiency, and use of instructional practices that were consistent with constructivism.",
  "description_provenance": [
    "Author Email: trickman@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: lhoover@kaballero.com",
    "Made available in DSpace on 2014-03-14T20:09:37Z (GMT). No. of bitstreams: 1 RickmanRogersDissertation.pdf: 3977405 bytes, checksum: f29967f0dfa12f2198465ec6c7a1e6b4 (MD5)   Previous issue date: 2009-04-02"
  ],
  "handle": "26858",
  "identifier_other": "etd-04142009-180457",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142009-180457/",
  "identifier_uri": "http://hdl.handle.net/10919/26858",
  "publisher": "Virginia Tech",
  "relation_haspart": "RickmanRogersDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "technology integration",
    "instructional practices",
    "instructional technology"
  ],
  "title": "ANALYSIS OF FACTORS THAT INFLUENCE A TEACHERâ  S USE OF COMPUTER TECHNOLOGY IN THE K-5 CLASSROOM",
  "type": "Dissertation"
}