{
  "contributor_author": "Villamagna, Amy Marie",
  "contributor_committeecochair": [
    "Trauger, David L.",
    "Murphy, Brian R."
  ],
  "contributor_committeemember": [
    "Karpanty, Sarah M.",
    "Webster, Jackson R."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:09:36Z",
  "date_adate": "2009-04-15",
  "date_available": "2014-03-14T20:09:36Z",
  "date_issued": "2009-04-01",
  "date_rdate": "2009-04-15",
  "date_sdate": "2009-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Water hyacinth (Eichhornia crassipes) is a floating non-native plant that has been reoccurring in Lake Chapala, Jalisco, Mexico for more than 100 years. In this research, I explore the effects of water hyacinth on freshwater ecosystems worldwide and specifically on Lake Chapala. \t<p>In chapter 1, I reviewed studies conducted on water hyacinth worldwide and found that the effects of water hyacinth on water quality are similar but the magnitude of effects is dependent on the percent cover and potentially the spatial configuration of water hyacinth mats. Water hyacinthâ  s effect on aquatic invertebrates, fish, and waterbirds is less predictable and dependent on conditions prior to invasion. In chapter 2, I tested for relationships between percent water hyacinth cover and waterbird abundance, species diversity, community composition, and habitat use. In general, I found a weak positive relationship or no relationship between these variables. In Chapter 3, I monitored habitat use by American Coots (Fulica americana) in a variety of habitats around Lake Chapala. I found that the time spent in water hyacinth positively corresponded to the percent water hyacinth cover and that the time foraging in water hyacinth was positively related to the time spent in water hyacinth.   <p>In Chapter 4, I compared invertebrate assemblages in open water to those within and at the edge of water hyacinth mats, emergent vegetation, and submerged trees. I also examined invertebrate assemblages within the roots of water hyacinth plants and compared assemblages between patch and shoreline water hyacinth plants. I found that density and taxonomic richness of water column invertebrates were generally higher in association with water hyacinth, but that mean percent cover of water hyacinth affected the magnitude of differences among habitats and vegetation types. I did not find significant differences in root invertebrate density and taxonomic richness between patch and shoreline water hyacinth plants. In chapter 5, I discuss how water hyacinth affected dissolved oxygen and water transparency on a small, localized scale, but was not the driving factor for seasonal differences. The overall results suggest that water hyacinth had a minimal ecological effect on Lake Chapala during this study.",
  "description_provenance": [
    "Author Email: amv@vt.edu",
    "Advisor Email: karpanty@vt.edu",
    "Advisor Email: dtrauger@vt.edu",
    "Advisor Email: murphybr@vt.edu",
    "Advisor Email: jwebster@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:36Z (GMT). No. of bitstreams: 1 Villamagna_FiWDissertation.pdf: 3234040 bytes, checksum: a16d769da8b45873460caa9ce6e1d8b9 (MD5)   Previous issue date: 2009-04-01"
  ],
  "handle": "26854",
  "identifier_other": "etd-04142009-102814",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142009-102814/",
  "identifier_uri": "http://hdl.handle.net/10919/26854",
  "publisher": "Virginia Tech",
  "relation_haspart": "Villamagna_FiWDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "water hyacinth",
    "Eichhornia crassipes",
    "waterbirds",
    "community ecology",
    "aquatic invertebrates",
    "freshwater ecology",
    "invasive species"
  ],
  "title": "Ecological effects of water hyacinth (Eichhornia crassipes) on Lake Chapala, Mexico",
  "type": "Dissertation"
}