{
  "contributor_author": "Lim, Grace T",
  "contributor_committeecochair": [
    "Salom, Scott M.",
    "Kok, Loke T."
  ],
  "contributor_committeemember": [
    "Kirton, Laurence G.",
    "Pfeiffer, Douglas G.",
    "Fell, Richard D."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:09:36Z",
  "date_adate": "2007-05-03",
  "date_available": "2014-03-14T20:09:36Z",
  "date_issued": "2007-04-04",
  "date_rdate": "2007-05-03",
  "date_sdate": "2007-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The weaver ant is a promising biological control agent of a shoot borer, <i>Hypsipyla robusta</i> Moore, on mahogany, but techniques to conserve ant colonies redistributed to mahogany plantations have not yet been developed. The effect of food supplementation and host plant species preference of the weaver ant, <i>Oecophylla smaragdina</i> F., was evaluated in a series of field studies. <p> A simple model was developed to estimate the number of ants within nests on <i>Khaya ivorensis</i> A. Chev. (Meliaceae): log<sub>10</sub> (Number of ants) = - 1.16 + 1.09 log<sub>10</sub> (Nest size). Nest size is calculated from estimated nest height <i>(&#293;)</i> and length <i>(Ã )</i> using the formula = &#960;r<sup>2</sup>; <i>Ã </i>, where r = Â½ <i>&#293;</i>. This model was useful for repeated assessments of ant population levels to evaluate treatment effects. It provides better estimates than previous indirect methods based on nest counts and ant trail counts on plant parts.<p> Colonies that were relocated without their queens and very small colonies (< 10,000 ants) failed to establish on new host trees, indicating that a minimum ant population and queen needs to be transferred for colony survival. Established colonies consumed more high-protein foods (live mealworms and fish) than high-carbohydrate liquid foods (honey and â  weaver ant formulaâ  , which contained sucrose and human muscle-training powder (Enerpro<sup>TM</sup>)). Relocated colonies consumed more weaver ant formula and as many mealworms as established colonies, indicating that existing and relocated colonies require different food supplementation strategies. Decreasing consumption over time and preferential consumption among high-protein food choices (i.e., of mealworms over fish) indicated that ants select and regulate food consumption based on colony needs. Therefore, food supplementation should be as needed. Preliminary indications were that self-sufficiency in trophobiont (honeydew) levels may be achieved in two months after colony relocation. <p> The optimal colony density that would protect <i>K. ivorensis</i> was estimated to be within the range of 6 â   48 colonies per ha based on previous reports for cocoa and cashew, and a consideration of the low damage threshold for mahogany. Substituting chemical control with weaver ants at those application rates gave similar IRRs (Internal rate of return; 11.6 â   12.2 vs. 12.0%) in preliminary financial analyses, and was preferable from an ecological standpoint.<p> Twenty-nine host plant species were found for Malaysian <i>O. smaragdina</i>, of which 11 were new species records for <i>Oecophylla</i> spp. Also, there were two new genera and eight new species records for Malaysian <i>O. smaragdina</i>. Of eight trophobiont families collected, six species were identified, yielding new trophobiont-host plant species records for four coccoid species and two membracid genera. Screening of several ant-abundant plant species that included preliminary pest risk analyses for trophobionts on <i>K. ivorensis</i>, identified <i>M. citrifolia</i> as a promising candidate for mixed-planting with this mahogany species.",
  "description_provenance": [
    "Author Email: gracelim@vt.edu",
    "Advisor Email: salom@vt.edu",
    "Advisor Email: ltkok@vt.edu",
    "Advisor Email: laurence@frim.gov.my",
    "Advisor Email: dgpfeiff@vt.edu",
    "Advisor Email: rfell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:36Z (GMT). No. of bitstreams: 1 etd2.pdf: 795005 bytes, checksum: 81a0739c90a11969754309c44d241f0d (MD5)   Previous issue date: 2007-04-04"
  ],
  "handle": "26850",
  "identifier_other": "etd-04142007-091557",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142007-091557/",
  "identifier_uri": "http://hdl.handle.net/10919/26850",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "<i>Khaya ivorensis</i>",
    "Trophobiont",
    "Mahogany shoot borer",
    "Host plant species",
    "<i> Morinda citrifolia</i>",
    "Food supplementation"
  ],
  "title": "Enhancing the weaver ant, <i>Oecophylla smaragdina</i> (Hymenoptera: Formicidae),  for biological control of a shoot borer, <i>Hypsipyla robusta</i> (Lepidoptera: Pyralidae), in Malaysian mahogany plantations",
  "type": "Dissertation"
}