{
  "contributor_author": "Alexander, William Andrew",
  "contributor_committeechair": "Troya, Diego",
  "contributor_committeemember": [
    "Tanko, James M.",
    "Crawford, Daniel T.",
    "Morris, John R.",
    "Valeyev, Eduard Faritovich"
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:09:37Z",
  "date_adate": "2009-05-06",
  "date_available": "2014-03-14T20:09:37Z",
  "date_issued": "2009-04-01",
  "date_rdate": "2009-05-06",
  "date_sdate": "2009-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A full understanding of chemical reaction dynamics at the gas/organic-surface  interface requires knowledge of energy-transfer processes that happen during the initial gas/surface collision.  We have examined the influence of mass and rovibrational motion on the energy-transfer dynamics of gas-phase species scattering from model organic surfaces using theory and experiment.  Molecular-beam scattering techniques were used to investigate the rare gases, Ne, Ar, Kr, and Xe, and the diatomics, N<sub>2</sub> and CO, in collisions with CH<sub>3</sub>- and CF<sub>3</sub>-terminated self-assembled monolayer (SAM) surfaces.  Complementary molecular-dynamics simulations were employed to gain an atomistic view of the collisions and elucidate mechanistic details not observable with our current experimental apparatus.  We developed a systematic approach for obtaining highly accurate analytic intermolecular potential-energy surfaces, derived from high-quality ab initio data, for use in our classical-trajectory simulations.  Results of rare gas scattering experiments and simulations indicate mass to be the determining factor in the energy-transfer dynamics, while other aspects of the potential-energy surface play only a minor role.  Additionally, electronic-structure calculations were used to correlate features of the potential-energy surface with the energy-transfer behavior of atoms and small molecules scattering from polar and non-polar SAM surfaces.  Collisions of diatomic molecules with SAMs are seen to be vibrationally adiabatic, however translational energy transfer to and from rotational modes of the gas species, while relatively weak, is readily apparent.  Examination of the alignment and orientation of the final rotational angular momentum of the gas species reveals that the collisions induce a stereodynamic preference for the expected &quot;cartwheel&quot; motion, as well as a surprising propensity for &quot;corkscrew&quot; or &quot;propeller&quot; motion.  The calculated stereodynamic trends suggest that the CH<sub>3</sub>-SAM is effectively more corrugated than the CF<sub>3</sub>-SAM.  Finally, the feasibility for collisional-energy promoted, direct gas/organic-surface reactions was interrogated using the 1,3-dipolar azide-alkyne cycloaddition reaction. We found that geometrical constraints prevented the reaction from proceeding at the probed conditions.",
  "description_provenance": [
    "Author Email: alexandw@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: crawdad@vt.edu",
    "Advisor Email: jrmorris@vt.edu",
    "Advisor Email: troya@vt.edu",
    "Advisor Email: evaleev@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:37Z (GMT). No. of bitstreams: 1 AlexanderETD.pdf: 13524548 bytes, checksum: 7b13731171cb0ad2a6885fab7bfcfe44 (MD5)   Previous issue date: 2009-04-01"
  ],
  "handle": "26857",
  "identifier_other": "etd-04142009-160507",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142009-160507/",
  "identifier_uri": "http://hdl.handle.net/10919/26857",
  "publisher": "Virginia Tech",
  "relation_haspart": "AlexanderETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "stereodynamics",
    "classical-trajectory simulations",
    "molecular-beam scattering",
    "potential-energy surface derivation",
    "self-assembled monolayers",
    "rotational and vibrational energy transfer"
  ],
  "title": "Theoretical and experimental studies of energy transfer dynamics in collisions of atomic and molecular species with model organic surfaces",
  "type": "Dissertation"
}