{
  "contributor_author": "Parker, James L. F.",
  "contributor_committeecochair": [
    "Parks, David J.",
    "Dawson, Christina M."
  ],
  "contributor_committeemember": [
    "Creighton, Theodore B.",
    "Tripp, Norman Wayne"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:36Z",
  "date_adate": "2007-05-05",
  "date_available": "2014-03-14T20:09:36Z",
  "date_issued": "2007-04-03",
  "date_rdate": "2007-05-05",
  "date_sdate": "2007-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>The purpose of this study was to provide data that could be used to improve staff development in Virginia창  s Regional Alternative Education Centers. Characteristics of participants and of centers were identified as factors to investigate. The personal characteristics of the participants were age, gender, position, attitude toward staff development, and total years of experience in education. The center characteristics were location, age of center, grade levels served, number of staff employed, number of students served, number of special education students served, budget for staff development, pooling of resources, center leadership, number of certified general education teachers, and number of certified special education teachers. Quality of staff development was measured on the following dimensions: learning environment, time for learning, planning, evaluation, materials, techniques, funding, content, rewards for participation, use of adult learning principles, and transfer of learning.</p> <p>The design was both quantitative and qualitative. A questionnaire was mailed to 99 administrative coordinators, teachers, and counselors in 26 participating regional centers. Quantitative responses were analyzed with descriptive statistics, ANOVA, and multiple regression. The qualitative phase involved three focus groups with four participants in each group 창   one administrative coordinator, one counselor, and two teachers. Three centers were chosen at random from three different geographic regions in Virginia 창   urban, suburban, and rural. Nominal group techniques were used to create a prioritized list of recommendations for staff development at the centers.</p> <p>Factors that best predicted the quality of staff development were the quality of center leadership, attitude toward staff development, and grade levels served. The prioritized lists of strategies from the focus groups included funding for inservice travel, providing training during workday, using teambuilding techniques, working with stakeholders, increasing number of staff employed, and having stakeholders provide timely services. A major implication of the study was that one theory with independent predictor variables did not relate to the quality factors. A more accurate description evolved창  a family of theories. The family consists of three separate theories, with each theory identified by the predictor variables that were found to be associated with specific quality variables.</p>",
  "description_provenance": [
    "Author Email: jparker@ccpsd.k12.va.us",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: tdawson@antiochsea.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:36Z (GMT). No. of bitstreams: 1 ParkerJamesLF.pdf: 711230 bytes, checksum: 50fa0f51b17718b4569a6d619eb2aa81 (MD5)   Previous issue date: 2007-04-03"
  ],
  "handle": "26852",
  "identifier_other": "etd-04142007-215738",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142007-215738/",
  "identifier_uri": "http://hdl.handle.net/10919/26852",
  "publisher": "Virginia Tech",
  "relation_haspart": "ParkerJamesLF.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "leadership",
    "alternative education",
    "staff development",
    "adult learning",
    "public schools"
  ],
  "title": "Factors Related to the Quality of Staff Development in Virginia's Regional Alternative Education Centers",
  "type": "Dissertation"
}