{
  "contributor_author": "Timmons, Stacey L.",
  "contributor_committeechair": "Travis W. Twiford",
  "contributor_committeemember": [
    "David A. Cox",
    "Theodore B. Creighton",
    "Cash, Carol S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:37Z",
  "date_adate": "2010-04-28",
  "date_available": "2014-03-14T20:09:37Z",
  "date_issued": "2010-03-31",
  "date_rdate": "2013-05-21",
  "date_sdate": "2010-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>This study examined the types of training that school principals currently have and perceive they need in order to effectively address school safety and respond to crisis events. Elementary, middle, and high school principals across the Commonwealth of Virginia were surveyed utilizing an adjusted version of the School Safety Needs Training Survey constructed by the Virginia Department of Criminal Justice Services Virginia Center for School Safety. Out of the total 1,791 surveys sent out, 648 surveys were returned, resulting in a 36 percent response rate. Analyses of Variances (ANOVA) and descriptive statistics were run on the data, and Bonferroni post hoc tests for significance were conducted in order to examine differences in the perceived training needs of principals based on level of administration. Findings indicated that principals had the most training on the school safety topics of medical emergencies, managing bomb threats, and responding to crisis incidents. Principals at the elementary, middle, and high school levels all reported that they needed more training in the area of dealing with disruptive and assaultive students and intervening with angry and abusive parents and family members. Significant differences were found between elementary and middle school principals and elementary and high school principals. Findings indicate that middle and high school principals were more concerned with receiving training on topics that dealt with violent and criminal activity than elementary school principals. </p>",
  "description_provenance": [
    "Author Email: stimmons@culpeperschools.org",
    "Advisor Email: davidcox@acps.k12.md.us",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:37Z (GMT). No. of bitstreams: 1 Timmons_ETD.pdf: 700348 bytes, checksum: 272e88b9f421e3b635b4356a2b55db69 (MD5)   Previous issue date: 2010-03-31"
  ],
  "handle": "26859",
  "identifier_other": "etd-04142010-123529",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142010-123529/",
  "identifier_uri": "http://hdl.handle.net/10919/26859",
  "publisher": "Virginia Tech",
  "relation_haspart": "Timmons_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "school safety",
    "principals",
    "training"
  ],
  "title": "PRINCIPAL PERCEPTIONS OF TRAINING NEEDS IN SCHOOL SAFETY IN VIRGINIA",
  "type": "Dissertation"
}