{
  "contributor_author": "Stimpson, Racheal Lee",
  "contributor_committeechair": "Janosik, Steven M.",
  "contributor_committeemember": [
    "Burge, Penny L.",
    "Ridgwell, Diana M.",
    "Smith, Barbara Ellen"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:36Z",
  "date_adate": "2009-04-30",
  "date_available": "2014-03-14T20:09:36Z",
  "date_issued": "2009-04-02",
  "date_rdate": "2009-04-30",
  "date_sdate": "2009-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An Exploration of Senior Student Affairs Officersâ   Career and Life Paths Racheal L. Stimpson Abstract The purpose of this study was to explore the career and life paths of male and female Senior Student Affairs Officers (SSAOs). The study used Superâ  s components of Work Salience and Career maturity to examine gender differences and commonalities of individuals in their climb to a SSAO position. Specifically, the study examined the role of family and personal life and the intersection with career. Employing qualitative methods in the form of semi-structured interviews, this study investigated the following research questions: 1. How do female SSAOs describe their life and career development according to Superâ  s factors of Work Salience and Career Maturity? 2. How do male SSAOs describe their life and career development according to Superâ  s factors of Work Salience and Career Maturity? 3. How do male and female SSAOs life and career development experiences compare to one another according to Superâ  s factors of Work Salience and Career Maturity? The transcripts were analyzed using open and focused coding to find themes present in the data. The coding process was reviewed by a peer as well as a panel of experts to ensure trustworthiness. The findings of the study indicated themes regarding caregiving, work experience, leisure activities, marital status, scheduling, and career planning.",
  "description_provenance": [
    "Author Email: rstimpso@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: dridgwel@vt.edu",
    "Advisor Email: smithbe@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:36Z (GMT). No. of bitstreams: 1 ETD.pdf: 649971 bytes, checksum: 424bf8aafbc24b7caa1300df65da6a04 (MD5)   Previous issue date: 2009-04-02"
  ],
  "handle": "26856",
  "identifier_other": "etd-04142009-130050",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142009-130050/",
  "identifier_uri": "http://hdl.handle.net/10919/26856",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "work-life balance",
    "student affairs",
    "senior student affairs officers",
    "gender",
    "Super"
  ],
  "title": "An Exploration of Senior Student Affairs Officers' Career and Life Paths",
  "type": "Dissertation"
}