{
  "contributor_author": "Brown, Beth Lynne",
  "contributor_committeechair": "Krill, Cecelia W.",
  "contributor_committeemember": [
    "Glowa, Elizabeth",
    "Parson, Stephen R.",
    "Niles, Jerome A.",
    "Wiita, Teresa C."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:40Z",
  "date_adate": "2002-04-22",
  "date_available": "2014-03-14T20:09:40Z",
  "date_issued": "2002-04-05",
  "date_rdate": "2003-04-22",
  "date_sdate": "2002-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated teachersâ   perceptions of the influences of action research on their thinking about instructional practices and the impact of this thinking on teaching practices. The four specific areas of investigation were teachersâ   perceptions about (a) the overall teacher role, (b) teachersâ   knowledge about teaching, (c) teaching practices, and (d) reflective practices. The data were collected from interviews with teacher researchers, informal classroom observations, and collection of teacher and student work and related artifacts. The data revealed that teachers perceived changes in the four areas of investigation. Engaging in the stages of action research provided teachers with a methodical structure for implementing and analyzing the teaching and learning process. This defined structure guided teachers through more systematic and conscious data collection, data analysis, and reflection.",
  "description_provenance": [
    "Author Email: Beth_Brown@fc.mcps.k12.md.us",
    "Advisor Email: ckrill@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:40Z (GMT). No. of bitstreams: 1 BethBrownDissertation.pdf: 464852 bytes, checksum: 7a1bf6a463701c26496cb7f034d7f98c (MD5)   Previous issue date: 2002-04-05"
  ],
  "handle": "26869",
  "identifier_other": "etd-04152002-182022",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152002-182022/",
  "identifier_uri": "http://hdl.handle.net/10919/26869",
  "publisher": "Virginia Tech",
  "relation_haspart": "BethBrownDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Staff Development",
    "Action Research",
    "Adult Learning"
  ],
  "title": "Improving Teaching Practices through Action Research",
  "type": "Dissertation"
}