{
  "contributor_author": "Bezy, Kevin Gerard",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Craig, James R.",
    "Creighton, Theodore B.",
    "Abel, Ann T."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:38Z",
  "date_adate": "2011-04-26",
  "date_available": "2014-03-14T20:09:38Z",
  "date_issued": "2011-04-01",
  "date_rdate": "2012-05-31",
  "date_sdate": "2011-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This is the report of a Delphi study designed to identify the characteristics, behaviors, and work environments of spiritual leaders.  A panel of philosophers, writers, business leaders, non-profit leaders, religious leaders, educators, and politicians was purposefully recruited to participate in the study.  Data gathered from the panel were analyzed with the Maykut and Morehouse (1994) constant comparative method and descriptive statistics to identify characteristics, behaviors, and work environments of spiritual leaders.<p> \tThe panel-identified characteristics and behaviors of spiritual leaders were grouped into three themes: interpersonal, intrapersonal, and religious.  Work environments in which spiritual leaders can be effective were grouped into six themes: community-building, person-centered, product-oriented, principle-driven, religious, and mission/purpose-driven.  The interpersonal descriptors are predominant in the findings, supporting the conclusion that spiritual leadership is interpersonal in nature in an enhanced way.  Although writers have emphasized that spiritual leadership is separable from religion, the panelists accepted 13 descriptors in religious categories, indicating that they had difficulty separating spiritual religious leadership from a secular counterpart.<p> \tThe findings incorporate the concepts of meaning, community, and integrity presented in a theory of spiritual leadership created for this study, but the findings go well beyond the concepts in the theory.  To be more reflective of reality, the theory must be expanded to emphasize the other-orientation of spiritual leaders.  The expanded theory and the enriched concepts within it may have benefit to practitioners and future researchers interested in exploring the practice and study of spiritual leadership.<p> Two tools were created from the findings.  One tool is a self-assessment that leaders may use to compare their leadership style with that of spiritual leaders.  The second tool may be used by leaders to assess whether their work environments promote the effectiveness of spiritual leaders.  Researchers may find the tools useful as initial measures of the characteristics, behaviors, and environments of spiritual leaders.",
  "description_provenance": [
    "Author Email: bezy@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: jimcraig@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: anntabel@gmail.com",
    "Made available in DSpace on 2014-03-14T20:09:38Z (GMT). No. of bitstreams: 1 BEZY_KG_D_2011.pdf: 5839542 bytes, checksum: 3b93b0e3686bc0fb97ad120abf315c81 (MD5)   Previous issue date: 2011-04-01"
  ],
  "handle": "26865",
  "identifier_other": "etd-04142011-152651",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142011-152651/",
  "identifier_uri": "http://hdl.handle.net/10919/26865",
  "publisher": "Virginia Tech",
  "relation_haspart": "BEZY_KG_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Education",
    "Workplace",
    "Spirituality",
    "Integrity",
    "Spiritual Leadership",
    "Schools",
    "Delphi"
  ],
  "title": "An Operational Definition of Spiritual Leadership",
  "type": "Dissertation"
}