{
  "contributor_author": "Snider, Richard Conrad",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Holmes, Glen A.",
    "Burton, John K.",
    "Cennamo, Kathy",
    "Billingsley, Bonnie S."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:40Z",
  "date_adate": "2002-04-17",
  "date_available": "2014-03-14T20:09:40Z",
  "date_issued": "2002-04-09",
  "date_rdate": "2003-04-17",
  "date_sdate": "2002-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A large number of individuals who are identified as having learning disabilities have deficits in written expression.  Existing theory and research indicate that for those individuals oral expression not only precedes, but also exceeds their written expression capabilities.  As a result, dictation has been investigated as an accommodation for these individuals.  Research in this area indicates that dictation does tend to increase quality, length, and rate of production of written expression.  This mode, however, has a number of shortcomings, including difficulties caused by social skills deficits and a loss of independence.  Additionally, for universities providing this accommodation, the annual cost of providing a transcription service is high.  Speech recognition has the potential to overcome these shortcomings, but presently little research has been conducted to investigate the advantages and disadvantages of this mode of writing.  The purpose of this study was to examine the compensatory effectiveness of oral expression through the use of continuous speech recognition technology on the written composition performance of postsecondary students with learning disabilities.   This writing mode was compared to a popular accommodation involving oral expression, using a human transcriber to create a verbatim transcription, and to a common visual-motor method of writing, using a keyboard without assistance.   Analysis of the data revealed that students with learning disabilities in the area of written expression wrote significantly higher quality essays at a faster rate using the transcription and speech recognition modes of writing than they did using the keyboarding method of writing.  There was no significant difference in the length of essays across the three treatment groups.  This study suggests that current continuous speech recognition technology can offer postsecondary students with learning disabilities a method to write that is superior to keyboarding as indicated by measures of quality and rate of production.  Since the speech recognition technology does not have the limitations of the transcription process (i.e., loss of independence and high cost), it may be the best alternative for postsecondary students with learning disabilities in the area of written expression to maximize their oral language strengths to more efficiently produce better quality writing.",
  "description_provenance": [
    "Author Email: rsnider@vt.edu",
    "Advisor Email: gholmes@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: cennamo@vt.edu",
    "Advisor Email: bbilling@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:40Z (GMT). No. of bitstreams: 1 rsnider.pdf: 552435 bytes, checksum: 3f63b325fbae4288cf1867346205c7a7 (MD5)   Previous issue date: 2002-04-09"
  ],
  "handle": "26868",
  "identifier_other": "etd-04152002-144754",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152002-144754/",
  "identifier_uri": "http://hdl.handle.net/10919/26868",
  "publisher": "Virginia Tech",
  "relation_haspart": "rsnider.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "written composition",
    "learning disabilities",
    "speech recognition"
  ],
  "title": "The Effectiveness of Oral Expression through the use of Continuous Speech Recognition Technology in Supporting the Written Composition of Postsecondary Students with Learning Disabilities",
  "type": "Dissertation"
}