{
  "contributor_author": "Kelly, Charlene  Nicole",
  "contributor_committeechair": "Schoenholtz, Stephen H.",
  "contributor_committeemember": [
    "Adams, Mary Beth",
    "Berry, Duane F.",
    "Webster, Jackson R.",
    "Burger, James A."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:09:37Z",
  "date_adate": "2010-05-06",
  "date_available": "2014-03-14T20:09:37Z",
  "date_issued": "2010-04-01",
  "date_rdate": "2010-05-06",
  "date_sdate": "2010-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Increased anthropogenic deposition of nitrogen (N) and land-use changes associated with planted forests have important implications for sustainable forest management and associated water quality.  The purpose of the research for this dissertation was to explore how N deposition will affect the long-term health, productivity, and carbon (C) and N sequestration of conifer and hardwood forest types by examining the mechanisms controlling N cycling and NO3-N production in two watersheds with contrasting vegetation at the Fernow Experimental Forest (FEF), West Virginia.  I utilized watershed C and N budgets to account for differences in stream export of NO3-N from streams draining adjacent watersheds containing (i) planted Norway spruce (Picea abies) and (ii) native Appalachian hardwoods.  I also investigated spatial and temporal patterns of dissolved C and N across both watersheds and identified key soil properties associated with NO3-N in soil solution and streamwater.  In a third study, I performed a soil inoculation and incubation experiment, which utilized soil from both watersheds, mixed in ratios in order to create a gradient of soil chemical and biotic characteristics.    Important differences in biogeochemical cycling of C and N were documented in the watersheds after nearly 40 years of influence by contrasting vegetation.  Total C and N pools were 28% and 35% lower in the spruce watershed than the hardwood watershed, respectively.  Results also identify vegetation-mediated differences in soil characteristics, with lower soil pH and base cations, and higher extractable aluminum and C:N ratios measured in the spruce soil as compared to the native hardwood soil.  Establishment of a spruce monoculture at the FEF significantly altered N cycling, depleted N stores, increased soil acidity, and altered organic matter dynamics, thus leading to low net nitrification rates.  Carbon and N properties and processes in the soil profile should be taken into consideration in forests managed for ecosystem services including C sequestration and improvement or maintenance of water quality through alleviation of N inputs into aquatic ecosystems.",
  "description_provenance": [
    "Author Email: kellycn@vt.edu",
    "Advisor Email: mbadams@fs.fed.us",
    "Advisor Email: duberry@vt.edu",
    "Advisor Email: jwebster@vt.edu",
    "Advisor Email: jaburger@vt.edu",
    "Advisor Email: schoenhs@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:37Z (GMT). No. of bitstreams: 1 Kelly_CN_D_2010.pdf: 1232637 bytes, checksum: e82762aea8af0278e05ab8476a69448e (MD5)   Previous issue date: 2010-04-01"
  ],
  "handle": "26860",
  "identifier_other": "etd-04142010-123554",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142010-123554/",
  "identifier_uri": "http://hdl.handle.net/10919/26860",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kelly_CN_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Fernow Experimental Forest",
    "nitrogen cycling",
    "forest soils",
    "Norway spruce",
    "vegetation conversion"
  ],
  "title": "Carbon and nitrogen cycling in watersheds of contrasting vegetation types in the Fernow Experimental Forest, West Virginia",
  "type": "Dissertation"
}