{
  "contributor_author": "Ball, Jennifer Ann",
  "contributor_committeechair": "Conforti, Frank D.",
  "contributor_committeemember": [
    "Young, Roderick W.",
    "Bakhit, Raga M.",
    "Marini, Richard P.",
    "Barbeau, William E."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:09:40Z",
  "date_adate": "1999-04-23",
  "date_available": "2014-03-14T20:09:40Z",
  "date_issued": "1999-04-09",
  "date_rdate": "2000-04-23",
  "date_sdate": "1999-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Three hydrocolloid-lipid emulsion coatings were developed using Humkote brand partially hydrogenated cottonseed and vegetable oil, and one of three combined hydrocolloid bases:  xanthan gum and propylene glycol alginate (xanthan coating), locust bean gum and xanthan gum (locust bean gum coating), and maltodextrin.  Sensory testing using a ranking preference test indicated that these coatings had acceptable appearance and palatability.  Quality characteristics of green bell peppers (Capsicum annum L. cv. King Arthur) measured during the 5-week storage period included: respiration rates, chlorophyll content, surface color, puncture force, pectin (uronic acid) content, ascorbic acid (AA) and dehydroascorbic acid (DHA) content, and cumulative weight loss.  No significant differences between coated and uncoated peppers were noted in tests for respiration, puncture force, hue angle, chlorophyll content, and AA content.  Uncoated peppers had significantly inferior moisture retention (p<0.05), which caused them to be unsaleable after 8 days, while coated groups were saleable for an additional 6 to 8 days.  Uncoated fruits also had greater uronic acid breakdown (p<0.05) and higher DHA content (p<0.06) than coated peppers. Significant weekly changes (all treatment groups combined) included linear increases in respiration rates (p<0.01) and moisture loss (p<0.01), increasing linear and quadratic trends in uronic acid content (p<0.01 for both trends), increasing quadratic trends for both chlorophyll and AA content (p<0.05, p<0.01, respectively), and decreasing linear and quadratic (p<0.05 for both trends) in DHA content.  The only significant difference between coated groups was in chroma value, with maltodextrin coated peppers appearing less vivid than locust bean coated peppers. Overall, all three coatings performed equally well during the storage study.  However, coatings with higher lipid content, which included xanthan gum and locust bean gum groups, withstood humidity changes better than the maltodextrin coated peppers.  Coating application provided the greatest benefits in terms of texture maintenance through water retention and prevention of pectin breakdown, despite the lack of differences observed in puncture force.  Coatings may also have prevented AA oxidation as demonstrated by the higher DHA content in uncoated groups, however AA patterns do not confirm this concept.  Future research should be directed toward further minimizing textural changes and maximizing coating durability.",
  "description_provenance": [
    "Author Email: jeball3@vt.edu",
    "Advisor Email: ryoung@vt.edu",
    "Advisor Email: bakhit@vt.edu",
    "Advisor Email: marinirp@vt.edu",
    "Advisor Email: fconfort@vt.edu",
    "Advisor Email: barbeau@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:40Z (GMT). No. of bitstreams: 5 etd2.pdf: 51242 bytes, checksum: 9610c3cf95e47da72f89b4ede925eb8e (MD5) etd3.pdf: 60831 bytes, checksum: 2bd08c5b2e53e214c43137360f2fad06 (MD5) etd1.pdf: 231351 bytes, checksum: 286e85ed97312bb577cd6eeab7d522a3 (MD5) etd4.pdf: 61316 bytes, checksum: b86246e72d673703a1a3c30a12946b6f (MD5) etd5.pdf: 107822 bytes, checksum: 34de7d3d745e9e89746ae2c6893a968b (MD5)   Previous issue date: 1999-04-09"
  ],
  "handle": "26867",
  "identifier_other": "etd-041499-135944",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041499-135944/",
  "identifier_uri": "http://hdl.handle.net/10919/26867",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etd2.pdf",
    "etd3.pdf",
    "etd1.pdf",
    "etd4.pdf",
    "etd5.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "ascorbic acid",
    "edible coatings",
    "bell peppers",
    "hydrocollois",
    "emulsions"
  ],
  "title": "Development and Effectiveness of Three Hydrocolloid-Lipid Emulsion Coatings on Preservation of Quality Characteristics in Green Bell Peppers",
  "type": "Dissertation"
}