{
  "contributor_author": "Thridandapani, Raghunath  Rao",
  "contributor_committeechair": "Clark, David E.",
  "contributor_committeemember": [
    "Hendricks, Robert W.",
    "Lu, Guo-Quan",
    "Pickrell, Gary R."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:09:38Z",
  "date_adate": "2011-05-02",
  "date_available": "2014-03-14T20:09:38Z",
  "date_issued": "2011-04-01",
  "date_rdate": "2011-05-02",
  "date_sdate": "2011-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Spent Nuclear Fuel (SNF) is a by-product of existing nuclear reactors; SNF consists of long-lived radioactive actinides which have an average half-life of several thousand years (e.g. Plutonium-239 with a half-life of 24,000 years, and Americium-243 with a half-life of 7,360 years). Several multinational organizations are making an attempt to extract the energetic value out of these nuclear stockpiles in order to minimize the risk of nuclear proliferation and reduce waste volume. The Inert Matrix Fuel (IMF) concept is being considered as an option to reuse the radioactive actinides present in spent nuclear fuel by means of a transmutation process. Due to the volatile nature of these radioactive actinides, it is expected that the high-temperature conventional processing of IMFs will result in a significant loss of material.  This study investigates microwave sintering of inert matrix material (excluding actinide fuel) as an alternative route to conventional processing. It was observed that microwave sintering showed a reduction of 300°C in temperature required for full densification when compared to conventional sintering. The reduction in sintering temperatures did not show any significant variation in the resulting properties (hardness and grain size). While these results satisfy the need for the application, it is important to understand why microwaves enhance the sintering phenomena.  It is speculated (by many researchers) that the electric field associated with microwave energy is enhancing flux leading to accelerated densification during microwave sintering. This study has observed a decrease in the activation energy (for sintering 8YZ) with the increase in the magnitude of the applied electric field.",
  "description_provenance": [
    "Author Email: rrt9001@vt.edu",
    "Advisor Email: dclark@vt.edu",
    "Advisor Email: hendrxrw@vt.edu",
    "Advisor Email: gqlu@vt.edu",
    "Advisor Email: pickrell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:38Z (GMT). No. of bitstreams: 2 Thridandapani_RR_D_2011.pdf: 7032072 bytes, checksum: 6d7623ff101cc2b1e71032e60cf8b516 (MD5) Thridandapani_RR_D_2011_Copyright.pdf: 932751 bytes, checksum: f6164a2eed1bda93c403ee12b1bcbe1f (MD5)   Previous issue date: 2011-04-01"
  ],
  "handle": "26864",
  "identifier_other": "etd-04142011-141440",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142011-141440/",
  "identifier_uri": "http://hdl.handle.net/10919/26864",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Thridandapani_RR_D_2011.pdf",
    "Thridandapani_RR_D_2011_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Microwaves",
    "Sintering",
    "Activation Energy",
    "Zirconia"
  ],
  "title": "The Effect of Microwave Energy on Sintering",
  "type": "Dissertation"
}