{
  "contributor_author": "Siers, Kevin W.",
  "contributor_committeechair": "Creighton, Theodore B.",
  "contributor_committeemember": [
    "Craig, James R.",
    "Earthman, Glen I.",
    "Tripp, Norman Wayne"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:37Z",
  "date_adate": "2010-04-20",
  "date_available": "2014-03-14T20:09:37Z",
  "date_issued": "2010-04-01",
  "date_rdate": "2010-04-20",
  "date_sdate": "2010-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Siers Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p align=\"center\">PURPOSE </p> <p>This study had two purposes: (a) to examine the possible predicting abilities of socioeconomic status, per pupil expenditures, percentage of highly qualified teachers and attendance rates for on-time educational attainment in the state of Virginia and (b) to compare the Appalachian School Divisions of Virginia with the non-Appalachian school divisions for each of these variables. </p> <p align=\"center\">METHOD </p> <p>Data pertaining to socioeconomic status, per pupil expenditures, attendance rates, teacher qualifications, and on-time educational attainment were collected for the graduating cohorts of 2005, 2006, 2007, and 2008. A stepwise multiple regression analysis was conducted on these variables to address the first purpose. A general linear model repeated measures ANOVA was conducted for each variable to compare differences between the Appalachian, non-Appalachian divisions of similar size, non-Appalachian large school divisions, and the total non-Appalachian divisions to address the second purpose of the study. </p> <p align=\"center\">RESULTS </p> <p>Socioeconomic status and attendance rates were found to be the independent variables that were significantly able to predict on-time educational attainment rates. Socioeconomic status rates were found to be significantly higher in the Appalachian divisions than in the non-Appalachian large school divisions. Teacher qualification rates were found to be significantly higher in the Appalachian divisions than the non-Appalachian divisions of similar size. On-time educational attainment rates were found to be significantly higher in the Appalachian school divisions than in all three classifications of the non-Appalachian divisions. </p> </body> </html>",
  "description_provenance": [
    "Author Email: kevins70@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: jcraig44@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:37Z (GMT). No. of bitstreams: 1 Siers_ETD.pdf: 1179481 bytes, checksum: f43f3d3d4e3123a4ebf530bb74e25c4e (MD5)   Previous issue date: 2010-04-01"
  ],
  "handle": "26861",
  "identifier_other": "etd-04142010-162628",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142010-162628/",
  "identifier_uri": "http://hdl.handle.net/10919/26861",
  "publisher": "Virginia Tech",
  "relation_haspart": "Siers_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Appalachian School Divisions",
    "Non-Appalachian School Divisions",
    "Non-Appalachian School Divisions of Similar Size",
    "Non-Appalachian Large School Divisions",
    "On-Time Educational Attainment",
    "and 9th Grade Bubble"
  ],
  "title": "A Descriptive Statistical Analysis of the Relationships Between Socioeconomic Status, Attendance Rates, Per Pupil Expenditures, Teacher Qualifications, and On-Time Educational Attainment Rates within the State of Virginia Including a Comparative Study of the Appalachian and Non-Appalachian School Division",
  "type": "Dissertation"
}