{
  "contributor_author": "Lane, Crystal Lynn Duncan",
  "contributor_committeechair": "Meszaros, Peggy S.",
  "contributor_committeemember": [
    "Allen, Katherine R.",
    "Few-Demo, April L.",
    "Piercy, Fred P.",
    "Savla, Jyoti S."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:38Z",
  "date_adate": "2011-05-06",
  "date_available": "2014-03-14T20:09:38Z",
  "date_issued": "2011-04-04",
  "date_rdate": "2011-05-06",
  "date_sdate": "2011-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Resilience is one of the most important biopsychosocial concepts in contemporary social science. It may mediate the impact of adversity on family health, and be a potential location for intervention. There is a need for conceiving of the mechanisms within families that impact their health throughout the life cycle, including the investigation of how they handle illness. One framework that may assist in this is Walsh창  s family resilience framework. Previous attempts to create an empirical measure of this framework have serious issues with validity. The purpose of this study is to create a reliable and valid instrument that investigates Walsh창  s framework from the view of women who have been diagnosed with breast cancer. The study uses feminist theory to emphasize a pluralistic application of family systems theory in the understanding and promotion of the experience of women, the promotion of all families over one family type, and the concept of intersectionality.   A non-experimental quantitative design is used to develop a reliable and valid instrument that investigates Walsh창  s framework. A pilot study addressed the creation and revision of the Family Resilience Assessment (FRA), and a main study tested the revised FRA for emergent factors and model fit. Results indicate excellent reliability and beginning content, construct, and convergent validity. Analyses produced a better fitting model that replaces three latent variables with one and correlates two of the nine framework indicators.   These preliminary analyses demonstrate that the FRA may be a valuable instrument with replication with larger samples and further revisions needed. Results further indicate that Walsh창  s framework is a sound method for conceiving of and better understanding family resilience. The framework may also be one way to study the mediating impact of family resilience on family health.",
  "description_provenance": [
    "Author Email: silverwaters@vt.edu",
    "Advisor Email: meszaros@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: alfew@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: jsavla@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:38Z (GMT). No. of bitstreams: 2 Duncan_Lane_FairUse.pdf: 47400 bytes, checksum: 47ffd8cacd9bf6fca8ecd383970777ab (MD5) DuncanLane_CL_D_2011_1.pdf: 1918492 bytes, checksum: 7d9dbdb03d8da52dda1c2c1c8e95323a (MD5)   Previous issue date: 2011-04-04"
  ],
  "handle": "26863",
  "identifier_other": "etd-04142011-130936",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142011-130936/",
  "identifier_uri": "http://hdl.handle.net/10919/26863",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Duncan_Lane_FairUse.pdf",
    "DuncanLane_CL_D_2011_1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "breast cancer",
    "feminist",
    "instrument",
    "family resilience",
    "family health"
  ],
  "title": "Tracing the Pink Ribbon: Development of a Family Resilience Measure",
  "type": "Dissertation"
}