{
  "contributor_author": "Khasu, Denis  Stanislaus",
  "contributor_committeechair": "Barksdale, Mary Alice",
  "contributor_committeemember": [
    "Brand, Brenda R.",
    "Doolittle, Peter E.",
    "Niles, Jerome A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:37Z",
  "date_adate": "2011-05-03",
  "date_available": "2014-03-14T20:09:37Z",
  "date_issued": "2011-03-22",
  "date_rdate": "2011-05-03",
  "date_sdate": "2011-04-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated the use of storytelling in order to support children창  s emergent literacy in Malawi창  s resource deprived Community Based Childcare Centers (CBCCs).  It focused on the professional development of four caregivers from four CBCCs following a Formative and Design Experiment model, and using qualitative methods of inquiry.  The professional development on storytelling was designed following an informative two-week observation period.  Following the observation, a daylong professional development was organized to train the caregivers.  In the seven-week intervention period that followed the professional development, the main focus of the study was on the perceptions of the caregivers about their participation in a professional development on storytelling in CBCCs, their responses to using storytelling, and their perceptions about children창  s responses to using storytelling in CBCCs. Data that informed the study comprised caregivers창   reflective notes in their journals, individual caregiver weekly interviews, weekly focus group discussions, and research reflective field notes that were collected over seven weeks after the professional development. Findings suggested that the four caregivers found the professional development beneficial to them all.  However, out of the four caregivers, three of them and their respective children demonstrated benefit from storytelling, growth in knowledge and development of storytelling skills.  The three caregivers reported becoming more connected with the children, understood them better, found storytelling to be a teaching approach, and felt that their teaching was made easier and enjoyable.  The children taught by these three caregivers enjoyed their learning and even resourced stories from their communities.  They too, became storytellers.  In the end, the caregivers felt that they were ready to share their experiences with other caregivers in Zomba District in Malawi.  These findings suggest that storytelling could be used in support of emergent literacy at a larger scale, as well as serve as springboard for pedagogical training of the caregivers culminating in the development of locally available teaching and learning resources in the Malawian CBCC.",
  "description_provenance": [
    "Author Email: dkhasu@vt.edu",
    "Advisor Email: bbrand@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: mbarksda@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:37Z (GMT). No. of bitstreams: 3 Khasu_DS_D_2011.pdf: 17559066 bytes, checksum: 396091a55d844879ad27f73ce0b79ae5 (MD5) Denis_Khasu_copyright_permission.rtf: 2608 bytes, checksum: be58696c6a25a472477ad5aa71436a64 (MD5) Revised_IRB.pdf: 138255 bytes, checksum: e20b3e50e9b75634697ec39f13ad14ca (MD5)   Previous issue date: 2011-03-22"
  ],
  "handle": "26862",
  "identifier_other": "etd-04142011-082653",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04142011-082653/",
  "identifier_uri": "http://hdl.handle.net/10919/26862",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Khasu_DS_D_2011.pdf",
    "Denis_Khasu_copyright_permission.rtf",
    "Revised_IRB.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "storytelling",
    "formative and design experiments",
    "professional development",
    "emergent literacy",
    "community based childcare centers"
  ],
  "title": "Storytelling in Emergent Literacy: Supporting Community Based Childcare Centers in Malawi",
  "type": "Dissertation"
}