{
  "contributor_author": "Guay, Jennifer Fincham",
  "contributor_committeechair": "Fontenot, Joseph P.",
  "contributor_committeemember": [
    "Neel, James P. S.",
    "Abaye, Azenegashe Ozzie",
    "Wahlberg, Mark L.",
    "Clapham, William M.",
    "Herbein, Joseph H. Jr.",
    "Swecker, William S. Jr."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:09:40Z",
  "date_adate": "2005-04-18",
  "date_available": "2014-03-14T20:09:40Z",
  "date_issued": "2005-04-06",
  "date_rdate": "2010-10-13",
  "date_sdate": "2005-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<!doctype html public \"-//w3c//dtd html 4.0 transitional//en\"> <html> <head>    <meta name=\"GENERATOR\" content=\"Mozilla/4.7 [en] (WinNT; I) [Netscape]\"> </head> <body>   <font face=\"Times New Roman,Times\">  An experiment was conducted to evaluate the effects of pasture finishing versus high-concentrate finishing, over time, on fatty acid metabolism in Angus crossbred (n = 24) beef steers.  Ruminal fluid, serum, and adipose tissue biposies were obtained on d 0, 28, 84, and 140.  Pasture forages and diet ingredient samples were obtained at 14 d intervals to determine nutritive value and fatty acid composition.  The high-concentrate diet consisted of corn silage, cracked corn, soybean meal, and a vitamin and mineral supplement.  The pasture-finished steers grazed sequentially on triticale (Triticale hexaploide)/annual ryegrass (Lolium multiflorum), alfalfa (Medicago sativa)/orchardgrass (Dactylis glomerata), and a cool-season grass/legume mixture.</font><font face=\"Times New Roman,Times\"></font> <p><font face=\"Times New Roman,Times\">    The high-concentrate diet consisted of 57 % linoleic acid and 7 % linolenic acid (of total fatty acids).  The pasture forages contained an average 9 % linoleic acid and 66 % linolenic acid (of total fatty acids).</font><font face=\"Times New Roman,Times\"></font> <p><font face=\"Times New Roman,Times\">    Adipose tissue concentrations of 18:2 cis-9, trans-11 CLA were higher (P < 0.05) in the pasture-finished steers than high-concentrate finished steers.  Concentrations of 18:2 cis-9, trans-11 CLA declined in the high-concentrate finished steers (P < 0.05) from d 0 to 28 and d 28 to 84.  In the pasture-finished steers concentrations peaked (P < 0.10) on d 28, and remained high throughout the duration of the study.</font><font face=\"Times New Roman,Times\"></font> <p><font face=\"Times New Roman,Times\">    Concentrations of linolenic acid were higher (P < 0.05) in adipose tissue, ruminal fluid, and serum of the pasture-finished steers, compared to the high-concentrate finished steers.  In the pasture-finished steers linolenic acid concentrations peaked (P < 0.05) on d 28, and remained high throughout the study.  Concentrations of linolenic acid gradually decreased (P < 0.05) over time within the high-concentrate finished steers.  Thus, it appears that only a short time is needed to alter the omega-3 and CLA composition of adipose tissue in cattle finished on pasture.</font> <br>  </body> </html>",
  "description_provenance": [
    "Author Email: jfincham@vt.edu",
    "Advisor Email: cotton@vt.edu",
    "Advisor Email: cajunjoe@vt.edu",
    "Advisor Email: wahlberg@vt.edu",
    "Advisor Email: herbeinj@vt.edu",
    "Advisor Email: cvmwss@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:40Z (GMT). No. of bitstreams: 1 jfgdissertation.pdf: 3175978 bytes, checksum: e92d5b3470faf30bc418032be3993001 (MD5)   Previous issue date: 2005-04-06"
  ],
  "handle": "26872",
  "identifier_other": "etd-04152005-101906",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152005-101906/",
  "identifier_uri": "http://hdl.handle.net/10919/26872",
  "publisher": "Virginia Tech",
  "relation_haspart": "jfgdissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Fatty Acids",
    "Conjugated Linoleic Acid",
    "Pasture-finished beef",
    "Time on Feed"
  ],
  "title": "Fatty Acid Composition of Diets, Metabolism, and Deposition in Subcutaneous Adipose Tissue of Pasture and Feedlot Finished Cattle",
  "type": "Dissertation"
}