{
  "contributor_author": "Rosypal, Alexa C.",
  "contributor_committeechair": "Lindsay, David S.",
  "contributor_committeecochair": "Zajac, Anne M.",
  "contributor_committeemember": [
    "Frank, Glenn",
    "Troy, Gregory C.",
    "Gogal, Robert M. Jr.",
    "Duncan, Robert B. Jr."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:09:40Z",
  "date_adate": "2005-04-15",
  "date_available": "2014-03-14T20:09:40Z",
  "date_issued": "2005-04-06",
  "date_rdate": "2005-04-15",
  "date_sdate": "2005-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Leishmania infantum, an etiologic agent of zoonotic visceral leishmaniasis, has recently emerged in the foxhound population in the United States and parts of Canada. Leishmania infections are usually spread to mammals by infected sand flies, however epidemiological data do not support a role for sand fly transmission in North America. The purpose of this work was to isolate and characterize L. infantum from a naturally infected foxhound from Virginia (LIVT-1 isolate). A mouse model of North American leishmaniasis was developed using immunocompetent and genetically immunodeficient mouse strains infected with LIVT-1 promastigotes by different inoculation routes. The intravenous route of infection was superior to the subcutaneous route for inducing consistent experimental infections and mice lacking interferon gamma, inducible nitric oxide synthase, or B-cells were resistant to clinical disease. Experimental infections in dogs were performed to examine the infectivity, immune responses, and pathogenicity of LIVT-1. Experimentally infected dogs developed parasitologically proven infections and a range of clinical manifestations that were similar to those observed in naturally occurring disease.  Diagnostic tests including culture and cytologic evaluation of bone marrow and lymph node aspirates, polymerase chain reaction, and serology by indirect fluorescent antibody test, and recombinant K39 (rK39) immunoassay were evaluated.  Kappa statistics revealed that PCR had the highest level of agreement with culture and cytology results although the rK39 dipstick assay consistently identified more experimentally infected dogs. Flow cytometry revealed no significant differences (p>0.05) in CD4+ or CD8+ expression on peripheral blood lymphocytes. Alternate transmission mechanisms in experimentally inoculated mice and dogs were investigated. PCR revealed a low level of vertical and direct transmission of LIVT-1 in inoculated BALB/c mice. Leishmania DNA was detectable by PCR in tissues from puppies from a LIVT-1 infected beagle. Although the strain of L. infantum infecting foxhounds in North America appears to predominantly use a non-vector transmission mode, the disease it produces is similar to canine leishmaniasis in other parts of the world.  Non-sand fly transmission may be responsible for maintaining infections in the foxhound population.  Results from this work will lead to improvement in diagnosis, clinical management, and control of canine leishmaniasis in North America.",
  "description_provenance": [
    "Author Email: arosypal@vt.edu",
    "Advisor Email: gfrank@heska.com",
    "Advisor Email: azajac@vt.edu",
    "Advisor Email: cvmgct@vt.edu",
    "Advisor Email: rogogal@vt.edu",
    "Advisor Email: duncanr@vt.edu",
    "Advisor Email: lindsayd@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:40Z (GMT). No. of bitstreams: 1 Rosypaldissertation.pdf: 7641132 bytes, checksum: ecdcd5304aa8cea76350c7f36bcdb9f7 (MD5)   Previous issue date: 2005-04-06"
  ],
  "handle": "26873",
  "identifier_other": "etd-04152005-104125",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152005-104125/",
  "identifier_uri": "http://hdl.handle.net/10919/26873",
  "publisher": "Virginia Tech",
  "relation_haspart": "Rosypaldissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Leishmania infantum",
    "dog",
    "diagnosis",
    "transmission",
    "infection",
    "North America"
  ],
  "title": "Characterization of Canine Leishmaniasis in the United States: Pathogenesis, Immunological Responses, and Transmission of an American Isolate of Leishmania infantum",
  "type": "Dissertation"
}