{
  "contributor_author": "Roberts, Ann  Mary",
  "contributor_committeechair": "Hicks, David",
  "contributor_committeemember": [
    "Kelly, Patricia Proudfoot",
    "Triplett, Cheri F.",
    "Niles, Jerome A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:41Z",
  "date_adate": "2009-06-15",
  "date_available": "2014-03-14T20:09:41Z",
  "date_issued": "2009-04-02",
  "date_rdate": "2009-06-15",
  "date_sdate": "2009-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The goal of this study was to determine what factors influence teachers in their use of discussion in the social studies classroom. I interviewed two middle school teachers and made classroom observations over a three month period. These teachers believed discussion was an important process for students to gain critical thinking and citizenship skills. These teachers believed they were conducting discussions but in fact were often conducting what Nystrand et al. (2003) termed recitation, in which students respond to questions and the teacher validates the response. The disconnect between belief and practice may be the result of a combination factors, including a lack of teacher facilitation skills, the timing of the research, and the tensions caused by the state curriculum standards.",
  "description_provenance": [
    "Author Email: aroberts@radford.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: cftriplet@radford.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: hicks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:41Z (GMT). No. of bitstreams: 1 Ann_Mary_Roberts_FINAL_Dissertation6_09.pdf: 2953878 bytes, checksum: fc01f066d0d852a65879d96452e3c25c (MD5)   Previous issue date: 2009-04-02"
  ],
  "handle": "26876",
  "identifier_other": "etd-04152009-150221",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152009-150221/",
  "identifier_uri": "http://hdl.handle.net/10919/26876",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ann_Mary_Roberts_FINAL_Dissertation6_09.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Discussion",
    "Social Studies",
    "Citizenship",
    "Standards",
    "Middle School"
  ],
  "title": "In Search of Discussion in the Standards-Based Middle School Social Studies Classroom",
  "type": "Dissertation"
}