{
  "contributor_author": "Price-Rhodes, Melony  Anne",
  "contributor_committeechair": "Dudley, Larkin S.",
  "contributor_committeemember": [
    "Wolf, James F.",
    "Khademian, Anne Meredith",
    "Dull, Matthew Martin"
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:09:41Z",
  "date_adate": "2009-05-04",
  "date_available": "2014-03-14T20:09:41Z",
  "date_issued": "2009-04-03",
  "date_rdate": "2009-05-04",
  "date_sdate": "2009-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Because of on-going reform efforts, rapidly changing business environments, and increasing demands for government services while reducing expenditures, organizations realize government is challenged with social welfare problems that cannot be effectively tackled utilizing our traditional bureaucratic structures.  Organizations must work across traditional organizational boundaries to implement reform efforts that reduce the size of government, operate more efficiently, reduce fiscal stress, and employ market-like mechanisms.  Government reform efforts are not new; universities, to include Virginia Tech, play a large role in reform activities.  Also playing a prominent role in government reform efforts are contractual relationships; these relationships continue to increase.  Virginia Tech, through the implementation of the Federal Reimbursement Unit (FRU), has had a long-term contractual relationship with a local government in implementing government reform, specifically in the implementation of a unique model program to maximize local revenues to finance a child welfare program.  The goal of the program is to use less county tax dollars to support children in foster care, and provide a seamless process in maximizing resources from federal entitlement and state programs.  While contracts have played a major role in reform efforts for many decades, long-term contract relationships are not fully explored in the literature.  There is much more to learn about the relationships, and their role in reform, specifically how contracts evolve over time.  Using a single case study design, this research explored the evolution of a long-term contract involving collaborative activities between a state university and a local county through the implementation of this unique model program.  Interviews provided the primary method of data collection with experts in the child welfare field.  The research explored key factors in the model program that led to the implementation and evolution of the contract with a focus on selected elements of the popular New Public Management (NPM) form of governance and interagency collaboration.    The results identify multiple collaborative and selected NPM elements that existed in the implementation and subsequent evolution of the contract.  These selected elements may not be present in other long-term contracts; however they played a significant role in the implementation and evolution in this research.",
  "description_provenance": [
    "Author Email: mpricerh@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: humpty@vt.edu",
    "Advisor Email: akhademi@vt.edu",
    "Advisor Email: mdull@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:41Z (GMT). No. of bitstreams: 1 MAPRDissertationApril2009.pdf: 546735 bytes, checksum: abe180e8cdb8c49c94fa9974a4c49c99 (MD5)   Previous issue date: 2009-04-03"
  ],
  "handle": "26877",
  "identifier_other": "etd-04152009-153726",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152009-153726/",
  "identifier_uri": "http://hdl.handle.net/10919/26877",
  "publisher": "Virginia Tech",
  "relation_haspart": "MAPRDissertationApril2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Child Welfare Financing",
    "Collaboration",
    "New Public Management",
    "Interagency Public Policy",
    "Contracting"
  ],
  "title": "From Collaborative Creation to Implementation:  The Evolution of a Contract for a Model Program to Finance Child Welfare",
  "type": "Dissertation"
}