{
  "contributor_author": "Cheatham, Amy Kathleen",
  "contributor_committeechair": "Boardman, Gregory D.",
  "contributor_committeemember": [
    "Love, Nancy G.",
    "Flick, George J. Jr.",
    "Craig, Steven R."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:09:41Z",
  "date_adate": "2009-05-06",
  "date_available": "2014-03-14T20:09:41Z",
  "date_issued": "2009-01-27",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As in any animal production industry, disease is inevitable; therefore, it is imperative that aquaculturists are able to effectively manage the disease and maintain their high production levels in an effort to bridge the gap between supply and demand in the seafood industry that has been caused in part by global over-fishing. This management responsibility lies not only in understanding the impact of the treatment on the cultured species, but also in understanding the impact of the treatment to the aquaculture system as an ecosystem. Currently, there is a narrow variety of chemicals approved by either the Food and Drug Administration (FDA) or the Environmental Protection Agency (EPA) for the treatment of disease outbreaks and water quality issues in aquaculture. Approved chemotherapeutants include oxytetracycline, Romet-30®, copper, and formalin. Additionally, a number of chemicals, such as Chloramine-T and potassium permanganate, are used off-label for the treatment of aquaculture systems. In this research, these six more commonly used chemotherapeutants were analyzed for their impacts to the nitrifying bacteria in aquaculture systems. <p> It was found that three of the chemotherapeutants: oxytetracycline, Romet-30®, and chelated copper caused inhibition to the nitrifying bacteria at the whole cell level as demonstrated in the results from water quality and specific oxygen uptake rate analyses. The nitrification process resumed once the chemotherapeutant was removed from the system, either by a mandatory water change or by natural degradation. The other three chemicals: formalin, Chloramine-T, and potassium permanganate did not result in any significant inhibition to the nitrification process. Experiments on laboratory-cultured nitrifying bacteria confirmed these findings. These experiments also resulted in the observation that the expression of amoA was upregulated by the copper exposure and inhibited by oxytetracycline and Romet-30®, but began to resume as the antibiotics degraded. Comprehensively, the findings of these analyses demonstrated that, although nitrifiers are well-known to be sensitive to their environment, the ability of nitrifying bacteria to continue their oxidative processes following exposure to chemical stress is inherent to the bacteria themselves rather than simply occurring under the protection of a biofilm community as has been suggested.",
  "description_provenance": [
    "Author Email: acheatha@vt.edu",
    "Advisor Email: nglove@umich.edu",
    "Advisor Email: flickg@vt.edu",
    "Advisor Email: SCraig@virginiacobiafarms.biz",
    "Advisor Email: gboard@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:41Z (GMT). No. of bitstreams: 1 Dissertation_Cheatham.pdf: 2003697 bytes, checksum: 4c3428c1a6b52ead8e42f4f684ea32e3 (MD5)   Previous issue date: 2009-01-27"
  ],
  "handle": "26879",
  "identifier_other": "etd-04152009-221135",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152009-221135/",
  "identifier_uri": "http://hdl.handle.net/10919/26879",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Cheatham.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "nitrifying bacteria",
    "aquaculture",
    "nitrification",
    "chemotherapeutants"
  ],
  "title": "Responses of Nitrifying Bacteria to Aquaculture Chemotherapeutic Agents",
  "type": "Dissertation"
}