{
  "contributor_author": "Stevens, Suzanne L.",
  "contributor_committeechair": "Smith-Jackson, Tonya L.",
  "contributor_committeemember": [
    "Beaton, Robert J.",
    "Kleiner, Brian M.",
    "Dingus, Thomas A.",
    "Geller, E. Scott"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:40Z",
  "date_adate": "2003-04-22",
  "date_available": "2014-03-14T20:09:40Z",
  "date_issued": "2003-04-11",
  "date_rdate": "2004-04-22",
  "date_sdate": "2003-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Motor vehicle crashes are the leading cause of unintentional injury-related death among children ages 14 and under and of these children who were fatally injured more that 60 % were not using safety restraints at the time of the collision.  Children who are too large for child safety seats are often restrained improperly or not at all.  In addition, many children are being shifted from child safety seats to adult safety belts prematurely.  For proper protection, children who have outgrown child safety seats require booster seats combined with vehicle lap/shoulder belts.  A booster seat raises a child up so that the lap and shoulder belts fit properly.   <p> The current research went through a systematic approach, from several perspectives, to develop an effective pamphlet to increase behavioral compliance of purchasing a booster seat.  The pamphlet developed throughout these studies had a substantial and positive effect on intention and perceived control as well as a meaningful and substantial impact on actual purchase behavior.  In addition, the associated guidelines that were developed allow others to produce effective printed educational materials.  This research consisted of five studies described below. <p> Study 1 consisted of 43 subject matter experts who were used to determine pertinent information that should be included in a complete booster seat pamphlet.  Nine of the 20 items showed significance and were included in the first iteration of the pamphlet.  Study 2 consisted of 5 parents of children who should be in booster seats and were not at the time of the study, evaluated the usability of the first iteration pamphlet.  A total of 18 items were changed in the pamphlet and a subsequent second iteration of the pamphlet was developed.   <p> Study 3 consisted of 30 parents of children who should be in booster seats and were not at the time of the study, were used to assess the comprehensibility (Cloze test), hazard-risk judgments (carefulness ratings), and understandability (questionnaire) of three booster seat pamphlets.  Significance was found for the second iteration pamphlet in both comprehensibility and understandability, but no significance was found in risk perception.  Study 4 consisted of 8 human factors graduate students who were used to assess the reading level (SMOG test), instructional design and inclusion of learning principles (BIDS-3 test), and readability (RAINS test) of three booster seat pamphlets.  The second iteration pamphlet and two existing industry pamphlets were used in Studies 3 and 4 and significance was found for the second iteration pamphlet in both instructional design and learning principles as well as readability and was the only pamphlet to have a reading level under 8th grade.  Subsequent to these studies a third iteration of the new pamphlet was developed.   <p> Study 5 consisted of 45 parents of children who should be in booster seats and were not at the time of the study. Three booster seat pamphlets, two from the child passenger safety industry and the third iteration pamphlet were used as treatments (15 participants per group).  Effectiveness of the intervention was tested by assessing three variables, intent to purchase (revealed that when intent was high purchase was high), perceived control of purchasing (revealed that when perceived control was high purchase was high), and actual purchase behavior (third iteration pamphlet showed a significantly higher purchase rate than the industry pamphlets).  Of the 19 participants who purchased a booster seat, there were 12 (63%) in the third iteration pamphlet group, 2 (11%) in the alternate 1 pamphlet group, and 5 (26%) in the alternate 2 pamphlet group, and 100% of those who purchased, reported that they use them each time their child rides in a vehicle. This research increased our understanding of information design and well as generating general design guidelines for pamphlets. In addition, this research produced a pamphlet for credible sources to use as an education tool for parents who have children who should be in booster seats and are not placed in them when riding in a vehicle.",
  "description_provenance": [
    "Author Email: sstevens@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: bobb@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: tomd@vtti.vt.edu",
    "Advisor Email: esgeller@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:40Z (GMT). No. of bitstreams: 1 S_Stevens_Dissertation.pdf: 5098203 bytes, checksum: a9061ad5c98423c39c2e478622cd0fab (MD5)   Previous issue date: 2003-04-11"
  ],
  "handle": "26870",
  "identifier_other": "etd-04152003-194333",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152003-194333/",
  "identifier_uri": "http://hdl.handle.net/10919/26870",
  "publisher": "Virginia Tech",
  "relation_haspart": "S_Stevens_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "pamphlets",
    "printed educational material",
    "booster seats",
    "purchase behavior",
    "risk perception",
    "child safety seats",
    "child passenger safety"
  ],
  "title": "Developing Guidelines for Designing Child Safety Printed Educational Materials: A User-Centered Approach",
  "type": "Dissertation"
}