{
  "contributor_author": "Howard-Bostic, Chiquita DaJuan",
  "contributor_committeechair": "Bailey, Carol A.",
  "contributor_committeemember": [
    "Hawdon, James E.",
    "Graves, Ellington T.",
    "Kiecolt, K. Jill"
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:09:42Z",
  "date_adate": "2011-05-17",
  "date_available": "2014-03-14T20:09:42Z",
  "date_issued": "2011-04-05",
  "date_rdate": "2011-05-17",
  "date_sdate": "2011-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to explore womenâ  s dual experiences of intimate partner violence (IPV) to examine whether their motivations fit the current framework on four types of IPV in light of Johnsonâ  s typology, which includes: violent resistance (VR), situational couple violence (SCV), mutual violent combat (MVC), and intimate terrorism (IT) (Kelly and Johnson 2008). I applied these types of IPV to describe womenâ  s physical aggression, control, and emotional responses experienced and performed during IPV. Johnsonâ  s typology classified six of 10 participant experiences; to describe the remaining four, I applied blended types of IPV. Findings in this study indicated that VR and SCV overlooked womenâ  s use of controlling physical aggression; this study identified alternative concepts and additional dimensions of control and resistance, and introduced tempered violence resistance (TVR), a new IPV type to describe womenâ  s use of controlling physical aggression during protective violence. Correspondingly, findings also indicated that interpretations of physical aggression and control in MVC and IT did not consider wide-ranging degrees of control such as self-control, situational control, and partner control. Hence, distinctions between SCV or MVC and MVC or IT were limited by vague interpretations of control. Furthermore, VR, MVC, and IT did not fully describe womenâ  s emotional responses. These types of violence focused solely on the context of physical aggression and control, which minimized perceptions of conflict and omitted reported samples of motivations. Forthcoming studies applying Johnsonâ  s typology should include external contexts of relationship conflict and consider multiple types control and dimensions of resistance.",
  "description_provenance": [
    "Author Email: chhoward@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: hawdonj@vt.edu",
    "Advisor Email: egraves@vt.edu",
    "Advisor Email: kiecolt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:42Z (GMT). No. of bitstreams: 2 Howard-Bostic_CD_D_2011.pdf: 1475996 bytes, checksum: fa19e762594ba8cc55be6a82c6d08541 (MD5) IRB_APPROVAL.pdf: 46965 bytes, checksum: ef6c5a77580859ff6c5e16bf2d05eab5 (MD5)   Previous issue date: 2011-04-05"
  ],
  "handle": "26886",
  "identifier_other": "etd-04152011-013914",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152011-013914/",
  "identifier_uri": "http://hdl.handle.net/10919/26886",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Howard-Bostic_CD_D_2011.pdf",
    "IRB_APPROVAL.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mutual violent combat",
    "situational couple violence",
    "violent resistance",
    "intimate terrorism",
    "female perpetrators",
    "intimate partner violence"
  ],
  "title": "A Qualitative Analysis of Intimate Partner Violence",
  "type": "Dissertation"
}