{
  "contributor_author": "Redbird, Ruth Ann",
  "contributor_committeechair": "Kennelly, Peter J.",
  "contributor_committeemember": [
    "Helm, Richard Frederick",
    "Prater, Mary Renee",
    "Mahaney, James M."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:09:42Z",
  "date_adate": "2010-05-04",
  "date_available": "2014-03-14T20:09:42Z",
  "date_issued": "2010-04-01",
  "date_rdate": "2012-04-12",
  "date_sdate": "2010-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Living organisms rely on many different mechanisms to adapt to changes within their environment. Protein phosphorylation and dephosphorylation events are one such way cells can communicate to generate a response to environmental changes. In the Kennelly laboratory we hope to gain insight on phosphorylation events in the domain Archaea through the study of the acidothermophilic organism Sulfolobus solfataricus. Such findings may provide answers into evolutionary relationships and facilitate an understanding of phosphate transfer via proteins in more elaborate systems where pathway disturbances can lead to disease processes. <p> A λ-phage expression library was generated from S. solfataricus genomic DNA. The immobilized expression products were probed with a purified protein kinase, SsoPK4, and radiolabeled ATP to identify potential native substrates. A protein fragment of the ORF sso0563, the catalytic A-type ATPase subunit A (AtpA), was phosphorylated by SsoPK4. Full length and truncated forms of AtpA were overexpressed in E. coli. Additional subunits of the ATPase were also overexpressed and ATPase activity reconstituted in vitro. Phosphoamino acid analysis and MS identified the phosphorylation sites on AtpA. Several variants of AtpA were derived via site-directed mutagenesis and assayed for ATPase activity. Chemical cross-linking was employed to determine possible ATPase subunit interactions; tryptic digests of AtpA and its mutant variants were performed to examine protein folding. The phosphorylated-mimic variant of AtpA, T98D, resulted in an inactive ATPase complex as determined by ATPase activity assays and native-PAGE indicating potential phosphoregulation by SsoPK4 on enzyme activity. Ultimately, any findings would need verification with in vivo studies.",
  "description_provenance": [
    "Author Email: redbird@vt.edu",
    "Advisor Email: helmrf@vt.edu",
    "Advisor Email: pjkennel@vt.edu",
    "Advisor Email: mrprater@vt.edu",
    "Advisor Email: jmahaney@vcom.vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:42Z (GMT). No. of bitstreams: 2 Redbird_RA_D_2010_Copyright.pdf: 2634227 bytes, checksum: 33a1ef1c4f4c92a69d18c72006b25f25 (MD5) Redbird_RA_D_2010.pdf: 5186301 bytes, checksum: 2294d4706962ae19aa8911e878f89f51 (MD5)   Previous issue date: 2010-04-01"
  ],
  "handle": "26884",
  "identifier_other": "etd-04152010-143128",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152010-143128/",
  "identifier_uri": "http://hdl.handle.net/10919/26884",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Redbird_RA_D_2010_Copyright.pdf",
    "Redbird_RA_D_2010.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Archaea",
    "ATP Synthase",
    "phosphorylation",
    "protein kinase"
  ],
  "title": "Identification of a protein kinase substrate in Sulfolobus solfataricus P2",
  "type": "Dissertation"
}