{
  "contributor_author": "Kim, Hyung  Nam",
  "contributor_committeechair": "Smith-Jackson, Tonya L.",
  "contributor_committeemember": [
    "Bohn, Jan Helge",
    "Kleiner, Brian M.",
    "Nam, Chang Soo",
    "Terpenny, Janis P."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:41Z",
  "date_adate": "2010-05-06",
  "date_available": "2014-03-14T20:09:41Z",
  "date_issued": "2010-04-02",
  "date_rdate": "2010-05-06",
  "date_sdate": "2010-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Many people have visual impairment and make up a population that is increasing each year. Haptic technology is often used to assist members of this population by providing a way of understanding visual information. Although haptic technology is relatively new, it is widely applied across a variety of domains (research and industry). However, a great number of users are dissatisfied with their assistive technology applications. Unfortunately, such dissatisfaction is likely to cause abandonment of the technology devices. In particular, recent research shows that the adoption rate of haptic technology is low. Discontinuing the use of assistive technology devices ultimately results in a waste of time, money, freedom, and reduced function for individuals with disabilities. Of all the factors that lead to abandonment, the most significant is the failure to meet user needs. Whether existing design approaches properly reflect assistive technology user needs should be explored, especially for haptic technology.    Existing design approaches have rarely considered the heterogeneous needs of users in the same disability category (i.e., visual disability). Most previous studies on assistive technology have been oriented towards those with total blindness as opposed to those with residual vision (also referred to as low vision). In addition, researchers have paid less attention to older adults with low vision in terms of individual differences in haptic user interface (HUI) needs. There is also some doubt about the applicability of existing design approaches in such design contexts as users with visual disabilities using haptic user interfaces.   The aim of this research was to investigate individual differences in usersâ   capabilities in the haptic modality and user needs in HUIs. Particularly, age-related and vision-related individual differences were explored. Another aim was to develop a more accessible design approach applicable to users with visual disabilities and HUIs.    The magnitude estimation technique was employed to examine how participants (classified by vision and age) perceive the same objective stimulus, such as haptic perception, differently. Brain plasticity theory was primarily applied to modify the existing design approach, PICTIVE. The effectiveness of modified and original PICTIVE methods was investigated in terms of the frequency of statements, gestures, satisfaction, and time to complete a given design task. HUI user needs were elicited from participants and were analyzed to understand age-related and vision-related individual differences.  It was found that the haptic perception of the same objective stimulus was not significantly different between younger and older participants with low vision. The two age groupsâ   overall preferences for a set of HUI user needs were not significantly different. In addition, the haptic perception of the same objective stimulus was not significantly different between sighted participants and those with low vision. The two vision groupsâ   overall preferences on a set of HUI user needs were not significantly different as well. The two design methods resulted in significantly different outcomes. First, participants in the modified PICTIVE method made a significantly higher number of statements. Second, participants in the modified PICTIVE method showed a significantly higher number of gestures. Third, participants in the modified PICTIVE method took significantly more time because they had more design ideas to deliver. Last, both groups were satisfied with a given design method.  In short, the research outcomes contribute to the advancement of knowledge and understanding of more â  usableâ   accessibility for users with visual impairment and a more â  accessibleâ   participatory design approach to nontraditional user interfaces (i.e., haptic user interfaces) for users with visual impairment.",
  "description_provenance": [
    "Author Email: hykim7@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: bohn@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: cnam@uark.edu",
    "Advisor Email: terpenny@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:41Z (GMT). No. of bitstreams: 1 HNKim-Dissertation.pdf: 4874931 bytes, checksum: 498ce8b124b9c01864ffe7a4e613722d (MD5)   Previous issue date: 2010-04-02"
  ],
  "handle": "26880",
  "identifier_other": "etd-04152010-092642",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152010-092642/",
  "identifier_uri": "http://hdl.handle.net/10919/26880",
  "publisher": "Virginia Tech",
  "relation_haspart": "HNKim-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "visual impairment",
    "accessibility",
    "usability",
    "haptic user interfaces",
    "design approach"
  ],
  "title": "Usable Accessibility and Haptic User Interface Design Approach",
  "type": "Dissertation"
}