{
  "contributor_author": "Buck, Vinodini",
  "contributor_committeechair": "O'Keefe, Sean F.",
  "contributor_committeemember": [
    "Zhou, Kequan Kevin",
    "Duncan, Susan E.",
    "Davis, Richey M."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:09:41Z",
  "date_adate": "2010-05-05",
  "date_available": "2014-03-14T20:09:41Z",
  "date_issued": "2010-04-12",
  "date_rdate": "2012-04-27",
  "date_sdate": "2010-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Fat bloom in chocolates is the gray-white discoloration and dullness that can occur on the surface of the confectionery. Fat bloom is a common quality defect that can result from temperature fluctuations during storage. Chocolates candies with peanuts or other nut fillings are more prone to fat bloom compared to plain chocolates, due to a release of incompatible nut oils into the chocolate matrix. The overall goal of this study was to determine if differences in triacylglycerol (TAG) composition and rheological properties of high, medium, and normal oleic peanuts influence fat bloom formation. All three peanut varieties showed high concentrations of triolein. Normal oleic peanuts had a slightly higher trilinolein than high and medium oleic peanuts, which contained trilinolein in trace amounts. Peanut pastes from the three peanut varieties all had a minimum apparent yield stress, and all pastes showed varying degrees of shear thinning. The apparent yield stress of high and normal oleic pastes was higher than the apparent yield stress of medium oleic paste. The absolute value of the flow index behavior was 1 for the high oleic peanut paste, suggesting friction in the experimental apparatus, even with use of Teflon plates. The peanut chocolate candies took around 45 days for significant dulling of the chocolates with temperature cycling between 26-29 °C approximately every 26 hours. Optical microscopy scans showed differences in glossiness and surface textural attributes of the unbloomed and bloomed peanut chocolate confectionery. Consumer evaluation showed some differences in the glossiness and significant differences in surface texture of unbloomed and bloomed chocolates. A majority (62%) of the survey respondents had seen whitish discoloration in chocolates and 40% of the respondents thought this is because the chocolate had grown old.",
  "description_provenance": [
    "Author Email: vebuck@vt.edu",
    "Advisor Email: kzhou@wayne.edu",
    "Advisor Email: duncans@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: okeefes@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:41Z (GMT). No. of bitstreams: 1 VinodiniI_D_2010.pdf: 3792450 bytes, checksum: a9c5da398e66163b0fbf6e385363a48e (MD5)   Previous issue date: 2010-04-12"
  ],
  "handle": "26881",
  "identifier_other": "etd-04152010-105532",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152010-105532/",
  "identifier_uri": "http://hdl.handle.net/10919/26881",
  "publisher": "Virginia Tech",
  "relation_haspart": "VinodiniI_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "chocolate",
    "sensory tests",
    "squeeze flow rheology",
    "peanuts",
    "triacylglycerols",
    "fat bloom"
  ],
  "title": "Rheological Properties of Peanut Paste and Characterization of Fat Bloom Formation in Peanut-Chocolate Confectionery",
  "type": "Dissertation"
}