{
  "contributor_author": "Czarnecki, David Andrew",
  "contributor_committeechair": "Alexander, M. David",
  "contributor_committeemember": [
    "Brott, Pamelia E.",
    "Caldwell, M. Teressa",
    "Salmon, Richard G.",
    "Mallory, Walter D."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:42Z",
  "date_adate": "2010-05-05",
  "date_available": "2014-03-14T20:09:42Z",
  "date_issued": "2010-03-15",
  "date_rdate": "2012-04-30",
  "date_sdate": "2010-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to assess the knowledge base of Virginiaâ  s public secondary school counselors in specific areas of school law that are directly related to the issues they encounter within their job responsibilities.  A sample size of 416 was selected from a list of 1,892 Virginia public secondary school counselors.  These 416 school counselors were sent a secure, online assessment that focused on specific school law areas related to their job responsibilities.  To obtain the 66.8% response rate, four sets of emails were sent out once a week for a total of four weeks reminding school counselors to respond.  Phone calls also were made attempting to gather responses.   <p> Descriptive statistics were used to summarize the data from the assessment.  Then one-way analysis of variances, independent t-tests, and Pearson correlations were used, when appropriate, to determine the relationship between the independent variables and the counselorsâ   knowledge of school law.  The mean score correct on the assessment was 29.42/40 (74%).  A significantly positive statistical relationship was found at the .05 level with school law knowledge and years of experience.  It was discovered that there was a statistically significant difference between counselorsâ   knowledge of school law and having been issued a subpoena, appearing as a witness or defendant in a court of law, and having earned a teaching certificate.         <p> The study also surveyed the 16 university/college school counseling preparation programs in Virginia in order to assess if and how students were being taught school law.  Of the 11 programs that responded, the survey revealed that only one school, Norfolk State University, offers a class specifically on school law.  Seven of the 11 programs (64%) did report covering school law as part of other courses such as legal and ethical issues in counseling.   <p> The goal for this study was to identify gaps in school counselorsâ   understanding of school law.  This identification could assist principals, school systems, and graduate school counseling programs in developing additional training opportunities for counselors.  By doing this, the very real threat and fear of being held liable in court could be reduced.",
  "description_provenance": [
    "Author Email: czarneck@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: pbrott@vt.edu",
    "Advisor Email: tcaldwell3010@verizon.net",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: wmallory@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:42Z (GMT). No. of bitstreams: 1 Czarnecki_DA_D_2010.pdf: 579387 bytes, checksum: c9a895ada0a7f5fd962cdf08d6a20c8a (MD5)   Previous issue date: 2010-03-15"
  ],
  "handle": "26882",
  "identifier_other": "etd-04152010-111512",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152010-111512/",
  "identifier_uri": "http://hdl.handle.net/10919/26882",
  "publisher": "Virginia Tech",
  "relation_haspart": "Czarnecki_DA_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "School Law",
    "Virginia",
    "Public Secondary Schools",
    "School Counselors"
  ],
  "title": "A Study of Virginiaâ  s Public Secondary School Counselors and School Law",
  "type": "Dissertation"
}