{
  "contributor_author": "Lillianfeld, Robert Brian",
  "contributor_committeechair": "Heremans, Jean J.",
  "contributor_committeemember": [
    "Asryan, Levon V.",
    "Heflin, James R.",
    "Kulkarni, Rahul V."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:09:42Z",
  "date_adate": "2011-05-03",
  "date_available": "2014-03-14T20:09:42Z",
  "date_issued": "2011-04-01",
  "date_rdate": "2011-05-03",
  "date_sdate": "2011-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "We have studied the electron quantum phase by fabricating low dimensional (d â ¤ 2) mesoscopic interferometers in high-quality narrow-gap semiconductor (NGS) heterostructures. The low effective-mass electrons in NGS heterostructures enable observation of delicate quantum phases; and the strong spin-orbit interaction (SOI) in the systems gives us means by which we can manipulate the quantum-mechanical spin of these electrons through the orbital properties of the electrons. This enables the observation of spin-dependent phenomena otherwise inaccessible in non-magnetic systems. We have performed low temperature (0.4 K â ¤ T â ¤ 8 K), low noise (â  V ~ 1Î¼V ) transport measurements, and observed evidence of Aharonov-Bohm (AB) and Alâ  tshuler-Aronov-Spivak (AAS) quantum oscillations in meso- scopic devices that we fabricated on these NGSs. Our measurements are unique in that we observe both AB and AAS in comparable magnitude in ballistic networks with strong SOI. We show that, with appropriate considerations, diffusive formalisms can be used to describe ballistic transport through rings, even in the presence of SOI. This work also contains an introduction to the physics of geometric phases in mesoscopic systems, and the experimental and analytic processes through which these phases are probed. A discussion of the results of our measurements presents the case that quantum interferometric measurements of geometric phases can be understood quite thoroughly, and that these measurements may have deeper utility in discovery than has yet been recognized.",
  "description_provenance": [
    "Author Email: rblilli@vt.edu",
    "Advisor Email: asryan@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: kulkarni@vt.edu",
    "Advisor Email: heremans@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:42Z (GMT). No. of bitstreams: 2 Lillianfeld_RB_D_2011_Copyright.pdf: 273382 bytes, checksum: a968f43f96feecb4b6e7ae20187c84bc (MD5) Lillianfeld_RB_D_2011.pdf: 7462132 bytes, checksum: 09bc123adcbdd793fbe0ccc969df94a3 (MD5)   Previous issue date: 2011-04-01"
  ],
  "handle": "26889",
  "identifier_other": "etd-04152011-115313",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152011-115313/",
  "identifier_uri": "http://hdl.handle.net/10919/26889",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Lillianfeld_RB_D_2011_Copyright.pdf",
    "Lillianfeld_RB_D_2011.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "quantum interference",
    "mesoscopic physics",
    "Aharonov-Bohm effect",
    "dephasing"
  ],
  "title": "Experimental Observation of Geometric Phases in Narrow-Gap Semiconductor Heterostructures",
  "type": "Dissertation"
}