{
  "contributor_author": "Bradley, Faye Covington",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Schreck, John F.",
    "Salmon, Richard G.",
    "Creighton, Theodore B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:42Z",
  "date_adate": "2010-05-05",
  "date_available": "2014-03-14T20:09:42Z",
  "date_issued": "2010-04-02",
  "date_rdate": "2012-04-27",
  "date_sdate": "2010-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Bradley Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>During the last decade there has been a renewed focus on improving the instruction of children at risk for not learning to read well and ways to effectively involve their parents to enhance their children's reading achievement. This focus has particularly centered on how programs of school, family, and community partnerships can be organized to improve schools and enable all families to support children's reading and literacy skills (Epstein et al, 2002-2009). This study examined the extent to which the reading achievement of African American male learners improves with school, family, and community partnerships. The sample consisted of fourth grade African American males from the Tidewater region of Virginia who were enrolled in Title 1 schools that participate in the National Network of School Partnerships. The goal of this study was to examine the relationship between school, family, and community partnerships and the reading achievement of the African American male. Second, the study identified which type of parental involvement significantly influenced the reading achievement of African American males. Third, the study identified parental involvement activities that significantly influenced the reading achievement of the African American male learner. Teachers and administrators were surveyed using an instrument adapted from Epstein's School, Family, and Community Partnership Survey, The Virginia Standards of Learning reading and language arts assessments provided data for reading achievement of fourth grade African American males. Data analysis revealed no significant differences in promising practices and the reading achievement of fourth grade African American males. An ANOVA showed a significant difference between principals and teachers in their ratings of the importance of Type 6 activities, collaborating with the community. A correlation was found between Type 3 parental involvement activities of volunteering and the reading achievement of fourth grade African American males. An ANOVA showed a significant difference between principals and teachers in their ratings of Teacher Reports of School Program Type 4 (Learning at Home). Significant differences were found between principals and teachers in their ratings of Teacher Reports of Total School Program to Involve Families. A correlation between teacher estimates of parents' involvement and the mean SOL English score for African American male fourth grade students was found. </p> </body> </html>",
  "description_provenance": [
    "Author Email: cebrad22@aol.com",
    "Advisor Email: stev7735@comcast.net",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:42Z (GMT). No. of bitstreams: 1 Bradley_FC_D_2010.pdf: 5320621 bytes, checksum: 89d5d53370f8de43486edf913f4b08e4 (MD5)   Previous issue date: 2010-04-02"
  ],
  "handle": "26885",
  "identifier_other": "etd-04152010-165804",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152010-165804/",
  "identifier_uri": "http://hdl.handle.net/10919/26885",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bradley_FC_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "School",
    "Family",
    "and Community Partnership",
    "Reading Achievement",
    "African American Males",
    "Parental Involvement",
    "At Risk Learner"
  ],
  "title": "The Impact of Parental Involvement on the Reading Achievement of Fourth Grade African American Males in the Tidewater Region of Virginia",
  "type": "Dissertation"
}