{
  "contributor_author": "Fox, Lesley Diana",
  "contributor_committeechair": "Winett, Richard A.",
  "contributor_committeemember": [
    "Anderson, Eileen S.",
    "Herbert, William G.",
    "Cooper, Lee D.",
    "Finney, Jack W."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:09:45Z",
  "date_adate": "2003-04-25",
  "date_available": "2014-03-14T20:09:45Z",
  "date_issued": "2003-04-15",
  "date_rdate": "2004-04-25",
  "date_sdate": "2003-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "While weight loss programs over the past 30 years have proven to be effective in producing initial weight-loss, long-term weight maintenance has remained an elusive goal.  Given the serious negative health consequences associated with obesity, new approaches to weight management are warranted.  The purpose of this study was to evaluate the efficacy of a maintenance-oriented weight management program in producing changes in weight, body composition, fitness, blood lipids, physical activity, and strength following completion of the treatment program and at 3-month follow-up. Fifty overweight and obese men (n = 18) and women (n = 32), ages 27-55 (M = 40.52) who had low cardiorespiratory fitness (M = 20.87 ml/kg/min) and high total cholesterol (M = 223.36) were randomly assigned to one of three treatment conditions: 1] Behavioral Choice Treatment (BCT) with a theory-based maintenance-oriented program, moderate calorie goals, and the New Healthy Pyramid for nutrition recommendations; 2] a traditional exercise and nutrition education program (USDA) using the current Dietary Guidelines for Americans with the Food Guide Pyramid; and 3] a wait-list control group that was transitioned into BCT without the maintenance-oriented program (WLC/BCT w/o maintenance).  All groups (during treatment) received a center-based strength and aerobic program utilizing short-duration, but prescriptive protocols aimed at increasing fitness and strength.  Assessments were completed at baseline, 16 weeks, 28 weeks, and 40 weeks (WLC/BCT w/o maintenance only).  Participants in BCT and USDA experienced significant health changes compared to WLC who experienced minimal weight gain and decreased fitness across the 4-month waiting period. Results comparing BCT, BCT w/o maintenance, and USDA revealed that participants in all treatment conditions significantly improved aerobic fitness, strength, and physical activity during treatment (pâ  s < .05).  Participants in the BCT groups experienced significant decreases in weight, total % body fat, waist and hip circumferences, BMI, and LDL-C (pâ  s < .05), while participants in USDA did not.  At 3-month follow-up, while participants in both BCT groups continued to make improvements on multiple health outcomes, only participants in BCT with maintenance group were able to maintain their fitness gains (p < .001).  In addition, BCT with maintenance group showed a trend toward continued weight loss, maintenance of physical activity, and increased strength.  Taken together, the data indicate that any BCT offers greater health outcomes compared to a more traditional educationally based program both at post-treatment and follow-up.  Importantly, BCT with maintenance offered additional benefits including continued weight loss, continued decreased intra-abdominal fat, maintenance of fitness, physical activity, and strength compared to BCT w/o maintenance.  In conclusion, given the limited scope of small center-based trials, future studies need to examine the effectiveness of this program in a more community-based setting where there is potential for greater public health impact.",
  "description_provenance": [
    "Author Email: llutes@hp.ufl.edu",
    "Advisor Email: eileen@vt.edu",
    "Advisor Email: wgherb@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:45Z (GMT). No. of bitstreams: 5 ETD1.pdf: 89771 bytes, checksum: 3301dde4cdd942dfa4d0155944c72725 (MD5) ETD4b.pdf: 1266755 bytes, checksum: dce0a6d1a1060652a3f219508b0fedfa (MD5) ETD4a.pdf: 652342 bytes, checksum: 210bb2fd5fc5afb88a9dc73531dc5e1a (MD5) ETD3.pdf: 267153 bytes, checksum: 26072ff63e157a68c196b54a5e5add18 (MD5) ETD2.pdf: 239368 bytes, checksum: af60ab790a408ea5e96b1af20179665a (MD5)   Previous issue date: 2003-04-15"
  ],
  "handle": "26899",
  "identifier_other": "etd-04162003-132709",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162003-132709/",
  "identifier_uri": "http://hdl.handle.net/10919/26899",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ETD1.pdf",
    "ETD4b.pdf",
    "ETD4a.pdf",
    "ETD3.pdf",
    "ETD2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Obesity",
    "Theory-based",
    "Weight Management",
    "Maintenance",
    "Physical Activity",
    "Nutrition",
    "Weight Loss"
  ],
  "title": "The Efficacy of a Maintenance-Oriented Weight Management Program in an Obese Population",
  "type": "Dissertation"
}