{
  "contributor_author": "Woodard, Colleen A.",
  "contributor_committeechair": "Wolf, James F.",
  "contributor_committeemember": [
    "Gooden, Susan T.",
    "Dudley, Larkin S.",
    "Lane, Larry M.",
    "Rohr, John A."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:09:44Z",
  "date_adate": "2000-04-17",
  "date_available": "2014-03-14T20:09:44Z",
  "date_issued": "2000-04-06",
  "date_rdate": "2001-04-17",
  "date_sdate": "2000-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation research investigates whether merit-based principles and practices are embedded into the HRM systems of 19 Title 5-exempt federal organizations. Title 5-exempt organizations, such as government corporations, serve as a vehicle for exploring the question of what constitutes merit in more loosely regulated public environments.  This research fills a void in the discussion about how we can sustain a merit foundation in deregulated and decentralized federal human resources systems.  It also captures previously uncollected information about HRM in some organizations that operate fully or partially outside the general government management laws.   While the research focus is specific to certain organizations, the context is the broader issue of merit in modern government.  A recognition that alternative merit-based HRM systems exist under the federal umbrella without the constraints of Title 5 is important to the overall question of what constitutes merit in federal HRM and whether merit practices must be centrally determined and controlled.  The larger goal is that of offering an alternative perspective for embedding the democratic values that merit represents in a more flexible, responsive, and business-like government.   The dissertation is divided into three sections that include building a generic model of merit-based HRM to identify the intrinsic components of such public HRM systems, collecting HRM data from 19 organizations through multiple case methodology, and analyzing and comparing the findings to the merit model.  The discussion covers six themes emerging from the research, including the institutionalization and legalization of HRM, the impact of collective bargaining on merit, and the limited formal oversight and accountability of HRM in the studied organizations.  The findings suggest that even in less regulated political environments, merit-based systems do survive and serve the changing needs of the organization.  The key recommendation proposes offering the traditional federal agencies the option to develop and defend their own merit-based HRM systems under a broad public policy and accountability framework.  The growth of standard HRM policies and practices in all large organizations and the increased protections in the HRM systems stemming from civil rights and employment law as well as collective bargaining offer protections similar to those merit was originally intended to provide.",
  "description_provenance": [
    "Author Email: bcwood@erols.com",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: goodens@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: lmlane@vt.edu",
    "Advisor Email: jrohr@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:44Z (GMT). No. of bitstreams: 9 f4_references.pdf: 19999 bytes, checksum: 3c750fa623faae2034c3a2ea245e05d1 (MD5) f5_appendixa.pdf: 50795 bytes, checksum: 5732e874ed39d5540f1b469f0091c2b2 (MD5) f2_ackcontents.pdf: 19730 bytes, checksum: 3029d8f588aac3e3f836cfb74f7c0b76 (MD5) f9_vita.pdf: 4753 bytes, checksum: 209dc3344b20de96278e0f22cc0ddbd8 (MD5) f8_appendixd.pdf: 106480 bytes, checksum: dd250613ede76186d38971f9e708d415 (MD5) f7_appendixc.pdf: 18111 bytes, checksum: dae7b07db0583c2bc6218df3cfd159df (MD5) f6_appendixb.pdf: 81238 bytes, checksum: 666c4dd10a30bb2ded37428d32ece86c (MD5) f3_body.pdf: 718627 bytes, checksum: 404ebcaca7cce9d1a8f371d778ee10cf (MD5) f1_title.pdf: 8066 bytes, checksum: d941be69fcedb9fffc7e523e1cf079d0 (MD5)   Previous issue date: 2000-04-06"
  ],
  "handle": "26893",
  "identifier_other": "etd-04162000-13530015",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162000-13530015/",
  "identifier_uri": "http://hdl.handle.net/10919/26893",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "f4_references.pdf",
    "f5_appendixa.pdf",
    "f2_ackcontents.pdf",
    "f9_vita.pdf",
    "f8_appendixd.pdf",
    "f7_appendixc.pdf",
    "f6_appendixb.pdf",
    "f3_body.pdf",
    "f1_title.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "government corporations",
    "federal human resources management",
    "merit systems",
    "civil service",
    "public personnel management"
  ],
  "title": "Merit in Principle, Merit in Practice: An Investigation into Merit-based Human Resources Management Through the Lens of Title 5-exempt Federal Organizations",
  "type": "Dissertation"
}