{
  "contributor_author": "Hinson, Kenneth Earl",
  "contributor_committeechair": "Belli, Gabriella M.",
  "contributor_committeemember": [
    "Tlou, Josiah S.",
    "Saurino, Dan R.",
    "Cline, Marvin Gerald",
    "Rosen, Karen H."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:44Z",
  "date_adate": "2002-04-22",
  "date_available": "2014-03-14T20:09:44Z",
  "date_issued": "2002-03-28",
  "date_rdate": "2003-04-22",
  "date_sdate": "2002-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Black and White Adolescents창   Aspirations and Achievement in Mathematics: A Regional Comparison  by  Kenneth E. Hinson  Gabriella Belli, Ph.D., Chair  (Abstract) \tResearch on the comparison of educational aspirations among Black and White students has produced conflicting results.  Some studies at the national level have shown that the level of educational aspirations for college between these two groups is similar, while other studies at the state, regional, or local level have shown differences.  The National Education Longitudinal Study (NELS: 88) database and its 1990 and 1992 follow-ups were used to answer questions and test hypotheses about these differences.  The NELS: 88 database is comprised of data initially collected on almost 25,000 eighth graders and over 22,000 parents together representing more 1,000 public and private schools.  The study sample was comprised of approximately 1,500 Black and over 9,500 White high school seniors who were part of the tenth to twelfth grade cohort, attended public school, and remained in the same region between tenth and twelfth grade. Data were examined to determine if there were regional influences on the relationship between students창   educational aspirations and their achievement in mathematics. Educational aspiration did not explain different amounts of variance in mathematics achievement across the four U.S. census regions.  Region, however, was related to differences in White students창   aspiration but indicated no differences for Blacks.   Sex and mathematics-curriculum were related to differences in aspirations within race for both Black and White students.  For both races and regardless of region, a greater proportion of females aspired to attend 4-year college than males did.  Students with aspirations, for 4-year college or more, tended to score higher on mathematics achievement tests than those students with aspirations for less than 4-year college.  Whether students창   tenth-grade aspirations were the same or different from their twelfth-grade aspirations, no statistically significant difference was detected between their tenth and twelfth-grade achievement. As previous studies have shown, background variables (race, sex, and socioeconomic level) were statistically significant predictors of mathematics achievement.  Prior mathematics achievement was an overwhelmingly strong predictor of future mathematics achievement.  Once prior mathematics achievement was controlled, the aspirations of significant others (parents and teachers) played no role in explaining achievement in mathematics.",
  "description_provenance": [
    "Author Email: twohens@comcast.net",
    "Advisor Email: tlou@vt.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: mcline@vt.edu",
    "Advisor Email: krosen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:44Z (GMT). No. of bitstreams: 1 etd.pdf: 279846 bytes, checksum: c219568f62aaa6d6ec69d5ea27c5efe5 (MD5)   Previous issue date: 2002-03-28"
  ],
  "handle": "26896",
  "identifier_other": "etd-04162002-125544",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162002-125544/",
  "identifier_uri": "http://hdl.handle.net/10919/26896",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Achievement",
    "Aspirations",
    "Region",
    "NELS 88",
    "Curriculum",
    "Mathematics"
  ],
  "title": "Black and White Adolescents' Aspirations and Achievement in Mathematics: A Regional Comparison",
  "type": "Dissertation"
}