{
  "contributor_author": "Alali, Khaled Ahmed",
  "contributor_committeechair": "Casali, John G.",
  "contributor_committeemember": [
    "Burdisso, Ricardo A.",
    "Kleiner, Brian M.",
    "Smith-Jackson, Tonya L."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:43Z",
  "date_adate": "2011-05-04",
  "date_available": "2014-03-14T20:09:43Z",
  "date_issued": "2011-03-29",
  "date_rdate": "2011-05-04",
  "date_sdate": "2011-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Objective assessment for the effect of hearing protectors, background noise levels, and backup alarm acoustic features on listeners' abilities to localize backup alarm signals in the horizontal dimension, as well as on their ability to detect backup alarm signals in the distance dimension, is lacking in the acoustics and safety literature. Accordingly, two research experiments were conducted for this dissertation.  <p>  In the first experiment, the effect of seven hearing protectors, two background pink noise levels (60 dBA and 90 dBA), and two backup alarm signals (standard and spectrally-modified) on the ability of normal hearing listeners to localize backup alarm signals in the horizontal dimension was investigated. Results indicated that a diotic sound transmission earmuff significantly degraded localization accuracy as compared to all other hearing protectors and the open ear condition. In addition, no significant difference existed between the open ear condition and the other hearing protectors in localization accuracy in most of the conditions tested. However, the E-A-R/3M HiFiTM earplug was advantageous in localization performance since it provided a significantly higher percentage correct localization than the Moldex foam earplug, the diotic earmuff, and the dichotic earmuff in 90 dBA pink noise. As for main effects of the other independent variables, the 90 dBA pink noise significantly degraded localization performance as compared to the quiet condition of 60 dBA, and a spectrally-modified backup alarm significantly improved localization performance as compared to the standard (narrowband) backup alarm. Potential application of these results includes the revision of backup alarm standards. In addition, these results provide clear advice for safety professionals to avoid the application of diotic sound transmission earmuffs for workers if localizing backup alarms is important.  <p>    In the first experiment, listeners' feeling of comfort for each hearing protector was assessed subjectively by using a comfort rating scale. In addition, a subjective assessment for listeners'   confidence in their localization decisions was established. Results indicated no significant difference between the hearing protectors in terms of comfort. However, in terms of listeners'   confidence in localization decisions, their confidence was significantly degraded when they were fitted with the diotic earmuff. By contrast, they showed significantly more confidence in their localization decisions when they were fitted with the E-A-R/3M HiFiTM earplug as compared to when they were fitted with the Moldex foam earplug, the E-A-R/3M UltrafitTM earplug, and the Bilsom passive earmuff. <p>    In the second experiment, listeners' performance in detecting a stationary backup alarm signal, including both a standard (narrowband) and broadband (pulsed white noise) alarm, was determined while they were equipped with various passive and electronic hearing protection devices. Listeners' performance was quantified by detection distance, which was defined as the distance between the stationary backup alarm device and the position where the listener detected the backup alarm signal. The resultant data demonstrated that normal hearing listeners detected a standard (narrowband) backup alarm signal at significantly longer distances as compared to the broadband (BrigadeTM) backup alarm signal, thus indicating the earlier forewarning by the standard alarm. In addition, passive hearing protection devices characterized with high attenuation significantly reduced the detection distance. These results may be applied to assist safety professionals in selecting hearing protectors and backup alarm signals that provide on-foot workers with ample time to react to an approaching backing vehicle, thus improving their safety.",
  "description_provenance": [
    "Author Email: alalikh@vt.edu",
    "Advisor Email: jcasali@vt.edu",
    "Advisor Email: rburdiss@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:43Z (GMT). No. of bitstreams: 2  Alali_KA_D_2011_Copyright.pdf: 247520 bytes, checksum: 8b2654f0176dff58672ed8f03828ac99 (MD5)  Alali_KA_D_2011.pdf: 2576389 bytes, checksum: 6192a845ff9ce3f5cbd3883b60ec8fc7 (MD5)    Previous issue date: 2011-03-29"
  ],
  "handle": "26890",
  "identifier_other": "etd-04152011-122043",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04152011-122043/",
  "identifier_uri": "http://hdl.handle.net/10919/26890",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Alali_KA_D_2011_Copyright.pdf",
    "Alali_KA_D_2011.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Broadband backup alarm",
    "Combat Arms earplug",
    "Detection distance",
    "Backup alarm",
    "Musician's earplug",
    "Flat attenuation",
    "Auditory warning signal localization",
    "Sound localization",
    "Alarm spectrum",
    "Reverse alarm",
    "Electronic earmuff",
    "Hearing protector"
  ],
  "title": "Azimuthal Localization and Detection of Vehicular Backup Alarms Under Electronic and Non-Electronic Hearing Protection Devices in Noisy and Quiet Environments",
  "type": "Dissertation"
}