{
  "contributor_author": "Hall-Greene, Deborah L.",
  "contributor_committeechair": "Wiswell, Albert K.",
  "contributor_committeemember": [
    "Boucouvalas, Marcie",
    "Brown, Roscoe",
    "Morris, Linda E.",
    "Cline, Marvin Gerald"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:45Z",
  "date_adate": "2002-04-22",
  "date_available": "2014-03-14T20:09:45Z",
  "date_issued": "2002-04-10",
  "date_rdate": "2003-04-22",
  "date_sdate": "2002-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study was designed to examine the experiences of a small group of Black males in a college of aeronautical science, a major traditionally dominated by White males.  The study also considered the differences in how African American males and Caribbean black males perceived and acted upon the same experiences. Through a social learning theoretical approach, the study examined the relevant factors, processes, and experiences involved in these Black malesâ   choice of aeronautical science as a major and piloting as a career.  Eleven (11) persisters and 4 non-persisters participated in the study, which centered around a premier aeronautical university in the southeastern part of the United States. Questions guiding the study were:  (1) What experiences have been influential in a small group of Black malesâ   selection of aeronautical science as a major, piloting as a career?  (2) What factors outside of and previous to the collegial environment contribute to (and detract from) persistence in pursuit of completion of a major in piloting?  (3) What factors in the collegial and occupational environment contribute to persistence in a major in piloting?  (4) How do patterns of persistence compare for these Black males at a college of aeronautical science?         \tQualitative methodology included both individual in-depth interviews and small focus groups.  Participants were recruited through both purposive and snowball samplings as well as volunteering. Criteria for persisters were Black male former aviation students who had already graduated with an aeronautical science degree and pursuing a career as a pilot or Black male students currently enrolled as juniors and seniors, in good academic standing.  Non-persisters in this study were Black males who left their aeronautical science major prior to completion.  Findings clearly indicated that a number of factors, such as family, individual, social, and environmental, influenced this small group of Black malesâ   persistence in aeronautical science.  Additionally, this study attempted to ascertain the differences and similarities in perceptions and experiences among African American and Caribbean black males.  The Caribbean black males in this study did not perceive their race as having a negative impact on their persistence, whereas most of the African American male participants felt their race was a contributing factor to their non-persistence.  This study provided the groundwork for the development of a conceptual model of academic persistence with implications for recruiting, retaining, and graduating Black males from a college of aeronautical science.",
  "description_provenance": [
    "Author Email: dhgreene@erols.com",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: wiswell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:45Z (GMT). No. of bitstreams: 7 PT2.pdf: 266831 bytes, checksum: c780e4edde312c429dae443cac09aece (MD5) PT1.pdf: 79331 bytes, checksum: dd8bf7f1612ff55a204f7667e502552f (MD5) PT6.pdf: 166334 bytes, checksum: cba339f71906749a46896dce7944f112 (MD5) PT5.pdf: 126561 bytes, checksum: 20152c02ef8de909bc647c29c5462d2c (MD5) PT4.pdf: 84380 bytes, checksum: 035511ee59f90a4cd0cce54ef16e33c8 (MD5) PT3.pdf: 239477 bytes, checksum: ea86d1e9adbb14f94bc5e1396c96ab20 (MD5) PT7.pdf: 148705 bytes, checksum: e327e3c20848427cde1d0eeb7272d63a (MD5)   Previous issue date: 2002-04-10"
  ],
  "handle": "26897",
  "identifier_other": "etd-04162002-192602",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162002-192602/",
  "identifier_uri": "http://hdl.handle.net/10919/26897",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "PT2.pdf",
    "PT1.pdf",
    "PT6.pdf",
    "PT5.pdf",
    "PT4.pdf",
    "PT3.pdf",
    "PT7.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Aeronautical Science",
    "African American male",
    "Persistence",
    "Non-traditional Career Choice",
    "Caribbean black male",
    "Aviation Education"
  ],
  "title": "A Qualitative Study on African American and Caribbean Black Males' Experience in a College of Aeronautical Science",
  "type": "Dissertation"
}