{
  "contributor_author": "Justus, Linda Blankenship",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "King, Stephen E.",
    "Niles, Jerome A.",
    "Crockett, Jean B.",
    "Dawson, Christina M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:45Z",
  "date_adate": "2002-04-29",
  "date_available": "2014-03-14T20:09:45Z",
  "date_issued": "2001-12-14",
  "date_rdate": "2003-04-29",
  "date_sdate": "2002-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to examine factors that band directors may be able to use in enhancing enrollment in band programs. The categories of predictor variables were  school leadership, level of support, student characteristics, band leadership, and band leader characteristics. There was one criterion variable, band enrollment.  Stepwise multiple regression was used to determine which predictor variables explained a portion of the criterion variable, band enrollment.  <p>A sample of 400 active band directors was drawn from the membership of the American School Band Directors Association. A table of random numbers was used to select the sample. Data were collected from responses to a questionnaire that was mailed to all persons in the sample. Usable responses were received from 250 males and 65 females.  <p>Results of a stepwise multiple regression indicated that five variables accounted for 86.7% of the variance in band enrollment. These five variables in the order of the amount of variance accounted for are (1) the total number of students in the band director's school, (2) the relationship between the band director and constituents (principal component one), (3) revenue per band student, (4) proportion of students on free or reduced-price lunch in the band director's school, and (5) race of the band director.   <p>One of the main implications of this study appears to be broadly associated with the kinds of relationships a band director develops with the members of the band community.  Even though the band director cannot do anything about the size of the student body, the challenge is for band directors to use strategies that enhance their relationships with the band community.",
  "description_provenance": [
    "Author Email: ljustus@washingtonco.k12.nc.us",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: tdawson@antiochsea.edu",
    "Made available in DSpace on 2014-03-14T20:09:45Z (GMT). No. of bitstreams: 2 JustusLinda.PDF: 504159 bytes, checksum: 29ea23d10600808f5f8e7e8f3b865aaa (MD5) JustusLindaFront.pdf: 23962 bytes, checksum: e5dcab1d16658b366bfdb0bf7b311fa3 (MD5)   Previous issue date: 2001-12-14"
  ],
  "handle": "26898",
  "identifier_other": "etd-04162002-223828",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162002-223828/",
  "identifier_uri": "http://hdl.handle.net/10919/26898",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "JustusLinda.PDF",
    "JustusLindaFront.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Education",
    "Music Programs",
    "Band Programs",
    "Band Enrollment",
    "Band Directors"
  ],
  "title": "Factors That Contribute to Enrollment in Band Programs",
  "type": "Dissertation"
}