{
  "contributor_author": "Bowles, Robert",
  "contributor_committeechair": "Rosenthal, Stuart",
  "contributor_committeemember": [
    "Murphy, Russell D.",
    "Salehi-Isfahani, Djavad",
    "Snyder, Susan K.",
    "Tideman, Thorwald Nicolaus"
  ],
  "contributor_department": "Economics (Arts and Sciences)",
  "date_accessioned": "2014-03-14T20:09:43Z",
  "date_adate": "1999-04-20",
  "date_available": "2014-03-14T20:09:43Z",
  "date_issued": "1999-03-31",
  "date_rdate": "1999-04-20",
  "date_sdate": "1999-04-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Chapter 1 introduces some of the issues which are addressed in the other chapters of this dissertation.  These topics include: (1) the general equilibrium incentives in the provision of public education, (2) human capital production functions in economic modeling, (3) how public education spending may impact income inequality -- both positively and negatively, (4) the effect on public education spending of changes in the college wage premium, and (5) the overall efficiency of government-supplied capital.  <p>Chapter 2 develops a public education system in which voters face general equilibrium incentives to pay taxes for education.  Middle-aged voters can increase their returns to saving by increasing the aggregate amount of human capital in the economy.  I find that if students differ by their ability to increase their human capital levels through schooling, then the public education policy will invest more education funds in more productive students; this perpetuates income inequality.  Also, the greater the discount rate for consumption and the elasticity of education funds in the human capital production function, the more likely it is that a public system provides greater growth in the steady state than a private system.  <p>Chapter 3 studies the allocation of government spending between general tuition subsidies for college students and need-based aid which is directed solely towards students from low-income households. The way to maximize the number of students may be to provide some need-based aid.  I find that government provides more aid directed to low-income students if need-based tuition subsidies are provided rather than student loan subsidies.  I also look at the effects of changes in parameters, such as the cost of education and the college wage premium, on the policies.  <p>Chapter 4 investigates the returns to aggregate factors of production when labor is disaggregated by education level.  I find that a model in which the error term is assumed to be state-wise heteroscedastic and autocorrelated does a better job of approximating the pattern of wages for the different education groups than other models (pooled OLS or random and fixed effects).  In addition, this model suggests a significant positive elasticity for public capital.",
  "description_provenance": [
    "Author Email: rbowles@vt.edu",
    "Advisor Email: ssrosen@vt.edu",
    "Advisor Email: rdmurphy@vt.edu",
    "Advisor Email: salehi@vt.edu",
    "Advisor Email: sksnyder@vt.edu",
    "Advisor Email: ntideman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:43Z (GMT). No. of bitstreams: 7 CHAP4.PDF: 92409 bytes, checksum: 6c12d035df3219c6d799dbcebcc9facf (MD5) VITA.PDF: 3012 bytes, checksum: 422743c991f4196c4d25c044f7ec3e11 (MD5) CHAP1.PDF: 165064 bytes, checksum: dfc6c15830aac267e48321761d43aa61 (MD5) FRONT.PDF: 20885 bytes, checksum: 88bcb3be407c69e8e24c4fda79d83ae5 (MD5) BIBLIO.PDF: 68873 bytes, checksum: 9305782f88ae99d8db91da6a94c019ca (MD5) chap2.pdf: 2310861 bytes, checksum: b3dcaa938f22ad24ad14ed16f8be9e46 (MD5) CHAP3.pdf: 1419432 bytes, checksum: ed3d57e722c48fdd7879b03753590198 (MD5)   Previous issue date: 1999-03-31"
  ],
  "handle": "26892",
  "identifier_other": "etd-041599-180126",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041599-180126/",
  "identifier_uri": "http://hdl.handle.net/10919/26892",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAP4.PDF",
    "VITA.PDF",
    "CHAP1.PDF",
    "FRONT.PDF",
    "BIBLIO.PDF",
    "chap2.pdf",
    "CHAP3.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "panel data",
    "human capital",
    "general equilibrium",
    "educational finance",
    "tuition subsidies"
  ],
  "title": "Essays in Public Education",
  "type": "Dissertation"
}