{
  "contributor_author": "Alderman, Duane Thomas",
  "contributor_committeecochair": [
    "Parson, Stephen R.",
    "Dawson, Christina M."
  ],
  "contributor_committeemember": [
    "Crockett, Jean B.",
    "Cutlip, Bobbi J.",
    "Arnold, Douglas E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:44Z",
  "date_adate": "2000-04-17",
  "date_available": "2014-03-14T20:09:44Z",
  "date_issued": "2000-04-04",
  "date_rdate": "2001-04-17",
  "date_sdate": "2000-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>Learning in America has been restrained by time. Educators have developed a time-bound mentality and deceived themselves into believing that schools can educate all students at the same pace.   <p>Across the nation there is a growing trend toward restructuring as educators seek smaller class enrollment with more flexible use of time. Block scheduling utilizes classes organized into longer blocks of time and may be an element that meets these demands for restructuring. In Virginia, 4/4 block scheduling is the most popular (31.6%) arrangement of the school day. Advocates of 4/4 block scheduling are convinced this schedule meets students' needs.   <p>With the adoption of the new Standards of Learning Tests for Virginia Public Schools it is important for educators to determine which schedule will help students improve their test scores. There are no empirical studies on the effect of 4/4 block scheduling on these Standards of Learning Tests. This study will attempt to determine if there is a meaningful relationship between two types of schedules, the 4/4 block and 7-period traditional schedules, and student achievement on the Standards of Learning Tests for Virginia Public Schools.",
  "description_provenance": [
    "Author Email: dalderman@naxs.com, dalderma@wcs.k12.va.us",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: tdawson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:44Z (GMT). No. of bitstreams: 1 Document.pdf: 505387 bytes, checksum: e045ca9488ca7ba03019858561a66ffd (MD5)   Previous issue date: 2000-04-04"
  ],
  "handle": "26894",
  "identifier_other": "etd-04162000-20010029",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162000-20010029/",
  "identifier_uri": "http://hdl.handle.net/10919/26894",
  "publisher": "Virginia Tech",
  "relation_haspart": "Document.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Achievement",
    "7-Period Traditional Scheduled Schools",
    "Block Schedules",
    "Standards of Learning Tests for Virginia Public",
    "Time and Learning"
  ],
  "title": "A Comparison Study of the Relationships of 4/4 Block Scheduled Schools and 7-Period Traditional Scheduled Schools on the Standards of Learning Tests for Virginia Public Secondary Schools",
  "type": "Dissertation"
}