{
  "contributor_author": "Vaughan, Benjamin Ray",
  "contributor_committeechair": "Marand, Eva",
  "contributor_committeemember": [
    "Koros, William",
    "Davis, Richey M.",
    "Oyama, Shigeo Ted"
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:09:47Z",
  "date_adate": "2007-04-24",
  "date_available": "2014-03-14T20:09:47Z",
  "date_issued": "2007-04-03",
  "date_rdate": "2007-04-24",
  "date_sdate": "2007-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "It is well known that clays dispersed in a polymer matrix decrease the permeability of all gases through that membrane.  Our objective was to explore the effects on transport when a microporous layered aluminophosphate was added to a polymer matrix.  The clay like layered aluminophosphate used contains sheets with 8MR ring openings in the size range of 3-4 Ã .  The molecular level dispersion of this material into a polymer matrix is theorized to increase selectivity by molecular sieving.  A previous study performed in our laboratory showed an increase in He/CH4 selectivity when this aluminophosphate (8MR-AlPO) was dispersed in a fluorinated polyimide.  The increase in selectivity was explained as size sieving by the aluminophosphate sheets where small gas species can pass through the microstructure and large gas species have to take a tortuous path around the sheets. \tWe performed several studies with different polymer materials in the attempt to make composite membranes that corroborated the previously seen increases in gas selectivity.  In some cases different surfactants were used to swell 8MR-AlPO.  In the first set of studies the methods used to produce the fluorinated polyimide composites were repeated using polydimethyl siloxane (PDMS), a copolymer of a fluorinated polyimide and PDMS, polysulfone, Matrimid, and cellulose acetate as the matrix materials.  In general gas permeation studies of these materials showed an overall decrease in permeability with increasing addition of 8MR-AlPO but no substantial increase in selectivity.  In an attempt to increase the chances of exfoliating and dispersing the layered aluminophosphate, an in-situ method using poly(etherimide) (PEI) was polymerized in the presence of 8MR-AlPO was employed.  Mixed matrix membranes of PEI with 5wt% 8MR-AlPO were successfully fabricated and the transport properties measured.  Microscopy revealed that the composites made with the 8MR-AlPO treated with a reactive surfactant showed better dispersion than those treated with the nonreactive surfactants.  The permeability of gases changed very little as the result of adding 8MR-AlPO to PEI and no substantial increase in selectivity was observed.  Finally, we incorporated a similar layered aluminophosphate with larger 12MR (6-7Ã ) openings into polysulfone.  These composites showed barrier behavior but no increases in selectivity.",
  "description_provenance": [
    "Author Email: bevaugha@vt.edu",
    "Advisor Email: William.Koros@chbe.gatech.edu",
    "Advisor Email: emarand@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: oyama@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:47Z (GMT). No. of bitstreams: 1 combined.pdf: 25920484 bytes, checksum: d5bda969e60281cc4b23a752b321a692 (MD5)   Previous issue date: 2007-04-03"
  ],
  "handle": "26908",
  "identifier_other": "etd-04162007-233204",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162007-233204/",
  "identifier_uri": "http://hdl.handle.net/10919/26908",
  "publisher": "Virginia Tech",
  "relation_haspart": "combined.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "layered aluminophosphates",
    "mixed matrix membranes",
    "gas separations"
  ],
  "title": "Polymer Aluminophosphate Mixed Matrix  Membranes for Gas Separations",
  "type": "Dissertation"
}