{
  "contributor_author": "Fruhauf, Christine A.",
  "contributor_committeechair": "Jarrott, Shannon E.",
  "contributor_committeemember": [
    "Roberto, Karen A.",
    "Blieszner, Rosemary",
    "Allen, Katherine R.",
    "Stevenson, Michelle L."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:46Z",
  "date_adate": "2003-04-21",
  "date_available": "2014-03-14T20:09:46Z",
  "date_issued": "2003-04-07",
  "date_rdate": "2004-04-21",
  "date_sdate": "2003-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Throughout the life course, all family members can expect to find themselves in some type of caregiving role. Individuals may find themselves providing care for a child or for an older family member who needs assistance. With the increase in life expectancy and the shrinking family size, individuals may find themselves spending time providing care to older family members. Despite the fact that caregiving related issues are well researched in the field of gerontology, the developmental experiences of grandchildren caregivers and the meanings of their caregiving experiences have not been explored in previous empirical work.   Influenced by symbolic interactionism theory and the life course and life-span perspectives, the research questions that guide this study are: What is the nature of caregiving from the perspectives of grandchildren in the grandparent-grandchild relationship? What meanings do grandchildren give to the caregiving role? A qualitative study was conducted to examine the experiences of adult grandchildren (21-29 years old) who were currently providing some type of care-related activity for at least one grandparent. Face-to-face semi-structured interviews, lasting 30-80 minutes, with 17 grandchildren caregivers were conducted one time to examine the participants창   caregiving experience. All interviews were completed at a location of the participants창   choice. Interviews were tape-recorded and tapes were transcribed verbatim to aid in data analysis. Grandchildren caregivers창   experiences illustrate variation with the reasons for providing care and the amount of time engaged in care related activities. Grandchildren were assisting with instrumental activities of daily living and activities of daily living. Reasons for providing care included grandparents창   chronic illness or gradual aging, a crisis or event that left grandparents needing assistance, and because they had been providing care since they were young children. The amount of time grandchildren engaged in care related activities ranged from daily to several hours a week during summer and winter breaks. Grandchildren caregivers reported that family values, making grandparents happy, and preparing for the future were how they made sense of their role. Grandchildren experienced benefits and drawbacks from assisting grandparents and discussed how parents served as mediators and distracters to their caregiving role. Grandchildren caregivers exhibited the ability to adapt to caregiving situations and develop coping mechanisms that allowed them to be successful caregivers. Service professionals may want to include grandchildren caregivers in established support groups, caregiver programs, and enhance caregiver resources to support the generational needs of grandchildren caregivers in their 20s.",
  "description_provenance": [
    "Author Email: cfruhauf@vt.edu",
    "Advisor Email: kroberto@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Advisor Email: sjarrott@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: mstevens@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:46Z (GMT). No. of bitstreams: 1 CAFDissertation.pdf: 365511 bytes, checksum: 5cee8c882c4341d1eab932a57867b07e (MD5)   Previous issue date: 2003-04-07"
  ],
  "handle": "26900",
  "identifier_other": "etd-04162003-171447",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162003-171447/",
  "identifier_uri": "http://hdl.handle.net/10919/26900",
  "publisher": "Virginia Tech",
  "relation_haspart": "CAFDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Intergenerational Relationships",
    "Caregiving",
    "Grandparents",
    "Grandchildren"
  ],
  "title": "Grandchildren's Perceptions of Caring for Grandparents",
  "type": "Dissertation"
}