{
  "contributor_author": "Suklim, Kannapha",
  "contributor_committeechair": "Flick, George J. Jr.",
  "contributor_committeemember": [
    "Wittman, Robert",
    "Popham, David L.",
    "Williams, Robert C.",
    "Eifert, Joseph D."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:09:46Z",
  "date_adate": "2006-04-28",
  "date_available": "2014-03-14T20:09:46Z",
  "date_issued": "2006-03-06",
  "date_rdate": "2008-04-28",
  "date_sdate": "2006-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Food and Drug Administration has recently expressed concern for the safety of seafood and seafood products.  One of the concerns is the presence of Bacillus cereus in fresh blue crab meat.  Bacillus cereus is a spore-forming pathogen whose spores survive the customary thermal treatments applied during cooking and pasteurization; therefore it could potentially present a health concern to consumers as the microorganism could increase to pathogenic levels.    The objectives of this study were to evaluate the effects of a post-processing method i.e. high hydrostatic pressure treatment on the quality of fresh crab meat and to evaluate the effectiveness of high pressures on the inactivation of B. cereus spores.  Fresh blue crab meat was pressurized at 300 and 550 MPa at 25° C for 5 min and stored at 4° C for 31 days to determine the pressurization effects on the microbiological, physical, and sensory quality of the meat.  A pressure of 300 MPa caused a 1 log reduction in total aerobic plate count and a 3 day lag period, whereas 550 MPa inactivated 2 logs in total aerobic plate count with no evident lag phase.  Physical and sensory qualities of pressurized crab meat were not statistically different from the untreated crab meat (P>0.05).  A pressure of 300 MPa extended the shelf-life from 17 to over 24 days with the prevalence of Carnobacterium piscicola at the time of spoilage.  Crab meat treated with 550 MPa was not rejected by sensory panels at day 31 and Enterococcus spp. was identified as the predominant microorganism.  High hydrostatic pressure (550 MPa at 40° C for 15 min) inactivated less than 1 log (0.66 log) of B. cereus spores inoculated in fresh crab meat.  The meat essentially had a protective effect on pressure inactivation of the spores.  During storage (31 days), surviving B. cereus was suppressed and outgrown by the other pressure resistant microflora at a storage temperature of 12° C.  At 4° C, B. cereus could compete with the other pressure-resistant microflora and was isolated even at the end of the storage period (day 31); however, diarrheal toxin was not detected in any stored samples.",
  "description_provenance": [
    "Author Email: kannapha@vt.edu",
    "Advisor Email: rwittman@vdh.state.va.us",
    "Advisor Email: dpopham@vt.edu",
    "Advisor Email: rcwillia@vt.edu",
    "Advisor Email: flickg@vt.edu",
    "Advisor Email: jeifert@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:46Z (GMT). No. of bitstreams: 1 kannapha-etd.pdf: 1749739 bytes, checksum: 1eed4703cbbd75df47683da9ed647f7a (MD5)   Previous issue date: 2006-03-06"
  ],
  "handle": "26905",
  "identifier_other": "etd-04162006-155621",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162006-155621/",
  "identifier_uri": "http://hdl.handle.net/10919/26905",
  "publisher": "Virginia Tech",
  "relation_haspart": "kannapha-etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "high hydrostatic pressure processing",
    "blue crab meat",
    "Callinectes sapidus",
    "spores",
    "Bacillus cereus"
  ],
  "title": "Effects of high hydrostatic pressure processing on Bacillus cereus spores in fresh blue crab meat (Callinectes sapidus)",
  "type": "Dissertation"
}