{
  "contributor_author": "Joest, Karen S.",
  "contributor_committeechair": "Piercy, Fred P.",
  "contributor_committeemember": [
    "McWey, Lenore M.",
    "Arditti, Joyce A.",
    "Henderson, Tammy L.",
    "Magliaro, Susan G."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:46Z",
  "date_adate": "2003-04-21",
  "date_available": "2014-03-14T20:09:46Z",
  "date_issued": "2003-04-08",
  "date_rdate": "2004-04-21",
  "date_sdate": "2003-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study explored the multiple contexts of violence in the lives of female adolescents exposed to domestic violence. The research was guided by ecological, critical and postmodern feminist perspectives. Ecological theory embeds individual and familial experiences within the broader social and historical contexts. Critical theory questions often held assumptions and issues of power. Postmodern feminism extended this theoretical lens into a socio-political context that used gender, race, class, and marginalization as central lenses. This perspective emphasized the importance of context, processes, and the subjective experiences of girls. \tQualitative methods and a constructivist epistemology were used to understand the experiences of six female adolescents, between 14 and 19 whose mothers had experienced domestic violence. I explored how participants reflected on and made sense of their exposure to violence in their families, the multiple contexts of violence to which they were exposed, and the protective factors they had or employed. Four interviews were conducted with each participant, totaling 24 interviews. Poetry was used to gain trust and begin the process of sharing intrapersonal feelings, to externalize thoughts and expressions, and share lived experiences. Two mothers completed lengthy questionnaires. Participants were recruited through an insider's knowledge of multiple agencies, and using snowballing. No participants ever resided in a domestic violence shelter. \tThis study contributed to our understanding of the lives of adolescent females exposed to domestic violence by elucidating the complexity of the experiences of participants and their families. It reminded us of the contextual importance of describing violence and the ever-changing experience of children exposed to domestic violence. Children learned to cope in multiple ways, but felt alone and powerless. Systems developed to assist youth and families were unable to intervene in a meaningful way, thus extending the feelings of abandonment and powerlessness. Children learned to hide from their feelings and put on a mask to the world. This mask hid the child safely beneath, and ultimately served to distance her from the realities in her midst. But, at what expense? I discuss findings in terms of current resilience theory and provide suggestions for future research and intervention based on these findings.",
  "description_provenance": [
    "Author Email: kjoest@vt.edu",
    "Advisor Email: lmcwey@vt.edu",
    "Advisor Email: arditti@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: thender@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:46Z (GMT). No. of bitstreams: 1 DISSERTATION.pdf: 510039 bytes, checksum: 8e167dc1ab19623b59c8eddba6a909cb (MD5)   Previous issue date: 2003-04-08"
  ],
  "handle": "26901",
  "identifier_other": "etd-04162003-173004",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162003-173004/",
  "identifier_uri": "http://hdl.handle.net/10919/26901",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISSERTATION.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "feminst theory",
    "multiple contexts",
    "adolescence",
    "domestic violence"
  ],
  "title": "Multiple Contexts of Violence in the Lives of Adoelscent Females who have been Exposed to Domestic Violence",
  "type": "Dissertation"
}