{
  "contributor_author": "Dyke, Felicia Delphine",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Stamm, Neil A.",
    "Roberts, James T.",
    "Craig, James E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:46Z",
  "date_adate": "2007-04-19",
  "date_available": "2014-03-14T20:09:46Z",
  "date_issued": "2007-04-03",
  "date_rdate": "2012-11-19",
  "date_sdate": "2007-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study is to determine if a transition program has a greater success rate, as measured by GPA, number of students recycled, attendance, and conduct, than a traditional program of study for over age, first time ninth grade students by the end of first semester of the ninth grade.  Some of the typical outcomes during the transition to high school from grade 8 to grade 9 are high failure rates, lack of Algebra I readiness, and poor attendance. These concerns contribute to drop-out rates and the level of competitiveness students will have when facing the workforce. This is a timely issue as we continue to address Standards of Learning (SOL) and No Child Left Behind (NCLB) Act and the initiatives to rethink our high schools as they attempt to prepare students for the ongoing changes of the economy, workforce, and expectations of colleges and universities.",
  "description_provenance": [
    "Author Email: felicia.dyke@nn.k12.va.us",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:46Z (GMT). No. of bitstreams: 1 Dr.F.DykeUpdatedETD1REVISED.pdf: 477366 bytes, checksum: 48a576a63a992d4ac71475d6f78cda41 (MD5)   Previous issue date: 2007-04-03"
  ],
  "handle": "26907",
  "identifier_other": "etd-04162007-081256",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162007-081256/",
  "identifier_uri": "http://hdl.handle.net/10919/26907",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dr.F.DykeUpdatedETD1REVISED.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ninth grade",
    "transition",
    "drop out",
    "at-risk"
  ],
  "title": "What is the Impact of a Transition Program and Traditional Program of Study on Over Age First Time Ninth Grade Students",
  "type": "Dissertation"
}