{
  "contributor_author": "Kalanick, Julie Lynn",
  "contributor_committeechair": "Hauenstein, Neil M. A.",
  "contributor_committeemember": [
    "Foti, Roseanne J.",
    "Axsom, Daniel K.",
    "Carlson, Kevin D."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:09:47Z",
  "date_adate": "2008-05-13",
  "date_available": "2014-03-14T20:09:47Z",
  "date_issued": "2008-04-04",
  "date_rdate": "2008-05-13",
  "date_sdate": "2008-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study employed an experimental design intended to be an analog to the workplace to examine a person by situation interactive effect on OCBs, which were evaluated as prosocial behaviors. This study also sought to provide initial empirical support for the two-stage social cognitive model of OCBs proposed by Hauenstein and Kalanick (2008). Participants were 194 undergraduates. The study was a 2 (Helpfulness) by 2 (Fairness) design. After completing distracter tasks 1 and 2, participants received either a helpfulness prime or a control prime (task 3). Participants then either experienced either a fair manipulation or an unfair manipulation. Results indicated a distinction between the decision to help and helping effort, which has not been thoroughly examined in literature on OCBs. Results revealed main effects for the helpfulness prime and fairness manipulation on the decision to engage in helping. The nature of these effects was that participants helped more when they were primed with helpfulness and when they experienced fairness. However, once helping commenced, there was an interactive effect between helpfulness and fairness such that the helpfulness prime had a stronger effect on participants treated unfairly. Implications for future research on OCBs are discussed.",
  "description_provenance": [
    "Author Email: juliek2@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: aksom@vt.edu",
    "Advisor Email: kevinc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:47Z (GMT). No. of bitstreams: 2 JulieLynnKalanickDissertationETD.5.13.08.pdf: 504758 bytes, checksum: dd0ad59614a5837f27a468b99a6362b7 (MD5) IRBapproval.pdf: 272947 bytes, checksum: 719602f11565dc9cb8f18043cb92136f (MD5)   Previous issue date: 2008-04-04"
  ],
  "handle": "26909",
  "identifier_other": "etd-04162008-112006",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162008-112006/",
  "identifier_uri": "http://hdl.handle.net/10919/26909",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "JulieLynnKalanickDissertationETD.5.13.08.pdf",
    "IRBapproval.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Meta-Theory",
    "Control Theory",
    "Social Cognitive Theory",
    "Self-Regulation",
    "Organizational Citizenship Behaviors",
    "OCBs",
    "CAPs",
    "Person by Situation Interactions"
  ],
  "title": "Helping in the Workplace: A Social Cognitive Perspective",
  "type": "Dissertation"
}