{
  "contributor_author": "Wang, Ruijia",
  "contributor_committeechair": "Roe-Hoan Yoon",
  "contributor_committeemember": [
    "David Clark",
    "John Walz",
    "Luttrell, Gerald H.",
    "Demetri Telionis"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:09:47Z",
  "date_adate": "2010-04-27",
  "date_available": "2014-03-14T20:09:47Z",
  "date_issued": "2010-03-31",
  "date_rdate": "2013-05-21",
  "date_sdate": "2010-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The thin film pressure balance (TFPB) technique were used to study the stability of single foam films produced in the presence of n-alkyl polyoxyethylene (CnEOm) homologues. The results showed that films thin faster than predicted by the classical DLVO theory, which considers contributions from the van der Waals-dispersion and double-layer forces to the disjoining pressure of the film. The discrepancy may be attributed to the presence of hydrophobic force, the magnitude of which has been estimated using the Reynolds lubrication approximation. It has been found that the attractive hydrophobic force was substantially larger than the attractive van der Waals force, which may explain the faster film thinning kinetics. With a given non-ionic surfactant, the hydrophobic force decreased with increasing surfactant concentration, which explained the slower kinetics observed at higher concentrations and hence the increased foam stability. At concentrations where the hydrophobic force became comparable to or smaller than the van der Waals force, the foam films were stabilized by the increased elasticity of the foam films.<p> The film elasticity of the surfactant solutions were measured using the oscillating drop analysis technique at different frequencies. The measurements were conducted in the presence of CnEOm surfactants with n=10-14 and m=4-8, and the results were analyzed using the Lucassen and van den Tempel model (1972). There was a reasonable fit between the experiment and the model predictions when using the values of the Gibbs elasticity calculated from the Wang and Yoon model (2006). From this exercise, it was possible to determine the diffusion coefficients (D) of the CnEOm surfactants. The D values obtained for CnEOm surfactants were in the range of 2.5x10-10 to 6x10-9 m2s-1, which are in general agreement with those reported in the literature for other surfactants. The diffusion coefficient decreased with increasing alkyl chain length (n) and increased with increasing chain length (m) of the EO group. These findings are in agreement with the results of the dynamic surface tension measurements conducted in the present work. The TFPB studies were also conducted on the foam films stabilized in the presence of a mixture of C12EO8 and sodium dodecylsulfate (SDS) at different ratios. The results showed that the hydrophobic force increased with increasing C12EO8 to SDS ratio. Thus, the former was more effective than the latter in decreasing the hydrophobic force and hence stabilizing foam films. The C12EO8 was more efficient than SDS in increasing the elasticity of the single foam films and stabilizing foams. The TFPB studies were also conducted in the presence of n-octadecyltimethyl chloride (C18TACl) and polymers, i.e., polyvinylpyrrolidone (PVP) and polystyrene sulfonate (PSS). The effect of polymer on the film elasticity was strongest in the presence of PSS, which can be attributed to the charge-charge interaction.<p> Nano-sized silica and poly methyl methacrylate (PMMA) particles were used as solid surfactants to stabilize foams. It was found that the foam stability was maximum at contact angles just below 90o. The TFPB studies conducted with silica nano-particles showed that the kinetics of foam films became slower as the contact angle was increased from 30o to 77 o , indicating that foam films becomes more stable with more hydrophobic particles. The extra-ordinary stability observed with the hydrophobic silica nano-particles may be attributed to the possibility that the particles adsorbed on bubble surfaces retard the drainage rate and prevent the films to reach the critical rupture thickness (Hc). Confocal microscope and SEM images showed that hydrophobized nano-particles adsorbed on the surfaces of air bubbles, and that some of the nano-particles form aggregates depending on the particle size and hydrophobicity. The dynamic surface tension measurements conducted with PMMA and silica nano-particles showed that the latter has higher diffusion rates than the former, which may be due to the differences in particle size and hydrophobicity.",
  "description_provenance": [
    "Author Email: wangr@vt.edu",
    "Advisor Email: ryoon@exchange.vt.edu",
    "Advisor Email: dclark@vt.edu",
    "Advisor Email: jywalz@vt.edu",
    "Advisor Email: luttrell@vt.edu",
    "Advisor Email: telionis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:47Z (GMT). No. of bitstreams: 1 ETD.pdf: 2826314 bytes, checksum: 2e7e5728551f134ec171ff109bdb846d (MD5)   Previous issue date: 2010-03-31"
  ],
  "handle": "26913",
  "identifier_other": "etd-04162010-003904",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162010-003904/",
  "identifier_uri": "http://hdl.handle.net/10919/26913",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Non-Ionic Surfactant",
    "Nano-Particles",
    "Foam Stability"
  ],
  "title": "Effect of Non-Ionic Surfactants and Nano-Particles on the Stability of Foams",
  "type": "Dissertation"
}