{
  "contributor_author": "Glover, Wiljeana Jackson",
  "contributor_committeecochair": [
    "Van Aken, Eileen M.",
    "Farris, Jennifer A."
  ],
  "contributor_committeemember": [
    "Koelling, Charles Patrick",
    "Ellis, Kimberly P.",
    "Doolen, Toni L."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:47Z",
  "date_adate": "2010-05-03",
  "date_available": "2014-03-14T20:09:47Z",
  "date_issued": "2010-04-05",
  "date_rdate": "2010-05-03",
  "date_sdate": "2010-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A Kaizen event is a focused and structured improvement project, using a dedicated cross-functional team to improve a targeted work area, with specific goals, in an accelerated timeframe. Kaizen events have been widely reported to produce positive change in business results and human resource outcomes. However, it can be difficult for many organizations to sustain or improve upon the results of a Kaizen event after it concludes. Furthermore, the sustainability of Kaizen event outcomes has received limited research attention to date. This research is based on a field study of 65 events across eight manufacturing organizations that used survey data collected at the time of the event and approximately nine to eighteen months after the event. The research model was developed from Kaizen event practitioner resources, Kaizen event literature, and related process improvement sustainability and organizational change literature. The model hypothesized that Kaizen Event Characteristics, Work Area Characteristics, and Post-Event Characteristics were related to Kaizen event Sustainability Outcomes. Furthermore, the model hypothesized that Post-Event Characteristics would mediate the relationship between Kaizen Event and Work Area Characteristics and the Sustainability Outcomes. The study hypotheses were analyzed through multiple regression models and generalized estimating equations were used to account for potential nesting effects (events within organizations). The factors that were most strongly related to each Sustainability Outcome were identified. Work Area Characteristics learning and stewardship and experimentation and continuous improvement and Post-Event Characteristics performance review and accepting changes were significant direct or indirect predictors of multiple Sustainability Outcomes and these findings were generally supported by the literature. There were also some unanticipated findings, particularly regarding the modeling of Sustainability Outcomes result sustainability and goal sustainability, which appear to illustrate potential issues regarding how organizations define and track the performance of Kaizen events over time and present areas for future research. Overall, this study advances academic knowledge regarding Kaizen event outcome sustainability. The findings also present guidelines so that practitioners may better influence the longer-term impact of Kaizen events on their organizations. The research findings may also extend to other improvement activities, thus presenting additional areas for future work.",
  "description_provenance": [
    "Author Email: wjglover@vt.edu",
    "Advisor Email: evanaken@vt.edu",
    "Advisor Email: jennifer.farris@ttu.edu",
    "Advisor Email: koelling@vt.edu",
    "Advisor Email: kpellis@vt.edu",
    "Advisor Email: doolen@engr.orst.edu",
    "Made available in DSpace on 2014-03-14T20:09:47Z (GMT). No. of bitstreams: 7 s05_439_Cont_1.pdf: 154043 bytes, checksum: c036435ab405ca7ec85805dbc6a0bf12 (MD5) s05_439_Cont_2.pdf: 254460 bytes, checksum: 5120525a1de8ac61b4427c894b8ddd01 (MD5) s05_439_Cont_3.pdf: 255227 bytes, checksum: b89e1efc5343806cf951d58cda6118c4 (MD5) s05_439_Cont_4.pdf: 255161 bytes, checksum: 190f070d2655d9bc9cd365c70e7389d5 (MD5) s05_439_OriginalApproval.pdf: 56850 bytes, checksum: 1f04897ca757acd3df5a556470c04b13 (MD5) s05_439_Amend_Glover.pdf: 253866 bytes, checksum: 2212cb2d27414ef8c4b37afbffd6f2be (MD5) Glover_WJ_D_2010.pdf: 2608887 bytes, checksum: cf6a296f987d664bf811419611f53e2c (MD5)   Previous issue date: 2010-04-05"
  ],
  "handle": "26914",
  "identifier_other": "etd-04162010-104939",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162010-104939/",
  "identifier_uri": "http://hdl.handle.net/10919/26914",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "s05_439_Cont_1.pdf",
    "s05_439_Cont_2.pdf",
    "s05_439_Cont_3.pdf",
    "s05_439_Cont_4.pdf",
    "s05_439_OriginalApproval.pdf",
    "s05_439_Amend_Glover.pdf",
    "Glover_WJ_D_2010.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Kaizen",
    "Kaizen event",
    "Teams",
    "Lean production",
    "Improvement sustainability"
  ],
  "title": "Critical Success Factors for Sustaining Kaizen Event Outcomes",
  "type": "Dissertation"
}