{
  "contributor_author": "Whelton, Andrew James",
  "contributor_committeechair": "Dietrich, Andrea M.",
  "contributor_committeemember": [
    "Edwards, Marc A.",
    "Love, Brian J.",
    "Tanko, James M.",
    "Gallagher, Daniel L."
  ],
  "contributor_department": "Environmental Engineering",
  "date_accessioned": "2014-03-14T20:09:47Z",
  "date_adate": "2009-05-04",
  "date_available": "2014-03-14T20:09:47Z",
  "date_issued": "2009-04-02",
  "date_rdate": "2012-03-27",
  "date_sdate": "2009-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "While more than 100 years of research has focused on removing acute and chronic health threats from water, substantially less study has focused on potable water infrastructure and water quality deterioration, monitoring technologies, and relationships between water taste and consumer health. These knowledgeâ  gaps have left infrastructure users, owners, regulators, and public health professionals largely unaware of how premise and buried polymer water pipes deteriorate and sorb/ desorb organic contaminants during normal operations and following water contamination events. These knowledgeâ  gaps also prevent infrastructure managers from producing drinking water that optimizes mineral content for both water taste and health benefits, and employing a monitoring tool capable of immediately detecting water contamination or equipment failures.  <p> Research was conducted to address these challenges using analytical chemistry, environmental engineering, food science, polymer chemistry, public health, and material science principles. This work was enhanced by collaborations with sixteen American water utilities and the National Institute for Standards and Technology. These efforts were funded by the National Science Foundation, American Water Works Association, and the Water Research Foundation.  <p> Research results are unique and provide important scientific contributions to the public health, potable water, and material science industries. Particular achievements include the: (1) Evaluation of linkages between minerals, water palatability, and health useful for water production and public health decisions; (2) Creation of a novel infrastructure and water quality surveillance tool that has begun water utility implementation in the USA; (3) Development of an accelerated chlorinated water aging method with stable water pH, free chlorine, and alkalinity concentration that enables interpretation of polymer pipe surface and bulk characteristic changes; (4) Discovery that polar compounds are 2â  193% more soluble in PEX than HDPE water pipes; (5) Finding that several polymer and contaminant properties can be used to predict contaminant diffusivity and solubility during sorption and desorption in new, lab aged, and water utility PE pipes; and the (6) Discovery that chlorinated water exposure of HDPE and PEX pipes increases polar contaminant diffusivity during sorption by 50â  162% and decreases diffusivity during desorption as much as 211%. Outcomes of this work have domestic and global significance, and if engaged, can greatly improve public health protection, potable water infrastructure operations, water quality, sustainability, and regulation.",
  "description_provenance": [
    "Author Email: awhelton@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Advisor Email: edwardsm@vt.edu",
    "Advisor Email: bjlove@umich.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: dang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:47Z (GMT). No. of bitstreams: 1 FINALWheltonDissertationMay09.pdf: 2341865 bytes, checksum: e43b69c0d9fd0903bce99d576288d921 (MD5)   Previous issue date: 2009-04-02"
  ],
  "handle": "26910",
  "identifier_other": "etd-04162009-113815",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162009-113815/",
  "identifier_uri": "http://hdl.handle.net/10919/26910",
  "publisher": "Virginia Tech",
  "relation_haspart": "FINALWheltonDissertationMay09.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "infrastructure",
    "Water",
    "degradation",
    "health",
    "taste",
    "polyethylene",
    "pipe",
    "polymer"
  ],
  "title": "Advancing Potable Water Infrastructure through an Improved Understanding of Polymer Pipe Oxidation, Polymerâ  Contaminant Interactions, and Consumer Perception of Taste",
  "type": "Dissertation"
}