{
  "contributor_author": "Davis, Sharrika D.",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeecochair": "Miyazaki, Yasuo",
  "contributor_committeemember": [
    "Alexander-Floyd, Nikol G.",
    "Janosik, Steven M.",
    "Ridgwell, Diana M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:47Z",
  "date_adate": "2009-05-07",
  "date_available": "2014-03-14T20:09:47Z",
  "date_issued": "2009-04-02",
  "date_rdate": "2009-05-07",
  "date_sdate": "2009-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Education is one key to economic prosperity and a predictor of overall life satisfaction. The further one progresses through the educational pipeline, the more likely it is that she may prosper. However, in a society bolstered by patriarchal systems, economic and educational inequalities exist among the genders.      Educational aspirations are influenced by studentsâ   socialization experiences. Faculty teach students about their discipline. Families influence educational pursuits. Peers serve as reinforcements or challenges to academic progress. All three groups are socialization agents to students pursuing higher education.      Research indicates that various socialization agents influence whether students pursue an undergraduate degree. However, there is little literature specifically focused on women and less on the relationship between womenâ  s undergraduate socialization experiences and their decision to enroll in graduate studies.      The purpose of this study was to determine whether certain collegiate experiences (with family, faculty and peers) predict undergraduate womenâ  s expectation to enroll in graduate study and to determine if the experiences influence expectation to enroll by race. The sample included women who completed the College Student Experiences Questionnaire (CSEQ) Fourth edition. The study employed logistic regression to explore the relationship between undergraduate womenâ  s educational aspirations and family, faculty and peer influences. In addition, I examined whether the associations between family, faculty and peers differed by race/ethnicity.      The results of the logistic regression revealed that academic ability (GPA) and peer experiences influenced advanced degree aspirations. In addition, race/ethnicity does matter, i.e., being of African-American or Latina decent is associated with a higher level of advanced degree aspiration. Also, as frequency of interactions between faculty and African-American women increase â   aspiration decreases. These findings suggest that it is important to consider the various factors that influence advanced degree aspiration. This is especially important since advanced degrees can be elemental to economic prosperity.",
  "description_provenance": [
    "Author Email: davissd@vt.edu",
    "Advisor Email: ngaf@rci.rutgers.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: yasuom@vt.edu",
    "Advisor Email: dridgwel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:47Z (GMT). No. of bitstreams: 1 SDDavis_Dissertation_2009_PDF.pdf: 554740 bytes, checksum: d58d5ae6966722b33460be0e1a953567 (MD5)   Previous issue date: 2009-04-02"
  ],
  "handle": "26911",
  "identifier_other": "etd-04162009-153054",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04162009-153054/",
  "identifier_uri": "http://hdl.handle.net/10919/26911",
  "publisher": "Virginia Tech",
  "relation_haspart": "SDDavis_Dissertation_2009_PDF.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "family",
    "faculty",
    "peers",
    "race/ethnicity",
    "aspirations",
    "women",
    "Graduate school"
  ],
  "title": "Factors Influencing Undergraduate Women's Educational Aspirations",
  "type": "Dissertation"
}