{
  "contributor_author": "Taylor, Martha Asterilla",
  "contributor_committeechair": "Crockett, Jean B.",
  "contributor_committeemember": [
    "Richards, Robert R.",
    "Yakimowski-Srebnick, Mary E.",
    "Dawson, Christina M.",
    "Parks, David J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:50Z",
  "date_adate": "2002-04-26",
  "date_available": "2014-03-14T20:09:50Z",
  "date_issued": "2002-01-28",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "EDUCATING ADOLESCENTS IN THE CONTEXT OF SECTION 504 POLICY:  A COMPARATIVE STUDY OF TWO MIDDLE SCHOOLS By  Martha Asterilla Taylor  Jean B. Crockett, Ph.D.  Chairperson  Educational Leadership and Policy Studies  (ABSTRACT)   Section 504 \"prohibits discrimination against persons with disabilities by school districts receiving federal financial assistance\" (First & Curcio, 1993, p.33). In public schools, eligible students receive an Individualized Accommodation Plan (IAP), guaranteeing a free appropriate public education (FAPE) and equitable access to educational opportunities (Bateman, 1996). Interest in Section 504 has grown among school personnel, especially in the use of this mandate for students with attention deficit hyperactivity disorder (ADHD). Additionally, the number of students with IAPs has increased nationally, in Virginia, and in the school district studied (Elementary and Secondary Schools Compliance Reports, 1994 & 1997). It has been hypothesized that these increases are attributable to ADHD. Therefore, the purpose of this study was to explore who these adolescents are and how they are served under Section 504 policy in two middle schools in southeastern Virginia. A comparative case study design was used to explore Section 504 policy implementation through within and cross-case comparisons of data from documents and interviews with administrators and teachers about the number and content of IAPs, and decision-making pertaining to the Section 504 process. Grounded theory was used to generate propositions relative to how demographic profiles and IAP content are affected by the implementation process. Results identified relevant themes and factors as awareness of procedures, time, costs, and school profiles. The findings of this study are intended to raise stakeholder awareness about Section 504 decision-making practices and their influence on services for students, and to inform Section 504 staff developers of training needs.",
  "description_provenance": [
    "Author Email: mtaylor@vbcps.k12.va.us",
    "Advisor Email: rrr777@whro.net",
    "Advisor Email: Yakimowski@aol.com",
    "Advisor Email: tdawson@antiochsea.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:50Z (GMT). No. of bitstreams: 4 04Appendices.pdf: 197373 bytes, checksum: b7907cf53e0f00fe32bae89a176431c9 (MD5) 01Chapters1-2-3.pdf: 554172 bytes, checksum: c58df07122b95cee725a1f6ae9b45ade (MD5) 03Chapter5.pdf: 136527 bytes, checksum: 2c10be59cece985fbea71044dad953c3 (MD5) 02Chapter4.pdf: 401549 bytes, checksum: b6e1e9c3b5fe17b1d1bb49843500d522 (MD5)   Previous issue date: 2002-01-28"
  ],
  "handle": "26928",
  "identifier_other": "etd-04172002-134658",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172002-134658/",
  "identifier_uri": "http://hdl.handle.net/10919/26928",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "04Appendices.pdf",
    "01Chapters1-2-3.pdf",
    "03Chapter5.pdf",
    "02Chapter4.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "accommodations",
    "adolescents",
    "middle school",
    "Section 504",
    "ADHD"
  ],
  "title": "Educating Adolescents in the Context of Section 504 Policy: a Comparative Study of Two Middle Schools",
  "type": "Dissertation"
}