{
  "contributor_author": "Ross, John D.",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Burnsed, C. Vernon",
    "Cennamo, Katherine",
    "Holmes, Glen A.",
    "Husser, John",
    "Magliaro, Susan G."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:49Z",
  "date_adate": "1999-04-27",
  "date_available": "2014-03-14T20:09:49Z",
  "date_issued": "1999-04-15",
  "date_rdate": "2000-04-27",
  "date_sdate": "1999-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Students of all abilities and ranges of achievement have become familiar with a variety of hypermedia-based settings which offer information on virtually any content area. The concept of self-regulation implies that learners can initiate processes to facilitate learning regardless of their perceived learning ability or environment, two learning characteristics once thought to be immutable forces. The purpose of the study was to design and implement hypermedia components that provide various levels of user support based upon known self-regulatory learning strategies. The components were applied within an existing web-based learning environment which combined class lecture and presentation with web-based components. Student input provided impetus for the revision of existing components and suggestions for new components designed to promote regulatory behavior within the web-based environment. Through participant observation, student desires for hypermedia components which promote self-regulatory behaviors are described and compared with the actual usage patterns of these components. Significant differences were found in measures of students perceived level of self-efficacy for performance and learning, metacognitive self-regulation, and test anxiety. In addition, one of the added components was rated as \"highly effective\" by the participants and the second-most-used component of the web site. Discussion incorporates student input to provide support for incorporating components which promote self-regulatory learning strategies in a hypermedia instructional environment and offers generalizations for educators and instructional designers based on these findings.",
  "description_provenance": [
    "Author Email: JohnRoss@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: Vernon.Burnsed@vt.edu",
    "Advisor Email: cennamo@vt.edu",
    "Advisor Email: gholmes@vt.edu",
    "Advisor Email: John.Husser@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:49Z (GMT). No. of bitstreams: 1 Ross.pdf: 1155948 bytes, checksum: 501490738ab236f7263771cdf97e7e6a (MD5)   Previous issue date: 1999-04-15"
  ],
  "handle": "26921",
  "identifier_other": "etd-041699-103444",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041699-103444/",
  "identifier_uri": "http://hdl.handle.net/10919/26921",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ross.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "web-based instruction",
    "self-efficacy",
    "metacognition",
    "instructional design"
  ],
  "title": "Regulating Hypermedia: Self-regulation learning strategies in a hypermedia environment",
  "type": "Dissertation"
}