{
  "contributor_author": "Robbins, Janice Irene",
  "contributor_committeechair": "Lichtman, Marilyn V.",
  "contributor_committeemember": [
    "Brusic, Sharon A.",
    "Saurino, Dan R.",
    "Kurstedt, Harold A. Jr.",
    "Sherman, Thomas M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:50Z",
  "date_adate": "2001-05-07",
  "date_available": "2014-03-14T20:09:50Z",
  "date_issued": "2001-04-25",
  "date_rdate": "2002-05-07",
  "date_sdate": "2001-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Women remain underrepresented in computer technology careers and university majors, and adolescent girls shy away from high school computer science courses.  More information is needed about females who are attracted to computer technology.  This study describes the online activities of young adolescent girls ages 12-14 who are high-end users of computer technology.  Three developmental tasks of adolescence (search for identity, pursuit of social connections, and desire for a sense of competence and accomplishment) were used to frame explorations of the girls' online activities.  Eight girls were interviewed, the personal web sites of six girls were analyzed, and postings on a message board for young girls interested in online activities were reviewed.  Patterns and themes that emerged from the data indicated that Internet technology was an effective match for the informants' developmental tasks.  Specific inferences included: (1)Online technologies offered the informants multiple ways of negotiating social relationships; (2) Internet use supported the informants' engagement in personalized, self-directed, and self-initiated learning; (3) Support from parents, siblings, and peers provided the environment for each girl to develop confidence and competence in Internet use; and(4) The informants' use of the internet reflected women's ways of knowing.",
  "description_provenance": [
    "Author Email: vaeducator@aol.com",
    "Advisor Email: brusic@vt.edu",
    "Advisor Email: saurino@vt.edu",
    "Advisor Email: hak@vt.edu",
    "Advisor Email: tsherman@vt.edu",
    "Advisor Email: mlichtma@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:50Z (GMT). No. of bitstreams: 1 FinalModified.pdf: 1018761 bytes, checksum: 6e598ead2a8f26045b3614d67a9d0c9a (MD5)   Previous issue date: 2001-04-25"
  ],
  "handle": "26927",
  "identifier_other": "etd-04172001-205444",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172001-205444/",
  "identifier_uri": "http://hdl.handle.net/10919/26927",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalModified.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "confidence",
    "electronic communications",
    "gender",
    "peer relations"
  ],
  "title": "Making Connections:Adolescent Girls' Use of the Internet",
  "type": "Dissertation"
}