{
  "contributor_author": "Myers, Lawrence H.",
  "contributor_committeechair": "Earthman, Glen I.",
  "contributor_committeemember": [
    "Richards, Robert R.",
    "Dawson, Christina M.",
    "Carlton, Patrick W.",
    "Yakimowski-Srebnick, Mary E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:49Z",
  "date_adate": "1999-04-24",
  "date_available": "2014-03-14T20:09:49Z",
  "date_issued": "1999-01-19",
  "date_rdate": "2000-04-24",
  "date_sdate": "1999-04-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The primary purpose of this study is to examine the reasons for attrition of doctoral candidates in the College of Human Resources and Education in the Department of Educational Leadership and Policy Studies at Virginia Polytechnic Institute and State University.   Graduate students granted candidacy status have fulfilled the following requirements: successful completion of course work, successful completion of the written and oral preliminary examinations, and completion of the residency requirement. The population for this study was students, identified by the Office of Graduate Studies, who attained doctoral candidacy between 1983-1992. During this period, 94 students out of 354 attaining candidacy did not complete the degree. From the 94 students identified, 55 students were eliminated by the Educational Leadership and Policy Studies faculty for one of the following reasons: the student is presently working on dissertation with faculty member, the student was advised not to continue after preliminary examination, or the student was not in the EDAD program, thus leaving 39 candidates. By limiting the study to doctoral candidates who have not completed the degree, it is possible to focus on the experiences of candidates who most likely will not obtain a doctorate.   The focus of this study was to develop a picture of how the doctoral degree attrition evolves over time. This was to be accomplished by allowing candidates the opportunity to expound on the doctoral degree experience in a semistructured interview setting. Responses from semistructured interviews were analyzed in order to reconstruct the experiences of those candidates who did not complete the degree and also to determine which barriers were dominant in the process.   Results of the interviews were analyzed first for differences between candidates' opinions in general, and then to identify factors that each candidate perceived had promoted, had no effect on, or had impeded degree completion. Also, factors that most affect the decision not to complete the doctoral degree as ranked by the candidates were analyzed.   Candidate responses revealed that time and financial management along with professional obligations and personal reasons were the most significant factors in degree non-completion. A secondary factor was that of financial concern and inability of how to obtain information and resources to address this concern.   Findings of this study permitted the researcher to identify several factors affecting doctoral degree completion at one institution; the next step might be to operationalize these factors by describing the patterns of attrition, desegregating attrition by the stages of study, and identifying connections between the levels of attrition at various levels.",
  "description_provenance": [
    "Author Email: l.myers@worldnet.att.net",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: robertr@vt.edu",
    "Advisor Email: tdawson@vt.edu",
    "Advisor Email: carltonp@vt.edu",
    "Advisor Email: yakimowski@aol.com",
    "Made available in DSpace on 2014-03-14T20:09:49Z (GMT). No. of bitstreams: 1 LHMyers.PDF: 244942 bytes, checksum: 954574d4267f2ba69f55d3c55da4127e (MD5)   Previous issue date: 1999-01-19"
  ],
  "handle": "26922",
  "identifier_other": "etd-041699-125349",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041699-125349/",
  "identifier_uri": "http://hdl.handle.net/10919/26922",
  "publisher": "Virginia Tech",
  "relation_haspart": "LHMyers.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "barriers",
    "attrition",
    "completion",
    "doctoral candidates"
  ],
  "title": "Barriers to Completion of the Doctoral Degree in Educational Administration",
  "type": "Dissertation"
}