{
  "contributor_author": "Jones, David Lawrence",
  "contributor_committeechair": "McCleary, Ken W.",
  "contributor_committeemember": [
    "Sirgy, M. Joseph",
    "Uysal, Muzaffer S.",
    "Murrmann, Suzanne K.",
    "Weaver, Pamela A."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:09:49Z",
  "date_adate": "2000-04-20",
  "date_available": "2014-03-14T20:09:49Z",
  "date_issued": "2000-03-24",
  "date_rdate": "2001-04-20",
  "date_sdate": "2000-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Relationship/collaborative selling, as opposed to traditional, transaction oriented selling, stresses the need to form relationships with prospects and customers across all stages of the buyer-seller relationship (Jolson, 1997).  The problem is that applying the relationship selling process to all types of customers may lead to inappropriate interpersonal interaction if the customer's orientation is only short-term in nature (Jackson, 1985a, 1985b).  Anderson and Narus (1991) make the point that significant variations within industries (i.e., hotel industry) can exist in the buyer's expectation of working relationships with sellers, from a collaborative relationship desire to a transactional (i.e., discrete) relationship.  This study developed and empirically tested a model of international buyer-seller relationships in the hospitality industry.  The model analyzed several relationships: 1) the relationship between National Culture (Hofstede, 198oa, 1980b & 1997) and the interpersonal interaction \"success\" variables (i.e., structural bonding, social bonding, communication content, communication style, and trust) in the buyer-seller relationship (Wilson, 1995); 2) the relationship between the \"success\" variables and the outcomes of the buyer-seller relationship (i.e., relationship commitment and long-term orientation of the buyer); and 3) the relationship between the level of knowledge of the selling strategy used by the salesperson and the buying preferences of the buyer, as perceived by the salesperson. In addition, each of these relationships was examined in terms of the differences that may exist in base of operation of the salesperson (i.e., North America or Asia).  The study specifically focused on the hotel industry salesperson and the relationship he or she has with his or her top account.  The cross-cultural differences were captured by use of a sample of salespeople that were based either in North America or Asia.  The results of this study showed that the relationship/collaborative selling strategy is not necessarily appropriate for all selling situations, but the salesperson may not be knowledgeable enough of his or her customer's preference for interpersonal interaction to be able to identify that fact.  It also indicated that different importance is placed on different \"success\" variables in the buyer-seller relationship in different bases of operation.  Specifically, trust is more important in North America than Asia, but it is still an important factor in both selling environments. It was also concluded that social bonding might be overrated in regards to the top account buyer-seller relationship.  The conclusion can be made that more emphasis needs to be placed on the building and maintaining of trust than the need to \"build a relationship\" through social bonding, at least with the top account.  The implications of the study can be applied to the improvement of how sales training is taught on a global basis.",
  "description_provenance": [
    "Author Email: jonesdlj@ccmail.nevada.edu",
    "Advisor Email: sirgy@vt.edu",
    "Advisor Email: samil@vt.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: mccleary@vt.edu",
    "Advisor Email: weaver@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:49Z (GMT). No. of bitstreams: 4 pretest.pdf: 32175 bytes, checksum: 9c02d93ea5cd1ff541a888fdfcfec08a (MD5) vita.pdf: 26255 bytes, checksum: 0d2b94d595a4ec8c67f730438d19ef7c (MD5) survey.pdf: 48792 bytes, checksum: 40db1af621d6282acce94d120fd84432 (MD5) dissertation.pdf: 1062540 bytes, checksum: b651ca0dcd4e8d24e3fdfa349c087ec2 (MD5)   Previous issue date: 2000-03-24"
  ],
  "handle": "26924",
  "identifier_other": "etd-04172000-15380059",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172000-15380059/",
  "identifier_uri": "http://hdl.handle.net/10919/26924",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "pretest.pdf",
    "vita.pdf",
    "survey.pdf",
    "dissertation.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Communication",
    "Trust",
    "Social Bonding",
    "National Culture",
    "Hotel Sales",
    "Buyer-Seller Relationships"
  ],
  "title": "A Determination of Interpersonal Interaction Expectations in International Buyer-Seller Relationships",
  "type": "Dissertation"
}