{
  "contributor_author": "Cagle, Caroline Woodell",
  "contributor_committeechair": "Pitt, Joseph C.",
  "contributor_committeemember": [
    "Burian, Richard M.",
    "Lee, John A. N.",
    "La Berge, Ann F.",
    "Reeves, Barbara J."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:09:50Z",
  "date_adate": "2003-04-25",
  "date_available": "2014-03-14T20:09:50Z",
  "date_issued": "2002-12-03",
  "date_rdate": "2004-04-25",
  "date_sdate": "2003-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The rise of English Protestantism produced a curious phenomenon in early modern England:  the silencing of pipe organs in cathedrals and parish churches across the land.  During the sixteenth and seventeenth centuries, this ecclesiastical instrument figuratively embodied and literally gave voice to the Roman Catholic Church.  Because this ancient technology was perceived to be emblematic of much that was despised in Catholic ritual, it came under assault by the Anglicans, the Puritans, the Monarchy, the Parliament, Oliver Cromwellâ  s army, and even the militant rabble-rouser in the street.  My dissertation shows that it was the symbolic role played by the organ that bore the responsibility for this violence.  My hypothesis is further enhanced by an investigation of the events immediately following the Commonwealth Era, when the Restoration of the Monarchy resulted in the restoration of the pipe organ. In this detailed case study, I examine the role of the organ as a stable technology in the unstable society of early modern England.  During the time that the ecclesiastical organ personified the Roman Catholic Church, it was persecuted.  As soon as the balance of power shifted, this symbolism was no longer significant and the King of Instruments was restored to its long-accustomed place in the service of worship in English society.  My analysis of the multifaceted relationship that existed between this well-established, essentially transparent technology and the diverse social structures that attempted to annihilate it shows the significance of using the concept of technology as symbol as an appropriate analytical category for interpreting the history of the organ in early modern England.",
  "description_provenance": [
    "Author Email: cagle@obu.edu",
    "Advisor Email: rmburian@vt.edu",
    "Advisor Email: jcpitt@vt.edu",
    "Advisor Email: alaberge@vt.edu",
    "Advisor Email: reeves@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:50Z (GMT). No. of bitstreams: 3 Body.pdf: 2320812 bytes, checksum: 8788c341c9607c9ca930c6d281f18407 (MD5) Front.pdf: 131649 bytes, checksum: e3eaa7d03b4dca24b2790cf07d2cbcc3 (MD5) Back.pdf: 73719 bytes, checksum: daa0fe620812559a8de26af6d217d4a5 (MD5)   Previous issue date: 2002-12-03"
  ],
  "handle": "26929",
  "identifier_other": "etd-04172003-005110",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172003-005110/",
  "identifier_uri": "http://hdl.handle.net/10919/26929",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Body.pdf",
    "Front.pdf",
    "Back.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Scientific Revolution",
    "Royal Society",
    "Renatus Harris",
    "Bernard Smith"
  ],
  "title": "Technology in Society: The Pipe Organ in Early Modern England",
  "type": "Dissertation"
}