{
  "contributor_author": "Froggett, Patricia Dowling",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeecochair": "Klunk, Clare D.",
  "contributor_committeemember": [
    "Lalik, Rosary V.",
    "Black, Bernadette"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:51Z",
  "date_adate": "2007-04-27",
  "date_available": "2014-03-14T20:09:51Z",
  "date_issued": "2007-04-04",
  "date_rdate": "2010-04-27",
  "date_sdate": "2007-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research was conducted to develop a richer understanding of resistant behavior displayed by adults in the adult learning environment. Resistant behavior occurs when a student declines the learning opportunity by mentally withdrawing, or by co-opting the instructorâ  s agenda, or by attacking the instructor directly. This research addressed two questions. The first was, â  How do instructors perceive the underlying dynamics, or causes they cite, of the hostile resistant behavior they have observed and experienced in the learning environment?â   The second question was â  How do instructors interpret episodes of hostile resistant behavior?â   This qualitative research provides an in depth exploration of the experiences of the participating instructors with hostile resistant behavior in adult graduate education. The participants were veteran teachers accustomed to handling resistant behavior, yet this experience stopped them in their tracks. The hostile resistant behaviors may represent a subcategory of resistance not previously researched, and could happen to anyone. This could be challenging for the most seasoned professional. Interviews were guided by grounded theory concepts as described by Strauss and Corbin. Open-ended interviews were modeled on the work of Seidman. The selected instructors had a minimum of twenty years experience in higher education. They were professionally adept, seasoned educators of adults. Key findings were that: participants were unable to anticipate the onset of resistant behavior; the behavior was persistent and intense; the instructors were unable to isolate causes or develop effective coping strategies; the instructorsâ   emotional reactions included a pattern of surprise, confusion, and cynicism; the emotional impact on the participants was often strong and lasting. The dissertation provided recommendations for further research in instructor-centric; student- centric; and institution-centric categories. Instructor-centric recommendations included: expansion into additional academic disciplines and the training world; effect of on-line delivery methods; impact on instructorsâ   professional reputations; and transformational experience. Student-centric recommendations addressed changes that might be associated with the make up of the student body, such as age and culture; and the effect of the resistant behavior on other members of the class. Institution-centric recommendations included suggestions regarding hostile work environment; protective measures for instructors; and institutionalized support networks.",
  "description_provenance": [
    "Author Email: froggett@comcast.net",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: rlalik@vt.edu",
    "Advisor Email: bblack@virginia.edu",
    "Advisor Email: cdklunk@yahoo.com",
    "Made available in DSpace on 2014-03-14T20:09:51Z (GMT). No. of bitstreams: 1 Dissertation_final_etd_resubmitted_25_apr_07.pdf: 1028448 bytes, checksum: 0c36ec502e29d2807c3722066db97d60 (MD5)   Previous issue date: 2007-04-04"
  ],
  "handle": "26937",
  "identifier_other": "etd-04172007-210248",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172007-210248/",
  "identifier_uri": "http://hdl.handle.net/10919/26937",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_final_etd_resubmitted_25_apr_07.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Hostility",
    "Graduate Education",
    "Behavior",
    "Adult Learning",
    "Resistance"
  ],
  "title": "Toward a Deeper Understanding of the Nature of Resistant Behaviors by Adult Learners in Graduate Education",
  "type": "Dissertation"
}