{
  "contributor_author": "Grzeskowiak, Stephan",
  "contributor_committeechair": "Brown, James R.",
  "contributor_committeecochair": "Lambe, C. Jay",
  "contributor_committeemember": [
    "Hatfield, Donald E.",
    "Sirgy, M. Joseph",
    "Littlefield, James E."
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:09:51Z",
  "date_adate": "2006-07-06",
  "date_available": "2014-03-14T20:09:51Z",
  "date_issued": "2006-03-31",
  "date_rdate": "2006-07-06",
  "date_sdate": "2006-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Current marketing channel literature overwhelmingly suggests that entering exchange relationships leads to positive outcomes for the exchange parties. Yet, not all exchanges employ relational exchange. Thus, research appears to lack an understanding of the boundary conditions of successful relational exchange.  This dissertation contributes to filling this gap by clarifying what is understood as relational exchange and differentiating it from vertical integration. Here, a two-dimensional perspective on exchange structure is offered that integrates our view of relational exchange and extends the conceptualization of vertical integration beyond sole ownership.  To derive boundary conditions of relational exchange the literature on interorganizational relationships is integrated into six determinants and two key outcomes of relational exchange. These boundary conditions thus represent the facilitating circumstances that make relational exchange viable and the outcomes of relational exchange that exchange partners seek to achieve.",
  "description_provenance": [
    "Author Email: sgrzesko@vt.edu",
    "Advisor Email: hatfield@vt.edu",
    "Advisor Email: sirgy@vt.edu",
    "Advisor Email: jlambe@vt.edu",
    "Advisor Email: jalittle@vt.edu",
    "Advisor Email: J.Brown@mail.wvu.edu",
    "Made available in DSpace on 2014-03-14T20:09:51Z (GMT). No. of bitstreams: 1 grzeskowiak.pdf: 3437496 bytes, checksum: f4093dc9009c1b4b7157d6d61070622f (MD5)   Previous issue date: 2006-03-31"
  ],
  "handle": "26935",
  "identifier_other": "etd-04172006-172726",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172006-172726/",
  "identifier_uri": "http://hdl.handle.net/10919/26935",
  "publisher": "Virginia Tech",
  "relation_haspart": "grzeskowiak.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Opportunism",
    "Dependence",
    "Transaction Costs",
    "Vertical Integration",
    "Performance",
    "Relational Exchange"
  ],
  "title": "An Empirical Examination of Boundary Conditions of Relational Exchange",
  "type": "Dissertation"
}