{
  "contributor_author": "Jackson, Deborah R.",
  "contributor_committeechair": "Gatewood, Thomas E.",
  "contributor_committeemember": [
    "Hinson, Kenneth E.",
    "Wilson, Melvin Skip",
    "Lalik, Rosary V."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:09:51Z",
  "date_adate": "2006-04-24",
  "date_available": "2014-03-14T20:09:51Z",
  "date_issued": "2006-03-29",
  "date_rdate": "2006-04-24",
  "date_sdate": "2006-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The International Baccalaureate Middle Years Program: A Comparison of the Standards of Learning Achievement Levels by Total Group and Ethnicity <p>  Deborah R. Jackson<p>  Dr. Tom Gatewood, Chair <p>  (ABSTRACT)<p>  The purpose of the study was to examine the Standards of Learning (SOL) test results of students participating in an International Baccalaureate Middle Years Program (IBMYP) and compare their achievement with students of similar ability in schools not authorized to offer the Middle Years Program (MYP). It was important to determine if the MYP students, who were learning in a different and more holistic manner, were still competitive with their counterparts on standardized achievement measures.   The study was guided by four questions: (1) To what extent is there a difference between the SOL achievement scores of students in an IBMYP and the SOL achievement scores of students not in an IBMYP?; (2)  To what extent is there a difference between the SOL achievement scores for Black students in an IBMYP and the SOL achievement scores of  Black students not in an IBMYP?;  (3)  To what extent is there a difference between the SOL achievement scores for Hispanic students in an IBMYP and the SOL achievement scores of Hispanic students not in an IBMYP?;  (4)  To what extent is there a difference between the SOL achievement scores for White students in an IBMYP and the SOL achievement scores of  White students not in an IBMYP?   The study was organized into intervention and control groups, which were statistically similar.  In order to determine if the groups were statistically similar at the onset of the study, baseline data were established. One group of eighth grade students who were participating in the MYP program (intervention) and a non-participating group of eighth grade students (control) were matched by their Grade 5 VA Standards of Learning (SOL) achievement scores and ethnicity.  The SOL data from the spring 2004 test administration were used for the study.  Independent t tests were conducted to determine to what extent, if any, was there a difference between the SOL achievement scores of students who were participating in the MYP and the SOL achievement of students not participating in the MYP.  Additionally, t tests were used to measure to what extent was there a difference between the achievement of Black, Hispanic, and White subgroups of the MYP and non-MYP students measured by their SOL scores.  The effect size was calculated to determine the strength or magnitude of the differences between the two sets of data.   The findings of the study indicated the average SOL mean scores of the total MYP group were higher than the mean scores of the total non-MYP group in all areas although there were no statistically significant differences (p<.05). The results also indicated that no statistically significant difference existed between the average SOL mean scores of Black students who participated in the MYP and Black students who participated in non-MYP schools across the division (p<.05). The results further indicated that no statistically significant differences existed between the average SOL mean scores of Hispanic students who participated in the MYP and Hispanic students who participated in non-MYP schools across the division (p<.05). Lastly, the results indicated that no statistically significant difference existed between the average SOL mean scores of White students who participated in the MYP and White students who participated in non-MYP schools across the division (p<.05).   The content area that showed the greatest difference was English: Reading, Literature, and Research (15 scaled score points).  Performance on the History/Social Science and Science SOL tests were virtually identical.  For Black and Hispanic IBMYP students, the highest levels of performance were limited to the English: Reading, Literature, and Research test.",
  "description_provenance": [
    "Author Email: Debbie.Jackson@fcps.edu",
    "Advisor Email: Kenneth.Hinson@fcps.edu",
    "Advisor Email: Skipw@vt.edu",
    "Advisor Email: gatewood@vt.edu",
    "Advisor Email: rlalilk@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:51Z (GMT). No. of bitstreams: 1 DissertationDeborahRJackson.pdf: 564971 bytes, checksum: ac32d6c90b8dcb06e6eb3900326ae30b (MD5)   Previous issue date: 2006-03-29"
  ],
  "handle": "26936",
  "identifier_other": "etd-04172006-173212",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172006-173212/",
  "identifier_uri": "http://hdl.handle.net/10919/26936",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationDeborahRJackson.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Middle Years Program",
    "IBMYP",
    "MYP",
    "MYP and achievement",
    "International Baccalaureate Middle Years Program",
    "IBO",
    "International Baccalaureate Organization"
  ],
  "title": "The International Baccalaureate Middle Years Program: A Comparison of the Standards of Learning Achievement Levels by Total Group and Ethnicity",
  "type": "Dissertation"
}