{
  "contributor_author": "McArdle, Joseph Jude",
  "contributor_committeecochair": [
    "Braun, Allen R.",
    "Bell, Martha Ann"
  ],
  "contributor_committeemember": [
    "Friedman, Bruce H.",
    "Harrison, David W.",
    "Hoffman, Kurt A.",
    "Schulman, Robert S."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:09:51Z",
  "date_adate": "2006-04-28",
  "date_available": "2014-03-14T20:09:51Z",
  "date_issued": "2006-04-03",
  "date_rdate": "2009-04-28",
  "date_sdate": "2006-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "SEMANTICALLY BASED LEXICAL PROCESSING YIELDS UNIQUE TOPOGRAPHIC CONTRIBUTIONS TO THE SPEECH BEREITSCHAFTSPOTENTIAL By Joseph J. McArdle Martha Ann Bell, Ph.D. & Allen R. Braun, M.D., Co-Chairs The Bereitschaftspotential (BP) is an event related potential believed to reflect motor planning and preparedness. Although the relationship between the BP and volitional movements of the distal limbs is well established, studies of the BP and speech have produced inconclusive findings. The most heavily debated of these findings were reports of left lateralized hemispheric asymmetry in the BP topography, shortly before speech onset. Several researchers argued that these shifts were artifacts produced by movements of the articulatory muscles. However, methodological differences between the studies could also explain why the asymmetry was not always found. In the present study it was proposed that articulatory complexity and semantic processing each contribute to observed variations in the speech BP topography. Eighteen healthy volunteers performed 3 speech tasks, designed to distinguish semantic and articulatory contributions to the BP topography. The findings suggested that articulatory complexity and semantic processing each uniquely contribute to the frontolateral and medial BP topographic distribution. The present study also introduced the use of Doppler imaging of the tongue as a means of eliminating potential artifactual tongue movements from the speech BP.",
  "description_provenance": [
    "Author Email: mcardle@nidcd.nih.gov",
    "Advisor Email: bhfriedm@vt.edu",
    "Advisor Email: dwh@vt.edu",
    "Advisor Email: khoffma@vt.edu",
    "Advisor Email: schulman@vt.edu",
    "Advisor Email: brauna@nidcd.nih.gov",
    "Advisor Email: mabell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:51Z (GMT). No. of bitstreams: 1 dissertation04-26-06.pdf: 805023 bytes, checksum: 2562143e78e225548f25a7640ebd3279 (MD5)   Previous issue date: 2006-04-03"
  ],
  "handle": "26933",
  "identifier_other": "etd-04172006-115934",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172006-115934/",
  "identifier_uri": "http://hdl.handle.net/10919/26933",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation04-26-06.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "speech motor planning",
    "Bereitschaftspotential",
    "articulation"
  ],
  "title": "Semantically Based Lexical Processing Yields Unique Topographic Contributions to the Speech Bereitschaftspotential",
  "type": "Dissertation"
}