{
  "contributor_author": "Vaillancourt, Kourtney Ty",
  "contributor_committeechair": "Few-Demo, April L.",
  "contributor_committeemember": [
    "Arditti, Joyce A.",
    "Allen, Katherine R.",
    "DelCampo, Robert",
    "Piercy, Fred P."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:51Z",
  "date_adate": "2006-04-24",
  "date_available": "2014-03-14T20:09:51Z",
  "date_issued": "2006-04-03",
  "date_rdate": "2007-04-25",
  "date_sdate": "2006-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation used qualitative methods to gain a richer understanding of the dynamics of swinging relationships. Swinging was defined at the onset of the study as sexual activities that married couples engage in with people other than their spouse. Fourteen people (seven couples) volunteered and were interviewed to gain information about what meaning they assign to their sexual practices, and how they experienced intimacy and power in their relationships. Also included was a distinction between the secrecy and privacy practiced by swingers. Symbolic interactionism and social constructionism provide the theoretical frameworks the study. Computer mediated communication was used to conduct the interviews. Analysis of the data revealed three themes: swinging is only for committed couples, the reinforcement of heteronormative ideals, and a reconstruction of the meaning of fidelity.",
  "description_provenance": [
    "Author Email: ktvaillan8268@yahoo.com",
    "Advisor Email: arditti@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: alfew@vt.edu",
    "Advisor Email: rdelcamp@nmsu.edu",
    "Advisor Email: piercy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:51Z (GMT). No. of bitstreams: 1 KTV.Dissertation.Final.pdf: 473455 bytes, checksum: 8af3ca3e2d11e2b6f8dc9f7067527c51 (MD5)   Previous issue date: 2006-04-03"
  ],
  "handle": "26934",
  "identifier_other": "etd-04172006-154304",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172006-154304/",
  "identifier_uri": "http://hdl.handle.net/10919/26934",
  "publisher": "Virginia Tech",
  "relation_haspart": "KTV.Dissertation.Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "marriage",
    "sexuality",
    "swinging",
    "alternative relationships"
  ],
  "title": "Reconstructing the Meaning of Fidelity: A Qualitative Inquiry into Swinging Relationships",
  "type": "Dissertation"
}