{
  "contributor_author": "Flowers, Robbie Wayne",
  "contributor_committeecochair": [
    "Salom, Scott M.",
    "Kok, Loke T."
  ],
  "contributor_committeemember": [
    "Pfeiffer, Douglas G.",
    "Mullins, Donald E.",
    "Montgomery, Michael E."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:09:51Z",
  "date_adate": "2006-04-26",
  "date_available": "2014-03-14T20:09:51Z",
  "date_issued": "2006-04-10",
  "date_rdate": "2007-04-26",
  "date_sdate": "2006-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Competitive interactions among two specialist predators, <i>Laricobius nigrinus</i> Fender (Coleoptera: Derodontidae) and <i>Sasajiscymnus tsugae</i> Sasaji and McClure (Coleoptera: Coccinellidae), and a generalist predator, <i>Harmonia axyridis</i> Pallas (Coleoptera: Coccinellidae), of hemlock woolly adelgid were evaluated using laboratory, field and video studies. The two specialist predators are part of a biological control program for <i>A. tsugae</i>, and the potential for competition among these species and previously established generalist predators is unknown.  In laboratory studies of predator groups in Petri dish assays, the only significant negative effects from competition occurred among conspecifics, resulting in reduced net egg production by <i>L. nigrinus</i> and <i>H. axyridis</i> and reduced feeding by <i>H. axyridis</i>.  In contrast, heterospecific combinations showed non-interference. In longer duration field studies of predator groups, held in branch enclosures, predator survival and feeding were not significantly affected by additional predators.  Net reproduction was again significantly reduced by conspecifics, while heterospecifics showed non-interference for all predator responses. All predators reduced the number of <i>A. tsugae</i> nymphs of the next generation relative to no-predator controls; however, <i>L. nigrinus</i> had much greater impact overall due to the large number of progeny produced. Video studies revealed that predator behavior varied qualitatively and quantitatively by species, and did not appear to be coordinated temporally or spatially.  All species exhibited continuous activity patterns that were punctuated by longer periods of rest. The specialist predators were more selective of feeding and oviposition sites, and rested at more concealed locations than <i>H. axyridis</i>. Conspecifics significantly altered the time allocated to specific behaviors for <i>L. nigrinus</i> and <i>H. axyridis</i>, resulting in reduced predator effectiveness due to increased searching and decreased feeding and oviposition.  All predator groups maintained a high degree of spatial separation relative to assay size, suggesting that chemical or tactile cues may be used to regulate their distributions.  Overall, these studies suggest that the three predator species will be compatible in this system.  Management implications include using multiple-predator species combinations over single-species for biological control of <i>A. tsugae</i> and implementing low-density releases to reduce the potential negative effects of intraspecific competition.",
  "description_provenance": [
    "Author Email: roflower@vt.edu",
    "Advisor Email: salom@vt.edu",
    "Advisor Email: ltkok@vt.edu",
    "Advisor Email: dgpfeiff@vt.edu",
    "Advisor Email: mullinsd@vt.edu",
    "Advisor Email: memontgomery@fs.fed.us",
    "Made available in DSpace on 2014-03-14T20:09:51Z (GMT). No. of bitstreams: 6 Dissertation.pdf: 3642463 bytes, checksum: d6864d6b8c9d905333ff939553f7302d (MD5) Extensive_Searching.mov: 1991968 bytes, checksum: 906f20608af4fd09d27db22f750b6749 (MD5) Intensive_Searching.mov: 1572073 bytes, checksum: dcc44dbde74991c14efe2d76ba3c4c91 (MD5) Resting.mov: 47475639 bytes, checksum: 4eed4275cbd0426efbfbceff06db7b65 (MD5) Feeding.mov: 4136775 bytes, checksum: 8f531c7b12d29e30b83e35ce4785c45c (MD5) Oviposition.mov: 6973177 bytes, checksum: 7e93981dd229127cde2f5a2d055085a6 (MD5)   Previous issue date: 2006-04-10"
  ],
  "handle": "26932",
  "identifier_other": "etd-04172006-090625",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172006-090625/",
  "identifier_uri": "http://hdl.handle.net/10919/26932",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation.pdf",
    "Extensive_Searching.mov",
    "Intensive_Searching.mov",
    "Resting.mov",
    "Feeding.mov",
    "Oviposition.mov"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Harmonia axyridis",
    "Sasajiscymnus tsugae",
    "Laricobius nigrinus",
    "Hemlock woolly adelgid",
    "Predator Interactions",
    "Biological Control"
  ],
  "title": "Competitive interactions among two specialist predators and a generalist predator of hemlock woolly adelgid,  <i>Adelges tsugae </i>Annand (Hemiptera: Adelgidae)",
  "type": "Dissertation"
}