{
  "contributor_author": "Brizek, Michael George",
  "contributor_committeechair": "Khan, Mahmood A.",
  "contributor_committeemember": [
    "Partlow, Charles G.",
    "Williams, John A.",
    "Belli, Gabriella M.",
    "Schmelzer, Claire D."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:09:50Z",
  "date_adate": "2003-04-30",
  "date_available": "2014-03-14T20:09:50Z",
  "date_issued": "2003-03-29",
  "date_rdate": "2004-04-30",
  "date_sdate": "2003-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to identify the perception and relationships between corporate entrepreneurship (CE) practices and management performance.  The use of Morris and Kuratkoâ  s (2002) Corporate Entrepreneurship Assessment Instrument (CEAI) was used as the survey instrument for this study.  A sample size of 1,200 unit managers, middle managers, and top management teams (TMTs) within nine casual dining restaurant organizations were surveyed with a response of 522 subjects at a rate of 44%.  Responses of the CEAI results were studied using regression analysis and conclusions were drawn to support four out of the six hypothesis originally proposed in determining CE activity and management reinforcement.  A post test analysis was also conducted in order to reinforce the previous results of the original study.  This study concluded with the determination through an empirical analysis that forms of CE activity and enforcement are currently present within the casual dining restaurant segment.",
  "description_provenance": [
    "Author Email: mbrizek@hotmail.com",
    "Advisor Email: cpartlow@sc.edu",
    "Advisor Email: jwilliams@humec.ksu.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: cschmelz@vt.edu",
    "Advisor Email: mahmood@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:50Z (GMT). No. of bitstreams: 6 MGBPARTII1.pdf: 94540 bytes, checksum: 91e289cc212e29017233a63dd76d3ecd (MD5) letter.pdf: 33968 bytes, checksum: 430b56146ff20b08dce3ba90f1b3d2cf (MD5) letterII.pdf: 35303 bytes, checksum: a91023aded59babba747c2ae3dbec0cd (MD5) VITAE.pdf: 29619 bytes, checksum: 735fbdeb58af06b29537d1b2101837f3 (MD5) COVER.pdf: 13059 bytes, checksum: a675bbb6fe639733319e5046f3669679 (MD5) MGBPARTI1.pdf: 185823 bytes, checksum: a8c26f42010f40cdfd622c62c90c19dc (MD5)   Previous issue date: 2003-03-29"
  ],
  "handle": "26931",
  "identifier_other": "etd-04172003-170854",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172003-170854/",
  "identifier_uri": "http://hdl.handle.net/10919/26931",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "MGBPARTII1.pdf",
    "letter.pdf",
    "letterII.pdf",
    "VITAE.pdf",
    "COVER.pdf",
    "MGBPARTI1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Casual Dining Restaurant Segment",
    "Reinforcements",
    "Rewards",
    "CE Intensity",
    "Corporate Entrepreneurship"
  ],
  "title": "An Empirical Investigation of Corporate Entrepreneurship Intensity within the Casual Dining Restaurant Segment",
  "type": "Dissertation"
}