{
  "contributor_author": "Parkman, Tiffaney S.",
  "contributor_committeechair": "Arditti, Joyce A.",
  "contributor_committeemember": [
    "Allen, Katherine R.",
    "Few-Demo, April L.",
    "Piercy, Fred P."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:52Z",
  "date_adate": "2009-05-13",
  "date_available": "2014-03-14T20:09:52Z",
  "date_issued": "2009-04-01",
  "date_rdate": "2009-05-13",
  "date_sdate": "2009-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The issue of reentry has become an important topic to criminal justice scholars and to law makers due to the sheer number of incarcerated individuals being released and the rate in which they cycle back to incarceration. Despite the attention reentry issues have received recently in the areas of policy and criminal justice and recommendations offered to ameliorate problems associated with reentry, the landscape of reentry remains largely unchanged in that many prisoners are released from prison and significant numbers of them return (Austin, 2001).   Approximately 700,000 inmates were released from prisons and jails to their families and communities in 2005 (Harrison & Beck, 2006). Of those inmates, roughly 1/3rd were young adults aged 24 or younger (Mears & Travis, 2004). The outcomes for young adults (age 18-24) incarcerated at such young ages put them at overwhelming risk of a life course trajectory that includes cycles of future imprisonment and poor life outcomes such as economic hardship, poor mental and physical well being and lower life expectancy (Mears & Travis, 2004; Uggen, 2000; Western, 2002) .  This study examined the meanings of formerly incarcerated young adult men and their caregivers made in regard to reentry, caregiversâ   ability to meet reentry needs, perceptions about reliance on family and the implications of a young adult child â  returning homeâ   within the context of release from incarcerative sentencing. This goal was achieved through conducting in-depth semi-structured interviews with formerly incarcerated men between the ages of 18 and 24 and their caregivers for a total of 18 individual interviews that reflect nine young men-caregiver dyads defined as families for this study. \tThis qualitative study was informed using an integration of family life course perspective, symbolic interactionism and ecological theory. The theoretical amalgam provided the ability to examine the life course transitions of families impacted by incarceration, the perceptions and meanings made based upon the experience with incarceration while being imbedded within a socially stigmatized context of having a felony. The findings from this study suggest that upon reentry young adult men and their caregivers experienced ambivalence, happiness yet anxiety in moving forward after incarceration. This ambivalence was a major theme that was found not only in reunification, but in relying on family and in fostering independence. Caregivers were emotionally distressed as they juggled their feelings of wanting to help the young men with meeting the multiple demands placed on the family system with their concerns that he might return to his â  old ways.â   Young men were particularly distressed as they negotiated transitioning from a state of independence (prior to incarceration) to dependence as a prisoner in the criminal justice system, to depending on caregivers upon reentry. The young men in this study reported achieving financial independence from their families prior to incarceration as adolescents through illegal means which gave them adult status in their families. These â  off-timeâ   transitions before and after incarceration fueled the ambivalence and ambiguity in the young men-caregiver dyads, specifically in terms of the meanings these families made when thinking about reunification, relying on family and in fostering independence.",
  "description_provenance": [
    "Author Email: tparkman@vt.edu",
    "Advisor Email: arditti@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: alfew@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:52Z (GMT). No. of bitstreams: 1 TIFFANEYSPARKMAN.pdf: 1404567 bytes, checksum: f32b0afce46fff6009915159389d60dd (MD5)   Previous issue date: 2009-04-01"
  ],
  "handle": "26942",
  "identifier_other": "etd-04172009-123438",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172009-123438/",
  "identifier_uri": "http://hdl.handle.net/10919/26942",
  "publisher": "Virginia Tech",
  "relation_haspart": "TIFFANEYSPARKMAN.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Family Process",
    "Young Adults",
    "Prisoners",
    "Prisoner Reentry"
  ],
  "title": "The Transition to Adulthood and Prisoner Reentry: Investigating the Experiences of Young Adult Men and their Caregivers",
  "type": "Dissertation"
}