{
  "contributor_author": "Zhang, Yan",
  "contributor_committeechair": "Edwards, Marc A.",
  "contributor_committeemember": [
    "Stevens, Ann M.",
    "Vikesland, Peter J.",
    "Love, Nancy C.",
    "Dietrich, Andrea M."
  ],
  "contributor_department": "Environmental Engineering",
  "date_accessioned": "2014-03-14T20:09:52Z",
  "date_adate": "2009-05-28",
  "date_available": "2014-03-14T20:09:52Z",
  "date_issued": "2008-12-03",
  "date_rdate": "2012-03-27",
  "date_sdate": "2009-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nitrification is increasingly of concern in US potable water systems, due to changes from chlorine to chloramine as a secondary disinfectant in order to comply with new regulations for disinfectant by-products.  The ammonia that is released from the chloramine decay supports nitrification.   <p> A comprehensive literature review systematically examined the complex inter-relationships between nitrification, materials corrosion and metals release.  That analysis suggested that nitrification could accelerate decay of chloramine, enhance corrosion of water distribution system materials, and increase leaching of lead and copper to potable water under at least some circumstances.  Moreover, that certain plumbing materials would inhibit nitrification, but that in other situations the plumbing materials would enhance nitrification.  <p> Experiments verified that nitrification could affect the relative efficacy of chlorine versus chloramine in controlling heterotrophic bacteria in premise plumbing. Without nitrification, chloramine was always more persistent and effective than chlorine in controlling biofilms. But with nitrification and in pipe materials that are relatively non-reactive with chlorine, chloramine was much less persistent and less effective than chlorine.  In materials that are reactive with chlorine such as iron pipes, the relative efficacy of chloramine versus chlorine depends on the relative rate of corrosion and rate of nitrification.  High rates of corrosion and low rates of nitrification favor the use of chloramine versus free chlorine in controlling bacteria.    <p> Plumbing materials had profound impacts on the incidence of nitrification in homes.  Effects were due to toxicity (i.e., release of Cu+2), recycling of nitrate back to ammonia substrate by reaction (zero-valent iron, lead or zinc materials), or release of nutrients that are essential to nitrification by leaching from concrete or other materials.  As a general rule it was determined that concrete and iron materials encouraged growth of nitrifiers in certain oligotrophic waters, materials such as lead, PVC/plastic pipe, glass and surfaces of other materials were readily colonized by nitrifiers, and materials such as copper and brass were very toxic and relatively resistant to nitrifier colonization. <p> Dependent on circumstance, nitrification had no effect, increased or decreased aspects of materials corrosion.  Nitrification markedly increased lead contamination of low alkalinity potable water by reducing the pH.  In some cases nitrification dramatically decreased leaching of zinc to potable water from galvanized iron, because of lowered dissolved oxygen and reduced pH.  Nitrification did not affect copper solubility in low alkalinity water, but is expected to increase copper solubility in higher alkalinity waters.  Finally, nitrification in homes plumbed with PVC or plastics can drop the pH and increase leaching of lead from downstream brass materials in faucets.  This can explain why some modern homes plumbed with PVC can have more lead in water when compared to homes plumbed with copper pipe. <p> Phosphate had profound impacts on the incidence of nitrification and resulting effects on water quality.  While phosphate levels below about 5 ppb could strongly inhibit nitrification due to a nutrient limitation, nitrifiers can obtain sufficient phosphate from plastic, concrete, copper and iron pipe materials to meet nutritional needs.  High levels of phosphate inhibitor can reduce the concentration of Cu+2 ions and make nitrification more likely, but phosphate can also sometimes lower the corrosion rate and increase the stability of disinfectant and its efficacy in controlling nitrifiers.  Phosphate plays a key role in determining where, when and if problems with nitrification will occur in a given water distribution system.     <p> This work provides some new fundamental and practical insights to nitrification issues through a comprehensive literature review, lab experiments, solubility modeling and field studies.  The results and practical tools developed can be used by utilities and consumers to predict nitrification events and resulting water quality problems, and to make rational decisions about practices such as inhibitor dosing, plumbing material selection and use of whole house filters.",
  "description_provenance": [
    "Author Email: joezhang@vt.edu",
    "Advisor Email: edwardsm@vt.edu",
    "Advisor Email: ams@vt.edu",
    "Advisor Email: pvikes@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:52Z (GMT). No. of bitstreams: 1 Zhang.pdf: 1458958 bytes, checksum: d252430e3784508cadc52aee200ee457 (MD5)   Previous issue date: 2008-12-03"
  ],
  "handle": "26943",
  "identifier_other": "etd-04172009-131856",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172009-131856/",
  "identifier_uri": "http://hdl.handle.net/10919/26943",
  "publisher": "Virginia Tech",
  "relation_haspart": "Zhang.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "lead",
    "nutrient limitation",
    "Nitrification",
    "corrosion",
    "premise plumbing"
  ],
  "title": "Nitrification in premise plumbing and its effect on corrosion and water quality degradation",
  "type": "Dissertation"
}