{
  "contributor_author": "Barna, Jennifer S.",
  "contributor_committeechair": "Brott, Pamelia E.",
  "contributor_committeemember": [
    "Belli, Gabriella M.",
    "Bodenhorn, Nancy E.",
    "Glenn, William J."
  ],
  "contributor_department": "Counselor Education and Supervision",
  "date_accessioned": "2014-03-14T20:09:53Z",
  "date_adate": "2009-05-06",
  "date_available": "2014-03-14T20:09:53Z",
  "date_issued": "2009-04-03",
  "date_rdate": "2009-05-06",
  "date_sdate": "2009-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study explored the relationships between school counselors' motivational orientation, perceptions of the importance, and levels of implementation of Academic and Personal/Social Development Standards as a strategy for supporting academic achievement. A secure online survey was sent to 539 Virginia elementary school counselors; 212 completed the questionnaire reflecting a response rate of 39%. Participants rated their perceptions of the importance and their levels of implementation of 26 Virginia Academic and Personal/Social Development Standards (Virginia Department of Education, 2004). The Situational Motivation Scale (SIMS; Guay, Vallerand, & Blanchard, 2000) assessed participantsâ   type of motivation for incorporating personal/social development interventions into their programs as a strategy for supporting academic achievement. Participantsâ   ratings confirm both types of Standards are perceived as highly important for supporting academic achievement and are implemented at relatively high levels. A correlation matrix demonstrated three of the four motivation scores were not related to either perceptions of importance or to levels of implementation of either type of Virginia Standard.  Four regression models indicated that the motivation predictor variables accounted for no more than 6.3% of the variance in participantsâ   perceptions of the importance and levels of implementation of either type of Virginia Standard. Finally, the hypothesis that Intrinsic Motivation would be the most salient type of motivation for implementing Virginiaâ  s Personal/Social Development Standards as a strategy for supporting academic achievement was not supported. However, high mean scores on the Identified Regulation subscale suggest participants do possess internal motivation for incorporating personal/social development into their programs. Based on the results, several recommendations were offered. School counselors should collaborate with school leaders, embrace accountability practices, and advocate for the necessity of maintaining a comprehensive program focus. Counselor educators can familiarize students with research pertaining to the contributions of different types of development on achievement and emphasize the importance of utilizing the American School Counselor Association (ASCA) National Model (ASCA, 2005). Implications for future research include replicating this study with principals and secondary school counselors, evaluating how Standards are interpreted and applied between school counseling programs, and examining other constructs found in the motivation literature that may better explain school counselorsâ   desire to maintain a comprehensive program focus.",
  "description_provenance": [
    "Author Email: jephill3@vt.edu",
    "Advisor Email: pbrott@vt.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: wglenn@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:53Z (GMT). No. of bitstreams: 1 Barna_J_May_2009_dissertation.pdf: 1599780 bytes, checksum: d58b9b297272531975cf9b654adfaa4e (MD5)   Previous issue date: 2009-04-03"
  ],
  "handle": "26948",
  "identifier_other": "etd-04172009-191723",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172009-191723/",
  "identifier_uri": "http://hdl.handle.net/10919/26948",
  "publisher": "Virginia Tech",
  "relation_haspart": "Barna_J_May_2009_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Self-Determination Theory",
    "Personal/Social Development",
    "Motivation",
    "School Counselors",
    "Academic Achievement"
  ],
  "title": "Elementary School Counselorsâ Situational Motivation, Perception of Importance, and Level of Implementation of Personal/Social Development Standards as a Strategy for Supporting Student Academic Achievement",
  "type": "Dissertation"
}