{
  "contributor_author": "Hu, Liangming",
  "contributor_committeechair": "Hanson, Brian E.",
  "contributor_committeemember": [
    "Gandour, Richard D.",
    "Merola, Joseph S.",
    "Slebodnick, Carla",
    "Angel, Ross J."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:09:53Z",
  "date_adate": "2009-04-30",
  "date_available": "2014-03-14T20:09:53Z",
  "date_issued": "2009-04-15",
  "date_rdate": "2009-04-30",
  "date_sdate": "2009-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Hybrid inorganic-organic networks have been studied in both chemistry and materials science due to properties, (e.g. porosity, magnetic and electronic behaviors) that may lead to applications in catalysis, gas absorption and storage.  It is important to understand the different structural topologies shown by hybrid networks to help develop practical applications for these materials. The research is focused on the design and synthesis of well-defined hybrid network structures that have potential to contain molecular size cavities that can be used for catalysis and gas storage.        In the field of organic-inorganic hybrid networks, the goals are to design and synthesize 1D, 2D and 3D networks with cavities, and to characterize them by X-ray, TGA and surface area measurements. Twenty-six networks have been successfully made with interesting structure topologies. These hybrid network structures are classified into three series based on their ligands. Series I contains ten hybrid networks constructed from the flexible ligand, 4, 4â  -trimethylenedipyridineÂ¬ (TMDP),Â¬ Zn2+ ions, and H3PO3, and with aromatic alcohols as templates to direct the formation of various hybrid network structures. Series II consists of five structures constructed from the relatively rigid ligand, 4, 4â  -bisimidazolelybipyridine (BIB)Â¬Â¬ with metal ions (Cu2+, Ni2+) and the conjugated bases of H3PO3 and H3PO4. The BIB ligand is not commercially available so is produced and characterized by NMR, mass spectrometry and TGA. Rigid network structures were expected to construct with pores of molecular dimensions with the BIB ligand. To date, the BIB ligand has not yield the desired porous network, however, these 3D hybrid networks have interesting topologies, one of which is an interdigitated network that is the precursor for 3D interpenetrated networks. Series III contains five hybrid structures constructed from various organic ligands, such as tartaric acid, picolinic acid and 1, 2, 4-triazole. In addition to the hybrid networks, six hydrogen bonded networks were prepared. Graph-Analysis is applied to study these hydrogen bonded network structures. The Ï â ¦.Ï  interaction is also discussed within the hydrogen bonded networks.",
  "description_provenance": [
    "Author Email: lmhu@vt.edu",
    "Advisor Email: hanson@vt.edu",
    "Advisor Email: gandour@vt.edu",
    "Advisor Email: jmerola@vt.edu",
    "Advisor Email: slebod@vt.edu",
    "Advisor Email: rangel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:53Z (GMT). No. of bitstreams: 1 Thesis_Hu_V2.pdf: 14117955 bytes, checksum: 61aa54e0165072384ee4d44e2b38adfc (MD5)   Previous issue date: 2009-04-15"
  ],
  "handle": "26945",
  "identifier_other": "etd-04172009-155646",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172009-155646/",
  "identifier_uri": "http://hdl.handle.net/10919/26945",
  "publisher": "Virginia Tech",
  "relation_haspart": "Thesis_Hu_V2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hybrid networks",
    "hydrothermal synthesis",
    "templates",
    "ligands",
    "transition metal ions"
  ],
  "title": "Inorganic-Organic Hybrid Networks Constructed from Different Metal Ions and Ligands",
  "type": "Dissertation"
}