{
  "contributor_author": "McGonigle, Timothy Philip",
  "contributor_committeechair": "Hauenstein, Neil M. A.",
  "contributor_committeemember": [
    "Foti, Roseanne J.",
    "Harvey, Robert J.",
    "Axsom, Daniel K.",
    "Connerley, Mary L."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:09:55Z",
  "date_adate": "2000-04-26",
  "date_available": "2014-03-14T20:09:55Z",
  "date_issued": "1999-11-18",
  "date_rdate": "2013-02-06",
  "date_sdate": "2000-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Organizational justice has been the source of a great deal of recent research attention and has consequently been linked to a number of organizationally-relevant constructs, including organizational citizenship behaviors (Moorman, 1991), employee theft (Greenberg, 1990a), organizational commitment (Tyler, 1991), turnover (Dailey & Kirk, 1992) and job performance (Gilliland, 1994).  However, researchers' ability to integrate findings from these diverse contexts is currently limited by the absence of a standardized operationalization of the justice construct.  To compound this problem, little research has investigated the psychometric properties of existing organizational justice measures.  For example, no research has empirically examined the dimensionality or the suggested context-sensitivity of this construct (cf., Cropanzano & Greenberg, 1997).  Therefore, the purposes of the current study were to evaluate the psychometric properties of justice and to attempt to develop a global measure that could be applied across contexts.<p>Study 1 involved three phases (1) screening a set of organizational justice items, (2) investigating the dimensionality of organizational justice and (3) examining justice for evidence of measurement stability.  The set of items used in the current study was primarily collected from published research by Hauenstein, McGonigle and Flinder (1997).  A set of 48 items with acceptable psychometric characteristics was identified.  Phase 2 investigated the dimensionality of these items.  Results indicated that none of the four a priori models of organizational justice dimensionality could adequately account for the dimensionality of these items.  However, three alternative models were discovered. The first model includes the four dimensions suggested by Greenberg (1993b) in addition to a general organizational justice factor while the second model includes only justice and injustice factors in addition to the ogernal organizational justice factor.  Finally, the results of an exploratory factor analysis suggested three factors: Systemic Justice; Distributive Injustice; and Distributive Justice.  Phase 3 then investigated the stability of this solution across subgroups while Study 2 compared exploratory factor structures across two work contexts.  Results demonstrated some differences at both item- and construct-level in organizational justice across levels of job satisfaction and work experience.  Further, some factorial instability across work contexts (e.g., selection, performance appraisal) was also observed.  As a result, it was concluded that developing a global measure of organizational justice is difficult given the demonstrated context-sensitivity of the construct.  Instead, a series of guidelines for developing future measures of organizational justice is proposed.",
  "description_provenance": [
    "Author Email: tmcgonigle@air.org",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: harveyrj@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Advisor Email: maryc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:55Z (GMT). No. of bitstreams: 2 titlepage.pdf: 2698 bytes, checksum: 349fb0b6940236937f386456451cbc95 (MD5) etd.pdf: 418776 bytes, checksum: 0bdf4759cbb3d45bb042807c28daacc2 (MD5)   Previous issue date: 1999-11-18"
  ],
  "handle": "26953",
  "identifier_other": "etd-04182000-08010007",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182000-08010007/",
  "identifier_uri": "http://hdl.handle.net/10919/26953",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "titlepage.pdf",
    "etd.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "ORGANIZATIONAL JUSTICE MEASUREMENT",
    "organizational fairness measurement"
  ],
  "title": "Investigating the Development of a Global Measure of Organizational Justice",
  "type": "Dissertation"
}