{
  "contributor_author": "Zhou, Zheng",
  "contributor_committeechair": "Nakamoto, Kent",
  "contributor_committeemember": [
    "Poppo, Laura",
    "Klein, Noreen M.",
    "Coupey, Eloise",
    "Parker, Andrew M."
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:09:56Z",
  "date_adate": "2002-04-23",
  "date_available": "2014-03-14T20:09:56Z",
  "date_issued": "2002-04-10",
  "date_rdate": "2003-04-23",
  "date_sdate": "2002-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Despite the fact that most firms are late entrants in any product market, research on how to achieve a late-mover advantage is limited and lags behind the theoretical work on first-mover advantage.  The strategic choice a late mover can utilize to compete against the pioneer is largely underdeveloped.  Further, extant studies provide contradictory arguments and predictions regarding the efficacy of two basic late entry strategies: an enhancing strategy (providing a late entrant with enhanced features along existing product attributes) and a distinctive strategy (adding new or unique features to a late entrantâ   offering).  The goal of this dissertation is to better understand the underlying behavioral mechanisms that enable a late entrant to compete with a successful pioneer and thereby address this inconsistency in the literature.  Taking a category-based learning perspective, it is proposed that new brands are learned through a comparison process with existing brands. In the process, common features are evaluated in a category-based mode while unique features are processed in a piecemeal fashion.  Two behavioral mechanisms are identified â   discrepancy effects (i.e., perceived differentiation) which add to the late entrant's visibility and attractiveness, and ambiguity effects (comparison difficulty and perceived performance risk) that lessen the late entrant's attractiveness.  Product category familiarity is proposed as the key moderator that affects the salience of each behavioral mechanism and hence the effectiveness of late entry strategies.   Three experiments were designed to test the proposed perspective.  It was found that common features are the focus of comparison in unfamiliar product classes and unique features receive particular attention in familiar product classes.  Accordingly, ambiguity effects become more salient in unfamiliar product categories while differentiation effects are more prominent in familiar product cases.  Further, a distinctive strategy is both more differentiated and more ambiguous than an enhancing strategy.  Thus, a distinctive strategy is more effective in a familiar product class due to its attention-grabbing nature.  An enhancing strategy is more successful in a novel or unfamiliar product class because of low levels of ambiguity.  These findings provide important implications for product entry and positioning strategies as well as for further research.",
  "description_provenance": [
    "Author Email: zzhou@vt.edu",
    "Advisor Email: nakamoto@vt.edu",
    "Advisor Email: lpoppo@vt.edu",
    "Advisor Email: nklein@vt.edu",
    "Advisor Email: ecoupey@vt.edu",
    "Advisor Email: anparker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:56Z (GMT). No. of bitstreams: 1 ZZ-Dissertation.pdf: 1645795 bytes, checksum: d588b4049010330e6c0cba32dad983f8 (MD5)   Previous issue date: 2002-04-10"
  ],
  "handle": "26959",
  "identifier_other": "etd-04182002-230448",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182002-230448/",
  "identifier_uri": "http://hdl.handle.net/10919/26959",
  "publisher": "Virginia Tech",
  "relation_haspart": "ZZ-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Distinctive Strategy",
    "Enhancing Strategy",
    "Ambiguity Effects",
    "Late-Mover Advantage",
    "Discrepancy Effects"
  ],
  "title": "Achieving Late-Mover Advantage:  The Effects of Enhancing and Distinctive Strategies",
  "type": "Dissertation"
}