{
  "contributor_author": "Katherman, Harolyn Joy",
  "contributor_committeechair": "Gillespie, Diane Newkirk",
  "contributor_committeemember": [
    "Richards, Robert R.",
    "Yakimowski-Srebnick, Mary E.",
    "Worner, Wayne Dempsey",
    "Romano, Lewis D."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:54Z",
  "date_adate": "1999-04-27",
  "date_available": "2014-03-14T20:09:54Z",
  "date_issued": "1998-12-19",
  "date_rdate": "2000-04-27",
  "date_sdate": "1999-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to examine the relationship between professional characteristics and training of building level school administrators in Virginia and their knowledge of special education law. The research question was, to what extent and in what manner can school administrators' knowledge of special education law be explained based upon administrative position, school level, number of special education courses, number of school law courses, and experience?    Knowledge of special education law was a total score on a survey instrument developed by Hines (1993) and updated to include eight areas of the 1997 Amendments to IDEA. A second part of the instrument collected information on professional characteristics and training. The survey was mailed to school building administrators throughout Virginia. The subjects in the study were randomly selected from Virginia public K-12 schools. Sampling was stratified by school level and wealth. The data were analyzed using a step-wise regression. Number of special education courses accounted for 4% of the variation in knowledge. Number of school law courses completed also entered into the analysis but had an inverse correlation with knowledge. The average knowledge score for administrators in this study was 18 or 56% correct.     Identification of factors which have the greatest influence on principal knowledge of special education law can be used to plan effective preparation of school building administrators. School building administrators who are knowledgeable of special education law can ensure the protection of the rights of disabled students, build positive relationships within the community, and avoid costly litigation.",
  "description_provenance": [
    "Author Email: hkatherm@pilot.infi.net",
    "Advisor Email: dgilles@vt.edu",
    "Advisor Email: robertr@vt.edu",
    "Advisor Email: yakimowski@aol.com",
    "Advisor Email: wworner@vt.edu",
    "Advisor Email: rromano@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:54Z (GMT). No. of bitstreams: 5 dissert4.pdf: 55904 bytes, checksum: 90c902379aec0cd03793b31ef72cb285 (MD5) dissert1.pdf: 10776 bytes, checksum: 1f404e4d2f5a8ce6e0481fca27f0ebdb (MD5) Titlepag.pdf: 1984 bytes, checksum: ab5ca075fbf90f9da8ecbfb099b962cd (MD5) dissert3.pdf: 3144 bytes, checksum: 81b53c221af112bba61d01a7d4df3c61 (MD5) dissert2.pdf: 144451 bytes, checksum: 21ac4b30ba279be17ea8ec7eceaaa6df (MD5)   Previous issue date: 1998-12-19"
  ],
  "handle": "26951",
  "identifier_other": "etd-041799-133332",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041799-133332/",
  "identifier_uri": "http://hdl.handle.net/10919/26951",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "dissert4.pdf",
    "dissert1.pdf",
    "Titlepag.pdf",
    "dissert3.pdf",
    "dissert2.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "School Administrators",
    "Individuals With Disabilities Education Act",
    "Special Education"
  ],
  "title": "Factors Which Influence School Administrators' Knowledge of Special Education Law",
  "type": "Dissertation"
}