{
  "contributor_author": "Eustis, Joanne D.",
  "contributor_committeechair": "Edwards, Patricia K.",
  "contributor_committeemember": [
    "Conn, W. David",
    "Bohland, James R.",
    "Kenney, Donald",
    "Stephenson, Max O. Jr."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:09:55Z",
  "date_adate": "2000-04-19",
  "date_available": "2014-03-14T20:09:55Z",
  "date_issued": "2000-04-07",
  "date_rdate": "2001-04-20",
  "date_sdate": "2000-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The goal of this dissertation is to test the agenda-setting theories of John Kingdon and Frank Baumgartner/Bryan Jones in terms of applicability. Universal service policy and the 1996 Telecommunications Act serve as the test case. Case study methodology guides the dissertation and employs a variety of methods including the quantitative and qualitative techniques used by John Kingdon and by Frank Baumgartner/Bryan Jones. These methods involve content analysis and the coding of media articles, an analysis of congressional hearings and government reports, and a review of scholarly literature on topics related to the policy-making in general, and telecommunications policy development, in particular. Universal service was selected for legislative action because it was bound up with telecommunications legislation, which required revision. Although some policy-makers preferred a market solution (that is the elimination of subsidized telecommunication services), universal service remained part of the telecommunications policy revision. Reasons include a new issue definition accompanied by a compelling image (information superhighway), the support of rural senators, and presidential leadership. With regard to fundamental differences between the Kingdon and Baumgartner/Jones' theories Kingdon's premise regarding the impact of cyclical events and systematic indicators has more applicability than Baumgartner and Jones' punctuated equilibria model of policy change. In addition, unlike Kingdon's research results, which indicate the media have a minor role in agenda-setting, Baumgartner and Jones' media attention indicators of policy change demonstrated a similar pattern to the universal service media indicators. The influence of interest groups is another point of difference. The universal case as with Baumgartner and Jones' research results that interest groups were major actors in setting the policy agenda. The contribution of this dissertation is to suggest elements of a new integrated model for the study of agenda-setting that incorporates aspects of the work of Kingdon and Baumgartner/Jones.",
  "description_provenance": [
    "Author Email: jde@po.cwru.edu",
    "Advisor Email: dconn@calpoly.edu",
    "Advisor Email: edwardsp@vt.edu",
    "Advisor Email: jayjon@vt.edu",
    "Advisor Email: kenney@vt.edu",
    "Advisor Email: mstephen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:55Z (GMT). No. of bitstreams: 1 jdeCOMPLETEetd.pdf: 8384044 bytes, checksum: cc0541f63abde3d77aa0fd9dd43f7a50 (MD5)   Previous issue date: 2000-04-07"
  ],
  "handle": "26954",
  "identifier_other": "etd-04182000-13220003",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182000-13220003/",
  "identifier_uri": "http://hdl.handle.net/10919/26954",
  "publisher": "Virginia Tech",
  "relation_haspart": "jdeCOMPLETEetd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Telecommunications Policy-Making",
    "Universal Service",
    "Agenda-Setting"
  ],
  "title": "Agenda-Setting: The Universal Service Case",
  "type": "Dissertation"
}