{
  "contributor_author": "Opuda, Michael John",
  "contributor_committeechair": "Gillespie, Diane Newkirk",
  "contributor_committeemember": [
    "Alexander, M. David",
    "Cernosia, Art",
    "Fortune, Jimmie C.",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:55Z",
  "date_adate": "1999-04-27",
  "date_available": "2014-03-14T20:09:55Z",
  "date_issued": "1997-11-17",
  "date_rdate": "2000-04-27",
  "date_sdate": "1999-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Parents have the authority to challenge school decisions regarding the identification, evaluation, placement and provision of a free appropriate public education to their child with a disability through either the hearing process or the complaint investigation process under the Individuals With Disabilities Education Act.   This study explored the differences between parents who had initiated hearings and complaints and their perceptions of the processes.  A document review, structured telephone interview and focus group meetings were used to gather data. The subjects were twenty-nine parents who had initiated complaints and thirty-one parents who had initiated hearings. The subjects were randomly selected from the population of all parents who had initiated hearings or complaints with the Maine Department of Education during 1996.    Quantitative data were analyzed using chi-square tests, t-tests, and descriptive statistics.  Qualitative data were analyzed through a sorting process to aggregate data and identify consistent themes.   Findings of the study reveal that families with higher annual household income tend to use the hearing process, to withdraw or mediate their disputes and to be represented by counsel.  No differences were found on parent satisfaction, marital status, or the ability of parents to participate in school activities. Parents reported a high level of anger, frustration and confusion regarding both processes.  Parent and school relationships, poor communication and compliance issues were identified as causes for the initiation of a complaint or hearing. The hearing group cited expense, the legalistic nature of hearings, and stress as major problems while the complaint group cited lack of accountability and enforcement as major problems.  Both groups recommended increased parent training and support and improved monitoring and enforcement by the Maine Department of Education.   The results of this study support the conclusion that the hearing process is primarily available to those families with higher incomes and that both the hearing and the complaint processes tend to be associated with poor parent and school relationships.  Additional research is needed to identify methods to improve parent and school relationships after the initiation of due process and to ensure that all parents have access to alternatives for the resolution of parent and school conflict.",
  "description_provenance": [
    "Author Email: mopuda@aol.com, michael.opuda@state.me.us",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: acernosia@aol.com",
    "Advisor Email: dgilles@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:55Z (GMT). No. of bitstreams: 9 Chap4.PDF: 158041 bytes, checksum: 018b66921e00f8db38d1aeb6671bac31 (MD5) front.PDF: 27122 bytes, checksum: fbbedab2752b06f42109af58690ed4ac (MD5) Chap2.PDF: 52781 bytes, checksum: 433e68dc95934994693ff74f1ed08c91 (MD5) Chap3.PDF: 40295 bytes, checksum: 7a7a0fdbd1322f42e4ad1653413af268 (MD5) references.pdf: 14143 bytes, checksum: fc8312ccb664e36d5c8e0aa8b0f56f90 (MD5) endstuff.PDF: 34270 bytes, checksum: 8394c697c50ee5d734542e5442ca69a4 (MD5) Chap5.PDF: 55201 bytes, checksum: 07d143b7c9f0d44a816b03eef1922df4 (MD5) Chap1.PDF: 30411 bytes, checksum: 13a6b297d5f9663428f08c3bb85d2979 (MD5) vita.PDF: 21580 bytes, checksum: 2a8c9157e91ad5713731768dd4a39e21 (MD5)   Previous issue date: 1997-11-17"
  ],
  "handle": "26952",
  "identifier_other": "etd-041799-201806",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041799-201806/",
  "identifier_uri": "http://hdl.handle.net/10919/26952",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chap4.PDF",
    "front.PDF",
    "Chap2.PDF",
    "Chap3.PDF",
    "references.pdf",
    "endstuff.PDF",
    "Chap5.PDF",
    "Chap1.PDF",
    "vita.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "special education",
    "complaint",
    "parent and school conflict",
    "due process hearing"
  ],
  "title": "A Comparison of Parents Who Initiated Due Process Hearings and Complaints in Maine",
  "type": "Dissertation"
}