{
  "contributor_author": "Schultz, Karen Kennedy",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Morris, Linda E.",
    "Cline, Marvin Gerald",
    "Duffy, Joanne",
    "Wiswell, Albert W."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:55Z",
  "date_adate": "2002-04-22",
  "date_available": "2014-03-14T20:09:55Z",
  "date_issued": "2002-03-20",
  "date_rdate": "2003-04-22",
  "date_sdate": "2002-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "What do Master Clinical (Experiential) Teachers do When Teaching Clinically?  Karen Kennedy Schultz     ABSTRACT   An urgent need exists for balance between students learning the theory of clinical practice and becoming an expert.  While theory is taught in the didactic setting, it is the experiential setting where the mastery of the clinical teacher is demonstrated.  What does the master clinical teacher do that makes the studentâ  s learning experience so significant?   One must recognize the moment, capture the learning opportunity, and draw the student in so that learning can occur.  Effective clinical teaching is paramount in creating empowered students and practitioners.  This qualitative case study of a doctoral pharmacy program identified two master clinical preceptors and shadowed one in a hospital and the other in a retail pharmacy.  Interactions between clinical preceptors and students were captured through direct observation, audio-tape, and complemented with in-depth interviews.  Content analysis  identified emerging themes yielding an emerging model of master clinical teaching, illuminating teachable moments between student and clinical preceptor, and the manner in which they interacted with each other and the clinical environment.    The model highlights an approach for making the critical time on clinical rotations as effective as possible and offers a practical means to study interactions between students and preceptors, discerning those that lead to teachable moments.  Features of the teachable moments are identified.  Although expertise cannot be taught, current and future clinical teachers can use this study to improve their teaching and effectiveness in clinical teaching practice.  The methodology of this study can be applied to future studies in the same discipline, other rotations, or other disciplines.    This study augmented the literature in qualitative research in pharmacy education for clinical practice by 1) utilizing a methodology that could be used in future studies  2) identifying features of teachable moments in the interactions of clinical preceptors and students 3)  exploring how the clinical preceptors dealt with the changing environment of their clinical teaching  4) offering an emerging model to guide clinical preceptors for making the critical clinical teaching time as effective as possible.    Future studies could utilize this emerging model to gain further insight on clinical teaching practices thus increasing the expertise of clinical teaching.",
  "description_provenance": [
    "Author Email: kschultz@su.edu",
    "Advisor Email: marcie@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:55Z (GMT). No. of bitstreams: 1 etd.pdf: 718772 bytes, checksum: 5ae7fb79469359a60bd62425642d42f0 (MD5)   Previous issue date: 2002-03-20"
  ],
  "handle": "26957",
  "identifier_other": "etd-04182002-125854",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182002-125854/",
  "identifier_uri": "http://hdl.handle.net/10919/26957",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "teachable moment",
    "clinical teaching",
    "master teacher",
    "experiential teaching"
  ],
  "title": "What do Master Clinical (Experiential Teachers do When Teaching Clinically?",
  "type": "Dissertation"
}