{
  "contributor_author": "Sarles, Stephen Andrew",
  "contributor_committeechair": "Leo, Donald J.",
  "contributor_committeemember": [
    "Heflin, James R.",
    "Huxtable, Scott T.",
    "Needham, David",
    "De Vita, Raffaella",
    "Inman, Daniel J."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:09:54Z",
  "date_adate": "2010-05-04",
  "date_available": "2014-03-14T20:09:54Z",
  "date_issued": "2010-04-08",
  "date_rdate": "2010-05-04",
  "date_sdate": "2010-04-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation presents the development of a new form of biomolecular material system which features interface lipid bilayers capable of hosting a wide variety of natural and engineered proteins.  This research builds on the droplet interface bilayer (DIB) platform which first demonstrated that, through self-assembly, lipid-encased water droplets submersed in oil can be physically connected to form a liquid-supported lipid bilayer at the droplet interface.  Key advantages of the DIB method over previous bilayer formation techniques include the lack of a supporting substrate which simplifies bilayer formation and the ability to connect many droplets to form `cell-inspired' networks which can provide a collective utility based on the compositions and arrangement of the droplets.  The research present herein specifically seeks to overcome three limitations of the original droplet interface bilayer:  limited portability due to lack of droplet support, the use of externally supported electrodes to electrically probe the network, and the requirement that in order to form DIB networks, aqueous volumes must be individually dispensed and arranged.   The approach presented in this document is to provide increased interactions between the contained liquid phases and a supporting substrate in order to achieve both increased usability through refined methods of packaging and in situ interface formation which eliminates the need to create individual droplets.  Physical encapsulation is defined as the the use of a solid substrate to contain both liquid phases such that the aqueous volumes are physically supported on one length scale (10-1000µm) while not inhibiting the self-assembly of phospholipids at the oil/water interface occurring on a much smaller length scale (1-10nm).  Physically-encapsulated droplet interface bilayers are achieved by connecting lipid-encased droplets within a substrate that tightly confines the positions of neighboring droplets.  A term called the packing factor is introduced to quantify the ratio of the aqueous volumes per the total compartment volume.  Physically-encapsulated droplet interface bilayers formed in high packing factor substrate (30%) that also features integrated electrodes demonstrate all of the properties that unencapsulated DIBs exhibit (electrical resistances greater than 1GΩ, failure potentials between |200-300|mV, and the ability to host transmembrane proteins) but these confined assemblies can be moved, shaken, and even completely inverted.  Additionally, a structured experiment to quantify the durability of interface bilayers shows that encapsulated and unencapsulated droplet interface bilayers can both survive 3-7g of lateral acceleration prior to bilayer failure, but have different modes of failure.  Encapsulated DIBs tend to rupture, while unencapsulated DIBs completely separate.   Physical encapsulation is also shown to permit the in situ formation of durable interface bilayers when the substrate is made from a flexible material.  The importance of this approach stems from the fact that, by using the substrate to locally partition a single aqueous volume into multiple volumes, there is no need to arrange individual droplets.  This method of bilayer formation is termed the regulated attachment method (RAM), since the separation and subsequent reattachment of the aqueous volumes is regulated by the opening and closing of an aperture within the flexible substrate.  In this dissertation, a mechanical force is used to directly modulate the aperture dimension for controlling both the initial formation and final size of the interface.  With the demonstrated advantages of portability and controlled attachment offered by physical encapsulation, encapsulated lipid bilayers are formed within a completely sealed flexible substrate.  A key aspect of this final work is to demonstrate that both the organic and aqueous phases can be stabilized internally, creating a complete material system that features tailorable interface bilayers.",
  "description_provenance": [
    "Author Email: sarles@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: huxtable@vt.edu",
    "Advisor Email: d.needham@duke.edu",
    "Advisor Email: devita@vt.edu",
    "Advisor Email: dinman@vt.edu",
    "Advisor Email: donleo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:54Z (GMT). No. of bitstreams: 1 Sarles_SA_D_2010.pdf.pdf: 10644961 bytes, checksum: aab8f54107b08bcd3c4757159c9035d7 (MD5)   Previous issue date: 2010-04-08"
  ],
  "handle": "26950",
  "identifier_other": "etd-04172010-084255",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04172010-084255/",
  "identifier_uri": "http://hdl.handle.net/10919/26950",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sarles_SA_D_2010.pdf.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "regulated attachment method",
    "physical encapsulation",
    "lipid bilayer",
    "encapsulated interface bilayer"
  ],
  "title": "Physical Encapsulation of Interface Bilayers",
  "type": "Dissertation"
}