{
  "contributor_author": "Le, Dat Quang",
  "contributor_committeechair": "Belli, Gabriella M.",
  "contributor_committeemember": [
    "Huebner, Angela J.",
    "Wills, Kathleen",
    "Cline, Marvin Gerald",
    "Krill, Cecelia W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:55Z",
  "date_adate": "2002-04-25",
  "date_available": "2014-03-14T20:09:55Z",
  "date_issued": "2002-04-02",
  "date_rdate": "2003-04-25",
  "date_sdate": "2002-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A Comparative Analysis of Success by Project Level Characteristics in the Upward Bound Program  by  Dat Q. Le  Gabriella Belli, Ph.D., Chair  (Abstract)      \t Data gathered by Mathematica Policy Research, Inc., contractor for the Department of Education were used to analyze successful project level characteristics of the Upward Bound program.  Mathematica Policy Research, Inc. provided two data files for this study: a student data file and a grantees data file.  The first data file includes information from a nationally representative sample of students who applied to the Upward Bound program between 1992 and 1994 and were assigned to either the Upward Bound group or a control group.  The second data file included information from a random sample of Upward Bound project grantees. \tBoth the student and grantees data files were used to create a design to determine Upward Bound project level characteristics that highly correlated to student success.  The project level characteristics that were examined included project setting (location, size and host institution), academic characteristics (student-staff ratio, course offerings during the summer and academic year, and the number of years a project has been in operation) and student characteristics (gender, race/ethnicity and employment).  The student success measures used in this study included grade point average, total high school credits earned, Advanced Placement credits earned, high school dropout status and graduation status. \tFindings from this study suggest that Upward Bound projects with lower student to staff ratios and fewer academic year course offerings have students earning more high school credits and more student graduating from high school.  In addition to academic characteristics, ethnicity seem to be related to the success of projects.  When compared across project settings, projects from two-year rural colleges and four-year public suburban colleges have the most successful students.",
  "description_provenance": [
    "Author Email: datqle@aol.com",
    "Advisor Email: gbelli@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:55Z (GMT). No. of bitstreams: 1 Dissertation_Dat_4_25_02.PDF: 258630 bytes, checksum: 3c38e43713934a2b5a1a9b54d262a8c9 (MD5)   Previous issue date: 2002-04-02"
  ],
  "handle": "26958",
  "identifier_other": "etd-04182002-194916",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182002-194916/",
  "identifier_uri": "http://hdl.handle.net/10919/26958",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Dat_4_25_02.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Upward Bound",
    "TRIO"
  ],
  "title": "A Comparative Analysis of Success by Project Level Characteristics in the Upward Bound Program",
  "type": "Dissertation"
}