{
  "contributor_author": "Bechtol, Susan Smith",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Christy, William R.",
    "Dawson, Christina M.",
    "Swecker, Vicki M.",
    "Twiford, Travis W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:55Z",
  "date_adate": "2001-04-19",
  "date_available": "2014-03-14T20:09:55Z",
  "date_issued": "2001-03-26",
  "date_rdate": "2002-04-19",
  "date_sdate": "2001-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "(ABSTRACT)  <p>The long-term effects of participation in high school sports were the focus of this study.  Ten top-level managers in Fortune 500 companies were asked about participation in high school sports and the enduring effects of that participation. <p>Five men (one black) and five women (one Asian) participated in the study. Interviewing, observing offices, and reviewing high school yearbooks were the methods of data collection.  The data were analyzed using the constant-comparative method of Maykut and Morehouse (1994). <p>Based on the literature and the development of a sports participation theory, data were collected on the organizational and personal variables affecting participation in high school sports, and the sports participation variables affecting later life.    <p>Long-term effects of sports participation in high school were identified in 13 areas: (1) being competitive, (2) being goal oriented, (3) being physically active, (4) making friends, (5) developing leadership skills, (6) enhancing self-esteem, (7) displaying sports paraphernalia, (8) practicing sports philosophy, (9) working as a team, (10) acquiring skills not taught in a classroom, (11) managing time, (12) volunteering, and (13) working with diverse groups.  These findings may be helpful to school administrators and policy makers as they evaluate the benefits and liabilities of their sports programs.",
  "description_provenance": [
    "Author Email: sbechtol@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:55Z (GMT). No. of bitstreams: 2 Bechtolfrontmatter.pdf: 22739 bytes, checksum: 137d68f6336c1047de8a101f2e42009d (MD5) Bechtoldissertation.pdf: 376013 bytes, checksum: 7c327e56d0c688bd9757a14540b961b0 (MD5)   Previous issue date: 2001-03-26"
  ],
  "handle": "26955",
  "identifier_other": "etd-04182001-164654",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182001-164654/",
  "identifier_uri": "http://hdl.handle.net/10919/26955",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Bechtolfrontmatter.pdf",
    "Bechtoldissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "physical activity",
    "high school",
    "sports",
    "adults",
    "Fortune 500",
    "student participation",
    "athletics",
    "long-term effects"
  ],
  "title": "Adults' Perceptions of the Long-Term Effects of Participation in High School Sports",
  "type": "Dissertation"
}