{
  "contributor_author": "Swan, Bret R.",
  "contributor_committeechair": "Van Aken, Eileen M.",
  "contributor_committeecochair": "Markham, Steven E.",
  "contributor_committeemember": [
    "Tegarden, David P.",
    "Koelling, Charles Patrick",
    "Smith-Jackson, Tonya L."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:09:57Z",
  "date_adate": "2007-05-03",
  "date_available": "2014-03-14T20:09:57Z",
  "date_issued": "2007-03-26",
  "date_rdate": "2007-05-03",
  "date_sdate": "2007-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "There is a growing need to study factors that affect user comprehension of Business Process Management (BPM) information portrayed by graphical process models (GPMs).  For example, deployment of BPM Systems, unique types of enterprise-level information systems, has dramatically increased in recent years.  This increase is primarily because BPM Systems give a variety of managers across an enterprise the ability to directly design, configure, enact, monitor, diagnose, and control business processes that other types of enterprise systems do not.  This is possible because BPM Systems uniquely rely on GPMs derived from formal graph theory.  Besides controlling the business processes, these GPMs, such as metagraphs and Unified Modeling Language (UML) diagrams, portray business process information (BPI) and prompt BPM managers to apply their training and expertise to deal with BPM situations.  As a result, GPMs are the primary information artifacts for decision-making and communication among different, often geographically dispersed stakeholders.  Therefore, user comprehension of these unique GPMs is critical to the efficient and effective development, deployment, and utilization of BPM Systems.  User comprehension outcomes are jointly affected by the (1) BPM cognitive resources available to each manager (including the type of GPM, BPI, and user educational training and experience), and (2) cognitive differences between individual BPM managers (such as their mental workload, cognitive styles and cognitive abilities).  Although research has studied GPMs in various contexts, there is apparently no empirical research investigating GPM user comprehension in the context of BPM Systems.  This research makes an important contribution by addressing this gap in the literature.  Statement of the Objective  The purpose of this research is to empirically study how BPM cognitive resources and cognitive differences between individuals affect outcomes of GPM user comprehension.  This research centered on the following objectives:  A. Investigate whether more positive user comprehension outcomes are produced by novice users if a single GPM technique is used to portray different types of BPI (e.g., as with metagraphs) or if different GPM techniques are used to portray different types of BPI (e.g., as with UML diagrams). B. Investigate whether one type of BPI is more easily comprehended and interpreted by novice users irrespective of the type of GPM or the type of educational training of the user. C. Investigate whether users with a specific type of user educational training can more easily comprehend and interpret BPM information irrespective of the type of GPM or the type of BPI. D. Evaluate influences of individual cognitive differences (i.e., mental workload, cognitive styles, and cognitive abilities) on outcomes of user comprehension. In order to accomplish these objectives, this study: (a) defined a theoretical framework conceptualizing user comprehension outcomes in terms of the interaction between cognitive resources external to the user and individual differences affecting how users cognitively process BPI, (b) empirically tested an operational research model of GPM user comprehension that is based on the theoretical framework, and (c) interpreted the experimental results in the context of related literatures.   Description of Research Methods This study empirically tested relationships between several variables representing BPM cognitive resources and individual cognitive differences hypothesized as influencing the outcomes of user comprehension.  A laboratory experiment, involving 87 upper-level undergraduate students from two universities, analyzed relationships between participant comprehension of two types of GPMs (i.e., metagraphs and UML diagrams) used to portray three types of BPI (i.e., task-centric, resource-centric, and information-centric BPI) by novice GPM users possessing different educational training (i.e., industrial engineering, business management, and computer science training).  Dependent variables included assessments of task accuracy, task timeliness, subjective mental workload, and self-efficacy.  Covariate effects were also analyzed for two types of participant cognitive abilities (i.e., general cognitive ability (GCA) and attentional abilities) and two types of participant cognitive styles (extroversion-introversion and sensing-intuitive).  Multivariate analysis techniques were used to analyze and interpret the data.    Discussion of Results The type of GPM and participants창   GCA produced significant effects on the dependent variables in this study.  For example, metagraph users produced significantly more desirable results than UML users across all dependent variables, contrary to what was hypothesized.  However, if only the BPM cognitive resources (i.e., GPM Type, BPM Type, and the Type of Participant Education) were studied in relation to user comprehension outcomes, spurious conclusions would have been reached.  When individual cognitive differences were included in the research model and analyses, results showed participants with higher GCA produced significantly more positive user comprehension outcomes compared to participants with lower GCAs.  Also, many of the impacts of differences in the types of BPI and the types of UET were moderated by the differences in participants창   GCA and attentional abilities.  In addition, the relationship between subjective mental workload and task performance (i.e., accuracy and timeliness) suggest a possible GPM cognitive 창  profile창   for user comprehension tasks in a BPM Systems context.  These results have important implications for future research and practice in several bodies of knowledge, including GPM user comprehension in management systems engineering, BPM modeling, BPM Systems, HCI, and cognitive ergonomics literature.",
  "description_provenance": [
    "Author Email: bret.swan@gmail.com",
    "Advisor Email: dtegarde@vt.edu",
    "Advisor Email: koelling@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: markhami@vt.edu",
    "Advisor Email: evanaken@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:57Z (GMT). No. of bitstreams: 1 Swan_Dissertation_Complete_FinalETD_02May07.pdf: 8565445 bytes, checksum: 3e4c9f266ac9ffd0101940768d433573 (MD5)   Previous issue date: 2007-03-26"
  ],
  "handle": "26969",
  "identifier_other": "etd-04182007-023441",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182007-023441/",
  "identifier_uri": "http://hdl.handle.net/10919/26969",
  "publisher": "Virginia Tech",
  "relation_haspart": "Swan_Dissertation_Complete_FinalETD_02May07.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Business Process Management (BPM)",
    "Enterprise Modeling",
    "BPM Systems",
    "Business Process Modeling",
    "Metagraphs",
    "UML",
    "Explicit Knowledge",
    "Tacit Knowledge",
    "Graphical Process Models"
  ],
  "title": "The Effects of Business Process Management Cognitive Resources and User Cognitive Differences on Outcomes of User Comprehension",
  "type": "Dissertation"
}