{
  "contributor_author": "Davis, Trent Alan",
  "contributor_committeecochair": [
    "Singh, Kusum",
    "Getz, Hilda M."
  ],
  "contributor_committeemember": [
    "Lawson, Gerard F.",
    "Mathai, Christina",
    "Papadakis, Maria"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:56Z",
  "date_adate": "2005-04-20",
  "date_available": "2014-03-14T20:09:56Z",
  "date_issued": "2005-04-11",
  "date_rdate": "2007-04-20",
  "date_sdate": "2005-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "There has been little research to date specifically addressing counselorsâ   experiences with complementary therapy. The objective of this exploratory survey was to assess counselorsâ   professional practice, knowledge and training, and personal experience with complementary therapy. The study design was a web-based, random sample survey of American Counseling Association members.    Results indicated the typical respondent was female, Caucasian, holds a Masterâ  s degree and works in a private practice/self-employed or community agency setting as an outpatient counselor. Few respondents asked about or had clients volunteer use of complementary therapy. Anxiety and depression were the most common client concerns for which respondents recommended or referred for complementary therapy. Respondents agreed that client referrals should be to licensed or certified practitioners. Respondents reported that complementary therapy provided clients with at least some positive benefits and few negative consequences.     The majority of respondents included complementary therapy in counseling during the past year and thought that complementary therapy should be included in addition to counseling. Although respondents considered themselves qualified to discuss a variety of complementary therapies, few possessed licensure or certification. The majority of respondents used informal, self-study to gain knowledge of complementary therapy. Most respondents have personally experienced at least one complementary therapy, primarily â  To improve overall wellnessâ  . Respondents reported they received some to large benefits from this experience.      A number of respondents descriptors had moderately positive associations with client usage, recommendation and referral, inclusion, and knowledge factors. These descriptors were those respondents who worked in a private practice/self-employed setting, as an outpatient counselor, were licensed as an LPC, provided individual, family/couples, or alcohol/substance abuse counseling, and had a psychodynamic orientation. There were moderately negative associations between respondents who worked in a K-12 setting, did not possess mental health licensure and were a Masterâ  s student and client usage, recommendation and referral, and inclusion factors.    The data provide support for the idea that counselors are beginning to embrace a post-modern approach, which gives consideration to complementary therapy interventions. However, the findings also suggested that the counseling profession still has a good deal of work to do before it can be considered truly holistic.",
  "description_provenance": [
    "Author Email: trdavis5@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: glawson@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:56Z (GMT). No. of bitstreams: 1 TrentETD2.pdf: 577344 bytes, checksum: de971ff51597903271d9486fb98be0b9 (MD5)   Previous issue date: 2005-04-11"
  ],
  "handle": "26964",
  "identifier_other": "etd-04182005-121358",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182005-121358/",
  "identifier_uri": "http://hdl.handle.net/10919/26964",
  "publisher": "Virginia Tech",
  "relation_haspart": "TrentETD2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Personal Experience",
    "Counseling",
    "Alternative Therapy",
    "Complementary Therapy",
    "Counselor Education",
    "Referral",
    "Inclusion"
  ],
  "title": "Counseling and Complementary Therapy: A National Survey of Counselors' Experiences",
  "type": "Dissertation"
}