{
  "contributor_author": "Maulan, Suhardi",
  "contributor_committeechair": "Miller, Patrick A.",
  "contributor_committeemember": [
    "Sharif, Mustafa Kamal Mohd",
    "Skabelund, Lee R.",
    "Buikema, Arthur L. Jr.",
    "Bryant, Margaret M.",
    "Parkhurst, James A."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:09:57Z",
  "date_adate": "2006-04-24",
  "date_available": "2014-03-14T20:09:57Z",
  "date_issued": "2006-03-16",
  "date_rdate": "2007-04-24",
  "date_sdate": "2006-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The restoration of natural wetlands is a wonderful, noble and pragmatic idea, but such efforts often meet resistance from certain segments of society. One reason for this is that the public perceives the environment in different ways than do the experts, such as landscape architects and land managers. This dissertation analyzes peopleâ  s preferences for wetlands in comparison to those of landscape architects.  It specifically studies the conflict about the wetland restoration program in the Malaysiaâ  s Kelana Jaya Municipal Park. This dissertation is based on data obtained from a preference survey using photo questionnaires that polled both the publicâ  s and landscape architectsâ   group preferences for wetlands. The data was analyzed using the Content Identifying Method (CIM) to determine group preferences for wetlands and factors that influence these preferences. Park managers from several local authorities also were interviewed to determine their expectations of public preferences and attitudes toward wetland restoration and public participation. The public and landscape architects have significantly differed in stated preferences for wetlands. The public strongly prefers park-like landscapes that demonstrate human influences and provide the potential for human involvement; in contrast, landscape architects prefer natural wetlands that are visually pleasing, with well-defined spaces, visual coherence, and visual complexity. In addition, park managers did not accurately predict the publicâ  s view of wetlands.  Their prediction was similar to landscape architectsâ   preferences. Attitudes toward wetland activities and safety, knowledge about wetland benefits, the motivation to use urban natural open spaces, and familiarity with nature significantly affected the publicâ  s preferences. Further, the motivation to use urban natural open spaces was the best predictor of publicâ  s preferences. The primary implications of this dissertation are that environmental education should be a core activity in changing peopleâ  s perceptions of natural wetlands and that opinions of local people should be incorporated in many aspect of wetlands restoration, planning, design, and policymaking, especially in Malaysia.",
  "description_provenance": [
    "Author Email: smaulan@vt.edu, shdi@yahoo.com",
    "Advisor Email: deanmus2002@yahoo.com.sg",
    "Advisor Email: lskab@ksu.edu",
    "Advisor Email: pmiller@vt.edu",
    "Advisor Email: buik@vt.edu",
    "Advisor Email: mbryant@vt.edu",
    "Advisor Email: jparkhur@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:57Z (GMT). No. of bitstreams: 4 APPENDICES.pdf: 1701108 bytes, checksum: 1474132669b8b272bb0777caed8ca279 (MD5) VITA.pdf: 13361 bytes, checksum: 005fa97d3bf3c9a96413afb98eb0580f (MD5) CHAPTERS.pdf: 5669563 bytes, checksum: ccec017d7210f7a0e936cda1a5fb74e2 (MD5) FRONTMATTERS.pdf: 26417 bytes, checksum: 93a395052d71385415b381ce4631464a (MD5)   Previous issue date: 2006-03-16"
  ],
  "handle": "26966",
  "identifier_other": "etd-04182006-092121",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182006-092121/",
  "identifier_uri": "http://hdl.handle.net/10919/26966",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "APPENDICES.pdf",
    "VITA.pdf",
    "CHAPTERS.pdf",
    "FRONTMATTERS.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "preference",
    "wetlands",
    "conservation",
    "Malaysia",
    "restoration",
    "perception"
  ],
  "title": "A Perceptual Study of Wetlands: Implications for Wetland Restoration in the Urban Area in Malaysia",
  "type": "Dissertation"
}