{
  "contributor_author": "Kendall, Treavor Allen",
  "contributor_committeechair": "Hochella, Michael F. Jr.",
  "contributor_committeemember": [
    "Hersman, Larry",
    "Tadanier, Christopher J.",
    "Potts, Malcolm",
    "Rimstidt, james Donald"
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:09:56Z",
  "date_adate": "2003-04-21",
  "date_available": "2014-03-14T20:09:56Z",
  "date_issued": "2003-04-11",
  "date_rdate": "2004-04-21",
  "date_sdate": "2003-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The forces of interaction were measured between the siderophore azotobactin and the minerals goethite (FeOOH) and diaspore (AlOOH) in solution using force microscopy.  Azotobactin was covalently linked to a hydrazide terminated atomic force microscope tip using a standard protein coupling technique.  Upon contact with each mineral surface, the adhesion force between azotobactin and goethite was two to three times the value observed for the isostructural Al-equivalent diaspore.  The affinity for the solid iron oxide surface reflected in the force measurements correlates with the specificity of azotobactin for aqueous ferric iron.  Further, the adhesion force between azotobactin and goethite significantly decreases when small amounts of soluble iron are added to the system suggesting a significant specific interaction between the azotobactin and the mineral surface.  Changes in the force signature with pH and ionic strength were fairly predictable when considering mineral solubility, the charge character of the mineral surfaces, the molecular structure of azotobactin, and the intervening solution.      Molecular and quantum mechanical calculations which were completed to further investigate the interaction between azotobactin and iron/aluminum oxide surfaces, and to more fully understand the force measurements, also showed an increased force affinity for Fe over Al.  Ab initio calculations on siderophore fragment analogs suggest the iron affinity can be attributed to increased electron density associated with the Fe-O bond compared to the Al-O bond; an observation that correlates with ironâ  s larger electronegativity compared to aluminum.  Attachment of the ligand to each surface was directed by steric forces within the molecule and coulombic interactions between the siderophore oxygens and the metals in the mineral.  Chelating ligand pairs coordinated with neighboring metal atoms in a bidentate, binuclear geometry.  Upon simulated retraction of azotobactin from each surface, the Fe-O(siderophore) bonds persisted into a higher force regime than Al-O(siderophore) bonds, and surface metals were removed from both minerals.  Extrapolation of the model to more realistic hydrated conditions using a PCM model in the quantum mechanical calculations and water clusters in the molecular mechanical model demonstrated that the presence of water energetically favors and enhances metal extraction, making this a real possibility in a natural system.",
  "description_provenance": [
    "Author Email: tkendall@vt.edu",
    "Advisor Email: hersman@lanl.gov",
    "Advisor Email: hochella@vt.edu",
    "Advisor Email: ctadanie@vt.edu",
    "Advisor Email: geordie@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:56Z (GMT). No. of bitstreams: 1 KendallDissertationETD.pdf: 2396553 bytes, checksum: f209f2f59127d4a7b6ad0cd5e1cb5660 (MD5)   Previous issue date: 2003-04-11"
  ],
  "handle": "26961",
  "identifier_other": "etd-04182003-134826",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182003-134826/",
  "identifier_uri": "http://hdl.handle.net/10919/26961",
  "publisher": "Virginia Tech",
  "relation_haspart": "KendallDissertationETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "diaspore",
    "ligand",
    "azotobactin",
    "molecular modeling",
    "quantum mechanical calculations",
    "AFM",
    "goethite"
  ],
  "title": "Exploring Siderophore-Mineral Interaction Using Force Microscopy and Computational Chemistry",
  "type": "Dissertation"
}