{
  "contributor_author": "Infantino, Jean Anne",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "West, Robert L. Jr.",
    "Inman, Deborah",
    "Smith, John"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:56Z",
  "date_adate": "2005-04-22",
  "date_available": "2014-03-14T20:09:56Z",
  "date_issued": "2005-04-11",
  "date_rdate": "2006-04-22",
  "date_sdate": "2005-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this research was to learn how teachers, school division policies, and community influences facilitated the transition of middle school Limited English Proficient (LEP) students from their native language to English. The research questions are: (1) How did the content area teachers influence the LEP student with learning English? (2) How did the ESL teacher influence the LEP student with learning English? (3) How did the school division policies influence the LEP student with learning English? (4) Which community influences assisted the LEP student with learning English?  ESL students from one school district were randomly selected from a list of students currently enrolled the middle school level three ESL program. Selection criteria included: (1) middle school student, (2) level three English proficiency, (3) Spanish speaking as the primary language of the student, and (4) enrollment for five consecutive years within the school system. Individual interviews were conducted with students, regular education teachers and ESL teachers selected to participate in the study. Data were analyzed using the Constant Comparative Method (Maykut & Morehouse, 1994).  Findings revealed the content area teacher assisted the student by using a variety of instructional strategies including small group assistance, games and hands on activities, use of visuals and articulation. The ESL tutor assisted the student by using games, hands on activities, and visuals. The tutors also focused on grade level curriculum, provided testing assistance and positive reinforcement. The school division policies influenced the student by structuring policies to assist with proper placement and success of the LEP student. These policies include scheduling, grading, screening, and communication with parents. The community influenced the LEP student by the language spoken in the home, family and extended family assistance, and parent involvement with the school.   As a result of the research, recommendations for changes to the current ESL program were suggested.  These recommendations include increased parent and community involvement, content area teacher training including teaching strategies, revision and distribution of the ESL policy guide, and formation of a steering committee including parents, teachers, administrators, community members and ESL coordinator.",
  "description_provenance": [
    "Author Email: jinfanti@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: inmand@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:56Z (GMT). No. of bitstreams: 1 Dissertation3Infantino4_11_05.pdf: 492438 bytes, checksum: 59deb04e992e3552e963d621545750ac (MD5)   Previous issue date: 2005-04-11"
  ],
  "handle": "26965",
  "identifier_other": "etd-04182005-163323",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182005-163323/",
  "identifier_uri": "http://hdl.handle.net/10919/26965",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation3Infantino4_11_05.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "LEP",
    "Programs",
    "Instruction",
    "ESL"
  ],
  "title": "Facilitating the Transition of Limited English Proficient Students From Their Native Language to English",
  "type": "Dissertation"
}