{
  "contributor_author": "Zhang, Wei",
  "contributor_committeechair": "Kiran, Erdogan R.",
  "contributor_committeemember": [
    "Taylor, Larry T.",
    "Hassler, John C.",
    "Oyama, Shigeo Ted",
    "Wilkes, Garth L."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:09:56Z",
  "date_adate": "2005-04-25",
  "date_available": "2014-03-14T20:09:56Z",
  "date_issued": "2005-04-05",
  "date_rdate": "2005-04-25",
  "date_sdate": "2005-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The phase behavior and phase separation kinetics in polymer solutions in binary mixtures of supercritical carbon dioxide (CO2) and organic solvents were studied for two systems. Solutions of polyethylene (PE) in CO2 + n-pentane were selected as one model system to study both the solid-fluid (S-F) and liquid-liquid (L-L) phase transitions as well as the interplay of these two types of phase separations on the final morphological and thermal properties of PE crystals. Solutions of polysulfone (PSF) in CO2 + tetrahydrofuran (THF) were selected as another model system because of the technological importance of this membrane forming polymer and because of the broad interest in developing new solvent/non-solvent systems for forming microporous materials. These phase boundaries were determined using a high-pressure view-cell and optical techniques over a temperature range of 90-165 oC and pressures up to 55 MPa for PE/n-pentane/CO2 system, and over a temperature range of 25 to 155 oC and pressures up to 70 MPa for PSF/THF/CO2 system.  For PE solutions, it has been found that the addition of CO2 to the PE/n-pentane system shifts the L-L phase boundary to significantly higher pressures, but moves the S-F phase boundary only slightly to higher temperatures. The S-F phase boundary which represents the crystallization/melting process in the polymer solution was about 10 oC lower than the crystallization/melting temperatures of the neat polyethylene samples determined by differential scanning calorimetry (DSC). It was further found that the S-F phase boundary in n-pentane displays a unique sensitivity to the pressure-temperature conditions and moves to lower temperatures in the pressure range from 38 to 42 MPa. This effect even though not as augmented remains also for the S-F boundary in the solutions in CO2 + n-pentane mixtures. The miscibility of PSF in THF + CO2 was investigated at CO2 levels up to 14 wt %. This system shows lower critical solution temperature (LCST)-type phase behavior at low CO2 content, which is shifted to upper critical solution temperature (UCST)-type at higher CO2 levels along with an increase in the miscibility pressures. In contrast to the PE system, this system was found to display multiple miscibility windows. A â  Uâ  -shaped phase boundary in 92 % THF + 8 % CO2 mixture was observed to transfer to a â  Wâ  -shaped phase boundary at 10 wt % CO2, which was further separated into a double â  Uâ  -shaped phase boundary at 13 wt % CO2. The specific volume of the polysulfone solutions were found to display a variation parallel to this changing pattern in the phase boundaries, with reduced miscibility being accompanied with an increase in the specific volume. The phase separation kinetics in these two polymer solutions were investigated using time- and angle-resolved light scattering techniques. With the PE solutions, the focus was on the kinetics of S-F phase separation (crystallization) and miscibility and (melting) in n-pentane. Experiments were conducted with relatively dilute solutions at concentrations up to 2.3 wt %. The results show that the crystallization which was induced by cooling at constant pressure is dominated by a nucleation and growth process. In the majority of the experiments the particle growth process was observed to last for about 1 minute with a slight dependence on the crystallization pressure. The phase separation kinetics in PSF solutions were conducted only in a solvent mixture containing 90 wt % THF and 10 wt % CO2. Polymer concentrations were varied up to 3.3 wt %. This system was also observed to undergo phase separation by only nucleation and growth mechanism under these conditions upon reducing the pressure at constant temperature. Several experiments were conducted using a multiple rapid pressure drop technique to identify the depth of the metastable region. PE crystals that were produced by crossing the S-F boundary by different paths were collected and characterized by field emission scanning electron microscopy (FESEM) and DSC. Crystallization was carried out either by cooling at constant pressure, or by cooling without pressure adjustment, or by first crossing the L-L boundary via pressure reduction at a constant temperature followed by cooling. For crystal recovery, the system was depressurized to ambient conditions irrespective of the path. It was found that all of the crystals formed from these solutions show multiple melting peaks in their first DSC heating scans, which however collapse into one crystallization peak in the cooling scans and one melting peak in the second heating scans. The temperatures corresponding to the multiple melting peaks were lower than the single melting temperature of the original PE sample and the melting temperature observed in the second heating scans for all samples. The multiple melting peaks were attributed to the presence of different lamellar thickness that are formed in the crystallization, final depressurization and sample collection stages. Depending upon the crystallization path some differences were noted. The crystals formed by first going through L-L phase separation displayed predominately double melting peaks in the first DSC scan. It was observed that the overall crystallinity is increased by more than 10 % to about 75 % compared to the crystallinity of the original PE sample, which is about 63 %. FESEM characterization showed that the prevailing morphology is composed of plate-like lamellae that show different level of agglomeration depending on the crystallization conditions. The overall structures of the particles were ellipsoid for crystals formed from dilute solutions. For crystals formed from the 1% PE solution, crystal sizes ranged from 4 mm Â´ 10 mm for crystals formed at 14 MPa to 30 mm Â´ 45 mm at 45 MPa. The crystals formed from 5 wt % solutions in n-pentane at pressures in the range of 38-54 MPa showed different morphologies with features of shish-kebab like structures which were however absent in crystals formed from n-pentane + CO2 solutions. The crystals that were formed from first crossing the L-L phase boundary followed by cooling showed two distinct particle size ranges that were attributed to crystals formed from the polymer-rich and polymer-lean phases that evolve when the L-L phase boundary is crossed.",
  "description_provenance": [
    "Author Email: wezhang2@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: jhassler@vt.edu",
    "Advisor Email: ekiran@vt.edu",
    "Advisor Email: oyama@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:56Z (GMT). No. of bitstreams: 1 Wei_Zhang_PhD_Dissertation.pdf: 7664782 bytes, checksum: 4c820e1a6230ce242f6dc8c644736884 (MD5)   Previous issue date: 2005-04-05"
  ],
  "handle": "26963",
  "identifier_other": "etd-04182005-115303",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182005-115303/",
  "identifier_uri": "http://hdl.handle.net/10919/26963",
  "publisher": "Virginia Tech",
  "relation_haspart": "Wei_Zhang_PhD_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Phase Behavior",
    "High Pressure",
    "Polymer Solution",
    "Phase Separation Kinetics",
    "Crystallization",
    "Light Scattering",
    "Supercritical Fluids"
  ],
  "title": "Phase Behavior and Phase Separation Kinetics in Polymer Solutions under High Pressure",
  "type": "Dissertation"
}