{
  "contributor_author": "Byrne, Sandra Miller",
  "contributor_committeechair": "Wiswell, Albert K.",
  "contributor_committeemember": [
    "Cline, Marvin Gerald",
    "French, Larry",
    "Parson, Stephen R.",
    "Reimann, Curt"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:59Z",
  "date_adate": "1999-04-27",
  "date_available": "2014-03-14T20:09:59Z",
  "date_issued": "1999-04-06",
  "date_rdate": "2000-04-27",
  "date_sdate": "1999-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Modernization of manufacturing means updating capabilities and changing the ways in which companies organize and manage processes, produce their product, and hire, train, and retain their personnel.  Often referred to as \"high performance,\" these qualities are characterized by worker training and development, continuous improvement, ongoing information sharing, and worker discretion and autonomy.   They are equally applicable to small, medium-sized, and large manufacturing firms.  While many barriers exist that challenge small manufacturers to move from their traditional operations to high performance, those that are able to operate in this mode have demonstrated success. In 1988, Congress passed the Omnibus Trade and Competitiveness Act which charged the National Institute of Standards and Technology (NIST) to help smaller  manufacturers adopt and apply performance-improving technologies as needed to meet the  intensifying domestic and global competition in manufacturing.  NIST established the Manufacturing Extension Partnership (MEP) program to create and implement a nationwide system of technical assistance centers, staffed by knowledgeable manufacturing and other business system professionals, to enable small and medium-sized manufacturers reach this goal. Each of the 78 MEP center's individuality results from its respective charter, which, in turn, reflects the needs and priorities of its stakeholders, location, and client firms.  As providers of services that help small manufacturing firms become more productive in all of their  functions, MEP centers can influence their client firms' evolution towards high performance, which would include a focus on training and other flexible work practices.  Yet, not all of the MEP centers report that they provide technical assistance in human resource-related activities to their client firms. In fact, some of the centers report no assistance in this topic area at all.  This study attempted to understand why some MEP centers do not place a high value on training and other flexible work practices as critical components of the services they provide to their client firms. I conducted qualitative case studies of three MEP centers whose inclusion of training and other flexible work practices to their client firms ranged from none to integration with all services. Applying grounded theory analysis techniques, I identified experiences, training, and organizational policies that have either enabled or discouraged these service providers from offering a comprehensive, holistic range of services to their client firms. The data yielded four constructs that are common to the three centers and explain their involvement with human resource-related activities: (1) control; (2) discrepant values and behaviors; (3) limited definitions of training and development; and (4) experiences.  The four constructs formed the basis of the analyses of the three centers.  The constructs also contributed to a model for identifying interventions to assist MEP centers and their staffs transition from solely technically-oriented assistance to more holistic approaches.",
  "description_provenance": [
    "Author Email: sabyrne@ibm.net",
    "Advisor Email: wiswell@vt.edu",
    "Advisor Email: mcline@vt.edu",
    "Advisor Email: larry.french@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: creimann@mep.nist.gov",
    "Made available in DSpace on 2014-03-14T20:09:59Z (GMT). No. of bitstreams: 1 etd.pdf: 394098 bytes, checksum: d02e9f7a3067f77bdb0eb422916ab051 (MD5)   Previous issue date: 1999-04-06"
  ],
  "handle": "26978",
  "identifier_other": "etd-041899-231130",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041899-231130/",
  "identifier_uri": "http://hdl.handle.net/10919/26978",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Small Business",
    "Training",
    "Human Resource Development",
    "Technical Assistance"
  ],
  "title": "The Value of Human Resource Development to an Organization; Providing Technical Assistance to Small Manufacturing Companies",
  "type": "Dissertation"
}