{
  "contributor_author": "Weiler, Spencer C.",
  "contributor_committeecochair": "Salmon, Richard G.",
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:57Z",
  "date_adate": "2007-04-24",
  "date_available": "2014-03-14T20:09:57Z",
  "date_issued": "2007-03-29",
  "date_rdate": "2007-04-24",
  "date_sdate": "2007-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abbeville v. the State of South Carolina (2005) is the latest lawsuit in a long line of cases addressing school finance issues that originated with Brown v. the Board of Education (1954), Serrano v. Priest (1971), and the San Antonio Independent School District v. Rodriquez (1973). Unlike many of the other school finance cases that have been adjudicated, Abbeville has not been the subject of much academic scrutiny. This case study documented Abbevilleâ  s origins in an effort to begin the process of academic examination and understanding. To document the inception of this case, five research questions were developed to guide the efforts. These five research questions were: 1) What political and economic conditions were present in South Carolina in the early 1990s that led to the decision to file the lawsuit?; 2) How were the eight lead school districts selected to be a part of the plaintiffsâ   case?; 3) What legal arguments did both the plaintiffs and defendants use in Abbeville?; 4) Why did the state choose to contest the lawsuit?; and 5) What was the 2005 ruling in the Abbeville case and how did people closely associated with the case react to the decision? The data used to answer these research questions included analysis of primary documents and eighteen qualitative interviews. The primary documents included the state constitution, current legislation in South Carolina affecting public education, previous school finance oriented court cases in South Carolina, and student achievement data. The eighteen participants in this study all shared a high degree of familiarity with Abbeville. Eleven were directly involved in the case (testified, heard and/or made legal arguments), four were deposed, and the remaining three followed the case closely. The credibility of this study increased through the use of triangulation, or the use of multiple data sources related to an issue of uncertainty, which produced the conclusions to the study found at the end of this document. As a result of the data collected, conclusions related to Abbeville are presented along with a discussion on the implications of this study. There are also suggestions for future studies.",
  "description_provenance": [
    "Author Email: sweiler@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:57Z (GMT). No. of bitstreams: 1 SCWDissertation419.pdf: 1105009 bytes, checksum: 28be3201c9dec48db63dbfe9e2084a0b (MD5)   Previous issue date: 2007-03-29"
  ],
  "handle": "26970",
  "identifier_other": "etd-04182007-124854",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04182007-124854/",
  "identifier_uri": "http://hdl.handle.net/10919/26970",
  "publisher": "Virginia Tech",
  "relation_haspart": "SCWDissertation419.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "school finance",
    "school law",
    "Abbeville",
    "South Carolina",
    "adequacy"
  ],
  "title": "Abbeville v. the State of South Carolina: A Case Study",
  "type": "Dissertation"
}