{
  "contributor_author": "Schwarzbach, Linda G.",
  "contributor_committeechair": "Hoerner, James L.",
  "contributor_committeemember": [
    "Creamer, Donald G.",
    "Dawson, Christina M.",
    "Fortune, Jimmie C.",
    "Hensley, Stephen Michael"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:58Z",
  "date_adate": "1999-04-20",
  "date_available": "2014-03-14T20:09:58Z",
  "date_issued": "1999-04-01",
  "date_rdate": "2000-04-20",
  "date_sdate": "1999-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The process of communicating new ideas - diffusion - transpires over time  along communication channels in a social system. In education, much stands to be  gained from successful innovation. The process is a perilous course with high  rates of casualty. As viable innovations fail, our schools bear the  consequences. This dissertation includes a process study of the diffusion of an  innovation at a state department of education and in two school districts. The  study was framed by Rogers' model of innovation in organizations (1995) to  determine if the diffusion of a comprehensive career development program  verified theory.  Through instrumental case studies, the process of diffusing career  development was traced. The investigative procedure included the examination of  temporal patterns that, when sequenced, indicated operational links in a multi- dimensional process of innovation.   Findings indicated five stages as delineated by Rogers (1995) but more  broadly defined. Additionally, the stages emerged in interactive looping  patterns unlike Rogers' linear model. Different outcomes were evidenced in each  case. The state department of education was the only agency that verified the  problem-based foundation of Rogers' initiation stages. The model's  implementation components were found to be too linear, precluding the recycling  patterns that occurred during the on-going mutual adaptations between the  innovation and the organizations.  Rogers' model of the innovation process in organizations attempts,  unsuccessfully, to reach beyond the complex communication networking that his  descriptions of diffusion categorize. To attempt to spread the strength of the  theoretical implications of actual diffusion is to misuse the assets and  unjustly ascribe an inadequacy to them. Diffusion of innovation in individuals  and in organizations involves different complexities that are not accounted for  in Rogers' organization model. Rogers' model for individuals is deployable to  the organization innovation process as explanation of individuals acting within  a greater body, yet explaining the parts of a whole does not necessarily explain  the whole. Rogers' model lacks content explanation and complexity explanation of  the process of organizational innovation.",
  "description_provenance": [
    "Author Email: lschwarz@vt.edu",
    "Advisor Email: jhoerner@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: tdawson@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:58Z (GMT). No. of bitstreams: 1 dissertation.pdf: 226116 bytes, checksum: e5a47c97531286eee03c590aa52173bd (MD5)   Previous issue date: 1999-04-01"
  ],
  "handle": "26974",
  "identifier_other": "etd-041899-143918",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041899-143918/",
  "identifier_uri": "http://hdl.handle.net/10919/26974",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "diffusion",
    "innovation",
    "career development",
    "planned change"
  ],
  "title": "A Process Study of the Diffusion of Career Development",
  "type": "Dissertation"
}