{
  "contributor_author": "Lichty, Margaret",
  "contributor_committeechair": "Stewart, Daisy L.",
  "contributor_committeemember": [
    "Heath-Camp, Betty A.",
    "Asselin, Susan B.",
    "Bird, Gloria W.",
    "Fortune, Jimmie C."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:09:58Z",
  "date_adate": "1999-04-24",
  "date_available": "2014-03-14T20:09:58Z",
  "date_issued": "1999-04-07",
  "date_rdate": "2000-04-24",
  "date_sdate": "1999-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this research was to examine the socialization experiences of new family and consumer sciences teacher educators, including their interpretations of career preparation, their first job, socialization during the first year, continuing socialization and career development, and respondentsâ   recommendations for improving the socialization process.  Organizational socialization provided the theory base. Telephone and personal interviews were conducted with ten female family and consumer sciences teacher educators who held positions in comprehensive and research institutions across the country.  The constant comparison method was used for analysis of the data.   \tResults of the study revealed that graduate school professors provided the role modeling participants believed was crucial in preparing them for their future career.  Participants who had challenging and relevant coursework and opportunities for a variety of professional experiences during graduate school felt they were well prepared for their faculty roles. However participants for whom this was not the case felt their transition to a faculty role was much more of an overwhelming and unhappy experience.   \tNew faculty orientation sessions and career development facilitated success at the university level, while department chairs and faculty peers provided support at the department level.  Inhibitors of respondentsâ   success included feelings of being overwhelmed with their workload, inability to balance professional and personal lives, and department pressure to conduct research and publish articles.  Overall, participants indicated that  lack of time was the primary inhibitor of their success.  In spite of the overwhelming feelings of confusion, frustration, stress, and unhappiness during their first year in their new role, respondents reported that their second year was more positive.   \tImplications for improved practice include examining graduate program coursework to ensure relevance and application and including opportunities for increased responsibility in professional experiences related to teaching, research, and professional service.  Departments with new faculty should provide opportunities for new faculty to meet both formally and informally with the department chair to discuss policies related to promotion and tenure.  Further research could be done to examine the socialization experiences of new faculty in other areas of family and consumer sciences and vocational education to determine similarities or differences.",
  "description_provenance": [
    "Author Email: mlichty@csulb.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: heathb@vt.edu",
    "Advisor Email: sasselin@vt.edu",
    "Advisor Email: birdfcd@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:58Z (GMT). No. of bitstreams: 1 mlichty_dissertation.pdf: 277445 bytes, checksum: ce6204c8bbf1c972016ce2c893c8fad8 (MD5)   Previous issue date: 1999-04-07"
  ],
  "handle": "26977",
  "identifier_other": "etd-041899-152233",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041899-152233/",
  "identifier_uri": "http://hdl.handle.net/10919/26977",
  "publisher": "Virginia Tech",
  "relation_haspart": "mlichty_dissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "College Faculty Induction",
    "Family and Consumer Sciences Teacher Education",
    "Socialization"
  ],
  "title": "The Socialization Process of New College Faculty in Family and Consumer Sciences Teacher Education",
  "type": "Dissertation"
}