{
  "contributor_author": "Pilling, Barbara O",
  "contributor_committeecochair": [
    "Curcio, Joan L.",
    "Fortune, Jimmie C."
  ],
  "contributor_committeemember": [
    "Alexander, M. David",
    "Parson, Stephen R.",
    "Salmon, Richard G.",
    "Canny, Marie C."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:09:58Z",
  "date_adate": "1999-04-22",
  "date_available": "2014-03-14T20:09:58Z",
  "date_issued": "1999-04-13",
  "date_rdate": "2000-04-22",
  "date_sdate": "1999-04-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This is a historical study of the modern standards movement starting in 1983 with the landmark report, A Nation At Risk: The Imperative for Educational Reform, and concluding in 1995 with the publication of the revised Standards of Learning for Virginia Public Schools in the Commonwealth of Virginia. The study was done through a review of available archival papers, written documents, and oral testimony.  The purpose of this study was to analyze critically the modern standards movement as a context to the development and implementation of the revised Standards of Learning for Virginia Public Schools. Objectives of the study were to identify key events and key characters that impacted the standards movement and identify issues that evolved. A main focus of the study was to develop a documentary history that identified themes that linked events and showed connections between past and current events. Phase one of the process involved data collection from appropriate literary sources and writing the history as portrayed in written documents. Phase two of the process was done through the collection of oral testimony from key informers, especially in the Virginia movement and weaving that testimony logically and chronologically into the appropriate documentary history. Phase three of the process concluded with the identification of main themes that linked events and implications for future studies.",
  "description_provenance": [
    "Author Email: pillingb@area3off.fcps.k12.va.us",
    "Advisor Email: jcurcio@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:58Z (GMT). No. of bitstreams: 3 PartII.PDF: 358047 bytes, checksum: b8cf9ff49170e6354f47fc5058788fac (MD5) PartIII.PDF: 67604 bytes, checksum: 259be12cfaa4a74d259db8baf8c0670a (MD5) PartI.pdf: 17175 bytes, checksum: af7a9774727d002ef006a8cd336d3830 (MD5)   Previous issue date: 1999-04-13"
  ],
  "handle": "26975",
  "identifier_other": "etd-041899-145816",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041899-145816/",
  "identifier_uri": "http://hdl.handle.net/10919/26975",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "PartII.PDF",
    "PartIII.PDF",
    "PartI.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Education Policy",
    "Modern Standards Movement",
    "Virginia Standards of Learning"
  ],
  "title": "A Critical Analysis of the Modern Standards Movement:  A Historical Portrayal Through Archival Review, Written Documents and Oral Testimony  from 1983 to 1995",
  "type": "Dissertation"
}