{
  "contributor_author": "Rogers, Linda Peterson",
  "contributor_committeechair": "Protinsky, Howard O. Jr.",
  "contributor_committeemember": [
    "Prouty, Anne M.",
    "Rosen, Karen H.",
    "Stith, Sandra M.",
    "Blieszner, Rosemary",
    "Sporakowski, Michael J."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:09:59Z",
  "date_adate": "2000-04-28",
  "date_available": "2014-03-14T20:09:59Z",
  "date_issued": "2000-04-06",
  "date_rdate": "2001-04-28",
  "date_sdate": "2000-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "WOMEN RECREATING THEIR LIVES: CHALLENGES AND RESILIENCE IN MIDLIFE By Linda Peterson Rogers<p> Howard O. Protinsky, Committee Chair Human Development (ABSTRACT) <p>This research explores how midlife women found the strength and resilience that enabled them to rebound and grow as they negotiated significant life challenges in their marriage, and with their children, parents, careers, and health. Using a family resilience framework grounded in systems theory with a feminist perspective, the researcher conducted in-depth interviews with 18 diverse women between the ages of 40 and 60 years in different regions of the United States. The phenomenological method of inquiry allowed the researcher to gather the experiences of midlife women in order to understand the protective processes of resilience for overcoming adversity. <p>Three research questions guided this study: (1) How have women dealt with an adverse experience or challenging transition in their adult married life and where did the strength or resilience they needed to rise above it come from?  (2) How did they use their resilience in challenging situations? (3) How did this challenging experience influence their marriage and how was the experience affected by their marriage? <p>Results suggest that the participantsâ   core beliefs facilitated how they made meaning of their struggle and influenced their response to their challenges. The themes they discussed fell into beliefs that were organized as affiliative values, facilitative beliefs and transcendent spiritual beliefs. These belief systems described how they made sense of their challenges.  <p>Themes related to the importance of connectedness and relationships also occurred frequently in the narratives of these midlife women as they developed resilience. As  expected, marriage was important to the majority of the women as they discussed the importance of emotional support, but their sense of well-being was also greatly influenced by other close relationships in their communities with friends, family, children, and role models. Work and education emerged as significant themes in the womenâ  s appraisal of their challenges, beliefs, and connectedness as they described their sense of resilience. Resilience was fostered when these women made connections between their past, present, and future and integrated their experiences, their beliefs, relationships, and resources.",
  "description_provenance": [
    "Author Email: lirogers@vt.edu",
    "Advisor Email: Aprouty@vt.edu",
    "Advisor Email: Krosen@vt.edu",
    "Advisor Email: HProtins@vt.edu",
    "Advisor Email: sstith@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Advisor Email: eagle1@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:59Z (GMT). No. of bitstreams: 1 etd.pdf: 338895 bytes, checksum: bc5420e54e7883801288cbf9b25c0c59 (MD5)   Previous issue date: 2000-04-06"
  ],
  "handle": "26979",
  "identifier_other": "etd-04192000-09580054",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192000-09580054/",
  "identifier_uri": "http://hdl.handle.net/10919/26979",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "qualitative",
    "resilience",
    "marriage",
    "feminist perspective",
    "midlife women",
    "life cycle challenges"
  ],
  "title": "Women Recreating their Lives: Challenges and Resilience in Midlife",
  "type": "Dissertation"
}