{
  "contributor_author": "Bayless, Laura A.",
  "contributor_committeechair": "Creamer, Donald G.",
  "contributor_committeemember": [
    "Hirt, Joan B.",
    "Muffo, John A.",
    "Hill, David E.",
    "Turner, Sherri Guilliams"
  ],
  "contributor_department": "Higher Education and Student Affairs",
  "date_accessioned": "2014-03-14T20:10:01Z",
  "date_adate": "2001-04-20",
  "date_available": "2014-03-14T20:10:01Z",
  "date_issued": "2001-04-11",
  "date_rdate": "2002-04-20",
  "date_sdate": "2001-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Distance learning is a fast-growing method of delivery in higher education. The literature about distance learning is rich with information about learning and course design. However, there is little information about the non-academic support services that universities can and should provide for distance students. This study addresses that gap in the literature by exploring the non-academic needs of distance learners. Students and faculty members involved with distance learning at four-year institutions in the Fall of 2000 were asked to identify what, if any, needs distance learners have outside the classroom. Specifically, an original web-based survey was designed to identify 34 possible non-academic needs. Respondents were asked to rate the importance of those needs in the success of distance learners, the accessibility of services to meet those needs, and when the needs present themselves to distance learners.  Findings indicate that the non-academic needs of distance learners are very similar to those of campus-based students. The most important needs are basic: information about the institution and program, a way to purchase books, a contact person at the institution, and academic advising. More traditional developmental needs such as leadership development, experience with diversity, and career services were important to respondents pursuing Bachelors degrees. Services to meet the needs are currently not easily accessible. Most needs present themselves throughout a studentâ  s academic career. Institutions involved with distance learning should consider addressing basic needs first. If an institution targets a large number of students pursuing Bachelor degrees at a distance, they might also add services to meet more traditional developmental needs.",
  "description_provenance": [
    "Author Email: lbayless@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: muffo@vt.edu",
    "Advisor Email: dhill@runet.edu",
    "Advisor Email: turnersg@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:01Z (GMT). No. of bitstreams: 1 BaylessDissertation.pdf: 1574176 bytes, checksum: 745381c23874e658cc25342ec1ce737e (MD5)   Previous issue date: 2001-04-11"
  ],
  "handle": "26987",
  "identifier_other": "etd-04192001-142117",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192001-142117/",
  "identifier_uri": "http://hdl.handle.net/10919/26987",
  "publisher": "Virginia Tech",
  "relation_haspart": "BaylessDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "non-academic needs",
    "services for distance learners",
    "distance learning"
  ],
  "title": "What are the Non-Academic Needs of Distance Learners?",
  "type": "Dissertation"
}