{
  "contributor_author": "Chatreewongsin, Urai",
  "contributor_committeecochair": [
    "McNair, Harold M.",
    "Long, Gary L."
  ],
  "contributor_committeemember": [
    "Dietrich, Andrea M.",
    "Deck, Paul A.",
    "Anderson, Mark R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:09:59Z",
  "date_adate": "2000-05-01",
  "date_available": "2014-03-14T20:09:59Z",
  "date_issued": "2000-03-27",
  "date_rdate": "2001-05-01",
  "date_sdate": "2000-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This work involves the combination of chelation and microwave extraction as a technique for extracting adsorbed metals in soil.  It has been termed in this work, Chelate Assisted Microwave Extraction (CAME).  Unlike other extraction methods, CAME is able to differentiate between anthropological and geological trace metals.   <p> The method has been applied to major sample matrices included three types of soils (Bertie Sandy Loam, Davidson Silty Clay, and Davidson Clayey Loam) as well as sea sand, alumina, and iron oxide.  In order to investigate the effects of sorptive coatings on metal concentrations, a sample set was first treated with humic acids, which represented organic coated materials.  Afterwards, copper (II) solutions were spiked to both untreated and treated matrices and the efficiencies of recoveries were studied.  Metal determinations were performed by Inductively Coupled Plasma-Atomic Emission Spectrophotometry (ICP-AES). <p> Initial studies of control (untreated soil) and long-term Cu amended (spiked) Bertie Sandy Loam (BSL) indicated that extraction efficiencies were method dependent.  Ethylenediaminetetraacetic acid (EDTA) was a primary chelating agent used for method comparisons.  Extracting solutions having a pH range from 7.8 to 10.1 did not affect the EDTA-microwave method, but the increase in pH enhanced Cu removal by the EDTA-shaking extraction method which was a conventional chelation using a mechanical shaker.  With the EDTA-microwave method, complete extraction was achieved in a short period of time (20 minutes).  Compared to the EDTA-shaking method using two sandy soils, the EDTA-microwave method proved to be more efficient in extracting sorbed metals in soils (5.9 vs. 4.6 µg/g for the control BSL and 37.5 vs. 27.8 µg/g for the amended BSL. <p> FT-IR and C13 NMR were used to characterize extracted and commercially available humic acids.  The latter was employed to prepare the humate coated materials.  Iron oxide containing materials such as Davidson Silty Clay (DSC), Davidson Clayey Loam (DCL), and iron oxide (Fe2O3), showed extremely high adsorption capabilities for humic acids, while sea sand, Bertie Sandy Loam, and alumina (Al2O3) provided lower adsorption capabilities for humic acids.  Two sets of uncoated and humate coated materials were used for Cu spiking procedures using 0.001 M Cu (II) at pH 5.3 for 24 hour-equilibration.  Three original soils and alumina showed high adsorption capabilities for Cu (II).  The presence of coated humate helped increase Cu adsorption capabilities of these soils, but diminished the ability of alumina to react with Cu (II) ions.  For HA-uncoated matrices, iron oxide had a higher Cu adsorption capability than sea sand but less than real soils.  Humate coating improved Cu adsorption capabilities of not only real soils but iron oxide and sea sand as well.   <p> Lastly, the developed method named Chelate Assisted Microwave Extraction (CAME) was further examined and optimized.  Several samples were investigated for extraction efficiencies.  A two-step extraction, applying 120 W for 5 min followed by 60 W for 10 min, was efficient in removing sorbed metals from different matrices regardless of sorptive oxide and organic components.  Concentrations of chelating agents slightly affected percent metal removal; however, there was no significant difference in results obtained using EDTA or diethylenetriaminepentaacetic acid (DTPA).  Recoveries of spiked metals (Cu and Cd) ranged from 96 to 107%.  Using the untreated (control) Davidson Silty Clay and Bertie Sandy Loam, the comparison of other chelating solutions were made. Clearly, CAME was promising and proved to be a good alternative to classical shaking method for extracting adsorbed metals from soils. <p>",
  "description_provenance": [
    "Author Email: urai@vt.edu",
    "Advisor Email: hmcnair@vt.edu",
    "Advisor Email: long@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Advisor Email: pdeck@chemserver.chem.vt.edu",
    "Advisor Email: manderson@chemserver.chem.vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:59Z (GMT). No. of bitstreams: 2 etd-abstract.pdf: 12076 bytes, checksum: e6af9aa5b90b6afc5cc4d43758a36390 (MD5) etd-full.pdf: 531823 bytes, checksum: bd4cf5650eef0fc203606cb0822a1bfc (MD5)   Previous issue date: 2000-03-27"
  ],
  "handle": "26982",
  "identifier_other": "etd-04192000-14040027",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192000-14040027/",
  "identifier_uri": "http://hdl.handle.net/10919/26982",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etd-abstract.pdf",
    "etd-full.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Chelation",
    "Soil",
    "Microwave",
    "Humic acid",
    "Metals",
    "Extraction",
    "Digestion"
  ],
  "title": "Metal Extraction From Soil Samples By Chelation in a Microwave System",
  "type": "Dissertation"
}