{
  "contributor_author": "Sohn, Seungman",
  "contributor_committeechair": "Marand, Hervé L.",
  "contributor_committeemember": [
    "Wilkes, Garth L..",
    "Kander, Ronald C.",
    "Reynolds, William T. Jr.",
    "Davis, Richey M."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:09:59Z",
  "date_adate": "2000-04-20",
  "date_available": "2014-03-14T20:09:59Z",
  "date_issued": "2000-04-05",
  "date_rdate": "2001-04-20",
  "date_sdate": "2000-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Crystallization and multiple melting behavior of bisphenol-A polycarbonate (PC) was investigated using differential scanning calorimetry (DSC) for the monitoring of thermal behavior and atomic force microscopy (AFM) for the morphology study.  The exceedingly slow crystallization kinetics of PC and the feasibility of obtaining near monodisperse fractions provide distinct advantages for the elucidation of the effects of crystallization time, temperature, and molar mass on crystallization kinetics.  The effects of molar mass on the glass transition temperature (Tg) and heat capacity change at Tg, and the amorphous density of PC were investigated. Similar to many semicrystalline polymers, PC exhibits a multiple melting behavior upon heating.  While for each PC sample, the coexistence of low and high temperature endothermic regions in the DSC heating traces is explained by the melting of populations of crystals with different stabilities, melting-recrystallization-remelting effects are observed only for the lowest molar mass samples.   The effects of crystallization temperature and molar mass distribution on overall crystallization kinetics were studied for some of the fractions, including the commercial PC-28K (Mw = 28,000 g.mol-1) sample.  Regarding the kinetics of secondary crystallization, particular attention was placed on understanding the effects of molar mass, initial degree of crystallinity prior to the secondary crystallization, and secondary crystallization time and temperature.  The secondary crystallization of PC follows the same laws discovered in previous studies of PEEK, PET, it-PS and ethylene copolymers, and the results are discussed in the context of a bundle-like secondary crystallization model.   During isothermal annealing of semicrystalline PC-28K around the high melting endotherm, a significant increase of melting temperature along with peak broadening with time was observed.  Independently, morphological studies using AFM showed that mean lamellar thickness increases with time during isothermal annealing.  These results are discussed in light of isothermal thickening of lamellar crystals.  Lastly, almost 200 DSC melting traces of varying molar mass PC samples thermally treated under various conditions were analyzed to calculate crystallinity (Xc), rigid fraction (RF), and rigid amorphous fraction (RAF).  The correlation between RAF vs Xc, Tg, and Tg broadening are discussed.",
  "description_provenance": [
    "Author Email: seungman_sohn@yahoo.co.kr",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: rkander@vt.edu",
    "Advisor Email: hmarand@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:09:59Z (GMT). No. of bitstreams: 1 etd.pdf: 2304267 bytes, checksum: ff0cfd788ee5618783be53e5cb3e63b7 (MD5)   Previous issue date: 2000-04-05"
  ],
  "handle": "26980",
  "identifier_other": "etd-04192000-12580040",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192000-12580040/",
  "identifier_uri": "http://hdl.handle.net/10919/26980",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Bisphenol-A polycarbonate",
    "Secondary crystallization kinetics",
    "Multiple melting behavior",
    "Crystallization"
  ],
  "title": "Crystallization Behavior of Bisphenol-A Polycarbonate: Effects of Crystallization Time, Temperature, and Molar Mass",
  "type": "Dissertation"
}