{
  "contributor_author": "Wolfe, Christy D.",
  "contributor_committeechair": "Bell, Martha Ann",
  "contributor_committeemember": [
    "Hoffman, Kurt A.",
    "Dunsmore, Julie C.",
    "Cooper, Robin K. Panneton",
    "Ollendick, Thomas M."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:10:03Z",
  "date_adate": "2005-04-21",
  "date_available": "2014-03-14T20:10:03Z",
  "date_issued": "2005-03-31",
  "date_rdate": "2010-10-13",
  "date_sdate": "2005-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> The focus of this project falls largely within the realm of investigating the development of brain-cognition relations from a developmental cognitive neuroscience perspective. There were two main goals of this study. First, this study focused on the regional differences in baseline-to-working memory task brain electrical activity and specifically investigated the hypothesis that there would be an increasing specificity of task EEG power between 3Â½ and 4Â½ years of age. The second goal of this study was to investigate the sources of variability in working memory function and to specifically examine the contributions of task-related EEG, the regulatory dimensions of temperament, and linguistic ability to the prediction of working memory performance. This second study objective included an investigation of the relation between working memory and each of these variables (1) separately, (2) in conjunction with age, and (3) collectively to examine any multivariate contributions to the explanation of variance in working memory function in early childhood. </p><p> The results of this study provided some support to the increasing specificity of baseline-to-task EEG power hypothesis. Specifically, an increase in brain electrical activity was found for four scalp regions at age 4 and only two regions at age 4Â½. These findings coupled with previous work indicating an increase in task brain electrical activity for only one region at age 4Â½ suggest that cortical specialization is occurring during the early childhood years. With regard to the investigation of sources of variability working memory function, age, brain electrical activity, temperament, and linguistic functioning were all found to be meaningful variables in the explanation of variance in working memory. However, linguistic functioning â   and specifically language receptivity â   was found to be the strongest and most meaningful associate of working memory function. Additional findings of interest included the differential associations demonstrated between working memory and temperament for each age group and also an increase in the strength of the relation between working memory and language across the three ages.  </p>",
  "description_provenance": [
    "Author Email: cwolfe@vt.edu",
    "Advisor Email: khoffma@vt.edu",
    "Advisor Email: jdunsmor@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: panneton@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:03Z (GMT). No. of bitstreams: 1 DissertationPDF.pdf: 388158 bytes, checksum: 9f2ec24c20526a2c391e747eeb2dcdd4 (MD5)   Previous issue date: 2005-03-31"
  ],
  "handle": "26999",
  "identifier_other": "etd-04192005-130802",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192005-130802/",
  "identifier_uri": "http://hdl.handle.net/10919/26999",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationPDF.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "frontal lobe function",
    "attention",
    "inhibitory control",
    "working memory",
    "EEG"
  ],
  "title": "Regional differences in task-related brain electrical activity and sources of variability in working memory function in early childhood",
  "type": "Dissertation"
}