{
  "contributor_author": "O'Shea, Patrick Gavan",
  "contributor_committeecochair": [
    "Hauenstein, Neil M. A.",
    "Foti, Roseanne J."
  ],
  "contributor_committeemember": [
    "Mullins, Morell E. Jr.",
    "Donovan, John J.",
    "Singh, Kusum"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:10:02Z",
  "date_adate": "2002-04-26",
  "date_available": "2014-03-14T20:10:02Z",
  "date_issued": "2002-04-09",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Prior work in the transformational leadership realm has focused primarily on relations among leader behaviors and various criteria such as subordinate satisfaction and effectiveness.  This restrictive focus has limited the degree to which one of Bassâ  s (1985a) central arguments can be directly assessed; namely, that optimally effective leaders engage in both transformational and transactional behaviors.  In this study, an analytic technique known as the pattern approach was employed to effectively discern which particular pattern of leader behaviors was associated with the highest levels of subordinate satisfaction and commitment. In general, the most effective leaders used a combination of transformational (e.g., stimulating subordinates to think of old problems in new ways; presenting a charismatic and inspirational view of the future) and contingent reward (e.g., providing pay or promotions in exchange for effective subordinate performance) behaviors, coupled with a low level of passive management-by-exception behaviors (e.g., remaining uninvolved until problems emerge). These optimally effective leaders were generally more successful than leaders who used predominantly one (e.g., transformational or transactional) behavioral style.",
  "description_provenance": [
    "Author Email: goshea@air.org",
    "Advisor Email: mullinm@bgnet.bgsu.edu",
    "Advisor Email: donovan@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:02Z (GMT). No. of bitstreams: 2 ABSTRACT.pdf: 54302 bytes, checksum: 6b50e2102c37d19f1bd93040f21667c6 (MD5) gavan.pdf: 493902 bytes, checksum: 9c82bccad7d11eb67067295899936fda (MD5)   Previous issue date: 2002-04-09"
  ],
  "handle": "26990",
  "identifier_other": "etd-04192002-112831",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192002-112831/",
  "identifier_uri": "http://hdl.handle.net/10919/26990",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ABSTRACT.pdf",
    "gavan.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "transformational leadership",
    "pattern approach",
    "affective commitment",
    "transactional leadership",
    "turnover intentions"
  ],
  "title": "A Different Way of Looking: Application of a Pattern Approach to Understanding Transformational and Transactional Leadership",
  "type": "Dissertation"
}