{
  "contributor_author": "Conley, Valerie Martin",
  "contributor_committeechair": "Janosik, Steven M.",
  "contributor_committeemember": [
    "Creamer, Donald G.",
    "Hirt, Joan B.",
    "Martin, Douglas D.",
    "Bayer, Alan E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:03Z",
  "date_adate": "2002-04-25",
  "date_available": "2014-03-14T20:10:03Z",
  "date_issued": "2002-04-09",
  "date_rdate": "2003-04-25",
  "date_sdate": "2002-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Faculty members are influenced by a complex set of factors when making decisions about when to retire. These factors generally include both financial and non-financial characteristics. This study was designed to examine the non-financial factors related to the retirement process for selected faculty groups. Key components of the design included selecting faculty groups for analysis and identifying the non-financial factors related to the retirement process. Two faculty groups were selected: (a) faculty who had previously retired from another position and (b) faculty members with no plans to retire in the next three years. The non-financial factors were identified through a review of the literature and included (a) employment characteristics, (b) demographic characteristics, (c) activity measures, and (d) satisfaction items. The study was based on secondary analysis of NSOPF: 99 data.  A combination of descriptive statistics and logistic regression was used to analyze the data.   Major findings include (a) previously retired faculty members may be a substantial pool of qualified, productive talent intrinsically motivated to be part of an academic environment on a part-time basis because their financial status is not solely dependent on basic salary from the institution; (b) additional indicators distinguishing age at retirement from a career position versus age at retirement from all paid employment may also be needed to fully describe the issue; (c) employment status, years in current position, program area, age, gender, geographic region, average class size, and satisfaction with other aspects of the job (excluding instructional duties) were distinguishing characteristics of previously retired faculty members; (d) a sizeable portion of older faculty has not yet reached traditional retirement age; (e) the impact of uncapping mandatory retirement ages for tenured faculty may not have yet been fully realizedâ   even eight years after the legislation took effect;  (f) evidence does not support some of the objections from the higher education community in opposition to uncapping; and (g) control of institution, program area, years in current position, age, marital status, number of dependents, recent publications, career publications, and satisfaction were distinguishing characteristics of faculty members with no plans to retire in the next three years.",
  "description_provenance": [
    "Author Email: vconley@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: dmartin@vt.edu",
    "Advisor Email: yogi@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:03Z (GMT). No. of bitstreams: 3 03VconleyVita.pdf: 169193 bytes, checksum: f7fd84776d3cc4e6b9a81737d7996177 (MD5) 02AppendixA.pdf: 244779 bytes, checksum: 63736a50cbf7fd4171e037abf60f6dff (MD5) 01Vconley.pdf: 961783 bytes, checksum: de2ade3c1025efa92f5b671ac57bc60a (MD5)   Previous issue date: 2002-04-09"
  ],
  "handle": "26992",
  "identifier_other": "etd-04192002-130055",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192002-130055/",
  "identifier_uri": "http://hdl.handle.net/10919/26992",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "03VconleyVita.pdf",
    "02AppendixA.pdf",
    "01Vconley.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "retirement plans",
    "logistic regression",
    "previously retired faculty"
  ],
  "title": "Non-financial Factors Related to the Retirement Process of Selected Faculty Groups",
  "type": "Dissertation"
}