{
  "contributor_author": "Enyeart Smith, Theresa M.",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Glegg, Stewart A. L.",
    "Skaggs, Gary E.",
    "Eschenmann, Konrad Kurt",
    "Krouscas, James A. Jr."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:03Z",
  "date_adate": "2004-04-20",
  "date_available": "2014-03-14T20:10:03Z",
  "date_issued": "2004-04-07",
  "date_rdate": "2004-04-20",
  "date_sdate": "2004-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A Comparison of Health Risk Behaviors Among College Students Enrolled in a Required Personal Health Course vs. Enrolled in an Elective Personal Health Course <p> Theresa Michelle Enyeart Smith <p> ABSTRACT <p> Information on the overall health risk behaviors of college students is limited and it is unknown if being enrolled in an elective or a required health course affects behavior change among the students.   <p> There are mixed reports on whether or not health education courses affect behavior change.  Factors that may affect change are self-efficacy and the constructs that build the Health Belief Model (i.e. perceived susceptibility and perceived barriers). <p> A sample of convenience was gathered for the current study using two universities in the state of Virginia.  Virginia Tech students within the sample were enrolled in an elective health course (n = 375) and James Madison University students within the sample were enrolled in a required health course (n = 202).  The National College Health Risk Behavior Survey (NCHRBS) and the Self-Efficacy Scale survey were used to gather information on overall health risk behaviors, health behavior changes, and self-efficacy levels of the students.  To acquire health behavior change data, the NCHRBS was administered at the beginning of the Fall 2003 semester and again at the end of the semester. <p> The results of the study indicated that, overall, the type of course a student was enrolled in and self-efficacy did not have a significant effect on health behavior change.  However, possible trends were identified with alcohol use, tobacco use, and dietary behaviors, indicating that further research should be performed to analyze underlying factors, not analyzed in this study, which may be affecting health risk behaviors.",
  "description_provenance": [
    "Author Email: tenyeart2@cox.net, tenyeart@vt.edu",
    "Advisor Email: stewarsh@jmu.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Advisor Email: jkrousca@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:03Z (GMT). No. of bitstreams: 1 Theresa_M._Enyeart_Smith_Dissertation.pdf: 872241 bytes, checksum: 48a416d11d712522e77fc385c03a374b (MD5)   Previous issue date: 2004-04-07"
  ],
  "handle": "26998",
  "identifier_other": "etd-04192004-165303",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192004-165303/",
  "identifier_uri": "http://hdl.handle.net/10919/26998",
  "publisher": "Virginia Tech",
  "relation_haspart": "Theresa_M._Enyeart_Smith_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Elective Course",
    "Self-Efficacy",
    "Required Course",
    "National College Health Risk Behavior Survey"
  ],
  "title": "A Comparison of Health Risk Behaviors Among College Students Enrolled in a Required Personal Health Course vs. Enrolled in an Elective Personal Health Course",
  "type": "Dissertation"
}