{
  "contributor_author": "Repass, Mary Eva",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "McCollum, Eric E.",
    "Morris, Linda E.",
    "Lichtman, Marilyn V.",
    "Kurstedt, Harold A. Jr.",
    "Combs, Letitia A."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:02Z",
  "date_adate": "2002-04-26",
  "date_available": "2014-03-14T20:10:02Z",
  "date_issued": "2002-04-10",
  "date_rdate": "2005-04-26",
  "date_sdate": "2002-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The transitional process to retirement by today's professional women is an issue of great significance.  Beginning in the 1960s, these women became the first generation en masse to form long-term careers and to join the professional ranks.  Retirement is now affecting over seven million women who are age 55 or older.  A void exists in literature concerning these women's experiences as they approach retirement.  Their pre-retirement transitions and decision-making process have not been previously addressed.  This study addressed the void and through qualitative research, employed a multiple-case study with a phenomenological frame.  Through in-depth interviews, the data collected addressed professional women's pre-retirement decision-making.  A five-phase working model was developed that illustrates the transitions to retirement of professional women.",
  "description_provenance": [
    "Author Email: rrglobalco@aol.com",
    "Made available in DSpace on 2014-03-14T20:10:02Z (GMT). No. of bitstreams: 1 Retirementofprofessionalwomen.pdf: 467797 bytes, checksum: 1998353339d29281ee921ce51f5d9f05 (MD5)   Previous issue date: 2002-04-10"
  ],
  "handle": "26991",
  "identifier_other": "etd-04192002-114300",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192002-114300/",
  "identifier_uri": "http://hdl.handle.net/10919/26991",
  "publisher": "Virginia Tech",
  "relation_haspart": "Retirementofprofessionalwomen.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "professional women",
    "Phases of Professional Women's Decisions to Reti",
    "transitions",
    "transition to retirement",
    "aging",
    "retirement",
    "retirement sabbatical"
  ],
  "title": "The Professional Woman's Decision to Retire:  The Process of Transition",
  "type": "Dissertation"
}