{
  "contributor_author": "Newbill, Phyllis Leary",
  "contributor_committeechair": "Cennamo, Katherine S.",
  "contributor_committeemember": [
    "Whisonant, Robert C.",
    "Lockee, Barbara B.",
    "Singh, Kusum",
    "Doolittle, Peter E."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:04Z",
  "date_adate": "2005-04-25",
  "date_available": "2014-03-14T20:10:04Z",
  "date_issued": "2005-03-22",
  "date_rdate": "2005-04-25",
  "date_sdate": "2005-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Although negative attitudes toward science are common among women and men in undergraduate introductory science classes, womenâ  s attitudes toward science tend to be more negative than menâ  s. The reasons for womenâ  s negative attitudes toward science include lack of self-confidence, fear of association with social outcasts, lack of women role models in science, and the fundamental differences between traditional scientific and feminist values. Attitudes are psychological constructs theorized to be composed of emotional, cognitive, and behavioral components. Attitudes serve functions, including social expressive, value expressive, utilitarian, and defensive functions, for the people who hold them. To change attitudes, the new attitudes must serve the same function as the old one, and all three components must be treated. Instructional designers can create instructional environments to effect attitude change. In designing instruction to improve womenâ  s attitudes toward science, instructional designers should (a) address the emotions that are associated with existing attitudes, (b) involve credible, attractive women role models, and (c) address the functions of the existing attitudes.  Two experimental instructional modules were developed based on these recommendations, and two control modules were developed that were not based on these recommendations. The asynchronous, web-based modules were administered to 281 undergraduate geology and chemistry students at two universities. Attitude assessment revealed that attitudes toward scientists improved significantly more in the experimental group, although there was no significant difference in overall attitudes toward science. Womenâ  s attitudes improved significantly more than menâ  s in both the experimental and control groups. Students whose attitudes changed wrote significantly more in journaling activities associated with the modules. Qualitative analysis of journals revealed that the guidelines worked exactly as predicted for some students.",
  "description_provenance": [
    "Author Email: pnewbill@vt.edu",
    "Advisor Email: rwhisona@radford.edu",
    "Advisor Email: cennamo@vt.edu",
    "Advisor Email: barbara.lockee@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:04Z (GMT). No. of bitstreams: 4 Newbilldissertation.pdf: 4200928 bytes, checksum: 78923809dd0f173934b4dff37e62bf10 (MD5) Cacioppo.txt: 2396 bytes, checksum: b08a38b6b94c819ede1b102a382cf490 (MD5) Elsevier.htm: 11349 bytes, checksum: 04e992385c892324d6f768ff4eb9055d (MD5) Petty.htm: 2742 bytes, checksum: 3674a3ea8168d6f99926a82988be9ad4 (MD5)   Previous issue date: 2005-03-22"
  ],
  "handle": "27000",
  "identifier_other": "etd-04192005-151412",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192005-151412/",
  "identifier_uri": "http://hdl.handle.net/10919/27000",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Newbilldissertation.pdf",
    "Cacioppo.txt",
    "Elsevier.htm",
    "Petty.htm"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Instructional Design",
    "Womenâ  s studies",
    "Science Education",
    "Attitude change"
  ],
  "title": "Instructional Strategies to Improve Women's Attitudes toward Science",
  "type": "Dissertation"
}