{
  "contributor_author": "Smith, Jeffrey O'Neal",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Roberts, James T.",
    "Hixson, Larry",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:04Z",
  "date_adate": "2005-04-25",
  "date_available": "2014-03-14T20:10:04Z",
  "date_issued": "2005-04-12",
  "date_rdate": "2006-04-25",
  "date_sdate": "2005-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p> The Commonwealth of Virginia has implemented the Standards of Learning which are designed to ensure that students meet certain benchmarks at various points in their elementary and secondary educational careers.  President George W. Busch signed into law the No Child Left Behind Act (NCLB) which is intended to ensure that all children succeed academically.  Each of these mandates incorporates levels of accountability to which school administrators, especially the superintendent, must adhere. </p><p>\tRecent studies indicate that the expectations for today's superintendent demand greater accountability and that the current systems, known as the standards movement, undermine the authority of the superintendency (Guthrie, 2003).  These factors, according to Guthrie (2003), lead to a shortage in the profession (Guthrie, 2003). </p><p>\tResearch indicates that the average superintendent's tenure is six to seven years (Natkin, et al., 2002), that there is a national shortage of superintendent applicants (Cooper, et al., 2000), and that the quality of the applicant pool is diminishing (Glass, 2001).  This study examines two independent variables, the Standards of Learning (SOL) and the No Child Left Behind Act (NCLB), to determine the effect these variables have on the tenure of school superintendents in Virginia. </p><p>\tThe purpose of this study was to determine if there is a relationship between the increased accountability with state and federal mandates, in particular Standards of Learning (SOLs), No Child Left Behind (NCLB), and other influences on superintendent tenure in the Commonwealth of Virginia.  A survey instrument was utilized to answer the following questions:  (1) What is the relationship, if any, between the Standards of Learning and the superintendent tenure?  (2) What is the relationship, if any, between the No Child Left Behind Act and the tenure of the superintendent? (3) What is the relationship, if any, of other influences on the superintendent tenure? </p><p> \tThe data received from superintendents in Virginia was entered into SPSS and disaggregated by age, gender, race, years of experience as superintendent, number of years as superintendent in current district, enrollment, Adequate Yearly Progress status, and number of schools in respondent's district.  The findings of this study revealed that of the superintendents who responded, 95% believe that the SOLs have had a positive impact on education in Virginia.  Superintendents indicated that the SOLs are not a factor in their tenure as evidenced by 94% of the superintendents who revealed that they have not considered leaving the profession as a result of the SOLs. </p><p>\tThis study also revealed that superintendents in Virginia, 71% responding to the survey, believe that NCLB has not had a positive impact on education in Virginia.  However, NCLB does not factor into superintendents' decisions to leave the profession or retire.  In addition, other influences regarding superintendent tenure were revealed.  This study revealed that local politics, evening responsibilities, pressure by the community to meet accreditation standards are not factors that affect superintendent tenure.  However, superintendents indicated that interactions with the School Board could have an adverse affect on their tenure in the district as evidenced by 96% of the respondents.</p>",
  "description_provenance": [
    "Author Email: jesmit10@vt.edu",
    "Advisor Email: lhixson@hotmail.com",
    "Advisor Email: rsalmon@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:04Z (GMT). No. of bitstreams: 13 05ChapterIII.pdf: 17277 bytes, checksum: adf75ba2b0787b5b16261b487b655875 (MD5) 11AppendixC.pdf: 111171 bytes, checksum: 0269f3e5a711e032cad97d2fd212613d (MD5) 08REFERENCES.pdf: 28910 bytes, checksum: e90a08a30ba45deceb9fcfa0ab64eef7 (MD5) 09AppendixA.pdf: 282625 bytes, checksum: 523cf1867a9fa4f4cd3bf97d7c52dc67 (MD5) 10AppendixB.pdf: 15395 bytes, checksum: 641d5de504b9cd9966c6beab3025468f (MD5) 12AppendixD.pdf: 15743 bytes, checksum: 77ea7b81a4d95f9106ef8e50ec98b640 (MD5) 07CHAPTERV.pdf: 39755 bytes, checksum: 5c338fdf14bf3e017bf3eb6c754c8b8b (MD5) 02AbstractContent.pdf: 32803 bytes, checksum: 32b7c57b3d644264c0b5cb235cb54aca (MD5) 06CHAPTERIV.pdf: 1423145 bytes, checksum: 80cb26cc827ca9d4dd680c6a0f03d52c (MD5) 01DissertationCover.pdf: 9807 bytes, checksum: 8b46b0ad2629f8d42945e1bd35b38abd (MD5) 13AppendixE.pdf: 99851 bytes, checksum: 13e94e8138d2857f6153df9f6d0e40fc (MD5) 03ChapterI.pdf: 66688 bytes, checksum: 8ead3f4ffd69d3a99202f3ae7a34a445 (MD5) 04ChapterII.pdf: 101516 bytes, checksum: 3afc4e0bb6cccc3d62438cba73339d5e (MD5)   Previous issue date: 2005-04-12"
  ],
  "handle": "27001",
  "identifier_other": "etd-04192005-234240",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192005-234240/",
  "identifier_uri": "http://hdl.handle.net/10919/27001",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "05ChapterIII.pdf",
    "11AppendixC.pdf",
    "08REFERENCES.pdf",
    "09AppendixA.pdf",
    "10AppendixB.pdf",
    "12AppendixD.pdf",
    "07CHAPTERV.pdf",
    "02AbstractContent.pdf",
    "06CHAPTERIV.pdf",
    "01DissertationCover.pdf",
    "13AppendixE.pdf",
    "03ChapterI.pdf",
    "04ChapterII.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Responsibilities",
    "Turnover",
    "NCLB",
    "Reform",
    "Accountability",
    "SOL",
    "Duties",
    "Superintendent"
  ],
  "title": "A Look at the Factors That Affect Superintendents Tenure, and Candidate Shortages in Virginia",
  "type": "Dissertation"
}