{
  "contributor_author": "Boyer, Renee Raiden",
  "contributor_committeechair": "Sumner, Susan S.",
  "contributor_committeemember": [
    "Popham, David L.",
    "Pierson, Merle D.",
    "Kniel, Kalmia E.",
    "Williams, Robert C."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:10:04Z",
  "date_adate": "2006-04-26",
  "date_available": "2014-03-14T20:10:04Z",
  "date_issued": "2006-04-07",
  "date_rdate": "2008-04-26",
  "date_sdate": "2006-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Fresh produce is increasingly associated with foodborne outbreaks. In order to develop effective intervention and measures to reduce microbial risks, it is essential to attain a better understand the mechanisms of attachment of foodborne pathogens to fruits and vegetables.  Using lettuce as a model, the attachment of Escherichia coli O157:H7 to produce surfaces was studied.  Strains expressing various extracellular proteins (curli, O157-antigen, and intimin) known to influence attachment of E. coli to intestinal cells were evaluated for their physicochemical properties and ability to adhere to cut edge and whole leaf lettuce.  Escherichia coli O157:H7 strains included: 0018, 43894 and 43895 (curli producing and non-producing); 86-24 (WT), F-12 (O157-antigen negative), pRFBE (O-antigen replaced on plasmid); and 86-24, 86-24Ã eae10 (intimin negative).  The eleven strains were surveyed for their hydrophobicity and cell charge using hydrophobic interaction chromatography (HIC) and electrostatic interaction chromatography (ESIC) techniques.  Iceberg lettuce squares (2 x 2 cm) were inoculated with E. coli O157:H7 strains separately (7.0 log CFU/square) and dried in a laminar flow hood.  Lettuce was sampled before (unrinsed) and after being rinsed twice with sterile de-ionized water (rinsed).  Strips (2 mm wide) of each cut edge of the lettuce were aseptically removed.  Cut-edge and whole-leaf samples were homogenized and spiral plated onto Luria-Bertani agar, supplemented with nalidixic acid (50ppm), to assess levels of bacteria remaining on the lettuce leaf after rinsing.  The rinse steps were not effective in significantly removing bacteria from lettuce (p>0.05). Curli-producing and non-producing strains preferentially attached to cut edge versus the whole leaf portions of lettuce (p<0.05); however the 86-24 strains showed no preference for attachment. With the exception of 0018 curli-producing and non-producing strains, presence/absence of extracellular proteins surveyed did not influence attachment of E. coli O157:H7 to either cut edge or whole leaf lettuce.  There was significantly greater attachment of the curli-producing 0018 strain over the curli non-producing 0018 strain to cut and whole lettuce surfaces (p<0.05). Production of curli and O-polysaccharide significantly increased (p<0.05) the cellâ  s overall hydrophobicity of the cell; however this did not affect attachment (p<0.05).  The overall cell charge of all strains was negative; however, charge did not affect attachment of E. coli O157:H7 to lettuce.  The presence of extracellular appendages (curli, O157-antigen, intimin) as well as hydrophobicity and cell charge properties had no affect on attachment of the cell to lettuce.",
  "description_provenance": [
    "Author Email: rraiden@vt.edu",
    "Advisor Email: sumners@vt.edu",
    "Advisor Email: dpopham@vt.edu",
    "Advisor Email: piersonm@vt.edu",
    "Advisor Email: kniel@udel.edu",
    "Advisor Email: rcwillia@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:04Z (GMT). No. of bitstreams: 1 RevisedReneeBoyerDissertation4.26.06.pdf: 1189423 bytes, checksum: 493eb93e9063cd30c2faf0d40344ce65 (MD5)   Previous issue date: 2006-04-07"
  ],
  "handle": "27003",
  "identifier_other": "etd-04192006-103718",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192006-103718/",
  "identifier_uri": "http://hdl.handle.net/10919/27003",
  "publisher": "Virginia Tech",
  "relation_haspart": "RevisedReneeBoyerDissertation4.26.06.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "curli",
    "cell charge",
    "hydrophobicity",
    "lettuce",
    "adhesion",
    "Escherichia coli O157:H7",
    "attachment",
    "O-polysaccaride",
    "intimin"
  ],
  "title": "Mechanisms Associated with Attachment of Escherichia coli O157:H7 to Lettuce Surfaces",
  "type": "Dissertation"
}