{
  "contributor_author": "Tepanon, Yodmanee",
  "contributor_committeechair": "Uysal, Muzaffer S.",
  "contributor_committeemember": [
    "McCleary, Ken W.",
    "Murrmann, Suzanne K.",
    "Leclerc, Denis",
    "Littlefield, James E."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:10:04Z",
  "date_adate": "2006-04-28",
  "date_available": "2014-03-14T20:10:04Z",
  "date_issued": "2006-04-14",
  "date_rdate": "2007-04-28",
  "date_sdate": "2006-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Sex tourism is one of the world's most controversial industries.  While it generates tremendous revenue to the sex tourism destinations, the industry has been condemned as the two main reasons trafficking of women and children exist.  Despite this, little research has examined the motivation of sex tourists.  The purpose of this study is to develop an understanding of the sex tourism phenomenon and, more specifically, motivation of tourists.  This study is exploratory and qualitative in nature.  Two key propositions are addressed (1) The person's level of perceived modernity relates to the perceived level of personal needs; and (2) The person's level of perceived personal needs relates to the person's desire of travel for sexual participation.</p><p> \tA mixture of qualitative methods was utilized.   The data was collected using semi-structured personal interviews with thirty-three male sex tourists who traveled to Pattaya, Thailand in 2005.  The transcribed data was constantly compared and the interviews revealed four substantial themes with eight subsequent categories. </p><p> \tIt was discovered that sex tourists were pushed by two main motivational drives: physical and psychological needs which came together as personal needs.  Physical needs consisted of \"physical problems\" and \"unmet sexual needs.\"  The psychological problems included \"hedonistic drive\" and \"modernity.\"  The physical gains (tangible attributes) and psychological gains (sense of belonging, freedom and excitement, and power reestablishment) attracted sex tourists to the sex tourism destinations.  Therefore, modernity, one of three constructs in this study, was also supported as an important factor which indirectly affected the motivation of the sex tourists.  </p><p> The last chapter presents the study contribution, implementation, and suggestions for future research.  For knowledge contribution to the academic field, this present study reinforces the reliability of Iso-Ahola's (1982) escaping-seeking motivation model.  It provides both academic and tourism practitioners a better idea of what sex tourist motivational factors are.  The knowledge of sex tourist motivation can assist tourism practitioners at the sex tourism destinations to improve positioning their destinations in the world tourism market.  For the tourism academics, this study offers an exploratory ground for future research to build on both qualitatively and quantitatively in order to form a more rigorous sex tourist motivation model.  </p>",
  "description_provenance": [
    "Author Email: ytepanon@vt.edu, yodmanee@yahoo.com",
    "Made available in DSpace on 2014-03-14T20:10:04Z (GMT). No. of bitstreams: 1 ytepanon_etd.pdf: 1262739 bytes, checksum: 76055fd16ae15c116702ecbe4ef127dc (MD5)   Previous issue date: 2006-04-14"
  ],
  "handle": "27002",
  "identifier_other": "etd-04192006-101020",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192006-101020/",
  "identifier_uri": "http://hdl.handle.net/10919/27002",
  "publisher": "Virginia Tech",
  "relation_haspart": "ytepanon_etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Sex Tourist Motivation",
    "Sex Tourism",
    "Tourist Motivation",
    "Prostitution",
    "Modernity"
  ],
  "title": "Exploring the Minds of Sex Tourists:  The Psychological Motivation of Liminal People",
  "type": "Dissertation"
}