{
  "contributor_author": "Garst, Jr., Winfred Joseph",
  "contributor_committeechair": "Wamsley, Gary L.",
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "Goodsell, Charles T.",
    "Rohr, John A."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:10:06Z",
  "date_adate": "2009-05-06",
  "date_available": "2014-03-14T20:10:06Z",
  "date_issued": "2009-03-26",
  "date_rdate": "2009-05-06",
  "date_sdate": "2009-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The regulation and administration of aviation within this country is greatly influenced by a core set of beliefs concerning the safety of aircraft and their operation.  This core set of beliefs is referred to as the ontology of aviation safety because it is grounded in a particular reference to reality.  The ontology of aviation safety is founded upon the beliefs that aviation operations are either \"safe\" or \"unsafe\", that accidents ore preventable, and that if accidents happen then culpability is attributable.  These core beliefs support and objectified/reified view of safety which represents a particular reality.      Language, more than any other attribute, separates man from other animals.  It is through language that man communicates his most profound feelings and ideas. A very basic premise of this dissertation is that language usage reflects beliefs and values.  The use of the terms \"safe\" and \"unsafe\" when referring to aircraft operations represents the belief that \"safe\" is an attainable state, in other words, it represents an objectified/reified view of aviation safety.  A hermeneutic interpretive approach was used to examine language use within various aviation texts to include: newspaper articles, speeches by Federal Aviation Administration (FAA) officials, testimony by FAA officials before Congress, and selected books concerning aviation safety.      By referring to aviation operations as either \"safe\" or \"unsafe\" in discourse and dialogue, an objectified/reified view of aviation safety is subtly perpetuated.  This view is deeply rooted in the Amierican concept of aviation safety.",
  "description_provenance": [
    "Author Email: wgarst@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: goodsell@vt.edu",
    "Advisor Email: jrohr@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:06Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 764965 bytes, checksum: 964442ffcc663324adccfa36bb2ef5fa (MD5)   Previous issue date: 2009-03-26"
  ],
  "handle": "27018",
  "identifier_other": "etd-04192009-111720",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192009-111720/",
  "identifier_uri": "http://hdl.handle.net/10919/27018",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Aviation Safety",
    "Ontology",
    "Public Administration",
    "Institutionalism"
  ],
  "title": "Mind Games: The Ontology of Aviation Safety and its Consequences",
  "type": "Dissertation"
}