{
  "contributor_author": "McFerren, Mary Margaret",
  "contributor_committeecochair": [
    "Lambur, Michael T.",
    "Stewart, Daisy L."
  ],
  "contributor_committeemember": [
    "Sutphin, Cathy M.",
    "Baker, Susan"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:06Z",
  "date_adate": "2007-04-25",
  "date_available": "2014-03-14T20:10:06Z",
  "date_issued": "2007-04-06",
  "date_rdate": "2008-04-25",
  "date_sdate": "2007-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Mary McFerren's Abstract<br> </title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>The purpose of this study was to explore the incentives and barriers perceived by low-income women of child-bearing age related to their participation in nutrition education programs. The specific programs of concern in this study are the Expanded Food and Nutrition Education Program (EFNEP) and the Food Stamp Nutrition Education (FSNE) program. This qualitative study sought to hear the voices of the women so that nutrition programs can be made more successful in reaching this population. Personal interviews were conducted with 23 women in their homes or appropriate local sites, and transcripts were analyzed to identify categories and themes. </p> <p>People of low socioeconomic status and those with the least education have higher rates of obesity and overweight and suffer disproportionately from poor health. Women receiving Temporary Assistance to Needy Families (TANF) also receive Medicaid. Medicaid costs have escalated due to the obesity rate, which is currently estimated at 64% of the adult population. In addition, 30% of American children are experiencing obesity or are overweight. It is important for parents to understand the causes of obesity and the effects of the chronic diseases related to obesity. Prevention programs are more cost effective than medical treatment of the diseases associated with obesity, and proper nutrition can reduce the incidence of chronic diseases. </p> <p>Findings of this study suggest that isolation is the main impediment to participating in nutrition education programs. Missing from the interviewed women's circumstances are social capital, human capital, and economic capital. Social capital relates to the connections and relationships that are important in life. Human capital involves the knowledge and skills acquired through life experiences. Economic capital refers to individual wealth or economic resources available to an individual or community. </p> <p>Nutrition education programs should be refined to incorporate opportunities for socialization that will develop trust and reciprocity, as well as nutrition knowledge. Based on the results of this study, Virginia Cooperative Extension programs will be adapted to incorporate weight control and cooking classes with nutritious recipes. The learning environment will be safe, learner-centered, and fun. New marketing tools that are more appealing to the prospective clients will be developed. </p> </body> </html>",
  "description_provenance": [
    "Author Email: mmcferre@vt.edu",
    "Advisor Email: lamburmt@vt.edu",
    "Advisor Email: cmsutph@vt.edu",
    "Advisor Email: sbaker@cahs.colostate.edu",
    "Advisor Email: daisys@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:06Z (GMT). No. of bitstreams: 1 Maryetd.pdf: 760732 bytes, checksum: 85fa4731d6f04260cd0bce3907892084 (MD5)   Previous issue date: 2007-04-06"
  ],
  "handle": "27013",
  "identifier_other": "etd-04192007-175746",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192007-175746/",
  "identifier_uri": "http://hdl.handle.net/10919/27013",
  "publisher": "Virginia Tech",
  "relation_haspart": "Maryetd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Food Stamps",
    "Food Stamp Nutrition Education Program (FSNE)",
    "Expanded Food and Nutrition Education Program (EFN",
    "Temporary Assistance to Needy Families (TANF)",
    "Smart Choices Nutrition Education Program (SCNEP)",
    "Social Capital",
    "Human Capital"
  ],
  "title": "Incentives and Barriers to Participation in Community Nutrition Education Programs for Recipients of Food Stamps and Temporary Assistance to Needy Families",
  "type": "Dissertation"
}