{
  "contributor_author": "Huang, Tao",
  "contributor_committeecochair": [
    "Schubert, Robert P.",
    "Jones, James R."
  ],
  "contributor_committeemember": [
    "Kemnitzer, Ronald B.",
    "Kilper, Dennis J.",
    "Fowler, Shelli B."
  ],
  "contributor_department": "Architecture and Design Research",
  "date_accessioned": "2014-03-14T20:10:06Z",
  "date_adate": "2007-05-01",
  "date_available": "2014-03-14T20:10:06Z",
  "date_issued": "2007-04-09",
  "date_rdate": "2010-05-01",
  "date_sdate": "2007-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Industrial Design in China seldom addresses the issue of sustainability in mass production.  Failure to incorporate sustainable design as a core principle will result in long term environmental and economic loss for both business and society.  This research studies the current Industrial Design educational system in Mainland China and proposes a new educational framework to engage sustainability as a design objective.   This study adopts the philosophical perspectives of constructivism, sustainable design theory, critical pedagogy, and systems thinking.  Literature related to sustainability is collected and organized and overlaid with educational constraints identified through the interviews with educators, students, and practitioners of Industrial Design in four major cities of Mainland China.  Using the grounded theory approach, from these two sources a new educational framework is proposed.  The educational framework categorizes courses in a four year undergraduate Industrial Design educational program into four domains: ecological literacy, artistic, technological, and professional.  Suggestions for the appropriate timeline, content, and pedagogical approaches for curriculum are also provided.  The proposed framework was then critically reviewed Chinese educators that served as feedback for the final proposition.",
  "description_provenance": [
    "Author Email: taohuang@vt.edu",
    "Advisor Email: rkemnitz@vt.edu",
    "Advisor Email: dekilper@vt.edu",
    "Advisor Email: silver@vt.edu",
    "Advisor Email: sbfowler@vt.edu",
    "Advisor Email: jajone10@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:06Z (GMT). No. of bitstreams: 1 ETD_Tao.pdf: 2665617 bytes, checksum: abd947c13fb8877333d0925194668da3 (MD5)   Previous issue date: 2007-04-09"
  ],
  "handle": "27012",
  "identifier_other": "etd-04192007-155145",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192007-155145/",
  "identifier_uri": "http://hdl.handle.net/10919/27012",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD_Tao.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Grounded theory method",
    "Interviews",
    "Curriculum building",
    "Constructivist pedagogy",
    "Design education"
  ],
  "title": "Reforming Industrial Design Education in Mainland China for Sustainability",
  "type": "Dissertation"
}