{
  "contributor_author": "Shields, Sammy Lee",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Craig, James R.",
    "Bourdeaux, Robert M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:05Z",
  "date_adate": "2007-05-01",
  "date_available": "2014-03-14T20:10:05Z",
  "date_issued": "2007-04-05",
  "date_rdate": "2007-05-01",
  "date_sdate": "2007-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title> Sammy Shields Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>The purposes of this study were to (1) identify the variables affecting peer coaching, (2) the characteristics of peer coaching, and (3) to determine the outcomes of peer coaching. Participants were interviewed individually, face-to-face to gain insight into peer coaching. The interview questions were developed around the three domains in the conceptual framework: variables affecting peer coaching, the characteristics of peer coaching, and the outcomes of peer coaching. </p> <p>This study was conducted in one school division in the Commonwealth of Virginia . Two schools within the school division were randomly selected by the superintendent of schools for participation. Twelve teachers and the principals of these two schools participated in the study. Data were gathered using a teacher questionnaire, a principal questionnaire, and face-to-face interviews with the teachers. The constant comparative method was used to analyze the interview data. </p> <p>The variables found to affect peer coaching were: (a) trust, (b) commitment, (c) administrative support, (d) environment (non-threatening), (e) time (constraints), and (f) teacher attributes. The characteristics of peer coaching were: (a) user friendliness, (b) instructive training, (c) the centrality of observation, and (d) conferencing. The outcomes of peer coaching were: (a) creates support networks, (b) impacts instructional and classroom management practices, and (c) confirms instructional and classroom management practices. These findings may be helpful to school administrators and teachers who are interested in learning about peer coaching and how peer coaching can serve as an ongoing staff development intervention to bring about changes in teachers' instructional and classroom management practices. <strong></strong></p> </body> </html>",
  "description_provenance": [
    "Author Email: sshields@mail.dps.k12.va.us",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: jimcraig@vt.edu",
    "Advisor Email: RMBourdeaux@lancaster.k12.pa.us",
    "Advisor Email: parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:05Z (GMT). No. of bitstreams: 2 ShieldsETD041907.pdf: 297356 bytes, checksum: aa2e89ee724fefc30c600346f1ab45a3 (MD5) ShieldsIRBApprovalLetter.pdf: 53237 bytes, checksum: c62a5a3c6e9b2b7a189e6a003e21c634 (MD5)   Previous issue date: 2007-04-05"
  ],
  "handle": "27010",
  "identifier_other": "etd-04192007-112237",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192007-112237/",
  "identifier_uri": "http://hdl.handle.net/10919/27010",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ShieldsETD041907.pdf",
    "ShieldsIRBApprovalLetter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Staff Development",
    "Peer Coaching",
    "Collegial Interaction",
    "Collaboration"
  ],
  "title": "A Cross-Case Analysis of Peer Coaching in Two Elementary Schools",
  "type": "Dissertation"
}