{
  "contributor_author": "Pronin, Alexey",
  "contributor_committeechair": "Takeuchi, Tatsu",
  "contributor_committeemember": [
    "Minic, Djordje",
    "Mizutani, Tetsuro",
    "Pitt, Mark L."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:10:06Z",
  "date_adate": "2008-05-08",
  "date_available": "2014-03-14T20:10:06Z",
  "date_issued": "2008-04-09",
  "date_rdate": "2008-05-08",
  "date_sdate": "2008-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this thesis we consider  a number of past, present, and future neutrino experiments designed to test physics beyond the Standard Model. First, we analyze potential new physics explanations of the NuTeV anomaly and check their compatibility with the most recent experimental data. The models we consider are: gauged Lmu-Ltau, gauged B-3Lmu, and S1, S3, V1, V3 leptoquarks. We find that only the triplet leptoquark models can explain NuTeV and be compatible with the data from other experiments at the same time, and only if the components of the triplet have different masses. Then, we analyze the prospects of discovery of heavy Majorana neutrinos (neutrissimos) suggested by the Okamura model at the LHC. We find that these particles, if produced, will live short enough to decay inside of the detector, while long enough to lead to a narrow peak in the invariant mass spectrum of the decay products. We estimate the typical masses of the neutrissimos to be in the TeV range. However, studies exist that have shown that if their masses are larger than about 150 GeV then the production cross-section is too small to lead to an observable event rate. Thus, we conclude that it will not be possible to detect the neutrissimo at the LHC unless its mass is smaller that about 150 GeV which corresponds to a very small region close to the edge of the parameter space of the Okamura model. Nevertheless, we argue that the signature of the neutrissimo may be detectable in other neutrino experiments which may be carried out in the future. As examples, we consider the NuSOnG experiment, which is a fixed target neutrino scattering experiment proposed at Fermilab, and a hypothetical long-baseline neutrino oscillation experiment in which the Fermilab NUMI beam is aimed at the Hyper-Kamiokande detector in Japan. In addition to the sensitivity to neutrissimos, we analyze the capabilities of these experiments to constraint the coupling constants and masses of new particles in various models of new physics suggested in the literature. The models we consider are: neutrissimo models, models with generation distinguishing Z's such as topcolor assisted technicolor, models containing various types of leptoquarks, R-parity violating SUSY, and extended Higgs sector models. In several cases, we find that the limits thus obtained could be competitive with those expected from direct searches at the LHC. In the event that any of the particles discussed here are discovered at the LHC, then the observation, or non-observation, of these particles in the NuSOnG and Fermilab-to-Hyper-Kamiokande experiments could help in identifying what type of particle had been observed.",
  "description_provenance": [
    "Author Email: apronin@vt.edu",
    "Advisor Email: dminic@vt.edu",
    "Advisor Email: mizutani@vt.edu",
    "Advisor Email: takeuchi@vt.edu",
    "Advisor Email: pitt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:06Z (GMT). No. of bitstreams: 1 Alexey_Pronin_Thesis.pdf: 22795011 bytes, checksum: a92bee50a345014625a6c0bdb8fd8bd4 (MD5)   Previous issue date: 2008-04-09"
  ],
  "handle": "27017",
  "identifier_other": "etd-04192008-233814",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192008-233814/",
  "identifier_uri": "http://hdl.handle.net/10919/27017",
  "publisher": "Virginia Tech",
  "relation_haspart": "Alexey_Pronin_Thesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "High Energy Physics",
    "Elementary Particles",
    "Neutrino",
    "Physics beyond the Standard Model"
  ],
  "title": "Constraints on New Physics from Various Neutrino Experiments",
  "type": "Dissertation"
}