{
  "contributor_author": "Hughes, Laura Elizabeth",
  "contributor_committeecochair": [
    "Babski-Reeves, Kari L.",
    "Nussbaum, Maury A."
  ],
  "contributor_committeemember": [
    "Kleiner, Brian M.",
    "Smith-Jackson, Tonya L."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:10:06Z",
  "date_adate": "2007-04-23",
  "date_available": "2014-03-14T20:10:06Z",
  "date_issued": "2007-04-11",
  "date_rdate": "2007-04-23",
  "date_sdate": "2007-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Despite high prevalence rates of work-related musculoskeletal disorders (WMSDs), the causes and pathways of WMSD development are not fully understood. Multiple factors (physical, psychosocial, and individual) have been associated with WMSD development, but causal inferences are not available due to lack of experimental designs. Because the responses, validity, and reliability of measured outcomes under multiple-exposure environments are not known, the current work analyzed the effects of multiple WMSD risk factors on several measurement methods.   Forty-eight participants completed four trials of simulated manufacturing work at different levels of physical and psychosocial exposure for one psychosocial dimension (job control, job demands, time pressure, or social support). The three independent variables significantly affected outcomes, including muscle activity, heart rate, task performance, discomfort and workload ratings, and psychosocial environment perceptions. Social interaction should take priority over working in isolation, and pressure to achieve high performance should be minimized to reduce WMSD risk.  A secondary data analysis determined measurements that could estimate WMSD risk efficiently. Convergent and discriminant validity was assessed to retain methods that provided unique information and minimized overlap between similar methods. For the given manufacturing environment, one muscle activity measure, heart rate mean and variability, one set of workload and discomfort ratings, and a psychosocial questionnaire were the best WMSD risk measurement methods.   The third study assessed the test-retest reliability of the outcome measures of an additional trial involving 24 participants. Workload and discomfort appeared reliable under high levels of physical exposure but not under psychosocial manipulations. Physiological measures were reliable for <50% of parameters. The psychosocial questionnaire was reliable under favorable social support but not high physical exposure and favorable job control.   The final study determined the number of psychosocial factors experienced through factor analysis on psychosocial questionnaire responses from the main experiment. Participants could distinguish psychosocial dimensions in the work environment, and this questionnaire may be used in experimental settings to measure perceptions of the psychosocial environment.  The current research provided a basis for measuring physical and psychosocial exposure simultaneously in occupational settings. Using this knowledge may allow practitioners to focus on interventions and designs that reduce WMSD risk exposure.",
  "description_provenance": [
    "Author Email: lahughes@vt.edu",
    "Advisor Email: kari@ise.msstate.edu",
    "Advisor Email: nussbaum@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: smithjac@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:06Z (GMT). No. of bitstreams: 1 HughesLE_dissertation.pdf: 1322400 bytes, checksum: 3e995dcf92cbaa662e7326de89cefd21 (MD5)   Previous issue date: 2007-04-11"
  ],
  "handle": "27015",
  "identifier_other": "etd-04192007-215311",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192007-215311/",
  "identifier_uri": "http://hdl.handle.net/10919/27015",
  "publisher": "Virginia Tech",
  "relation_haspart": "HughesLE_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "perceived discomfort",
    "physiological measures",
    "workload",
    "reliability",
    "WMSD risk factors",
    "psychosocial factors"
  ],
  "title": "The Influence of Multiple Risk Factors on WMSD Risk and Evaluation of Measurement Methods Used to Assess Risks",
  "type": "Dissertation"
}