{
  "contributor_author": "Woods, Donna E.",
  "contributor_committeechair": "Creighton, Theodore B.",
  "contributor_committeemember": [
    "Tripp, Norman Wayne",
    "Magliaro, Susan G.",
    "Craig, James E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:06Z",
  "date_adate": "2007-05-01",
  "date_available": "2014-03-14T20:10:06Z",
  "date_issued": "2007-04-05",
  "date_rdate": "2007-05-01",
  "date_sdate": "2007-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to investigate the effects on reading achievement for middle school students after participation in a computer-based reading intervention program, READ 180, as well as the relationship of program participation to later dropout rates, compared to students enrolled in a traditional reading remediation program. A nonequivalent control group research design was used to examine data collected from 384 students in Grades 6 through 8 participating in reading interventions spanning a 3-year period from 2003 through 2006. Independent samples t test and chi-square statistics were used to analyze data to determine the yearly reading achievement mean gains, differences between the effects of the two reading interventions, and later dropout frequencies. There were no significant differences between the treatment and comparison groups in reading scores during the first year of READ 180 implementation. Computer software problems affected the implementation of READ 180 during the first semester of implementation. The findings reveal a statistically significant difference between the effects on reading achievement scores for students who participated in READ 180 when implemented with moderate fidelity compared to students in a traditional reading remediation program during the 2nd and 3rd years of implementation. The findings in this study revealed that an intensive reading intervention, READ 180, can significantly improve reading achievement for struggling adolescent readers when implemented with moderate fidelity. Analyses of the data revealed differences between the number of 2003-2004 reading intervention participants and the school division cohort dropout rates. A significant difference was not observed between the 2004-2006 cohort dropout rates when compared to the school division rates. The findings in this study will be beneficial to secondary principals who are held accountable for literacy development, implementation, and evaluation as the school instructional leader.",
  "description_provenance": [
    "Author Email: dwoods1@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: jcraig44@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:06Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 1252283 bytes, checksum: 6b98e95c70278a2c434b4712e17d312a (MD5)   Previous issue date: 2007-04-05"
  ],
  "handle": "27016",
  "identifier_other": "etd-04192007-222847",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192007-222847/",
  "identifier_uri": "http://hdl.handle.net/10919/27016",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "struggling adolescent reader",
    "dropout rates",
    "reading interventions"
  ],
  "title": "An Investigation of the Effects of a Middle School Reading Intervention on School Dropout Rates",
  "type": "Dissertation"
}