{
  "contributor_author": "Petrie, Linda Lou Harrison",
  "contributor_committeechair": "Gillespie, Diane Newkirk",
  "contributor_committeemember": [
    "Asselin, Susan B.",
    "Romano, Lewis D.",
    "Fortune, Jimmie C.",
    "Curcio, Claire Cole Vaught"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:07Z",
  "date_adate": "1999-04-23",
  "date_available": "2014-03-14T20:10:07Z",
  "date_issued": "1998-12-15",
  "date_rdate": "2000-04-23",
  "date_sdate": "1999-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Abstract  \tThis post hoc study examines the reasons attributed to graduating from or dropping out of a rural high school in southwestern Virginia by four white males identified as learning disabled. Through participant interviews supported by archival data and essential informant interviews, a picture emerges of an ongoing process in which interactions with adults play critical roles. All four participants described psychosocial events, which led to a chain of events in which adults played decisive roles. It is within these chains of events that decisions were made either with the participant or for the participant by an adult. Two of the participants graduated from and two dropped out of high school.  Each participant of this study describes himself as an individual with unique characteristics, relationships, and responses to psychosocial events. The psychosocial events and the resulting chain of events as described by the participants, could not have been anticipated. The participants' interactions with adults in regards to the psychosocial events could not have been scripted. Finally, the participants' interpretation of the adult interactions and the participants' resulting responses could not have been foreseen. Additionally, the participants in this study did not perceive the interactions as the adults perceived them.  Previous researchers have designed studies to examine dropout data for the purposes of generalization, early identification and predictions. Future researchers may want to approach the dropout dilemma from each student's perspective.",
  "description_provenance": [
    "Author Email: lpetrie@swva.net",
    "Advisor Email: dgilles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:07Z (GMT). No. of bitstreams: 1 fulldoc2.pdf: 398598 bytes, checksum: fc2614e4b2a12bc0602134980b2afcf6 (MD5)   Previous issue date: 1998-12-15"
  ],
  "handle": "27023",
  "identifier_other": "etd-041999-154100",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041999-154100/",
  "identifier_uri": "http://hdl.handle.net/10919/27023",
  "publisher": "Virginia Tech",
  "relation_haspart": "fulldoc2.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "high school",
    "dropout",
    "rural",
    "learning disabilities"
  ],
  "title": "In Their Own Words: Individuals with Learning Disabilities, Dropping Out and Graduating From A Rural High School",
  "type": "Dissertation"
}