{
  "contributor_author": "Lee, Kichol",
  "contributor_committeechair": "Casali, John G.",
  "contributor_committeemember": [
    "Smith-Jackson, Tonya L.",
    "Winchester, Woodrow W. III",
    "Gauger, Dan",
    "Keady, John"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:10:07Z",
  "date_adate": "2011-05-02",
  "date_available": "2014-03-14T20:10:07Z",
  "date_issued": "2011-01-21",
  "date_rdate": "2011-05-02",
  "date_sdate": "2011-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Occlusion effects result from amplification of low frequency components of body- transmitted sound when the ear canal is occluded with hearing protection devices, hearing aids, or other canal-sealing inserts. Since the occlusion effect will enhance the hearing of bodily- generated sounds and result in distorted perception of oneâ  s own voice, many people report annoyance with hearing aids and hearing protectors that produce occlusion effects. Previous research has studied the effects of ear device insertion depth and influence of the location of the bone vibrator, which has typically been used as the excitation stimulus. However, the effects of monaural vs. binaural, ear device material, and different excitation stimuli were not investigated. In this research study, the effect of left/right ear canal on the occlusion effect, which was measured objectively as the sound pressure level difference in dB, was investigated. Also, an experiment to determine the effect of earplug types (differing in material and design), insertion depth, and excitation sources was conducted. Lastly, the noise attenuation capability of medical balloon-based earplugs was tested. Ten subjects, six male and four female, volunteered for the three separate experiments. They were subjected to the three earplug types (foam earplugs, premolded flanged earplugs, and medical balloon-based earplugs), two earplug insertion depth levels of shallow and deep (only feasible with the foam earplug and the balloon-based earplug), and two levels of excitation sources, one of which was a forehead-mounted bone vibrator and the other a self vocal utterance of â  EEâ   to 65 decibels A-weighted (dBA). The attenuation capability of the medical balloon- based earplugs were tested via monaural Real-Ear-Attenuation-at-Threshold (REAT) test per ANSI S3.19-1974 and compared to that of a Peltor H10A earmuff. Experimental results of the first experiment demonstrated that left right ear canal SPL measurements were not statistically different, and therefore subsequent measurements of occlusion effects for the second experiment were conducted via a monaural left ear measurement protocol. The results of the second experiment confirmed significant effects of insertion depth on the occlusion effect. At the shallow insertion, the occlusion effects, on average, were greater by 11.2 dB(linear) (dBZ) then the deep insertion measured at 500 Hz. The effects of earplug type were mixed. At the shallow insertion, earplug type did not influence the occlusion effect. However, the mean occlusion effect, measured at the 1/3-octave band centered at 500 Hz, of deeply inserted balloon-based earplugs was larger than that of foam earplugs by 3.7 dBZ. Excitation sources that were used as the sound energy stimuli to elicit occlusion effects did not show statistically significant differences. The Noise Reduction Rating (NRR), as calculated per ANSI S3.19-1974, of the medical balloon-based earplug was 10 dB while that of a Peltor H10A earmuff was 24 dB. Although the medical balloon-based earplug did not prove to be a high attenuation-hearing protector, it produced a unique flat attenuation across the frequency spectrum, as compared to the typical increasing-with-frequency attenuation, pointing to its potential utility for applications wherein the pitch perception of sound is important.",
  "description_provenance": [
    "Author Email: kichol@vt.edu",
    "Advisor Email: jcasali@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: wwwinche@vt.edu",
    "Advisor Email: Dan_Gauger@bose.com",
    "Advisor Email: drjpk22@hotmail.com",
    "Made available in DSpace on 2014-03-14T20:10:07Z (GMT). No. of bitstreams: 2 Lee_K_D_2011.pdf: 3482546 bytes, checksum: 420afdacc048bbc2493de0e98c3478ed (MD5) Lee_K_D_2011_Copyright.pdf: 699458 bytes, checksum: 9a22a0adf0133bb86fc5d7f0bf5f2c88 (MD5)   Previous issue date: 2011-01-21"
  ],
  "handle": "27021",
  "identifier_other": "etd-04192011-143941",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192011-143941/",
  "identifier_uri": "http://hdl.handle.net/10919/27021",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Lee_K_D_2011.pdf",
    "Lee_K_D_2011_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "occlusion effect",
    "hearing aid",
    "balloon plug"
  ],
  "title": "Effects of Earplug Material, Insertion Depth, and Measurement Technique on Hearing Occlusion Effect",
  "type": "Dissertation"
}