{
  "contributor_author": "Giles, Inez Marie",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Cookson, Peter S.",
    "Fagan, Ruthann",
    "Lichtman, Marilyn V.",
    "Stubblefield, Harold W."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:08Z",
  "date_adate": "1999-04-24",
  "date_available": "2014-03-14T20:10:08Z",
  "date_issued": "1999-03-03",
  "date_rdate": "2000-04-24",
  "date_sdate": "1999-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Three questions guided this research study: a) Is Goal Accomplishment Style, as measured by Atman's Goal Orientation Index (GOI), related to persistence and dropout in an online, computer-conferenced class? b) Is there a relationship between other selected variables (Demographic, Personal, Institutional, and Participative) and student persistence or dropout in the online, computer-conferenced environment? And, c) Can a relationship between goal accomplishment style and the other selected student variables be identified and related to persistence and dropout in an online computer-conferenced class?  The data sources for this study were students registered in twenty online, computer-conferenced courses at a mid-sized university specializing in delivering courses, both in the traditional face-to-face mode and at a distance, to working adults.   Using logistic regression, this study investigated the relationship among twenty-five selected independent variables in an attempt to better understand the variables and their influence on the dichotomous dependent variable, persistence/dropout in the online classroom.  The independent variables were culled from traditional classroom dropout research and adapted for use in the online environment. In addition, variables specific to the online environment were developed.  The purpose of the logistic regression was to identify the most parsimonious set of variables predicting student persistence and dropout.    At the end of the semester, qualitative interviews were conducted with six dropout students.  The interviews were conducted in an attempt to add depth to the depth provided by the quantitative results.  During the interviews the students were asked specifically about their perceptions of interactivity and collaboration in the online classroom.  Using both qualitative and quantitative analyses, a more complete picture of why students participate in or dropout of online, computer-conferenced classes was developed.  Three variables were identified as significant predictors of persistence/dropout, predicting persistence correctly between 98 to 100 percent of the cases.  These variables included whether or not a student would recommend another online class, whether or not the student submitted assignments in a timely manner, and Acting, one of the three categories of Atman's Goal Orientation Index.  Dropouts, however, proved to be more difficult to predict. (The models predictive strength regarding dropouts ranged from only to 0% to 45%.)  The qualitative interviews identified the fact that the dropout students were really hybrid in that they appeared as dropouts on the institution's master list but who were persisters in other classes.  Four of the six \"dropout\" students interviewed were taking two courses during the semester.  During the interviews, the students said they found it difficult to balance the requirements of family, home, work and school while taking two classes, especially during the shortened summer semester.     Almost all (95 per cent) of the study participants indicated they would be taking online courses in the future.  Enrollments in online courses at the institution are increasing dramatically. Institutions must begin to examine the true nature and definition of dropouts, especially with respect to adult working students in the online environment.",
  "description_provenance": [
    "Author Email: igiles@polaris.umuc.edu",
    "Advisor Email: Marcie@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:08Z (GMT). No. of bitstreams: 22 chap_5.pdf: 45467 bytes, checksum: 92c3f7ee48a3e9063411c9c69bb64815 (MD5) appdx_f.pdf: 4559 bytes, checksum: 8f934ac02fdb9d8bdb5f5f7d95baad53 (MD5) chap_4.pdf: 60839 bytes, checksum: f1c3b777ab36cf91dbda9f6f2cff7769 (MD5) chap_3.pdf: 38693 bytes, checksum: ae8ee3bd8e6124e818956e494b29f996 (MD5) appdx_i.pdf: 12163 bytes, checksum: 675e841d4e0656277e502580ea9a0065 (MD5) appdx_c.pdf: 3763 bytes, checksum: 65c462710170deedbcef8713b708970c (MD5) acknowledgment.pdf: 5024 bytes, checksum: 95e50a63173426eb61304d4dfeacb6bc (MD5) appdx_k.pdf: 4872 bytes, checksum: 98622278632eb62f4ba3c1f5ff31a6ef (MD5) appdx_b.pdf: 5616 bytes, checksum: c2f87aab53989532cb14d65ee7684c25 (MD5) chap_2.pdf: 62785 bytes, checksum: 6f732ce4434eec6612d76df19dea352b (MD5) appdx_d.pdf: 4624 bytes, checksum: 62343d9a42a3ea57124563b6e554e827 (MD5) chap_1.pdf: 38401 bytes, checksum: d7a4f8666ab5add679e6c1ac09b4754c (MD5) appdx_e.pdf: 7392 bytes, checksum: 5c0a2b0cbfe82456c88f1d3cf77162c7 (MD5) abstract.pdf: 6089 bytes, checksum: 985a88aa6f33f24b77ded187b0a384a9 (MD5) toc.pdf: 6969 bytes, checksum: c5beb205acb8f9b00fb87f8e1f2c6eca (MD5) appdx_g.pdf: 5218 bytes, checksum: 5f718eb5ec37a8f32f4317ef2fe9bb1a (MD5) bib.pdf: 33664 bytes, checksum: 336dbc3207ae66b61be91d11894c27b6 (MD5) appdx_j.pdf: 5282 bytes, checksum: ea4a3c24018d5ad8b108b3a3196c2ad8 (MD5) appdx_h.pdf: 4098 bytes, checksum: a7fa7afd01e9bee2e62e70073936f665 (MD5) title.pdf: 3877 bytes, checksum: 005678a85a5d3fb8d9ef75216f5eff03 (MD5) resume.pdf: 15306 bytes, checksum: a1ae6de7f8e0f6aca815f86083d4ced5 (MD5) appdx_a.pdf: 44389 bytes, checksum: d0c947d68b12649877c19eb39cbd10a3 (MD5)   Previous issue date: 1999-03-03"
  ],
  "handle": "27026",
  "identifier_other": "etd-041999-174015",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041999-174015/",
  "identifier_uri": "http://hdl.handle.net/10919/27026",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chap_5.pdf",
    "appdx_f.pdf",
    "chap_4.pdf",
    "chap_3.pdf",
    "appdx_i.pdf",
    "appdx_c.pdf",
    "acknowledgment.pdf",
    "appdx_k.pdf",
    "appdx_b.pdf",
    "chap_2.pdf",
    "appdx_d.pdf",
    "chap_1.pdf",
    "appdx_e.pdf",
    "abstract.pdf",
    "toc.pdf",
    "appdx_g.pdf",
    "bib.pdf",
    "appdx_j.pdf",
    "appdx_h.pdf",
    "title.pdf",
    "resume.pdf",
    "appdx_a.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "computer conferenced",
    "online classroom",
    "distance education"
  ],
  "title": "An Examination of Dropout in the Online, Computer-conferenced Classroom",
  "type": "Dissertation"
}