{
  "contributor_author": "ter Maat, Mercedes Ballbe",
  "contributor_committeechair": "Madison-Colmore, Octavia D.",
  "contributor_committeemember": [
    "Curcio, Claire Cole Vaught",
    "Lichtman, Marilyn V.",
    "Stith, Sandra M.",
    "Rosal, Marcia"
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:10:08Z",
  "date_adate": "2000-04-20",
  "date_available": "2014-03-14T20:10:08Z",
  "date_issued": "2000-04-12",
  "date_rdate": "2001-04-20",
  "date_sdate": "2000-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The American School Counselor Association (ASCA) recommends a shift from traditional to comprehensive, developmental counseling programs focusing on prevention programs to assist the â  wholeâ   child (e.g., meeting social, emotional, academic, and career needs). This shift has been slow and inconsistent, bringing great variability to the role of school counselor. This study investigates the current functions of school counselors in Northern Virginia. Five research questions are posed: (1) How do counselors spend their time? (2) In what way do counselors want to change their allocation of time to various counseling activities? (3) How do school counselors feel about their preparation to perform various counseling activities? (4) What factors (work setting, gender, level of education, teaching experience, counseling experience, student-to-counselor ratio, desire to change time allocation, and level of preparation) affect how counselors allocate their time? (5) Do differences exist between school counselorsâ   allocation of time to various counseling activities and the mandate of the Virginia Department of Education? Seventy-three Northern Virginia school counselors (45% response rate) responded to a survey on activities in the four major categories recommended by ASCA (counseling, consulting, guidance, and coordination) and in administrative/support services. Participants also were asked to fill-out a one-day log describing their typical counseling functions on any chosen workday. Results indicated that, on an average, Northern Virginia school counselors feel well prepared to conduct counseling activities and allocate 46% of their time to counseling, 17% to consultation, 12% to guidance, 7% to coordination, and 18% to administrative/support services. Counselors desire to spend more time working with students individually and in small groups, and less time in test coordination and administrative tasks. Statistical analyses (p< .05) indicate that allocation of time was significantly affected by work setting, gender, desire to change present time allocation, and level of preparation. These results suggest that Northern Virginia school counselors in this study are performing the functions recommended by the American School Counselor Association and by the Virginia Department of Education. Implications for future research are explored.",
  "description_provenance": [
    "Author Email: mtermaat@erols.com",
    "Advisor Email: omadison@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:08Z (GMT). No. of bitstreams: 3 PartIII.PDF: 86559 bytes, checksum: 4f3fc748327436662bbbe75affabbd9a (MD5) PartII.PDF: 234252 bytes, checksum: f3ddb19cee05e8e5d31d2deb79cc4b89 (MD5) PartI.PDF: 14964 bytes, checksum: ef1cd310ac6b394394a0d4f9bfe7fa0f (MD5)   Previous issue date: 2000-04-12"
  ],
  "handle": "27028",
  "identifier_other": "etd-04202000-10070058",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202000-10070058/",
  "identifier_uri": "http://hdl.handle.net/10919/27028",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "PartIII.PDF",
    "PartII.PDF",
    "PartI.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "School Counseling",
    "Functions",
    "Time Allocation",
    "Northern Virginia"
  ],
  "title": "The Functions of School Counselors in  Northern Virginia Public Schools",
  "type": "Dissertation"
}