{
  "contributor_author": "Akers, Julia B.",
  "contributor_committeecochair": [
    "Kelly, Patricia Proudfoot",
    "Hoerner, James L."
  ],
  "contributor_committeemember": [
    "Welford, John M.",
    "Harris, Larry A.",
    "Niles, Jerome A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:07Z",
  "date_adate": "1999-04-21",
  "date_available": "2014-03-14T20:10:07Z",
  "date_issued": "1999-04-05",
  "date_rdate": "2000-04-21",
  "date_sdate": "1999-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to describe the implementation of contextual learning practices in a biology class. Research contends that contextual learning classrooms are active learning environments where students are involved in â  hands-onâ   team projects and the teacher assumes a facilitator role. In this student-centered classroom, students take ownership and responsibility for their own learning. This study examined these assertions and other factors that emerged as the study developed. The research methods used were qualitative.  The subject for this study was a biology teacher with twenty-six years of experience who implemented contextual learning practices in two of her biology classes in the 1997-98 school year. As the teacher confronted contextual learning, we engaged in collaborative research that included fourteen interviews transcribed verbatim for analysis, classroom observations and the teacherâ  s written reports.  Throughout the study, factors developed that adversely affected contextual learning practices. These factors were discipline, curriculum, and administrative decisions over which the teacher had no control. These are examined along with their consequences for implementing a contextual classroom.  Successful practices that worked in the teacherâ  s classroom were also determined and included the teacherâ  s â  failure is not an optionâ   policy, mandatory tutoring, behavior contracts, high expectations and teamed projects. Besides contextual learning, a key component of the study was the collaborative research process and its meaning to the subject, the researcher and future researchers who attempt this collaborative approach.  The studyâ  s conclusion indicate that scheduling, multiple repeaters, discipline and the state Standards of Learning moved the teacher away from contextual learning practices to a more teacher-directed classroom. Two recommendations of this study are that further research is needed to study how the state Standards of Learning have affected instructional practices and the effect of administrative decisions that influence the level of teacher success in the classroom.",
  "description_provenance": [
    "Author Email: juakers@VT.EDU",
    "Advisor Email: kellyp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:07Z (GMT). No. of bitstreams: 3 JAFINAL.PDF: 205564 bytes, checksum: d5e3689137cc8807a2c7e23da31a6df8 (MD5) Aktitle.pdf: 2119 bytes, checksum: 141cf1531d8178e41cfc3d074f9109a8 (MD5) Akabstra.pdf: 3395 bytes, checksum: 34761cd71472246cfb8082a1355ca5c6 (MD5)   Previous issue date: 1999-04-05"
  ],
  "handle": "27024",
  "identifier_other": "etd-041999-163152",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041999-163152/",
  "identifier_uri": "http://hdl.handle.net/10919/27024",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "JAFINAL.PDF",
    "Aktitle.pdf",
    "Akabstra.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Discipline",
    "State Standards of Learning",
    "Collaborative research",
    "Teacher role",
    "Active learning"
  ],
  "title": "Confronting the Realities of Implementing Contextual Learning Ideas in a Biology Classroom",
  "type": "Dissertation"
}