{
  "contributor_author": "Miller, William David",
  "contributor_committeecochair": [
    "Moore, David Michael",
    "Burton, John K."
  ],
  "contributor_committeemember": [
    "Sanders, Mark E.",
    "Doolittle, Peter E."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:07Z",
  "date_adate": "2010-06-07",
  "date_available": "2014-03-14T20:10:07Z",
  "date_issued": "2010-04-14",
  "date_rdate": "2010-06-07",
  "date_sdate": "2010-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this descriptive case study was to identify the strategies used by post-secondary military institutions to adopt, implement and train faculty for the use of new instructional technologies in the learning environment.  Termed the Innovation Migration Process, it includes: 1) the adoption decision (selection of the innovation), 2) strategies for implementation and, 3) how faculty are trained on its use.   The study was a two phased, explanatory, mixed-methods design beginning with a quantitative survey, followed by twelve qualitative interviews conducted at two exemplary institutions. The study identified two strategies are used to adopt new technology:  1) authoritative decisions from the â  top-downâ   and 2) a bottom-up strategy where new technology is first used by innovators who work with a central organization to adopt the change.  Five strategies were identified to implement the innovation: 1) centralized training; 2) leadership commitment; 3) tapping expertise; 4) well defined support for pedagogy and technical issues; and 5) a robust infrastructure.  Four strategies were found for training faculty: 1) tapping expertise (indicating training and implementation are interwoven); 2) formal training; and 4) dedicated training time.  The fourth strategy, incentives and rewards, was used successfully by one of the two exemplary institutions, but few of the other institutions offered either of these for training. Suggested guidelines for post-secondary, military institutions include: create a culture of innovativeness; demonstrated commitment by the leadership; follow Elyâ  s Eight Conditions for Implementation; develop a centralized training organization; develop a robust technical support organization; invest in the infrastructure; seek out and support innovators; use a formal faculty development program.",
  "description_provenance": [
    "Author Email: dmiller3@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: sanders@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:07Z (GMT). No. of bitstreams: 1 Miller_WD_2010_F1_Title_Dissertation_Appendices.pdf: 800496 bytes, checksum: 2e1cb5686dcb08efb6fc56cdb6f20dee (MD5)   Previous issue date: 2010-04-14"
  ],
  "handle": "27020",
  "identifier_other": "etd-04192010-161738",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04192010-161738/",
  "identifier_uri": "http://hdl.handle.net/10919/27020",
  "publisher": "Virginia Tech",
  "relation_haspart": "Miller_WD_2010_F1_Title_Dissertation_Appendices.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "innovation-decision process",
    "faculty development",
    "diffusion of innovation",
    "higher education",
    "instructional technology",
    "adoption of innovation"
  ],
  "title": "A descriptive study of the process post-secondary military institutions use to adopt, implement and train for use of new instructional technologies",
  "type": "Dissertation"
}