{
  "contributor_author": "Waskiewicz, Stanley Peter",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Parson, Stephen R.",
    "Carlier, Paul R.",
    "DeVault, Joseph A.",
    "Hutchinson, Susan R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:07Z",
  "date_adate": "1999-04-20",
  "date_available": "2014-03-14T20:10:07Z",
  "date_issued": "1999-02-08",
  "date_rdate": "2000-04-20",
  "date_sdate": "1999-04-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "VARIABLES THAT CONTRIBUTE TO JOB SATISFACTION IN SECONDARY SCHOOL ASSISTANT PRINCIPALS by Stanley P. Waskiewicz David J. Parks, Committee Chairman Educational Leadership and Policy Studies (ABSTRACT) The purpose of this study was to identify variables that explain the job satisfaction of assistant principals of secondary schools. If such variables are identified, efforts can be made to eliminate or reduce the effects of those variables which lead to dissatisfaction and enhance those which lead to satisfaction. The participants were 291 respondents to a survey distributed to a systemic sample of 400 assistant principals who were members of the National Association of Secondary School Principals in 1996. Participants completed the short form of the Minnesota Satisfaction Questionnaire and a questionnaire developed by the researcher. Participants' job satisfaction had three measures: extrinsic, intrinsic, and general job satisfaction. The variables believed to explain job satisfaction of assistant principals (age, opportunity for advancement, career aspirations, compensation, feelings of compensation fairness, supervisor relations, andâ ¢iii ability utilization) were analyzed through path analysis to determine the effects of the independent variables on the three measures of job satisfaction. Results revealed that assistant principals are only marginally satisfied with their jobs. Assistant principals are not as interested in advancing their careers as reported in prior studies. Assistant principals also feel that their responsibilities are extending beyond the routine maintenance of discipline and attendance programs. Examination of the data revealed that the hypothesized models did not fit the data. Of the variables theorized to explain job satisfaction, age, compensation, and opportunity for advancement were found to have no significant effect on intrinsic, extrinsic, or general job satisfaction. However, supervisor relations was found to have a significant effect on all three measures, as did ability utilization. The other variables in the models either did not have significant effects on the three measures of job satisfaction or were too small to be considered important. Relationships between the independent variables were also examined and reported. None of the hypothesized indirect path effects were large enough to be considered important. After reviewing the results, the only conclusion that can be drawn is that the models did not capture accurate relationships among the variables.â ¢However, supervisor relations and ability utilization were found to be moderately related to extrinsic, intrinsic, and general job satisfaction.",
  "description_provenance": [
    "Author Email: StanPW@kimbanet.com",
    "Advisor Email: Parson@vt.edu",
    "Advisor Email: pwcarlson@vt.edu",
    "Advisor Email: Parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:07Z (GMT). No. of bitstreams: 1 Waskiewicz.final.pdf: 383165 bytes, checksum: 74e899631f7d576cd5c735c1d626b30e (MD5)   Previous issue date: 1999-02-08"
  ],
  "handle": "27022",
  "identifier_other": "etd-041999-142711",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-041999-142711/",
  "identifier_uri": "http://hdl.handle.net/10919/27022",
  "publisher": "Virginia Tech",
  "relation_haspart": "Waskiewicz.final.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Assistant Principals",
    "Job Satisfaction",
    "Secondary School"
  ],
  "subject_lcc": "LD5655.V856 1999.W375",
  "title": "Variables That Contribute to Job Satisfaction in Secondary School Assistant Principals",
  "type": "Dissertation"
}