{
  "contributor_author": "Smith, James Carroll",
  "contributor_committeechair": "Kelly, Patricia Proudfoot",
  "contributor_committeemember": [
    "Simmons, Sarah",
    "Niles, Jerome A.",
    "Parson, Stephen R.",
    "Harris, Larry A."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:10:08Z",
  "date_adate": "2000-04-20",
  "date_available": "2014-03-14T20:10:08Z",
  "date_issued": "2000-04-12",
  "date_rdate": "2001-04-20",
  "date_sdate": "2000-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "ABSTRACT  This study has two goals.  One is to begin to explicate the educational theories and practices of Charlotte Mason and the other is to determine whether or not her educational theories and practices are still useful in a 21st Century American School.  The first goal is addressed in six essays that discuss major educational tenets of Masonâ  s educational philosophy.  The second goal is studied through a case study on The Childrenâ  s Community School.   \tThe six essays based on major tenets of Masonâ  s educational theories and practices begin with the principle, â  children are born persons,â   which permeates all of her beliefs about teaching and learning.  â  Children are born personsâ   means that children change from within and not from without and, therefore, are discoverers of knowledge not vessels to be filled.  Rousseau believed that children come with a good nature, but Mason contended that they come with a nature that is both good and evil, as all humans.  Therefore children need to be educated to attenuate the evil nature.  That is the second tenet.  The third tenet is a discussion of authority and docility.  If children have a good and evil nature then authority is necessary.  However, since children are persons, they have a right to an education and they have a right to self-authority.  The fourth essay discusses Masonâ  s beliefs about the sacredness of a childâ  s personality.  In the fifth essay on pedagogy the discussion is concentrated on Masonâ  s use of narration as an instructional tool.  The last essay is on curriculum and includes a discussion of Masonâ  s views on curriculum and the use of the narrative in the curriculum.  All of the essays bring to the discussion the thinking of other educational thinkers both past and present.   \tAt the end of each essay is the story of the implementation of Masonâ  s educational theories and practices at The Childrenâ  s Community School.  The data collection for this case study is defined by Masonâ  s educational principles  discussed in each essay.  Data were collected on site at the school through observations, interviews and documents.  All interviews were transcribed.  Data from transcriptions, observations, and documents were then coded by the six major tenets discussed in the essays.   Connections were examined between the theory of Mason and the practice in The Childrenâ  s Community School.",
  "description_provenance": [
    "Author Email: jcarrollsmith@aol.com",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: simmons@roanoke.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: lharris@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:08Z (GMT). No. of bitstreams: 1 jcsmithfinaldissertation.pdf: 1242489 bytes, checksum: b255f2e4b46919050aa7ab55768842e8 (MD5)   Previous issue date: 2000-04-12"
  ],
  "handle": "27029",
  "identifier_other": "etd-04202000-10510011",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202000-10510011/",
  "identifier_uri": "http://hdl.handle.net/10919/27029",
  "publisher": "Virginia Tech",
  "relation_haspart": "jcsmithfinaldissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "narrative",
    "narration",
    "charlotte mason",
    "nature of children",
    "personality in children"
  ],
  "title": "Charlotte Mason:  An Introductory Analysis of Her Educational Theories and Practices",
  "type": "Dissertation"
}