{
  "contributor_author": "Rawlings-Milton, Mary",
  "contributor_committeechair": "Wolf, James F.",
  "contributor_committeemember": [
    "Goodsell, Charles T.",
    "Miller, Michael L.",
    "Rohr, John A.",
    "Dickey, John W."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:10:09Z",
  "date_adate": "2000-05-05",
  "date_available": "2014-03-14T20:10:09Z",
  "date_issued": "2000-04-07",
  "date_rdate": "2001-05-05",
  "date_sdate": "2000-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ELECTRONIC RECORDS & THE LAW: CAUSING THE FEDERAL RECORDS PROGRAM TO IMPLODE? (Abstract) Administrative programs that govern the day-to-day-management of agencies are founded in law and the federal records management program is no exception.  This dissertation explores whether the existing legal framework accommodates the changes occurring in the federal records management program as a result of electronic records and whether the solutions proposed by the University of British Columbia and University of Pittsburgh are viable for the federal records officer.  These two universities pioneered the research being done on electronic recordkeeping.  <p> The record requirement established under the Federal Records Act is very difficult for agencies to maintain when it comes to electronic records.  At the same time, agencies are being pressured to do more work electronically.  Most federal records officers are not equipped to meet the dual challenge of maintaining accessibility while also ensuring the records remain authentic.  The two approaches for dealing with electronic records, UBC's Diplomatics as implemented with the Department of Defense standard and Pittsburgh's literary warrants, are too complex and difficult.  Even if the records managers implemented either of these approaches, they require too much effort on behalf of the record creator for the implementations to be successful.  The National Archives can provide advice and guidance to agencies on electronic recordkeeping requirements.  However, the success of the records management program depends on the federal agencies because it is a decentralized administrative process.  The ability of federal agencies to cope with electronic records is problematic.  Therefore, the viability of the federal records management program is problematic.",
  "description_provenance": [
    "Author Email: mrawling@vt.edu, hmrm@erols.com",
    "Advisor Email: goodsell@vt.edu",
    "Advisor Email: michael.miller@arch2.nara.gov",
    "Advisor Email: jrohr@vt.edu",
    "Advisor Email: jdickey@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:09Z (GMT). No. of bitstreams: 1 Erecs.pdf: 651435 bytes, checksum: 263ab5e04bc0b6b9e09ccf58f5ba9201 (MD5)   Previous issue date: 2000-04-07"
  ],
  "handle": "27031",
  "identifier_other": "etd-04202000-13400008",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202000-13400008/",
  "identifier_uri": "http://hdl.handle.net/10919/27031",
  "publisher": "Virginia Tech",
  "relation_haspart": "Erecs.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "National Archives",
    "Federal records",
    "Electronic records"
  ],
  "title": "Electronic records & The Law: Causing the Federal Records Program to Implode?",
  "type": "Dissertation"
}