{
  "contributor_author": "Alexander, Deanna Wimmer",
  "contributor_committeechair": "Bailey, Carol A.",
  "contributor_committeemember": [
    "Fuhrman, Ellsworth R.",
    "Shoemaker, Donald J.",
    "Dudley, Charles J.",
    "Bryant, Clifton D."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:10:10Z",
  "date_adate": "2001-04-26",
  "date_available": "2014-03-14T20:10:10Z",
  "date_issued": "2001-01-26",
  "date_rdate": "2004-04-26",
  "date_sdate": "2001-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Once upon a time in the remote northern panhandle of Idaho, in the early 1990s, occurred a series of events that would lead to the deaths of three individuals, a beloved pet, and the overt acts of lawlessness and terrorism of three federal law enfocement agencies against United States' citizens.  Thus, I introduce the story of Ruby Ridge, Idaho, the Weaver family, and the federal law enforcement agencies that have collectivity become known as the infamous \"dress rehearsal for Waco...\" (Kopel and Blackman, 1997:32).  Since this is a constructivist analysis of events surrounding Ruby Ridge, I specifically focus on how reality is constructed through the process of reification.  In this research endeavor, I utilize an elaboration of Aho's (1994) steps of reality construction (naming, legitimation, mythmaking, sedimentation, and ritualism) in the understanding of how the situation of Ruby Ridge was constructed.  I have integrated these five stages into the chronological events of Ruby Ridge and illustrate how the situation was constructed to be real and how the consequences of crisis management employed by federal law enforcement agencies evolved into reactive state terrorism.  In other words, I answer the question-\"How could this happen?\"",
  "description_provenance": [
    "Author Email: dalex@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:10Z (GMT). No. of bitstreams: 1 deanna.pdf: 279531 bytes, checksum: 57febda1e118ba445be58477ffbdfecf (MD5)   Previous issue date: 2001-01-26"
  ],
  "handle": "27039",
  "identifier_other": "etd-04202001-163258",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202001-163258/",
  "identifier_uri": "http://hdl.handle.net/10919/27039",
  "publisher": "Virginia Tech",
  "relation_haspart": "deanna.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "political crime",
    "federal law enforcement agencies"
  ],
  "title": "How Could This Happen? A Constructivist Analysis of Reactive State Terrorism at Ruby Ridge",
  "type": "Dissertation"
}