{
  "contributor_author": "Martin, Darrin T.",
  "contributor_committeecochair": [
    "Parson, Stephen R.",
    "Dawson, Christina M."
  ],
  "contributor_committeemember": [
    "Smith, Barbara S.",
    "Oliveira, Anthony J.",
    "Crockett, Jean B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:09Z",
  "date_adate": "2000-04-27",
  "date_available": "2014-03-14T20:10:09Z",
  "date_issued": "2000-03-10",
  "date_rdate": "2012-10-17",
  "date_sdate": "2000-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>The purpose of this study was to determine the levels of concern of central office instructional administrators, building level principals, and teachers in Superintendents' Region Seven as they implement Virginias' Standards of Learning initiative. The Stages of Concern (SOC) Questionnaire and demographic sheet were mailed to a sample of 405 instructional personnel of Superintendents' Region Seven in Virginia; 231 responded. The data were analyzed using descriptive statistics and multivariate analysis of variance procedures at the a=. 05 level of significance.   <p>Results revealed that central office instructional administrators (N=31), elementary principals (N=31), secondary principals (N=32), and elementary (N=33) and secondary teachers (N=33) not responsible for administering SOL Tests possessed profiles indicative of nonusers. The concerns for these groups were typically highest on stages 0, 1, and 2 and lowest on stages 4, 5, and 6. When the data were analyzed for elementary (N=30), and secondary teachers (N=41) responsible for administering SOL Tests, the findings identified these groups as possessing similar concerns. These groups were highest in stages 3, 6, and 2, respectively.   <p>A series of ANOVAs and Scheffes' post hoc analyses at the .05 level were conducted to analyze the data according to the group position/user or nonuser in relation to the seven stages of concern. When the participants were grouped according to position/grade level in relation to the seven stages of concern, an analysis of variance and Scheffes' post hoc were conducted to determine if the groups were significantly different at the .05 level.   <p>How practitioners feel about and perceive change will in large part determine whether or not change actually occurs in schools. The amount and scope of educational change needed to successfully implement the Standards of Learning is evident. It is believed the results of this study will provide reformers with an assessment of the various perceptions educators in Superintendents' Region Seven have regarding the implementation of the Standards of Learning. The implications and recommendations could aid reformers as they continue to implement the Standards of Learning and as they implement future initiatives.",
  "description_provenance": [
    "Author Email: damarti5@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: tdawson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:09Z (GMT). No. of bitstreams: 2 dmartinabstract.pdf: 5647 bytes, checksum: a48325e5ccc234c70decd2006db979d9 (MD5) Dissertation.pdf: 339624 bytes, checksum: e7b6d8a933706d5e1b230769554d667c (MD5)   Previous issue date: 2000-03-10"
  ],
  "handle": "27036",
  "identifier_other": "etd-04202000-20570031",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202000-20570031/",
  "identifier_uri": "http://hdl.handle.net/10919/27036",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "dmartinabstract.pdf",
    "Dissertation.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Change Process",
    "Standards of Learning",
    "Stages of Concern",
    "Standards Movement",
    "Educational Reform"
  ],
  "title": "The Change Process: Stages of Concern of the Standards of Learning in Superintendents' Region Seven in Virginia",
  "type": "Dissertation"
}