{
  "contributor_author": "Groover, Gordon Eugene",
  "contributor_committeecochair": [
    "Pease, James W.",
    "Taylor, Daniel B."
  ],
  "contributor_committeemember": [
    "McGilliard, Michael L.",
    "Bosch, Darrell J.",
    "Polan, Carl E.",
    "Kohl, David M.",
    "McKenna, James R."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:10:10Z",
  "date_adate": "2001-04-20",
  "date_available": "2014-03-14T20:10:10Z",
  "date_issued": "2001-04-02",
  "date_rdate": "2002-04-20",
  "date_sdate": "2001-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Virginia dairy producers are considering intensive grazing as a profitable and ecologically viable alternative to confinement dairy production. The objective of this study is to compare financial performance for pasture-based dairy farms relative to similar resourced-based confinement farms.  Comparisons are based on the recommended financial and profitability measures of performance provided by the Farm Financial Standards Council.   Primary and secondary data plus simulation of daily pasture supply and animal demands are used to develop 100 and 200-cow farms with a land base representative of the Ridge and Valley regions of Virginia.  Representative farms were developed to explore financial performance based on the intensity of pasture use, from total confinement to seasonal farms using intensive grazing (in which pasture, hay, and energy supplements are the only sources of nutrients for all dairy animals on the farm).    Results of the analysis demonstrate that pasture-based seasonal production is more profitable and has a higher level of repayment capacity and financial efficiency than all other production systems in this study.  Greater financial performance by the seasonal farms is obtained even though such farms obtain lower average annual milk prices and 10 percent less milk sold per cow than the similar confinement farms.  Pasture-based farms that feed a partial total mixed ration during the summer (25 percent of ration dry matter and 45 percent of ration dry matter from pasture) have fewer financial advantages than the seasonal farms. However, their performance exceeds that of the confinement farms and intensive pasture-based farms milking year round.  The intensive pasture-based farms milking year round are the poorest financial performers.  Additional conclusions for this study are: 1) the 100-cow farms exhibit insufficient financial performance to provide for family living, debt service (at 40 percent debt to equity ratio), and a cushion for events such as droughts or declines in milk prices; and 2) financial performance of the 200-cow dairies is better, yet the added income from a member of the farm having off-farm income will provide a cushion against unforeseen production and financial risks.    Follow up research should address the interface of three issues; stocking rates, farm profitability, and environmental compliance.",
  "description_provenance": [
    "Author Email: xgrover@vt.edu",
    "Advisor Email: mcg@vt.edu",
    "Advisor Email: bosch@vt.edu",
    "Advisor Email: cpolan@vt.edu",
    "Advisor Email: sullylab@vt.edu",
    "Advisor Email: peasej@vt.edu",
    "Advisor Email: jamckenn@vt.edu",
    "Advisor Email: taylord@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:10Z (GMT). No. of bitstreams: 1 GEG.pdf: 2144355 bytes, checksum: e4cfea8bbdb5a533c3166808bd54e0d0 (MD5)   Previous issue date: 2001-04-02"
  ],
  "handle": "27038",
  "identifier_other": "etd-04202001-075511",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202001-075511/",
  "identifier_uri": "http://hdl.handle.net/10919/27038",
  "publisher": "Virginia Tech",
  "relation_haspart": "GEG.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "pasture-based dairy production",
    "seasonal dairy production",
    "dairy",
    "PLMS",
    "FINPACK",
    "intensive grazing",
    "financial performance",
    "simulation"
  ],
  "title": "Financial Performance of Pasture-Based Dairies: A Virginia Case Study",
  "type": "Dissertation"
}