{
  "contributor_author": "West, Gladys B.",
  "contributor_committeechair": "Wolf, James F.",
  "contributor_committeemember": [
    "Goodsell, Charles T.",
    "Gooden, Susan T.",
    "Dudley, Larkin S.",
    "Colvard, James E."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:10:09Z",
  "date_adate": "2000-05-01",
  "date_available": "2014-03-14T20:10:09Z",
  "date_issued": "2000-04-18",
  "date_rdate": "2001-05-01",
  "date_sdate": "2000-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Research on the effects of downsizing has focused on several levels including the global, organization, and the individual.  However, this research, at the individual level, focused specifically on the effects of downsizing on the survivors of the organization.  Downsizing refers to activities undertaken by management to improve the efficiency, productivity, and competitiveness of the organization by reducing the workforce size.  Many researchers explain the types of response we can expect from survivors of a corporate downsizing.  The possible attitudes and behaviors due to downsizing are of particular interest to managers, because managers will inevitably face a workforce at least partially staffed with survivors of downsizing activities. <p>The purpose of this research is to give a better understanding of the effects of downsizing on survivors.  This is accomplished by  systematically analyzing and combining the findings of independent studies through meta-analysis.  This research investigates the variables and variable relationships which represent effects of downsizing on the survivors.  The individual downsizing studies are the sources of the variables used to measure behaviors and attitudes prevalent among downsizing survivors. <p>\tThe results of this research give a summary of the cumulated correlations for sixteen(16) variable relationships specifying the strength, direction, and the range of the correlations.  These findings enable the manager to preview, in a combined sense, a certain set of downsizing survivor responses.  These results support the findings reported in the independent studies and by other downsizing researchers.   The studies that did not qualify for use in the meta-analysis cumulation procedures are analyzed, through the meta-analysis vote count method, and show that the majority of the survivors had experienced negative downsizing effects.  Included also is an analysis of the small sample of studies done in the public versus those done in the non-public sectors that shows no real differences, due possibly to the small sample size.  <p>\tThis research, through the use of meta-analysis, confirms the findings of the independent studies and gives more statistical reliability and confidence to the findings.",
  "description_provenance": [
    "Author Email: igwest@crosslink.net",
    "Advisor Email: goodsell@vt.edu",
    "Advisor Email: goodens@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: jcolvard@crosslink.net",
    "Advisor Email: jfwolf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:09Z (GMT). No. of bitstreams: 1 new-etd.pdf: 669862 bytes, checksum: a0e833a9ad0f2d7583bf8e67fac90456 (MD5)   Previous issue date: 2000-04-18"
  ],
  "handle": "27032",
  "identifier_other": "etd-04202000-14520000",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202000-14520000/",
  "identifier_uri": "http://hdl.handle.net/10919/27032",
  "publisher": "Virginia Tech",
  "relation_haspart": "new-etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Meta-Analysis",
    "Survivors",
    "Management",
    "Downsizing",
    "Organization"
  ],
  "title": "The Effects of Downsizing on Survivors: a Meta-Analysis",
  "type": "Dissertation"
}