{
  "contributor_author": "White, Jr., Thomas Gordon",
  "contributor_committeechair": "Wolf, James F.",
  "contributor_committeemember": [
    "Launius, Roger D.",
    "Goodsell, Charles T.",
    "Rees, Joseph V.",
    "Wamsley, Gary L."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:10:10Z",
  "date_adate": "2000-05-01",
  "date_available": "2014-03-14T20:10:10Z",
  "date_issued": "2000-04-17",
  "date_rdate": "2001-05-01",
  "date_sdate": "2000-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigates how the establishment of blame becomes a framework for sensemaking in a national policy subsystem.  Using the only two fatal accidents in NASAâ  s manned space flight history as case studies, this dissertation examines how the space policy subsystem responded to these two accidents and the process by which culpability was established.  This dissertation extends our knowledge of how the blame dynamic operates within a policy subsystem and how, through this assignment of blame, the policy subsystem and the nation makes sense of these tragic events.   Three distinct literatures (i.e. policy subsystems, sensemaking, and blame) are brought together to describe this complex blame environment.   <p> The conclusions of this research are that the membership of the space policy subsystems increases following a disaster; the locus of the blame attribution rhetoric rests with Congress and the media, which are members of the space policy subsystem; those who were blamed for the Apollo 1 and Challenger disasters were from both NASA and the contractor;  and their culpability was publicized.  The space policy subsystem assigns the blame to its members and the process of blaming becomes the framework by which the Nation makes sense of the disaster.",
  "description_provenance": [
    "Author Email: tgwhite@aol.com",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: goodsell@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:10Z (GMT). No. of bitstreams: 2 Dissertation_twhite.pdf: 1320303 bytes, checksum: 9405d48d91056f3bfc26d3e54418b3e7 (MD5) Vita.pdf: 4140 bytes, checksum: 3e22391fdcd6240a95c74b8f086c2ff2 (MD5)   Previous issue date: 2000-04-17"
  ],
  "handle": "27037",
  "identifier_other": "etd-04202000-22140028",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202000-22140028/",
  "identifier_uri": "http://hdl.handle.net/10919/27037",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation_twhite.pdf",
    "Vita.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "blameworthiness",
    "policy subsystem",
    "sensemaking"
  ],
  "title": "The Establishment of Blame As A Framework for Sensemaking in the Space Policy Subsystem: A Study of the Apollo 1 and Challenger Accidents",
  "type": "Dissertation"
}