{
  "contributor_author": "Tinelli, Archie",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Wiswell, Albert W.",
    "McKeen, Ronald L.",
    "Morris, Linda E.",
    "Lichtman, Marilyn V."
  ],
  "contributor_department": "Adult and Continuing Education",
  "date_accessioned": "2014-03-14T20:10:09Z",
  "date_adate": "2000-04-24",
  "date_available": "2014-03-14T20:10:09Z",
  "date_issued": "2001-03-01",
  "date_rdate": "2001-04-24",
  "date_sdate": "2000-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Archie Tinelli \t\t\t  (Abstract) This study sought to better understand the learning of leaders who undertake the task of organizational transformation. <p> This inquiry, designed as a qualitative case study of two leaders and informed by a constructivist-interpretivist paradigm, was guided by the following research question: When leaders undertake the task of organizational transformation, what can be discovered about what they learn and the process of how they learn?  <p> The leaders learned about themselves and about how to transform their organizations.  The leaders confirmed knowledge they already had about themselves (what motivates them) and they developed new understanding of themselves (their leadership style).  In addition, they developed new strategies and tactics for transforming their organizations (for example, ways to deal with troublesome staff members). <p> The study also found that the leaders operated from a work-oriented mental model that dominated their thinking.  The leaders' learning was embedded in and inextricably linked to their work; it was accidental, incidental, and tacit.  <p> The leaders' learning was heavily influenced by four factors: organizational context, the use of intuition to generate options and solutions, the use of daily prayer by both leaders (an unexpected finding), and consultation with a network of professional colleagues.  <p> The data were collected throughout one year in which the leaders, who served as co-researchers, were observed six full days each (distributed across the year) and interviewed more than eight hours each.  Interviews were also conducted with several staff members from each leader's organization.  <p> The data were analyzed during several iterative stages that included the researcher working independently as well as collaborating with each of the two leaders.  Further, one long-time colleague of each leader from outside each of the organizations provided an additional perspective on the data.  \t<p> This study also demonstrates the complex, rich, and dynamic nature of qualitative research by distinctively portraying the data, its analysis, and the research experience.  Parallel (side-by-side) columns simultaneously present descriptions of the research experience and the analysis of the data.  In addition, there are two sets of internal links encouraging the reader to alternate between the research experience and the analysis (in Chapter Four) and between the research method (in Chapter Three) and the researcher's reflections (in the Appendices).  <p> Practitioners and scholars may want to examine further the extent to which the factors identified in this study (the leaders' mental model, organizational context, prayer, intuition, and consultation with colleagues) influence leaders transforming organizations.",
  "description_provenance": [
    "Author Email: coraggio@aol.com",
    "Advisor Email: marcie@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:09Z (GMT). No. of bitstreams: 1 ATtry4.pdf: 809689 bytes, checksum: 4de509f31890804ec7234f61fdeac8e0 (MD5)   Previous issue date: 2001-03-01"
  ],
  "handle": "27035",
  "identifier_other": "etd-04202000-19240020",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202000-19240020/",
  "identifier_uri": "http://hdl.handle.net/10919/27035",
  "publisher": "Virginia Tech",
  "relation_haspart": "ATtry4.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Organizational Transformation",
    "Learning",
    "Leaders"
  ],
  "title": "Leaders and their learnings: What and how leaders learn as they transform organizations",
  "type": "Dissertation"
}