{
  "contributor_author": "Kang, Youn-Soo",
  "contributor_committeechair": "Rakha, Hesham Ahmed",
  "contributor_committeemember": [
    "Lin, Wei-hua",
    "Dion, Francois",
    "Collura, John",
    "Trani, Antoino A."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:10:09Z",
  "date_adate": "2000-04-24",
  "date_available": "2014-03-14T20:10:09Z",
  "date_issued": "2000-04-12",
  "date_rdate": "2001-04-24",
  "date_sdate": "2000-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "With the introduction of different forms of adaptive and actuated signal control, there is a need for effective evaluation tools that can capture the intricacies of real-life applications.  While the current state-of-the-art analytical procedures provide simple approaches for estimating delay, queue length and stops at signalized intersections, they are limited in scope.  Alternatively, several microscopic simulation softwares are currently available for the evaluation of signalized intersections.  The objective of this dissertation is fourfold.  First, it evaluates the consistency, accuracy, limitations and scope of the alternative analytical models.  Second, it evaluates the validity of micro simulation results that evolve as an outcome of the car-following relationships.  The validity of these models is demonstrated for idealized hypothetical examples where analytical solutions can be derived.  Third, the dissertation expands the scope of current analytical models for the evaluation of oversaturated signalized intersections.  Finally, the dissertation demonstrates the implications of using analytical models for the evaluation of real-life network and traffic configurations.  This dissertation compared the delay estimates from numerous models for an undersaturated and oversaturated signalized intersection considering uniform and random arrivals in an attempt to systematically evaluate and demonstrate the assumptions and limitations of different delay estimation approaches.  Specifically, the dissertation compared a theoretical vertical queuing analysis model, the queue-based models used in the 1994 and 2000 versions of the Highway Capacity Manual, the queue-based model in the 1995 Canadian Capacity Guide for Signalized Intersections, a theoretical horizontal queuing model derived from shock wave analysis, and the delay estimates produced by the INTEGRATION microscopic traffic simulation software.  The results of the comparisons for uniform arrivals indicated that all delay models produced identical results under such traffic conditions, except for the estimates produced by the INTEGRATION software, which tended to estimate slightly higher delays than the other approaches.  For the random arrivals, the results of the comparisons indicated that the delay estimates obtained by a micro-simulation model like INTEGRATION were consistent with the delay estimates computed by the analytical approaches. <p> In addition, this dissertation compared the number of stops and the maximum extent of queue estimates using analytical procedures and the INTEGRATION simulation model for both undersaturated and oversaturated signalized intersections to assess their consistency and to analyze their applicability.  For the number of stops estimates, it is found that there is a general agreement between the INTEGRATION microscopic simulation model and the analytical models for undersaturated signalized intersections.  Both uniform and random arrivals demonstrated consistency between the INTEGRATION model and the analytical procedures; however, at a v/c ratio of 1.0 the analytical models underestimate the number of stops.  The research developed an upper limit and a proposed model for estimating the number of vehicle stops for oversaturated conditions.  It was demonstrated that the current state-of-the-practice analytical models can provide stop estimates that far exceed the upper bound.  On the other hand, the INTEGRATION model was found to be consistent with the upper bound and demonstrated that the number of stops converge to 2.3 as the v/c ratio tends to 2.0.  For the maximum extent of queue estimates, the estimated maximum extent of queue predicted from horizontal shock wave analysis was higher than the predictions from vertical deterministic queuing analysis.  The horizontal shock wave model predicted lower maximum extent of queue than the CCG 1995 model.  For oversaturated conditions, the vertical deterministic queuing model underestimated the maximum queue length.  It was found that the CCG 1995 predictions were lower than those from the horizontal shock wave model.  These differences were attributed to the fact that the CCG 1995 model estimates the remaining residual queue at the end of evaluation time.  A consistency was found between the INTEGRATION model and the horizontal shock wave model predictions with respect to the maximum extent of queue for both undersaturated and oversaturated signalized intersections.  <p> Finally, the dissertation analyzed the impact of mixed traffic condition on the vehicle delay, person delay, and number of vehicle stops at a signalized intersection.  The analysis considered approximating the mixed flow for equivalent homogeneous flows using two potential conversion factors.  The first of these conversion factors was based on relative vehicle lengths while the second was based on relative vehicle riderships.  The main conclusion of the analysis was that the optimum vehicle equivalency was dependent on the background level of congestion, the transit vehicle demand, and the Measure of Effectiveness (MOE) being considered.  Consequently, explicit simulation of mixed flow is required in order to capture the unique vehicle interactions that result from mixed flow.  Furthermore, while homogeneous flow approximations might be effective for some demand levels, these approximations are not consistently effective.",
  "description_provenance": [
    "Author Email: ykang@vt.edu",
    "Advisor Email: whlin@vt.edu",
    "Advisor Email: fdion@ctr.vt.edu",
    "Advisor Email: collura@vt.edu",
    "Advisor Email: rakha@ctr.vt.edu",
    "Advisor Email: vuela@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:09Z (GMT). No. of bitstreams: 12 VITA.pdf: 37299 bytes, checksum: 71dd91994ba36818842d8c059053a600 (MD5) Chapter02.pdf: 348179 bytes, checksum: 939e7733c8b2552faa71b2d78c6cd33e (MD5) Chapter08.pdf: 59038 bytes, checksum: c9ca866efe8e9a24602db90ce63380b6 (MD5) Chapter10_Appen.pdf: 2046121 bytes, checksum: 101d87088606c9c7d8a6b8344d852b1a (MD5) Chapter09_Ref.pdf: 116851 bytes, checksum: 60a089cf4b9c2f36be41415b9e73c32f (MD5) Chapter06.pdf: 438051 bytes, checksum: 6424c69d41c27fa6cab2ba23a977267b (MD5) Chapter03.pdf: 79780 bytes, checksum: 8e72145361f1f42d3aa8f5aef0dda24c (MD5) Chapter00.pdf: 162703 bytes, checksum: 2b3d356984291d578bed7a1e1407e59a (MD5) Chapter05.pdf: 519332 bytes, checksum: cf159e849bdc615a91f01f2bd85a4986 (MD5) Chapter07.pdf: 287620 bytes, checksum: 6f4b44c7a64cb0df7b0a083665b00753 (MD5) Chapter04.pdf: 347025 bytes, checksum: 53b62f505d37051669e61297077d6d51 (MD5) Chapter01.pdf: 80030 bytes, checksum: f655dec15d7a97c22f7f594ed14aaa22 (MD5)   Previous issue date: 2000-04-12"
  ],
  "handle": "27030",
  "identifier_other": "etd-04202000-12070029",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202000-12070029/",
  "identifier_uri": "http://hdl.handle.net/10919/27030",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "VITA.pdf",
    "Chapter02.pdf",
    "Chapter08.pdf",
    "Chapter10_Appen.pdf",
    "Chapter09_Ref.pdf",
    "Chapter06.pdf",
    "Chapter03.pdf",
    "Chapter00.pdf",
    "Chapter05.pdf",
    "Chapter07.pdf",
    "Chapter04.pdf",
    "Chapter01.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "CCG",
    "HCM",
    "Delay Models",
    "Queue",
    "ITS",
    "INTEGRATION",
    "ATMS",
    "Stochastic",
    "Shock Wave",
    "Deterministic",
    "Signalized Intersection"
  ],
  "title": "Delay, Stop and Queue Estimation for  Uniform and Random Traffic Arrivals  at Fixed-Time Signalized Intersections",
  "type": "Dissertation"
}