{
  "contributor_author": "Trull, Cheryl",
  "contributor_committeechair": "Doolittle, Peter E.",
  "contributor_committeemember": [
    "Van Dyke, Ray E.",
    "Stallings, Martha Ann",
    "Nichols, William D.",
    "Abraham, Jane L.",
    "Hicks, David"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:11Z",
  "date_adate": "2004-04-21",
  "date_available": "2014-03-14T20:10:11Z",
  "date_issued": "2004-04-05",
  "date_rdate": "2007-04-21",
  "date_sdate": "2004-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Cheryl Trull Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>Teacher absenteeism, retirement, and attrition have led to a widespread shortage of substitute teachers throughout the United States , resulting in the hiring of individuals who lack teacher certification and educational pedagogy. In the past decade, West Virginia joined many other states confronted with the decreased substitute teacher pool and the hiring of non-certified individuals in the classrooms. </p> <p>With the <em>highly qualified teacher </em>requirements of the No Child Left Behind Act of 2001 (NCLB), focus was situated on the adequate qualifications of substitute teachers. Many substitute teachers do not have the educational pedagogy or teacher certification necessary to be considered <em>highly qualified </em> by the NCLB. Mandatory training for non-certified substitute teachers lacking proper certification and educational pedagogy became the focus to <em>qualify </em> these individuals for the classroom. This study focuses on the self-efficacy of non-certified individuals attending the substitute teacher training in the Regional Education Service Agencies (RESAs) in the state of West Virginia to determine if their self-efficacy beliefs change after two days of mandatory substitute training or after classroom experience. </p> <p>The Teacher's Sense of Efficacy Scale (TSES) developed by Tschannen-Moran and Woolfolk-Hoy (2001) was the instrument used to measure the self-efficacy of non-certified substitute teachers. Findings indicate that the teaching self-efficacy of non-certified substitute teachers significantly increased from pre-training to post-training, but significantly decreased from post-training to post-teaching experiences. Additionally, findings revealed that age and gender did not have a significant influence on self-efficacy from pre-training, to post-training, to post-teaching. Finally, applications and ramifications of these results are then discussed. </p> <br> </body> </html>",
  "description_provenance": [
    "Author Email: ctrull@concord.edu",
    "Advisor Email: rvandyke@mail.mcps.org",
    "Advisor Email: mastallings@mail.mcps.org",
    "Advisor Email: wnichols@vt.edu",
    "Advisor Email: janea@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: hicks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:11Z (GMT). No. of bitstreams: 1 cherylfinaletd.pdf: 691115 bytes, checksum: 22d310fd467d22b4ab76e62eeea1ee58 (MD5)   Previous issue date: 2004-04-05"
  ],
  "handle": "27043",
  "identifier_other": "etd-04202004-133000",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202004-133000/",
  "identifier_uri": "http://hdl.handle.net/10919/27043",
  "publisher": "Virginia Tech",
  "relation_haspart": "cherylfinaletd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Self-efficacy",
    "Substitute Teacher Training",
    "Substitute Teachers"
  ],
  "title": "The Effects of Substitute Teacher Training on the Teaching Efficacy of  Prospective Substitute Teachers in the State of West Virginia",
  "type": "Dissertation"
}