{
  "contributor_author": "Bolster, Laurie A",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Morris, Linda E.",
    "Threlkeld, Robert",
    "Belli, Gabriella M.",
    "Klunk, Clare D."
  ],
  "contributor_department": "Adult Learning and Human Resource Development",
  "date_accessioned": "2014-03-14T20:10:11Z",
  "date_adate": "2005-04-28",
  "date_available": "2014-03-14T20:10:11Z",
  "date_issued": "2005-04-06",
  "date_rdate": "2005-04-28",
  "date_sdate": "2005-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Laurie Bolster Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head> Rapid establishment of interpreting skill and knowledge standards for public school sign language interpreters has created a virtual mandate for their immediate, time-compressed, professionalization.  A series of federal laws requiring accessibility to communication for deaf people have escalated demand for interpreters far beyond the supply. Thousands of people with varying levels of knowledge, skill, and experience, have been drawn into service in schools without professional preparation. Responding to specialized research, evaluation, technology, and education related to educational interpreting, states have quickly been establishing standards for interpreting skill and knowledge including phased in degree requirements.  Educational interpreters have had to find ways of gaining necessary skill and knowledge rapidly, even though they typically work full-time,  in isolation, and have little ready access to resources.  Few occupations have experienced a juggernaut-like transition of this nature, leaving insufficient information to understand and address the phenomenon.  This study was designed to investigate what we can learn from adults absorbing intense pressure of elevating their education and skills unfolding on a daily basis, most of whom are already experiencing â  high-demand low-controlâ   work environments.  The findings give voice to members of a field of practice at a historic point in the professionalization of their field:  sixty five experienced educational interpreters with diverse foundational preparation who completed a specialized, two-year, inservice program delivered at a distance.  Online survey research, using a variety of response formats complemented by open-ended questions, generated data which were analyzed using descriptive and analytic statistics as well as coding schemes for themes and patterns that emerged from the qualitative data.  The study illuminated a variety of challenges, successes, and, for some, the transformative nature of the experience, which warrants further study.  Beyond acquiring knowledge and skills participants learned how to learn and achieved self-realization of their resilience points.  They especially experienced themselves transforming into professionals with abilities to actively contribute to the school environment, reporting themselves to be informed, competent, and confident in all typically expected roles.  Challenges typical of the adult distance learner abounded.  It is recommended that adult learning principles be incorporated into any such program design, and that the wider interpreting community of practice be expanded as a learning resource.  Equally important to recognize are the many people who have the same enthusiasms for the work, and the same professionalizing experiences as their more skilled peers, but who may never become sufficiently skilled to pass interpreting skill exams or their state standards.  A follow up study is recommended to learn what emerges next.  Is there a place for them in education that fully acknowledges and uses their experience and competencies? <body> </body> </html>",
  "description_provenance": [
    "Author Email: lbolster@vt.edu",
    "Advisor Email: linda_morris11495@yahoo.com",
    "Advisor Email: bobthrelkeld@direcway.com",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: cdklunk@suscom.net",
    "Made available in DSpace on 2014-03-14T20:10:11Z (GMT). No. of bitstreams: 1 LaurieBolster.pdf: 893858 bytes, checksum: e52bb6c9ba17f1c060e0b43c7b5e75bb (MD5)   Previous issue date: 2005-04-06"
  ],
  "handle": "27047",
  "identifier_other": "etd-04202005-214442",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202005-214442/",
  "identifier_uri": "http://hdl.handle.net/10919/27047",
  "publisher": "Virginia Tech",
  "relation_haspart": "LaurieBolster.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Professionalization",
    "Educational Interpreting",
    "Adult Learning",
    "Distance Learning",
    "Transformation",
    "Rural",
    "Sign Language",
    "Interpreter Education"
  ],
  "title": "Time-Compressed Professionalization: The Experience of Public School Sign Language Interpreters in Mountain-Plains States",
  "type": "Dissertation"
}