{
  "contributor_author": "Palermo, Thelma D.",
  "contributor_committeechair": "Sughrue, Jennifer A.",
  "contributor_committeemember": [
    "Crockett, Jean B.",
    "Driscoll, Lisa G.",
    "Kelly, Patricia Proudfoot",
    "Parson, Stephen R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:10Z",
  "date_adate": "2002-04-25",
  "date_available": "2014-03-14T20:10:10Z",
  "date_issued": "2002-04-10",
  "date_rdate": "2003-04-25",
  "date_sdate": "2002-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The grounded theory presented in this study describes practices elementary principals utilize in influencing new teachers to remain in education. Eleven teachers and three elementary principals from one school division in Virginia participated in this study. Interview data were collected, elementary principals were shadowed, and documents were analyzed. Thematic categories and sub categories were formed through data analysis. The grounded theory that resulted from this study is: principals who create an atmosphere of trust, of mutual respect, and of service to children within a school foster teachers who state they feel successful, valued, safe, loyal, and professional and want to and expect to continue teaching. New teachers reported three themes that created their sense of success, value, safety, loyalty, and professionalism. Those themes are: (a) support; (b) communication; (c) first year success stories. Principals stated they employed a variety of practices to create the climate identified by the new teachers. The practices are: maintaining an open door policy, utilizing positive communication, developing leadership teams, encouraging professional development, designing and implementing support structures, providing opportunities for professional development, participating in decision making, encouraging and expecting peer collaboration and child centered instructional and behavioral programs.",
  "description_provenance": [
    "Author Email: tpalermo@erols.com, tdpalerm@henrico.k12.va.us",
    "Advisor Email: jsugh@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:10Z (GMT). No. of bitstreams: 1 PalermoThelma.PDF: 444268 bytes, checksum: d729dac280a424e0cb512e1cc37e9ddc (MD5)   Previous issue date: 2002-04-10"
  ],
  "handle": "27041",
  "identifier_other": "etd-04202002-194538",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202002-194538/",
  "identifier_uri": "http://hdl.handle.net/10919/27041",
  "publisher": "Virginia Tech",
  "relation_haspart": "PalermoThelma.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Principal Support",
    "School Climate",
    "Retention",
    "New Teachers"
  ],
  "title": "Practices of Elementary Principals in Influencing New Teachers to Remain in Education",
  "type": "Dissertation"
}