{
  "contributor_author": "Faeth, Margaret Ann",
  "contributor_committeechair": "Wiswell, Albert W.",
  "contributor_committeemember": [
    "Boucouvalas, Marcie",
    "Warren, Lee",
    "Callahan, Jamie L.",
    "Belli, Gabriella M."
  ],
  "contributor_department": "Adult Learning and Human Resource Development",
  "date_accessioned": "2014-03-14T20:10:11Z",
  "date_adate": "2004-04-30",
  "date_available": "2014-03-14T20:10:11Z",
  "date_issued": "2004-04-08",
  "date_rdate": "2005-04-30",
  "date_sdate": "2004-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Power, Authority and Influence:  A Comparative Study of the Behavioral Influence Tactics Used by Lay and Ordained Leaders in the Episcopal Church  by Margaret Ann Faeth Albert Wiswell, Chair  (ABSTRACT)  \tLeadership is a social influence process that is necessary for the attainment of societal and organizational goals.  Leadership is both conspicuous in its absence and mysterious in its presence â   familiar and yet hard to define.  \tLeadership happens within the power and authority structures of organizations.  The body of research on the influence processes of leadership has focused on organizations with clear hierarchical lines of power and authority between boss, subordinate and peer. \tThis dissertation was designed to study the influence processes of leadership within a religious denomination, the Episcopal Church in the United States of America (ECUSA).  As a Christian community, ECUSA is guided by the biblical model of servant leadership as it was made known in the life, death and resurrection of Jesus.   \tTo compare the behavioral influence tactics used by lay and ordained leaders in ECUSA, 152 participants completed the Episcopal Leadership Questionnaire and the agent version of the Influence Behavior Questionnaire (Yukl, 2000).  In addition to demographic and contextual variables, participants identified the frequency of use of 11 behavioral influence tactics with a designated target (boss, subordinate, peer, or other/hard to define).  Almost one-fifth of the respondents could not classify their influence target according to hierarchical categories.   \tThe responses of 75 ordained and 77 lay leaders in ECUSA revealed few statistically significant differences between groups on the use of Yuklâ  s 11 categories of behavioral influence tactics.  Both groups used collaboration, consultation and rational persuasion most often.  Inspirational appeals, ingratiation and legitimating tactics were used somewhat often.  Apprising, coalition tactics, personal appeals, exchange were used infrequently by both groups.  Pressure was almost never used as an influence tactic by either group. ANOVA and discriminant function analysis indicated a slight tendency for lay leaders to use collaboration, coalition tactics and exchange more often than ordained leaders.  Men used legitimating tactics somewhat more often than women.  Women used exchange tactics slightly more often than men.  No statistically significant differences were observed in the use of influence tactics when age, type of ministry, education or technical/adaptive work perceptions were used as the categorical variable. \tThis study supported previous research on the directional use of influence tactics, while suggesting possibilities for future research in non-hierarchical organizations.  Results also suggested a relationship between leadersâ   perceptions of their sources of power in the organization and their use of influence tactics.  The paucity of statistically significant findings based upon ordination status and the clear presence of a non-hierarchical category of influence target suggest that the explanatory construct of servant leadership plays a role in the power, authority and influence processes of ECUSA.",
  "description_provenance": [
    "Author Email: samfaeth@verizon.net",
    "Advisor Email: awiswell@vt.edu",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: lawarren@fas.harvard.edu",
    "Advisor Email: jcallahan@tamu.edu",
    "Advisor Email: gbelli@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:11Z (GMT). No. of bitstreams: 1 mabfaethdiss.pdf: 448294 bytes, checksum: 76c617f994792d9e0c1f867c967bfbf0 (MD5)   Previous issue date: 2004-04-08"
  ],
  "handle": "27045",
  "identifier_other": "etd-04202004-172143",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202004-172143/",
  "identifier_uri": "http://hdl.handle.net/10919/27045",
  "publisher": "Virginia Tech",
  "relation_haspart": "mabfaethdiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "influence tactics",
    "authority",
    "leadership",
    "power"
  ],
  "title": "Power, Authority and Influence: A Comparative Study of the Behavioral Influence Tactics Used by Lay and Ordained Leaders in the Episcopal Church",
  "type": "Dissertation"
}