{
  "contributor_author": "Mullen, Patrick R.",
  "contributor_committeechair": "Wolf, James F.",
  "contributor_committeemember": [
    "Boster, Ronald S.",
    "Dudley, Larkin S.",
    "Hult, Karen M."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:10:12Z",
  "date_adate": "2006-04-26",
  "date_available": "2014-03-14T20:10:12Z",
  "date_issued": "2006-04-07",
  "date_rdate": "2006-04-26",
  "date_sdate": "2006-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Congressional reporting requirements are an integral part of congressional oversight.  These oversight-reporting activities are an important element of the concept of a legislative-centered public administration (Rosenbloom, 2000) â  derived from the major discussions, decisions, and actions taken by Congress with regard to federal administration.â     This dissertation first describes the development of congressional reporting requirements by presenting selected agency cases.  Based on these cases, common themes are identified that help in understanding the requirements and the problems associated with congressional reporting.  The dissertation then makes specific recommendations for enhancing reporting requirement activities (e.g., tracking, monitoring and feedback) as part of the congressional oversight process.  A proposed management approach to improve the congressional oversight process to build a legislative-centered public administration is presented at the conclusion of the dissertation.  The dissertation process used a research approach that included selected cases, interviews with key individuals in the reporting process and analysis of data, including databases maintained by the Clerk of the House and Secretary of the Senate.    The dissertation is composed of three parts with two chapters in each part.  Part I covers background information about congressional reporting requirements, the objectives and approach used in writing the dissertation, and the key theoretical literature that underpins the discussion of congressional reporting requirements.  Part II of the dissertation discusses management and growth of reporting requirements.  Part III of the dissertation discusses ways to gain control of congressional reporting requirements and increase their usefulness.  The dissertation concludes that there is little evidence to indicate that congressional reporting requirements are being systematically managed in a way that achieves the objective for which they are created.  The most serious substantive shortcoming is the lack of an institutional process to support and encourage discussion between Congress and the agencies preparing reports to provide for feedback and to identify reporting requirements that are no longer necessary.  A comprehensive and systematic management approach is needed and a proposed management approach is discussed.  Comprehensive and systematic management will bring about greater collaboration between congressional committees and their agency partners in an enhanced legislative-centered public administration.",
  "description_provenance": [
    "Author Email: mullenp@gao.gov",
    "Advisor Email: jwolf@vt.edu",
    "Advisor Email: bosterr@pcabous.org",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:12Z (GMT). No. of bitstreams: 12 End-AppendixB4-19.pdf: 118474 bytes, checksum: caaddaed54448facce730d84c462e1cf (MD5) End-AppendixA4-19.pdf: 82650 bytes, checksum: 007c959aaf747031784c6ba2656881d3 (MD5) End-AppendicesCDEF4-19.pdf: 184159 bytes, checksum: 5f25fa4adf66df3e683d4c03330b582a (MD5) Chapter5-ELIMINATING4-19.pdf: 205135 bytes, checksum: f1e3a8da22aee762a7eb17b239bf5d99 (MD5) Chapter4-PERFORMANCE4-19.pdf: 288910 bytes, checksum: b1bb0b35de3f26f206cd7f4a403d45aa (MD5) Chapter3MANAGEMENT4-19.pdf: 1003087 bytes, checksum: 5d252289584584e8356153d08fd076ea (MD5) Chapter2-LITERATURE-19.pdf: 151520 bytes, checksum: 27bb5f3265262386adc90273c49354a9 (MD5) DEnd-BIBLIOGRAPY4-19.pdf: 78873 bytes, checksum: 768ae5a1f373da0e40aab3317deb1c39 (MD5) CoverAbstract4-19.pdf: 96675 bytes, checksum: 6d66728331576d66d9cd5757c98c83f6 (MD5) Chapter6-MGMTPROCESS4-19.pdf: 519483 bytes, checksum: 86b12d7b03916726a0ce3dbbdccb4a12 (MD5) Chapter1-Introduction4-19.pdf: 198976 bytes, checksum: 66f26d7b46e4ac2af4e7d9641f8359a1 (MD5) VITA4-19.pdf: 42631 bytes, checksum: 6cb7f984dadff27eb6e1bf653f9b2474 (MD5)   Previous issue date: 2006-04-07"
  ],
  "handle": "27049",
  "identifier_other": "etd-04202006-104259",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202006-104259/",
  "identifier_uri": "http://hdl.handle.net/10919/27049",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "End-AppendixB4-19.pdf",
    "End-AppendixA4-19.pdf",
    "End-AppendicesCDEF4-19.pdf",
    "Chapter5-ELIMINATING4-19.pdf",
    "Chapter4-PERFORMANCE4-19.pdf",
    "Chapter3MANAGEMENT4-19.pdf",
    "Chapter2-LITERATURE-19.pdf",
    "DEnd-BIBLIOGRAPY4-19.pdf",
    "CoverAbstract4-19.pdf",
    "Chapter6-MGMTPROCESS4-19.pdf",
    "Chapter1-Introduction4-19.pdf",
    "VITA4-19.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "congressional reporting requirements",
    "performance reporting",
    "congressional oversight",
    "legislative â  centered public administration",
    "management process"
  ],
  "title": "Congressional Reporting: A Management Process to Build a Legislative-Centered Public Administration",
  "type": "Dissertation"
}