{
  "contributor_author": "Viswanathan, Kalpana",
  "contributor_committeechair": "Ward, Thomas C.",
  "contributor_committeemember": [
    "Long, Timothy E.",
    "Riffle, Judy S.",
    "Davis, Richey M.",
    "Esker, Alan R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:10:12Z",
  "date_adate": "2006-04-28",
  "date_available": "2014-03-14T20:10:12Z",
  "date_issued": "2006-04-07",
  "date_rdate": "2006-04-28",
  "date_sdate": "2006-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The synthesis of a variety of novel functionalized polymers using living polymerization techniques to achieve functional and stimuli responsive coatings on silica surfaces are described.  Since microscopic features on a surface influence the overall wetting properties of the surface, a systematic investigation of the influence of polymer architecture on the microscopic characteristics of the modified surfaces was studied using silane-functionalized linear and novel star-branched polystyrene (PS). Star-branched modifiers provide functional and relatively well-defined model systems for probing surface properties compared to ill-defined highly branched systems and synthetically challenging dendrimers.  Using these simple star-shaped macromolecules it was shown that the topographies of the polymer-modified surfaces were indeed influenced by the polymer architecture.  A model explaining the observed surface features was proposed. A living polymerization strategy was also used to synthesize centrally functionalized amphiphilic triblock copolymers.  The amphiphilic copolymers exhibited stimuli responsive changes in surface hydrophobicity. In spite of multiple solvent exposures, the copolymer films remained stable on the surface indicating that the observed changes in surface properties were due to selective solvent induced reversible rearrangement of the copolymer blocks.  The chemical composition of the copolymers was tailored in order to tune the response time of the surface anchored polymer chains.  Thus, the polymer coatings were used to reversibly change the surface polarities in an on-demand fashion and could find possible applications as smart adhesives, sensors and reusable membrane devices. In contrast to the afore-mentioned covalent modification approach, which often leads to permanent modification of surfaces, renewable surfaces exhibiting â  universalâ   adhesion properties were also obtained through non-covalent modification.  By employing hydrogen bonding interactions between DNA bases, surfaces functionalized with adenine groups were found to reversibly associate with thymine-functionalized polymers.  This study describing the solvato-reversible polymer coating was the first demonstration on silica surfaces.  A systematic investigation of the influence of surface concentration of the multiple hydrogen bonding groups and their structure on the extent of polymer recognition by the modified surfaces is also discussed.",
  "description_provenance": [
    "Author Email: kviswana@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: asker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:12Z (GMT). No. of bitstreams: 1 KalpanaViswanathanDissertationCorrected.pdf: 4942776 bytes, checksum: 1e7d0fed185b181aec8d94ecc1f5a768 (MD5)   Previous issue date: 2006-04-07"
  ],
  "handle": "27052",
  "identifier_other": "etd-04202006-124239",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202006-124239/",
  "identifier_uri": "http://hdl.handle.net/10919/27052",
  "publisher": "Virginia Tech",
  "relation_haspart": "KalpanaViswanathanDissertationCorrected.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "star-branched polymers",
    "Silicon surface modification",
    "amphiphilic block copolymers",
    "multiple hydrogen bonding",
    "responsive surfaces"
  ],
  "title": "Synthesis and Characterization of Novel Polymers for Functional and Stimuli Responsive Silicon Surfaces",
  "type": "Dissertation"
}