{
  "contributor_author": "Davis, Jr., George Robert",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Redican, Kerry J.",
    "Schroeder, Aaron D.",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:13Z",
  "date_adate": "2006-04-28",
  "date_available": "2014-03-14T20:10:13Z",
  "date_issued": "2006-04-18",
  "date_rdate": "2006-04-28",
  "date_sdate": "2006-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Major college recruitment of high school athletes is a very competitive process. There are one hundred and seventeen Division I - A NCAA schools for athletes to choose among.     Up to this point, coaches and administrators have speculated what is important to the prospective student-athlete in an attempt to improve certain potential factors like facilities, equipment, coaching changes, etc.  The purpose of this study was to determine what factors were important in the decision-making process of prospective student-athletes and discover, as freshman, were they satisfied with their ultimate decision.     \tEighty-Eight freshmen student-athletes responded to the questionnaire in the months May through July of 2005.     The questionnaire was grouped into three main areas of content: Team History, Facilities and Equipment, and Departmental Services.    These areas were investigated by means of utilizing a Likert scale and analyzing data by scholarship status, by gender and by team affiliation.  \tThe results revealed that the most important factors in oneâ  s decision-making process are Education, Coaches, Success of the Program, and Facilities.    From these factors, besides Education itself, the main area of focus for a prospective student-athlete is related to Team History, followed by Facilities and Equipment, with Departmental Services being the final area of concern.    Also revealed by this study is the fact that there are some differences between the factors a scholarship student-athlete considers and the factors a non-scholarship student-athlete considers in their decision-making process.    Finally, this study showed that of those polled, they were satisfied with their decision to participate in collegiate athletics.",
  "description_provenance": [
    "Author Email: gedavis@vt.edu, grdavis@radford.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: aschroed@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:13Z (GMT). No. of bitstreams: 1 FinalDocumentDissertation.pdf: 214931 bytes, checksum: 4fe83a773f82f053888bbec37555b2c6 (MD5)   Previous issue date: 2006-04-18"
  ],
  "handle": "27059",
  "identifier_other": "etd-04202006-181220",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202006-181220/",
  "identifier_uri": "http://hdl.handle.net/10919/27059",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalDocumentDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Student-Athlete",
    "Satisfaction",
    "Decision-Making",
    "Athletics"
  ],
  "title": "Freshmen Student-Athletes: An Examination of the Decision-Making  Process and Satisfaction",
  "type": "Dissertation"
}