{
  "contributor_author": "Pierrakos, Olga",
  "contributor_committeechair": "Vlachos, Pavlos P.",
  "contributor_committeecochair": "Alley, Michael",
  "contributor_committeemember": [
    "Grant, John Wallace",
    "Berry, Joel",
    "Hamilton, Craig",
    "Telionis, Demetri P."
  ],
  "contributor_department": "Biomedical Engineering and Sciences",
  "date_accessioned": "2014-03-14T20:10:12Z",
  "date_adate": "2006-04-28",
  "date_available": "2014-03-14T20:10:12Z",
  "date_issued": "2006-04-18",
  "date_rdate": "2006-04-28",
  "date_sdate": "2006-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Left ventricular flows in the human heart are very complex and in the presence of a diseased condition, such as unhealthy or prosthetic heart valves, the complexity of the flow is further increased.  The intricacy of the heart geometry combined with the pulsatile character of the flow, the interaction of high-speed jets with the flexible walls, and the unsteady motion of the heart valve leaflets generate inherently complicated flow fields. It is therefore essential that we study and understand the complex cardiac energetics and physics of blood flow in both healthy and diseased hearts. Although artificial heart valves, mechanical and biological, have evolved to a level of universal acceptance, they have never reached a level of performance comparable to that of the natural valves of the heart.  Many of the problems are directly related to the fluid mechanics.  Considering that mechanical heart valves (MHV) are more commonly implanted because of their durability, it is imperative to better understand their hemodynamic behavior.   Yet to date, no study has documented in depth the complex hemodynamic characteristics of left ventricular flows and assessed the intricate structures that are generated in the left ventricle (LV) due to vortex formation (roll-up of shear layers shed past the valve leaflets), turbulence characteristics, and energetics.  The flow through pivoted leaflets of MHVs induces a combination of flow characteristics that are dependent on the specific valve design and orientation. The aim of the present study is to provide new insight into the spatio-temporal dynamics of the flow distal to a mitral MHV by employing a state-of-the-art, high resolution, flow diagnostic method, Time Resolved Digital Particle Image Velocimetry (TRDPIV) in a flexible, transparent LV documenting the evolution of eddies and turbulence during a complete period of the heart cycle.  The broad impact of the proposed research extends beyond the hemodynamics of heart valve prosthesis. The research herein will enable the development of a tool for application in all cardiac energetic studies (unhealthy valves, tissue engineered valves, cardiac remodeling stages, and even congestive heart failure) and aid in better diagnosis of the efficiency and performance of the heart.  The last component of the dissertation involved the translation of my dissertation research into an engineering educational tool for undergraduate engineering students.",
  "description_provenance": [
    "Author Email: opierrak@vt.edu",
    "Advisor Email: jgrant@vt.edu",
    "Advisor Email: jberry@wfubmc.edu",
    "Advisor Email: crhamilt@wfubmc.edu",
    "Advisor Email: pvlachos@vt.edu",
    "Advisor Email: telionis@vt.edu",
    "Advisor Email: alley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:12Z (GMT). No. of bitstreams: 2 s05-426.pdf: 46773 bytes, checksum: 419f614cdad9933931a41d61c0f8903e (MD5) Dissertation_Olga_Pierrakos_FINAL.pdf: 14725227 bytes, checksum: 0306aa156e097820ee0f605aee4170e2 (MD5)   Previous issue date: 2006-04-18"
  ],
  "handle": "27051",
  "identifier_other": "etd-04202006-124002",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202006-124002/",
  "identifier_uri": "http://hdl.handle.net/10919/27051",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "s05-426.pdf",
    "Dissertation_Olga_Pierrakos_FINAL.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "DPIV",
    "left ventricle",
    "vortex",
    "orientation",
    "heart valves"
  ],
  "title": "Vortex Dynamics and Energetics in Left Ventricular Flows",
  "type": "Dissertation"
}