{
  "contributor_author": "Russ, Jennifer Lynn",
  "contributor_committeechair": "Dorn, Harry C.",
  "contributor_committeemember": [
    "Merola, Joseph S.",
    "Ritter, Alfred L.",
    "Tanko, James M.",
    "Crawford, Daniel T."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:10:12Z",
  "date_adate": "2006-04-26",
  "date_available": "2014-03-14T20:10:12Z",
  "date_issued": "2006-04-17",
  "date_rdate": "2007-04-26",
  "date_sdate": "2006-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Advanced nuclear and electron magnetic resonance techniques (i.e. nuclear magnetic resonance (NMR), dynamic nuclear polarization (DNP), and magnetic resonance imaging (MRI)) were used to study the attitude and dynamics of TEMPO (2,2,6,6-tetramethylpiperidinyloxy)-substrate systems and the relaxivity properties of water-soluble trimetallic nitride template functionalized endohedral metallofullerenes (TNT-fMF).  The attitude and average distance of interaction for each TEMPO-substrate system was determined from comparing density functional theory (DFT) calculation results with experimental hyperfine coupling constants leading to an improved understanding of solution dynamics.  The short-lived solvent-solute interactions of the TEMPO-substrate molecules, such as transient complex formation, are governed by weak hydrogen-bonding interactions.  The collisions in solution were explained by determining the favored orientations of the two molecules interacting using calculated relative energy minima and reproducibility of the experimental results by the calculated coupling constants.   \tWater-soluble TNT-fMFs are studied as candidates for the next generation MRI contrast agents as diagnostic agents and also as possible therapeutic agents to kill cancer cells and decrease tumors.  The TNT-fMFs are being studied as part of a multi-modal platform dependent upon which metal atoms are encapsulated inside: Gd 창   MRI contrast agent (diagnostic), Lu and Ho 창   radio labeled for use as a therapeutic agent, Tb 창   fluorescence, and Lu 창   x-ray contrast.  The current commercial MRI contrast agent, OmniscanTM, contains one gadolinium atom; however, the metal is complexed to, not encapsulated in, the molecule.  TNT-fMFs fully encapsulate three metal atoms to ensure the patient does not run the risk of metal poisoning.  The r1 and r2 relaxivities of TNT-fMFs containing either Gd, Lu, Ho, or Sc metals were measured at 0.35T.  The data for the Gd containing TNT-fMFs indicated the metallofullerene has significantly higher relaxivities than OmniscanTM, and can be the next generation MRI contrast agent.  The Ho containing species has a high r2/r1 ratio compared to the other samples showing it is a potential T2 agent, and has therapeutic capabilities.",
  "description_provenance": [
    "Author Email: jkile@vt.edu",
    "Advisor Email: hdorn@vt.edu",
    "Advisor Email: jmerola@vt.edu",
    "Advisor Email: aritter@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: crawdad@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:12Z (GMT). No. of bitstreams: 2 Table_of_Contents.pdf: 50419 bytes, checksum: 59e8a24a91351bde6aeb8fe0dfa80af5 (MD5) Dissertation_v2.pdf: 2366425 bytes, checksum: f12a84eafb47c4389600ee776df76651 (MD5)   Previous issue date: 2006-04-17"
  ],
  "handle": "27050",
  "identifier_other": "etd-04202006-115256",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202006-115256/",
  "identifier_uri": "http://hdl.handle.net/10919/27050",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Table_of_Contents.pdf",
    "Dissertation_v2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Relaxivity",
    "TEMPO",
    "Hyperfine Coupling Constant",
    "Magnetic Resonance Imaging",
    "Endohedral Metallofullerene",
    "Contrast Agent"
  ],
  "title": "Studies of Solution Paramagnetic-Substrate  Nuclear and Electron Intermolecular Interactions",
  "type": "Dissertation"
}