{
  "contributor_author": "Sovacool, Benjamin K",
  "contributor_committeecochair": [
    "Hirsh, Richard F.",
    "Breslau, Daniel"
  ],
  "contributor_committeemember": [
    "Patzig, Eileen Crist",
    "Halfon, Saul E.",
    "Luke, Timothy W."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:10:13Z",
  "date_adate": "2006-04-26",
  "date_available": "2014-03-14T20:10:13Z",
  "date_issued": "2006-04-17",
  "date_rdate": "2008-10-30",
  "date_sdate": "2006-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Dramatic improvements in renewable energy and small-scale distributed generation (DG) technologies have been made in the last twenty years.  Nevertheless, they remain underutilized in the American electric utility system.  Despite the immense environmental, technical, and financial promise of renewable energy systems and DG technologies, such generators still constitute a very small percentage of electricity generation capacity in the United States.  This relative neglect occurs despite remarkable gains in their technical performance and reductions in their cost of producing powerâ  the result (in part) of dramatic government support for several decades.  Moreover, the technologies often demonstrate great environmental benefits that appeal to policymakers and consumers.  At the same time, they offer ways to enhance strained distribution and transmission networks.       This project attempts to answer the apparently paradoxical question:  why do new energy technologies that offer such impressive benefits also find the least use?  The dissertation emphasizes how the history and culture of the community of electricity producers and users helps explain why the new technologies have seen little use.  Going beyond technical explanations of alleged low capacity factors and high capital costs, it focuses on the social nature of decision making among participants in the electric utility system.  The approach not only helps us understand the glossing over of renewable energy and distributed generation technologies, but also suggests ways of overcoming the barriers faced by their advocates.",
  "description_provenance": [
    "Author Email: sovacool@vt.edu",
    "Advisor Email: richards@vt.edu",
    "Advisor Email: dbreslau@vt.edu",
    "Advisor Email: ecrist@vt.edu",
    "Advisor Email: shalfon@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:13Z (GMT). No. of bitstreams: 1 Sovacool-Dissertation-v10-Final.pdf: 2613282 bytes, checksum: 38bacbc9ed2595bc47d7cd442d323ed5 (MD5)   Previous issue date: 2006-04-17"
  ],
  "handle": "27058",
  "identifier_other": "etd-04202006-172936",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202006-172936/",
  "identifier_uri": "http://hdl.handle.net/10919/27058",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sovacool-Dissertation-v10-Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Energy Policy",
    "Renewable Energy",
    "Distributed Generation",
    "Technological Systems",
    "Sociology of Technology",
    "History of Technology"
  ],
  "title": "The Power Production Paradox: Revealing the Socio-Technical Impediments to Distributed Generation Technologies",
  "type": "Dissertation"
}