{
  "contributor_author": "Peter, Paula Caterina",
  "contributor_committeechair": "Brinberg, David L.",
  "contributor_committeemember": [
    "Coupey, Eloise",
    "Jaccard, James J.",
    "Nakamoto, Kent"
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:10:14Z",
  "date_adate": "2007-04-25",
  "date_available": "2014-03-14T20:10:14Z",
  "date_issued": "2007-04-11",
  "date_rdate": "2010-04-25",
  "date_sdate": "2007-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Increasing physical activity and adopting a healthy diet have the goal to enhance consumer welfare. The goal of this set of studies is to contribute to a research agenda that tries to support and enhance the life of consumers, through the exploration of emotional intelligence as a new possible avenue of research related to consumer behavior and health.  Four studies are proposed that look at the possibility to introduce emotional intelligence in decision making and performance related to health (i.e. adoption and maintenance of a healthy diet/weight).  The findings suggest the salient role of emotional reasoning (i.e. understanding and regulation of emotions) on decision making and performance related to health. Training on emotional intelligence and health seems to activate mechanisms that help people to use their knowledge in the right direction in order to make better decisions and improve performance related to health (i.e. adoption/maintenance of healthy diet/weight).",
  "description_provenance": [
    "Author Email: papeter@vt.edu",
    "Advisor Email: ecoupey@vt.edu",
    "Advisor Email: jjaccard@fiu.edu",
    "Advisor Email: nakamoto@vt.edu",
    "Advisor Email: brinberg@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:14Z (GMT). No. of bitstreams: 1 DissertationPaulaCPeter.pdf: 606749 bytes, checksum: 04e02ce6d0e6e9fd8c141f2069335d95 (MD5)   Previous issue date: 2007-04-11"
  ],
  "handle": "27062",
  "identifier_other": "etd-04202007-095255",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202007-095255/",
  "identifier_uri": "http://hdl.handle.net/10919/27062",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationPaulaCPeter.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "decision making",
    "emotional intelligence",
    "consumer health"
  ],
  "title": "Emotional Reasoning and Decision Making: understanding and regulating emotions that serve people's goals.",
  "type": "Dissertation"
}