{
  "contributor_author": "Johnson, Jennie Susan",
  "contributor_committeechair": "Wiswell, Albert K.",
  "contributor_committeemember": [
    "Belli, Gabriella M.",
    "Klunk, Clare D.",
    "Reio, Thomas G. Jr."
  ],
  "contributor_department": "Adult Learning and Human Resource Development",
  "date_accessioned": "2014-03-14T20:10:14Z",
  "date_adate": "2007-05-08",
  "date_available": "2014-03-14T20:10:14Z",
  "date_issued": "2007-04-17",
  "date_rdate": "2007-05-08",
  "date_sdate": "2007-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The present research in ethical decision-making draws from the fields of moral philosophy, social psychology, and organizational theory with the intention of establishing links among social/organizational influences, individual cognitive elements of moral behavior, individual difference characteristics, and the intention to act ethically. Ethical decision-making, by investigating the moral judgment (evaluation) and moral intent components of an ethical decision-making model, was examined. This augments existing research concerning inconsistencies between the ethical behavior of an individual and the individualâ  s level of moral development, which in the workplace are hypothesized to be related to organizational factors. Research questions developed from this groundwork, as well as research on moral ideology and organizational justice, were formulated to examine how moral ideology, moral evaluation, and organizational justice work together to explain moral intent. Moral evaluation explained 55% of the variance in moral intent after controlling for moral ideology and organizational justice. For a subset of the data, three organizational justice variables explained a very modest proportion of the variance in moral evaluation after controlling for two moral ideology variables.  Implications for future research and considerations for practice are presented.",
  "description_provenance": [
    "Author Email: jejohn11@vt.edu",
    "Advisor Email: awiswell@vt.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: cdklunk@vt.edu",
    "Advisor Email: thomasreio@louisville.edu",
    "Made available in DSpace on 2014-03-14T20:10:14Z (GMT). No. of bitstreams: 1 JSJohnson.pdf: 899821 bytes, checksum: ae45ac1ab0a4a657d567b9072ea33cee (MD5)   Previous issue date: 2007-04-17"
  ],
  "handle": "27063",
  "identifier_other": "etd-04202007-100829",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202007-100829/",
  "identifier_uri": "http://hdl.handle.net/10919/27063",
  "publisher": "Virginia Tech",
  "relation_haspart": "JSJohnson.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "moral intent",
    "organizational justice",
    "ethical decision-making"
  ],
  "title": "Organizational Justice, Moral Ideology, and Moral Evaluation as Antecedents of Moral Intent",
  "type": "Dissertation"
}