{
  "contributor_author": "Nacheri, Sylvanus Amkaya",
  "contributor_committeecochair": [
    "Driscoll, Lisa G.",
    "Salmon, Richard G."
  ],
  "contributor_committeemember": [
    "Alexander, M. David",
    "Sughrue, Jennifer A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:13Z",
  "date_adate": "2006-04-28",
  "date_available": "2014-03-14T20:10:13Z",
  "date_issued": "2006-04-03",
  "date_rdate": "2007-04-28",
  "date_sdate": "2006-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to investigate whether Kenya's national policies of education are consistent with the principles of nation building and state sovereignty. The investigation involved developing eight multiple regression models. Each model utilized one dependent variable, one independent variable and two control variables. The dependent variables were the average boys and the average girls public primary education gross enrollment ratios for 2000-03, the boys and the girls public primary education completion rates for the class of 2003, and the boys and the girls public primary education gross enrollment ratios for 2003. The independent variables were the public primary education pupil/teacher ratios for 2000 and the public primary education pupil/teacher ratios for 2003. The two control variables were the percentage of the population living in towns in 1999 and the percentage of the population in wage employment in 1999. The only significant results were a negative relationship between public primary education pupil/teacher ratios for 2003 and the girls public primary education completion rates for the class of 2003 and, a positive relationship between the percentage of the population in wage employment in 1999 and the girls public primary education completion rates for the class of 2003. The results suggested that Kenya's national policies of education are not consistent with the principles of nation building and state sovereignty and led to the conclusion that Kenya's public primary education may not be playing the nation-building role that it should play.",
  "description_provenance": [
    "Author Email: massschooling@yahoo.com",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: jsughrue@fau.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:13Z (GMT). No. of bitstreams: 1 MassSchooling10.pdf: 967212 bytes, checksum: 85595f794c5c829ec071e4857cca121f (MD5)   Previous issue date: 2006-04-03"
  ],
  "handle": "27060",
  "identifier_other": "etd-04202006-181439",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202006-181439/",
  "identifier_uri": "http://hdl.handle.net/10919/27060",
  "publisher": "Virginia Tech",
  "relation_haspart": "MassSchooling10.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "state sovereignty",
    "educational expansion",
    "nation building",
    "mass schooling"
  ],
  "title": "Mass schooling, Nation Building and the Sovereignty of the Kenyan state",
  "type": "Dissertation"
}