{
  "contributor_author": "Sundaram, Narayan",
  "contributor_committeechair": "Thole, Karen A.",
  "contributor_committeemember": [
    "Ng, Fai",
    "O'Brien, Walter F. Jr.",
    "Vandsburger, Uri",
    "Schetz, Joseph A."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:10:14Z",
  "date_adate": "2007-04-26",
  "date_available": "2014-03-14T20:10:14Z",
  "date_issued": "2007-04-18",
  "date_rdate": "2009-04-26",
  "date_sdate": "2007-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A higher demand in power output from modern land based gas turbines has resulted in an increase in combustor exit temperatures.  High temperatures in turn have resulted in flatter profiles at the combustor exit warranting the need for sufficient cooling of the endwall region.  Endwall cooling is affected by the coolant flow through certain design features.  A typical endwall design includes a leakage slot at the interface between the combustor and the vane, a leakage slot at the vane-to-vane interface and film-cooling holes.  In addition, with the increase in energy demands and depletion of natural gas resources, alternate fuels such as coal derived synthetic gas are being used in gas turbines.  Coal derived fuels, however, contain traces of ash and other contaminants that deposit on endwall surfaces, thereby altering its surface conditions.  The purpose of this study was to investigate the effects of realistic endwall features and surface conditions on leading edge endwall cooling.  Endwall designs like placing film-cooling holes in a trench, which provide an effective means of improving cooling were also studied at the leading edge.  An infrared camera was used to obtain measurements of adiabatic effectiveness levels and a laser Doppler velocimeter was used for flowfield measurements.    This study was done on a large scale, low-speed, recirculating wind tunnel operating at a Reynolds number of 2.1e+5 and an inlet mainstream turbulence level of 1%.  Endwall measurements were taken for coolant flow through varying slot width at the combustor-vane interface.  A constant coolant mass flow and a narrower combustor-turbine interface slot caused the coolant to exit uniformly whereas increasing the slot width had an opposite effect.  Measurements were also taken with hole blockage and spallation, which showed a 10-25% decrease in the effectiveness levels whereas near hole deposition showed a 20% increase in effectiveness levels.   A comparison of the cooling effectiveness due to placement of film-cooling holes in a trench was made to film-cooling holes not placed in a trench.  Measurements indicated a superior performance of trenched holes to holes without a trench.  Trenched holes showed a 60% increase in effectiveness levels due to decreased coolant jet separation.",
  "description_provenance": [
    "Author Email: nasundar@vt.edu",
    "Advisor Email: wng@vt.edu",
    "Advisor Email: kthole@psu.edu",
    "Advisor Email: walto@vt.edu",
    "Advisor Email: uri@vt.edu",
    "Advisor Email: ptiger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:14Z (GMT). No. of bitstreams: 1 Dissertation_Narayan.pdf: 2113184 bytes, checksum: 4a59a15ea4be8797f60245e5fe221173 (MD5)   Previous issue date: 2007-04-18"
  ],
  "handle": "27066",
  "identifier_other": "etd-04202007-162833",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202007-162833/",
  "identifier_uri": "http://hdl.handle.net/10919/27066",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Narayan.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Film-Cooling",
    "Endwall",
    "Trench",
    "Gas Turbine"
  ],
  "title": "Effects of Surface Conditions on Endwall Film-Cooling",
  "type": "Dissertation"
}