{
  "contributor_author": "Zhao, Ying",
  "contributor_committeechair": "Jones, James R.",
  "contributor_committeemember": [
    "Jones, Dennis B.",
    "Kilper, Dennis J.",
    "Vlachos, Pavlos P.",
    "Ermann, Michael G.",
    "Schubert, Robert P."
  ],
  "contributor_department": "Architecture",
  "date_accessioned": "2014-03-14T20:10:13Z",
  "date_adate": "2007-05-03",
  "date_available": "2014-03-14T20:10:13Z",
  "date_issued": "2007-04-09",
  "date_rdate": "2009-05-03",
  "date_sdate": "2007-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study develops a decision-support framework assisting the design of non-residential buildings with natural ventilation. The framework is composed of decision modules with input, analysis algorithms and output of natural ventilation design. The framework covers ventilation with natural driving force and mechanical-assisted ventilation. The framework has two major assessment levels: feasibility assessment and comparison of alternative natural ventilation approaches. The feasibility assessment modules assess the potential of the site with the design proposition for natural ventilation in terms of wind, temperature, humidity, noise and pollution conditions. All of the possible natural ventilation approaches and system designs are assessed by first applying constraints functions to each of the alternatives. Then the comparison of alternative approaches to natural ventilation continues by assessing the critical performance mandates that include energy savings, thermal comfort, acoustic control, indoor air quality and cost. Approaches are finally ranked based on their performance.",
  "description_provenance": [
    "Author Email: yizhao1@vt.edu",
    "Advisor Email: dbjones@vt.edu",
    "Advisor Email: dekilper@vt.edu",
    "Advisor Email: pvlachos@vt.edu",
    "Advisor Email: mermann@vt.edu",
    "Advisor Email: silver@vt.edu",
    "Advisor Email: wolverine@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:13Z (GMT). No. of bitstreams: 1 NVframework_ETD.pdf: 2521268 bytes, checksum: 5b78248732d7046217344a34b1d06fc8 (MD5)   Previous issue date: 2007-04-09"
  ],
  "handle": "27061",
  "identifier_other": "etd-04202007-010729",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202007-010729/",
  "identifier_uri": "http://hdl.handle.net/10919/27061",
  "publisher": "Virginia Tech",
  "relation_haspart": "NVframework_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "natural ventilation",
    "non-residential building",
    "decision-support"
  ],
  "title": "A decision-support framework for design of natural ventilation in non-residential buildings",
  "type": "Dissertation"
}