{
  "contributor_author": "Morasch, Katherine Colona",
  "contributor_committeechair": "Bell, Martha Ann",
  "contributor_committeemember": [
    "Deater-Deckard, Kirby",
    "Hoffman, Kurt A.",
    "Smith, Cynthia L."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:10:14Z",
  "date_adate": "2007-05-03",
  "date_available": "2014-03-14T20:10:14Z",
  "date_issued": "2007-04-13",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>One of the most intriguing and enduring issues in contemporary developmental cognitive neuroscience centers on the development of the ability to remember past experiences and the neural systems which support this capacity.  Over the past 25 years, through methodological advancements and direct challenges to established assumptions, the focus of this developmental question has shifted to highlight the second half of the first year of life as the time when true explicit memory functionally emerges and begins to rapidly develop.  The purpose of the following study was to test specific hypotheses regarding the biobehavioral development of explicit memory during infancy and present a new approach to studying the behavioral and physiological expression of this system.  This study, which was guided by hypothesized neural substrates of this memory system, is the first direct investigation of continuous brain electrical activity during both the encoding and retrieval phases of explicit memory processing in infants.  Memory-related differences in behavior and task-related brain activity in individual cortical areas were of particular interest.   </p><p> The results of this study provided some support for the hypothesis that baseline-to-task changes in EEG power can distinguish between successful and unsuccessful ordered-recall memory. Specifically, decreases in brain-electrical activity relative to a baseline period were found at both frontal and temporal locations during stimulus encoding and retrieval for infants who failed the recall tests.  However, either no change, or increases in EEG power at frontal and temporal sites was related to successful performance on this task.  In addition, different patterns of brain-electrical activity were present for correct and incorrect responses from the same child.   </p><p> This study contributes to our understanding of the biobehavioral expression of infant explicit memory in three main ways.  First, changes in both frontal and temporal lobe activity are directly involved in explicit memory processing both during event encoding as well as retrieval.  Second, this work provides evidence of a developmentally appropriate and valid pattern of electrophysiology specific to explicit memory processing.  Finally, this study bridges the gap between a classic behavioral task of infant memory (which has been conceptually linked to neuropsychological data) and current developmental cognitive neuroscience.  </p>",
  "description_provenance": [
    "Author Email: kacolo@vt.edu",
    "Advisor Email: kirbydd@vt.edu",
    "Advisor Email: hoff@vt.edu",
    "Advisor Email: smithcl@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:14Z (GMT). No. of bitstreams: 2 Morasch_IRB.pdf: 131635 bytes, checksum: b0af7698a8c37bbda530e949da0f677a (MD5) Morasch_ETD.pdf: 481477 bytes, checksum: 58abc72ef60e29da10a537c7667911b4 (MD5)   Previous issue date: 2007-04-13"
  ],
  "handle": "27065",
  "identifier_other": "etd-04202007-152907",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04202007-152907/",
  "identifier_uri": "http://hdl.handle.net/10919/27065",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Morasch_IRB.pdf",
    "Morasch_ETD.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "explicit memory",
    "EEG",
    "developmental cognitive neuroscience",
    "infant"
  ],
  "title": "Explicit Memory and Brain-Electrical Activity in 10-month-old Infants",
  "type": "Dissertation"
}