{
  "contributor_author": "Nowalk, Thomas J",
  "contributor_committeechair": "Shrum, Judith L.",
  "contributor_committeemember": [
    "McKeon, Donald M.",
    "Murphy, Susan",
    "Rogers, Cosby Steele",
    "Burton, John W."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:15Z",
  "date_adate": "1999-04-23",
  "date_available": "2014-03-14T20:10:15Z",
  "date_issued": "1999-03-01",
  "date_rdate": "1999-04-23",
  "date_sdate": "1999-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The study applies an ethnography of speaking to the study of a bilingual child, with the construct of a frame as the unit of analysis.  The child was observed and tape recorded playing a commercial game in Chinese with her mother, and in English with her father. Both activity frames and conceptual frames were analyzed toward answering (1) what frames were performed during game play  (2) how those frames differed between Chinese and English  (3) what conceptual frames were produced in languages spoken  and (4) how those conceptual frames differed between each language.  In brief, the study applied an ethnographic perspective toward describing how the organization of activity and language compared between both languages, through the play of a single game.    The study discovered that each parent enacted different roles with the daughter during the play of the game.  Whereas the mother, who had previous experience with game, performed an expert-novice role during game play, the father with his lack of experience in playing the game, took a novice-expert stance with respect to the daughter. The activity frames and conceptual frames followed accordingly, with the games in Chinese dominated by frames featuring directing and reporting on the part of the mother.  In contrast, the English games reported the daughter dominating talk with informing and reporting functions of frames.  Of the conceptual frames, Chinese presented game objects and events as changes of state; objects were evaluated according to notions of permission and convention.  Conversely, English conceptualized objects as independent things existing with attributes, and events as discrete objects with defined spans of time.  The study discovered a tight relationship between utterance, its function, and its frame for embedding topic-relationships.  This relationship hints at dual activity-conceptual systems among bilingual children, warranting further attention by educators to integrate three dimensions into language classroom instruction: grammar form,  speech function, and conceptual contents.  As this study demonstrates, bilingual children do much more than talk in two languages.",
  "description_provenance": [
    "Author Email: tnowalk@vt.edu",
    "Advisor Email: dmckeon@vt.edu",
    "Advisor Email: rogersco@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: jshrum@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:15Z (GMT). No. of bitstreams: 8 Chpt5.PDF: 46177 bytes, checksum: 21896da6b51ac65f3cfe5ae84dae699d (MD5) Chpt2.PDF: 97661 bytes, checksum: 553663a244dcafa08b3c04d8e2c12dc5 (MD5) Appendices.PDF: 26789 bytes, checksum: d71d6c6a25ad2ce2018aacd223779596 (MD5) Chpt4.PDF: 132201 bytes, checksum: 1b93f6cc66c707acda92ec6d354c29f7 (MD5) Chpt1.PDF: 55963 bytes, checksum: 158b97151785db42cda18a46c7206be6 (MD5) Bibliography.PDF: 42133 bytes, checksum: 4b28b4ce3d3a53bca812da23cc1709ba (MD5) OPENING.PDF: 25995 bytes, checksum: a7f624b1a8f1aa4b32910f4065025194 (MD5) Chpt3.PDF: 62114 bytes, checksum: 612ec78ddfee5add30cce6fd29459744 (MD5)   Previous issue date: 1999-03-01"
  ],
  "handle": "27071",
  "identifier_other": "etd-042099-102246",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042099-102246/",
  "identifier_uri": "http://hdl.handle.net/10919/27071",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chpt5.PDF",
    "Chpt2.PDF",
    "Appendices.PDF",
    "Chpt4.PDF",
    "Chpt1.PDF",
    "Bibliography.PDF",
    "OPENING.PDF",
    "Chpt3.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "bilingual education",
    "Bilingualism",
    "ethnography",
    "Speech Function",
    "Frames"
  ],
  "title": "Framing Games: an Exploration Into the Speaking Activity of a Chinese-English Bilingual Child",
  "type": "Dissertation"
}