{
  "contributor_author": "Magness, Jacqueline B.",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Stubblefield, Harold W.",
    "McKeen, Ronald L.",
    "White, Orion F. Jr.",
    "Schnittman, Suzanne"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:16Z",
  "date_adate": "1999-04-24",
  "date_available": "2014-03-14T20:10:16Z",
  "date_issued": "1999-04-07",
  "date_rdate": "2000-04-24",
  "date_sdate": "1999-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "(ABSTRACT)  This historical study examines events, institutions, experiences, and relationships in Pinkerton's life for educational significance in developing her extraordinary commitment to the common good.  Data are viewed through the Deweyan lens of education as continuous, participative, and experiential.  Additionally, the study illuminates from Pinkerton's speeches examples of her education of others regarding the need for the common good.  \tComponents of the common good found in the philosophical literature and ego transcendence stemming from a wisdom deep within oneself found in the literature of transpersonal psychology form the conceptual framework upon which this study builds.  The chapters are thematic in scope with the content of each chapter presented chronologically to illuminate a continuous education.  \tThe study revealed an integral interaction of education, spirituality, and history in the development and educative embodiment of Pinkerton's transpersonal commitment to the common good. Pinkerton lived a uniquely structured life as a member of the Congregation of Saint Joseph religious community.  Emphasis on theological reflection, critical reflection, dialogue, and action for change fostered a perspective transformation regarding the role of women religious in the Roman Catholic Church and led to an analysis of systems that bring oppression of other groups and of planet earth.  This awareness eventually led Pinkerton to educate and lobby the U.S. Congress for inclusion of all in the common good.    The study concludes with a metaphor of Pinkerton's life as a whole cloth or seamless garment being constructed from threads of the past, present, and envisioned future.  A dialogical shuttle weaves the threads into vibrant, ever-changing, richly hued designs.  The design increases in complexity and richness guided by radical, responsible freedom.  Such freedom arises from a relationship with a divine wisdom deep within Pinkerton-a relationship through which developed an understanding of the interconnectedness of all things in the common good.  Pinkerton's championship of the common good evolved historically through continuous, participative, experiential engagement with learning.",
  "description_provenance": [
    "Author Email: lightworksinc@erols.com",
    "Made available in DSpace on 2014-03-14T20:10:16Z (GMT). No. of bitstreams: 11 chapter6a.pdf: 49592 bytes, checksum: 53fe93f863aebb5d0e2f3731b4fbd9a0 (MD5) chapter2a.pdf: 131909 bytes, checksum: b177188c1b7b2c0bd9b1f92e59a0e995 (MD5) chapter5a.pdf: 81080 bytes, checksum: 14382cd62c6dd6be7c9e034454a0b968 (MD5) chapter3a.pdf: 88665 bytes, checksum: 4b9fb4012fbd8ca15c842523cb859021 (MD5) appendixaa2a.pdf: 79942 bytes, checksum: ce2a23a42261f1810d9716b46810b42b (MD5) vitajm.pdf: 3806 bytes, checksum: e8d75c2ce9595d91ae9d1ad3770988dd (MD5) chapter4a.pdf: 126162 bytes, checksum: 47e291a3e50fa7307bc8e5b9e46e4dd4 (MD5) chapter1d.pdf: 123464 bytes, checksum: 631fc97a13cbf1605aa5a6b765ca54cb (MD5) referencesaamen.pdf: 54663 bytes, checksum: 193a211567366929257e3acfca35e881 (MD5) frontmattera.pdf: 27817 bytes, checksum: e8221e04bcdac291bbe6803d7a38cd22 (MD5) ADDENDUM.PDF: 1960075 bytes, checksum: 44c9f73060f8ddb37e0c409535ad7d7e (MD5)   Previous issue date: 1999-04-07"
  ],
  "handle": "27076",
  "identifier_other": "etd-042099-225243",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042099-225243/",
  "identifier_uri": "http://hdl.handle.net/10919/27076",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chapter6a.pdf",
    "chapter2a.pdf",
    "chapter5a.pdf",
    "chapter3a.pdf",
    "appendixaa2a.pdf",
    "vitajm.pdf",
    "chapter4a.pdf",
    "chapter1d.pdf",
    "referencesaamen.pdf",
    "frontmattera.pdf",
    "ADDENDUM.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "adult education",
    "common good",
    "social justice",
    "transpersonal psychology",
    "spirituality"
  ],
  "title": "The Genesis and Gestation of a Justice Journey: Catherine Pinkerton, CSJ, Champion of and Educator for the Common Good",
  "type": "Dissertation"
}