{
  "contributor_author": "Davis, Rebecca J.",
  "contributor_committeechair": "Creamer, Donald G.",
  "contributor_committeemember": [
    "Blumenthal, Shelley M.",
    "Salzberg, Cora S.",
    "Muffo, John A.",
    "Janosik, Steven M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:16Z",
  "date_adate": "2000-04-24",
  "date_available": "2014-03-14T20:10:16Z",
  "date_issued": "2000-04-13",
  "date_rdate": "2001-04-24",
  "date_sdate": "2000-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The purpose of this study was to determine how current admission policies and practices at four-year public institutions of higher education in Virginia are implemented to evaluate home school applicants. University administrators, admission officials, and other interested individuals may gain insight into (a) admission policy implementation and informal practices, (b) anticipated policy revisions or new policy developments, (c) evaluative criteria currently being utilized to evaluate applicants, and (d) current home school application and enrollment trends. An interview protocol was developed and used to conduct interviews with the chief admission officer, or designee, at each of the 15 public institutions. Admission policies, admission requirements and guidelines, undergraduate catalogs, view books, and web sites were examined. Each institution's data were analyzed independently.   <p>The major findings revealed that 14 of the 15 public institutions had received home school applications, 13 of the 14 have made offers of admission to home school applicants; however, very few institutions had traced applicant enrollment. Only one institution had a written policy that had been approved through the institution's governance structure. One institution had a verbal agreement and a statement in the undergraduate catalog related to home school applicant's requirements. Three institutions reported recent and on-going discussion and research related to policy development and the evaluation of home school applicants. Five institutions indicated that policy development might be considered should home school applications continue to increase.",
  "description_provenance": [
    "Author Email: redavis2@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: BLUME@vt.edu",
    "Advisor Email: csalzberg@schev.edu",
    "Advisor Email: MUFFO@VT.EDU",
    "Advisor Email: SJANOSIK@VT.EDU",
    "Made available in DSpace on 2014-03-14T20:10:16Z (GMT). No. of bitstreams: 3 Davis5.PDF: 77102 bytes, checksum: 6297e4f7f06ea8a697d8d40e0d4031eb (MD5) Davis4.PDF: 279122 bytes, checksum: 05a65d6a84ac9cce94a79779e16b6ac0 (MD5) Davis1-3.pdf: 89439 bytes, checksum: 098e3a6789b58bb6e0f34231dd3d5e1d (MD5)   Previous issue date: 2000-04-13"
  ],
  "handle": "27078",
  "identifier_other": "etd-04212000-14230017",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212000-14230017/",
  "identifier_uri": "http://hdl.handle.net/10919/27078",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Davis5.PDF",
    "Davis4.PDF",
    "Davis1-3.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "enrollment trends",
    "admission policies",
    "admission practices",
    "home schooling"
  ],
  "title": "Status of Admission Policies and Practices at Four-Year Public Institutions of Higher Education in Virginia Implemented to Evaluate Home School Applicants",
  "type": "Dissertation"
}