{
  "contributor_author": "Miller, Dale Jonathan",
  "contributor_committeechair": "Magliaro, Susan G.",
  "contributor_committeemember": [
    "Dodi, Norman R.",
    "Wildman, Terry M.",
    "Gatewood, Thomas E.",
    "Sellers, James L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:16Z",
  "date_adate": "1999-05-08",
  "date_available": "2014-03-14T20:10:16Z",
  "date_issued": "1999-08-27",
  "date_rdate": "2000-05-08",
  "date_sdate": "1999-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The influences of school reform on the instructional practices of a seventh-grade language arts teacher was the focus of this study.  This study was conducted in three phases: an ethnographic study, a pilot study, and a case study.  The ethnography focused on the restructuring committee's proceedings, yielding information relating to the origin of reform efforts. The pilot study, stemming from the ethnography study, explored the instructional practices within a block scheduling format.  Finally, the case study, investigated the viewpoints of the restructuring efforts as perceived by the participants.  Data sources consisted of observations, formal interviews, previous and current classroom assignments, school reports, student surveys, and field notes.  The data were analyzed, noting changes in curriculum intent, instructional approaches, assessment, and classroom management.  The results of this study suggest that this teachers' success occurred as a results of the school division's posture toward restructuring and the teacher's level of readiness and intense personal desire for change.  The implications for this study suggest that success in reform depends greatly on the approaches used in decision making, the level of teacher preparation and ownership, and the perspectives of all individuals involved.",
  "description_provenance": [
    "Author Email: dmille8219@aol.com, millerphd@hotmail.com",
    "Advisor Email: sumags@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:16Z (GMT). No. of bitstreams: 6 Vita.PDF: 18663 bytes, checksum: d9a56b15ae2ec38586f97fde4b0b460b (MD5) Page.PDF: 2275 bytes, checksum: 534b48ff75420ed04394451b25059179 (MD5) dissertation.pdf: 335174 bytes, checksum: dc8a9d1a4e7cbfa523d1cf26ea5384fc (MD5) abstract.pdf: 3581 bytes, checksum: ada26dad0db4d140ebad49d8ff0f209a (MD5) toc.pdf: 6504 bytes, checksum: f6eaa12a3eaa68d2c032f730200c507a (MD5) appendices.PDF: 4759669 bytes, checksum: 29e168ff61e180dc722ca20d62348dfa (MD5)   Previous issue date: 1999-08-27"
  ],
  "handle": "27074",
  "identifier_other": "etd-042099-173008",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042099-173008/",
  "identifier_uri": "http://hdl.handle.net/10919/27074",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Vita.PDF",
    "Page.PDF",
    "dissertation.pdf",
    "abstract.pdf",
    "toc.pdf",
    "appendices.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "time and learning",
    "language arts",
    "school reform",
    "block scheduling"
  ],
  "title": "How Does a Seventh-Grade Language Arts Teacher Adjust Instructionl Practices when Introduced to a Scheduling Change, Namely Block Scheduling",
  "type": "Dissertation"
}