{
  "contributor_author": "Moore, Budd A.",
  "contributor_committeechair": "Hoffman, Libby R.",
  "contributor_committeemember": [
    "Hohenshil, Thomas H.",
    "Lichtman, Marilyn V.",
    "Rosen, Karen H.",
    "Paritzky, Richard S."
  ],
  "contributor_department": "Counseling Services",
  "date_accessioned": "2014-03-14T20:10:15Z",
  "date_adate": "1999-04-29",
  "date_available": "2014-03-14T20:10:15Z",
  "date_issued": "1999-02-01",
  "date_rdate": "2000-04-29",
  "date_sdate": "1999-04-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "An experimental, randomized, control-group, pretest-postest design was employed in this study to examine the efficacy of the use of two short-term group counseling interventions employing Rational Emotive Behavior Therapy with at-risk adolescents in changing their beliefs, altering their attitude toward school, and moderating behaviors that are problematic in an educational setting.  \tForty-eight subjects were included in this study from an alternative evening high school setting and were assessed in the initial stage of treatment using The Idea Inventory and The Majoribanks Attitude-To-School Inventory. The School Social Behavior Scale was employed at this beginning point to observe these students by teachers and administrators with regard to social competence and anti-social behaviors.  Subjects were selected from a pool of regularly attending students in an alternative high school program and randomly assigned to three groups, one employing REBT concepts and techniques alone, one using REBT concepts and techniques in conjunction with the therapeutic board game, Letâ  s Get Rational, and a control group. The treatment and control group designations were also randomly assigned to the counseling groups. Ten weekly 50 minute group counseling sessions were conducted by two masterâ  s level counselors employing the tenets of REBT with adolescents.  Group participants had the opportunity to learn new interpersonal skills and behaviors that may be helpful to them in staying in school. At the conclusion of the 10 week treatment group sessions, the subjects in the three groups were re-assessed employing the same instruments mentioned before to determine if the activities in the group sessions made significant differences in the rational thinking, attitude to school, and school social behaviors of these at-risk students in an alternative setting.  \tData were analyzed using descritpive statistics in addition to a factorial analysis of variance (ANOVA) to measure the pretest and posttest performance and understanding of the subjects.  Results revealed that the differences in the scores of the treatment groups were significant the REBT group employing the game, Letâ  s Get Rational, contributing to students learning and understanding of the tenets of REBT at the .05 alpha level on the four dependent  variables.  There were no significant differences between genders regarding the four dependent variables, and there was a lack of a significant interaction between the intervention approach taken and the gender of the group member. There was no significant interaction between the gender of the subject and the treatment group placement.  The results from both REBT groups support the efficacy of using the tenets of REBT with school aged populations who are at risk for failure. Appropriate conclusions and recommendations based upon the study findings were made.  Implications for secondary school counselors and those counselors working with at-risk students were delineated.",
  "description_provenance": [
    "Author Email: buddm4cnsl@innernet.net",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: mlichtma@vt.edu",
    "Advisor Email: krosen@vt.edu",
    "Advisor Email: rparitz@vt.edu",
    "Advisor Email: lhoffman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:15Z (GMT). No. of bitstreams: 2 etd1.pdf: 50362 bytes, checksum: 7e36ae4f25500ae06d0ed76d4693fed1 (MD5) etd2.pdf: 681966 bytes, checksum: 2124cc21fcca14b09d37fd482f788dc4 (MD5)   Previous issue date: 1999-02-01"
  ],
  "handle": "27073",
  "identifier_other": "etd-042099-155349",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042099-155349/",
  "identifier_uri": "http://hdl.handle.net/10919/27073",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etd1.pdf",
    "etd2.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Group Counseling Interventions",
    "Beliefs",
    "Efficacy Of Interventions",
    "Rational Emotive Behavior Therapy",
    "Attitudea",
    "Behaviors",
    "At-Risk Adolescents",
    "Outcome"
  ],
  "title": "The Efficacy Of Group Counseling Interventions Employing Short-Term Rational Emotive Behavior Therapy In Altering The Beliefs, Attitudes, And Behaviors Of At-Risk Adolescents",
  "type": "Dissertation"
}