{
  "contributor_author": "Esposito, Christianne L",
  "contributor_committeechair": "Clum, George A. Jr.",
  "contributor_committeemember": [
    "Ollendick, Thomas H.",
    "Finney, Jack W.",
    "Cooper, Lee D.",
    "Jones, Russell T."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:10:16Z",
  "date_adate": "2000-04-27",
  "date_available": "2014-03-14T20:10:16Z",
  "date_issued": "2000-04-13",
  "date_rdate": "2001-04-27",
  "date_sdate": "2000-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of the current study was to investigate the relative importance of diagnostic and psychosocial factors in the prediction of adolescent suicidal ideation.  Previous research has shown both sets of variables to be significantly related to suicidality but has failed to compare their relative efficacy in explaining suicidal ideation.  It was hypothesized that diagnostic variables would afford better prediction of suicidal ideation than psychosocial variables, diagnostic variables would predict suicidal ideation above and beyond psychosocial variables, and psychosocial variables would predict suicidality after controlling for the effects of diagnostic variables.  This study included valid diagnostic and psychosocial variables, employed independent diagnoses as opposed to diagnostic groupings, and utilized continuous measures of psychiatric symptomatology, in series of regression analyses to test these hypotheses.  Results revealed that diagnostic variables, in particular, severity of major depressive disorder symptomatology, afforded the strongest prediction of suicidal ideation, even after controlling  for psychosocial variables.  The comorbid combination of mood disorder and generalized anxiety disorder was found to be the most strongly linked to suicidal ideation of all diagnostic combinations.  However, social support added to the prediction of suicidal ideation above and beyond that offered by all diagnostic variables.  Moreover, the interaction of social support and family environment predicted suicidality above and beyond severity of major depressive disorder symptomatology.  It was concluded that optimal prediction of suicidality is likely obtained through the utilization of continuous measures of psychiatric symptomatology in suicide research. Moreover, suicide research and clinical practice should include examinations of both diagnostic and psychosocial variables to increase prediction and understanding of suicidal ideation in adolescents.",
  "description_provenance": [
    "Author Email: christianne.esposito@brown.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: rtjones@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:16Z (GMT). No. of bitstreams: 1 esposito.PDF: 207266 bytes, checksum: 1e12ba329391065005d4db47ffa47055 (MD5)   Previous issue date: 2000-04-13"
  ],
  "handle": "27077",
  "identifier_other": "etd-04212000-07390025",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212000-07390025/",
  "identifier_uri": "http://hdl.handle.net/10919/27077",
  "publisher": "Virginia Tech",
  "relation_haspart": "esposito.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Suicidal Ideation",
    "Psychiatric Disorder",
    "Adolescents",
    "Psychosocial Variables"
  ],
  "title": "An Examination of the Relative Contribution of Diagnostic and  Psychosocial Factors in the Prediction of Adolescent Suicidal Ideation",
  "type": "Dissertation"
}