{
  "contributor_author": "Kim, Jinhee",
  "contributor_committeechair": "Garman, E. Thomas",
  "contributor_committeemember": [
    "Kratzer, Constance Y.",
    "Leech, Irene E.",
    "Smith, Wanda J.",
    "Wolfle, Lee M."
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2014-03-14T20:10:18Z",
  "date_adate": "2000-04-25",
  "date_available": "2014-03-14T20:10:18Z",
  "date_issued": "2000-04-14",
  "date_rdate": "2001-04-25",
  "date_sdate": "2000-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this research was to examine the effects of workplace financial education on workers' personal finances and work outcomes and determine relationships among financial management (attitudes, knowledge and behaviors), financial well-being, personal finance-work conflict, and work outcomes with data of white-collar workers in an insurance company in mid-western states.  Research questions were (1) What are the profiles of financial attitudes, financial knowledge, financial behaviors, financial well-being, personal finance-work conflict, productivity, absenteeism, work time use, organizational commitment, pay satisfaction, loyalty, and intention to leave?, (2) Do the profiles of financial attitudes, financial knowledge, financial behaviors, and financial well-being differ by the individual characteristics?, (3) Do the profiles of personal finance-work conflict, productivity, absenteeism, work time use, organizational commitment, and pay satisfaction differ by the individual characteristics?, (4) What are the relationships among financial attitudes, financial knowledge, financial behaviors, financial well-being, and work outcomes (productivity, absenteeism, organizational commitment, and pay satisfaction)?, (5) What are the effects of workplace financial education on financial attitudes, financial knowledge, financial behaviors, financial well-being, and work outcomes?, and (6) What are the individual profiles of workplace financial education including participation, value of workplace financial education, reasons for participation and non-participation, desire for financial check-up, and desired topics of workplace financial education? The research design was a pre- and post-assessment survey. A pre-assessment survey was conducted in February and March 1999 before workplace financial education was provided during March 1999. One-and one-half hour workplace financial education workshops were provided at no cost to employer or employees in March 1999. Three months after the workplace financial education was provided, a post-assessment survey was conducted from June through August 1999. A pre-assessment questionnaire was mailed to all 476 workers (five were undeliverable) and 262 responses were utilized for data analysis. In the post-assessment, 482 questionnaires were mailed to workers and five were undeliverable. Usable return rates for the data analysis were 56.0% in the pre-assessment (262/471) and 40.0% in the post-assessment (189/477).  Overall, the respondents in this study were somewhat positive toward financial management, were not knowledgeable on financial matters, and were practicing their financial behaviors fairly well. Objective financial well-being measures showed that workers were in fairly good financial condition but the levels of subjective financial well-being were about the mid-point on a scale, when each score was converted into a percentage. The workers reported that they were very productive, did not miss work days frequently, were highly committed to their organization, and they showed fairly high levels of pay satisfaction. Workers were very hesitant to admit to direct questions asking about whether or not their financial concerns interfered with their responsibilities at the workplace while they were not always able to do normal work even though they were present in the office and spent some work time handling financial matters. Some of individual characteristics influenced financial attitude, financial knowledge, financial behavior, financial well-being, personal finance-work outcomes, and work outcomes.  The tests of the structural equation model showed that worker's personal finances had direct and indirect effects on work outcomes. The financial well-being had a negative effect on personal finance-work conflict. The financial well-being had direct effects on negative work time use and pay satisfaction. The financial well-being had indirect effects through personal finance-work conflict on absenteeism, negative work time use, and organizational commitment. The t-test results did not show the significant effects of workplace financial education on personal finances and work outcomes between the pre- and the post-assessment.",
  "description_provenance": [
    "Author Email: jikim5@vt.edu",
    "Advisor Email: tgarman@vt.edu",
    "Advisor Email: kratzer@vt.edu",
    "Advisor Email: ileech@vt.edu",
    "Advisor Email: wjsmith@vt.edu",
    "Advisor Email: lwolfle@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:18Z (GMT). No. of bitstreams: 8 chapter8_Appen.pdf: 557842 bytes, checksum: f30db86914b53e063694afe8880a61ff (MD5) chapter6_7.pdf: 193477 bytes, checksum: 1916c4460ce4e79c89de624cb21ddcc8 (MD5) chapter5.pdf: 447492 bytes, checksum: ac566adb57a593b3e26530202a91a1bb (MD5) chapter2_3_4.pdf: 347010 bytes, checksum: 92ce3d9a64b4fa6758254b94a200dc06 (MD5) chapter1.pdf: 88531 bytes, checksum: 549ec108bce5069f4a6e1e5e3ad92d11 (MD5) TOC.pdf: 84402 bytes, checksum: 0f2bfa72d77edf6e9765d285fa39b5b9 (MD5) Title.pdf: 28596 bytes, checksum: f46f408293e6742872db5f7d7515e0a2 (MD5) chapter9_ref.pdf: 122410 bytes, checksum: bf26b5aec267816c12e7fa7a0a439d1a (MD5)   Previous issue date: 2000-04-14"
  ],
  "handle": "27080",
  "identifier_other": "etd-04212000-17150023",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212000-17150023/",
  "identifier_uri": "http://hdl.handle.net/10919/27080",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chapter8_Appen.pdf",
    "chapter6_7.pdf",
    "chapter5.pdf",
    "chapter2_3_4.pdf",
    "chapter1.pdf",
    "TOC.pdf",
    "Title.pdf",
    "chapter9_ref.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Personal Finances",
    "financial well-being",
    "workplace financial education",
    "retirement plan"
  ],
  "title": "The Efffects of Workplace Financial Education on Personal Finances and Work Outcomes",
  "type": "Dissertation"
}