{
  "contributor_author": "Schultz, Marc Robert",
  "contributor_committeechair": "Hyer, Michael W.",
  "contributor_committeemember": [
    "Renardy, Yuriko Y.",
    "Morris, Don H.",
    "Plaut, Raymond H.",
    "Loos, Alfred C."
  ],
  "contributor_department": "Engineering Science and Mechanics",
  "date_accessioned": "2014-03-14T20:10:19Z",
  "date_adate": "2003-04-23",
  "date_available": "2014-03-14T20:10:19Z",
  "date_issued": "2003-04-17",
  "date_rdate": "2004-04-23",
  "date_sdate": "2003-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As a new concept for morphing structures, the use of piezoelectric actuators to effect snap-through behavior of simple unsymmetric cross-ply composite laminates is examined. Many unsymmetric laminates have more than one stable room-temperature shape and can be snapped through from one stable shape to another. In this new concept for morphing structures, one or more piezoelectric actuators are bonded to unsymmetric laminates, and are then used to snap the laminate from one shape to another. The actuator would be used to change shape, but would not be required to maintain the shape. Using the Rayleigh-Ritz technique, several models are developed to predict the interaction between the base laminate and the actuator. In particular, the voltage (applied to the actuator) needed to snap the laminate is predicted. The NASA-LaRC Macro-Fiber Composite&174; (MFC&174;) actuator is chosen as the actuator of choice for this work. A laminate is manufactured, an actuator is bonded to the laminate, and experiments are performed. Since the agreement between the initial models and experimental results was not good, the models were revised. Good agreement between the predictions of the revised model and experiment is reached. Suggestions for future research directions are presented.",
  "description_provenance": [
    "Author Email: schultz@vt.edu",
    "Advisor Email: hyerm@vt.edu",
    "Advisor Email: renardy@vt.edu",
    "Advisor Email: dhmorris@vt.edu",
    "Advisor Email: rplaut@vt.edu",
    "Advisor Email: aloos@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:19Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 1302730 bytes, checksum: 3c710f4e761ab1525f859d182ba1c8c9 (MD5)   Previous issue date: 2003-04-17"
  ],
  "handle": "27086",
  "identifier_other": "etd-04212003-153748",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212003-153748/",
  "identifier_uri": "http://hdl.handle.net/10919/27086",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "morphing structures",
    "MFC&174; actuator",
    "unsymmetric laminates",
    "composite materials",
    "snap-through behavior"
  ],
  "title": "Use of Piezoelectric Actuators to Effect Snap-Through Behavior of Unsymmetric Composite Laminates",
  "type": "Dissertation"
}