{
  "contributor_author": "Witcher, Sandra Harmon",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Twiford, Travis W.",
    "Dawson, Christina M.",
    "Kelly, Patricia Proudfoot",
    "Edwards, Jeanne"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:18Z",
  "date_adate": "2001-04-26",
  "date_available": "2014-03-14T20:10:18Z",
  "date_issued": "2001-03-27",
  "date_rdate": "2002-04-26",
  "date_sdate": "2001-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Practitioners are obligated to identify cost-effective, worthwhile practices for improving student learning.  With the current climate of pressure to quickly improve student performance on the Virginia Standards of Learning assessments, the use of Brain  Gym® is an idea that has begun to pique the interest of teachers as an innovative instructional strategy.  The value in conducting this research was to attempt to objectively analyze whether the use of this specific activity-based intervention in an educational setting affects children's skill acquisition.   Intact kindergarten classes from two relatively matched schools within the same southeastern Virginia school division were randomly assigned to the treatment and control groups.  A total of 126 kindergarten students in eight classes were involved.  All of the classes were administered the Phonological Awareness Literacy Screening test in October as part of the system-wide pre-assessment of kindergarten students.  In addition to regular instruction, the treatment group then followed a prescribed set of six Brain Gym® exercises for 8-10 minutes twice each school day until the PALS posttest was given in late spring.  The classroom teachers received in-service training from the researcher to enable them to lead the treatment group in the daily performance of the Brain Gym® exercises.  The treatment began after the completion of PALS pre-testing.  The control group received regular instruction and did not participate in any Brain Gym® exercises.    Following a t-test for differences in previous performance, a four-way analysis of variance was performed on the total PALS scores.  Using the Statistical Package for the Social Sciences and a predetermined alpha level of .05, the four-way ANOVA yielded a significant main effect for previous performance and non-significant main effects for Brain Gym® participation, socioeconomic status, and gender.  A significant interaction effect was found only among Brain Gym® participation, socioeconomic status, and gender.  The data were examined another way using a three-way analysis of covariance.  After adjusting for previous performance, no significant main effects or interaction effects were found across the variables.",
  "description_provenance": [
    "Author Email: sandra.witcher@sps.k12.va.us",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: tdawson@antiochsea.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: jedwards@tcia.net",
    "Made available in DSpace on 2014-03-14T20:10:18Z (GMT). No. of bitstreams: 1 BrainGymPaper.pdf: 261585 bytes, checksum: 18f306084ccd5a444efe001053c9f504 (MD5)   Previous issue date: 2001-03-27"
  ],
  "handle": "27081",
  "identifier_other": "etd-04212001-144531",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212001-144531/",
  "identifier_uri": "http://hdl.handle.net/10919/27081",
  "publisher": "Virginia Tech",
  "relation_haspart": "BrainGymPaper.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Reading",
    "Elementary",
    "Kinesiology"
  ],
  "title": "Effects of Educational Kinesiology, Previous Performance,  Gender, and Socioeconomic Status on  Phonological Awareness Literacy Screening Scores of  Kindergarten Students",
  "type": "Dissertation"
}