{
  "contributor_author": "Liu, Hope Q.",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Holmes, Glen A.",
    "Burton, John K.",
    "Lockee, Barbara B.",
    "Potter, Kenneth R."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:19Z",
  "date_adate": "2003-04-23",
  "date_available": "2014-03-14T20:10:19Z",
  "date_issued": "2003-04-17",
  "date_rdate": "2004-04-23",
  "date_sdate": "2003-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Keller's Personalized System of Instruction (PSI) uses small units of instruction, self-pacing, mastery learning, lectures for motivation, and proctors for immediate feedback. While highly successful in the early 1970's, PSI fell out of favor for a variety of reasons. This developmental dissertation resurrects Keller's system in its purest form and uses PSI for an online Master's program. Using Cold Fusion™  and Dreamweaver™ an online Keller experience was created. Experts of PSI reviewed the product to check for fidelity to Keller's ideas. Formative and summative evaluation showed that this system of instruction is viable for the online environment. Recommendations and implications for future use are discussed.",
  "description_provenance": [
    "Author Email: hopeless@vt.edu",
    "Advisor Email: holmesg@wssu.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: lockee.bb@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:19Z (GMT). No. of bitstreams: 1  liu_dissertation_revised.pdf: 3413173 bytes, checksum: 993d7849bcc709bc53ea4d6b84dc03db (MD5)    Previous issue date: 2003-04-17"
  ],
  "handle": "27087",
  "identifier_other": "etd-04212003-163607",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212003-163607/",
  "identifier_uri": "http://hdl.handle.net/10919/27087",
  "publisher": "Virginia Tech",
  "relation_haspart": "liu_dissertation_revised.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Personalized System of Instruction",
    "Keller",
    "Distance Education"
  ],
  "title": "Development of an Online Course Using a Modified Version of Keller's Personalized System of Instruction",
  "type": "Dissertation"
}