{
  "contributor_author": "Armel, Gregory Russell",
  "contributor_committeechair": "Wilson, Henry P.",
  "contributor_committeemember": [
    "Hagood, Edward Scott Jr.",
    "Brann, Daniel E.",
    "Orcutt, David M.",
    "Hatzios, Kriton K."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:10:18Z",
  "date_adate": "2002-04-30",
  "date_available": "2014-03-14T20:10:18Z",
  "date_issued": "2002-04-19",
  "date_rdate": "2003-04-30",
  "date_sdate": "2002-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Weed management programs in corn typically include herbicides applied both preemergence (PRE) and postemergence (POST) for season-long weed control.  Mesotrione is a new triketone herbicide registered for PRE and POST control of broadleaf weeds in corn.  Triketone herbicides function through inhibition of the enzyme p-hydroxyphenylpyruvate dioxygenase.  Mesotrione applied PRE did not adequately control common lambsquarters (Chenopodium album L.), smooth pigweed (Amaranthus hybridus L.), common ragweed (Ambrosia artemisiifolia L.), or morningglory species (Ipomoea spp.) in conventional tillage corn, but control of these weeds was generally improved in no-till corn.  Mesotrione combinations with acetochlor did not always improve control of broadleaf weeds, but increased control of smooth pigweed and giant foxtail (Setaria faberi Herrm.).  POST applications of mesotrione at 105 g ai/ha controlled most annual broadleaf weeds except common ragweed, but did not control giant foxtail.  The addition of atrazine at 280 g ai/ha to mesotrione, however, improved control of common ragweed.  Tank-mixtures of glyphosate, imazethapyr, or imazethapyr plus imazapyr with mesotrione improved control of giant foxtail in herbicide-resistant corn.  Corn injury was usually low from PRE and POST mesotrione applications in non-genetically modified corn, however, greater injury occurred in glyphosate-resistant varieties.  Corn treated with mesotrione combinations generally yielded similar to corn treated with commercial standards.  Mesotrione applied POST also suppressed the perennial weeds horsenettle (Solanum carolinense L.) and Canada thistle [Cirsium arvense (L.) Scop.].  Additions of atrazine increased the rate of plant tissue necrosis on these perennial weeds as compared to the slower bleaching symptoms associated with mesotrione applied alone.  In general, Canada thistle plants were more susceptible to mesotrione in the rosette stage of growth than when bolting.  Absorption, translocation, and metabolism of 14C mesotrione in Canada thistle was generally low.  However, higher levels of absorption and translocation and lower root metabolism of mesotrione in rosette stage plants compared to bolting stage plants may explain why Canada thistle is more susceptible to mesotrione in the rosette stage of growth.  The changes in symptomology and increased control from mesotrione plus atrazine tank-mixtures is likely due to the interrelationship between the modes of action of atrazine and mesotrione.",
  "description_provenance": [
    "Author Email: garmel@vt.edu",
    "Advisor Email: hwilson@vt.edu",
    "Advisor Email: shagood@vt.edu",
    "Advisor Email: dbrann@vt.edu",
    "Advisor Email: dmorcutt@vt.edu",
    "Advisor Email: hatzios@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:18Z (GMT). No. of bitstreams: 11 greg_10_chapter_8.pdf: 13571 bytes, checksum: b35d9256e5df3b3d69dcf26183cf035a (MD5) greg_08_chapter_6.pdf: 56243 bytes, checksum: 8dc2513b5990bb9eaf088b7bafc49fc3 (MD5) greg_04_chapter_2.pdf: 58128 bytes, checksum: 3d70a69f494d25e3ef7eed6300b711e9 (MD5) greg_03_chapter_1.pdf: 85830 bytes, checksum: 72e067258d59a0ab206f625f9067aa03 (MD5) greg_02_TOC.pdf: 18949 bytes, checksum: faf9f14779422dfe509fee6324a80987 (MD5) greg_05_chapter_3.pdf: 49672 bytes, checksum: 09f540cb63f8481f41d5c59812e3f6ee (MD5) greg_09_chapter_7.pdf: 554003 bytes, checksum: 7b453571d5d0e0815bf0c5b8014f7218 (MD5) greg_11_vitae.pdf: 8513 bytes, checksum: ab71d7694e3856efc1f14064233935b7 (MD5) greg_01_Title_Acknowledgements.pdf: 18119 bytes, checksum: 1403b95395eb815d59072c59a2ad7b99 (MD5) greg_06_chapter_4.pdf: 51347 bytes, checksum: 568171a37919c391d117b30cc02ad939 (MD5) greg_07_chapter_5.pdf: 48695 bytes, checksum: 333d3e676ab35b9c9f5fc2b196ab6673 (MD5)   Previous issue date: 2002-04-19"
  ],
  "handle": "27082",
  "identifier_other": "etd-04212002-105357",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212002-105357/",
  "identifier_uri": "http://hdl.handle.net/10919/27082",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "greg_10_chapter_8.pdf",
    "greg_08_chapter_6.pdf",
    "greg_04_chapter_2.pdf",
    "greg_03_chapter_1.pdf",
    "greg_02_TOC.pdf",
    "greg_05_chapter_3.pdf",
    "greg_09_chapter_7.pdf",
    "greg_11_vitae.pdf",
    "greg_01_Title_Acknowledgements.pdf",
    "greg_06_chapter_4.pdf",
    "greg_07_chapter_5.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "corn weed control",
    "mesotrione",
    "triketone"
  ],
  "title": "Weed management in conventional, no-till, and transgenic corn with mesotrione combinations and other herbicides",
  "type": "Dissertation"
}