{
  "contributor_author": "Thomas, Kaye",
  "contributor_committeecochair": [
    "Sughrue, Jennifer A.",
    "Twiford, Travis W."
  ],
  "contributor_committeemember": [
    "Cross, Lawrence H.",
    "Krill, Cecelia W.",
    "Curcio, Claire Cole Vaught"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:18Z",
  "date_adate": "2002-04-25",
  "date_available": "2014-03-14T20:10:18Z",
  "date_issued": "2002-04-02",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "EDD",
  "description_abstract": "Local school boards are complicated governing bodies wrapped in the political tangle of their legal responsibilities, constituents' wishes, and the educational needs of the children.  How then do some school board chairpersons unravel this political tangle and move their board forward while others become entrapped in the political web? This concept and question lead to the examination of the leadership orientations of local school board chairpersons in the Commonwealth of Virginia. Literature was reviewed concerning school board leadership. The historical perspective of school boards as well as the legal responsibilities granted them as agents of the state were also reviewed. A questionnaire was sent to all Virginia School Board chairs, superintendents, and school board members in which they rated the chairperson on desirable board characteristics. Based on the responses of the three groups of participants, these characteristics were categorized according to the four leadership orientations described by Bolman and Deal (1984). The lack of validity evidence undermined confidence in drawing inferences about identification of a dominant leadership orientation although modestly higher means were reported for the structural and humanistic orientations. The lack of convergent and discriminate validity evidence in this analysis preempted any meaningful test of the theory advanced by this research concerning local school board chairs in Virginia.",
  "description_degree": "EDD",
  "description_provenance": [
    "Author Email: kthomas@caroline.k12.va.us",
    "Advisor Email: jsugh@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: ckrill@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:18Z (GMT). No. of bitstreams: 1 ThomasKaye.PDF: 873511 bytes, checksum: a86f0779969af2cca5aff832aa3558e7 (MD5)   Previous issue date: 2002-04-02"
  ],
  "handle": "27083",
  "identifier_other": "etd-04212002-221836",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212002-221836/",
  "identifier_uri": "http://hdl.handle.net/10919/27083",
  "publisher": "Virginia Tech",
  "relation_haspart": "ThomasKaye.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Leadership Orientation",
    "School Boards",
    "School Governance"
  ],
  "title": "Perceptions Regarding Leadership Orientations of Local School Board Chairpersons in the Commonwealth of Virginia",
  "type": "Dissertation"
}