{
  "contributor_author": "Webb, Nancy Hutchinson",
  "contributor_committeechair": "Kelly, Patricia Proudfoot",
  "contributor_committeemember": [
    "Niles, Jerome A.",
    "Potts, Ann",
    "Linkous, Vicki D.",
    "Barksdale, Mary Alice"
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:10:19Z",
  "date_adate": "2004-04-30",
  "date_available": "2014-03-14T20:10:19Z",
  "date_issued": "2004-04-06",
  "date_rdate": "2004-04-30",
  "date_sdate": "2004-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Becoming a Teacher is a Journey For a Lifetime: The Biography of a Fourth-Grade Writing Teacher  Nancy H. Webb   (ABSTRACT)  The purpose of this study was to see the lifetime literacy growth of one fourth-grade writing teacher, and to view her teaching from inside her classroom. This study follows the journey of an emerging teacher as she grew and developed into a professional educator. This study continues into her classroom to see her as she taught Writersâ   Workshop, inspiring her students to write from their own life experiences. This qualitative study was conducted using participant observation, interviews, and artifacts to gather data. Through qualitative inquiry and thematic analysis, data were interpreted to gain insight into this teacherâ  s life and her teaching. The researcherâ  s reflections, review of the literature, and eighteen years of experience as a teacher, brought a knowledgeable perspective that informed interpretation of the data. This study of Ruthâ  s life and her classroom was an inquiry into the processes of teacher development.  Our view of teachers and their teaching is hidden by the nature of the job they do. Stories of the lives and work of teachers seek to illuminate the professional development of teachers and their teaching (Goodson, 1994; Jalongo & Isenberg, 1995; Schwarz, 2001). By closely studying the path of one teacherâ  s growth and teaching, the growth and teaching of all teachers are illuminated; by â  weav[ing] together the themes throughout one teacherâ  s lifetime, [we] connectâ ¦them to the lives of many different teachersâ   (Jalongo & Isenberg, 1995, p. 28). From this study, experiences of one teacher build and layer as years of teaching experience and professional development mingle together to change and enhance her knowledge of teaching and resulting classroom practice. The fourth-grade students in Ruthâ  s classroom were the recipients of their teacherâ  s literacy experiences that developed over her lifetime.",
  "description_provenance": [
    "Author Email: nwebb@vt.edu",
    "Advisor Email: jniles@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: apotts@vt.edu",
    "Advisor Email: vlinkous@radford.edu",
    "Advisor Email: mbarksda@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:19Z (GMT). No. of bitstreams: 1 TheDissertation!.pdf: 1165691 bytes, checksum: b733b8ec980badc424a09d51238be7d1 (MD5)   Previous issue date: 2004-04-06"
  ],
  "handle": "27090",
  "identifier_other": "etd-04212004-154111",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212004-154111/",
  "identifier_uri": "http://hdl.handle.net/10919/27090",
  "publisher": "Virginia Tech",
  "relation_haspart": "TheDissertation!.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Writers' Workshop",
    "Teacher Development",
    "Teacher Biography"
  ],
  "title": "Becoming a Teacher is a Journey for a Lifetime: The Biography of a Fourth Grade Writing Teacher",
  "type": "Dissertation"
}