{
  "contributor_author": "Vadala, Michael Lawrence",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "McGrath, James E.",
    "Long, Timothy E.",
    "Esker, Alan R.",
    "Davis, Richey M."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:10:22Z",
  "date_adate": "2006-04-28",
  "date_available": "2014-03-14T20:10:22Z",
  "date_issued": "2006-04-18",
  "date_rdate": "2006-04-28",
  "date_sdate": "2006-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Preparation and Functionalization of Macromolecule-Metal and Metal Oxide Nanocomplexes For Biomedical Applications  Michael L. Vadala   Abstract       Copolymer-cobalt complexes have been formed by thermolysis of dicobalt octacarbonyl in solutions of copolysiloxanes. The copolysiloxane-cobalt complexes formed from toluene solutions of PDMS-b-[PMVS-co-PMTMS] block copolymers were annealed at 600-700 °C under nitrogen to form protective siliceous shells around the nanoparticles.  Magnetic measurements after aging for several months in both air and in water suggest that the ceramic coatings do protect the cobalt against oxidation. However, after mechanical grinding, oxidation occurs.  The specific saturation magnetization of the siliceous-cobalt nanoparticles increased substantially as a function of annealing temperature, and they have high magnetic moments for particles of this size of 60 emu g-1 Co after heat-treatment at temperatures above 600 °C.   \tThe siliceous-cobalt nanoparticles can be re-functionalized with aminopropyltrimethoxysilane by condensing the coupling agent onto the nanoparticle surfaces in anhydrous, refluxing toluene.  The concentration of primary amine obtained on the surfaces is in reasonable agreement with the charged concentrations.  The surface amine groups can initiate L-lactide and the biodegradable polymer, poly(L-lactide), can be polymerized directly from the surface. The protected cobalt surface can also be re-functionalized with poly(dimethylsiloxane) and poly(ethylene oxide-co-propylene oxide) providing increased versatility for reacting polymers and functional groups onto the siliceous-cobalt nanoparticles. \tPhthalonitrile containing graft copolysiloxanes were synthesized and investigated as enhanced oxygen impermeable shell precursors for cobalt nanoparticles. The siloxane provided a silica precursor whereas the phthalonitrile provided a graphitic precursor. After pyrolysis, the surfaces were silicon rich and the complexes exhibited a substantial increase in Ms. Early aging data suggests that these complexes are oxidatively stable in air after mechanical grinding.  \tAqueous dispersions of macromolecule-magnetite complexes are desirable for biomedical applications. A series of vinylsilylpropanol initiators, where the vinyl groups vary from one to three, were prepared and utilized for the synthesis of heterobifunctional poly(ethylene oxide) oligomers with a free hydroxy group on one end and one to three vinylsilyl groups on the other end. The oligomers were further modified with carboxylic acids via ene-thiol addition reactions while preserving the hydroxyl functionality at the opposite terminus. The resulting carboxylic acid heterobifunctional PEO are currently being investigated as possible dispersion stabilizers for magnetite in aqueous media.",
  "description_provenance": [
    "Author Email: mvadala@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:22Z (GMT). No. of bitstreams: 1 DissertationFinal.pdf: 6545948 bytes, checksum: fc4f068f585044ceb7da2457cae10d46 (MD5)   Previous issue date: 2006-04-18"
  ],
  "handle": "27098",
  "identifier_other": "etd-04212006-123212",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212006-123212/",
  "identifier_uri": "http://hdl.handle.net/10919/27098",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationFinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "poly(ethylene oxide)",
    "cobalt",
    "phthalonitrile",
    "polysiloxane",
    "nanoparticle"
  ],
  "title": "Preparation and Functionalization of Macromolecule-Metal and Metal Oxide Nanocomplexes for Biomedical Applications",
  "type": "Dissertation"
}