{
  "contributor_author": "Hafez, Shireen Abdelgawad",
  "contributor_committeechair": "Caceci, Thomas",
  "contributor_committeemember": [
    "Freeman, Larry E.",
    "Huckle, William R.",
    "Smith, Bonnie J.",
    "Akers, Robert Michael",
    "Purswell, Beverly J."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:10:20Z",
  "date_adate": "2005-04-22",
  "date_available": "2014-03-14T20:10:20Z",
  "date_issued": "2005-04-20",
  "date_rdate": "2006-04-22",
  "date_sdate": "2005-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p align=justify>     The female reproductive organs are among the few adult tissues in which periodic angiogenesis normally occurs. Pathological angiogenesis can occur in various conditions, such as solid tumors. Vascular endothelial growth factor (VEGF) signaling often represents a critical rate-limiting step in physiological and pathological angiogenesis. This study utilizes development of utero-ovarian vasculature during pregnancy in goats as a model of physiological angiogenesis. Non-pregnant does and does at 4, 7, 10, 13, 16, and 18 weeks of gestation were used.   <p align=justify>     Arteries of the reproductive tract were injected <i>in situ</i> with Microfil<sup>®</sup>. The tracts were fixed, dehydrated, and rendered transparent to reveal the paths of arteries. The ovarian artery was tortuous and lay in close apposition to the uterine tributary of the ovarian vein in all specimens studied. In non-pregnant does, this arrangement may serve as a local utero-ovarian pathway for the corpus luteum (CL) luteolysis at the end of non-fertile estrous cycle. During pregnancy, this arterio-venous arrangement may transfer luteotropic substances from uterus to ovary, which may serve in maternal recognition of pregnancy and fit the fact that the goat is CL dependent throughout gestation. In some cases of triplets, the size of the uterine branch of the ovarian artery was equal to or even larger than that of its parent artery and/or the ipsilateral uterine artery; and the vaginal artery contributed a connecting branch to the uterine artery. These physiological adaptations of the ovarian and/or vaginal arteries correlate well with the increasing nutrient demands of the growing multiple fetuses.  <p align=justify>     In a second experiment, the vasculature of the uterus and ovaries was injected <i>in situ</i> with a mixture of Batson's No.17<sup>®</sup> and methyl methacrylate and then processed for observation by SEM. The microvasculature differed between non-pregnant and pregnant does, and with advancing gestation. We concluded that goats possess a <i>multivillous</i> type placenta. Capillary sinusoids and crypts on the fetal surface of the caruncle may compensate for the negative effect of the increased interhemal distance. Intussusceptive angiogenesis should be considered as equally possible and important mechanism as sprouting angiogenesis during placental development. Capillary diameters increased significantly during pregnancy especially after 4 weeks. Capillary density index was 66.8, 68.7, 55.5, 63.5, 70.1, 70.4, 64.5 percent in non-pregnant, 4, 7, 10, 13, 16, and 18 weeks of pregnancy, respectively. In the ovary, coiling of the ovarian branch of the ovarian artery around the ovarian tributary of the ovarian vein was observed. This may represent a local channel required for product transport from ovarian vein to ovarian artery and might have a role in regulating blood pressure to various ovarian structures.  <p align=justify>     Immunolocalization of VEGF was performed as a third experiment. Immunostaining was observed in cyto- trophoblasts, maternal epithelial tissues, and vascular endothelium and smooth muscle, but not in binucleate giant cells or connective tissue. No apparent differences were observed in intensity and pattern of VEGF staining associated with advancing gestation. Luteal and follicular cells, and endothelium and smooth muscles of the ovarian vasculature positively stained. Patterns and intensity of staining of VEGF suggest that the fetus is directing its own survival by producing growth factors affecting fetal and maternal tissues. VEGF may have a role in growth and differentiation of cytotrophoblasts, as well as, development and maintenance of CL.   <p align=justify>     In the fourth experiment, the sequential expression of VEGF and its receptors (fms-like tyrosine kinase, Flt-1 and kinase-insert domain-containing receptor, KDR) was measured using real-time quantitative PCR. Targets were detected in all studied tissues; however, levels of expression differed according to the stage of pregnancy. Expression of VEGF and its receptor mRNAs increased with advancing pregnancy, which correlates with the expansion of vasculature during pregnancy. Differences in the time-courses of the expression of Flt-1 and KDR mRNAs during pregnancy suggest that each receptor plays a different role in the angiogenic process.   <p align=justify>     As an application of our model of angiogenesis, we tested the effect of swainsonine (active compound of locoweed and a potential anti-cancer drug) on the process. Does treated with swainsonine were euthanized at 7 and 18 weeks. No significant differences were found in sinusoidal diameters in treated does at 7 weeks, but a decrease in capillary density index was noted. In the ovary, focal avascular areas were observed in the corpus luteum of swainsonine-treated does at 7 weeks of pregnancy. Swainsonine caused great distortion in the uterine and ovarian vasculature at 18 weeks. A decrease in intensity of the immunoreactivity to VEGF antibody was observed in tissues from swainsonine-treated does at 7 and 18 weeks. There was no substantial effect of swainsonine on the expression of VEGF and its receptors' mRNAs in any of the studied tissues (except in the left ovary, where it had an inhibitory effect) at 7 weeks of pregnancy, but it had an inhibitory effect at 18 weeks. Demonstration of swainsonine's potential to negatively affect vascular development and suppress genes likely involved in angiogenesis at critical stages of blood vessel proliferation lends credibility to its potential as anti-cancer drug.",
  "description_provenance": [
    "Author Email: shafez@vt.edu",
    "Advisor Email: lfreeman@vt.edu",
    "Advisor Email: elitist@vt.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: bjsmith@vt.edu",
    "Advisor Email: rma@vt.edu",
    "Advisor Email: purswell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:20Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 35808838 bytes, checksum: dd5939d02f2c914ae641e9909d898c14 (MD5)   Previous issue date: 2005-04-20"
  ],
  "handle": "27091",
  "identifier_other": "etd-04212005-092936",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212005-092936/",
  "identifier_uri": "http://hdl.handle.net/10919/27091",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Microvascular corrosion casting",
    "Tissue clearing technique",
    "Angiogenesis",
    "Placenta",
    "Uterine vessels",
    "VEGF",
    "Goats",
    "Ovarian vessels"
  ],
  "title": "Advanced Studies in Veterinary Anatomy: Angiogenesis in Caprine Reproductive Organs of Non-Pregnant and Pregnant Normal and Swainsonine-Treated Does",
  "type": "Dissertation"
}