{
  "contributor_author": "Talbot, Marianne B.",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Morris, Linda E.",
    "Belli, Gabriella M.",
    "Klunk, Clare D.",
    "Bradley, Karen"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:22Z",
  "date_adate": "2006-05-10",
  "date_available": "2014-03-14T20:10:22Z",
  "date_issued": "2006-04-13",
  "date_rdate": "2006-05-10",
  "date_sdate": "2006-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Marianne Talbot Abstract</title></title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>  </p> <p>Addressing the comprehensive needs of individuals with brain injuries is a growing concern in brain injury rehabilitation as well as evaluating the efficacy of these conventional therapeutic modalities: cognitive rehabilitation, and physical, occupational, and speech therapies. Therapeutic dance/movement has not been an integral part of these core services. I have observed its potential, however, during the past thirteen years while providing this intervention to individuals with brain injuries. </p> <p>The focus of this dissertation was to gain a better understanding of the dynamics of a therapeutic dance/movement intervention for individuals with brain injuries by comparing it to conventional physical therapy. Physical therapy, given its longevity in providing rehabilitative services to individuals with brain injuries, afforded a means by which to more systematically explore therapeutic dance/movement. Five individuals with brain injuries were observed and analyzed as they participated in five weekly therapeutic dance/movement sessions and five weekly physical therapy sessions. Laban Movement Analysis (LMA) was used as the observation and analytic tool for the purpose of elucidating similarities and differences between the two interventions in relation to the five case studies. </p> <p>Two questions guided the inquiry: (a) What are the similarities and differences between a physical therapy intervention and a dance/movement intervention? and (b) What are the dynamics of a therapeutic dance/movement intervention? </p> <p>Findings revealed that the physical therapy intervention focused specifically on body level connectivity and single joint action movement from a <em>Body </em> perspective. In comparison, the dance/movement intervention incorporated body level connectivity in addition to the dynamics of <em>Breath/Core Support </em>and <em>Grounding </em>, <em>Effort-Life </em>, <em>Spatial Intent </em>, and Aspects of <em> Shape </em>, providing the spectrum of <em>Body </em>, <em>Effort </em>, <em>Space </em>, and <em>Shape </em> ( <em>BESS </em>) components in harmony with the <em>Movement Themes: Whole/Part, Inner/Outer, Function/Expression, Exertion/Recuperation, </em>and <em> Mobility/Stability </em>. The dance/movement intervention imparted an integrative mind-body approach to learning about one's Inner and Outer self and one's ability to cope with and connect to one's environment. </p> Knowledge was added to the current literature at an opportune time in the brain injury rehabilitation field. Rehabilitation professionals are recognizing the need to transform current assumptions regarding the essential aspects of brain injury rehabilitation and seek additional non-medical model approaches to rehabilitation. This study offers a therapeutic modality along with a viable measurement tool that has the potential for meeting this need. Recommendations for future research are offered.</body> </html>",
  "description_provenance": [
    "Author Email: NRRFboots@aol.com",
    "Advisor Email: linda_morris11495@yahoo.com",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: cdklunk@vt.edu",
    "Advisor Email: kbradley@wam.umd.edu",
    "Made available in DSpace on 2014-03-14T20:10:22Z (GMT). No. of bitstreams: 1 Talbot2.pdf: 105276208 bytes, checksum: 584f06886b0474e8acf81a065f2ed9ad (MD5)   Previous issue date: 2006-04-13"
  ],
  "handle": "27097",
  "identifier_other": "etd-04212006-105758",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212006-105758/",
  "identifier_uri": "http://hdl.handle.net/10919/27097",
  "publisher": "Virginia Tech",
  "relation_haspart": "Talbot2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Dance/Movement",
    "Bodily Kinesthetic",
    "Rehabilitation",
    "Physical Therapy",
    "Laban Movement Analysis",
    "Brain Injury"
  ],
  "title": "The Dynamics of a Therapeutic Dance/Movement Intervention for Individuals with Brain Injuries: Comparison with Physical Therapy Using Laban Movement Analysis",
  "type": "Dissertation"
}