{
  "contributor_author": "Wiles, Kenton Broyhill",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeecochair": "Wilkes, Garth L.",
  "contributor_committeemember": [
    "Riffle, Judy S.",
    "Baird, Donald G.",
    "Long, Timothy E."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:10:21Z",
  "date_adate": "2005-04-26",
  "date_available": "2014-03-14T20:10:21Z",
  "date_issued": "2005-04-15",
  "date_rdate": "2005-04-26",
  "date_sdate": "2005-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The results described in this dissertation have demonstrated several alternative proton exchange membranes (PEM) for hydrogen-air and direct methanol fuel cells (DMFC) that perform as well or better than the state of the art Nafion perfluorosulfonic acid membrane.  Direct aromatic nucleophilic substitution polycondensations of disodium 3,3â  S-disulfonate-4,4â  S-difluorodiphenylsulfone (SDFDPS), 4,4â  S-difluorodiphenylsulfone (DFDPS) (or their chlorinated analogs, SDCDPS, DCDPS) and 4,4â  S-thiobisbenzenethiol (TBBT) in the presence of potassium carbonate were investigated.  Electrophilic aromatic substitution was employed to synthesize the SDFDPS or SDCDPS comonomers in high yields and purity.  High molecular weight disulfonated poly(arylene thioether sulfone) (PATS) copolymers were easily obtained using the SDFDPS monomers, but in general, slower rates and a lower molecular weight copolymer was obtained using the analogous chlorinated monomers.   Tough and ductile membranes were solution cast from N,N-dimethylacetamide for both series of copolymers.  The degrees of disulfonation (20-50%, PATS 20-50) were controlled by varying the ratio of disulfonated to unsulfonated comonomers.  Composite membranes were prepared by homogeneous solution blending the copolymers with phosphotungstic acid (PTA) in dimethylacetamide (DMAc).  The composite PATS membranes exhibited moderate PTA molecule water extraction after acidification treatments performed at either room or boiling temperatures.  The membranes containing HPA showed improved conductivity at high temperatures (120 Â¢XC) and low relative humidities when compared to the pure copolymers.   Molecular weight of the copolymers plays a critical role in the overall copolymer physical behavior.  It is well known that molecular weight has an enormous impact on practically all of the physical properties of polymeric systems.   This dissertation discusses the influence of molecular weight on the characteristics of a specific family of PEM PATS copolymers.  This study elucidated that the lower molecular weight materials did indeed behave differently than the higher molecular weight copolymers.  Specifically, the water uptake and permeability to methanol decreased with increasing molecular weight.  Furthermore, the fully hydrated mechanical properties also improved with molecular weight.    \tThe synthesis and fabrication of 45 mole percent disulfonated poly(arylene ether phenyl phosphine oxide diphenyl sulfone) terpolymer-heteropolyacid (HPA) composite membranes and membrane electrode assemblies were chosen for detailed investigation.  A series of 45 mole percent disulfonated biphenol-based poly(arylene ether phenyl phosphine oxide diphenyl sulfone) terpolymers (BPSH45-PPO) were also synthesized by nucleophilic aromatic substitution polymerizations.  The level of disulfonation was constant at 45 mole percent providing a compromise between high conductivity at low humidity and reasonable mechanical properties in liquid water.  The amounts of 4,4Â¡Â¦-difluorodiphenyl phenyl phosphine oxide comonomer incorporated into the terpolymer backbone were precisely controlled from 0-50 mole percent relative to the 4,4Â¡Â¦-dihalodiphenyl sulfone.  Phosphine oxide moieties were employed to enhance the interactions with the PTA relative to the pure copolymer.  The composite BPSH45-PPO membranes exhibited lower HPA molecule water extraction after acidification at room and boiling temperatures, which was ascribed to the strong hydrogen and polar interactions between the phosphine oxide moiety and functional groups on the HPA.  The membranes containing HPA displayed improved conductivity at high temperatures and low relative humidities when compared to the pure terpolymer samples.  The increase of proton conductivity was attributed to the water retention characteristics of the HPA molecules, which allowed enhanced mobility of the protons even at lower humidification levels, providing superior hydrogen-air fuel cell performance.   The effect of hexafluoroisopropylidene bisphenol (6FBP) incorporation into 45 mole percent disulfonated poly(arylene ether sulfone) copolymers was investigated.  This novel series of directly disulfonated poly(arylene ether sulfone) copolymers with various mole ratios of the 6FBP were synthesized in high molecular weight.  The levels of fluorination within the statistically random copolymer architecture were varied from 0-100 mole percent using 6FBP and the correct stoichiometric amount of 4,4Â¡Â¦-biphenol.  The 6FBP monomer was introduced to decrease the water swelling and improve bonding characteristics with Nafion-bonded electrodes.  Indeed, water uptake decreased with increasing incorporation of the 6FBP monomer into the terpolymer.  This suggested that the hydrophobic fluorinated material aided in water repulsion of the system.  Proton conductivity decreased slightly as the amount of fluorination increased, which was interpreted to be due to the decrease in the ion-exchange capacity.  High temperature hydrogen/air fuel cell experiments indicated better Nafion-bonded electrode adhesion for the partially fluorinated materials, as depicted by high temperature (120 Â¢XC) and low humidity (50% RH) hydrogen-air fuel cell performance.   \tInvestigations into polymeric electromechanical transducers were based on poly(arylene sulfone) ion-exchange membranes bonded between two conductive metal layer electrodes.  Imposed deformations and small electric fields allowed similar explorations of both sensing and actuation applications.  These copolymers produced larger sensitivities than the benchmark Nafion systems, which was interpreted as being due to their higher hydrated moduli.  Methodologies for better defining the morphology of the electrodes were identified to enhance the capacitance and effective interfacial area of the conductive electrodes. The new procedures afforded major improvements to performance and transduction.  Transducer actuation at lower frequencies was improved by employing a new direct assembly electrode fabrication technique that suggested a strong correlation between the capacitance and charge motion.",
  "description_provenance": [
    "Author Email: kwiles4@yahoo.com",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:21Z (GMT). No. of bitstreams: 1 Kenton_Broyhill_Wiles_Dissertation.pdf: 3317785 bytes, checksum: 7d4e0f0c0884229bf74e5721d6f45aec (MD5)   Previous issue date: 2005-04-15"
  ],
  "handle": "27096",
  "identifier_other": "etd-04212005-215145",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212005-215145/",
  "identifier_uri": "http://hdl.handle.net/10919/27096",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kenton_Broyhill_Wiles_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Poly(arylene thioether sulfone)",
    "Transducer",
    "Proton Exchange Membrane",
    "Phosphine Oxide",
    "Fluorine",
    "Membrane Electrode Assembly",
    "Poly(arylene ether sulfone)",
    "Fuel Cell",
    "Nafion"
  ],
  "title": "HIGH PERFORMANCE DISULFONATED POLY(ARYLENE SULFONE) CO- AND TERPOLYMERS FOR PROTON EXCHANGE MEMBRANES FOR FUEL CELL AND TRANSDUCER APPLICATIONS: SYNTHESIS, CHARACTERIZATION AND FABRICATION OF ION CONDUCTING MEMBRANES",
  "type": "Dissertation"
}