{
  "contributor_author": "Burnette, Mark A",
  "contributor_committeechair": "Salmon, Richard G.",
  "contributor_committeemember": [
    "Sughrue, Jennifer A.",
    "Alexander, M. David",
    "Inman, Deborah"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:20Z",
  "date_adate": "2005-04-26",
  "date_available": "2014-03-14T20:10:20Z",
  "date_issued": "2005-04-08",
  "date_rdate": "2005-04-26",
  "date_sdate": "2005-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Abstract <p>The primary purpose of this study is to assist with the determination of the legality of the new policy adopted by the Commonwealth of Virginia of deducting federal revenues from the Basic Aid finance formula for public education. First, this study involves a detailed review of the case law pertaining to the non-supplant issue with targeted federal funds. Second, a brief description of the funding models of the time utilized by the states involved in such litigation are provided in order to determine similarities and differences to various state funding systems, including the venerable foundation model utilized by Virginia. <p>The study provides a historical analysis of the legislation involved in the federal support of public education and the introduction of the non-supplant issue into the language of the federal legislation. Historical documents including Constitutional acts and amendments, statutes, and publications of early education scholars are reviewed.  <p>In order to understand the subtlety of the non-supplant issue, the structures of the state systems of school finance that have had the issue of non-supplant litigated are described in some detail. The review of law includes cases retrieved from both Westlaw and Lexis Nexis databases and those cases cross-referenced with landmark decisions.  <p>The research in this document will provide comparisons between the case law and the current problem in the Commonwealth. Insight into the legal ramifications of the non-supplant issue and the potential implications that deducting federal revenues from the Basic Aid formula may present will be provided. The consequences for failure to adhere to federal policy regarding the state funding of public education are portrayed in the case law decisions. Further, this research will provide an opinion as to whether the current policy of deducting federal revenues from the Basic Aid formula utilized in Virginia will withstand a legal challenge under the non-supplant language imbedded in federal education grants-in-aid.",
  "description_provenance": [
    "Author Email: maburnet@ccpsd.k12.va.us",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: jsughrue@fau.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: dinman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:20Z (GMT). No. of bitstreams: 4 Supplanting_Dissertation_Final_Rev_1.PDF: 566983 bytes, checksum: 472a06fba356841065f6d4ccbc37351e (MD5) Title_page.PDF: 2879 bytes, checksum: 932e1448398e1a3bf73e5e9817fb2fbd (MD5) Abstract.PDF: 4861 bytes, checksum: d8899e5f5c3ac981d9878e0013834969 (MD5) Acknowledgements.PDF: 5049 bytes, checksum: d38d10e2a5e1f7f68d6867c3c5289be4 (MD5)   Previous issue date: 2005-04-08"
  ],
  "handle": "27095",
  "identifier_other": "etd-04212005-154751",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212005-154751/",
  "identifier_uri": "http://hdl.handle.net/10919/27095",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Supplanting_Dissertation_Final_Rev_1.PDF",
    "Title_page.PDF",
    "Abstract.PDF",
    "Acknowledgements.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Public Education",
    "Non-Supplant",
    "Federal Legislation"
  ],
  "title": "The Evolution of the Non-Supplant Issue in the Federal Funding of Public Education: The Policy in Virginia and its National Implications",
  "type": "Dissertation"
}