{
  "contributor_author": "Brenden, Travis Owen",
  "contributor_committeecochair": [
    "Murphy, Brian R.",
    "Hallerman, Eric M."
  ],
  "contributor_committeemember": [
    "Smith, Eric P.",
    "Orth, Donald J.",
    "Stauffer, Dean F."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:10:20Z",
  "date_adate": "2005-04-26",
  "date_available": "2014-03-14T20:10:20Z",
  "date_issued": "2005-04-01",
  "date_rdate": "2010-10-13",
  "date_sdate": "2005-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this research was to evaluate current management strategies for the New River, Virginia, muskellunge Esox masquinongy fishery, which is the premier muskellunge fishery in the state.  The primary objectives were to evaluate potential benefits and angler support for more restrictive harvest regulations and to quantify habitat selection at multiple spatial scales.  A secondary objective was to develop an alternative procedure for testing differences in muskellunge condition from relative weight Wr data that incorporates uncertainty regarding the accuracy of the standard weight equation and that is based on derived statistical properties of the Wr index.  Abundance of memorable-length (³1,070 mm) muskellunge was predicted to increase with minimum length limits of 914, 1,016, and 1,143 mm.  Although yield per recruit would decline under a 1,143-mm minimum length limit, it was predicted to remain fairly stable at length limits of 914 and 1,016 mm due to fast growth rates of young fish.  Even though most anglers defined trophy muskellunge to be in excess of 1,016 mm, angler support for length limits in excess of 1,000 mm was low.  Habitat variables that were most strongly related to muskellunge habitat selection were measures of patch shape complexity and water depth.  Increased river discharge was found to significantly affect muskellunge habitat use and selection, with fish abandoning deeper open-water habitats and moving to shallower areas closer to the shoreline during periods of high discharge.  As for the secondary objective, a new statistical test (R-test) was developed that can be used to test for differences in Wr between and within fish stocks.  Comparison with other statistical tests indicated that the R test provides more conservative results than traditional statistic procedures, and that substantial variability in standard weight equations will make it more difficult to detect statistical differences.  Management recommendations for the New River muskellunge fishery include increasing the minimum length limit to approximately 965 to 1,067 mm and limiting the stocking of muskellunge only to those areas with sufficient juxtaposition of shallow- and deep-water habitat patches.",
  "description_provenance": [
    "Author Email: tbrenden@umich.edu",
    "Advisor Email: murphybr@vt.edu",
    "Advisor Email: epsmith@vt.edu",
    "Advisor Email: ehallerm@vt.edu",
    "Advisor Email: dorth@vt.edu",
    "Advisor Email: dstauffe@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:20Z (GMT). No. of bitstreams: 1 Final_Dissertation.pdf: 5074861 bytes, checksum: 6f9c2ae8ec9fb184e992b0f7ac284b4a (MD5)   Previous issue date: 2005-04-01"
  ],
  "handle": "27093",
  "identifier_other": "etd-04212005-131251",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212005-131251/",
  "identifier_uri": "http://hdl.handle.net/10919/27093",
  "publisher": "Virginia Tech",
  "relation_haspart": "Final_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "harvest regulations",
    "habitat selection",
    "relative weight",
    "New River",
    "muskellunge",
    "Esox masquinongy"
  ],
  "title": "Evaluation of Current Management Strategies for the New River, Virginia, Muskellunge Fishery:  Modeling the Effect of Alternative Harvest Regulations and Habitat Selection",
  "type": "Dissertation"
}