{
  "contributor_author": "Ollilainen, Anne Marjukka",
  "contributor_committeecochair": [
    "Rothschild, Joyce",
    "Calasanti, Toni M."
  ],
  "contributor_committeemember": [
    "Parker-Gwin, Rachel",
    "Hult, Karen M.",
    "Fuller, Theodore D.",
    "Flora, Cornelia Butler"
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:10:23Z",
  "date_adate": "1999-04-23",
  "date_available": "2014-03-14T20:10:23Z",
  "date_issued": "1999-04-19",
  "date_rdate": "2000-04-23",
  "date_sdate": "1999-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examines how gender as a socio-cultural construction factors in the currently occurring change from a bureaucratic work organization to more interactive and team-based structures.  Informed by Joan Ackerâ  s theory of gendered organization, I identify processes that produce and reproduce gendered relationships of domination and subordination in self-managing teams, despite the premise that self-managing teams foster more egalitarian workplace relations. In a multiple case study, using in-depth interviews and participant observation, I examine four currently functioning, mixed-sex, self-managing teams in two service sector organizations and one manufacturing plant. The objective of the study is to uncover how and in what ways gender is present in teamwork and shapes various routine work processes.   <p> The so-called â  gendered processesâ   I found to occur in the four case-study teams include a gender division of team tasks that required women to perform clerical work even when teams were supposed to implement cross-functional task sharing. Gendered processes also took place through interaction and team metaphors of â  familyâ   and â  football teamâ  . I illustrate how the construction of emotions in teamwork marginalized womenâ  s contributions and how women and men consciously employed strategies to fit into expectations of gender-appropriate behavior. Despite these gender divisions, I suggest that one possible way for teams to improve organizational gender equality is that they emphasize non-hierarchical spatial arrangements. Finally, although I found gendered processes in all four teams, the ways in which gender shaped teamwork varied according to the organizational status position of a team.  Also self-management proved the most comprehensive in teams that functioned at the higher organizational levels. <p> I thank the Finnish Work Environment Fund, The Foundation for Economic Education, and Ella and Georg Ehrnroothâ  s Foundation, all of Helsinki, Finland, for their financial support towards the completion of this dissertation.  This study was also supported by dissertation grants from Eemil Aaltonenâ  s Foundation of Tampere, Finland and Oskar Ã flundâ  s Foundation of Espoo, Finland, for which I am grateful.",
  "description_provenance": [
    "Author Email: mollilainen@weber.edu",
    "Advisor Email: joycer@vt.edu",
    "Advisor Email: toni@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:23Z (GMT). No. of bitstreams: 8 CH1.pdf: 42322 bytes, checksum: 662a51016057befd6fd08c2a4b6d16ad (MD5) CH2.pdf: 37369 bytes, checksum: 7b72f353c9fe111e09780e1585a4992f (MD5) CH5.pdf: 94424 bytes, checksum: 5067da261cc1f0f31178912fe39e73b2 (MD5) BACK.pdf: 44083 bytes, checksum: 7d4e839382a4a80108e656bbe2ef0f29 (MD5) CH6.pdf: 27206 bytes, checksum: 47e79818f62eba93e837bdc859fb2247 (MD5) FRONT.pdf: 13659 bytes, checksum: 34a6a0840822bec72be8f5f17d3c44ed (MD5) CH4.pdf: 152208 bytes, checksum: f431f0ea5e45f5486d455d52b3d01039 (MD5) CH3.pdf: 84785 bytes, checksum: a8f70cea393f10a7559034c8b3b959d2 (MD5)   Previous issue date: 1999-04-19"
  ],
  "handle": "27105",
  "identifier_other": "etd-042199-143559",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042199-143559/",
  "identifier_uri": "http://hdl.handle.net/10919/27105",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CH1.pdf",
    "CH2.pdf",
    "CH5.pdf",
    "BACK.pdf",
    "CH6.pdf",
    "FRONT.pdf",
    "CH4.pdf",
    "CH3.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Self-Managing Teams",
    "Gender",
    "Organizations"
  ],
  "title": "Gendered Processes in Self-Managing Teams: A Multiple Case Study",
  "type": "Dissertation"
}