{
  "contributor_author": "Roslewicz, Elizabeth A.",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Stubblefield, Harold W.",
    "White, Orion F. Jr.",
    "McKeen, Ronald L.",
    "Schnittman, Suzanne"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:23Z",
  "date_adate": "1999-04-24",
  "date_available": "2014-03-14T20:10:23Z",
  "date_issued": "1999-04-07",
  "date_rdate": "2000-04-24",
  "date_sdate": "1999-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT   Lucretia Coffin Mott, in an era filled with events the significance of which reverberates today, spoke publicly about issues of societal and ethical concern.  This study focuses on her work as a nineteenth-century female Quaker minister who through public speaking educated adults about the following: abolition of slavery, rights of women, and peaceful ways to address injustice.  Separate chapters explore each of these three vital issues.  Lucretia Mott ranks as a pioneer female public speaker.  At a time that barred women's speaking in public, she spoke about significant issues.  Her speaking admitted her to the company of American women who pioneered in speaking publicly.  These endeavors to speak to \"promiscuous\" audiences, those comprised of adult males and females, also admitted her to the company of women who endured criticism, insults, and peril.  Through a process of education, these women changed history and shaped culture.     \tLucretia Mott's Quaker perspective, her way with spoken words, and her womanhood distinguished her work as an educator in public forums and settings that ranged from religious meetings to the lyceum and conventions called to consider issues of national import.  What could have prepared this Quaker minister--active in public domains for more than fifty years--for a place among the pioneers who advocated and practiced the right of women to speak purposefully in public forums?     Lucretia Mott's commitment to the Society of Friends enabled her to be a pathfinder both in education and on important issues.  Therefore, Chapter Two presents an exploration of Quaker history, spirituality, and practices to inform for purposes of historic educational analysis and interpretation.  References in historical works to noteworthy innovations that originated from efforts by Quakers in American society and to successes in business sparked this inquiry.  \tThis study examined her speeches to see how they reflected Quaker principles and practices and her work as a pioneer public speaker who educated about societal and ethical issues.  The study concludes that her work was energized because she knew her history, she questioned her world and she lived her faith.",
  "description_provenance": [
    "Author Email: LIGHTWORKSINC@EROLS.COM",
    "Made available in DSpace on 2014-03-14T20:10:23Z (GMT). No. of bitstreams: 10 chapter4.pdf: 166936 bytes, checksum: c0f6d5e5094dd62bd7c037ac16dd4202 (MD5) vitaear2.pdf: 3892 bytes, checksum: 3be29e09725c8744623fad729b3c179a (MD5) frontmatterear.pdf: 33714 bytes, checksum: 8587ca3508501320d08e9a7916b3169f (MD5) appendix.pdf: 29584 bytes, checksum: e81b26218af7ba2b3794177b66e8b5ee (MD5) chapter6a.pdf: 65515 bytes, checksum: 2877d1f5c9952c5a639a89b5558de167 (MD5) chapter5a.pdf: 106944 bytes, checksum: 75fc4ae501c980c6aafadafe0258524c (MD5) chapter3a.pdf: 199060 bytes, checksum: d8736acd9e206075a9d547c9b7388b67 (MD5) chapter2a.pdf: 242872 bytes, checksum: 85173c9e8d3087a63f24aaceff9073ce (MD5) chapter1aa2.pdf: 201154 bytes, checksum: 45299af296895bece2508bab7e625922 (MD5) ADDENDUM.PDF: 1209272 bytes, checksum: 3c7622beae906045c1e2e04a47f610bf (MD5)   Previous issue date: 1999-04-07"
  ],
  "handle": "27104",
  "identifier_other": "etd-042199-022852",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042199-022852/",
  "identifier_uri": "http://hdl.handle.net/10919/27104",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chapter4.pdf",
    "vitaear2.pdf",
    "frontmatterear.pdf",
    "appendix.pdf",
    "chapter6a.pdf",
    "chapter5a.pdf",
    "chapter3a.pdf",
    "chapter2a.pdf",
    "chapter1aa2.pdf",
    "ADDENDUM.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "public speaking",
    "spirituality",
    "societal issues",
    "Quaker",
    "adult education"
  ],
  "title": "Educating Adults Through Distinctive Public Speaking: Lucretia Mott, Quaker Minister",
  "type": "Dissertation"
}