{
  "contributor_author": "Robertson, Peggie Johnson",
  "contributor_committeecochair": [
    "Parks, David J.",
    "Curcio, Claire Cole Vaught"
  ],
  "contributor_committeemember": [
    "Parson, Stephen R.",
    "Richards, Robert R.",
    "Saunders, Margaret B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:23Z",
  "date_adate": "1999-04-27",
  "date_available": "2014-03-14T20:10:23Z",
  "date_issued": "1999-02-08",
  "date_rdate": "2000-04-27",
  "date_sdate": "1999-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Do school principals use basic time-management practices as recommended in the literature, that are designed to help them focus on important tasks? Or do they allow the unrelenting pace of the job to dictate how they use their time? A systematic random sample of 400 United States principals representing the 27,000 members of the National Association of Elementary School Principals (NAESP) participated in this research project. Relationships between the frequency of use of the six categories of time- management practices (TMP)(contact practices, delegation practices, practices for managing meetings, interruptions, and establishing priorities) and eight (8) independent variables were examined. The independent variables were the principals' work- management styles, their degree of flexibility in using these five work-management styles, the complexity of their schools, their school types (public vs. private), their school levels (elementary vs. middle), their years of experience, gender, and the amount of training in time management they received. \tThe principals with schools that housed some combination of grades  PreK - 12, and who were members of NAESP were sent a 61-item survey. The overall analysis was a series of multiple regression equations with the dependent variables being the frequency of use of six categories of time-management practices and their total time-management practice (TMP) score. Training accounted for 4% of the variance in the total TMP scores and was the only independent variable that predicted the frequency of use of the six categories of time management. \tIn the descriptive data, it was found that principals were more likely to use the Hopper Style (61.5%) of managing work than the other four work-management styles [Allergic to Details (20%), Perfectionist Plus (12.5%), Cliff Hangers (3%), and Fence Sitters (2.3%)] due to the nature of the job of being a principal. Flexibility was required in using all five work-management styles.  \tPrevious studies (Campbell & Williamson, 1991; Huffstutter & Smith, 1989; Hughes, 1989; Kmetz & Willower, 1991; Weldy, 1974), and this study support the need for principals to use those time-management practices that would reduce time wasters and help them have time to spend on important tasks. Principals used basic time-management practices for managing meetings (M=3.94, SD= .54), establishing priorities (M=3.92, SD= .81), and delegating (M=3.71, SD= .68). However, they continue to need training in some aspects of handling interruptions (M=3.19, SD= .63), scheduling contacts (M=3.08, SD=.61), and managing paperwork (M=3.05, SD=.57).",
  "description_provenance": [
    "Author Email: pr42@erols.com",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: vaughtc@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: robertr@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:23Z (GMT). No. of bitstreams: 8 CHAPTER1.PDF: 147567 bytes, checksum: 2ca6a3da446e94412a47bcb348064584 (MD5) CHAPTER5.PDF: 71063 bytes, checksum: cace0885ee06f3ed5b4f9f962edef74b (MD5) CHAPTER3.PDF: 69087 bytes, checksum: 73a671aa92ca07ebc3acbd0ddccb74d8 (MD5) CHAPTER4.PDF: 95563 bytes, checksum: 94516b9e7f963038249f08d838ac45d9 (MD5) TITLE.PDF: 26496 bytes, checksum: c1c457be8483da6d0fd9ef2e66c58063 (MD5) APPENDIX.PDF: 183413 bytes, checksum: ed3bdb160b40048a9d963720b1809fe0 (MD5) REFRENCES.PDF: 8683 bytes, checksum: 4977b26bda8000ad49a266d34d3b7f96 (MD5) CHAPTER2.PDF: 69958 bytes, checksum: 0a978fcb92ae3ee77bb96ea4fed44193 (MD5)   Previous issue date: 1999-02-08"
  ],
  "handle": "27106",
  "identifier_other": "etd-042199-205455",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042199-205455/",
  "identifier_uri": "http://hdl.handle.net/10919/27106",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAPTER1.PDF",
    "CHAPTER5.PDF",
    "CHAPTER3.PDF",
    "CHAPTER4.PDF",
    "TITLE.PDF",
    "APPENDIX.PDF",
    "REFRENCES.PDF",
    "CHAPTER2.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Time-Management",
    "Principals",
    "Work-Management Styles"
  ],
  "title": "Time-Management Practices of School Principals in the United States",
  "type": "Dissertation"
}