{
  "contributor_author": "Fornof, Ann R.",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "Wilkes, Garth L.",
    "Ward, Thomas C.",
    "Leo, Donald J.",
    "Riffle, Judy S.",
    "McGrath, James E."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:10:22Z",
  "date_adate": "2006-04-28",
  "date_available": "2014-03-14T20:10:22Z",
  "date_issued": "2006-04-20",
  "date_rdate": "2006-04-28",
  "date_sdate": "2006-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Rheological modification is frequently cited as a key application for hyperbranched polymers.  However, the high degree of branching in these polymers restricts entanglement and the resultant mechanical properties suffer.  Longer distances between branch points may allow entanglements.  Highly branched polymers, where linear units are incorporated between branch points, are synthesized with an oligomeric A2 plus a monomeric B3.  Higly branched polymers differ from traditional hyperbranched polymers in that every monomeric repeating unit of a hyperbranched polymer is a potential branch point, which is not true for highly branched polymers. The oligomeric A2 plus B3 synthetic methodology was used for the synthesis of highly branched ionenes and polyurethanes.  Highly branched ionenes, which have a quaternary ammonium salt in the main chain, were synthesized with a modified Menshutkin reaction.  The oligomeric A2 was comprised of well-defined telechelic tertiary amine endcapped poly(tetramethylene oxide).  Reduced mechanical properties were observed for highly branched polymers compared to linear counterparts. Highly branched polyurethanes were synthesized with polyether soft segments including poly(ethylene glycol), poly(tetramethylene glycol), and poly(propylene glycol).  Degree of branching was determined via a novel 13C NMR spectroscopy approach, which is described herein.  The classical degree of branching was supplemented with an alternative degree of branching equation, which was tailored for highly branched architectures.  The melt and solution viscosities of highly branched poly(ether urethane)s were orders of magnitude lower than the linear analogs.  For the first time, the presence of entanglements was confirmed for highly branched polymers.  Doping the highly branched polyurethane with lithium perchlorate, a metal salt, resulted in a significantly higher melt viscosity.  The ionic conductivity of the highly branched polyurethane when doped with a metal salt was orders of magnitude higher than the linear analog. Soybean oil was oxidized for synthesis of soy-based polyol monomers.  Three regimes were determined, and for the first time, a correlation between hydroxyl number and a resonance from the double bonds of soybean oil in 1H NMR spectroscopy was described.  The relationship was used to accurately describe oxidation of soybean oil with time, temperature, and air flow rate.  Soybean oil oxidation was catalyzed, and tack-free films were formed.",
  "description_provenance": [
    "Author Email: afornof@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: donleo@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:22Z (GMT). No. of bitstreams: 1 AnnFornofDissertationFinal.pdf: 2699485 bytes, checksum: 5e707cb14ce7f6882312cb3d132a5107 (MD5)   Previous issue date: 2006-04-20"
  ],
  "handle": "27101",
  "identifier_other": "etd-04212006-184840",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212006-184840/",
  "identifier_uri": "http://hdl.handle.net/10919/27101",
  "publisher": "Virginia Tech",
  "relation_haspart": "AnnFornofDissertationFinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hyperbranched",
    "polyurethanes",
    "rheology",
    "ionenes"
  ],
  "title": "Synthesis and Characterization of Multiphase, Highly Branched Polymers",
  "type": "Dissertation"
}