{
  "contributor_author": "Schauer-Crabb, Cheryl Anne",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Burton, John K.",
    "Cross, Lawrence H.",
    "Head, J. Thomas",
    "Lockee, Barbara B."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:23Z",
  "date_adate": "2002-04-25",
  "date_available": "2014-03-14T20:10:23Z",
  "date_issued": "2002-04-11",
  "date_rdate": "2003-04-25",
  "date_sdate": "2002-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Cheryl Anne Schauer-Crabb Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body bgcolor=\"#FFFFFF\" text=\"#000000\"> <p>This case study examines an asynchronous distance learning program to identify    characteristics critical to the diffusion and adoption process necessary for    effective implementation. These attributes extrapolated from the review of literature    and case study examination are both insightful and timely, since many educational    institutions are currently implementing distance learning programs without a    formal plan or vision. The study specified how an asynchronous program dealt    with the diffusion and adoption process by providing a thorough examination    of secondary documentation and archival record review, coupled with program    interviews. </p> <p><br>   Media for communicating information has expanded from simple print, voice, and    face-to-face communications to include fax, voice mail, computer-assisted instruction,    email, video and other technologies. These technologies are central to the mission    of education. Institutions have entered the distance learning arena with the    intent of capturing and attracting nontraditional students, as defined by age,    marital status or employment status, to the academic market. </p> <p><br>   Adoption and diffusion mechanisms focus on societal and customer needs. At institutions    of higher learning, students are the customers and their academic needs should    come first. The corporate sector is indirectly shaping education by hiring students    who have acquired the skills needed to compete in the information age. Distance    education must have an integrated strategic plan that successfully aligns all    vital programs to support academic, industry and societal needs. Students and    faculty must have easy access to information resources, support services, policies    and procedures for distance education. </p> <p><br>   The information resulting from this examination may facilitate adoption and    diffusion of asynchronous distance learning programs. Based upon identified    characteristics, the ancillary product of this case study was a compiled list    and discussion of lessons learned, composed from the review of literature and    case study examination. Key recommendations from the study, and substantiated    in the review of literature, follow: </p> <blockquote>   <p><br>     &sect; The case study had an adaptable infrastructure that changed with the      times.<br>     &sect; The purchase and use of distance learning technology was consistent      with the strategic plan.<br>     &sect; Participants had easy access and training to distance learning technology.    </p> </blockquote> </body> </html>",
  "description_provenance": [
    "Author Email: cschauer@vt.edu, shecrabb@bellsouth.net",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: burton@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: tom.head@vt.edu",
    "Advisor Email: barbara.lockee@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:23Z (GMT). No. of bitstreams: 1 Crabbelectronic.pdf: 1445208 bytes, checksum: bdb8bbbbfc7c43c004d3bd00f60c6c11 (MD5)   Previous issue date: 2002-04-11"
  ],
  "handle": "27108",
  "identifier_other": "etd-04222002-081632",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222002-081632/",
  "identifier_uri": "http://hdl.handle.net/10919/27108",
  "publisher": "Virginia Tech",
  "relation_haspart": "Crabbelectronic.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Adoption",
    "Diffusion",
    "Distance Learning"
  ],
  "title": "A Case Study of Adoption and Diffusion of an Existing Asynchronous Distance Learning Program",
  "type": "Dissertation"
}