{
  "contributor_author": "Holloman, Yvonne Arrington",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Fortune, Jimmie C.",
    "Hoover, J. Larry",
    "Johnson, Patricia",
    "Martin, Rosalie Marie"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:22Z",
  "date_adate": "2007-05-01",
  "date_available": "2014-03-14T20:10:22Z",
  "date_issued": "2007-04-18",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated the impact of Virginiaâ  s K-3 Primary Class Size Reduction Program on student achievement in reading.  The theoretical framework hypothesized that a reduction in class size and sustained professional development would impact instructional strategies implemented by teachers which would result in increased reading achievement by students.  Information regarding the history of class size research was presented to provide readers with a chronological overview of the topic.  In addition, statewide class size reduction initiatives from Indiana, Tennessee, Wisconsin, and California were reviewed.  Data were collected using administrator and teacher surveys as well as an analysis of the Virginia Standards of Learning Assessments for Grade 3 English and the Phonological Awareness Literacy Screening (PALS) results for schools participating in the research study.  The findings revealed that the Virginia K-3 Primary Class Size Reduction Program benefited grade 3 students according to gender, ethnicity, and socioeconomic status. <p><i>Vita removed at the author's request. GMc Feb. 4, 2013</i></p>",
  "description_provenance": [
    "Author Email: yah905@msn.com",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: lhoover@kaballero.com",
    "Advisor Email: pjohnson@sbo.hampton.k12.va.us",
    "Advisor Email: rowhite@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:22Z (GMT). No. of bitstreams: 4 Exemptionformyah.pdf: 121438 bytes, checksum: fec2939415abbe14feebf1a6f2be389e (MD5) approvalltr.pdf: 150678 bytes, checksum: 0512a8c7ea5b880140f35210548c20f1 (MD5) dissertationyah1.pdf: 819078 bytes, checksum: 7edfeab7e31bc513af9df4e7c878380a (MD5) Initial_Review_Applicationyah.pdf: 63576 bytes, checksum: 3b6fa5a76a4f516d2680c03c82110dd3 (MD5)   Previous issue date: 2007-04-18"
  ],
  "handle": "27102",
  "identifier_other": "etd-04212007-211503",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212007-211503/",
  "identifier_uri": "http://hdl.handle.net/10919/27102",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Exemptionformyah.pdf",
    "approvalltr.pdf",
    "dissertationyah1.pdf",
    "Initial_Review_Applicationyah.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "class size",
    "student achievement",
    "reading instruction"
  ],
  "title": "The Impact of the Virginia K-3 Primary Class Size Reduction Program on Student Achievement in Reading",
  "type": "Dissertation"
}