{
  "contributor_author": "Adkins, Denise Rene",
  "contributor_committeechair": "Bell, Martha Ann",
  "contributor_committeemember": [
    "Dunsmore, Julie C.",
    "Hoffman, Kurt A.",
    "Cooper, Robin K. Panneton",
    "Smith, Cynthia L."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:10:22Z",
  "date_adate": "2006-04-28",
  "date_available": "2014-03-14T20:10:22Z",
  "date_issued": "2006-04-07",
  "date_rdate": "2009-04-28",
  "date_sdate": "2006-04-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An interactive framework of working memory and inhibitory control has been endorsed for examining cognitive development across the lifespan (Roberts & Pennington, 1996). According to this framework, the interaction between working memory and inhibitory control (WMIC) is necessary for adaptive daily functioning (Roberts & Pennington, 1996) and crucial for the development of executive functioning in childhood (Brocki & Bohlin, 2004). Empirical work from early developmental periods supports the interactive WMIC framework (e.g., Bell, 2001; Diamond, Kirkham, & Amso, 2002) and has identified sources of variability (brain electrical activity, temperament, and language) associated with WMIC functioning in infancy and early childhood (Wolfe & Bell, 2004).   Although there is some evidence to suggest the interdependent nature of working memory and inhibitory control in late childhood and adulthood (Diamond, 2002; Luna, Garver, Urban, Lazar, & Sweeney, 2004), work in these later developmental periods has focused primarily on the independent processes of working memory (WM) and inhibitory control (IC) and the interactive WMIC framework has not been directly investigated from late childhood onward. Therefore, the first goal of the current study was to examine the interactive framework in a late childhood sample. The second goal of the study was to examine sources of variability in WMIC functioning in late childhood, with the intention of determining which sources of variability were associated with and contributed unique variance in explaining WMIC performance.   Thirty-eight children (19 male) completed four age-appropriate interactive WMIC tasks (the color-word Stroop, the Fruit Stroop, the counting go/no-go and the Wisconsin Card Sort Test) and two language tasks. Both parents and children responded to a temperament questionnaire. Brain electrical activity was collected via EEG recordings during a two-minute baseline and WMIC tasks.   The four interactive WMIC tasks were tested for relation of the independent (WM, IC) and combined (WMIC) components within tasks and across tasks. The four WMIC tasks were not correlated with one another. However, the independent (WM, IC) components were correlated both with one another and with the combined WMIC measure within each task, providing some support for an interactive framework in late childhood. The sources of variability associated with the independent (WM, IC) and combined (WMIC) components of each task were identified. These sources were used to explain both collective and unique variance in WMIC functioning for each task. Different sources of variability explained independent (WM, IC) and combined (WMIC) performance across tasks. Unique and shared contributors within and across tasks (the color-word Stroop, the Fruit Stroop, the counting go/no-go and the Wisconsin Card Sort Test) and components (WM, IC, WMIC) are discussed in an effort to determine how sources of variability may be related to WMIC functioning.",
  "description_provenance": [
    "Author Email: deadkins@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: jdunsmor@vt.edu",
    "Advisor Email: khoffma@vt.edu",
    "Advisor Email: panneton@vt.edu",
    "Advisor Email: smithcl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:22Z (GMT). No. of bitstreams: 1 dadkins2.diss.pdf: 639833 bytes, checksum: 0e12cd435b658c257e7357d3021f3a31 (MD5)   Previous issue date: 2006-04-07"
  ],
  "handle": "27100",
  "identifier_other": "etd-04212006-141243",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04212006-141243/",
  "identifier_uri": "http://hdl.handle.net/10919/27100",
  "publisher": "Virginia Tech",
  "relation_haspart": "dadkins2.diss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "temperament",
    "late childhood",
    "EEG",
    "working memory",
    "inhibitory control",
    "cognition"
  ],
  "title": "Cognitive Development in Late Childhood: An Examination of Working Memory and Inhibitory Control",
  "type": "Dissertation"
}