{
  "contributor_author": "Punrattanasin, Warangkana",
  "contributor_committeechair": "Randall, Clifford W.",
  "contributor_committeemember": [
    "Gregory, Eugene M.",
    "Randall, Andrew A.",
    "Gallagher, Daniel L.",
    "Novak, John T."
  ],
  "contributor_department": "Environmental Sciences and Engineering",
  "date_accessioned": "2014-03-14T20:10:23Z",
  "date_adate": "2001-04-24",
  "date_available": "2014-03-14T20:10:23Z",
  "date_issued": "2001-04-13",
  "date_rdate": "2002-04-24",
  "date_sdate": "2001-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Sequencing batch reactor (SBR) systems were used for the development of a system and operating procedures for the high production of polyhydroxyalkanoates (PHAs) by wastewater treatment (activated sludge) bacterial cultures.  It was found that unbalanced growth conditions stimulated massive PHA production in activated sludge biomass.  Operating conditions had a significant effect on PHA production and the composition of the accumulated copolymer when either laboratory prepared mixtures of organics or a high acetic acid industrial wastewater were used as the organic substrate mixture.  Fully aerobic (AE) conditions with nitrogen (N) and phosphorus (P) limitations were the optimum conditions for PHA production when the laboratory prepared mixtures of orgnics were used, while fully AE with the combinations of N, P, and potassium (K) limitations were better for PHA production using a high acetic acid industrial wastewater as the substrate.  One nutrient limitation or partial limitation of either N or P as used for commercial production using pure cultures did not promote massive PHA production in activated sludge biomass compared to the combination of nutrient limitations.  A maximum cellular PHA accumulation of 70%TSS was obtained under fully AE conditions with multiple alternating periods of growth and N&P limitations.  Microaerophilic/aerobic (MAA/AE) or anaerobic/aerobic (AN/AE) cycling promoted less PHA production compared to fully AE conditions.  The relative amounts of the PHA copolymers formed, i.e., polyhydroxybutyrate (PHB) and polyhydroxyvalerate (PHV) were different under different operating conditions, even though the types and amounts of volatile fatty acids (VFAs) in the feed were the same.  It was determined that high total phosphorus (TP) content inside the bacterial cells had a significant detrimental impact on PHA production by activated sludge biomass.  A two-stage bioprocess was a better approach for obtaining activated sludge PHA accumulation because a growth phase was necessary to grow the bacterial population that contains minimal TP before starting the subsequent PHA accumulation phase.  Seeding sludge obtained from a conventional fully aerobic wastewater treatment system was more suitable than seed obtained from a biological phosphorus removal (BPR) system because bacterial populations from BPR systems tended to convert organic substrates to intracellular carbohydrate content rather than PHA under nutrient limitation conditions.  The molecular weights and melting point temperatures of PHAs produced by the mixed culture of activated sludge biomass were comparable to those obtained from pure cultures and have the potential to be used for commercial applications.  The results of this study indicate that activated sludge biomass has considerable potential for PHA production for commercial purposes, and likely could do so utilizing wastewater sources of organics.  In particular organic rich, nutrient limited wastewaters have potential for efficient PHA production.",
  "description_provenance": [
    "Author Email: pum@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Advisor Email: cliff@vt.edu",
    "Advisor Email: randall@ucf.edu",
    "Advisor Email: dang@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:23Z (GMT). No. of bitstreams: 3 1AppendixEtd.PDF: 215586 bytes, checksum: bd894ef5f6d05d28ecc7053523b516c7 (MD5) 1DissertationEtd.PDF: 338081 bytes, checksum: f8835674eb14a73f99120136fc907f0c (MD5) 1VitaEtd.PDF: 4983 bytes, checksum: 1afc660d1d55105f131e51064fe33bd5 (MD5)   Previous issue date: 2001-04-13"
  ],
  "handle": "27107",
  "identifier_other": "etd-04222001-231147",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222001-231147/",
  "identifier_uri": "http://hdl.handle.net/10919/27107",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "1AppendixEtd.PDF",
    "1DissertationEtd.PDF",
    "1VitaEtd.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "activated sludge; anaerobic-aerobic; biodegradable",
  "title": "The Utilization of Activated Sludge Polyhydroxyalkanoates for the Production of Biodegradable Plastics",
  "type": "Dissertation"
}