{
  "contributor_author": "Xu, Shuangyan",
  "contributor_committeechair": "Dillard, David A.",
  "contributor_committeemember": [
    "Case, Scott W.",
    "Ward, Thomas C.",
    "Lu, Guo-Quan",
    "Dillard, John G.",
    "Thangjitham, Surot"
  ],
  "contributor_department": "Engineering Science and Mechanics",
  "date_accessioned": "2014-03-14T20:10:24Z",
  "date_adate": "2002-04-26",
  "date_available": "2014-03-14T20:10:24Z",
  "date_issued": "2002-04-12",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objective of this study was to evaluate and gain a better understanding of the short-term impact performance and the long-term durability of electrically conductive adhesives for electronic interconnection applications.  Three model conductive adhesives, designated as ECA1, ECA2 and ECA3, supplied by Emerson & Cuming, were investigated, in conjunction with printed circuit board (PCB) substrates with metallizations of Au/Ni/Cu and Cu, manufactured by Triad Circuit Inc. Effects of environmental aging on the durability of conductive adhesives and their joints were evaluated.  All the samples for both mechanical tests and thermal tests were aged at 85%, 100%RH for periods of up to 50 days.  Studies of bulk conductive adhesives suggested that both plasticization, which is reversible and further crosslinking and thermal degradation, which are irreversible, might have occurred upon exposure of ECAs to the hot/wet environment.  The durability of electrically conductive adhesive joints was then investigated utilizing the double cantilever beam (DCB) test.  It was observed that the conductive adhesive joint was significantly weakened following hydrothermal aging, and there was a transition from cohesive failure to interfacial failure as aging continued.  A comparative study of the durability of different conductive adhesive and substrate metallization combinations suggested that the resistance of the adhesive joints to moisture attack is related to the adhesive properties, as well as the substrate metallizations.  It was noted that the gold/adhesive interface had better resistance to moisture attack than the copper/adhesive interface.  A reasonable explanation of this phenomenon was given based upon the concept of surface free energy and interfacial free energy.  XPS analysis was performed on the fractured surfaces of DCB samples.  For adhesive joints with copper metallization, copper oxide was detected on the failed surfaces upon exposure of the conductive adhesive joints following aging.  XPS analysis on the fractured surfaces of adhesive joints with Au metallization suggested that diffusion of Cu to the Au surface might have happened on the Au/Ni/Cu plated PCB substrates during aging.   The impact performance of conductive adhesives was quantitatively determined using a falling wedge test.  This unique impact resistance testing method could serve as a useful tool to screen conductive adhesives at the materials level for bonding purpose.  Moreover, this test could also provide some useful information for conductive adhesive development.  This study revealed that the viscoelastic energy, which is a result of the internal friction created by chain motions within the adhesive material, played an important role in the impact fracture behavior of the conductive adhesives.  This study also demonstrated that the loss factor, evaluated at the impact environment conditions, is a good indicator of a conductive adhesive's ability to withstand impact loading.",
  "description_provenance": [
    "Author Email: sxu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:24Z (GMT). No. of bitstreams: 13 Chapter4.PDF: 70161 bytes, checksum: 91f027e10172f8550b0b27edbeac4904 (MD5) Chapter3.PDF: 52924 bytes, checksum: f741f109032324bdb8f090c487b6722f (MD5) Appendix.PDF: 1099569 bytes, checksum: 913a4816a86be2be26840054d718a453 (MD5) Table.PDF: 29406 bytes, checksum: d31b1670fe25d6e3f48000ad1419c357 (MD5) Vita.PDF: 3916 bytes, checksum: 4f0eaebf63e78dfa8f7b194df4781b47 (MD5) Chapter1.PDF: 22233 bytes, checksum: b4d92c31c28b5f773416627598dae427 (MD5) Chapter4-Figs.PDF: 2028136 bytes, checksum: be2220be88f0bb58f50f55258d9afe70 (MD5) Chapter5-Figs.PDF: 365721 bytes, checksum: c53cf43355a912dd38ce813d0f2170c5 (MD5) Chapter2.PDF: 145526 bytes, checksum: cdf85007908bafc88d2768dc681609ab (MD5) cover.PDF: 13533 bytes, checksum: 3e4b9b76b70c8b1ee72e3868a0122a35 (MD5) Chapter3-Figs.PDF: 4110603 bytes, checksum: cbe953cb67c996a084f94e6f77187929 (MD5) Chapter5.PDF: 70470 bytes, checksum: 433340b295756e56069bc1d169616bd5 (MD5) Chapter6.PDF: 24343 bytes, checksum: f7f71f70483ce559413e3e207bf67134 (MD5)   Previous issue date: 2002-04-12"
  ],
  "handle": "27112",
  "identifier_other": "etd-04222002-174259",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222002-174259/",
  "identifier_uri": "http://hdl.handle.net/10919/27112",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter4.PDF",
    "Chapter3.PDF",
    "Appendix.PDF",
    "Table.PDF",
    "Vita.PDF",
    "Chapter1.PDF",
    "Chapter4-Figs.PDF",
    "Chapter5-Figs.PDF",
    "Chapter2.PDF",
    "cover.PDF",
    "Chapter3-Figs.PDF",
    "Chapter5.PDF",
    "Chapter6.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Impact Resistance",
    "Durability",
    "Electrically Conductive Adhesives",
    "Environmental Aging",
    "Loss Factor",
    "Thermal Properties",
    "Double Cantilever Beam",
    "Falling Wedge Test",
    "Fracture Toughness",
    "Mechanical Properties"
  ],
  "title": "Evaluating Thermal and Mechanical Properties of Electrically Conductive Adhesives for Electronic Applications",
  "type": "Dissertation"
}