{
  "contributor_author": "Almedeij, Jaber H.",
  "contributor_committeechair": "Diplas, Panayiotis",
  "contributor_committeemember": [
    "Loganathan, G. V.",
    "Dancey, Clinton L.",
    "Schetz, Joseph A.",
    "Renardy, Yuriko Y."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:10:24Z",
  "date_adate": "2002-04-23",
  "date_available": "2014-03-14T20:10:24Z",
  "date_issued": "2002-03-28",
  "date_rdate": "2003-04-23",
  "date_sdate": "2002-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Bedload transport is a complicated phenomenon in gravel-bed streams. Several factors account for this complication, including the different hydrologic regime under which different stream types operate and the wide range of particle sizes of channel bed material. Based on the hydrologic regime, there are two common types of gravel-bed streams: perennial and ephemeral. In terms of channel bed material, a gravel bed may have either unimodal or bimodal sediment.   This study examines more closely some aspects of bedload transport in gravel-bed streams and proposes explanations based on fluvial mechanics. First, a comparison between perennial and ephemeral gravel-bed streams is conducted. This comparison demonstrates that under a wide range of Shields stresses, the trends exhibited by the bedload transport data of the two stream types collapse into one continuous curve, thus a unified approach is warranted. Second, an empirical bedload transport relation that accounts for the variation in the make-up of the surface material within a wide range of Shields stresses is developed. The accuracy of the relation is tested using available bedload transport data from streams with unimodal sediment. The relation is also compared against other formulae available in the literature that are commonly used for predicting bedload transport in gravel-bed streams. Third, an approach is proposed for transforming the bimodal sediment into two independent unimodal fractions, one for sand and another for gravel. This transformation makes it possible to carry out two separate computations of bedload transport rate using the bedload relation developed in this study for unimodal sediment. The total bedload transport rate is estimated by adding together the two contributions.",
  "description_provenance": [
    "Author Email: jalmedei@vt.edu",
    "Advisor Email: gvlogan@vt.edu",
    "Advisor Email: cld@vt.edu",
    "Advisor Email: ptiger@vt.edu",
    "Advisor Email: pdiplas@vt.edu",
    "Advisor Email: renardyy@math.vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:24Z (GMT). No. of bitstreams: 1 ETD.pdf: 2199353 bytes, checksum: a8840c3bc5e03858a2445efc198cf618 (MD5)   Previous issue date: 2002-03-28"
  ],
  "handle": "27110",
  "identifier_other": "etd-04222002-134815",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222002-134815/",
  "identifier_uri": "http://hdl.handle.net/10919/27110",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mode",
    "pavement",
    "rivers",
    "flow",
    "segregation",
    "sediment entrainment"
  ],
  "title": "bedload transport in gravel-bed streams under a wide range of Shields stresses",
  "type": "Dissertation"
}