{
  "contributor_author": "Al-Modaf, Obaid Ali",
  "contributor_committeechair": "Snizek, William E.",
  "contributor_committeemember": [
    "Hughes, Michael D.",
    "Fuhrman, Ellsworth R.",
    "Robinson, Jerald F.",
    "Bryant, Clifton D."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:10:25Z",
  "date_adate": "2003-04-29",
  "date_available": "2014-03-14T20:10:25Z",
  "date_issued": "2003-04-02",
  "date_rdate": "2005-04-29",
  "date_sdate": "2003-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study aims to examine the attitudes of the Saudi undergraduate college students toward the anticipated effects of privatization on the employment system of the Saudi privatized SOEs.  Using survey questionnaire data collected in May 2002 from 672 Saudi undergraduate college students, the study results reveal varied attitudes.  On the one hand, large percentages of the respondents prefer working under close supervision of Saudi management, having a salary based on productivity, being promoted based upon performance (rather than seniority), and adhering to prescribed procedures in executing job tasks.  On the other hand, high percentages of the study respondents tend to dislike the concepts of putting forth more effort to meet management창  s plans, of working on nights and weekend, and of compromising job security in return for a higher salary.  In addition, while the majority of the study respondents believe that privatization of state-owned enterprises is best for the local economy, their support for privatization is qualified by their insistence or desire that it not negatively impact their own interests.  The statistical significance and association analyses reveal that the effects of academic majors and province on respondents창   attitudes toward promotion criteria, teaming, and management창  s nationality are indeed significant.  In addition, gender, SES, living areas prior to college entry, and adherence to religion are significantly related to respondents창   attitudes toward privatization in general and toward some of its potential effects on the employment system.  Recommendations are provided.",
  "description_provenance": [
    "Author Email: obaid@vt.edu",
    "Advisor Email: mdh@vt.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Advisor Email: jfr@vt.edu",
    "Advisor Email: cbryant@vt.edu",
    "Advisor Email: snizek@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:25Z (GMT). No. of bitstreams: 1 Dissertation_PDF.pdf: 506784 bytes, checksum: 284d490f2fbf0d8e8c6a516d8ef8da23 (MD5)   Previous issue date: 2003-04-02"
  ],
  "handle": "27117",
  "identifier_other": "etd-04222003-104943",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222003-104943/",
  "identifier_uri": "http://hdl.handle.net/10919/27117",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_PDF.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "employment system",
    "privatized state-owned Enterprises",
    "privatization in Saudi Arabia.",
    "privatization"
  ],
  "title": "Attitudes toward the Effects of Privatization on the Employment System: A Study of Undergraduate College Students in Saudi Arabia",
  "type": "Dissertation"
}