{
  "contributor_author": "Urquhart, Ryan L.",
  "contributor_committeechair": "Casali, John G.",
  "contributor_committeemember": [
    "Kleiner, Brian M.",
    "Smith-Jackson, Tonya L.",
    "Saunders, William R.",
    "Robinson, Gary S."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:10:24Z",
  "date_adate": "2002-05-06",
  "date_available": "2014-03-14T20:10:24Z",
  "date_issued": "2002-04-24",
  "date_rdate": "2003-05-06",
  "date_sdate": "2002-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A human factors experiment was conducted to assess whether a reduction in noise at the ear would cause an improvement in speech intelligibility, an improvement in cognitive performance, and/or a reduction in subjective mental workload.   Modified Rhyme Test (MRT) stimuli were used to determine intelligibility and specific tests within the Complex Cognitive Assessment Battery (CCAB) were used to assess cognitive performance.  The tests chosen from the CCAB were:  Tower Puzzle, Logical Relations, and Numbers and Words.  These tests were chosen because of the specific set of cognitive functions that they measure which corresponded to command and control tasks.  Participants performed the MRT and CCAB tests simultaneously in a 114 dBA noise environment at two speech levels, 83 dB (linear) and 96 dB (linear), using two communication microphones, Gentex Model 1453 and a prototype communication microphone developed by Adaptive Technologies Inc. (ATI).   The noise used in the experiment was from a recording made inside a US Army Bradley Fighting Vehicle.  Subjective mental workload was assessed using the NASA-TLX and Modified Cooper-Harper (MCH) immediately after the experiment.   Results indicated that the communication microphone developed by ATI reduced the noise level at the ear better than the current Gentex microphone.  However, the Gentex microphone produced significantly higher speech intelligibility scores at the 96 dB speech level. Cognitive performance scores significantly improved with increasing speech level for both communication microphones, with the ATI microphone having the advantage at 83 dB and the Gentex at 96 dB.  The results also indicated that the main effects of speech level and communication microphone did not have an effect on subjective mental workload.  A correlation analysis revealed that there was a positive relationship between the two workload measurement tools, indicating that either scale may be used to assess mental workload.  Therefore, it was concluded that the MCH could have been used instead of the NASA-TLX, since the overall workload score was of interest.",
  "description_provenance": [
    "Author Email: urquhart4@yahoo.com",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: jcasali@vt.edu",
    "Advisor Email: wills@vt.edu",
    "Advisor Email: grobins@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:24Z (GMT). No. of bitstreams: 2 02rudissertation.pdf: 598824 bytes, checksum: 138600c95fa0a748de514e3acdadec25 (MD5) 01tableofcontents.pdf: 26609 bytes, checksum: 2e4f882fe9ef8ebfd01f4bd56cbdc268 (MD5)   Previous issue date: 2002-04-24"
  ],
  "handle": "27111",
  "identifier_other": "etd-04222002-143554",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222002-143554/",
  "identifier_uri": "http://hdl.handle.net/10919/27111",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "02rudissertation.pdf",
    "01tableofcontents.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "workload",
    "cognitive performance",
    "active noise reduction",
    "speech intelligibility"
  ],
  "title": "The Effects of Noise on Speech Intelligibility and Complex Cognitive Performance",
  "type": "Dissertation"
}