{
  "contributor_author": "Thomas, Cheryl Kelly",
  "contributor_committeecochair": [
    "Parson, Stephen R.",
    "Driscoll, Lisa G."
  ],
  "contributor_committeemember": [
    "Twiford, Travis W.",
    "White, Rosanne",
    "Sughrue, Jennifer A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:24Z",
  "date_adate": "2002-04-26",
  "date_available": "2014-03-14T20:10:24Z",
  "date_issued": "2002-04-10",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The public school superintendent is seen as the leader of schools and as a spokesperson bridging schools and the community. With this thought in mind, along with reports suggesting school and business collaboration as the key to better schools and lasting economic growth, defining the school superintendent's role in local economic development becomes valuable. As school and business relationships change, superintendents must be prepared to address this evolving interdependence.  <p>The purpose of this study was to clarify the role of the public school superintendent in local economic development. Using a three-round Delphi technique, panelists representing various geographic locations and employment domains participated in developing a consensus on this role. Superintendents, economic development leaders, business leaders, and government officials individually identified the tasks important to the public school superintendent's responsibility in local economic development. Panel members then rated the level of importance of each suggested task and worked through the rounds to develop agreement using statistical feedback from the group response. The tasks agreed upon by 80% of the panel members as being important to extremely important were then examined to disclose the level of importance. The rating response mean and standard deviation were calculated for each task. These descriptive measures were then used to rank the most important tasks and better define the public school superintendent's role in local economic development.",
  "description_provenance": [
    "Author Email: ckthomas@henrico.k12.va.us",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: jsugh@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:24Z (GMT). No. of bitstreams: 1 ThomasCheryl.PDF: 372034 bytes, checksum: 4383183e411f2531d99f53895abc35a5 (MD5)   Previous issue date: 2002-04-10"
  ],
  "handle": "27113",
  "identifier_other": "etd-04222002-211842",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222002-211842/",
  "identifier_uri": "http://hdl.handle.net/10919/27113",
  "publisher": "Virginia Tech",
  "relation_haspart": "ThomasCheryl.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Delphi",
    "Superintendent",
    "Economic Development"
  ],
  "title": "The Role of the Public School Superintendent in Local Economic Development",
  "type": "Dissertation"
}