{
  "contributor_author": "Beckmann, Michael John",
  "contributor_committeechair": "Wiswell, Albert W.",
  "contributor_committeemember": [
    "Cline, Marvin Gerald",
    "Reio, Thomas G. Jr.",
    "Endlich, Norman",
    "Combs, Letitia A."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:25Z",
  "date_adate": "2003-04-28",
  "date_available": "2014-03-14T20:10:25Z",
  "date_issued": "2003-04-03",
  "date_rdate": "2004-04-28",
  "date_sdate": "2003-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study explores the influence of employee perception of acquisition success and the dispositional antecedents of positive affect and adaptive coping on employee- organization commitment during the 60-day period following a business acquisition.  Allen & Meyerâ  s affective, normative and continuance model of commitment was used for the dependent variables.  A single sample was analyzed using a hierarchical regression approach. The survey was conducted with TRWâ  s GIT Division, and included 51 employees who participated in three web- based surveys.  The surveys were administered at (a) the change of control date, (b) 30 days, and (c) 60 days after the change of control date.  Through a full- model regression, the combined dispositional and demographic variables were found to have a significant impact on the three components of employee- organization commitment.  Specifically, the dispositional attribute of positive affect had a statistically significant predictive relationship to affective and normative commitment.  Employee perception of acquisition success was found to have limited influence only on affective commitment, and finally, company service was determined to have a small predictive value for continuance commitment.  The changing nature of the relationships between the independent variables and the dependents over time led to the conclusion that the employee sample was experiencing several symptoms of merger syndrome during the initial post- acquisition time period. As a single case, the study cannot be considered conclusive, however, the study does provide insights into the changing nature of employee- organization commitment during a specific time of organizational change.  Research into additional dispositional antecedents to employee commitment is suggested, as well as further research on employee commitment after the initial 60-day post- acquisition integration period.",
  "description_provenance": [
    "Author Email: mjbeckmann@att.net",
    "Advisor Email: mgcline@aol.com",
    "Advisor Email: tgreio01@gwise.louisville.edu",
    "Advisor Email: endl@erols.com",
    "Advisor Email: letitiacombs@yahoo.com",
    "Advisor Email: awiswell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:25Z (GMT). No. of bitstreams: 4 Title_Page_and_Abstract.pdf: 77665 bytes, checksum: bbf4c3b37619cefeae4550e5e145821e (MD5) Main_Body.pdf: 2042164 bytes, checksum: 54696ccc38cdb6fa7788e93c19f476b2 (MD5) Appendices.pdf: 2137212 bytes, checksum: c6bc43221937c943ba16e34c3fcdb3cb (MD5) First_Section.pdf: 256380 bytes, checksum: f2af5ddaf46d9b9418f6c32a276ef626 (MD5)   Previous issue date: 2003-04-03"
  ],
  "handle": "27116",
  "identifier_other": "etd-04222003-092606",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222003-092606/",
  "identifier_uri": "http://hdl.handle.net/10919/27116",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Title_Page_and_Abstract.pdf",
    "Main_Body.pdf",
    "Appendices.pdf",
    "First_Section.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "positive affect",
    "acquisitions",
    "commitment",
    "adaptive coping",
    "mergers"
  ],
  "title": "Dispositional Antecedents to Post- Acquistion Employee Commitment",
  "type": "Dissertation"
}