{
  "contributor_author": "Deng, Jianjun",
  "contributor_committeechair": "Esker, Alan R.",
  "contributor_committeemember": [
    "Ward, Thomas C.",
    "Dillard, John G.",
    "Crawford, Daniel T.",
    "Marand, Hervé L."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:10:27Z",
  "date_adate": "2005-04-25",
  "date_available": "2014-03-14T20:10:27Z",
  "date_issued": "2005-04-18",
  "date_rdate": "2005-04-25",
  "date_sdate": "2005-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Over the past two decades one class of oligomers, polyhedral oligomeric silsesquioxanes (POSS), has attracted considerable attention because of their unique hybrid organic/inorganic molecular structures and nanoscopic sizes.  While surface and interfacial properties may play a key role in many potential POSS applications, relatively little is actually known about the surface properties of POSS.  This dissertation provides studies of the interfacial aspects of both POSS molecules and POSS/polymer blends at the air/water interface (A/W) through surface pressure-area per molecule (Pi-A) isotherm, Brewster angle microscopy (BAM), and interfacial stress rheometry (ISR) studies.<p> Results for POSS Langmuir thin films at A/W show that trisilanol-POSS derivatives are a new class of amphiphiles, that exhibit multiple phase transitions in going from traditional 2D Langmuir monolayers (1 POSS molecule thick) to various 3D multilayer films upon compression.  With small length/diameter ratios and bulky shapes, the monolayer phase behavior and packing states of different POSS are simpler than the traditional rod-like lipids.  Meanwhile trisilanol-POSS derivatives have very different collapse behavior and multilayer organization showing strong substituent effects even though they have similar molecular sizes. While trisilanolisobutyl-POSS (TiBuP) monolayers undergo collapse around Pi=18 mNm-1 and form various ordered or disordered solid-like 3D aggregates at different compression rates, trisilanolcyclohexyl-POSS (TCyP) monolayers collapse into trilayers via instantaneous nucleation with hemispherical edge growth around Pi=3.7 mNm-1.  ISR results reveal three different non-Newtonian flow regimes that correlate with phase transitions in the Pi-A isotherms.  Further symmetric compression after trilayer formation induces TCyP thin films to self-assemble into highly ordered crystalline-like hydrophobic multilayers (8 POSS molecule thick) with unique rod-like morphologies, which are dramatically different from â  collapsedâ   morphologies seen in other systems.<p> By treating POSS derivatives as ideal nanofiller for studying confinement effects on filled polymer systems, amphiphilic poly(dimethylsiloxane) (PDMS) derivatives with different polar functional groups are studied as blends with TiBuP and octaisobutyl-POSS at A/W to resolve one of the key challenges for current nanocomposite applications:  How to control nanofiller dispersion in polymer matrices?  The results in this dissertation reveal that introducing polar groups into polymeric matrix polymers is a good way to control dispersion.",
  "description_provenance": [
    "Author Email: jideng1@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: crawdad@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: hmarand@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:27Z (GMT). No. of bitstreams: 1 JianjunDeng2nd.pdf: 19798452 bytes, checksum: 18591949fc7fcf04f5b1710cba37cdc6 (MD5)   Previous issue date: 2005-04-18"
  ],
  "handle": "27126",
  "identifier_other": "etd-04222005-084217",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222005-084217/",
  "identifier_uri": "http://hdl.handle.net/10919/27126",
  "publisher": "Virginia Tech",
  "relation_haspart": "JianjunDeng2nd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Polymer blends",
    "Nanofiller",
    "Polyhedral oligomeric silsesquioxane (POSS)",
    "Langmuir monolayers"
  ],
  "title": "INTERFACIAL CHARACTERIZATION OF POLYHEDRAL OLIGOMERIC SILSESQUIOXANE (POSS) AMPHIPHILES AND POLYMER BLENDS:  THERMODYNAMICS, MORPHOLOGY, AND RHEOLOGY",
  "type": "Dissertation"
}