{
  "contributor_author": "Sahin, Ebru Karpuzoglu",
  "contributor_committeechair": "Ahmed, S. Ansar",
  "contributor_committeemember": [
    "Wong, Eric A.",
    "Schurig, Gerhardt G.",
    "Sriranganathan, Nammalwar",
    "Elvinger, Francois C."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:10:27Z",
  "date_adate": "2005-05-04",
  "date_available": "2014-03-14T20:10:27Z",
  "date_issued": "2005-04-07",
  "date_rdate": "2010-10-13",
  "date_sdate": "2005-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "It is now clear that estrogen not only modulates the differentiation and function of reproductive systems, but it also profoundly regulates the immune system of normal and autoimmune individuals. An important mechanism by which estrogen regulates the immune system is by altering the secretion and/or response to cytokines. We hypothesized that estrogen may alter the levels and/or response to IFN-g, a prototype Th1 cytokine, that plays a pivotal role in immunity against intracellular infections and in many autoimmune and inflammatory disorders. We found that estrogen treatment tended to upregulate the secretion of IFN-g protein and mRNA expression from Concanavalin-A (Con-A)-activated splenic lymphocytes. Impressively, we found that splenocytes  from estrogen-treated mice when activated with Con-A also resulted in increased release of nitric oxide compared to placebo-treated mice.  Furthermore, Con-A-activated splenocytes from estrogen-treated mice also had upregulated iNOS mRNA, iNOS protein, and nitric oxide-regulated COX-2 protein when compared to control mice. Blocking co-stimulatory signals mediated through interactions of CD28 and B7 molecules by using CTLA-4Ig markedly decreased not only IFN-g, but also nitric oxide, thereby implying an important role for CD28/B7 interactions in IFN-g/nitric oxide. Estrogen-induced upregulation of iNOS/nitric oxide is mediated through IFN-g since: (i) Estrogen alone did not upregulate iNOS/nitric oxide in IFN-g knockout mice; (ii) addition of rIFN-g to activated splenocytes from estrogen-treated mice further upregulated nitric oxide levels.  We next investigated whether estrogen also upregulated IFN-g-inducing cytokines and select IFN-g-inducing transcription factors.  Estrogen treatment resulted in increased mRNA and/or protein expression of IFN-g inducing cytokines and their receptors, including: IL-18, IL-15, IL-27, IL-12Rb2, and IL-18Rb. We also found that T-bet, a critical Th1 transcription factor, and STAT-4 phosphorylation, a key molecule in IL-12 signaling were both increased, while IRF-4, an important player in Th2 differentiation, was diminished in Con-A-activated splenocytes from mice treated with estrogen. Altogether,  these studies are the first to demonstrate that estrogen regulates IFN-g-dependent iNOS and describes the potential mechanisms of how estrogen alters IFN-g-inducible genes, IFN-g inducing cytokines, and transcription factors in normal C57BL/6 mice.  These studies may have profound implications to many autoimmune and inflammatory disorders, where estrogen is known to regulate the course of these diseases.   Since estrogen may promote inflammatory disorders by upregulating pro-inflammatory biomolecules including IFN-g, nitric oxide, and COX-2, these studies may help in the design of therapeutic agents that regulate or block secretion and/or response to these inflammatory molecules.",
  "description_provenance": [
    "Author Email: ekarpuzo@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: ansrahmd@vt.edu",
    "Advisor Email: gschurig@vt.edu",
    "Advisor Email: nathans@vt.edu",
    "Advisor Email: elvinger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:27Z (GMT). No. of bitstreams: 1 karpuzoglu-sahin.pdf: 10895310 bytes, checksum: 1bf6a2a63485f2ea26cf337b551a38bf (MD5)   Previous issue date: 2005-04-07"
  ],
  "handle": "27129",
  "identifier_other": "etd-04222005-115946",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222005-115946/",
  "identifier_uri": "http://hdl.handle.net/10919/27129",
  "publisher": "Virginia Tech",
  "relation_haspart": "karpuzoglu-sahin.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "lymphocytes",
    "17-b estradiol",
    "C57BL/6 mice",
    "IFN-g",
    "iNOS"
  ],
  "title": "Estrogen Regulates Interferon-gamma (IFN-g) and IFN-g-Inducible iNOS Gene Expression: Implications to Immunity and Autoimmunity",
  "type": "Dissertation"
}