{
  "contributor_author": "Hughes, Kathleen Powers",
  "contributor_committeechair": "Smith, Stephen A.",
  "contributor_committeemember": [
    "Flick, George J. Jr.",
    "Duncan, Robert B. Jr.",
    "Ehrich, Marion F.",
    "Blodgett, Dennis J.",
    "Elvinger, Francois C."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:10:26Z",
  "date_adate": "2003-04-24",
  "date_available": "2014-03-14T20:10:26Z",
  "date_issued": "2003-04-10",
  "date_rdate": "2007-04-29",
  "date_sdate": "2003-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Summer flounder, Paralichthys dentatus, culture is becoming increasingly popular in the United States because of high market prices and consumer demand.  In addition, flounder is a marine fish species that can tolerate a wide range of salinities, allowing for inland intensive fish culture.  Oxytetracycline (OTC) is one of two available FDA-approved antibiotics for use in foodfish in the United States.  Oxytetracycline was chosen for these studies because it is excreted primarily unchanged through the urine and the absorption, distribution and elimination of this drug may be influenced by environmental and physiological conditions.  Four experiments were conducted to investigate: 1) pharmacokinetic parameters of oxytetracycline (50 mg/kg) following intravascular (IV), intraperitoneal (IP), intramuscular (IM) and per os (PO) administration in summer flounder maintained at 28 ppt salinity and 20oC; 2) pharmacokinetic parameters of OTC (50 mg/kg) following IM and PO administration in summer flounder maintained at three different salinity levels of 0 ppt, 15 ppt and 32 ppt and the physiological adjustments summer flounder make to acclimate to environmental salinity; 3) OTC retention times in muscle tissue from summer flounder maintained at three different salinity levels (0 ppt, 15 ppt, 32 ppt) and treated with a single 50 mg/kg OTC dose via IM and PO administration; and 4) pharmacokinetic parameters of OTC (50 mg/kg) following IM and PO administration in clinically healthy and clinically diseased summer flounder maintained at 28 ppt and 20oC.  Oxytetracycline plasma concentrations were determined using high performance liquid chromatography (HPLC) and analyzed using a non-compartmental pharmacokinetic model for all routes of drug administration.   Statistical comparisons were not made between the different routes of OTC exposure, but results from experiment one indicated that IV administration of OTC resulted in the largest area under the curve (AUC) value (8147.9 Âµgâ ¢h/ml) and the highest maximum plasma concentration (Cmax) of 1173.2 Âµg/ml OTC at 5 min post-injection.  Intramuscular injections of OTC resulted in prolonged total body elimination half-life (T Â½) of 301.3 h and high fish-to-fish variability (0.6).  Per os administration resulted in low Cmax (0.2 Âµg/ml OTC) and poor systemic bioavailability (0.2 %).    Results from experiment two demonstrated that when OTC is administered IM AUC estimates are significantly (p<0.05) lower in summer flounder held at 0 ppt (1684.8 Âµgâ ¢h/ml) than fish maintained at 15 ppt or 32 ppt salinity (2067.8 Âµgâ ¢h/ml and 2241.3 Âµgâ ¢h/ml, respectively).  Although not significantly different from other salinity treatments, time to maximum plasma concentration (Tmax) was longer in fish held at 15 ppt and 32 ppt (312 h and 168 h, respectively) compared to cohorts in freshwater (0.5 h) and Cmax values were higher in animals held at 15 ppt and 32 ppt (8.4 Âµg/ml OTC and 9.2 Âµg/ml OTC, respectively) than freshwater fish (4.9 Âµg/ml OTC) when OTC was administered via IM injection.  No significant differences were detected in any of the pharmacokinetic parameters following PO dosing of OTC, however, the AUC estimates were lower in the 32 ppt acclimated fish (127.7 Âµgâ ¢h/ml) than in the 0 ppt or 15 ppt acclimated fish (190.2 Âµgâ ¢h/ml and 180.7 Âµgâ ¢h/ml, respectively).   In addition, the T Â½ was longer in the higher salinity groups (278.1 h and 266.0 h, respectively) than in the freshwater fish group (256.9 h).  Physiological adjustments made by summer flounder including plasma and urine osmolality, urine flow rate and urine character, gill chloride cell size and density, and Na+ - K+ ATPase activity demonstrated trends that suggested physiological differences among the salinity groups.  Plasma and urine osmolalities were typically significantly (p<0.05) higher in fish maintained at 32 ppt salinity than at the lower salinity treatments.  In addition, urine flow rates were generally significantly (p<0.05) greater in freshwater adapted fish (0.13 - 0.21 ml of urine/kg/hour) in comparison to fish in the salinity treatments of 15 ppt and 32 ppt (0.06 - 0.12 ml of urine/kg/hour and 0.09 â   0.11 ml of urine/kg/hour, respectively).   Changes in gill chloride cell size and density and enzyme activity of Na+ - K+ ATPase revealed no significant differences between the salinity treatments but summer flounder in saltwater had numerically larger and more chloride cells than summer flounder in freshwater, but enzyme activity was greater in freshwater acclimated summer flounder compared to fish in seawater.    Experiment three results revealed similar OTC muscle tissue pharmacokinetic parameters in summer flounder following IM injection.  However, there were significant differences (p<0.05) in the AUC parameters of the plasma and muscle OTC concentrations between fish maintained at different salinities following IM OTC treatment.  These effects may be the result of a â  depotâ   effect in the muscle tissue or may be related to the reduced solubility of OTC in the muscle tissue of marine fish.  A single PO dose administration of OTC at 50 mg/kg did not result in plasma or tissue concentrations higher than the FDA tissue tolerance limit of 2 ppm.    Results of the fourth experiment demonstrated that following IM OTC administration healthy fish had significantly (p<0.05) higher AUC (4700.6 Âµgâ ¢h/ml) values than diseased cohorts (2576.2 Âµgâ ¢h/ml).  Maximum plasma concentrations were also higher in the healthy fish than in the diseased fish, although values were not significantly different (23.4 Âµg OTC/ml and 20.2 Âµg OTC/ml, respectively for healthy and diseased fish).  Additionally, in diseased fish, the mean resident time (MRT) (293.7 h) and T Â½ (203.5 h) parameters were longer compared to parameters in healthy fish (253.2 h and 175.4 h, respectively), although values were not significantly different.  No significant differences were detected in any of the pharmacokinetic parameters following PO OTC administration, however, healthy fish achieved higher maximum plasma OTC concentrations (1.0 Âµg OTC/ml) than diseased fish (0.7 Âµg OTC/ml).  Fish-to-fish variation was greater in diseased animals than in healthy regardless of route of drug administration.    The results of these experiments indicated that OTC pharmacokinetic parameters are influenced by route of drug administration, environmental salinity and fish health status.  These factors must be considered by veterinarians and governmental regulators when developing treatment regimens for summer flounder.",
  "description_provenance": [
    "Author Email: khughes@vt.edu",
    "Advisor Email: flickg@vt.edu",
    "Advisor Email: duncanr@vt.edu",
    "Advisor Email: marion@vt.edu",
    "Advisor Email: dblod@vt.edu",
    "Advisor Email: stsmith7@vt.edu",
    "Advisor Email: elvinger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:26Z (GMT). No. of bitstreams: 5 05rawdata.pdf: 78385 bytes, checksum: 4836998c134ca2a85896bc847ffb1184 (MD5) 01PhD.pdf: 1187285 bytes, checksum: 3d7d402d7ccd0c9ddf30fd7bc784bf99 (MD5) 04rawdata.pdf: 68161 bytes, checksum: 4d3bb884f204f1f25f79d7c2ae6d7788 (MD5) 03rawdata.pdf: 414811 bytes, checksum: 6aae8fb7082d9659d28b12a87e41d02f (MD5) 02rawdata.pdf: 92815 bytes, checksum: e797b98f2b36ce49079613d8b4c0bbbe (MD5)   Previous issue date: 2003-04-10"
  ],
  "handle": "27121",
  "identifier_other": "etd-04222003-150752",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222003-150752/",
  "identifier_uri": "http://hdl.handle.net/10919/27121",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "05rawdata.pdf",
    "01PhD.pdf",
    "04rawdata.pdf",
    "03rawdata.pdf",
    "02rawdata.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "pharmacokinetics",
    "residue",
    "flounder",
    "Paralichthys",
    "oxytetracycline"
  ],
  "title": "PHARMACOKINETIC STUDIES AND TISSUE RESIDUE ANALYSIS OF OXYTETRACYCLINE IN SUMMER FLOUNDER (PARALICHTHYS DENTATUS) MAINTAINED AT DIFFERENT PRODUCTION SALINITIES AND STATES OF HEALTH",
  "type": "Dissertation"
}