{
  "contributor_author": "Currie, Rebecca J.",
  "contributor_committeechair": "Cherry, Donald S.",
  "contributor_committeemember": [
    "Cairns, John  Jr.",
    "Heath, Alan G.",
    "Zipper, Carl E.",
    "Ney, John J.",
    "Johnson, David M."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:10:28Z",
  "date_adate": "1999-05-07",
  "date_available": "2014-03-14T20:10:28Z",
  "date_issued": "1999-04-14",
  "date_rdate": "2000-05-07",
  "date_sdate": "1999-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>In July of 1993 an underground coal mine owned and operated by Southern Ohio coal company (SOCCO) underwent emergency recovery operations due to flash flooding of the mine from an adjacent abandoned mine.  During mine dewatering operations, approximately 132,650 liters per minute of acid mine water was released into the Parker Run tributary draining into Leading Creek.  The 24.2-km section of Leading Creek was heavily impacted eradicating most aquatic organisms.  An acutely toxic impact resulted from the discharge of high conductivity (~6000µmhos), low pH (2.5-3.1 pH units), high metal concentrations (iron and iron floc, manganese, copper, nickel, zinc and aluminum, mg/L) and high total suspended solids (TSS).    <p>Through the process of a Consent Decree, a proactive plan was developed for monitoring the recovery in Leading Creek and to develop an enhancement plan for the watershed.  SOCCO set aside $1.9 million that has grown to $2.5 million to cover the costs of implementing specific enhancement measures in the watershed.  The primary goal of the enhancement plan was to describe actions that could reasonably be taken to affect measurable ecological rehabilitation or enhancement of the Leading Creek stream system so it attains the highest Ohio EPA aquatic life use designation possible.  The objectives of this research project were to identify specific ecosystem stressors affecting the habitat quality within the watershed preventing Leading Creek from attaining either the Warmwater Habitat (WWH) or the Excellent Warmwater Habitat (EWH) designation and to provide potential remediation techniques to address the identified stressors.  <p>Although natural processes have lead to partial recovery in Leading Creek from the impact of dewatering, reconnaissance has shown significant problems relating to toxicity and habitat degradation in the watershed.  Seventeen tributaries and ten mainstem stations were chosen to receive monthly monitoring as point source discharges, including biological, chemical, toxicological, and hydrological sampling.  Specific ecotoxicological parameters studied included water and sediment quality, algal colonization upon artificial substrates, benthic macroinvertebrate sampling (qualitatively and quantitatively), acute water column toxicity, sediment chronic toxicity and in situ clam toxicity.  Evaluation of habitat impairment included habitat assessments, in-stream riparian surveys and land use analysis.   <p>Through the analysis of laboratory and field data, agriculture and Abandoned Mined Land (AML) were identified as the two main stressors in the watershed.  Agricultural practices contributed chronic toxicity through habitat degradation identified from benthic macroinvertebrate data and sediment depth measurements.   AML impacted several tributaries and the Leading Creek mainstem by degrading water quality through the introduction of acidic waters, high in conductivity and heavy metals.  Acid Mine Drainage (AMD) from the AML areas was pinpointed through acute testing with Ceriodaphnia dubia and in situ testing with the Asian clam, Corbicula fluminea.  Active mining effluents from the Meigs #2 and Meigs #31 mines influenced the Ogden Run and Parker Run tributaries with conductivity values ranging from 2000 to 6000 mmhos/cm, respectively.  The influence of the active mine effluents was observed down the mainstem from LCS6 to LCS10 in the form of high conductivity (~1200 mmhos/cm) and increased pH values (~8.0).   <p>Development of the enhancement plan began with the ranking of the ten mainstem stations and 17 tributary stations based on prioritization of impact parameters using an Ecotoxicological Rating (ETR) developed specifically for the Leading Creek watershed.  The ETR included biological, toxicological, chemical and physical data to integrate a complete description of the impacts affecting the Leading Creek watershed.  The 23 parameters in the ETR for the mainstem stations were; sediment depth, acidic pH, quantitative Invertebrate Community Index (ICI) scores, conductivity, clam in situ survival and growth, Daphnia magna and Chironomus tentans sediment toxicity, stormwater acute toxicity, qualitative invertebrate richness and Ephemeroptera, Plecoptera and Trichoptera (EPT) abundance, percent AML area, concentrations of sodium, copper, zinc, iron, manganese, chloride, nitrate/nitrite, ammonia, TSS, plus Qualitative Habitat Evaluation Index (QHEI) and United States Environmental Protection Agency (US EPA) habitat scores.  For the mainstem stations, low flow in the summer was substituted for quantitative ICI scores.  The ETR provided a single numerical score of 200 points that allowed comparisons to be made between sites within Leading Creek and tributaries within the watershed.  Stressors identified within the watershed and used in the ranking of sites included agricultural sedimentation, sedimentation from AML, poor water quality from AMD and multiple toxic inputs such as acute stormwater runoff.   Remediation techniques and costs were described to address poor agricultural practices and designed to alleviate sedimentation within the mainstem.  Remediation techniques for AMD were described but due to the enormous amount of AML within the Leading Creek watershed, costs and specific projects were deemed beyond the scope of this research project.",
  "description_provenance": [
    "Author Email: rcurrie@vt.edu",
    "Advisor Email: dcherry@vt.edu",
    "Advisor Email: AHEATH@vt.edu",
    "Advisor Email: czip@vt.edu",
    "Advisor Email: jney@mail.vt.edu",
    "Advisor Email: djohnson@ferrum.edu",
    "Made available in DSpace on 2014-03-14T20:10:28Z (GMT). No. of bitstreams: 1 etdnew.pdf: 1566808 bytes, checksum: 6fab1cf1f64e7cc2c58c5b713b264519 (MD5)   Previous issue date: 1999-04-14"
  ],
  "handle": "27138",
  "identifier_other": "etd-042299-053420",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042299-053420/",
  "identifier_uri": "http://hdl.handle.net/10919/27138",
  "publisher": "Virginia Tech",
  "relation_haspart": "etdnew.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Watershed Enhancement",
    "Ecosystem stressors",
    "Ecotoxicological Rating"
  ],
  "title": "Identification of Ecosystem Stressors in Developing an Enhancement Plan for the Leading Creek Watershed, Meigs County, Ohio",
  "type": "Dissertation"
}