{
  "contributor_author": "Yu, Hyun  Young",
  "contributor_committeechair": "Esen, Asim",
  "contributor_committeecochair": "Bevan, David R.",
  "contributor_committeemember": [
    "Walker, Richard A.",
    "Yang, Zhaomin",
    "Kittur, Farooqahmed S."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:10:28Z",
  "date_adate": "2009-05-22",
  "date_available": "2014-03-14T20:10:28Z",
  "date_issued": "2009-04-10",
  "date_rdate": "2009-05-22",
  "date_sdate": "2009-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ï ¢Î²-Glucosidase zymograms of certain maize genotypes (nulls) do not show any activity bands after electrophoresis. We have shown that a chimeric lectin called Î²-glucosidase aggregating factor (BGAF) is responsible for the absence of Î²-glucosidase activity bands on zymograms. BGAF specifically binds to maize Î²-glucosidase isozymes Glu1 and Glu2 and forms large, insoluble complexes. Furthermore, we have previously shown that the N-terminal (Glu50-Val145) and the C-terminal (Phe466-Ala512) regions contain residues that make up the BGAF binding site on maize Glu1. However, sequence comparison between sorghum Î²-glucosidases (dhurrinases, Dhr1 and Dhr2), to which BGAF does not bind, and maize Î²-glucosidases, and an examination of the 3-D structure of Glu1 suggested that the BGAF binding site on Glu1 is much smaller than predicted previously. To define more precisely the BGAF binding site, we constructed additional chimeric Î²-glucosidases. The results showed that a region spanning 11 amino acids (Ile72-Thr82) on Glu1 is essential and sufficient for BGAF binding, whereas the extreme N-terminal region Ser1-Thr29, together with C-terminal region Phe466-Ala512, affects the size of Glu1-BGAF complexes. To determine the importance of each region for binding, we determined the dissociation constants (Kd) of chimeric Î²-glucosidase-BGAF interactions. The results demonstrated that the extreme N-terminal and C-terminal regions are important but not essential for binding. To confirm the importance of Ile72-Thr82 on Glu1 for BGAF binding, we constructed chimeric Dhr2 (C-11, Dhr2 whose Val72-Glu82 region was replaced with the Ile72-Thr82 region of Glu1). C-11 binds to BGAF, indicating that the Ile72-Thr82 region is indeed a major interaction site on Glu1 involved in BGAF binding. We also constructed mutant Î²-glucosidases to identify and define the contribution of individual amino acids in the above three regions to BGAF binding. In the N-terminal region (Ile72-Thr82), critical region for BGAF binding, Glu1 mutants K81E and T82Y failed to bind BGAF in the gel-shift assay and their frontal affinity chromatography (FAC) profiles were essentially similar to that of sorghum Î²-glucosidase (dhurrinase 2, Dhr2), a non-binder, indicating that these two amino acids within Ile72-Thr82 region are essential for BGAF binding. In the extreme N-terminal (Ser1-Thr29) and C-terminal (Phe466-Ala512) regions,  N481E [substitution of asparagine-481 with glutamic acid (as in Dhr)] showed lower affinity for BGAF, whereas none of the single amino acid substitutions in the Ser1-Thr29 region showed any effect on BGAF binding indicating that these regions play a minor role. To further confirm the importance of lysine-81 and threonine-82 for BGAF binding, we produced a number of Dhr2 mutants, and the results showed that all four unique amino acids (isoleucine-72, asparagine-75, lysine-81, and threonine-82) of Glu1 in the peptide span Ile72-Thr82 are required to impart BGAF binding ability to Dhr2. The sequence comparison among plant Î²-glucosidases supports the hypothesis that BGAF binding is specific to maize Î²-glucosidases because only maize Î²-glucosidases have threonine at position 82.",
  "description_provenance": [
    "Author Email: yhy0922@vt.edu",
    "Advisor Email: rawalker@exchange.vt.edu",
    "Advisor Email: zmyang@vt.edu",
    "Advisor Email: drbevan@exchange.vt.edu",
    "Advisor Email: aevatan@vt.edu",
    "Advisor Email: kitturf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:28Z (GMT). No. of bitstreams: 1 Dissertation_Hyun_Young_Yu.pdf: 3965699 bytes, checksum: 663847ab4f9ec6be362471fd9c7ba822 (MD5)   Previous issue date: 2009-04-10"
  ],
  "handle": "27135",
  "identifier_other": "etd-04222009-131105",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222009-131105/",
  "identifier_uri": "http://hdl.handle.net/10919/27135",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Hyun_Young_Yu.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Î²-glucosidase aggregating factor (BGAF)",
    "Î²-glucosidase",
    "protein-protein interaction"
  ],
  "title": "Determination of the Binding Site and the Key Amino Acids on Maize Î²-Glucosidase Isozyme Glu1 Involved in Binding to Î²-Glucosidase Aggregating Factor (BGAF)",
  "type": "Dissertation"
}