{
  "contributor_author": "Wonnapinij, Passorn",
  "contributor_committeechair": "Dr. David C. Samuels",
  "contributor_committeemember": [
    "Dr. Edward J. Smith",
    "Dr. Ina Hoeschele",
    "Dr. Ronald M. Lewis",
    "Dickerman, Allan W."
  ],
  "contributor_department": "Genetics, Bioinformatics, and Computational Biology",
  "date_accessioned": "2014-03-14T20:10:28Z",
  "date_adate": "2010-05-07",
  "date_available": "2014-03-14T20:10:28Z",
  "date_issued": "2010-04-09",
  "date_rdate": "2013-05-21",
  "date_sdate": "2010-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Mitochondrial DNA (mtDNA) mutations have been widely observed to cause a variety of human diseases, especially late-onset neurodegenerative disorders. The prevalence of mitochondrial diseases caused by mtDNA mutation is approximately 1 in 5,000 of the population. There is no effective way to treat patients carrying pathogenic mtDNA mutation; therefore preventing transmission of mutant mtDNA became an important strategy. However, transmission of human mtDNA mutation is complicated by a large intergenerational random shift in heteroplasmy level causing uncertainty for genetic counseling. The aim of this dissertation is to gain insight into how human mtDNA heteroplasmy is inherited.<p> By working closely with our experimental collaborators, the computational simulation of mouse embryogenesis has been developed in our lab using their measurements of mouse mtDNA copy number. This experimental-computational interplay shows that the variation of offspring heteroplasmy level has been largely generated by random partition of mtDNA molecules during pre- and early postimplantation development.<p> By adapting a set of probability functions developed to describe the segregation of allele frequencies under a pure random drift process, we now can model mtDNA heteroplasmy distribution using parameters estimated from experimental data. The absence of an estimate of sampling error of mtDNA heteroplasmy variance may largely affect the biological interpretation drawn from this high-order statistic, thereby we have developed three different methods to estimate sampling error values for mtDNA heteroplasmy variance. Applying this error estimation to the comparison of mouse to human mtDNA heteroplasmy variance reveals the difference of the mitochondrial genetic bottleneck between these organisms.<p> In humans, the mothers who carry a high proportion of m.3243A>G mutation tend to have fewer daughters than sons. This offspring gender bias has been revealed by applying basic statistical tests on the human clinical pedigrees carrying this mtDNA mutation. This gender bias may partially determine the mtDNA mutation level among female family members.<p> In conclusion, the application of population genetic theory, statistical analysis, and computational simulation help us gain understanding of human mtDNA heteroplasmy inheritance. The results of these studies would be of benefit to both scientific research and clinical application.",
  "description_provenance": [
    "Author Email: wonnapp@vt.edu",
    "Advisor Email: esmith@vt.edu",
    "Advisor Email: inah@vt.edu",
    "Advisor Email: rmlewis@vt.edu",
    "Advisor Email: david.samuels@chgr.mc.vanderbilt.edu",
    "Advisor Email: dickerman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:28Z (GMT). No. of bitstreams: 1 Wonnapinij_P_D_2010.pdf: 4073362 bytes, checksum: d3ae9e61385f940d60e1028c4b3f54d1 (MD5)   Previous issue date: 2010-04-09"
  ],
  "handle": "27136",
  "identifier_other": "etd-04222010-001713",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222010-001713/",
  "identifier_uri": "http://hdl.handle.net/10919/27136",
  "publisher": "Virginia Tech",
  "relation_haspart": "Wonnapinij_P_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mutation level variance",
    "offspring gender bias",
    "Kimura distribution",
    "mitochondrial genetic bottleneck",
    "sampling error"
  ],
  "title": "Theoretical and Statistical Approaches to Understand Human Mitochondrial DNA Heteroplasmy Inheritance",
  "type": "Dissertation"
}