{
  "contributor_author": "Corus, Canan",
  "contributor_committeechair": "Brinberg, David L.",
  "contributor_committeemember": [
    "Nakamoto, Kent",
    "Ozanne, Julie L.",
    "Weaver, Kimberlee D."
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:10:28Z",
  "date_adate": "2008-05-05",
  "date_available": "2014-03-14T20:10:28Z",
  "date_issued": "2008-04-09",
  "date_rdate": "2008-05-05",
  "date_sdate": "2008-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "At risk individuals tend to avoid information that might perturb their sense of security.  I propose certainty appraisal as an important emotional dimension that affects health message processing and persuasion.   Specifically, I suggest that emotions high on certainty appraisal can provide confidence to cope with the insecurity instigated by threatening health communications.    Five studies are proposed to demonstrate the interaction of certainty appraisal with two health message characteristics: vulnerability to threat and response efficacy.   Studies 1-3 provide evidence that when a health threat is highly self-relevant uncertainty related emotions impede processing whereas certainty related emotions facilitate it.  Studies 4-5 show that individuals who are feeling uncertain prefer to attend a high efficacy message as it offers reassurance via useful recommendations.    The findings extend affect regulation theories to involve emotional uncertainty as a state to be \"repaired\" by avoiding further deterioration or striving for restoration.",
  "description_provenance": [
    "Author Email: ccorus@vt.edu",
    "Advisor Email: dbrinber@vt.edu",
    "Advisor Email: nakamoto@vt.edu",
    "Advisor Email: jozanne@vt.edu",
    "Advisor Email: kdweaver@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:28Z (GMT). No. of bitstreams: 1  CananCorus_ETD.pdf: 732302 bytes, checksum: 7eaf935f7bc4c34e9ecf8af8f3bb05d7 (MD5)    Previous issue date: 2008-04-09"
  ],
  "handle": "27133",
  "identifier_other": "etd-04222008-145825",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222008-145825/",
  "identifier_uri": "http://hdl.handle.net/10919/27133",
  "publisher": "Virginia Tech",
  "relation_haspart": "CananCorus_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Emotions",
    "Information Processing",
    "Consumer Health"
  ],
  "title": "Emotional Certainty and Health Communications",
  "type": "Dissertation"
}