{
  "contributor_author": "Parrish, Alvera Jarrett",
  "contributor_committeechair": "Asselin, Susan B.",
  "contributor_committeemember": [
    "Salmon, Richard G.",
    "Fortune, Jimmie C.",
    "deFur, Sharon H."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:27Z",
  "date_adate": "2006-04-27",
  "date_available": "2014-03-14T20:10:27Z",
  "date_issued": "2006-04-21",
  "date_rdate": "2007-04-27",
  "date_sdate": "2006-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This study explored the role of special education administrators in coordination of secondary transition services for students with disabilities in Virginia. A survey was designed and administered that examined their perceptions of the effect of (a) work load, size of the school district, wealth, setting, and staff support on level of importance, b) the relationships between levels of importance and involvement, c) the effect of size of the school district and staff support, and d) recommendations for improvement of transition services. \tAnalysis of the data revealed that special education administrators perceived level of importance for the coordination of transition services is high. Analysis of factors impacting the level of importance revealed eleven transition services that had a positive effect on staff support, size of school district, and full/part time special education administrators. The strongest positive relationships for staff support were the school principal and the special education teacher.  The school principal impacted six of the eleven transition services identified, while the special education teacher impacted two of the transition services. Full/part time special education administrators had an impact on research and evaluating best practices, while size influenced two of the variables.\t \tThe correlation between levels of importance and involvement revealed significant correlation between 40% of the transition services. Special education administrators reported they were more likely to utilize others to coordinate the highest level of involvement in the coordination of services. Size of the school district had a positive effect on the resources needed for coordination of transition services. Time, financial, and community resources were identified as the greatest need for coordination of services.  \tRecommendations for improvement of implementation of transition services clustered into eight categories. However, the greatest number of recommendations from respondents were (a) additional staff employed for the specific purpose of coordination and delivery of transition services, (b) increased community resources to establish linkages with agencies and other related services, (c) additional staff development focused on transition programming, and clarification of the new IDEIA 2004 transition requirements, and (d) federal funding for mandated positions, to provide more equity and commitment to citizens with disabilities in Virginia.",
  "description_provenance": [
    "Author Email: aparrish@vt.edu",
    "Advisor Email: sasselin@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: fortunejc@vt.edu",
    "Advisor Email: shdefu@wm.edu",
    "Made available in DSpace on 2014-03-14T20:10:27Z (GMT). No. of bitstreams: 1 aparrish.pdf: 257633 bytes, checksum: 20ae9673ca66217655e5d40c27141820 (MD5)   Previous issue date: 2006-04-21"
  ],
  "handle": "27131",
  "identifier_other": "etd-04222006-213530",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222006-213530/",
  "identifier_uri": "http://hdl.handle.net/10919/27131",
  "publisher": "Virginia Tech",
  "relation_haspart": "aparrish.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "transition planning",
    "director of special education",
    "special education administrators",
    "leadership"
  ],
  "title": "Special Education Administrators' Role and Impact in Providing Secondary Transition Services to Students",
  "type": "Dissertation"
}