{
  "contributor_author": "Dalton, Joseph C.",
  "contributor_committeechair": "Saacke, Richard G.",
  "contributor_committeemember": [
    "Nebel, Raymond L.",
    "Bailey, Thomas L.",
    "Lewis, Gregory S.",
    "Grayson, Randolph Larry"
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:10:29Z",
  "date_adate": "1999-04-23",
  "date_available": "2014-03-14T20:10:29Z",
  "date_issued": "1999-04-09",
  "date_rdate": "2000-04-23",
  "date_sdate": "1999-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "To identify factors important to the efficiency of artificial insemination in cattle, four studies were conducted. In the first study, the addition of cream to the inseminate was used in an attempt to increase accessory sperm number. On d 6 after insemination, 60 embryos were evaluated. The addition of cream to the inseminate had no effect on accessory sperm number. In the second study, cryopreserved semen of a marked bull (spermatozoa exhibiting a semi-flattened anterior head) was matched with semen from an unmarked bull (conventional sperm head shape) to determine competitively the effect of a deep uterine insemination on accessory sperm number. Forty embryos were recovered 6 d after insemination and the ratio of accessory sperm observed was different: 62:38 for unmarked semen in the uterine body and marked semen in the uterine horn, and 72:28 for unmarked semen in the uterine horn and marked semen in the uterine body (P < .05). In the third study, superovulated cows were utilized to determine the effect of artificial insemination time on fertilization status and accessory sperm number. Cows were inseminated once at 0 h (n=10), 12 h (n=10), or 24 h (n=10) after the first standing event. On d 6 after insemination, 529 embryos(ova) were recovered. Fertilization rates were 29% (0 h); 60% (12 h); and 81% (24 h)(P < .01). Percentages of embryos with accessory sperm were: 5 (0 h); 8 (12 h); and 41(24 h) (P < .01). In the fourth study, three experiments utilizing superovulated cows were conducted to provide a basis for distinguishing unfertilized ova from very early embryonic death. In Exp. 1, recovered d 6 unfertilized ova were classified morphologically as either: 1) typical, 2) satellite, or 3) fragmented. In Exp. 2, recovered d 6 unfertilized ova from the third study were classified morphologically, and typical ova were fixed. In Exp. 3, ultrastructural features of preovulatory, tubal-stage, and typical d 6 unfertilized ova were investigated. Preovulatory ova revealed normal ultrastructure; tubal-stage ova exhibited evidence of degeneration; typical d 6 ova were degenerated and contained no discernable organelles. The first three studies support the use of accessory sperm evaluation as an alternative measure of fertility. The final study provides a basis from which future embryologists may distinguish fertilization failure from very early embryonic death.",
  "description_provenance": [
    "Author Email: jodalto2@vt.edu",
    "Advisor Email: rnebel@vt.edu",
    "Advisor Email: baileytl@vt.edu",
    "Advisor Email: glewis@vt.edu",
    "Advisor Email: ragrayso@vt.edu",
    "Advisor Email: saacke@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:29Z (GMT). No. of bitstreams: 1 ETD.PDF: 479604 bytes, checksum: dfb380ef1f78f57410a743a71dc19c99 (MD5)   Previous issue date: 1999-04-09"
  ],
  "handle": "27139",
  "identifier_other": "etd-042299-071254",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042299-071254/",
  "identifier_uri": "http://hdl.handle.net/10919/27139",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "accessory sperm",
    "artificial insemination",
    "cattle",
    "superovulation"
  ],
  "title": "Factors Important to the Efficiency of Artificial Insemination in Single-Ovulating and Superovulated Cattle",
  "type": "Dissertation"
}