{
  "contributor_author": "Telleria, Gabriel Martin",
  "contributor_committeechair": "Dudley, Larkin S.",
  "contributor_committeemember": [
    "Hult, Karen M.",
    "Jensen, Laura S.",
    "Mercado, Sergio Ramirez",
    "Wolf, James F."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:10:28Z",
  "date_adate": "2011-05-03",
  "date_available": "2014-03-14T20:10:28Z",
  "date_issued": "2011-04-06",
  "date_rdate": "2011-05-03",
  "date_sdate": "2011-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Sandinista Revolution is arguably the most significant event in Nicaraguan history.  Because of its historical importance and distinctive socio-cultural context, the Sandinista Revolution offers significant opportunities for scholarly inquiry.  The literature on the Sandinista Revolution is substantial.  However, little is known about the organization Sandinista National Liberation Front (FSLN) and how it evolved into the leader of the movement which sought to overthrow the 45-year Somoza dictatorship.  In revolutionary literature, the concept of revolutionary vanguard or vanguard party is common.  However, the notion of vanguardism as a process and what constitutes a vanguardist organization is yet to be explored.  This study aims to provide such an investigation, through an examination of the insurrectional period (1974-1979) leading up to the Sandinista Revolutionary Victory in 1979.  Grounded in Scott창  s (2008) institutional framework, this study describes the evolution of the FSLN into the vanguard of the anti-Somoza movement, identifying relationships between institutional elements involved in the FSLN창  s institutionalization process and progression into 창  leader창   of the movement.  Data from interviews, newspaper articles, and video documentaries were scrutinized in search of answers to the question:  How do mechanisms, carriers, and agency as elements of institutions explain vanguardism in the case study of the FSLN?  This research reveals critical mechanisms, carriers and agency in the vanguardism of the FSLN, and explains how these elements supported this process.  In this sense, this research reveals distinctive characteristics in vanguardism as an institutional process, which differentiate vanguardism from other processes.  This research presents an opportunity to learn about the FSLN-a vastly unique politico-military organization.  Additionally, there is an opportunity to broaden our observational lens, taking a neoinstitutional approach, to illustrate new ways in which organizations evolve, change and adapt to their environments.  Lastly, this study hopes to pave the way for future studies in organizational vanguardism.",
  "description_provenance": [
    "Author Email: telleria@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Advisor Email: jensen7@vt.edu",
    "Advisor Email: srm@ibw.com.ni",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:28Z (GMT). No. of bitstreams: 2 Telleria_GM_D_2011.pdf: 3759865 bytes, checksum: 0b79fc6997d1d388d3ba797c964e0515 (MD5) Telleria_GM_D_2011_IRB.pdf: 540941 bytes, checksum: bcb40e42947c6e0f211e9e718ba82117 (MD5)   Previous issue date: 2011-04-06"
  ],
  "handle": "27137",
  "identifier_other": "etd-04222011-150848",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04222011-150848/",
  "identifier_uri": "http://hdl.handle.net/10919/27137",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Telleria_GM_D_2011.pdf",
    "Telleria_GM_D_2011_IRB.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "institutionalization",
    "organizations",
    "FSLN",
    "Sandinistas",
    "Vanguardism"
  ],
  "title": "From Vandals to Vanguard: Vanguardism through a Neoinstitutional Lens: Case Study of the Sandinista National Liberation Front",
  "type": "Dissertation"
}