{
  "contributor_author": "Lynch, Terence Lamont",
  "contributor_committeechair": "Hillison, John H.",
  "contributor_committeemember": [
    "Camp, William G.",
    "Stewart, Daisy L.",
    "Ford, Carey",
    "Tlou, Josiah S."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:30Z",
  "date_adate": "2001-04-25",
  "date_available": "2014-03-14T20:10:30Z",
  "date_issued": "2001-04-17",
  "date_rdate": "2002-04-25",
  "date_sdate": "2001-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examined the factors that influence minorities to enroll in agricultural science programs at Virginia Tech.  Minorities have been and continue to be under-represented in most areas of the agricultural sciences.  The presence of African-American and other minority students in the agricultural sciences is, therefore, very important.  Enrollment numbers in programs across the country indicate that agriculture, does not appeal to many minority groups.  Wardlow, Graham, & Scott (1995) noted that there is little doubt that minorities are underrepresented in academic departments at land-grant universities, professional roles in agricultural industries, and in governmental agencies such as the United States Department of Agriculture (USDA).     The data collection in this study was through a survey developed by the researcher.  The population in this study consisted of minority undergraduate and graduate students in the Minority Academic Opportunities Program (MAOP) and Minorities in Agriculture, Natural Resources, and Related Sciences (MANRRS) organization at Virginia Tech.   The respondents in this study selected agricultural science as a major due to their personal decision, input form family members and friends, and the guidance form a high school or faculty member.  They also noted there was opportunity for them in the agricultural sciences and felt that professors, administrators and students within the department were fair and supportive.  Financial assistance was an important factor in the student's decision enrolling in the program, and the majority of the respondents were receiving financial assistance.  However, the respondents noted that they would be enrolled if they were not receiving financial assistance and felt they had the opportunity to succeed in the agricultural sciences at Virginia Tech",
  "description_provenance": [
    "Author Email: tlynch@vt.edu",
    "Advisor Email: hillison@vt.edu",
    "Advisor Email: wgcamp@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: cford@lorman.alcorn.edu",
    "Advisor Email: tlou@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:30Z (GMT). No. of bitstreams: 3 Appendices.PDF: 53254 bytes, checksum: e7659b3b0a73262011f3facff7e5e21c (MD5) TitlePages.pdf: 19431 bytes, checksum: 685fa23a83bc4eb974c51527b047b3c3 (MD5) Body.pdf: 203200 bytes, checksum: ef5d81d713e6cea70271a8f9571f4398 (MD5)   Previous issue date: 2001-04-17"
  ],
  "handle": "27147",
  "identifier_other": "etd-04232001-115710",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232001-115710/",
  "identifier_uri": "http://hdl.handle.net/10919/27147",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Appendices.PDF",
    "TitlePages.pdf",
    "Body.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Recruitment",
    "Land-grant Institutions Minorities",
    "Agricultural Sciences"
  ],
  "title": "Factors Influencing the Enrollment of Minorities in Agricultural Science Programs at Virginia Tech",
  "type": "Dissertation"
}