{
  "contributor_author": "Chen, Zhuo",
  "contributor_committeechair": "Yoon, Roe-Hoan",
  "contributor_committeemember": [
    "Basilio, Cesar I.",
    "Rimstidt, james Donald",
    "Adel, Gregory T.",
    "Luttrell, Gerald H."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:10:29Z",
  "date_adate": "1999-04-24",
  "date_available": "2014-03-14T20:10:29Z",
  "date_issued": "1998-08-07",
  "date_rdate": "2000-04-24",
  "date_sdate": "1999-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "(ABSTRACT)  Carbon matrix composite (CMC) electrode and surface conducting (SC) electrode have been developed to study the copper-activation and the subsequent xanthate adsorption on insulating sphalerite.  Fabricating CMC electrode involves embedding sphalerite particles in carbon to form a carbon matrix composite; and SC electrode is designed by contacting a platinum wire to the sphalerite surface.  When these electrodes are activated by heavy metal ions such as copper, a conducting layer is formed on the mineral surfaces that allows dynamic electrochemical studies to be conducted.  Voltammetric studies on the copper activated CMC:ZnS electrodes in inert electrolytes show that  although the activation product and kinetics may differ with pH, copper-activation occurs at all pH ranges.  At acidic pH, a Cu2S-like activation product was formed at open circuit. When activation was conducted at near neutral and alkaline pH at open circuit, the surface products formed were identified to be CuS-like.  It was also established that the amount of copper uptaken by sphalerite is strongly dependent on the time of activation and on the electrochemical potential applied during activation.  Activation at potentials positive of the rest potential decreases the amount of copper on the surface.  Indeed, activation at potentials of 50 to 100 mV more positive of the rest potential in the activating solution completely inhibits copper activation.  This result is consistent with the anodic stripping voltammetry that shows copper can be removed from the surface of sphalerite at oxidizing potentials.  Activation at potentials mildly negative of the rest potential causes a progressive increase in the amount of copper on the surface, consistent with the diffusion controlled reduction process between ZnS and Cu2+ ions observed in the activating solution.  At very low potentials, however, elemental copper is formed, which may worsen the selectivity of the sphalerite flotation. Controlled potential contact angle measurements showed that xanthate adsorption does occur on copper-activated sphalerite at all pH ranges.  However, the contact angles and flotation recovery decrease at near neutral pH.  This problem is caused by the adsorption of the copper-hydroxy species on the activated sphalerite surface.  It was found that addition of small amount of complexing reagent can improve the flotation recovery at the near neutral pH.   The results obtained in the present work show that potential control of the activation process can provide a means of controlling copper uptake and, hence, the selectivity and recovery of sphalerite flotation.  The development of CMC:ZnS and SC:ZnS electrodes provides a practical and reliable way to quantitatively estimate the amount of copper uptake on sphalerite surface after activation.",
  "description_provenance": [
    "Author Email: chenz@caer.uky.edu",
    "Advisor Email: cesar.basilio@thielekaolin.com",
    "Advisor Email: jdro2@vt.edu",
    "Advisor Email: adel@vt.edu",
    "Advisor Email: glutz@vt.edu",
    "Advisor Email: ryoon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:29Z (GMT). No. of bitstreams: 12 chapter8.PDF: 30564 bytes, checksum: 892e0fb8ee94393bcc8be6dd9db42394 (MD5) abstract.PDF: 35572 bytes, checksum: 14a0a2e7616c697eb536c8c2ee3446e8 (MD5) chapter1.PDF: 62170 bytes, checksum: a37dc904678321043a03e0efc4ce5783 (MD5) title.PDF: 3850 bytes, checksum: e3e615118251bdf321eafa9d8d4f6216 (MD5) vita.PDF: 3986 bytes, checksum: fa75fa084cdceff91c73929580fcc7ce (MD5) appendix.PDF: 31739 bytes, checksum: 5904a76ffc1ce8b5fee8b8341e208d0b (MD5) chapter7.PDF: 260986 bytes, checksum: 2a1c036fda32f6bbb34eea327a4b26dc (MD5) chapter6.PDF: 73820 bytes, checksum: 2361d8a688a0b8add3e06276ad597554 (MD5) chapter5.PDF: 105630 bytes, checksum: 084362e72db1e4f25b9c7a19e07978e8 (MD5) chapter3.PDF: 74459 bytes, checksum: 99c2daeeab59f0791f0a981ea3bb3368 (MD5) chapter2.PDF: 286537 bytes, checksum: 5ed50e781a87470ad3f43a71a0b53ccb (MD5) chapter4.PDF: 169478 bytes, checksum: 0ac0a7ae1ae060604b9b939b71a8d3d1 (MD5)   Previous issue date: 1998-08-07"
  ],
  "handle": "27142",
  "identifier_other": "etd-042299-171817",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042299-171817/",
  "identifier_uri": "http://hdl.handle.net/10919/27142",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chapter8.PDF",
    "abstract.PDF",
    "chapter1.PDF",
    "title.PDF",
    "vita.PDF",
    "appendix.PDF",
    "chapter7.PDF",
    "chapter6.PDF",
    "chapter5.PDF",
    "chapter3.PDF",
    "chapter2.PDF",
    "chapter4.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Xanthate Collector",
    "Copper-Activation",
    "Flotation",
    "Electrochemistry",
    "Pyrite",
    "Sphalerite"
  ],
  "title": "Electrochemical Studies of Copper-Activation of Sphalerite and Pyrite",
  "type": "Dissertation"
}