{
  "contributor_author": "Smith, John Edwin",
  "contributor_committeecochair": [
    "Parson, Stephen R.",
    "Yakimowski-Srebnick, Mary E."
  ],
  "contributor_committeemember": [
    "Twiford, Travis W.",
    "Blankenship, Strader E.",
    "Dawson, Christina M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:30Z",
  "date_adate": "2001-04-27",
  "date_available": "2014-03-14T20:10:30Z",
  "date_issued": "2001-04-17",
  "date_rdate": "2002-04-27",
  "date_sdate": "2001-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The Third International Mathematics and Science Study (1995) and the National Assessment of Educational Progress results (1996) indicate that the United States has not reached the goal of being first in the world in mathematics and science achievement established by the Goals 2000 Act. Many states have adopted the National Council of Teachers of Mathematics standards for mathematics instruction, which call for the integration of computer technology, in an effort to improve international and national mathematics achievement results. Recent research  (e.g., Anderson & Koedinger, 1995, Mann, Shakeshaft, Becker, & Kotkamp, 1999) has reported significant increases in student achievement in mathematics through the use of intelligent tutoring software such as the Carnegie Algebra Tutor. This study built upon this body research on computer technology and how it can be effectively integrated into classrooms to impact student achievement and attitude. In particular, the effect of the Carnegie Algebra Tutor on student achievement and attitude towards mathematics in an introductory high school Algebra course was examined. The quantitative portion of the study used a non-equivalent control group design. The population of the study consisted of 445 students. Student achievement was measured using scale scores on the Virginia Algebra I SOL assessment with the Total Mathematics portion of the Stanford 9 Ta as covariate. Student attitudes were measured using a shortened version of the Fennema-Sherman Mathematics Attitude Scales survey. Independent variables included the treatment condition, race/ethnicity, and gender.  An ANCOVA was conducted to determine achievement effects, while ANOVA was conducted to determine attitude effects. The qualitative portion of the study consisted of student and teacher focus groups. It was through these focus group sessions that program implementation issues and cognitive and affective effects on students and teachers were examined. Analysis revealed statistically significant mean achievement differences between Black (M=402.2) and White (M=395.7) students. Student focus group data revealed an overall positive experience for students. Emerging themes from the teacher focus group included alignment issues with the Carnegie tutor and the Algebra SOL, implementation concerns, student effects, and software issues. Based on these findings, implications of the results of this study, future avenues of research, and implementation suggestions are offered.",
  "description_provenance": [
    "Author Email: jsmith@vbcps.k12.va.us",
    "Advisor Email: TTwiford@vt.edu",
    "Advisor Email: sblanken@ccps.k12.va.us",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: Tdawson@ANTIOCHSEA.edu",
    "Advisor Email: Yakimowski@AOL.COM",
    "Made available in DSpace on 2014-03-14T20:10:30Z (GMT). No. of bitstreams: 1 dissertation.PDF: 431197 bytes, checksum: 7b72493813009799951fef2eec05f4ee (MD5)   Previous issue date: 2001-04-17"
  ],
  "handle": "27149",
  "identifier_other": "etd-04232001-161143",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232001-161143/",
  "identifier_uri": "http://hdl.handle.net/10919/27149",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Attitude",
    "Carnegie Algebra Tutor",
    "Achievement"
  ],
  "title": "The Effect of the Carnegie Algebra Tutor on Student Achievement and Attitude in Introductory High School Algebra",
  "type": "Dissertation"
}