{
  "contributor_author": "Reed, Philip Anthony",
  "contributor_committeechair": "LaPorte, James E.",
  "contributor_committeemember": [
    "Bame, E. Allen",
    "Brusic, Sharon A.",
    "Driscoll, Lisa G.",
    "Hirsh, Richard F.",
    "Sanders, Mark E."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:29Z",
  "date_adate": "2000-04-25",
  "date_available": "2014-03-14T20:10:29Z",
  "date_issued": "2000-04-17",
  "date_rdate": "2001-04-25",
  "date_sdate": "2000-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This study investigated the relationship between the laboratory environments and the learning styles of middle school technology education teachers in the Commonwealth of Virginia. Based on the assumption that a strong relationship between teaching and learning styles exists, it was hypothesized that teacher preference for one type of laboratory over another (conventional or modular) may be an issue of learning style. <p> A random sample (n=195) was drawn from the entire population (as identified by the Virginia Department of Education in 1998) of public middle school technology education teachers (N=392). Randomly selected teachers were mailed a cover letter, demographic questionnaire, postage-paid return envelope, the Learning Type Measure (LTM) instrument, and one dollar for taking the time to complete and return the instrument. The LTM instrument, demographic questionnaire and Bernice McCarthy's research on the 4MAT System of Leadership and Instruction were used to describe the laboratory environments and the teaching and learning styles of the respondents. Data collected were compared using contingency tables and Pearson's Chi-square analysis.  <p> Eighty-three (42.5%) of the middle school teachers responded and sixty-five of the instruments (78%) were usable. The findings indicate that respondents were overwhelmingly male (94%) and had considerable teaching experience (mean = 17.4). Sixty-percent of respondents taught in a modular laboratory and forty-percent taught in a conventional laboratory. Of the four learning styles identified by the LTM (Imaginative, Analytic, Common Sense, and Dynamic), respondents overwhelmingly (69.2%) rated themselves as Common Sense learners. Common Sense learners as teachers encourage practical applications, are interested in productivity and competence, like technical things, use hands-on activities, and try to give students the skills they will need to be economically independent in life. These findings are consistent with previous research involving the personalities and learning styles of industrial arts/technology educators. <p> The self-perceived learning styles of respondents were significantly different when compared to McCarthy's findings for secondary teachers and administrators in general. However, the learning styles of respondents in conventional laboratories were not significantly different than the learning styles of respondents in modular laboratories. Though it seems logical that learning style might explain laboratory preference, this notion was not supported by this study.",
  "description_provenance": [
    "Author Email: preed@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:29Z (GMT). No. of bitstreams: 1 Reed.pdf: 1477614 bytes, checksum: 019d58aaf45ab8927ec1e73a95c15e7c (MD5)   Previous issue date: 2000-04-17"
  ],
  "handle": "27144",
  "identifier_other": "etd-04232000-04420017",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232000-04420017/",
  "identifier_uri": "http://hdl.handle.net/10919/27144",
  "publisher": "Virginia Tech",
  "relation_haspart": "Reed.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Technology Education",
    "Learning Style",
    "Module"
  ],
  "title": "The Relationship Between Learning Style and Conventional or Modular Laboratory Preference Among Technology Education Teachers in Virginia",
  "type": "Dissertation"
}