{
  "contributor_author": "Arbogast, Terry E.",
  "contributor_committeecochair": "Salmon, Richard G.",
  "contributor_committeemember": [
    "Alexander, M. David",
    "Driscoll, Lisa G.",
    "Worner, Wayne Dempsey",
    "Zody, Richard E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:30Z",
  "date_adate": "2000-04-25",
  "date_available": "2014-03-14T20:10:30Z",
  "date_issued": "2000-03-31",
  "date_rdate": "2001-04-25",
  "date_sdate": "2000-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>Understanding the evolution of charter school legislation and the expectations of legislators adopting this legislation is important to school boards and school administrators in Virginia.  The purpose of this research project was to delineate the historical development of charter school legislation in Virginia. A non-emergent research design was used with two steps of data collection.  The first step was a review of all charter school legislation, which covered the General Assembly Sessions 1994-2000, and the second step was a series of open-ended interviews with legislators and others who participated in the charter school legislative development.  This study addressed the following research questions:  <p>1. What changes did charter school legislation undergo before members of the Virginia General Assembly finally approved it for implementation?  <p>2. What were the expectations of the legislators who sponsored charter school legislation?  <p>3. What, if anything, either internal or external to the Virginia General Assembly, influenced the presenters of charter school legislation?  <p>4. Did the enacted legislation that was adopted meet the expectations of the legislator who initiated charter school legislation?  <p>5. Are legislators and others satisfied with the current status of charter school development in Virginia?  <p>Charter school legislative bills and related amendments from 1994 to 2000 were analyzed. Purposive and snowball sampling identified certain legislators as primary respondents, who were interviewed.  After the interviews, the data were transcribed and analyzed using QSR NUD·IST.  A total of eight interviews were conducted, and all respondents gave permission to record the interviews.  <p>Six themes emerged from the interviews.  These themes are 1) Partisan Politics, 2) Local Autonomy, 3) Accountability, 4) Choice, 5) Funding, and 6) Opposition.  Charter school legislation is unique to each state. Also, one delegate individually championed charter school legislation in Virginia.  There were some external influences (outside the Virginia General Assembly) opposing charter school legislation; primarily the National Association for the Advancement of Colored People (NAACP), the Virginia School Boards Association (VSBA), and the Virginia Education Association (VEA).  Equally important, partisan politics and the opposition of the Black Caucus in the General Assembly were the two strongest internal factors in defeating early attempts at charter school passage.  All interviewees reported being satisfied with the outcome of charter school legislation; however, several legislators indicated dissatisfaction with the apparent slow pace of school boards in each locality of holding public hearings to determine whether they will accept charter school applications.  Additionally, accountability based upon student results, an alternative schooling opportunity for public school students, and a lottery method for student selection were important charter school characteristics for adoption.",
  "description_provenance": [
    "Author Email: tarbogas@swva.net",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: wworner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:30Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 465328 bytes, checksum: 8471db25c644190fe86c0a47bc2b8215 (MD5)   Previous issue date: 2000-03-31"
  ],
  "handle": "27145",
  "identifier_other": "etd-04232000-18360048",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232000-18360048/",
  "identifier_uri": "http://hdl.handle.net/10919/27145",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "accountability",
    "General Assembly",
    "charter schools",
    "funding"
  ],
  "title": "An Historical Analysis of the Development of Charter School Legislation in Virginia",
  "type": "Dissertation"
}