{
  "contributor_author": "Catron, Rhonda Karen",
  "contributor_committeecochair": [
    "Kelly, Patricia Proudfoot",
    "Capps, John S."
  ],
  "contributor_committeemember": [
    "Heilker, Paul V.",
    "Brown, Lee",
    "Carico, Kathleen M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:30Z",
  "date_adate": "2001-04-24",
  "date_available": "2014-03-14T20:10:30Z",
  "date_issued": "2001-04-02",
  "date_rdate": "2002-04-24",
  "date_sdate": "2001-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Wytheville Community College implemented the Dual Credit English program in 1988 following the Virginia Community College Systemâ  s adoption of the Virginia Plan for Dual Enrollment.  Essentially, the program allows qualified high school seniors to enroll in the collegeâ  s freshman-level ENG 111:  College Composition I and ENG 112:  College Composition II courses while simultaneously completing senior English.  The guarantee of college credit for students who earn at least a â  Câ   average and other cost-saving and time-saving features have contributed to the increased popularity of the program in recent years.   This institutional study examines multiple facets of the program and determines program strengths and weaknesses.  The dissertation provides historical data on the rationale for the program and presents perspectives from various constituencies involved in the program, including community college administrators, high school administrators, community college English faculty, dual credit English faculty, program graduates, and currently enrolled dual credit English students.  The study found that both the community college and high schools are committed to providing dual credit English courses that are of comparable quality to the collegeâ  s regular freshman composition courses.  Generally, students and graduates reported a high rate of satisfaction with the program.  Students benefit monetarily from the program because the public school systems, not individual students, pay tuition costs.  Also, students save time by accumulating college credits while still enrolled in high school and, thus, are often able to complete college degrees in a shorter time frame.  Articulation agreements guarantee the transferability of dual credit English courses to most state-supported colleges and universities.   The study also discusses relevant administration issues such as curriculum development, placement policies and procedures, faculty selection, and program evaluation.  Administrators strongly support the program, pointing out that it helps build student confidence and encourages students to consider higher education opportunities.  Faculty perception varies, with community college faculty expressing concerns about student preparation and philosophical issues related to combining senior English with freshman composition.  Dual credit English faculty, on the other hand, generally expressed more positive views, noting many of the same benefits students had cited. The final chapter summarizes program successes, identifies concerns, and makes recommendations for improvements in the dual credit English program.",
  "description_provenance": [
    "Author Email: wccatrr@wc.cc.va.us",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: jcapps@vw.cc.va.us",
    "Made available in DSpace on 2014-03-14T20:10:30Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 510237 bytes, checksum: bdbcc4d3d05da9d07da28d57b6ff2416 (MD5)   Previous issue date: 2001-04-02"
  ],
  "handle": "27146",
  "identifier_other": "etd-04232001-113714",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232001-113714/",
  "identifier_uri": "http://hdl.handle.net/10919/27146",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Concurrent Enrollment",
    "Dual Enrollment",
    "High School-College Partnerships"
  ],
  "title": "Dual Credit English:  Program History, Review, and Recommendations",
  "type": "Dissertation"
}