{
  "contributor_author": "Cooper, Kristie Lenahan",
  "contributor_committeechair": "Claus, Richard O.",
  "contributor_committeemember": [
    "Besieris, Ioannis M.",
    "Gordon, Ronald S.",
    "Jacobs, Ira",
    "Wang, Anbo"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:10:29Z",
  "date_adate": "1999-05-06",
  "date_available": "2014-03-14T20:10:29Z",
  "date_issued": "1999-04-20",
  "date_rdate": "2000-05-06",
  "date_sdate": "1999-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation demonstrates the feasibility of using novel electrostatic self-assembly (ESA) methods to fabricate linear and nonlinear optical thin films and components.   The ESA process involves the layer-by-layer alternate adsorption of anionic and cationic complexes from aqueous solutions.  Selection of the molecules in each layer, their orientation at the molecular level, and the order in which the layers are assembled determine the film's bulk optical, electronic, magnetic, thermal, mechanical and other properties.  In this work, the capability of nanoscale control over film optical properties allowed the fabrication of complicated refractive index profiles required for linear optical interference filters.  The inherent ordered nature of ESA films yielded extremely stable noncentrosymmetric thin films for second-order nonlinear optical applications.  The ESA technique offers numerous advantages over conventional thin film fabrication methods and offers great potential in commercial applications such as reflectance and AR filters, EO waveguides and modulators and other optoelectronic devices.    The structure of each monolayer in ESA films is dependent on the processing parameters, producing subsequent variations in bulk film properties both intentionally and incidentally.  As this method is still in its infancy, variations in ESA processing methods, including process automation, are considered first in this document.  These results allowed carefully controlled refractive index experiments and the synthesis of both step and graded index structures, several microns thick.  Dielectric stack, Rugate, and antireflection optical interference filters were designed, synthesized and demonstrated. c(2) films of both commercially available polymer dyes and novel polymers designed specifically for the ESA process were demonstrated using second harmonic generation. UV/vis spectroscopy, ellipsometry and atomic force microscopy analysis are presented.",
  "description_provenance": [
    "Author Email: klcooper@vt.edu",
    "Advisor Email: besieris@vt.edu",
    "Advisor Email: roclaus@vt.edu",
    "Advisor Email: gordonrs@vt.edu",
    "Advisor Email: ijacobs@vt.edu",
    "Advisor Email: awang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:29Z (GMT). No. of bitstreams: 1 etdnew.pdf: 2818689 bytes, checksum: 2eb72c2ec4d04f178047f970fc21f84f (MD5)   Previous issue date: 1999-04-20"
  ],
  "handle": "27141",
  "identifier_other": "etd-042299-112401",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042299-112401/",
  "identifier_uri": "http://hdl.handle.net/10919/27141",
  "publisher": "Virginia Tech",
  "relation_haspart": "etdnew.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "dielectric stack",
    "optical thin films",
    "chi(2) effect",
    "optical interference filter",
    "nonlinear optics (NLO)",
    "electrostatic self-assembly (ESA)"
  ],
  "title": "Electrostatic Self-Assembly of Linear and Nonlinear Optical Thin Films",
  "type": "Dissertation"
}