{
  "contributor_author": "Jeffrey, Allison Clifford",
  "contributor_committeechair": "Clum, George A. Jr.",
  "contributor_committeemember": [
    "Keppel-Benson, Jane M.",
    "Lease, Cynthia A.",
    "Eisler, Richard M.",
    "Sturgis, Ellie T."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:10:29Z",
  "date_adate": "1999-04-28",
  "date_available": "2014-03-14T20:10:29Z",
  "date_issued": "1999-04-09",
  "date_rdate": "2000-04-28",
  "date_sdate": "1999-04-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated the impact of working with domestic violence victims on domestic violence shelter workers.  Recent research has shown that working with trauma victims may have a profound impact on the worker, including levels of intrusive and avoidant PTSD symptoms as well as distorted beliefs about the self and others.  This was the first study to examine secondary traumatization in the domestic violence worker population.  Results suggested that domestic violence workers are experiencing levels of secondary traumatization slightly higher than sexual assault counselors, a group used for comparison due to their similar job demands and client population.  Though this study attempted to ameliorate symptom levels by providing feedback, and feedback with suggestions for improvement to two treatment groups, no significant effects were found post-treatment.  Various reasons were offered for this lack of effect, including the lack of adequate sample size at follow-up.  Overall, several predictors of secondary traumatization were confirmed, the most notable of which was social support.  Individuals with high levels of social support tended to have less symptoms of secondary traumatization, and individuals with high levels of social avoidance tended to have more symptoms of secondary traumatization.  For this sample, trauma history was not found to predict secondary traumatization symptoms.  These findings were discussed in relation to the vicarious traumatization model of indirect trauma.  Clinical implications and implications for future research were also offered.     This study was supported in full by the Agency for Healthy Care Policy and Research Grant for Health Service Dissertation Award, number R03 HS10036-01.",
  "description_provenance": [
    "Author Email: alleecaat@aol.com",
    "Advisor Email: jabenson@vt.edu",
    "Advisor Email: clease@vt.edu",
    "Advisor Email: eisler@vt.edu",
    "Advisor Email: sturgis@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:29Z (GMT). No. of bitstreams: 1 ACJETD.PDF: 199722 bytes, checksum: 8800b71231b4227cdf9d6556b4dfc9d8 (MD5)   Previous issue date: 1999-04-09"
  ],
  "handle": "27143",
  "identifier_other": "etd-042299-211920",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042299-211920/",
  "identifier_uri": "http://hdl.handle.net/10919/27143",
  "publisher": "Virginia Tech",
  "relation_haspart": "ACJETD.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Domestic Violence",
    "Secondary Trauma",
    "Feedback Intervention"
  ],
  "title": "Effect of Feedback on Levels of Secondary Traumatization of Workers at Battered Women's Shelters across the United States",
  "type": "Dissertation"
}