{
  "contributor_author": "Hartman, Gregory Neil",
  "contributor_committeechair": "Green, Edward L.",
  "contributor_committeemember": [
    "Parry, Charles J.",
    "Farkas, Daniel R.",
    "Brown, Ezra A.",
    "Linnell, Peter A."
  ],
  "contributor_department": "Mathematics",
  "date_accessioned": "2014-03-14T20:10:31Z",
  "date_adate": "2002-04-25",
  "date_available": "2014-03-14T20:10:31Z",
  "date_issued": "2002-04-23",
  "date_rdate": "2003-04-25",
  "date_sdate": "2002-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A new connection between combinatorics and noncommutative algebra is established by relating a certain class of directed graphs to noncommutative Koszul algebras. The directed graphs in this class are called full graphs and are defined by a set of criteria on the edges. The structural properties of full graphs are studied as they relate to the edge criteria. <p>  A method is introduced for generating a Koszul algebra Lambda from a full graph G. The properties of Lambda are examined as they relate to the structure of G, with special attention being given to the construction of a projective resolution of certain semisimple Lambda-modules based on the structural properties of G. The characteristics of the Koszul algebra Lambda that is derived from the product of two full graphs G' and G' are studied as they relate to the properties of the Koszul algebras Lambda' and Lambda' derived from G' and G'.",
  "description_provenance": [
    "Author Email: ghartman@math.vt.edu",
    "Advisor Email: parrycj@math.vt.edu",
    "Advisor Email: farkas@math.vt.edu",
    "Advisor Email: brown@math.vt.edu",
    "Advisor Email: green@math.vt.edu",
    "Advisor Email: linnell@math.vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:31Z (GMT). No. of bitstreams: 1 dissertation.pdf: 720106 bytes, checksum: 9ba4f0dd8e596dcea00450ba67ddc3c5 (MD5)   Previous issue date: 2002-04-23"
  ],
  "handle": "27156",
  "identifier_other": "etd-04232002-162108",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232002-162108/",
  "identifier_uri": "http://hdl.handle.net/10919/27156",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "representations",
    "quivers",
    "Koszul algebras",
    "directed graphs"
  ],
  "title": "Graphs and Noncommutative Koszul Algebras",
  "type": "Dissertation"
}