{
  "contributor_author": "Hunsucker, Stephen Warren",
  "contributor_committeechair": "Tissue, Brian M.",
  "contributor_committeemember": [
    "Anderson, Mark R.",
    "Ducker, William A.",
    "Deck, Paul A.",
    "Taylor, Larry T."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:10:30Z",
  "date_adate": "2001-04-25",
  "date_available": "2014-03-14T20:10:30Z",
  "date_issued": "2001-04-20",
  "date_rdate": "2002-04-25",
  "date_sdate": "2001-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Matrix assisted laser desorption/ionization time-of flight mass spectrometry (MALDI-TOFMS) is used to study several inorganic coordination complexes and a variety of compounds from cyanobacteria. Also presented is a discussion of TOFMS instrumentation and the improvements in resolution and instrument automation that have lead to widespread and diverse applications of MALDI-TOFMS in all areas of science.  The feasibility of using direct laser desorption/ionization (LDI) TOFMS to detect trace elements in a variety of glass samples using a lithium borate fusion technique for sample preparation is investigated. The result of the fusion technique is a homogeneous incorporation of the analytical sample into a glass. The fusion technique is investigated as a way to eliminate matrix effects in direct LDI-TOFMS analysis. However, the high concentration and low ionization potential of lithium suppress ionization of the elements of interest. The detection limits of elements in glass samples were not at the trace level. Therefore the technique is not as useful as well-established analytical methods like X-ray fluorescence and inductively coupled plasma mass spectrometry. Direct laser ablation and matrix-assisted laser desorption/ionization time-of-flight  mass spectrometric analysis of four inorganic coordination complexes are discussed. The compounds studied include [Ir(dpp)2Cl2](PF6), {[(bpy)2Ru(dpp)]2RuCl2}(PF6)4, [(tpy)Ru(tpp)Ru(tpp)RhCl3](PF6)4 and {[(bpy)2Ru(dpp)]2IrCl2}(PF6)5 (dpp = 2,3-bis-(2'-pyridyl)-pyrazine, bpy = 2,2'-bipyridine, tpy = 2,2',6',2\"-terpyradine, tpp = 2,3,5,6,-tetrakis-(2'-pyridyl)-pyrazine). Spectral intensities and fragmentation patterns are compared and evaluated for several instrument parameters, matrices, and matrix-to-analyte ratios. Direct ablation and MALDI mass spectra of the monometallic complex showed the same ion peaks and differed only in the relative peak intensities. Direct ablation of the trimetallic complexes produced only low-mass fragments containing one metal atom at most. MALDI spectra of the trimetallic complexes exhibited little fragmentation in the high-mass region (>1500 Da) and less fragmentation in the low-mass region compared to direct laser ablation. Proper matrix selection for MALDI analysis was vital, as was an appropriate matrix-to-analyte ratio. The results demonstrate the applicability of MALDI-TOF mass spectrometry for the structural characterization of labile inorganic coordination complexes. A correlation is made between the gas-phase redox chemistry in the MALDI plume and the solution phase electrochemistry for this series of complexes. MALDI-TOFMS was also used to study compounds isolated from cyanobacteria. A MALDI screening method has been developed to detect the presence of scytonemin, a UV-absorbing pigment. Detection of scytonemin is accomplished by a simple solvent extraction of cyanobacteria in the desiccated state with subsequent MALDI-TOFMS analysis. The method is rapid and semi-quantitative. Cyanobacteria is the only known organism to produce scytonemin, and it is only produced when the organism is subjected to UV stress. Laboratory-grown cultures were subjected to different amounts of UV radiation, and the screening method was used to detect the presence or absence of scytonemin. Cultures grown under ambient conditions (low UV) did not show the presence of scytonemin, while those grown under UV lamps did show the detectable scytonemin. Because scytonemin acts as a biomarker for UV stress, the MALDI screening method could find application in molecular ecology studies of cyanobacteria. Peptide mass fingerprinting is used to monitor the isolation of the water stress protein from N. commune. The protein is produced by recombinant growth in E. coli in order to assess the role of Wsp in the desiccation tolerance of N. commune. The results show that SDS-PAGE and Western blot analysis are not sufficient to detect the presence of Wsp after purification using ion-exchange chromatography. Three E. coli proteins were identified in the same molecular weight range as Wsp and one of them cross-reacts with the series of antibodies used for the Western blot. The presence of contaminating proteins that cross-react with the immuno assay make it difficult to determine which fractions contained Wsp. Peptide mass fingerprints were obtained for a series of fractions collected after ion-exchange chromatography to pinpoint the location of Wsp. Peptide mass fingerprinting was also used to monitor the stability of the clone and results show that the clone is modified over a six month period.",
  "description_provenance": [
    "Author Email: shunsuck@vt.edu",
    "Advisor Email: tissue@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:30Z (GMT). No. of bitstreams: 1 etd-shunsucker.pdf: 1796904 bytes, checksum: ee27604089d641cbe3a43943b11f1702 (MD5)   Previous issue date: 2001-04-20"
  ],
  "handle": "27150",
  "identifier_other": "etd-04232001-164946",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232001-164946/",
  "identifier_uri": "http://hdl.handle.net/10919/27150",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd-shunsucker.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "peptide mass fingerprint",
    "water stress protein",
    "polymetallic complexes",
    "MALDI",
    "scytonemin"
  ],
  "title": "Time-of-Flight Mass Spectrometry to Characterize Inorganic Coordination Complexes and Cyanobacteria",
  "type": "Dissertation"
}