{
  "contributor_author": "Tembo, Mark Jimu",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeecochair": "Poole, Jon R.",
  "contributor_committeemember": [
    "McKeon, Donald M.",
    "Baffi, Charles R.",
    "Niles, Jerome A."
  ],
  "contributor_department": "Human Resources and Education",
  "date_accessioned": "2014-03-14T20:10:31Z",
  "date_adate": "2002-04-25",
  "date_available": "2014-03-14T20:10:31Z",
  "date_issued": "2002-02-19",
  "date_rdate": "2003-04-25",
  "date_sdate": "2002-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This document is about a plan to develop physical education curriculum in Malawi. Despite its official recognition, the subject is often regarded as a low entity on the school curriculum. Several factors contribute to this status, chief among them is: lack of well-prepared teachers; equipment and materials; negative attitude by certain key individuals in the society. This document is the first attempt to develop a broad and balanced physical education curriculum in Malawi.</p> <p>In this document, two curriculum frameworks have been provided. One such curriculum frameworks is for the primary school (elementary) grades 1-8 and the other, the secondary (high) school 1-4. These frameworks are detailed with teaching and learning topics in physical education in such a way that every school child will have an opportunity to participate for enjoyment, knowledge and skill acquisition for personal and national benefit.</p> <p>This study is drawn upon the US and UK models where programs such as Saber-Tooth, Catch, Spark and Sport-England have been very successful. The assumption of this plan, comprehensive as it may be, is the essence of collective effort of the people of Malawi to implement the ideas it contains.</p>",
  "description_provenance": [
    "Author Email: mtembo@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: jpoole@radford.edu",
    "Advisor Email: dmckeon@vt.edu",
    "Advisor Email: baffic@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:31Z (GMT). No. of bitstreams: 1 tembofinal.pdf: 1056649 bytes, checksum: 9a9f822bffcd9e95776225bad489d2e9 (MD5)   Previous issue date: 2002-02-19"
  ],
  "handle": "27157",
  "identifier_other": "etd-04232002-212621",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232002-212621/",
  "identifier_uri": "http://hdl.handle.net/10919/27157",
  "publisher": "Virginia Tech",
  "relation_haspart": "tembofinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "physical",
    "education",
    "curriculum",
    "plan",
    "frameworks",
    "Malawi",
    "Africa"
  ],
  "title": "A Physical Education Curriculum Plan For Malawi",
  "type": "Dissertation"
}