{
  "contributor_author": "Freeman, Miriam B.",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Dawson, Christina M.",
    "Edwards, Jeanne",
    "Harris, Larry A.",
    "Twiford, Travis W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:30Z",
  "date_adate": "2001-04-25",
  "date_available": "2014-03-14T20:10:30Z",
  "date_issued": "2000-11-07",
  "date_rdate": "2002-04-25",
  "date_sdate": "2001-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "A current educational practice in grouping students is looping. Looping involves teachers  remaining with the same students for two or more years.  This practice was implemented in the elementary school in this study.  This is an evaluation of looping in the first and second grades.    The study has both qualitative and quantitative components.  An administrator, teachers, and students in four looping and four non-looping cohorts were participants.  Criterion variables were attendance; achievement in English, mathematics, science, and history and social science; instructional time; relationships among students; and relationships between teachers and students.  A t-test was used to test for differences between looping and non-looping cohorts for attendance and achievement.  Teachers used a log to record instructional time spent reviewing previously learned skills and teaching new skills in mathematics.  Observations were conducted to describe the relationships among students and between teachers and students.  \tThere were no differences between looping and non-looping cohorts in attendance, instructional time, and achievement, except in history and social science, for one of the years studied. In that year, students in the looping cohort scored higher on the Standards of Learning test in history and social science than students in the non-looping cohort.  Relationships among students were better in looping cohorts, and   relationships between teachers and students appeared stronger in non-looping cohorts.",
  "description_provenance": [
    "Author Email: freestew@aol.com",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:30Z (GMT). No. of bitstreams: 1 loopmay.pdf: 2832703 bytes, checksum: 27a6ae0436d64cd6b599f95a5a14bde1 (MD5)   Previous issue date: 2000-11-07"
  ],
  "handle": "27151",
  "identifier_other": "etd-04232001-174505",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232001-174505/",
  "identifier_uri": "http://hdl.handle.net/10919/27151",
  "publisher": "Virginia Tech",
  "relation_haspart": "loopmay.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Time",
    "Relationships",
    "Achievement",
    "Evaluation",
    "Looping"
  ],
  "title": "Looping at One Elementary School: How Successful Was It?",
  "type": "Dissertation"
}