{
  "contributor_author": "Dragich, Bernadette Marie",
  "contributor_committeechair": "Garrison, James W.",
  "contributor_committeemember": [
    "Sherman, Thomas M.",
    "Burton, John K.",
    "Rader, Betty R.",
    "Allen, Katherine R."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:31Z",
  "date_adate": "2001-04-24",
  "date_available": "2014-03-14T20:10:31Z",
  "date_issued": "2001-04-18",
  "date_rdate": "2002-04-24",
  "date_sdate": "2001-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Narratives are used to explore personal beliefs and assumptions about caring in oneâ  s personal and professional life.  This dissertation recognizes the process of caring is interpretative and evolves from personal experience.  I address issues of caring within the practice of nursing and nursing education from a feminist perspective.  I begin with my own personal narrative in which I seek to uncover my own caring essence as a basis for inquiring into issues of caring and feminism in nursing education.  Theoretical constructs from educational nursing and feminist literature are explored to develop a personal model of caring within nursing education.  Nursing students must be educated within a caring learning environment so they can develop a caring stance with patients.   Dialogue within teacher-student interaction is at the center of such an environment.  This dialogue encourages authentic presence with students that leads to an intuitive knowing.  Nursing students need to learn to let their intuitive sense guide the use of technology.  Of course, that means educating their intuitions. Autobiographical vignettes are used to reflect on the experience of a nurse educator as caring guides teaching-learning activities in a nursing curriculum.  Caring within clinical teaching encourages reflection and increases self-awareness.  Clinical teaching is seen as an opportunity to unite theory and practice.  It encourages students to be receptive to patients and places value on contextual experiences.  An examination of contextual experience shows that care is relational and encourages connections with others.  Care is sustained through relationships that give voice to nursing students and patients.  This process of giving voice makes caring more visible to others.  This visibility allows nurses to celebrate caring occasions and validates worth of caring in nursing.  Caring practices within nursing education help students recognize the power within themselves to institute change.  Nurse educators must encourage students to care for themselves.  This process will help them stay in touch with what they need as individuals as they provide care to others.",
  "description_provenance": [
    "Author Email: bla00047@mail.wvnet.edu",
    "Advisor Email: tsherman@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: wesley@vt.edu",
    "Advisor Email: brader@bluefield.wvnet.edu",
    "Advisor Email: kallen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:31Z (GMT). No. of bitstreams: 1 Ch1pg1ETD.pdf: 354322 bytes, checksum: 59c8b0a3c0dc9f170f4f85ebfe802fc2 (MD5)   Previous issue date: 2001-04-18"
  ],
  "handle": "27154",
  "identifier_other": "etd-04232001-233040",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232001-233040/",
  "identifier_uri": "http://hdl.handle.net/10919/27154",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ch1pg1ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Authentic",
    "Presence",
    "Caring",
    "Nursing Education",
    "Dialogue",
    "Connection"
  ],
  "title": "Caring in Nursing Education",
  "type": "Dissertation"
}