{
  "contributor_author": "Chase, Denise",
  "contributor_committeechair": "Lichtman, Marilyn V.",
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:30Z",
  "date_adate": "2001-05-02",
  "date_available": "2014-03-14T20:10:30Z",
  "date_issued": "2001-03-19",
  "date_rdate": "2002-05-02",
  "date_sdate": "2001-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of the research study was to describe girls' engagement with computers during middle childhood and to delineate the factors that initiated and sustained the engagement. The research questions were: 1) What patterns distinguish how girls engage in web page development during middle childhood? 2) What roles do environmental and personal factors play in the girls' engagement in the activity of web page development? 3) What are the perceived reasons for the girls' achievement in creating web pages?\t  The research design followed a qualitative case study approach with descriptive methods of data collection. Four participants were selected through nomination by their elementary school principal based on their computer attitude and aptitude. The data collected included interviews, observations, artifacts, and interviewerâ  s reflective notes. The data were analyzed through coding assisted by NUD*IST computer software. Overall, the access to computers, the relationships with powerful others, and the girls' perceptions of their ability to control influential factors, all worked together as antecedents for engagement with computers. The roles performed and the necessary social interaction sustained the engagement. The product, an educational web page, demonstrated successful achievement. The researcher provided recommendations for educators to create conditions for girls to achieve using computers, which impacts middle childhood girls' perceptions of future career options.",
  "description_provenance": [
    "Author Email: cchase@cox.rr.com",
    "Advisor Email: mlichtma@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:30Z (GMT). No. of bitstreams: 1 chase.pdf: 163731 bytes, checksum: 11d887a921c10c282766024a2509ef7b (MD5)   Previous issue date: 2001-03-19"
  ],
  "handle": "27153",
  "identifier_other": "etd-04232001-175011",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232001-175011/",
  "identifier_uri": "http://hdl.handle.net/10919/27153",
  "publisher": "Virginia Tech",
  "relation_haspart": "chase.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "middle childhood",
    "computers",
    "motivation"
  ],
  "title": "Girls' Engagement with Computers While Creating Web Pages During Middle Childhood",
  "type": "Dissertation"
}