{
  "contributor_author": "Robinson, Nancy Reed",
  "contributor_committeechair": "Niles, Jerome A.",
  "contributor_committeemember": [
    "McDowell, Gloria M.",
    "Lalik, Rosary V.",
    "Hutson, Barbara A.",
    "Smith-Burke, Margaret T."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:32Z",
  "date_adate": "2003-04-29",
  "date_available": "2014-03-14T20:10:32Z",
  "date_issued": "2003-02-14",
  "date_rdate": "2004-04-29",
  "date_sdate": "2003-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This instructional study of fostering student independence while teaching them to read revealed how first grade students develop independent reading behaviors during their 18-22 weeks of instruction. The observations were made of three Reading Recovery teacher/student dyad behaviors during three videotaped lessons; one in the beginning of instruction, one near the middle of instruction and the last just before the students discontinued from their respective programs. Individual units of reading behaviors were identified and labeled as assisted, assisted dependent, assisted independent, or independent based on specific behaviors observed when miscues occurred. The questions guiding the study were directed at student behaviors, teacher behaviors, and student changes over time.  The data collected comprised transcripts of the taped sessions, daily lesson plans, running records, and results from scheduled Observation Survey assessments. The concept of independence was discussed as (1) a disposition for independence, (2) functional independence, (3) independence as a self-regulatory behavior, and (4) examples of how children contribute to and extend their learning independently.  When they began, the students, Title I students, were among the bottom 10% of readers in their classrooms. When they discontinued (graduated), they functioned as average readers in their classrooms. When the students were assessed again in June after Reading Recovery lessons had ended, they had maintained their gains. In addition each student had acquired an expanding disposition of independence that is expected to be maintained as learning continued. The findings suggest that fostering independence in tutorial settings accelerates learning and enables students to become average readers.",
  "description_provenance": [
    "Author Email: NRobininin@cs.com",
    "Advisor Email: niles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:32Z (GMT). No. of bitstreams: 9 Chapter3.pdf: 39922 bytes, checksum: 4bff6d904b9d1393dbbe4bc2a7442306 (MD5) References.pdf: 27297 bytes, checksum: 996c94f592d3fb40c6148c6fcdc0a0f5 (MD5) FrontMatter.pdf: 18387 bytes, checksum: 816a484b022014dd2e095cfd7644ab0a (MD5) chapter1.pdf: 16528 bytes, checksum: 79f5e74c5dd213e5841a38ac773ee3ba (MD5) Chapter2.pdf: 34183 bytes, checksum: 7cdc574db0aae0440c918066f7f0377f (MD5) Chapter6.pdf: 21208 bytes, checksum: aa0edabd70781273bfd16b439c56ec43 (MD5) Appendices.pdf: 678813 bytes, checksum: f73a662a67690f6f12368a59931a88ef (MD5) Chapter5.pdf: 61080 bytes, checksum: 073d9749a19152beb4cd5721d592b63a (MD5) Chapter4.pdf: 44913 bytes, checksum: 80220bbb86228b0f80ead92f6a8a7af9 (MD5)   Previous issue date: 2003-02-14"
  ],
  "handle": "27163",
  "identifier_other": "etd-04232003-115317",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232003-115317/",
  "identifier_uri": "http://hdl.handle.net/10919/27163",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter3.pdf",
    "References.pdf",
    "FrontMatter.pdf",
    "chapter1.pdf",
    "Chapter2.pdf",
    "Chapter6.pdf",
    "Appendices.pdf",
    "Chapter5.pdf",
    "Chapter4.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Independent",
    "Dyad Instruction",
    "Reading Recovery",
    "Instructional Interaction",
    "Fostering Independence"
  ],
  "title": "Fostering Student Independent Behaviors  During Reading Recovery Lessons",
  "type": "Dissertation"
}