{
  "contributor_author": "Reed, Jason Scott",
  "contributor_committeechair": "Eriksson, Kenneth A.",
  "contributor_committeemember": [
    "Read, James Fredrick",
    "Eriksson, Susan C.",
    "Bodnar, Robert J.",
    "Kowalewski, Michal",
    "Rimstidt, james Donald"
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:10:31Z",
  "date_adate": "2003-04-25",
  "date_available": "2014-03-14T20:10:31Z",
  "date_issued": "2003-04-15",
  "date_rdate": "2005-04-25",
  "date_sdate": "2003-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The thermal and diagenetic evolution of Carboniferous sandstones in the central Appalachian basin has been resolved using various techniques.  Paleothermometers including vitrinite reflectance and fluid inclusions indicate that burial of Lower and Upper Pennsylvanian strata of the Appalachian Plateau in West Virginia exceeded 4.4 km during the late Permian and occurred at a rate of ~100 m/m.y.  Exhumation rates of ~10-30 m/m.y. from maximum burial to present depth were constrained using published apatite fission track and radiogenic helium ages.      Quartz, lithic and feldspar-rich sandstones from different stratigraphic intervals and locations were sampled from core (95 %) and outcrop (5%) to qualitatively and quantitatively evaluate sandstone diagenesis.  A compositional multivariate data set compiled from point counts served as the basis for quantitative analysis of controls on sandstone diagenesis such as framework grain composition, paleoclimate and depositional environment.  A priori groups (independent variables) corresponding to the controls were compared using digenetic products (dependent variables).  Major conclusions of the analysis are, first, minerals that formed early appear to have been influenced by stratigraphic position.  The distribution of siderite and iron-oxide/oxyhydroxide may reflect the second order paleoclimatic signature recognized throughout the Carboniferous, where siderite formed during everwet periods and iron-oxide/oxyhydroxide during semi-arid conditions, reflecting differences in redox.  Second, framework grain composition controlled the distribution of diagenetic alterations and quartz cementation in the burial environment.  Lithic arenites are deficient in authigenic quartz, yet have undergone various degrees of illitization.  The quartz deficiency is attributed to compaction-related loss of primary porosity relatively early, which inhibited flow of silica-bearing fluids.  Finally, no correlation can be demonstrated between depositional environment and diagenesis.      Anomalously high fluid inclusion homogenization temperatures (> 215 °C) from Upper Pennsylvanian sandstones adjacent to the Alleghany Thrust Front indicate that tectonic setting played an important role in quartz authigenesis.  The discrepancy between the fluid inclusion and vitrinite reflectance data imply that warm silica-bearing fluids, likely sourced from low-grade metamorphic reactions, were injected into Pennsylvanian sandstone aquifers during thrust loading associated with the Alleghanian orogeny.",
  "description_provenance": [
    "Author Email: jareed@vt.edu",
    "Advisor Email: jread@vt.edu",
    "Advisor Email: serikssn@vt.edu",
    "Advisor Email: bubbles@vt.edu",
    "Advisor Email: michalk@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: kaeson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:31Z (GMT). No. of bitstreams: 1 jsreed.PDF: 2760690 bytes, checksum: 20c2c6aeb146843f1b91158a90cc980d (MD5)   Previous issue date: 2003-04-15"
  ],
  "handle": "27161",
  "identifier_other": "etd-04232003-101043",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232003-101043/",
  "identifier_uri": "http://hdl.handle.net/10919/27161",
  "publisher": "Virginia Tech",
  "relation_haspart": "jsreed.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "diagenesis",
    "paleothermometry",
    "Appalachian basin",
    "sandstone"
  ],
  "title": "Thermal and Diagenetic Evolution of Carboniferous Sandstones, Central Appalachian Basin",
  "type": "Dissertation"
}