{
  "contributor_author": "Robert, Pablo Maximiliano",
  "contributor_committeechair": "Reed, Jeffrey Hugh",
  "contributor_committeemember": [
    "Tranter, William H.",
    "Midkiff, Scott F.",
    "Koelling, Charles Patrick",
    "DaSilva, Luiz A."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:10:32Z",
  "date_adate": "2003-04-24",
  "date_available": "2014-03-14T20:10:32Z",
  "date_issued": "2003-04-17",
  "date_rdate": "2004-04-24",
  "date_sdate": "2003-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In recent years, an increasing number of devices have been developed for operation in the bands allocated by the Federal Communications Commission (FCC) for license-free operation.  Given the rules governing devices in these bands, it is possible for interference created by these devices to significantly reduce the overall capacity of these bands.  Two such protocols are Bluetooth and IEEE 802.11b.  Several methods have been presented in the literature for managing interference between these two devices.  However, these approaches are generally not practical, since they either require the purchase of specialized hardware or do not comply with the current versions of existing protocols.  In this dissertation, an approach is presented that is not only backwards-compatible, but requires the algorithm to be implemented in only a small subset of the devices operating in the local environment for the coexistence algorithm to function properly.  An analytical solution for this coexistence approach when applied to generic networks is presented.  A method is also presented for the backwards-compatible integration of some medium access control (MAC) protocols into Bluetooth devices.  A case study of the Bluetooth/IEEE 802.11b coexistence problem is presented in this dissertation, as well as a proposed coexistence mechanism, collision-based multiple access (CBMA).  A form of adaptive frequency hopping (AFH) is presented in this dissertation, as well as a combined CBMA/AFH strategy.  The CBMA algorithm is shown be able to significantly reduce the impact of a Bluetooth link on an IEEE 802.11b link.  The AFH algorithm is shown to have comparable performance to the CBMA algorithm.  A combined CBMA/AFH algorithm presented, is shown to not only have an impact on the IEEE 802.11b link that is not greater than the CBMA-only implementation, but the Bluetooth link throughput is shown to be significantly greater than either the CBMA or AFH implementation alone.",
  "description_provenance": [
    "Author Email: probert@vt.edu",
    "Advisor Email: btranter@vt.edu",
    "Advisor Email: midkiff@vt.edu",
    "Advisor Email: koelling@vt.edu",
    "Advisor Email: ldasilva@vt.edu",
    "Advisor Email: reedjh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:32Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 1548594 bytes, checksum: b5d41a007558cece36082f30ec3f277e (MD5)   Previous issue date: 2003-04-17"
  ],
  "handle": "27167",
  "identifier_other": "etd-04232003-173807",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232003-173807/",
  "identifier_uri": "http://hdl.handle.net/10919/27167",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "WPAN",
    "Traffic",
    "WLAN",
    "Middleware",
    "Coexistence",
    "Interference",
    "IEEE 802.15",
    "Bluetooth",
    "IEEE 802.11b"
  ],
  "title": "Reduction in Coexistent WLAN Interference Through Statistical Traffic Management",
  "type": "Dissertation"
}