{
  "contributor_author": "Farahani, Gohar Omidvar",
  "contributor_committeechair": "Lichtman, Marilyn V.",
  "contributor_committeemember": [
    "Creamer, Donald G.",
    "Belli, Gabriella M.",
    "Muffo, John A.",
    "Yankosky, Richard E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:32Z",
  "date_adate": "2003-04-28",
  "date_available": "2014-03-14T20:10:32Z",
  "date_issued": "2003-04-11",
  "date_rdate": "2004-04-28",
  "date_sdate": "2003-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research explored the existence and importance of interaction in online courses as perceived by online learners and instructors. The study was based on data from online students and instructors in the fall 2002 semester at Mid-Atlantic  Community College(1). Two web-based surveys were used to collect data. Eighty-eight of 267 online students completed the survey, for a response rate of 33%. The study was based on constructivist theory which suggested that students learn by actively participating in the learning process through interaction with the instructor, other students, and course materials. This interaction was measured by different online interaction modalities and a five-step interactivity model developed by Salmon. This model suggested that the intensity of interactivity involves five steps: access and motivation, online socialization, information exchange, knowledge construction, and development. In addition, student characteristics (age and gender) and pedagogical variables (online experience and learning preferences) were included. Findings of the survey revealed that students perceived a moderate to high level of availability in a majority of the interactivity modalities. The highest interaction was reported between students and instructor through email communication and feedback on students? work by instructors. In addition, student ratings of the availability of different interaction modalities in online instruction were correlated with their perceptions of the importance of these modalities. Students reported satisfaction with the level of interactivity in their online courses. In contrast, responses to Salmon?s model revealed a high level of unavailability of the various interactivity criteria. The result of instructor survey, based on 13 responses, revealed that online instructors perceive interaction with students through email communication and providing feedback on their work were important. They did not perceive many of the interactivity criteria introduced by this research to be important. Therefore, they reported these criteria as unavailable in their online courses. This study is important because the extent of systematic research on availability and importance of online interaction is limited.  <p> (1)- To preserve the anonymity of respondents, this name is a pseudonym.",
  "description_provenance": [
    "Author Email: gf@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: mlichtma@vt.edu",
    "Advisor Email: muffo@vt.edu",
    "Advisor Email: ryankosky@collegis.com",
    "Made available in DSpace on 2014-03-14T20:10:32Z (GMT). No. of bitstreams: 1 Gohar-Farahani-Dissertation.pdf: 2529085 bytes, checksum: b8a2f2a519d1aaea54d48ca878c1a5b6 (MD5)   Previous issue date: 2003-04-11"
  ],
  "handle": "27169",
  "identifier_other": "etd-04232003-202143",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232003-202143/",
  "identifier_uri": "http://hdl.handle.net/10919/27169",
  "publisher": "Virginia Tech",
  "relation_haspart": "Gohar-Farahani-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Constructivist Theory",
    "Interaction",
    "Online Learning",
    "Interactivity",
    "Distance Education"
  ],
  "title": "Existence and Importance of Online Interaction",
  "type": "Dissertation"
}