{
  "contributor_author": "O'Brien, David Kenneth",
  "contributor_committeechair": "Melville, Stephen B.",
  "contributor_committeemember": [
    "Walker, Richard A.",
    "Popham, David L.",
    "Elgert, Klaus D.",
    "Stevens, Ann M."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:10:32Z",
  "date_adate": "2003-04-24",
  "date_available": "2014-03-14T20:10:32Z",
  "date_issued": "2003-04-18",
  "date_rdate": "2004-04-24",
  "date_sdate": "2003-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Clostridium perfringens is the most common cause of gas gangrene (clostridial myonecrosis), a disease that begins when ischemic tissues become contaminated with C. perfringens.  C. perfringens quickly multiplies in ischemic tissues and spreads to healthy areas, leading to high levels of morbidity and mortality.  As a species, the bacterium can synthesize thirteen different toxins.  The alpha toxin (PLC) and perfringolysin O (PFO) are thought to be important virulence factors in gangrene.  We wished to understand how C. perfringens is capable of avoiding killing by the host immune system, and determine if PLC and PFO play a role in this avoidance.  We found C. perfringens was not killed by J774-33 cells or mouse peritoneal macrophages under aerobic or anaerobic conditions.  Using electron microscopy, we showed that C. perfringens could escape the phagosome of J774-33 and mouse peritoneal macrophages.  We believe the ability of C. perfringens to survive in the presence of macrophages is due to its ability to escape the phagosome.  Using a variety of inhibitors of specific receptors, we identified those used by J774-33 cells to phagocytose C. perfringens.  The scavenger receptor, mannose receptor(s), and complement receptor (CR3) were involved in the phagocytosis of C. perfringens.  To determine if PFO or PLC were involved in the ability of C. perfringens to survive in the presence of macrophages, we constructed C. perfringens strains lacking these toxins.  The ability of C. perfringens to survive in the presence of J774-33 cells is dependent on PFO, while survival in mouse peritoneal macrophages is dependent on PFO and PLC.  The ability of C. perfringens to escape the phagosome of J774-33 cells and mouse peritoneal macrophages is mediated by either PFO or PLC.  Using a mouse model, we found that PFO and PLC were necessary for C. perfringens to survive in vivo using infectious doses 1000 times lower than those required to initiate a gangrene infection.  We propose that PFO and PLC play a critical role in the survival of C. perfringens during the early stages of gangrene infections, when phagocytic cells are present and bacterial numbers are low.",
  "description_provenance": [
    "Author Email: dobrien@vt.edu",
    "Advisor Email: melville@vt.edu",
    "Advisor Email: rawalker@vt.edu",
    "Advisor Email: dpopham@vt.edu",
    "Advisor Email: kdelgert@vt.edu",
    "Advisor Email: ams@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:32Z (GMT). No. of bitstreams: 3 OBRIENdissertationETD.pdf: 2432766 bytes, checksum: 90c59dbd73f7c89801e3a87d2f8d2f52 (MD5) REFERENCESonly.pdf: 75450 bytes, checksum: 2e3a98b78fe819baf4d0cd55cefcbf95 (MD5) ONLYABSTRACT.pdf: 7988 bytes, checksum: 01df1a163f7380b5e468354648ec063f (MD5)   Previous issue date: 2003-04-18"
  ],
  "handle": "27164",
  "identifier_other": "etd-04232003-135430",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232003-135430/",
  "identifier_uri": "http://hdl.handle.net/10919/27164",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "OBRIENdissertationETD.pdf",
    "REFERENCESonly.pdf",
    "ONLYABSTRACT.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Clostridium perfringens",
    "phagosome",
    "alpha-toxin",
    "LAMP-1",
    "polymorphonuclear leukocytes",
    "anaerobe",
    "macrophage receptors",
    "lysosome",
    "theta-toxin",
    "phagocytosis",
    "macrophages"
  ],
  "title": "The Interactions of Clostridium Perfringens With Phagocytic Cells",
  "type": "Dissertation"
}