{
  "contributor_author": "Wilborn, LaChelle Rachel",
  "contributor_committeechair": "Weaver, Pamela A.",
  "contributor_committeemember": [
    "Williams-Green, Joyce",
    "Murrmann, Suzanne K.",
    "Garrison, James W.",
    "McCleary, Ken W."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:10:34Z",
  "date_adate": "1999-04-27",
  "date_available": "2014-03-14T20:10:34Z",
  "date_issued": "1999-04-18",
  "date_rdate": "2000-04-27",
  "date_sdate": "1999-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An Investigation of the Relationships between Diversity Management Training Involvement with the Personal Inputs and Outputs of Managers in the Lodging Industry.   LaChelle Rachel Wilborn Committee Chair: Pamela A. Weaver Department of Hospitality and Tourism Management  (ABSTRACT)   Increased numbers of women, people of color, and older workers will soon begin to fill positions once held and dominated by European-American men.  To aid in such demographic expansions it is estimated that diversity management and/or sensitivity training programs of some sort take place in over half of the U.S. companies with over 100 employees at an approximate cost of 10 billion dollars per year (Lubove, 1997).  Such programs are thought to alter attitudes and prepare firms for multicultural staffs and market places.  Organizational benefits of such programs are well documented.  However, the impact of these programs on employees remains unanswered.  Discovering the effectiveness and impact of diversity management training programs on mangers in the lodging industry was the challenge put forth in the present study.      The study sought to gain a better understanding of the usefulness of diversity management training programs in the hospitality industry.  Specifically, the present study investigated the perceived benefits of diversity management training programs on the individual level by addressing two research questions.  The first research question asked if there was a relationship between diversity management training involvement and the personal inputs of various lodging managers.  The second question asked if there was a relationship between diversity management training involvement and the personal outputs of lodging managers.  The present study used a combination of Adamsâ   Equity Theory Model, Coxâ  s Interactional Model of Cultural Diversity, and Charlesâ   Relationships of Factors Affecting the Recruitment, Retention & Promotion of Blacks Into Upper-Level Management Model.  The proposed Diversity Management Training Effectiveness Model identified four major constructs to describe and communicate the potential impacts of diversity management training programs on individuals.  Personal inputs, diversity climate (organizational), and personal outputs were utilized to predict lodging managers' involvement in diversity management training programs.    Regression analysis, analysis of variance, Pearson Product Correlation Coefficients, Spearman's Rank Correlation Coefficients, and Two Mean T-tests were used to analysis the 11 hypotheses generated by the two research questions.   The analysis revealed that three personal inputs (age, educational level, and gender) had no relationships with the diversity management training involvement of lodging managers.  While loyalty and seniority, also personal inputs did have relationships with the diversity management training involvement, and thus could be used to predict the managers' involvement in such training programs.  Revealed also in the study were the relationships between involvement with diversity management training programs and employee personal outputs.  Relationships were not found with job/career satisfaction, job involvement, and compensation.  Opportunities for advancement were found to be correlated with a lodging managers' involvement in diversity management training programs.  While, organizational identification received partial support for the relationship with diversity management training involvement.    The model tested in this study provides a means of evaluating the effectiveness and impacts of diversity management training programs on individuals.  Forty-nine percent of all managers surveyed felt diversity management training programs were effective to very effective with regards to minority employees, while 50% felt that these same programs were effective to very effective with regards to non-minority employees.  The findings also suggest that the involvement in diversity management training programs can increase the overall general satisfaction and organizational commitment of lodging managers.",
  "description_provenance": [
    "Author Email: lrwilbrn@memphis.edu",
    "Advisor Email: wmsgreenj@wssumits.wssu.edu",
    "Advisor Email: skm@vt.edu",
    "Advisor Email: wesley@vt.edu",
    "Advisor Email: weaver@vt.edu",
    "Advisor Email: mccleary@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:34Z (GMT). No. of bitstreams: 11 front1.pdf: 7192 bytes, checksum: e532c538f1e42b8a77d8be49452cb112 (MD5) rchp3a.pdf: 8423 bytes, checksum: 6b13cfae3a0bf717fb6789f21100776b (MD5) chp1.pdf: 26959 bytes, checksum: a701fdbc0ebd738f49a2dfc6b859e14d (MD5) ref.pdf: 19315 bytes, checksum: e40053311ce876ebbd00bc83d9317554 (MD5) chp5.pdf: 23917 bytes, checksum: 19ee423e560cf191f664f817a03a2564 (MD5) chp4.pdf: 62948 bytes, checksum: 45899e0bfca79f5c3c0d7a26776700c3 (MD5) vita2.pdf: 28906 bytes, checksum: beae30708cb177d138b6035a63887620 (MD5) chp3.pdf: 60002 bytes, checksum: 268d02bbc642daa379268e951a031ecc (MD5) FRONT1A.PDF: 19650 bytes, checksum: c8001151f4e0726e70f7f0cdb54d3d6d (MD5) rchp2.pdf: 114382 bytes, checksum: d27dad4a4003029830d658719a1f80f1 (MD5) app.pdf: 20737 bytes, checksum: 097a4897f6915b9b777f448a1859c1d2 (MD5)   Previous issue date: 1999-04-18"
  ],
  "handle": "27178",
  "identifier_other": "etd-042399-084603",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042399-084603/",
  "identifier_uri": "http://hdl.handle.net/10919/27178",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "front1.pdf",
    "rchp3a.pdf",
    "chp1.pdf",
    "ref.pdf",
    "chp5.pdf",
    "chp4.pdf",
    "vita2.pdf",
    "chp3.pdf",
    "FRONT1A.PDF",
    "rchp2.pdf",
    "app.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "diversty management training",
    "lodging"
  ],
  "title": "An Investigation of the Relationships between Diversity Management Training Involement with the Personal Inputs and Outputs of Managers in the Lodging Industry",
  "type": "Dissertation"
}