{
  "contributor_author": "Litchfield, David W",
  "contributor_committeechair": "Baird, Donald G.",
  "contributor_committeemember": [
    "Walz, John Y.",
    "Wilkes, Garth L.",
    "Lesko, John",
    "Davis, Richey M."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:10:33Z",
  "date_adate": "2008-05-27",
  "date_available": "2014-03-14T20:10:33Z",
  "date_issued": "2008-04-21",
  "date_rdate": "2009-05-27",
  "date_sdate": "2008-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This work is concerned with mechanical property improvements to poly(ethylene terephthalate), PET, fibers by the addition of layered silicate nanoparticles and by drawing the un-oriented nanocomposite filaments in a second step.  No previous studies on PET fibers filled with montmorillonite (MMT) nanoclay examined fiber drawability at temperatures above the glass transition.  Therefore, the primary objective of this research was to determine 1) if PET nanocomposite fibers could be drawn to finer diameters and 2) whether drawing imparted improved Youngâ  s modulus and tenacity (i.e. strength) relative to un-filled PET fibers.  Of equal importance to this work, the subsequent objective was to discern and understand the role of nanoclay in 1) the production of improved or reduced mechanical properties and 2) the ability to draw PET to lower or higher than normal draw ratios. In the first part of this thesis, the improvements in Youngâ  s modulus and tenacity of PET fibers filled with various types of organically modified montmorillonite is shown and the method to produce them is discussed.  Greater improvements in mechanical properties occurred when the MMT stacks were intercalated with PET.  A nominal 1 wt% loading of dimethyl-dehydrogenated tallow quaternary ammonium surface modified MMT in drawn PET fiber showed a 28% and 63% increase in Youngâ  s modulus and strength, respectively.  Relative to an un-filled PET fiber, these results exceeded the upper-bound of the rule of mixtures estimate.  Therefore, both the type of surface modification and concentration of MMT were shown to affect the degree of PET orientation and crystallinity.  Furthermore, drawability above Tg and elongation-at-break increased upon the addition of organically modified MMT to un-oriented PET fibers, which was a key distinction of this work from others examining similar systems. Interestingly, the mechanical properties of modulus and tenacity showed a maximum with concentration of alkyl modified clay, but drawability did not show significant variation with increasing nanoclay content.  Thermal analysis and Raman spectroscopy was used to examine the role of nanoclay in creating this maximum in mechanical properties.  At low loadings, nanoclay was shown to intercalate with PET and enhance amorphous orientation.  At higher concentrations of nanoclay the presence of large agglomerates prevented efficient orientation to the fiber axis and acted as stress concentrators to aid in cavitation and failure during testing.  Raman spectroscopy showed that the as-spun unfilled PET fibers possessed significantly more trans conformer content of the ethylene glycol moiety than the nanocomposite fibers.  The greater gauche content of the nanocomposite fibers delayed crystalline development during non-isothermal DSC scans to higher temperatures was associated with the increased drawability.",
  "description_provenance": [
    "Author Email: dlitchfi@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:33Z (GMT). No. of bitstreams: 1 Litchfield_Dissertation2.pdf: 3670634 bytes, checksum: 9e59355bfe54d4d9d07565cdbbd853c4 (MD5)   Previous issue date: 2008-04-21"
  ],
  "handle": "27175",
  "identifier_other": "etd-04232008-111405",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232008-111405/",
  "identifier_uri": "http://hdl.handle.net/10919/27175",
  "publisher": "Virginia Tech",
  "relation_haspart": "Litchfield_Dissertation2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fiber drawing",
    "fiber spinning",
    "nanocomposites",
    "drawability",
    "orientation",
    "morphology"
  ],
  "title": "The Manufacture and Mechanical Properties of Poly(ethylene terephthalate) Fibers Filled with Organically-Modified Montmorillonite",
  "type": "Dissertation"
}