{
  "contributor_author": "Fenaux, Martijn",
  "contributor_committeechair": "Meng, Xiang-Jin",
  "contributor_committeemember": [
    "Duncan, Robert B. Jr.",
    "Toth, Thomas E.",
    "Eng, Ludeman A.",
    "Boyle, Stephen M.",
    "Sible, Jill C."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:10:33Z",
  "date_adate": "2004-05-24",
  "date_available": "2014-03-14T20:10:33Z",
  "date_issued": "2004-03-26",
  "date_rdate": "2005-05-24",
  "date_sdate": "2004-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Porcine circovirus type 2 (PCV2) is the primary causative agent of postweaning multisystemic wasting syndrome (PMWS), whereas the ubiquitous porcine circovirus type 1 (PCV1) is nonpathogenic for pigs.  Since its initial detection in a Canadian commercial swine herd in 1991, PMWS has been detected in all swine producing regions of the world and is now a serious economic problem to the swine industry.  The objectives of this dissertation were to biologically, genetically and experimentally characterize both PCV1 and PCV2, to identify the genetic determinant(s) for virulence and replication, and to develop an effective genetically-engineered vaccine against PCV2 infection and PMWS.  The genetic heterogeneity of PCV2 and PCV1 isolates from different geographic origins were determined.  We found that, although PCV1 and PCV2 genomes were very conserved, some minor genomic variation exists among PCV1 isolates and PCV2 isolates.  The nonpathogenic PCV1 and pathogenic PCV2 share only about 76% nucleotide sequence identity but have similar genomic organization. The highest sequence variability among PCV isolates is found in the immunogenic ORF2 capsid gene. Based on the sequence data in this dissertation, a universal polymerase chain reaction-restriction fragment length polymorphism (PCR-RFLP) assay was developed that is capable of detecting all known PCV isolates and differentiating between infections by nonpathogenic PCV1 and pathogenic PCV2.  In order to study the structural and functional relationship of PCV genes and to develop a genetically-engineered vaccine, we constructed infectious DNA clones of both PCV1 and PCV2.  By using the PCV2 infectious clone, we showed that pigs can be infected by direct intrahepatic injection of PCV2 infectious DNA clone.  The pathological lesions and clinical disease associated with PCV2 infection were more definitively characterized by using the infectious DNA clone. We found that PCV2 is the primary but not the sole causative agent of PMWS, as the full spectrum of clinical PMWS was not reproduced by the infectious PCV2 DNA clone although pathological lesions characteristic of PMWS were reproduced. A chimeric vaccine was constructed by cloning the immunogenic capsid gene of the pathogenic PCV2 into the genomic backbone of the non-pathogenic PCV1 virus.  We showed that the resulting chimeric PCV1-2 vaccine virus, retained the non-pathogenic nature of PCV1 but induced a protective immune response against a wild-type PCV2 challenge.  In vaccinated pigs, the chimeric PCV1-2 vaccine reduced PCV2 viremia length and serum virus loads and reduced pathological lesions such as lymphoid depletion (LD) and histiocytic replacement (HR) in lymphoid tissues, inflammation and discoloration of the lymph nodes.  The amounts of PCV2 antigen and PCV2 genomic copy loads in lymph node tissues were also significantly reduced.  Our results indicated that the attenuated chimeric PCV1-2 virus induces protective immunity against PCV2 infection and thus could serve as an effective vaccine against PCV2 and PMWS. To improve the safety of the vaccine, we attempted to identify the genetic determinant(s) for PCV2 virulence.  An isolate of PCV2 was serially passaged for 120 times in PK-15 cells.  After 120 passages, a total of two amino acid mutations were identified in the capsid protein of the passage 120 virus (VP120), P110A and R191S. Compared to other known PCV1 and PCV2 sequences, the two amino acid mutations in PCV2 VP120 are unique. The VP120 virus was biologically characterized in vitro and experimentally characterized in specific-pathogen-free (SPF) pigs.  The two amino acid mutations resulted in an enhanced replication ability of PCV2 VP120 in PK-15 cells and an attenuated phenotype in infected pigs.  The P110A and R191S mutations in the capsid protein either alone or collectively are likely important for PCV2 virulence and replication.   In summary, we genetically characterized PCV2 isolates from different geographic regions and developed a PCR-RFLP assay.  We constructed and characterized infectious DNA clones of PCV1 and PCV2, and developed a genetically engineered vaccine against PCV2 infection.  We also identified the genetic determinants for PCV2 virulence and replication.  The vaccine developed in this study, when it becomes available, will help the swine industry control this important pathogen.",
  "description_provenance": [
    "Author Email: Mfenaux@stanford.edu",
    "Advisor Email: xjmeng@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:33Z (GMT). No. of bitstreams: 1 FenauxPhDDiss.pdf: 3110588 bytes, checksum: 1f9f7f6a8f19638cadc2535e9dced9d7 (MD5)   Previous issue date: 2004-03-26"
  ],
  "handle": "27171",
  "identifier_other": "etd-04232004-134825",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232004-134825/",
  "identifier_uri": "http://hdl.handle.net/10919/27171",
  "publisher": "Virginia Tech",
  "relation_haspart": "FenauxPhDDiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Postweaning Multisystemic Wasting Syndrome",
    "PCV1",
    "chimeric vaccine",
    "Keywords and abbreviations: Porcine circovirus",
    "recombinant",
    "molecular biology",
    "virology",
    "PMWS",
    "PCV2"
  ],
  "title": "Molecular Pathogenesis and Development of a Genetically Engineered Vaccine for Type-2 Porcine Circovirus",
  "type": "Dissertation"
}