{
  "contributor_author": "Daniels, Kristy Marie",
  "contributor_committeechair": "Akers, Robert Michael",
  "contributor_committeemember": [
    "Capuco, Anthony V.",
    "McGilliard, Michael L.",
    "James, Robert E.",
    "Knowlton, Katharine F."
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:10:33Z",
  "date_adate": "2008-04-28",
  "date_available": "2014-03-14T20:10:33Z",
  "date_issued": "2008-04-15",
  "date_rdate": "2008-04-28",
  "date_sdate": "2008-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study was to evaluate effects of milk replacer (MR) composition on: mass and composition of mammary parenchyma (PAR) and fat pad (MFP), growth hormone (GH)/insulin-like growth factor-I (IGF-I) axis gene expression, and putative mammary epithelial stem cells. The hypothesis was that diet during the pre-weaning period alters the development, persistence, or activity of populations of putative mammary epithelial stem cells, possibly through involvement of GH/IGF-I axis molecules. Twenty-four newborn heifers were fed one of four MR diets: CON (20% CP, 21% fat MR fed at 441 g DM/d), HPLF (28% CP, 20% fat MR fed at 951 g DM/d), HPHF (27% CP, 28% fat MR fed at 951 g DM/d), and HPHF+ (27% CP, 28% fat MR fed at 1431 g DM/d). Animals were harvested on d 65 of life and mammary tissue was subjected to biochemical, molecular, and histological examination. By design, the effects of diet were evaluated at a common chronological age, but not necessarily at the same physiological age (body weight). Results from heifers reared on CON were compared to the average results from heifers reared on the other 3 diets. The second comparison evaluated the effect of increased fat in MR when protein content and intake were the same. The final comparison evaluated the effect of increased intake of a high-fat, high-protein MR. Neither diet composition nor nutrient intake in pre-weaned heifers affected PAR weight, PAR composition, GH/IGF-I axis gene expression, or putative mammary epithelial stem cell abundance when assessed at a common chronological age. Changes in MFP size and composition were observed, but no diet effect on GH/IGF-I axis gene expression in MFP was observed. This suggests nutrition is not critical for regulating the expression of local GH/IGF-I axis components or stem cell populations in the developing heifer mammary gland.",
  "description_provenance": [
    "Author Email: danielsk@vt.edu",
    "Advisor Email: Tony.Capuco@ARS.USDA.GOV",
    "Advisor Email: mcg@vt.edu",
    "Advisor Email: rma@vt.edu",
    "Advisor Email: jamesre@vt.edu",
    "Advisor Email: knowlton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:33Z (GMT). No. of bitstreams: 2 Daniels_dissertation_FINAL_R2.pdf: 1114900 bytes, checksum: f5938d6c2b48ed7fea59fe7d44928eb1 (MD5) Daniels_dissertation_FINAL_R1.pdf: 1115089 bytes, checksum: 13e79012ba62dcd8c36ab89f764a685c (MD5)   Previous issue date: 2008-04-15"
  ],
  "handle": "27174",
  "identifier_other": "etd-04232008-084557",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232008-084557/",
  "identifier_uri": "http://hdl.handle.net/10919/27174",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Daniels_dissertation_FINAL_R2.pdf",
    "Daniels_dissertation_FINAL_R1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "nutrition",
    "mammary",
    "heifer"
  ],
  "title": "Effects of Milk Replacer Composition on Measures of Mammary Development in Holstein Heifer Calves",
  "type": "Dissertation"
}