{
  "contributor_author": "McCann, Martha Mary",
  "contributor_committeechair": "Corcoran, Sean Gerald",
  "contributor_committeemember": [
    "Aning, Alexander O.",
    "Reynolds, William T. Jr.",
    "Kampe, Stephen L.",
    "Farkas, Diana"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:10:33Z",
  "date_adate": "2004-04-29",
  "date_available": "2014-03-14T20:10:33Z",
  "date_issued": "2004-03-29",
  "date_rdate": "2004-04-29",
  "date_sdate": "2004-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nanoindentation is an increasingly used tool to investigate the mechanical properties of very small volumes of material.  Gold single crystals were chosen as a model system for surface modification studies, because of the electrochemical advantages and the simple structure of the material. Experiments on these samples displayed a spectrum of residual deformation, with measured hardness values on the same surface differing by over a factor of two.  The yield point also exhibited considerable variation, but the depth of penetration was independent of this elasticâ  plastic transition.   The onset of plastic deformation in these tests is observed at stress levels on the order of the theoretical yield strength.  There are a limited number of defects in a single crystal specimen of gold, especially on the length scale required to influence nearly every indentation experiment.  A test matrix was designed to change the concentrations of possible defects in a sample (dislocations, vacancies, and structural features), by altering some of the surface preparation parameters.  The results of these experiments were extremely consistent.  Observed trends within the matrix, combined with the observations of reduced hardness and earlier plasticity when compared to the preliminary testing, indicate a decline in the structural continuity of the sample.  This is surprising considering the extensive material removal and thermal history of some of these surfaces.  There is no indication of a cause for the dramatic inconsistencies in mechanical properties observed in preliminary testing, but a consistent surface enables the study of intentional modifications.  Changes in contact area that were undetectable in preliminary results now demonstrate predictable shifts in hardness values.  The deposition of a single monolayer of gold oxide raised the average load at yield by a factor of three and increased the hardness by over 26%.  Attributing this change to the oxide is corroborated by the reduction of hardness when the oxide is stripped.  Similar behavior is observed when a lead monolayer is deposited and tested ex-situ.  It is surprising that layers <0.5 nm in thickness would have such a dramatic influence on indentation tests at least 35 nm deep.  This indicates that no surface layer can be ignored at this scale.  These experiments demonstrate that there is still much to be learned about nanoscale deformation mechanisms.",
  "description_provenance": [
    "Author Email: mamccann@vt.edu",
    "Advisor Email: aaning@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: sgc@vt.edu",
    "Advisor Email: kampe@vt.edu",
    "Advisor Email: diana@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:33Z (GMT). No. of bitstreams: 1 Nanoindentation-of-Gold-Single-Crystals.pdf: 4091658 bytes, checksum: 3b9654b31a857469efdda81c22f0b901 (MD5)   Previous issue date: 2004-03-29"
  ],
  "handle": "27170",
  "identifier_other": "etd-04232004-091718",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232004-091718/",
  "identifier_uri": "http://hdl.handle.net/10919/27170",
  "publisher": "Virginia Tech",
  "relation_haspart": "Nanoindentation-of-Gold-Single-Crystals.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Surface Structure",
    "Electrochemical Modification",
    "Yield Variability",
    "Nanoindentation",
    "Hardness Variability",
    "Gold"
  ],
  "title": "Nanoindentation of Gold Single Crystals",
  "type": "Dissertation"
}