{
  "contributor_author": "Ball, James D.",
  "contributor_committeechair": "Hoerner, James L.",
  "contributor_committeemember": [
    "Hensley, Stephen Michael",
    "Gilli, Angelo",
    "Morgan, Samuel D.",
    "Cross, Lawrence H."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:34Z",
  "date_adate": "1999-05-11",
  "date_available": "2014-03-14T20:10:34Z",
  "date_issued": "1998-12-11",
  "date_rdate": "2000-05-11",
  "date_sdate": "1999-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Maryland Community College Academic Deans and Department Chair Perceptions of Higher-Order Skill Proficiencies for Associate Degree Completers   By James D. Ball   Committee Chair: Dr. James L. Hoerner Community College Administration   (Abstract)   The SCANS report issued in 1990 brought national attention to concerns about lagging competencies of US workers and their lack of preparedness for the high-performance workplace. Since the SCANS report, several national and statewide efforts have attempted to identify skill sets appropriate for success in the changing workplace. Recent discussion has included skill sets appropriate for college graduates. This study was designed to determine perceptions of Maryland community college chief academic officers and department chairs toward one such skill set, the Maryland Skills for Success, and whether they are appropriate learning expectations for associate degree completers. The Maryland Skills for Success (MSS) are comprised of five skill goals: (1) learning skills, (2) thinking skills, (3) communication skills, (4) technology skills, and (5) interpersonal skills. Three to five â  learning expectationsâ   elaborate what students should be able to accomplish under each skill goal to be successful in future work and learning.    The study involved a survey of 293 chief academic officers and department chairs at the 18 community colleges across Maryland. A 75 percent response rate was achieved. The survey assessed the extent to which respondents agreed that: (a) the Maryland Skills for Success are appropriate expectations for associate degree completers, (b) students currently achieve MSS expectations, (c) respondentâ  s courses and programs contain specific learning objectives that require students to learn and perform such skills, (d) all Maryland community colleges should teach and assess a common set of higher-order knowledge application skills.    Respondent ratings indicated that the Maryland Skills for Success represent valid learning expectations for associate degree completers. Deans were more favorable toward the MSS than were department chairs, and were more confident that students were required to learn and perform learning expectations similar to those listed in the MSS. The department chairs were also divided into groups to determine attitudinal differences by disciplines. The department chairs were more likely than the deans to agree that students currently achieve the MSS learning expectations. Most chair groups somewhat disagreed their courses and programs contained specific learning objectives requiring students to learn and perform the skills represented in the MSS. Of the chair groups, the English/fine arts/humanities, and the technologies/health care groups tended to produce significantly higher ratings than other chairs and supported the notion of Maryland community Colleges teaching and assessing a common higher-order knowledge application skill set.    Based on respondent ratings, the communication, thinking and interpersonal skill sets in the MSS have the best chance of gaining acceptance by colleges interested in integration of purposeful teaching and assessment of a higher-order skill set across the curricula. Respondent ratings also indicated that it is unlikely that the colleges would undertake a common initiative to teach and assess a common skill set like the MSS without intervention from the state. Respondents expressed distrust of bureaucratic intervention, were somewhat concerned about the difficulty of teaching and assessing the entire skill set, and felt that the skill sets were too broad to be feasibly taught. Recommendations include the need for extensive faculty development and the provision of incentives from the state educational agencies to provide support for colleges interested in teaching and assessing a common higher-order knowledge application skill set.",
  "description_provenance": [
    "Author Email: jball@carroll.cc.md.us",
    "Advisor Email: hensley@lmc.cc.mi.us",
    "Advisor Email: anglyn@juno.com",
    "Advisor Email: jhoerner@vt.edu",
    "Advisor Email: samorgan@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:34Z (GMT). No. of bitstreams: 1 balldiss.PDF: 447032 bytes, checksum: fba54c1f146245d17e85a748c6368c82 (MD5)   Previous issue date: 1998-12-11"
  ],
  "handle": "27179",
  "identifier_other": "etd-042399-090010",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042399-090010/",
  "identifier_uri": "http://hdl.handle.net/10919/27179",
  "publisher": "Virginia Tech",
  "relation_haspart": "balldiss.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "technology skills",
    "interpersonal skills",
    "communication skills",
    "thinking skills",
    "learning skills",
    "workforce preparation",
    "school-to-work",
    "SKANS",
    "higher-order skills",
    "Maryland commnuity colleges",
    "community college",
    "college-level competencies"
  ],
  "title": "Maryland Community College Academic Deans and Department Chair Perceptions of Higher-Order Skill Proficiencies for Associate Degree Completers",
  "type": "Dissertation"
}