{
  "contributor_author": "Beaumaster, Suzanne",
  "contributor_committeechair": "Dickey, John W.",
  "contributor_committeemember": [
    "Rees, Joesph V.",
    "Wamsley, Gary L.",
    "Dudley, Larkin S.",
    "Thomson, James Michael"
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:10:33Z",
  "date_adate": "1999-05-05",
  "date_available": "2014-03-14T20:10:33Z",
  "date_issued": "1999-03-24",
  "date_rdate": "2000-05-05",
  "date_sdate": "1999-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research project addresses the issues affecting information technology development and deployment.  The issues represented in this study are addressed in the context of IT implementation processes, especially with regard to the question of the needs and perceptions of administrators from the local government arena.  In addition, this study will provide an exploratory look at the problematic issues surrounding IT implementation and how local government administrators--in particular--perceive them.   \tMore specifically, this study provides the following:  a discussion of management and organizational issues that have a direct relationship to IT and local government implementation needs; a discussion of the problems which are specific to local government executives with regard to IT implementation; a comprehensive view of the overriding problems associated with the IT development and deployment process in local government; descriptive data revealing local government executiveâ  s perceptions about the issues surrounding IT development processes; and a basis for development of an IT implementation framework for local government.  Each of these provisions is integral to developing a comprehensive understanding of the problems associated with the planning, acquisition, and implementation of ITs in local government.  These provisions lay the foundations for future development of an IT implementation framework for local government. \tThe research in this study suggests that there are three primary results, which are shown here.  The first is thatâ  strategic planning for IT is fundamental to the ultimate effectiveness of IT implementation.  Planning with regard to IT acquisition and deployment has proven to be a difficult accomplishment regardless of organization type or sector.  This study specifically addresses many of the issues surrounding this problem, as it is integral to the implementation process as a whole.  Secondly, it is shown that interdepartmental coordination has proven to be a major factor in effective IT implementation.  Previous studies in this area have shown a propensity over the course of the development of IT towards decentralization of the acquisition and management of technologies.  This trend speaks directly to the issue of interdepartmental coordination and the difficulties local government managers face when attempting to implement ITs in their organizations.  Finally, it is shown that the expertise levels of executives with regard to IT has proven to be a contributing factor to effectiveness of the IT development and deployment process.",
  "description_provenance": [
    "Author Email: beaumast@ulv.edu",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: thomsonjm@nku.edu",
    "Advisor Email: jdickey@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:33Z (GMT). No. of bitstreams: 1 DISSERTATION2.PDF: 338519 bytes, checksum: 96e51aaa124512e85b5cc483a4bb677b (MD5)   Previous issue date: 1999-03-24"
  ],
  "handle": "27177",
  "identifier_other": "etd-042399-053715",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042399-053715/",
  "identifier_uri": "http://hdl.handle.net/10919/27177",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISSERTATION2.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Information Technology",
    "MIS",
    "PMIS",
    "public sector IT"
  ],
  "title": "Information Technology Implementation Issues:  An Analysis",
  "type": "Dissertation"
}