{
  "contributor_author": "Toppin, Claudette V.",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Cline, Marvin Gerald",
    "Morris, Linda E.",
    "Welch, William",
    "Wiswell, Albert W."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:33Z",
  "date_adate": "2006-05-04",
  "date_available": "2014-03-14T20:10:33Z",
  "date_issued": "2006-04-06",
  "date_rdate": "2008-05-04",
  "date_sdate": "2006-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This qualitative study explored a number of paradoxes embedded in the mentoring phenomenon. Designed as cross-dimensional case study, the questions sought to better understand: (a) what challenges and barriers did the mentor and mentee face in their cross-racial, cross-cultural, and/or cross-age peer mentoring relationship in this specific organization? (b) How did the mentor and mentee address cross-racial, cross-cultural, and cross-age barriers? (c) What skills and/or competencies, as perceived by the mentor and menteeâ  s experiences are needed to make a cross-racial, cross-cultural, and cross-age peer mentoring relationship successful?  The unit of analysis for this investigation was one pair - female mentor and mentee- with cross-dimensional differences, thus setting the framework for different cultural perspectives. Data collected for this study were transcriptions from three interviews, the mentee, mentor, and the dyad together. Characterized by the case and field method of research, combined data sources were used concurrently â  at different times to compare the participants, views, values, perceptions, experiences and philosophies. The studyâ  s goals involved examining the challenges and experiences, of mentoring in a multicultural work setting, and identifying issues relating to cross racial, cross-cultural, and cross-age mentoring relationships. Although linguistic and cultural barriers crested challenges for this mixed pair, their co-created relationship helped to overcome cultural differences. Thematic findings that embodied the foundations of the multicultural relationship were categorized into six areas: Trust and respect, willingness to participate, cultural understanding, mutual compatibility and psychosocial support, knowledge sharing and role modeling, and leadership. Trust emerged as the overarching construct, which laid the foundation for the mentoring relationship structure, linking The Five Câ  s (Characteristics) - compatibility, confidence, capabilities, communication, and cultural understanding. Unique in this pair was a source of motivation that transcended their individual selves for a greater cause, which has profound implications for future research. The studyâ  s conclusions addressed: a) mentoring at a macro level for the community, and for a greater good, and b) a form of dialogue to foster an appreciation of multiculturalism â   an appreciation of human differences and commonalities. Recommendations were made for future research.",
  "description_provenance": [
    "Author Email: Ktoppin@adelphia.net",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: linda_morris11495@yahoo.com",
    "Advisor Email: w.welchsr@worldnet.att.net",
    "Advisor Email: awiswell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:33Z (GMT). No. of bitstreams: 1 CToppinFinaletd.pdf: 3036289 bytes, checksum: f2c952ecbc1747a9cbb8805047431796 (MD5)   Previous issue date: 2006-04-06"
  ],
  "handle": "27173",
  "identifier_other": "etd-04232006-085022",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04232006-085022/",
  "identifier_uri": "http://hdl.handle.net/10919/27173",
  "publisher": "Virginia Tech",
  "relation_haspart": "CToppinFinaletd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Multicultural Knowledge",
    "Peer Mentoring. Multicultural Mentoring",
    "Cross-Racial Mentoring",
    "Cross-Cultural",
    "Professional Growth"
  ],
  "title": "A Qualitative Study of Mentoring in a Multicultural Educational Work Setting: A Cross-Racial, Cross-Cultural and, Cross-Age Perspective of Two Women.",
  "type": "Dissertation"
}