{
  "contributor_author": "Reiss, Tiffany Michelle",
  "contributor_committeechair": "Baffi, Charles R.",
  "contributor_committeecochair": "Landon-Moore, Mary",
  "contributor_committeemember": [
    "Lepczyk, Billie F.",
    "Fortune, Jimmie C.",
    "Redican, Kerry J."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:10:35Z",
  "date_adate": "2001-04-25",
  "date_available": "2014-03-14T20:10:35Z",
  "date_issued": "2001-04-23",
  "date_rdate": "2002-04-25",
  "date_sdate": "2001-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract Relationship of Body Attitude and Personality Characteristics to Dietary Intake in Female Collegiate Athletes Tiffany Michelle Reiss The purpose of this study was to compare the relationship of body attitude to both dietary intake and selected personality characteristics.  The study focused on the relationship between dietary intake and both body attitude and personality characteristics as well as differences in body attitude and personality characteristics between female college age lacrosse athletes, dance team members and controls.  The subjects were 27 lacrosse players (mean age = 19.4 ± 1.1 y), 20 dance team members (mean age = 19.5 ± 1.4 y) and 64 non- athlete controls (mean age = 20.6 ± 1.5 y).   Participants were administered the Eating Disorder Inventory-2 (EDI-2), the Ben-Tovim Walker Body Attitude Questionnaire, the Cognitive Behavioral Dieting Scale and a Silhouette Scale to assess body attitude and selected personality traits.  Participants completed a 5-day diet record including 3 consecutive weekdays and 2 weekend days Group mean differences on body attitude and personality traits were analyzed using one-way analysis of variance. Post-hoc analyses were performed using the Tukey procedure and the Kruskal-Wallis Test.  Relationships were determined between dietary intake, body attitude and personality traits utilizing the Pearson Product Moment Correlation procedures.  Stepwise multiple regression techniques were utilized in the attempt to develop a valid and reliable prediction equation for dietary intake using body attitude and selected personality characteristics. Significant differences did exist between the athletic groups and the control group on interoceptive awareness, maturity fears, social insecurity, feelings of attractiveness, body dissatisfaction, perfectionism, bulimia, interpersonal distrust, dietary protein (g) intake, dietary fat (g) intake, dietary fiber (g) intake, and vitamin C (mg) intake.  No significant differences were found between the lacrosse and dance team on dietary intake, body attitude or personality traits.  Significant relationships did exist between dietary intake and body attitude measures in all three groups.  In addition, significant relationships were also found to exist between body attitude measures and personality traits in all three groups.  Five different prediction equations were generated using relationships from each individual group and then combined groups.  The results of this study indicate that female athletes involved in both aesthetic and non-aesthetic sports, may be purposefully restricting total caloric intake as well as fat intake due to body image dissatisfaction during the competitive season.",
  "description_provenance": [
    "Author Email: treiss@vt.edu",
    "Advisor Email: lepczyk@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: mlandonm@vt.edu",
    "Advisor Email: baffic@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:35Z (GMT). No. of bitstreams: 1 ReissDissertation.pdf: 373154 bytes, checksum: 254f80b63ad024f4d5892488c7e30d3a (MD5)   Previous issue date: 2001-04-23"
  ],
  "handle": "27188",
  "identifier_other": "etd-04242001-161823",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242001-161823/",
  "identifier_uri": "http://hdl.handle.net/10919/27188",
  "publisher": "Virginia Tech",
  "relation_haspart": "ReissDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "female athletes",
    "dietary intake",
    "body attitude"
  ],
  "title": "Relationship of Body Attitude and Personality Characteristics  to Dietary Intake in Female Collegiate Athletes",
  "type": "Dissertation"
}