{
  "contributor_author": "Pritamani, Mahesh",
  "contributor_committeechair": "Singal, Vijay",
  "contributor_committeemember": [
    "Kumar, Raman",
    "Keown, Arthur J.",
    "Kadlec, Gregory B.",
    "Billingsley, Randall S."
  ],
  "contributor_department": "Finance",
  "date_accessioned": "2014-03-14T20:10:34Z",
  "date_adate": "1999-04-24",
  "date_available": "2014-03-14T20:10:34Z",
  "date_issued": "1999-04-12",
  "date_rdate": "2000-04-24",
  "date_sdate": "1999-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examines whether simultaneously conditioning on the  multidimensional characteristics of information signals can help predict returns  that are of economic significance.  We use large price changes, public  announcements, and large volume increases to proxy for the magnitude,  dissemination, and precision of information signals.  Abnormal returns following  large price change events are found to be unimportant.  As we condition on other  characteristics of information signals, the abnormal returns become large.   Large price change events accompanied by both a public announcement and an  increase in volume have a 20-day abnormal return of almost 2% for positive  events and -1.68% for negative events.  The type of news provides further  refinement.  If the news relates to earnings announcements, management earnings  forecasts, or analyst recommendations then the 20-day abnormal returns becomes  much larger: ranging from 3% to 4% for positive events and about -2.25% for  negative events. For these news events, we also find that the underreaction is  greater for positive (negative) event firms that underperformed (overperformed)  the market in the prior period, earning 20-day post-event abnormal returns of  4.85% (-3.50%).  This evidence is consistent with the Barberis, Shleifer, and  Vishny (1998) model of investor sentiment that suggests that investors are slow  to change their beliefs.  The evidence from our sample does not provide much  support for strategic trading models under information asymmetry.  Finally, an  out-of-sample trading strategy generates 20-day post-event statistically  significant abnormal return of 2.18% for positive events and -2.40% for negative  events.  Net of transaction costs, the abnormal returns are a statistically  significant 1.04% for positive events and a statistically significant -1.51% for  negative events.",
  "description_provenance": [
    "Author Email: mahesh@vt.edu",
    "Advisor Email: rkumar@vt.edu",
    "Advisor Email: emily@vt.edu",
    "Advisor Email: kadlec@vt.edu",
    "Advisor Email: randall@vt.edu",
    "Advisor Email: singal@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:34Z (GMT). No. of bitstreams: 1 DISS.PDF: 343566 bytes, checksum: 4250ac684ae7c46fd932404274e54736 (MD5)   Previous issue date: 1999-04-12"
  ],
  "handle": "27180",
  "identifier_other": "etd-042399-112528",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042399-112528/",
  "identifier_uri": "http://hdl.handle.net/10919/27180",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISS.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Information Quality",
    "Return Predictability",
    "Information Signals"
  ],
  "title": "Return Predictability Conditional on the Characteristics of Information Signals",
  "type": "Dissertation"
}