{
  "contributor_author": "Loor, Juan Jose",
  "contributor_committeechair": "Herbein, Joseph H. Jr.",
  "contributor_committeemember": [
    "Keenan, Thomas W.",
    "Stallings, Charles C.",
    "Polan, Carl E.",
    "Barnes, Michael A.",
    "Kronfeld, David S."
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:10:35Z",
  "date_adate": "2001-04-25",
  "date_available": "2014-03-14T20:10:35Z",
  "date_issued": "2001-04-13",
  "date_rdate": "2002-04-25",
  "date_sdate": "2001-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Experiments were conducted to investigate: 1) production of trans-18:1 and cis/trans-18:2 isomers due to input of forage and corn grain in continuous culture fermenters, 2) concentrations of trans-18:1 and cis/trans-18:2 isomers in blood and milk fat of grazing cows fed a grain supplement containing solvent- or mechanically-extracted soybean meal, 3) plasma and milk fatty acid profiles of lactating cows in response to a conjugated linoleic acid (CLA) mixture infused into the rumen, and 4) effects of cis9,trans11-18:2 (9/11CLA) or trans10,cis12-18:2 (10/12CLA) on de novo synthesis and desaturation of milk fatty acids in lactating cows fed unsaturated oils.  In the first study, rumen fermenters were fed (50 g DM/d) orchardgrass or red clover with 0, 8, or 16 g/d corn replacing equal portions of forage DM.  Outflow of trans11,cis15-18:2 (11/15LA) in effluents was greater when DM input was clover or grass only.  With each increment of corn, output of 9/11CLA increased until it was 205% greater compared with forage alone.  Trans11-18:1 (TVA), an intermediate in 18:2n6 (LA) and 18:3n3 (LN) hydrogenation, output increased by 28% with corn addition.  Outputs of trans10-18:1 and 10/12CLA nearly doubled as corn increment increased.  In the second experiment, Holstein cows grazing mixed clover-grass pastures were fed a grain supplement (6.7 kg/d) containing 1.7 kg solvent-extracted soybean meal (SES, 15 mg LA/g of DM), 1.9 kg mechanically-extracted soybean meal (MES, 24 mg LA/g of DM), or 1.9 kg MES plus 30 g of liquid methionine hydroxy analog (MESM).  Cows fed MES or MESM had greater concentrations of LA, TVA, 9/11CLA, and 11/15LA in blood compared with cows fed SES.  Daily yields of 18:0 (SA), LA, LN, TVA, and 9/11CLA in milk fat also were greater for cows fed MES or MESM compared with SES.  In experiment 3, four Holstein cows were used in a 4 x 4 Latin square to determine plasma and milk fatty acid profiles during infusion of a CLA mixture at 0, 45, 90, or 180 g/d for 48 h into the rumen.  Relative to the control, infusion of 180 g CLA/d decreased milk fat percentage and yield.  Lower milk fat yield resulted from depressed concentrations of saturated 6:0 to 16:0 medium-chain fatty acids (MCFA).  Concentrations of TVA, trans10-18:1, and 10/12CLA in blood plasma, and yields in milk fat increased in response to each dose of CLA.  Stearic acid yield also increased as dose of CLA increased.  Yield of cis9-18:1 (OA) in milk fat, however, was lower at 180 g CLA/d.  In experiment 4, four cows were fed high-oleic (HO) or high-linoleic (HL) (2.5% of DM) oil for 11 d prior to abomasal infusion (15 g/d) of 9/11CLA or 10/12CLA for 48 h (2 x 2 factorial).  Milk fat percentage and yield decreased 25% due to infusion of 10/12CLA compared with 9/11CLA, regardless of diet.  Lower fat yields resulted from lower MCFA concentrations and yields.  Regardless of diet, concentration (but not yield) of SA increased 40% when 10/12CLA was infused compared with 9/11CLA.  Concentrations and yields of OA, 9/11CLA, and 20:4n6 also were reduced by infusing 10/12CLA compared with 9/11CLA regardless of diet.  Thus, in addition to inhibiting de novo fatty acid synthesis, 10/12CLA appeared to inhibit desaturation via delta-6 and delta-9 desaturases.  Significant implications from the above studies include: 1) 11/15LA and TVA are the primary intermediates flowing out of the rumen during hydrogenation of pasture lipids, 2) replacing forage DM with starch, OA, and LA increases synthesis of trans10-18:1 and 10/12CLA in the rumen, 3) desaturation of TVA produced in the rumen provides an alternate source for 9/11CLA in milk fat, and 4) 10/12CLA decreases de novo synthesis and desaturation of milk fatty acids.",
  "description_provenance": [
    "Author Email: jloor@vt.edu",
    "Advisor Email: twkeenan@vt.edu",
    "Advisor Email: cstallin@vt.edu",
    "Advisor Email: cpolan@vt.edu",
    "Advisor Email: barnesm@vt.edu",
    "Advisor Email: herbeinj@vt.edu",
    "Advisor Email: kronfeld@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:35Z (GMT). No. of bitstreams: 1 jjlooretd.PDF: 597554 bytes, checksum: 59f392aabec4286d7555d3762ad2c62d (MD5)   Previous issue date: 2001-04-13"
  ],
  "handle": "27187",
  "identifier_other": "etd-04242001-120117",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242001-120117/",
  "identifier_uri": "http://hdl.handle.net/10919/27187",
  "publisher": "Virginia Tech",
  "relation_haspart": "jjlooretd.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "trans10cis12-18:2",
    "rumenic acid",
    "trans10-18:1",
    "trans-vaccenic acid",
    "grazing",
    "milk fat"
  ],
  "title": "Alterations in Mammary Gland Synthesis and Secretion of Fatty Acids in Response to Trans Isomers of Octadecenoic Acid or Conjugated Linoleic Acid Isomers",
  "type": "Dissertation"
}