{
  "contributor_author": "Choi, Jeong-Gil",
  "contributor_committeecochair": [
    "Kwansa, Francis A.",
    "Olsen, Michael D."
  ],
  "contributor_committeemember": [
    "Tse, Eliza C.",
    "Thompson, G. Rodney",
    "Uysal, Muzaffer S."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:10:34Z",
  "date_adate": "1999-04-29",
  "date_available": "2014-03-14T20:10:34Z",
  "date_issued": "1999-03-26",
  "date_rdate": "2000-04-29",
  "date_sdate": "1999-04-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The essential characteristic of the future is uncertainty.  A basic feature of the economy, and life in general, is that decisions are made under conditions of uncertainty-the future is unknowable.  Having reliable guidelines or indicators that provide discipline and signposts to the future is required for the process of successful investing. Conditions are constantly changing, and there are no rewards for replaying the same old game over and over.  To answer for this demand, continued from the previous studies (Choi, 1996; Choi et al., 1997a; Choi et al., 1997b; Choi et al., 1999), this study developed the restaurant industry business cycle models and examined financial practices of the high and low performing firms over the industry cycles. <p> <p>The U.S. restaurant industry demonstrated three cycles (peak to peak or trough to trough) for the period of 1970 through 1998.  The restaurant industry peaked in 1973, 1979, and 1989.  The industry troughed in 1970, 1974, 1980, and 1991.  The mean duration of the restaurant industry cycles is 8 years (SD: 2) calculated by peak to peak and 6.5 years (SD: 2.08) calculated by trough to trough.  Expansion takes an average of 6 years in the restaurant industry but declines sharply after it reaches the peak taking average 1.33 years. <p> <p>The restaurant industry experienced high growth (boom) every five years on average.  The troughs of the growth cycles, contrasted to the peaks of the growth cycles, coincided with those of the restaurant industry business cycles in each case except one (1985).  During that year a low growth phase interrupted industry business expansion but did not terminate it. Restaurant industry growth cycles, then, tend to be relatively symmetrical: since 1970 the average duration was about 2.25 years for both expansion (L-H) and contraction (H-L).  In contrast, the restaurant industry business cycles in the same period show a strong asymmetry: the expansions lasted on the average 6 years; the contractions, 1.33 years.  The expansions have varied in duration much more than the high growth phases have (the respective standard deviations are 2.58 and 0.95 years).<p> <p>This study supports the view that the cyclical fluctuations of the growth of the restaurant industry can be projected by measuring and analyzing series of economic indicators and each economic indicator has specific characteristics in terms of time lags, and thus can be classified into leading, coincident, and lagging indicators.  This study formed a set of composite indices with twelve indicators classified in the leading category, six as coincident, and twenty as lagging.<p> <p>The high performing firms' financial practices regarding investment decisions measured by capital spending, and price earning ratio, and part of financing and dividend decisions measured by market value of common share outstanding are independent of the cyclical fluctuations of the industry cycles.  But, their practices regarding dividend decisions measured by the earning per share, investment decision measured by cash flow per share, and financing decisions measured by asset value per share and long term debt level are dependent on the events (Expansion/Contractions) in the Restaurant Industry Cycles.  Conclusively, high performers exercise their capital investment (reflected by capital spending) and equity management (reflected by common share outstanding and P/E ratio) independently while being less influenced by the industry swings.  They exercise, however, their working capital management (reflected by cash flow per share), earning management (reflected by EPS), asset management, and long term debt management quite dependently while being more influenced by the industry swings. <p> <p>The financial practices exercised by the low performing firms are independent from the events in the industry cycle.  Although some financial practices are related to the events in the industry cycle, the directions are opposite to the events in the industry cycle.  Specifically, for all of the selected financial strategies except common share outstanding and long-term debt, the low performers practice them independently from the cyclical fluctuations of the industry cycles.  Even for common share outstanding and long-term debt strategies, they practiced their strategies in opposite directions to the events (Expansion/Contractions) in the Restaurant Industry Cycles.<p>  <p>It is expected that the above results can be used for improving investment performance through understanding the cyclical behavior of the economy and the restaurant industry.  With that model, investors should be able to take part in the upswings while avoiding the cyclical downturns, and to structure a portfolio that keeps risk to a minimum. This should then presumably result in competitive investment decisions of firms, thereby improving the effectiveness of resource allocation. <p>",
  "description_provenance": [
    "Author Email: jechoi@khu.ac.kr",
    "Made available in DSpace on 2014-03-14T20:10:34Z (GMT). No. of bitstreams: 1 submit22.pdf: 3724735 bytes, checksum: 0a7a565be6cb456a54d844922244b9d7 (MD5)   Previous issue date: 1999-03-26"
  ],
  "handle": "27181",
  "identifier_other": "etd-042399-120858",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042399-120858/",
  "identifier_uri": "http://hdl.handle.net/10919/27181",
  "publisher": "Virginia Tech",
  "relation_haspart": "submit22.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Business Cycles",
    "Strategic Financial Practices",
    "Restaurant Industry",
    "Forecasting",
    "Economic Indicators"
  ],
  "title": "The Restaurant Industry: Business Cycles, Strategic Financial Practices, Economic Indicators, and Forecasting",
  "type": "Dissertation"
}