{
  "contributor_author": "Fisher, Michael Todd",
  "contributor_committeechair": "Turner, Bruce J.",
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:10:35Z",
  "date_adate": "2001-04-26",
  "date_available": "2014-03-14T20:10:35Z",
  "date_issued": "2000-10-23",
  "date_rdate": "2002-04-26",
  "date_sdate": "2001-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The ability of natural selection to promote and preserve genetic variation at Major Histocompatibility Complex (MHC) class I loci was examined in two fish species known to have low genetic variation either as a consequence of their breeding system or population structure.  The tempo and modes of molecular evolution acting on these loci has also been discussed.  The marine killifish Rivulus marmoratus is the only vertebrate known to exist in nature in homozygous form.  The findings of this study suggest that MHC class I genes at one locus in R. marmoratus have rapidly accumulated variation, particularly in region of the gene encoding functional important domains.  This rapid accumulation of variation is likely due to the increased intensity of natural selection acting on these genes resulting from the homozygosity of the species.  The contention that the variation characterized at one MHC locus is of recent origin is further supported by an analysis of the mitochondrial control region if R. marmoratus, which suggests that the individuals included in this study are recently diverged.  The variation characterized here is the first evidence of genetic variation at coding loci in this species, and may be evidence of the cost of homozygosity for R. marmoratus. \tVariation at a single MHC class I locus was also characterized in several members of the Death Valley pupfish species complex. Two of these species, Cyprinodon diabolis and Cyprinodon salinus have undergone intense historical or ongoing population bottlenecks.  Despite the action of random genetic drift acting on these species, both maintain multiple MHC class I alleles at one locus.  The alleles characterized in C. diabolis and C. salinus were also recovered from other members of the Death Valley complex.  This suggests that overdominant natural selection has acted to maintain ancestral genetic variation at this locus in both species.  This result has important implications for the design of conservation programs for these endangered species, and may have broader implications for the design of captive breeding programs of species with highly reduced population sizes in general.",
  "description_provenance": [
    "Author Email: mifishe3@vt.edu",
    "Advisor Email: fishgen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:35Z (GMT). No. of bitstreams: 1 fish.PDF: 384232 bytes, checksum: 81235f8ea39cf28be970a346a750b534 (MD5)   Previous issue date: 2000-10-23"
  ],
  "handle": "27184",
  "identifier_other": "etd-04242001-095754",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242001-095754/",
  "identifier_uri": "http://hdl.handle.net/10919/27184",
  "publisher": "Virginia Tech",
  "relation_haspart": "fish.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Immunogenetics",
    "Self-fertilization",
    "Cyprinodon diabolis",
    "Inbreeding",
    "Conservation",
    "Rivulus marmoratus"
  ],
  "title": "Variation at Major Histocompatibility Complex Class I Loci In Two Killifish Species with Reduced Genetic Variance",
  "type": "Dissertation"
}