{
  "contributor_author": "Bays, Debora Ann",
  "contributor_committeechair": "Crockett, Jean B.",
  "contributor_committeemember": [
    "Whitaker, Carol E.",
    "Magliaro, Susan G.",
    "Fortune, Jimmie C.",
    "Gillespie, Diane Newkirk"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:35Z",
  "date_adate": "2001-04-25",
  "date_available": "2014-03-14T20:10:35Z",
  "date_issued": "2001-04-17",
  "date_rdate": "2002-04-25",
  "date_sdate": "2001-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The grounded theory presented in this study describes how the supervision of special education instruction occurs in public elementary schools in rural settings. Grounded theory methodology (Strauss & Corbin, 1998) was employed in this study. Nine elementary schools in three rural districts in the state of Virginia participated in the study. Interview data were collected from 34 participants, including special and general education teachers, principals, and directors of special education. Observations were made in the schools and documents pertaining to the supervision process were collected. Data analysis allowed identification of categories and subcategories, processes, influencing conditions, strategies, and outcomes related to supervision, which contributed to the articulation of the theory. The grounded theory suggests that the supervisorâ  s role is assigned to the principal. The principal negotiates among competing priorities and contextual factors while providing supervision. Competing priorities exist in three areas: (1) management and administration versus supervision; (2) monitoring for legal compliance versus supervision of instruction for students with disabilities; and (3) evaluation of teachers versus supervision of instruction. Contextual factors include systemic conditions such as enrollment size of school, time, and number of administrators. Contextual factors also include personal conditions such as knowledge of special education, definitions of special education instruction, and perceived competence of teachers. The outcome of negotiating competing priorities and contextual factors is a dispersal of responsibility for supervision to three groups of educators. Principals, as the primary supervisors, utilize three strategies to address supervision: (1) the observation/evaluation process; (2) supervision by wandering; and (3) open communication. Directors of special education have a supportive role in supervision through communication and collaboration with teachers and principals. Teachers provide some supervision when they mentor new teachers and serve as special education coordinators.",
  "description_provenance": [
    "Author Email: debays@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: cwhitaker@rcs.k12.va.us",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: fortunj@vt.edu",
    "Advisor Email: dgilles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:35Z (GMT). No. of bitstreams: 1 bays.pdf: 537766 bytes, checksum: 47d7850cac7f3467dcaecdb21293c1b3 (MD5)   Previous issue date: 2001-04-17"
  ],
  "handle": "27189",
  "identifier_other": "etd-04242001-183037",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242001-183037/",
  "identifier_uri": "http://hdl.handle.net/10919/27189",
  "publisher": "Virginia Tech",
  "relation_haspart": "bays.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "grounded theory",
    "special education",
    "instructional supervision",
    "public schools",
    "principal",
    "elementary schools",
    "disabilities",
    "director of special education"
  ],
  "title": "Supervision of Special Education Instruction in Rural Public School Districts: A Grounded Theory",
  "type": "Dissertation"
}