{
  "contributor_author": "King, Robin K.",
  "contributor_committeechair": "Flick, George J. Jr.",
  "contributor_committeemember": [
    "Smith, Stephen A.",
    "Pierson, Merle D.",
    "Coale, Charles W. Jr.",
    "Boardman, Gregory D."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:10:35Z",
  "date_adate": "2001-04-26",
  "date_available": "2014-03-14T20:10:35Z",
  "date_issued": "2001-04-13",
  "date_rdate": "2002-04-26",
  "date_sdate": "2001-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "THE PRESENCE OF BACTERIAL PATHOGENS IN BIOFILMS OF RECIRCULATING AQUACULTURE SYSTEMS AND THEIR RESPONSE TO VARIOUS SANITIZERS  Robin K. King  ABSTRACT  Recirculating aquaculture offers a prospect for successful fish farming, but this form of aquaculture presents a great potential for pathogenic microorganisms to become established in the system through the formation of biofilms.  Biofilms are capable of forming on all aquaculture system components, incorporating the various microflora present in the water.  Pathogenic microorganisms released from the biofilms are capable of causing recurring exposure to disease in both fish and humans.  With the increased consumption of raw and rare fish, the presence of these bacteria in or on the fish could lead to ingestion of pathogens.  There is also the possibility of cross-contamination during processing.  The objectives of this study were to increase the understanding of pathogen incorporation into biofilms in recirculating aquaculture systems and to determine the effectiveness of various sanitizers in eliminating biofilms.   Seven freshwater and two saltwater facilities were sampled, with eight different types of materials tested.  Pathogenic bacteria were identified using Bacteriological Analytical Manual methods and rapid commercial test kits.  Most of the pathogenic bacteria identified were opportunistic organisms ubiquitous in an aquatic environment.  The most significant human pathogens were Bacillus cereus, the Shigella species and the Vibrio species.  The major piscine pathogens of concern were Photobacterium damsela, the Vibrio species, and Aeromonas hydrophila.  The most significant variation in biofilm pathogens was observed between facilities and not construction material. Buna-N rubber, polyvinyl chloride (PVC), chlorinated PVC, glass, fiberglass and stainless steel disks were suspended in 79.2 liter (20 gallon) aquariums stocked with Nile tilapia (Oreochromus niloticus).  The tanks were inoculated with a known amount of green fluorescent protein (GFP) modified Escherichia coli and samples were removed on days 1,3, 7 and 15.  The modified E. coli were isolated on Luria Broth Agar and plate counts were performed under ultraviolet light.  There was no significant difference in the growth of the surrogate pathogen on the different materials.  The GFP E. coli was isolated in the largest numbers 24 hours after inoculation of the tanks, with an approximate 1-log decrease after day 1.  Days 3, 7, and 15 showed equivalent growth of the target organism. Two sets of disks were suspended in another six 79.2 liter (20 gallon) aquariums.  The tanks were inoculated with a known amount of the surrogate pathogen, GFP E. coli, and after 24 hours one set of disks was removed from each tank.  The second set of disks was removed and treated by spraying with water, alkaline cleanser, sodium hypochlorite, quaternary ammonium compound, or peracetic acid.  Ozone was bubbled directly into one tank to treat another set of disks.  The modified E. coli were isolated and counted.  Total aerobic plate counts and Enterobacteriaceae counts were performed.  Statistical analysis indicated that the type of material had no significant affect on the effectiveness of the sanitizers.  It was determined that sodium hypochlorite (99.4591 overall reduction) and peracetic acid (98.8461 % overall reduction) were the most effective sanitizers overall, and ozone (32.9332 % overall reduction) was the least effective.",
  "description_provenance": [
    "Author Email: roking@vt.edu",
    "Advisor Email: flickg@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:35Z (GMT). No. of bitstreams: 1 dissertation.pdf: 498710 bytes, checksum: ce40303ee602b4079efec6c57e2cae4a (MD5)   Previous issue date: 2001-04-13"
  ],
  "handle": "27185",
  "identifier_other": "etd-04242001-100624",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242001-100624/",
  "identifier_uri": "http://hdl.handle.net/10919/27185",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "sodium hypochlorite",
    "peracetic acid",
    "ozone",
    "quaternary ammonium compounds",
    "recirculating aquaculture",
    "green fluorescent protein",
    "Biofilms"
  ],
  "title": "The Presence of Pathogenic Bacteria in Recirculating Aquaculture System Biofilms and their Response to Various Sanitizers",
  "type": "Dissertation"
}