{
  "contributor_author": "Willis, Lucinda Rightnour",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_committeemember": [
    "Moore, David Michael",
    "Kelly, Patricia Proudfoot",
    "Niles, Jerome A.",
    "Magliaro, Susan G."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:36Z",
  "date_adate": "2002-04-30",
  "date_available": "2014-03-14T20:10:36Z",
  "date_issued": "2002-04-12",
  "date_rdate": "2003-04-30",
  "date_sdate": "2002-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A portraiture study was conducted with four children enrolled in various grades of a rural Virginia elementary school. . Purposeful sampling was used as a selection tool, and all students were participants of the Title I program, unsuccessfully discontinued from the Reading Recovery program, and were tested as field dependent, a cognitive characteristic, using the Children's Embedded Figures Test created by Witkin, et al (1971).   These participants were observed within a classroom setting, a small group setting, and in a one-on-one setting. Interviews offered the opportunity to investigate  the students' feelings and attitudes towards using the overlays.  Field notes, unaided observations, participant observations were gathered, and interviews were conducted with the students, as well as with the reading specialist, the teachers, and the administrator of the school. Further data was gained from historical records from the school and evaluative tools used within the classroom, on a periodic basis.   Outcomes of this study focus on the process of using colored overlays with these participants, their self-efficacy their feelings about using the tool, how the faculty perceives this tool, and additional implications with regards to field dependence and colored overlays within the classroom.",
  "description_provenance": [
    "Author Email: willisl@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: suemags@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:36Z (GMT). No. of bitstreams: 3 diss-lrw.pdf: 2558608 bytes, checksum: 56d97021f961caebf4104ee6e0f1e3d3 (MD5) TOC.pdf: 127549 bytes, checksum: f671b35bcf22ee99c8a941a72f1c521a (MD5) vita.pdf: 158706 bytes, checksum: 49410df43710444c5a8eddb737bb07b4 (MD5)   Previous issue date: 2002-04-12"
  ],
  "handle": "27194",
  "identifier_other": "etd-04242002-193949",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242002-193949/",
  "identifier_uri": "http://hdl.handle.net/10919/27194",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "diss-lrw.pdf",
    "TOC.pdf",
    "vita.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "tactile learning",
    "field dependence",
    "reading disabilities",
    "Title I",
    "colored overlays",
    "Reading Recovery"
  ],
  "title": "Portraitures of field dependent children with reading disabilities:  Colored overlays as an instructional intervention",
  "type": "Dissertation"
}