{
  "contributor_author": "Fikretoglu, Deniz",
  "contributor_committeecochair": [
    "Scarpa-Friedman, Angela",
    "Axsom, Daniel K."
  ],
  "contributor_committeemember": [
    "Clum, George A. Jr.",
    "Ollendick, Thomas M.",
    "Jones, Russell T."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:10:36Z",
  "date_adate": "2003-04-25",
  "date_available": "2014-03-14T20:10:36Z",
  "date_issued": "2003-04-22",
  "date_rdate": "2004-04-25",
  "date_sdate": "2003-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Findings from numerous laboratory studies on thought suppression suggest that engaging in deliberate thought suppression may lead to the ironic effects of becoming preoccupied by the very same thoughts one wishes to avoid. Based on the results of these laboratory studies, a sophisticated model of thought suppression (i.e., Ironic Process Theory) has been developed. It has been argued that Ironic Process Theory can inform our understanding of the processes involved in the development and maintenance of clinical disorders such as PTSD. Unfortunately, to date, several important issues that are relevant to the successful application of this model specifically to PTSD have not been explored in detail. One such issue has to do with whether different types of thought suppression strategies that use different types of distracters lead to different levels of preoccupation. The current investigation examined whether the use of minor worries as distracters would lead to greater levels of preoccupation than the use of positive thoughts (Study 1).  Eighty-one female undergraduates were assigned to one of three experimental conditions (suppress-worry, suppress-positive, control). Those in the suppression groups were asked to distract themselves from target thoughts using minor worries vs. positive thoughts whereas the participants in the control condition were asked to think about anything they liked. This was followed by instructions to think about anything for all three groups. Results indicated that although the two suppression groups differed on later preoccupation with previously suppressed thoughts, they did not do so in a significant manner. Study 1 also examined the potential mediating role of mental load when mental load is measured. No support for the mediational role of mental load was found. Study 2 further investigated the mediational role of mental load, this time through experimental manipulation.  Forty female undergraduates were assigned to one of four experimental conditions (suppress-worry/no load, suppress-worry/load, suppress-positive/no load, suppress-positive/load). The same instructions used in Study 1 were given with the addition of a 10-digit number-recall task for those in the load condition. No support for the mediational role of mental load was found. Results are discussed in relation to theory and practice.",
  "description_provenance": [
    "Author Email: dfikreto@vt.edu",
    "Advisor Email: ascarpa@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: rtjones@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:36Z (GMT). No. of bitstreams: 1 Dissertation-FinalVersionETD.pdf: 903518 bytes, checksum: 76f709a15ca4ffa78e66a65679a37f9e (MD5)   Previous issue date: 2003-04-22"
  ],
  "handle": "27197",
  "identifier_other": "etd-04242003-123106",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242003-123106/",
  "identifier_uri": "http://hdl.handle.net/10919/27197",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-FinalVersionETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "trauma",
    "cognitive avoidance",
    "PTSD",
    "thought suppression"
  ],
  "title": "An Examination of a Potential Moderator of the Relationship Between Thought Suppression and Preoccupation with Previously Suppressed Thoughts",
  "type": "Dissertation"
}