{
  "contributor_author": "Severt, Denver E.",
  "contributor_committeechair": "Murrmann, Suzanne K.",
  "contributor_committeemember": [
    "Becker, Cheri",
    "Minish, Roberta M.",
    "Weaver, Pamela A.",
    "Williams, John A."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:10:35Z",
  "date_adate": "2002-04-25",
  "date_available": "2014-03-14T20:10:35Z",
  "date_issued": "2002-04-23",
  "date_rdate": "2003-04-25",
  "date_sdate": "2002-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The service sector is the fastest growing segment of the economy, responsible for 75% of the GNP, and still growing. Its success is important to the global economy.  Nonetheless, throughout the 20-year evolution of services marketing literature, research that guides theory, methodology, and practice for service success has remained underrepresented.  Published research regarding the effect of customers' justice perceptions on customer satisfaction is primarily experimental and focuses only on service recovery after a service failure, providing insufficient information about how the justice experienced in a service encounter affects a customer's satisfaction level. Proactive and reactive service recovery research abounds; service failures have overshadowed service success.  This is the first empirical research to investigate across service outcomes the effects 1) of interactional, distributive, and procedural justice on overall justice and customer satisfaction and 2) of overall justice on customer satisfaction. The theoretical model of the customer's path to loyalty adapts previous models of the service profit chain, customer satisfaction with service failure and recovery, and complaint handling relationships. It is a simplified version of the author's in-work conceptual model.  The theoretical model has conceptual and practical value to researchers and service company executives. It considers all possible service encounter types and the heterogeneity of outcomes. It is supported by attribution and equity theories (the underpinnings of customer's justice judgments) and by behavioral intentions research.  A cross-sectional written survey was used to gather data relevant to the eight hypotheses proposed and shown on the measurement model. Sixty percent of the 302 respondents recalled satisfying service encounters and 40% recalled dissatisfying service encounters.   MANOVA testing supported the hypothesis of a positive relationship for extant prior experience to each of the justice constructs. The tested path analysis model showed direct and positive effects for the justice constructs on overall justice and customer satisfaction and for overall justice on customer satisfaction.  When providers fairly address the people, outputs, and processes in service transactions, expectations are more likely to be met, delight is possible, and trust and commitment, possibly even loyalty, may arise. Disappointment and disconfirmation resulting from gaps in performance expectations can lead to non-attritive defection and lost profits.   This research provides practical information that can lead to a better understanding of customers' evaluation methods and be used to guide the formation of improved service strategies that provide justice, a key to satisfaction.",
  "description_provenance": [
    "Author Email: Denver.Severt@emich.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: Cheri.Becker@ritz.edu",
    "Advisor Email: minishr@vt.edu",
    "Advisor Email: weaver@vt.edu",
    "Advisor Email: JAWILL06@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:35Z (GMT). No. of bitstreams: 1  pathtoloyalty.pdf: 2218622 bytes, checksum: 2301757ee593ae1e8c3ea641834e588b (MD5)    Previous issue date: 2002-04-23"
  ],
  "handle": "27191",
  "identifier_other": "etd-04242002-122146",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242002-122146/",
  "identifier_uri": "http://hdl.handle.net/10919/27191",
  "publisher": "Virginia Tech",
  "relation_haspart": "pathtoloyalty.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Service Failure",
    "Customer Satisfaction",
    "Justice",
    "Fairness",
    "Service Quality"
  ],
  "title": "The Customer's Path to Loyalty:  A Partial Test of the Relationships of Prior Experience, Justice, and Customer Satisfaction",
  "type": "Dissertation"
}