{
  "contributor_author": "Fox, Jonathan Howard",
  "contributor_committeechair": "Ehrich, Marion F.",
  "contributor_committeecochair": "Jortner, Bernard S.",
  "contributor_committeemember": [
    "Huckle, William R.",
    "van der Schyf, Neels",
    "Klein, Bradley G.",
    "Kennelly, Peter J."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:10:35Z",
  "date_adate": "2002-04-26",
  "date_available": "2014-03-14T20:10:35Z",
  "date_issued": "2002-04-11",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Some organophosphorus (OP) esters induce a central-peripheral distal axonopathy called organophosphorus ester-induced delayed neurotoxicity (OPIDN).  In the chicken model neurological deficits and microscopic lesions develop 7-21 days after exposure.  Neurotoxic esterase (NTE) is thought to be the initial target in OPIDN.  Evidence indicates that neuropathic OP esters have to bind NTE and chemically ?age? for OPIDN induction.  It was hypothesized that phenyl saligenin phosphate (PSP), a neuropathic OP ester that essentially irreversibly inhibits NTE as it undergoes the chemical aging process, results in changes in spinal cord gene expression that do not occur with phenylmethylsulfonyl fluoride (PMSF), a non-neuropathic compound that inhibits NTE without aging.  This hypothesis was tested in Gallus gallus in experiments designed to detect differences in spinal cord gene expression between PSP, PMSF and vehicle-treated birds 24 hours after exposure.  Two approaches were used.  Targeted display was developed and used to screen approximately 15000 gel bands.  Three candidate genes were identified by targeted display.  One, designated P1 has 100% homology with expressed sequence tag pgp1n.pk010.m23, another, P2, is homologous to human KIAA1307, and a third, P3, is unidentified.  Northern blotting was used to measure spinal cord expression of a-tubulin and other genes previously reported to be differentially expressed following exposure to di-isopropryl phosphorofluoridate, another agent causing OPIDN.  Only expression of a-tubulin was altered in PSP-treated hens.  Time course experiments were undertaken to determine spinal cord expression changes of P1, P2, P3 and a-tubulin transcripts at 12, 24, 36 and 48 hours post-exposure.  Findings indicated decreases and increases, respectively, of P1 (22%, p=0.0011) and P2 (26%, p=0.0055) transcripts at 12 hours in PSP treated hen spinal cord compared to DMSO controls.  An ~2.5 kb a-tubulin transcript was decreased across most time points with maximum change at 48 hours (33%, p=0.0479); an ~4.5 kb a-tubulin transcript was upregulated at 12 hours (38%, p=0.0125) and down regulated at 48 hours (28%, p=0.0576).  Responses to PMSF were different than responses to PSP.  Spinal cord in-situ hybridization experiments revealed, 1.) mainly neuronal expression of P1, P2 and a-tubulin transcripts, and, 2.) decreased expression of neuronal P1 and a-tubulin transcripts at 12 and 48 hours, respectively.  Results indicate that PSP can induce changes in gene expression distinct from those induced with the non-neuropathic NTE inhibitor, PMSF.  However, expression changes were low in frequency and magnitude, and their mechanistic importance remains to be fully established.",
  "description_provenance": [
    "Author Email: jofox@vt.edu",
    "Advisor Email: marion@vt.edu",
    "Advisor Email: bjortner@vt.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: vanders@vt.edu",
    "Advisor Email: bklein@vt.edu",
    "Advisor Email: pjkennel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:35Z (GMT). No. of bitstreams: 1 DissertationPDfinal.doc.pdf: 6384517 bytes, checksum: ed5a3be5938942f67161e4e1565ceea4 (MD5)   Previous issue date: 2002-04-11"
  ],
  "handle": "27192",
  "identifier_other": "etd-04242002-141933",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242002-141933/",
  "identifier_uri": "http://hdl.handle.net/10919/27192",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationPDfinal.doc.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "axon",
    "gene expression",
    "phenyl saligenin phosphate",
    "neurotoxicity",
    "neurodegeneration",
    "organophosphorus"
  ],
  "title": "Spinal cord gene expression changes in the chicken (Gallus gallus) model of phenyl saligenin phosphate induced delayed neurotoxicity",
  "type": "Dissertation"
}