{
  "contributor_author": "Hoover, Paula J.",
  "contributor_committeechair": "Gillespie, Diane Newkirk",
  "contributor_committeemember": [
    "Allen, Katherine R.",
    "Mick, Lori",
    "Crockett, Jean B.",
    "Dawson, Christina M."
  ],
  "contributor_department": "Administration and Supervision of Special Education",
  "date_accessioned": "2014-03-14T20:10:35Z",
  "date_adate": "2001-04-26",
  "date_available": "2014-03-14T20:10:35Z",
  "date_issued": "2001-03-16",
  "date_rdate": "2002-04-26",
  "date_sdate": "2001-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>This study investigated 10 mothers' perceptions on the transition process, for their children with disabilities, from early intervention to early childhood special education. The issues of related stressors, supports, and coping skills were further explored. This research was guided by the ecological or systems theory.  <p>The issue of transition between the two service programs (early intervention to early childhood special education) is addressed specifically in the legislation (Part C, Section 619, IDEA 1997). Federal law defines several elements that must be included in the transition planning. Each state must ensure a smooth transition for toddlers receiving early intervention services to preschool and other appropriate services. Since transition is such a critical time for young children with disabilities and their families, stress will presumably occur. The parents need to learn new terminology and procedures because each program is unique in which services are provided. Families are to receive information and training during the transition period.  <p>This study was guided by the following research questions: (1) What are the mother's perceptions of the transition process? (2) What factors facilitate or inhibit their satisfaction and involvement with the process? (3) What types of stressors and supports do these mothers experience during this process?  <p>Qualitative methods were used to secure data. In-depth interviews provided the most information, but document analysis was also utilized. Each participant was interviewed two times. Participants were found from a variety of resources in the local communities. The criterion for this study included mothers whose children had a diagnosed disability or developmental delay, had been in an early intervention program, and had transitioned within the last two years.  <p>The mothers from this study had positive transitions for their children. They were involved in this process and became better advocates. They were supported by family members and friends. Much support was provided by the professionals working within the early intervention system. The individuals who work with families of children with disabilities need to be aware of the whole family system. By knowing the family system, professionals will be able to provide services based on the individual needs of the family. Specific recommendations for policy makers in rural areas include the availability, location and cost of services. The medical model versus the education model was also discussed as an issue for these families when transitioning their children from one program to another.",
  "description_provenance": [
    "Author Email: phoover4@bellsouth.net",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: dgilles@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: tdawson@antiochsea.edu",
    "Made available in DSpace on 2014-03-14T20:10:35Z (GMT). No. of bitstreams: 1 Hoover.Paula.PDF: 356283 bytes, checksum: 8985292fa12a1f0381e741140cf3524e (MD5)   Previous issue date: 2001-03-16"
  ],
  "handle": "27190",
  "identifier_other": "etd-04242001-221132",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242001-221132/",
  "identifier_uri": "http://hdl.handle.net/10919/27190",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hoover.Paula.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "early intervention",
    "transition",
    "children with disabilities",
    "parents' perceptions"
  ],
  "title": "Mothers' Perceptions of the Transition Process From Early Intervention to Early Childhood Special Education: Related Stressors, Supports, and Coping Skills",
  "type": "Dissertation"
}