{
  "contributor_author": "Newhouse, Charles David",
  "contributor_committeechair": "Roberts-Wollmann, Carin L.",
  "contributor_committeemember": [
    "Weyers, Richard E.",
    "Cousins, Thomas E.",
    "Davis, Rodney T.",
    "Singh, Mahendra P.",
    "Wollmann, Gregor P."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:10:38Z",
  "date_adate": "2005-04-25",
  "date_available": "2014-03-14T20:10:38Z",
  "date_issued": "2005-04-21",
  "date_rdate": "2005-04-25",
  "date_sdate": "2005-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Over the past fifty years, many states have recognized the benefits of making precast, prestressed multi-girder bridges continuous by connecting the girders with a continuity diaphragm.  Although there is widespread agreement on the benefits of continuous construction, there has not been as much agreement on either the methods used for design of these systems or the details used for the continuity connections.      To aid designers in choosing the most appropriate method, an analytical and experimental study was undertaken at Virginia Tech.  Analyses were done to compare the differences in the predicted continuity moments for different design methods and assumptions over a range of commonly used systems of Precast Concrete Bulb Tee (PCBT) girders and cast-in-place slabs.  The results of the analyses were used to develop three continuity connection details for testing during the experimental study.  Three different continuity connections were tested using full depth PCBT 45 in. deep girders made continuous with a 6 ft wide slab.      The bottom of the ends of the girders were made continuous with the continuity connection by extending prestressing strands for one test and extending 180 degree bent bars for the other test.  Both connections adequately resisted service, cyclic, and ultimate loads.  But, the test with the extended bars remained stiffer during cyclic loading and is recommended for use.  A third test was performed on a system using only a slab cast across the top of the girders.  Two primary cracks formed above the ends of the girders at the joint during service testing, after which no significant increase in damage took place.      Results from the analytical study indicate that the predicted positive thermal restraint moments may be significant, similar in magnitude to the actual positive cracking moment capacities.  Results from the experimental study indicate that restraint moments develop early due to thermal expansion of the deck during curing and subsequent differential shrinkage; however, the magnitudes of the early age restraint moments are much less than conventional analyses predict.",
  "description_provenance": [
    "Author Email: newhouse@vt.edu",
    "Advisor Email: rweyers@vt.edu",
    "Advisor Email: wollmann@vt.edu",
    "Advisor Email: tcousins@vt.edu",
    "Advisor Email: rodney.davis@virginiadot.org",
    "Advisor Email: mpsingh@vt.edu",
    "Advisor Email: wollmann@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:38Z (GMT). No. of bitstreams: 1 Dissertation-CDN.pdf: 4357401 bytes, checksum: 8a02223fc823f0028074468c1d25c4fe (MD5)   Previous issue date: 2005-04-21"
  ],
  "handle": "27207",
  "identifier_other": "etd-04242005-153728",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242005-153728/",
  "identifier_uri": "http://hdl.handle.net/10919/27207",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-CDN.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Diaphragm",
    "Shrinkage",
    "Creep",
    "Restraint",
    "Thermal Gradient"
  ],
  "title": "Design and Behavior of Precast, Prestressed Girders Made Continuous â   An Analytical and Experimental Study",
  "type": "Dissertation"
}