{
  "contributor_author": "Fravel, Philip M.",
  "contributor_committeecochair": [
    "Burke, Stanley S.",
    "Hillison, John H."
  ],
  "contributor_committeemember": [
    "Camp, William G.",
    "Stewart, Daisy L.",
    "Crunkilton, John R."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:10:37Z",
  "date_adate": "2004-05-07",
  "date_available": "2014-03-14T20:10:37Z",
  "date_issued": "2004-02-13",
  "date_rdate": "2005-05-07",
  "date_sdate": "2004-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The researcher focused on the numerous elements that led to an organized state supported system of Agricultural Education in South Carolina. Emphasis was placed upon the secondary school program, but the various contributing events leading to the formal study of Agricultural Education were identified and examined. <p>Many historical studies of 20th century Agricultural Education focus on the impact of the Smith-Hughes legislation. Upon deeper investigation, the Palmetto State can credit numerous influential factors that provided forms of agricultural instruction prior to 1917. The 18th and 19th century agricultural societies provided a clearinghouse for the socialization and sharing of experimental farming techniques by progressive agriculturalists. John C. Calhoun and his son-in-law Thomas Green Clemson, benefactors of Clemson Agricultural College, were members of the Pendleton Farmers Society. <p>Support for agricultural research came one year prior to the federal Hatch Act. The Hatch Act of 1887, followed by the Smith-Lever Act of 1914, assisted in providing fertile conditions for community recognition and need for Agricultural Education. Prior to the Smith-Lever Act, South Carolina was active in attempts to infuse Agricultural Education into the public school system and rural communities. A series of demonstration trains traversed the state providing first hand opportunities for individuals to examine the revelations in agricultural techniques. A series of agricultural clubs, including boyâ  s corn clubs, pig clubs, and even demonstration farms on schoolhouse grounds linked Agricultural Educators with school students. Prior to the Smith-Hughes method of vocational agriculture, students in sections of the state received textbook-based instruction in agriculture. <p>Passage of the Smith-Hughes legislation in February 1917 was the catalyst that created a form of Agricultural Education recognized even in the 21st century. The rapid propagation of high school programs throughout the state created an immediate demand for teachers of Agricultural Education. Clemson College, still in its infancy, quickly arose to provide a new program to train collegiate students to become what were then referred to as â  Smith-Hughes men.â   <p>Specific objectives investigated and analyzed by the researcher included: 1. Describing the development of Agricultural Education in South Carolina prior to 1900. 2. Documenting the development of Agricultural Education in South Carolina from 1900-1945. 3. Documenting the redefining of Agricultural Education in South Carolina from 1946-1990. 4. Describing the development of the teacher-training program for Agricultural Education in South Carolina. 5. Documenting the development of administrative and supervisory provisions for the vocational agriculture programs for South Carolina. 6. Describing the historical events that led to the founding of the Future Palmetto Farmers and evolution of the Future Farmers of America in South Carolina.",
  "description_provenance": [
    "Author Email: pmfravel@vt.edu",
    "Advisor Email: wgcamp@vt.edu",
    "Advisor Email: burkesr@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: hillison@vt.edu",
    "Advisor Email: jcrunkil@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:37Z (GMT). No. of bitstreams: 1 FravelDissertation.pdf: 885326 bytes, checksum: cdb4c7e50b65869076473385e8deee3c (MD5)   Previous issue date: 2004-02-13"
  ],
  "handle": "27205",
  "identifier_other": "etd-04242004-202220",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242004-202220/",
  "identifier_uri": "http://hdl.handle.net/10919/27205",
  "publisher": "Virginia Tech",
  "relation_haspart": "FravelDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Future Farmers of America",
    "South Carolina",
    "FFA",
    "Extension",
    "Agriculture",
    "Vocational Agriculture",
    "Agricultural Education"
  ],
  "title": "A History of Agricultural Education in South Carolina With an Emphasis on the Public School Program",
  "type": "Dissertation"
}