{
  "contributor_author": "Roth Gibbons, Lori Ann",
  "contributor_committeecochair": [
    "Boucouvalas, Marcie",
    "Cline, Marvin Gerald"
  ],
  "contributor_committeemember": [
    "Waibel, Klaus",
    "Wiswell, Albert W.",
    "Morris, Linda E."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:37Z",
  "date_adate": "2003-04-28",
  "date_available": "2014-03-14T20:10:37Z",
  "date_issued": "2003-04-10",
  "date_rdate": "2004-04-28",
  "date_sdate": "2003-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract  The Census 2000 Brief  (2001) informs us that the American population is aging. The predictions are that by the year 2050 there will be 80 million adults over the age of 65 as compared to 35 million in the year 2000.  Since technology is becoming more important in our daily lives, many older adults are interested in learning how to use online technology to communicate and gather information. This study was designed to better understand the process and the experience of older adults as they learn to use online technology with computers.  The questions guiding the inquiry were: -\tWhat is the experience that older adults have while learning online technologies? -\tWhat is the process for older adults of going from non-literate to literate in online technologies? -\tWhat are older adults' responses to challenges and successes? Older adults were interviewed, videotaped, and asked to keep a reflection journal while learning and sharing their personal experiences.  A qualitative grounded theory methodology was used to explore how online technologies are experienced. These case studies were based on retired adults, sixty-five years of age or older, who had not used (or learned) online technologies. This researcher is not aware of any grounded theory qualitative case studies that used interviews, videotapes, and journaling to detail the process and experiences of how older adults learned online computer technology.  This study augments the body of knowledge concerning older adults learning computer technology and informs future studies specifically on how older adults learn online computer technology.  The findings in this research showed that the participants in this study applied none of the learning strategies used in a classroom situation (where the instructor controlled the learning process by teaching).  A process was depicted illustrating how the participants in this study learned how to use the Internet and e-mail.  This process consists of six phases and describes stages within each of the phases. Challenges and successes were also listed and explained in regard to each participant's experience and learning process.",
  "description_provenance": [
    "Author Email: lar@larg.com",
    "Advisor Email: marcie9@attglobal.net",
    "Advisor Email: awiswell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:37Z (GMT). No. of bitstreams: 6 Loriannrothgibbonsresume.pdf: 16638 bytes, checksum: 351e57d3ae279e25e013837e7ef9911b (MD5) AppendixA.pdf: 86670 bytes, checksum: 680f7d577d625226c9f3a87b6ae71a1d (MD5) AppendixB.pdf: 128857 bytes, checksum: ca23fe6727bc88c63dc6e50f14ad66b3 (MD5) AppendixCDEFGHIJKL.pdf: 182041 bytes, checksum: 5fe0b4122cc522fb9d7fa4d0ee07cad8 (MD5) stages.ppt: 61440 bytes, checksum: 198afa170678b7bccc1a54c53a95b242 (MD5) maindocument.pdf: 825559 bytes, checksum: a850f6fb5ea4cc92de153da7e1dfe7dd (MD5)   Previous issue date: 2003-04-10"
  ],
  "handle": "27201",
  "identifier_other": "etd-04242003-134323",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242003-134323/",
  "identifier_uri": "http://hdl.handle.net/10919/27201",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Loriannrothgibbonsresume.pdf",
    "AppendixA.pdf",
    "AppendixB.pdf",
    "AppendixCDEFGHIJKL.pdf",
    "stages.ppt",
    "maindocument.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Older Adult",
    "Online",
    "Learning",
    "and Technology"
  ],
  "title": "Older Adults Learning Online Technologies: A Qualitative Case Study of the Experience and the Process",
  "type": "Dissertation"
}