{
  "contributor_author": "LaBoone, Kimberly Lavette",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeemember": [
    "Dixon, Benjamin",
    "Hyer, Patricia B.",
    "Kowalski, Gerard J.",
    "Sanders, Karen Eley"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:38Z",
  "date_adate": "2006-05-05",
  "date_available": "2014-03-14T20:10:38Z",
  "date_issued": "2006-03-29",
  "date_rdate": "2006-05-05",
  "date_sdate": "2006-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The process of transition to college is complex and has received attention from many scholars (e. g. Baker & Siryk, 1999; Beal & Noel, 1980; Choy, Horn, Nunez, & Chen, 2000; Gaither, 1999; Paul & Brier, 2001; Tinto, 1993). Transition impacts persistence in college, hence retention rates (Tinto, 1993). As a result, postsecondary institutions have developed models of transition. In one such model, first year students experience transition in four domains; academic, social, personal-emotional, and attachment (Baker & Siryk, 1999).   Past studies have explored transition from the perspective of majority versus minority student experiences (Allen, 1992; Hurtado, Carter, Spuler, 1996; Rodriquez, Guido-DiBrito, Torres, & Talbot, 2000) as well as male versus female experiences (American Association of University Women, 1992; Fassinger, 1995; Gablenick, MacGregor, Matthews, & Smith, 1990). The current body of literature fails to adequately represent transition issues for non-majority students, however. For example, additional research is needed to compare experiences among minority groups (e.g., African American v. Hispanic v. Native American). In addition, studies that explore the relationship between retention and transition for minorities and women are needed. The current study was designed to examine transition experiences of minorities and women attending predominantly White institutions. In addition, the study addressed the link between transition and retention to second semester and the second year of college.  The Student Adaptation to College Questionnaire (SACQ) (Baker & Siryk, 1999) measures the transition experiences of students in college. In the current study, the author administered the SACQ to minority students in their first year at a predominantly White institution. The participantsâ   responses were analyzed to determine if differences existed in transition experience by race or sex. Follow-up information was collected to explore whether students who had higher transition levels were more likely to return to college for the second semester and the second year.   Results revealed that minority students made successful transitions during the first year as well as developed a strong attachment to the institution and higher education. However, there were no significant differences in the transition experiences of the participants by race or sex. When examining the relationship between transition and retention, findings show that students who left had high or medium transition levels.",
  "description_provenance": [
    "Author Email: klaboone@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: bdixon@vt.edu",
    "Advisor Email: hyerp@vt.edu",
    "Advisor Email: kowalski@vt.edu",
    "Advisor Email: kesanders@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:38Z (GMT). No. of bitstreams: 2 laboone_cover&ab.pdf: 120154 bytes, checksum: b4172a55a6b7e2049779b629dda000f4 (MD5) laboone_chapt1-5.pdf: 1124549 bytes, checksum: f195e6f8f2158fc9be7bc3dcd644d5fd (MD5)   Previous issue date: 2006-03-29"
  ],
  "handle": "27209",
  "identifier_other": "etd-04242006-001857",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242006-001857/",
  "identifier_uri": "http://hdl.handle.net/10919/27209",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "laboone_cover&ab.pdf",
    "laboone_chapt1-5.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "academic transition",
    "social transition",
    "personal-emotional transition",
    "attachment",
    "first-year students",
    "minorities",
    "retention"
  ],
  "title": "Minority Students' Transition Experiences at a Predominantly White Institution",
  "type": "Dissertation"
}