{
  "contributor_author": "Morgan, Patricia Ann",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Klunk, Clare D.",
    "Cline, Marvin Gerald",
    "Morris, Linda E.",
    "Brott, Pamelia E."
  ],
  "contributor_department": "Adult Learning and Human Resource Development",
  "date_accessioned": "2014-03-14T20:10:37Z",
  "date_adate": "2003-04-28",
  "date_available": "2014-03-14T20:10:37Z",
  "date_issued": "2003-04-10",
  "date_rdate": "2004-04-28",
  "date_sdate": "2003-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The dissertation focuses on understanding the mothering experience of three internal organizational development consultant/managers who perceive that their experience informed their professional functioning. The questions that guided the study were: (a) What is the mothering experience of the internal organizational development consultant/manager who perceives that her experience informed her professional functioning? and (b) How does the mothering experience inform the professional functioning of the internal organizational development consultant/manager? A case study method using the grounded theory method of data analysis produced three narratives that suggested how the mothering experience influenced consulting and managerial functioning. Three themes emerged; namely: â  being fully present,â   â  protecting by fighting for trust and safetyâ  , and â  bringing a caring stance.â   In two of the cases, however, some contradictions were embedded in the data, suggesting a possible â  idealized perception.â    The ideology of the good mother is suggested as one explanation for the potential discrepancy between the co-researchersâ   beliefs and self-reports of actual functioning in the three roles of mother, consultant, and manager. A larger construct of â  careâ   emerged, however, and related to the â  ethic of careâ   in organizational practice.",
  "description_provenance": [
    "Author Email: patricia.morgan11@verizon.net",
    "Advisor Email: cklunk@vt.edu",
    "Advisor Email: MGCline@aol.com",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: lmorris@vt.edu",
    "Advisor Email: pbrott@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:37Z (GMT). No. of bitstreams: 4 PatriciaAMorganDissertation.pdf: 963856 bytes, checksum: 0245320bd9a0e338fd4b5feb0cad655f (MD5) AppendixG-SC.PDF: 221017 bytes, checksum: ea86f101830a63202c56b109f835f1e3 (MD5) AppendixF-GC.PDF: 410660 bytes, checksum: 50ddc8321dba51336ae8cd228a014102 (MD5) AppendixE-BB.PDF: 219446 bytes, checksum: 8015cd56bda532d744c21d439083faec (MD5)   Previous issue date: 2003-04-10"
  ],
  "handle": "27202",
  "identifier_other": "etd-04242003-154952",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242003-154952/",
  "identifier_uri": "http://hdl.handle.net/10919/27202",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "PatriciaAMorganDissertation.pdf",
    "AppendixG-SC.PDF",
    "AppendixF-GC.PDF",
    "AppendixE-BB.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "adult learning theory",
    "ethic of care",
    "grounded theory"
  ],
  "title": "The Meaning of the Motherhood Experience to the Work of the Internal Organizational Development Consultant/Manager: Three Case Studies",
  "type": "Dissertation"
}