{
  "contributor_author": "Winston, Eugenia Michele",
  "contributor_committeechair": "Cramer, Carole L.",
  "contributor_committeemember": [
    "Wilkinson, Carol A.",
    "Grabau, Elizabeth A.",
    "Lacy, George H.",
    "Westwood, James H."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:10:37Z",
  "date_adate": "2003-04-25",
  "date_available": "2014-03-14T20:10:37Z",
  "date_issued": "2003-04-10",
  "date_rdate": "2005-04-25",
  "date_sdate": "2003-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The cyst nematode, Globodera tabacum tabacum Behrens, and the parasitic angiosperm, Egyptian broomrape, Orobanche aegyptiaca Pers., are obligate root parasites that cause severe yield and quality loss of many important crop hosts.  Although these represent two diverse classes of parasites, they have significant similarities in the modes of parasitism and complex interactions with their hosts.  Conventional control methods have had limited success in controlling these parasites.  The overall objective of this research was to engineer resistance to the cyst nematode and Egyptian broomrape by expressing genes encoding parasite specific toxins under the control of parasite-responsive promoters using tobacco (Nicotiana tabacum L. cv. Xanthi).  For nematode resistance, an anti-feeding strategy was employed utilizing the tomato proteinase inhibitor I (PI-I) gene as a nematode specific toxin.  Transgenic tobacco plants were generated that expressed genes encoding an intracellarly retained or secreted form of tomato PI-I under the control of the nematode-inducible promoter, derived from tomato (Lycopersicon esculentum L.) Hmg2 gene.  Our goals were to determine the effectiveness of local PI-I expression on nematode resistance and to determine if intracellular or extracellular PI-I deposition enhances resistance. Two constructs were generated that contained either the coding region of the tomato PI-I gene, lacking the signal sequence (EM1), or the coding region of PI-I including the signal sequence (EM2), fused to the nematode-responsive Hmg2 promoter.  Transgenic PI-I plants were inoculated with G. t. tabacum cysts and evaluated for nematode interactions.  Our results suggest that local expression of intercellular of PI-I significantly reduced cyst production when compared to the nontransformed controls.  For broomrape resistance, a well characterized R/avr gene pair, the tobacco N resistance gene and the tobacco mosaic virus replicase (TMV) gene, was utilized to create novel gene-for-gene resistance via a N gene-mediated hypersensitive response (HR) to limit broomrape parasitism.  The bean (Phaselous vulgaris L.) chalcone synthase 8 (CHS8) promoter has been characterized as a broomrapeâ  responsive promoter.  We introduced the CHS8:TMV replicase gene construct into tobacco plants that contains an endogenous N gene.  Transgenic tobacco plants were inoculated with O. aegyptiaca seeds and monitored for parasite attachment and development.   The expression of the TMV replicase leads to a significant reduction in broomrape parasitism.  These genetic engineering strategies show promise in enhancing resistance to these destructive parasites.",
  "description_provenance": [
    "Author Email: emcmeans@vt.edu",
    "Advisor Email: wilki@vt.edu",
    "Advisor Email: egrabau@vt.edu",
    "Advisor Email: lacygh@vt.edu",
    "Advisor Email: westwood@vt.edu",
    "Advisor Email: ccramer@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:37Z (GMT). No. of bitstreams: 2 Dissertation.pdf.pdf: 2185533 bytes, checksum: db49a3d8b60c98469b4512b52b8869f0 (MD5) Title.pdf.pdf: 302687 bytes, checksum: 32531990953b772bd8371f99350733eb (MD5)   Previous issue date: 2003-04-10"
  ],
  "handle": "27200",
  "identifier_other": "etd-04242003-133526",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242003-133526/",
  "identifier_uri": "http://hdl.handle.net/10919/27200",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation.pdf.pdf",
    "Title.pdf.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "tobacco N gene",
    "Hmg2 promoter",
    "proteinase inhibitors",
    "cyst nematode",
    "Orobanche aegyptiaca"
  ],
  "title": "The Utilization of the Hmg2 Inducible Promoter to Genetically Engineer Parasite Resistance in Tobacco",
  "type": "Dissertation"
}