{
  "contributor_author": "Dill, Laura Lee",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Lepczyk, Billie F.",
    "Stratton, Richard K.",
    "Gentry, R. Mike",
    "Eschenmann, Konrad Kurt"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:38Z",
  "date_adate": "2006-05-05",
  "date_available": "2014-03-14T20:10:38Z",
  "date_issued": "2006-04-03",
  "date_rdate": "2009-05-05",
  "date_sdate": "2006-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Eating Disorder Policies Among NCAA Division I  Intercollegiate Athletic Programs Laura Lee Dill (ABSTRACT)            In a survey sent to the senior womenâ  s administrator at all three hundred and thirty (N= 330) NCAA Division I intercollegiate athletic departments across the nation, this study examines the differences between Division I athletic department's having an eating disorder (ED) policy and those that that do not and the variables that lead to those differences. Over a 12-month period, from March 2004 through March 2005, one variable that this study addresses is whether having an ED policy influences the number of reported incidences.  Likewise, another variable is whether education on ED for the student-athletes influences the number of reported incidences. Lastly, the final variable investigates those intercollegiate athletic departments that have other policies for their student-athletes such as alcohol, tobacco, and drug, and whether this influences having an ED policy.       As the following research indicates, ED primarily affects the female gender. In addition, although ED are deemed a medical issue in which the head athletic trainer or the team physician is likely to work closely in treating the athlete, the senior womenâ  s administrator is chosen to complete the survey because of their gender, and this study focuses more on the policy itself, from an administrative prospective.  For those universities surveyed who do not have such a policy, this paper examines the need, along with the legal responsibilities that intercollegiate athletic programs have toward their student-athletes concerning ED.",
  "description_provenance": [
    "Author Email: lhartman@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: lepczyk@vt.edu",
    "Advisor Email: rstratton@vt.edu",
    "Advisor Email: gentrym@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:38Z (GMT). No. of bitstreams: 2 DISS.pdf: 631592 bytes, checksum: bb14ce5a8497af3e064b10554e42abaf (MD5) ABST.pdf: 317936 bytes, checksum: f26fa1a4afb8cb971ea979ed7d649fda (MD5)   Previous issue date: 2006-04-03"
  ],
  "handle": "27215",
  "identifier_other": "etd-04242006-181622",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242006-181622/",
  "identifier_uri": "http://hdl.handle.net/10919/27215",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "DISS.pdf",
    "ABST.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Female \tCollegiate -Athlete",
    "Senior Women's Administrators",
    "Eating Disorder Policy"
  ],
  "title": "Eating Disorder Policies Among NCAA Division I Intercollegiate Athletic Programs",
  "type": "Dissertation"
}