{
  "contributor_author": "Ruscio, Jory Zmuda",
  "contributor_committeecochair": [
    "Bevan, David R.",
    "Onufriev, Alexey V."
  ],
  "contributor_committeemember": [
    "Murali, T. M.",
    "Sandu, Adrian",
    "Esen, Asim"
  ],
  "contributor_department": "Genetics, Bioinformatics, and Computational Biology",
  "date_accessioned": "2014-03-14T20:10:40Z",
  "date_adate": "2007-05-08",
  "date_available": "2014-03-14T20:10:40Z",
  "date_issued": "2007-04-06",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "While experiments provide valuable information about biological molecules, current technology cannot yet monitor atomic fluctuations at relevant time scales. Theoretical computational simulations are able to model the appropriate interactions at atomic resolution. Computational techniques have become widely used for identifying interactions in biological systems. Such methods have proven quite accurate in their ability to reproduce experimental data and also in screening and predicting pertinent activities. Molecular modeling employs theoretical and computational techniques to elucidate biologically relevant information from macromolecular structures. Three biological systems, the nucleosome core particle, myoglobin and glycosyl hydrolase family 1 beta-glucosidases will be examined with molecular modeling methods. Results of our analyses provide information about DNA flexibility and packaging, internal migration of ligands in a small protein, and substrate specificity of an enzyme system.",
  "description_provenance": [
    "Author Email: jzmuda@vt.edu",
    "Advisor Email: murali@cs.vt.edu",
    "Advisor Email: asandu7@cs.vt.edu",
    "Advisor Email: drbevan@vt.edu",
    "Advisor Email: alexey@cs.vt.edu",
    "Advisor Email: aevatan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:40Z (GMT). No. of bitstreams: 1 JZRuscio.etd.2007.pdf: 3651608 bytes, checksum: 5485ab09cd4eabd2793a86929a359d69 (MD5)   Previous issue date: 2007-04-06"
  ],
  "handle": "27219",
  "identifier_other": "etd-04242007-134829",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242007-134829/",
  "identifier_uri": "http://hdl.handle.net/10919/27219",
  "publisher": "Virginia Tech",
  "relation_haspart": "JZRuscio.etd.2007.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "nucleosome core particle",
    "myoglobin",
    "beta-glucosidases",
    "molecular dynamics"
  ],
  "title": "Molecular Modeling: Elucidation of Structure/Function Relationships of Proteins and DNA at the Atomic Resolution",
  "type": "Dissertation"
}