{
  "contributor_author": "Hitt, Nathaniel Patterson",
  "contributor_committeechair": "Angermeier, Paul L.",
  "contributor_committeemember": [
    "Zipper, Carl E.",
    "Voshell, J. Reese Jr.",
    "Heatwole, Conrad D.",
    "Flebbe, Patricia A.",
    "Dolloff, C. Andrew"
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:10:40Z",
  "date_adate": "2007-05-03",
  "date_available": "2014-03-14T20:10:40Z",
  "date_issued": "2007-04-19",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Stream fish assemblages exist within stream networks defined by the size and proximity of connected streams (i.e., stream network topology).  The spatial position of sites within stream networks may therefore regulate opportunities for fish dispersal to access distant resources or colonize â  newâ   habitats.  Such inter-stream dispersal dynamics will influence local fish assemblage structure and the vulnerability of local assemblages to anthropogenic stressors.  In this dissertation, I explored the effects of stream network topology on fish assemblage structure in the mid-Atlantic highlands, USA and tested the hypothesis that dispersal would affect the sensitivity of fish-based environmental quality assessments (i.e., bioassessments). </p><p> In chapter 1, I evaluated the effects of stream networks by comparing fish assemblages between sites with and without large downstream confluences (>3rd order) in western Virginia, USA (i.e., mainstem tributaries and headwater tributaries, respectively).  I found that local species richness was higher in mainstem tributaries than headwater tributaries and that these effects could not be explained by variation in local environmental habitat conditions.  In chapter 2, I developed and applied a continuous model of stream network topology to explore the effects of downstream size and proximity on local fish assemblage structure within the mid-Atlantic highlands.  I found that fish assemblage structure (i.e., Bray-Curtis distances in species abundance) was significantly related to variation in stream network topology up to approximately 9 fluvial km from sites. </p><p> Chapters 3 and 4 explored the implications of inter-stream dispersal for fish bioassessments.  In Chapter 3, I identified 10 fish metrics that corresponded predictably to environmental stressors in the mid-Atlantic highlands.  However, headwater tributary assemblages showed stronger relations to local environmental quality than mainstem tributaries, consistent with the hypothesis of riverine dispersal.  In Chapter 4, I compared the effects of stream network topology on fish and benthic macroinvertebrate assemblages.  Fish metrics were influenced by the size and proximity of connected streams but benthic macroinvertebrate metrics were not.  This finding suggests that stream fishes may complement benthic macroinvertebrate bioassessments by indicating environmental conditions at larger spatial grains.</p>",
  "description_provenance": [
    "Author Email: than@vt.edu",
    "Advisor Email: czip@vt.edu",
    "Advisor Email: jvoshell@vt.edu",
    "Advisor Email: heatwole@vt.edu",
    "Advisor Email: patfle@vt.edu",
    "Advisor Email: adoll@vt.edu",
    "Advisor Email: biota@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:40Z (GMT). No. of bitstreams: 1 Hitt_2007.pdf: 974581 bytes, checksum: 6435a29d01c86f2ae26b115114ce74e4 (MD5)   Previous issue date: 2007-04-19"
  ],
  "handle": "27218",
  "identifier_other": "etd-04242007-085912",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242007-085912/",
  "identifier_uri": "http://hdl.handle.net/10919/27218",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hitt_2007.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "stream network topology",
    "stream ecology",
    "bioassessment",
    "landscape ecology",
    "dispersal",
    "freshwater fish ecology"
  ],
  "title": "Effects of stream network topology on fish assemblage structure and bioassessment sensitivity in the mid-Atlantic highlands, USA",
  "type": "Dissertation"
}