{
  "contributor_author": "Starr, Tregei Nicole",
  "contributor_committeechair": "Williams, Kimberly Forsten",
  "contributor_committeemember": [
    "Goldstein, Aaron S.",
    "Storrie, Brian",
    "Sum, Amadeu K.",
    "Walker, Richard A."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:10:39Z",
  "date_adate": "2006-05-04",
  "date_available": "2014-03-14T20:10:39Z",
  "date_issued": "2006-04-24",
  "date_rdate": "2007-05-04",
  "date_sdate": "2006-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The research presented in this dissertation consists of two primary parts. The initial focus centered on understanding the distribution of Golgi resident glycosyltransferases between the ER and Golgi at steady-state. Retrograde trafficking of these Golgi proteins has been demonstrated experimentally mandating the existence of a dynamic equilibrium between the Golgi apparatus and ER. Our published studies also included the development of a quantitative method for analysis of data collected using fluorescent microscopy.  The second part of this dissertation presents results pertaining to the quantification of a unique Golgi resident protein that cycles in the late endosome bypass pathway. Using the published method of analysis and techniques developed during the initial project, the anterograde and retrograde transport kinetics of this Golgi protein were determined and used to develop a compartmental model for pH sensitive trafficking in the bypass pathway. The spatial Golgi distribution of the protein during retrograde transport to the Golgi following endosomal exit was also investigated. This research lies at the interface of experimental cell biology and quantitative computational analysis. These experiments combined more traditional experimental biological approaches with more recent computational approaches to understanding cellular mechanisms. Additionally, development of a quantitative method of analysis validated the use of fluorescent microscopy as a quantitative tool for studying intracellular proteins.",
  "description_provenance": [
    "Author Email: tstarr@vt.edu",
    "Advisor Email: goldst@vt.edu",
    "Advisor Email: storriebrian@uams.edu",
    "Advisor Email: asum@vt.edu",
    "Advisor Email: rawalker@vt.edu",
    "Advisor Email: kfw@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:39Z (GMT). No. of bitstreams: 2 Title.pdf: 80435 bytes, checksum: 1ad363dc17d2f3014467099a4535bb3b (MD5) Dissertation.pdf: 16498927 bytes, checksum: bd3cc6dea5521e597f06770dd42f6a77 (MD5)   Previous issue date: 2006-04-24"
  ],
  "handle": "27217",
  "identifier_other": "etd-04242006-222423",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242006-222423/",
  "identifier_uri": "http://hdl.handle.net/10919/27217",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Title.pdf",
    "Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fluorescent microscopy",
    "glycosyltransferases",
    "kinetic model",
    "Golgi",
    "confocal microsocpy",
    "early endosomes",
    "endoplasmic reticulum",
    "GPP130"
  ],
  "title": "Quantitative Studies of Intracellular Trafficking of Two Classes of Resident Golgi Apparatus Proteins",
  "type": "Dissertation"
}