{
  "contributor_author": "Person, Linda Joy",
  "contributor_committeechair": "Graham, George M.",
  "contributor_committeemember": [
    "Stratton, Richard K.",
    "Poole, Jon R.",
    "Johnson, Paulette",
    "Magliaro, Susan G."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:41Z",
  "date_adate": "2000-04-26",
  "date_available": "2014-03-14T20:10:41Z",
  "date_issued": "1999-04-19",
  "date_rdate": "2001-04-26",
  "date_sdate": "2000-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<HTML> <HEAD> <META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=windows-1252\"> <META NAME=\"Generator\" CONTENT=\"Microsoft Word 97\"> <TITLE>(ABSTRACT)</TITLE> <META NAME=\"Template\" CONTENT=\"C:PROGRAM FILESMICROSOFT OFFICEOFFICEhtml.dot\"> </HEAD> <BODY LINK=\"#0000ff\" VLINK=\"#800080\">  <P ALIGN=\"CENTER\">ABSTRACT</P> <P>The purpose of this study was to examine how two different groups of preservice teachers from two universities identified and described appropriate and inappropriate teaching practices and suggest appropriate changes. The investigation was also designed to provide teacher educators with insights into how to better prepare prospective teachers for their first teaching experience.</P> <P>Participants for this study were 30 undergraduate preservice teachers from two southeastern universities. There were 15 participants from each group, which included 17 males and 13 females. Eight video vignettes were created from the Developmentally Appropriate Practices document developed by NASPE (1992). Two vignettes depicted appropriate practices and six portrayed inappropriate practices. Participants viewed the vignettes during scheduled appointments and were instructed to identify and describe what they saw in the vignettes according to the criterion guidelines developed for this study.</P> <P>Data sources for the investigation were the participants' written responses gathered from the Qualitative Response Chart (questionnaire) and the Debriefing Sheet. The research project attempted to answer the following questions: Were there differences in how University A and University B identified and described appropriate teaching practices in physical education? What were the differences in the teaching practices recommended? To what experiences did the two groups attribute their ability to identify and describe appropriate and inappropriate teaching practices?</P> <P>Results indicated that the amount and kind of experiences provided by the respective teacher education programs did have an impact on how the participants identified and described appropriate teaching practices in physical education.</P></BODY> </HTML>",
  "description_provenance": [
    "Author Email: lperson@vsu.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: poole@vt.edu",
    "Advisor Email: ggraham@vt.edu",
    "Advisor Email: pjohnson@vsu.edu",
    "Advisor Email: sumags@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:41Z (GMT). No. of bitstreams: 1 LindaJPerson.pdf: 571641 bytes, checksum: 76f985db23fa17074a68a8302364debb (MD5)   Previous issue date: 1999-04-19"
  ],
  "handle": "27227",
  "identifier_other": "etd-04252000-14300001",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252000-14300001/",
  "identifier_uri": "http://hdl.handle.net/10919/27227",
  "publisher": "Virginia Tech",
  "relation_haspart": "LindaJPerson.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Developmentally Appropriate Physical Education",
    "Preservice Teachers",
    "vignettes"
  ],
  "title": "Preservice Teachers' Analysis of Appropriate Teaching Practices in Physical Education:  A Qualitative Comparison of Two Programs",
  "type": "Dissertation"
}