{
  "contributor_author": "Horton, Leanna Marie",
  "contributor_committeecochair": [
    "Agnew, Michael J.",
    "Nussbaum, Maury A."
  ],
  "contributor_committeemember": [
    "Grange, Robert W.",
    "Madigan, Michael L.",
    "Shewchuk, John P."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:10:41Z",
  "date_adate": "2012-05-08",
  "date_available": "2014-03-14T20:10:41Z",
  "date_issued": "2012-04-17",
  "date_rdate": "2012-05-08",
  "date_sdate": "2012-04-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Work-related musculoskeletal disorders (WMSDs) remain a substantial problem in the workplace.  Rotation, in which workers are rotated between tasks, is widely used as an administrative control, as it is considered to reduce WMSD risk through reducing physical exposures and increasing exposure variation.  However, despite its widespread use, there is limited evidence that rotating between tasks is effective in reducing the risk of WMSDs.  Inconsistencies in measured outcomes of rotation may be attributed to the variety of parameters involved in determining rotation schedules, including which tasks to include in a schedule, the rate at which workers rotate, and the order in which tasks are performed.    This research assessed the effects of rotation, specifically focusing on rotation frequency and task order, on muscle fatigue and performance when included tasks loaded the same muscle group.  Twelve participants completed six experimental sessions in each of three studies, during which repetitive tasks were performed for one hour either with or without rotation.  Each study simulated a different task, including static shoulder abduction, box lifting, and a light assembly task.  Rotation occurred between lower and higher exertion levels, and each rotation schedule varied in both rotation frequency (rotating every 15 minutes vs. 30 minutes) and task order (starting with the lower vs. higher intensity task).  Muscle fatigue was assessed through several measures, including electromyography, and ratings of perceived discomfort.  Performance was assessed through the accuracy of shoulder moment output, the accuracy of box placement, or the speed of assembly completion.    As expected, rotation was effective in reducing fatigue compared to higher intensity tasks with no rotation, although it increased fatigue compared to the lower intensity with no rotation.  While effects of rotation frequency and task order were seen on some measures, results across all three studies did not indicate consistent effects of either rotation frequency or task order on fatigue or performance.  As such, the practical relevance of these rotation parameters and the likely impacts of rotation are not yet clear, and further assessments are needed.  Such assessments should ideally involve longer durations, field studies, and/or more direct measures of injury or injury risk.",
  "description_provenance": [
    "Author Email: lhorton@vt.edu",
    "Advisor Email: rgrange@vt.edu",
    "Advisor Email: mjagnew@vt.edu",
    "Advisor Email: nussbaum@vt.edu",
    "Advisor Email: mimadiga@vt.edu",
    "Advisor Email: shewchuk@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:41Z (GMT). No. of bitstreams: 1 Horton_LM_D_2012.pdf: 5062419 bytes, checksum: 24e5ab3a83394d60e34e1b88c3529eab (MD5)   Previous issue date: 2012-04-17"
  ],
  "handle": "27223",
  "identifier_other": "etd-04242012-143711",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04242012-143711/",
  "identifier_uri": "http://hdl.handle.net/10919/27223",
  "publisher": "Virginia Tech",
  "relation_haspart": "Horton_LM_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "performance",
    "muscle fatigue",
    "task order",
    "rotation frequency"
  ],
  "title": "The Effects of Job Rotation Parameters on Localized Muscle Fatigue and Performance: An Investigation of Rotation Frequency and Task Order",
  "type": "Dissertation"
}