{
  "contributor_author": "Paris, Robert L.",
  "contributor_committeechair": "Griffey, Carl A.",
  "contributor_committeemember": [
    "Harter-Dennis, Jeannine M.",
    "Buss, Glenn R.",
    "Jones, Eluned C.",
    "Brann, Daniel E."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:10:41Z",
  "date_adate": "2000-04-26",
  "date_available": "2014-03-14T20:10:41Z",
  "date_issued": "2000-04-18",
  "date_rdate": "2004-12-31",
  "date_sdate": "2000-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research was conducted to determine the potential of hulless winter barley (Hordeum vulgare L.) as an improved feed crop in the mid-Atlantic region.  Winter barley is an excellent crop in rotation with soybean (Glycine max L.); however, production of winter barley during the past few years has decreased mainly due to low market prices, even though the mid-Atlantic region is a feed grain deficient area.  Therefore, value added traits need to be developed in order for barley production to continue in the region. <p> In the first part of this study, the objectives were to:  (i) evaluate the agronomic performance and potential of six experimental hulless winter barley lines compared with two commercial hulled cultivars; (ii) determine and compare fiber, b-glucan, protein, and fat concentrations, and true metabolizable energy, corrected for nitrogen (TMEn) among these genotypes; and (iii) evaluate the genetic potential of winter hulless barley accessions from the world collection for use as parents in hulless breeding programs.  Six hulless lines all derived from the cross VA75-42-45/SC793556//CI2457 were acquired from Clemson University in South Carolina.  The six lines were evaluated for yield, test weight, heading date, plant height, and lodging.  These hulless lines along with two hulled cultivars were planted in replicated yield plots in four states with a total of eight locations, and were managed according to standard recommended practices.  Grain from each of the hulless lines and hulled checks, along with that of Trical 498 triticale (X Triticosecale) and Jackson wheat (Triticum aestivum L.) were analyzed for fiber, b-glucan, fat, protein, and ash concentration, and TMEn value.  Eight hundred and seven winter or facultative habit hulless barley lines were obtained from the USDA-ARS National Small Grains Collection in Aberdeen, ID.  These lines were screened for reaction type to races 8 and 30 of barley leaf rust (Puccinia hordei) and to a composite population of powdery mildew (Blumeria graminis f. sp. hordei).  These accessions also were planted in observation rows to evaluate heading date, plant height, lodging, and seed threshability.  <p> The hulless lines yielded 23% less, but had 13% higher test weights than the hulled check cultivars.  There was no difference between hulled and hulless barley in heading date and plant height.  Hulless lines had a higher protein and lower fiber concentration than hulled barley.  They also had higher b-glucan and fat concentrations than triticale or wheat.  TMEn was similar between hulled and hulless barley, triticale, and wheat.  Approximately 100 hulless barley lines from the world collection were selected for potential use as parents among 800 accessions tested, based on evaluations of lodging, plant height, threshability, and seed color.  <p> In the second part of the study the objectives were to determine the effects of (i) hulled and hulless barley, and (ii) b-glucanase on the performance of broilers fed different diets from 21 to 42 days of age.  Diets comprised of 30% hulless or hulled barley, and a standard corn (Zea mays)/soybean meal diet with and without b-glucanase enzyme were evaluated to determine the effects of barley on gut viscosity, carcass weight, gain, percent shell, and feed efficiency in 21 to 42 day old broilers.  In the first year, diets comprised of hulless lines SC890573 and SC860972, and the hulled cultivar Callao were compared to a standard check diet.  In the second year SC860972 was replaced with SC880248 due to the inability to secure a sufficient amount of seed.  Each year one hulled and two hulless barley diets were compared to a standard diet.  Each diet was fed with and without enzyme, for a total of eight diets.  Broilers 21 days of age were fed the diets until day 42 when they were processed.  There was a significant decrease (P<0.05) in gut viscosity of birds fed diets with enzyme compared to birds fed diets without enzyme; however, gut viscosity did not affect weight gain or percent shell.  Barley substituted at the 30% level did not have a significant effect on broiler performance, nor did the addition of enzyme.  Absence of enzyme effect was attributed to bird age, since older birds are able to hydrolyze b-glucan more effectively than juveniles.  <p> The potential of hulless barley as an improved feed source for the poultry and swine industry is great for the mid-Atlantic region.  Increases in grain yield are currently being realized through focused breeding efforts, and hulless lines exhibit positive nutritional components that combine favorable attributes of both wheat and hulled barley. Barley substituted at the 30% level in the diets of broilers did not cause any detrimental effects.  Addition of hulless barley may potentially lead to a reduction in cost per pound of gain of broilers, and provide an alternative crop for mid-Atlantic region grain producers and feeders.",
  "description_provenance": [
    "Author Email: rparis@vt.edu",
    "Advisor Email: cgriffey@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:41Z (GMT). No. of bitstreams: 1 parisetd.pdf: 415166 bytes, checksum: 17a658126bcf82de1cb6705954c84930 (MD5)   Previous issue date: 2000-04-18"
  ],
  "handle": "27228",
  "identifier_other": "etd-04252000-15000011",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252000-15000011/",
  "identifier_uri": "http://hdl.handle.net/10919/27228",
  "publisher": "Virginia Tech",
  "relation_haspart": "parisetd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Hulless Barley",
    "Beta-Glucan"
  ],
  "title": "Potential of Hulless Winter Barley as an Improved Feed Crop",
  "type": "Dissertation"
}