{
  "contributor_author": "Blanks, Felica B. Wooten",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeemember": [
    "Janosik, Steven M.",
    "Dudley, Larkin S.",
    "Bayer, Alan E.",
    "Creamer, Donald G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:42Z",
  "date_adate": "2000-04-26",
  "date_available": "2014-03-14T20:10:42Z",
  "date_issued": "2000-04-13",
  "date_rdate": "2001-04-26",
  "date_sdate": "2000-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "American democracy fosters the common good of society by allowing citizen involvement in government. Sustaining American democracy depends on civic involvement among citizens. Civic involvement, which consists of citizens' informed involvement in government, politics, and community life, is a desired behavior among adult citizens in the United States and it is a desired outcome of higher education. However, people in the latter part of the twentieth century have questioned the extent to which higher education makes a difference in civic involvement among adults in the United States. College educators are challenged to explain the relationship between higher education and civic involvement among adults in the 1990s. <p> The purpose of the present study is to investigate the relationship between higher education and civic involvement. The researcher approached this issue by examining relationships between measures of civic involvement and personal characteristics such as education level, race, gender, age, and socioeconomic status among adults in the United States. The researcher compared joint relationships between civic involvement and personal characteristics among college graduates with the joint relationships between civic involvement and personal characteristics among adults with some college education and adults with no college education. <p> Data from the Adult Civic Involvement component of the National Household Education Survey of 1996 (NHES:96) were analyzed. This survey was conducted by the National Center for Education Statistics. Using list-assisted, random digit dialing methods and computer assisted telephone interviewing techniques, data were collected from a nationally representative sample of non-institutionalized civilians who were eighteen years of age or older at the time of the survey. Data were collected regarding respondents' (a) personal characteristics, (b) use of information sources, (c) knowledge of government, (d) community participation, and (e) political participation. The selected technique for analyzing data was canonical correlation analysis (CCA), which is a form of multivariate analysis that subsumes multiple regression, multivariate analysis of variance, and discriminant analysis.  <p> The results revealed that civic involvement among adults in the United States is moderate at best. Low to moderate civic involvement among adults is mostly attributed to the absence of civic behaviors among adults with no college education. Among adults, overall civic involvement has strong relationships with education level, race, gender, age, and socioeconomic status. While the relationship between higher education and civic involvement is strong, there are  significant differences in civic involvement among college graduates when grouped according to race, gender, age, and socioeconomic status. White male college graduates with high incomes tend to demonstrate the attributes of civic involvement to a greater extent than other groups. Among adults with some college education, overall civic involvement is characteristic of older males.Similarly, older adults with no college education demonstrate civic involvement to a greater extent than younger adults with no college education. <p> These findings are consistent with the results of previous studies. The findings also extend the results of previous studies by explaining the relationships between civic involvement and multiple personal characteristics when analyzed simultaneously. The findings suggest a need for ongoing analyses of civic involvement among adult citizens and among college students. The results further imply a need for college personnel to identify and implement strategies that will improve the civic outcomes of higher education for minorities and females in various age and income categories.",
  "description_provenance": [
    "Author Email: felicablanks@hotmail.com",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: yogi@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:42Z (GMT). No. of bitstreams: 1 etd.pdf: 430386 bytes, checksum: 3f96846111daf1b61989433c79ddd20e (MD5)   Previous issue date: 2000-04-13"
  ],
  "handle": "27229",
  "identifier_other": "etd-04252000-15100031",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252000-15100031/",
  "identifier_uri": "http://hdl.handle.net/10919/27229",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "canonical correlation",
    "higher education outcomes",
    "college graduates",
    "civic involvement",
    "government and political participation"
  ],
  "title": "Joint Relationships between Civic Involvement, Higher Education, and Selected Personal Characteristics among Adults in the United States",
  "type": "Dissertation"
}