{
  "contributor_author": "Endo, Seiji",
  "contributor_committeechair": "Kincade, Doris H.",
  "contributor_committeemember": [
    "Murrmann, Suzanne K.",
    "Chen-Yu, Jessie H.",
    "Norton, Marjorie J. T.",
    "Giddings, Valerie L."
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2014-03-14T20:10:42Z",
  "date_adate": "2000-04-26",
  "date_available": "2014-03-14T20:10:42Z",
  "date_issued": "2000-04-21",
  "date_rdate": "2001-04-26",
  "date_sdate": "2000-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In the present market place situation, a consumer's main contact with manufacturing (i.e., the production process) is through retailers or other middlemen, such as mail order catalog companies. Consumers rarely complain, but when they do, consumers complain to or request information from retailers about products (Kincade, Redwine, & Hancock, 1992). Manufacturers rarely receive information directly from consumers. Instead, they get second-hand reports from retailers or they get no information at all. <p>The purpose of this research was to explore the relationship between manufacturers and consumers during the relationship process using a mixed design of preexperimental research and panel analysis with in-depth interview. The major research question is: What will happen in the Relationship Spiral Model when the consumer becomes a part of the manufacturer /consumer relationship? <p>Twenty female participants, out of 35 who answered the screening questionnaire, were selected from students and acquaintances of the researcher in Blacksburg, VA. For the experiment, a simulated web site was used by a consumer (i.e., participant) to order two pair of customized shoes based on each consumer's needs. <p>In the preexperimental design for this study, a longitudinal case study with a panel study technique, as described by Babbie (1999) and Creswell (1994), was utilized to investigate consumer characteristics (i.e., demographics, shopping orientation, expectation, and experience), goods and service in encounter, and direct communication over time. The following procedure was conducted: (a) interviewing the subjects, (b) transcribing tapes and field notes, (c) segmenting data, (d) de-contextualizing data, (e) coding data, and (f) re-contextualizing data. Interpretational qualitative analysis was utilized for data analysis in this study. <p>As a result of recontextualization of the interview scripts, the Relationship Spiral Model emerged from the data. Four sub-models for four groups were refined according to the data from the Relationship Spiral Model. Further analysis was conducted on sub-models. Consumers are constantly changing and have multiple selection criteria. These criteria are constantly changing based on expectations, experiences and other situational variables.",
  "description_provenance": [
    "Author Email: sendo@vt.edu",
    "Advisor Email: kincade@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:42Z (GMT). No. of bitstreams: 5 6bib.PDF: 90517 bytes, checksum: 37d2f095306aed35af23ee7c15a51b18 (MD5) 5.pdf: 166974 bytes, checksum: 1e9b7c0e3dbe91ed698332f087aa2618 (MD5) 4.pdf: 51430 bytes, checksum: d3bb7f17c2d1867eac42432fefc4e70c (MD5) 123.pdf: 154190 bytes, checksum: d13bd71263f0977b1a2ad675556f1cec (MD5) etd.PDF: 72443 bytes, checksum: c69f79e0fae72a3b05090fccff1fc225 (MD5)   Previous issue date: 2000-04-21"
  ],
  "handle": "27232",
  "identifier_other": "etd-04252000-18560048",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252000-18560048/",
  "identifier_uri": "http://hdl.handle.net/10919/27232",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "6bib.PDF",
    "5.pdf",
    "4.pdf",
    "123.pdf",
    "etd.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Services",
    "Relationship Marketing",
    "Manufacturing Systems"
  ],
  "title": "Long-Term Relationship between Footwear Manufacturer and Consumers: Relationship Spiral Model of Encounter for Services and Goods through Internet Shopping",
  "type": "Dissertation"
}