{
  "contributor_author": "Johnson, Cathleen A.",
  "contributor_committeechair": "Gilles, Robert P.",
  "contributor_committeemember": [
    "Snyder, Susan K.",
    "Spanos, Aris",
    "Burns, John A.",
    "Eckel, Catherine C."
  ],
  "contributor_department": "Economics (Arts and Sciences)",
  "date_accessioned": "2014-03-14T20:10:42Z",
  "date_adate": "2000-05-10",
  "date_available": "2014-03-14T20:10:42Z",
  "date_issued": "2000-04-14",
  "date_rdate": "2001-05-10",
  "date_sdate": "2000-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "We introduce a spatial cost topology in the  network formation model analyzed by Jackson and  Wolinsky, <i>Journal of Economic Theory </i><b>71 </b> (1996), 44--74. This cost topology might  represent geographical, social, or individual  differences. It describes variable costs of  establishing social network connections.  Participants form links based on a cost-benefit  analysis. We examine the pairwise stable networks  within this spatial environment. Incentives vary  enough to show a rich pattern of emerging  behavior. We also investigate the subgame perfect  implementation of pairwise stable and efficient  networks. We construct a multistage extensive  form game that describes the formation of links  in our spatial environment. Finally, we identify  the conditions under which the subgame perfect  Nash equilibria of these network formation games  are stable.<p> We analyze the dynamic implications of learning  in a large population coordination game where both  the actions of the players and the communication  network evolve over time. Cost considerations of  social interaction are incorporated by considering  a circular model with endogenous neighborhoods,  meaning that the locations of the players are  fixed but players can create their own  communication network.The dynamic process  describing medium-run behavior is shown to  converge to an absorbing state, which may be  characterized by coexistence of conventions.  In the long run, when mistake probabilities  are small but nonvanishing, coexistence of  conventions is no longer sustainable as the  risk-dominant convention becomes the unique  stochastically stable state.<p> We create and investigate a system that is  capable of observing the accumulation of social  capital and the effect of social capital accumulation  on behavior of individually rational players. In the first  model, we develop a restricted system to show  that social capital forms and is maintained at  a steady state level. The resulting network is the  chain. The second model uses a congestion function in  conjunction with social capital to show a network  emerge that contains links that costlier than  those in the chain network.",
  "description_provenance": [
    "Author Email: cjohnson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:42Z (GMT). No. of bitstreams: 2 cjohnson.pdf: 924146 bytes, checksum: b9c4fb38722b67838639dede192b13cf (MD5) cjohnsonvita.pdf: 54984 bytes, checksum: 744212b71efcadd5c68952613d0486ec (MD5)   Previous issue date: 2000-04-14"
  ],
  "handle": "27230",
  "identifier_other": "etd-04252000-16100053",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252000-16100053/",
  "identifier_uri": "http://hdl.handle.net/10919/27230",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "cjohnson.pdf",
    "cjohnsonvita.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Conventions",
    "Stability",
    "Social Capital",
    "Social Networks",
    "Local Interaction"
  ],
  "title": "Social Capital and Conventions: A Social Networks Perspective",
  "type": "Dissertation"
}