{
  "contributor_author": "Stawovy, Michael Thomas",
  "contributor_committeechair": "Aning, Alexander O.",
  "contributor_committeemember": [
    "Reynolds, William T. Jr.",
    "Curtin, Willliam A. Jr.",
    "Kampe, Stephen L.",
    "Wert, John A."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:10:42Z",
  "date_adate": "2000-04-27",
  "date_available": "2014-03-14T20:10:42Z",
  "date_issued": "1998-07-15",
  "date_rdate": "2001-04-27",
  "date_sdate": "2000-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Aluminum and metal-oxide powders were mixed using mechanical alloying.  Exothermic displacement reactions could be initiated in the powders either by mechanical alloying alone or by heat treating the mechanically alloyed powders.  Exponential relationships developed between the initiation time of the reaction and the mechanical alloying  charge ratio.  The exponential relationships were the result of changes in the intensity and quantity of collisions occurring during mechanical alloying.  Differential thermal analysis of the mechanically alloyed powders indicated that increased milling time inhibited the initiation of the displacement reactions.  It is believed that the reactions were inhibited because of heat dissipation from reacting oxide particles in the surrounding metal.  Determining the effects of mechanical alloying on displacement reactions will lead to a more thorough understanding of the kinetics of mechanical alloying.  <p>  Reacted powders were densified by uniaxial compaction and extrusion.  Metallographic analysis of the reacted specimens confirmed the findings of the thermal analysis.  Increased mechanical alloying inhibited the chemical reactions.  Densified specimens from longer-milled mechanically alloyed specimens showed finer, more uniformly dispersed reaction products.  These samples also showed increased mechanical properties as a result of their finer microstructure.  Current particle strengthening models were used to accurately predict room temperature properties.  Because of the fine microstructures produced, it may be possible to use similar techniques to yield new high-temperature aluminum alloys.",
  "description_provenance": [
    "Author Email: stawovy@xtn.net",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: William_Curtin@brown.edu",
    "Advisor Email: stekampe@vt.edu",
    "Advisor Email: john.wert@risoe.dk",
    "Advisor Email: aaning@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:42Z (GMT). No. of bitstreams: 1 Final_dissertation.pdf: 1707134 bytes, checksum: 2b605cbcc4ef9bfc22c2e9a272885934 (MD5)   Previous issue date: 1998-07-15"
  ],
  "handle": "27233",
  "identifier_other": "etd-04252000-20050009",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252000-20050009/",
  "identifier_uri": "http://hdl.handle.net/10919/27233",
  "publisher": "Virginia Tech",
  "relation_haspart": "Final_dissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "displacement reactions",
    "high temperature aluminum alloys",
    "mechanical alloying"
  ],
  "title": "Processing of Aluminum Alloys Containing Displacement Reaction Products",
  "type": "Dissertation"
}