{
  "contributor_author": "Housenick, Mitchell Alexander",
  "contributor_committeechair": "Baffi, Charles R.",
  "contributor_committeemember": [
    "Redican, Kerry J.",
    "Uttech, Melanie R.",
    "Fortune, Jimmie C.",
    "Morgan, Shirley L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:42Z",
  "date_adate": "2001-04-25",
  "date_available": "2014-03-14T20:10:42Z",
  "date_issued": "2001-04-05",
  "date_rdate": "2002-04-25",
  "date_sdate": "2001-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ASSESSMENT OF THE PREVALENCE OF SMOKE-FREE ENVIRONMENT POLICIES  THROUGHOUT THE COMMONWEALTH OF VIRGINIA AT WORKSITES EMPLOYING FIFTY OR MORE WORKERS By Mitchell Alexander Housenick  (ABSTRACT)  The purpose of this study was to investigate the prevalence of smoke-free environment polices  throughout the Commonwealth of Virginia at worksites employing fifty or more workers.  Specifically,  this study assessed policy prevalence, development, implementation, and enforcement.  In addition,  this study assessed smoke-free environment policy effectiveness.  The population for this investigation  consisted of telephone surveys of 374 worksites located throughout the Commonwealth of Virginia.  Of these  worksites, 340 (91%) completed the telephone survey.  The population (n = 340) was spread throughout five  health regions, Northern, Northwest, Central, Southwest, and East.  Descriptive analysis and One-way Analysis  of Variance (ANOVA) were applied to investigate differences between these five health regions.  An alpha  of .05 was selected for this study. \tBased on the findings, the following conclusions were drawn: (1) Fifty-percent of the worksites  located throughout the Commonwealth of Virginia have some form of smoke-free environment policies; (2) The  smoke-free environment policy constructs used in the telephone survey guide were statistically significant  in identifying differences between the five health regions; (3) Smoke-free environment policies at the  worksite are dependent upon health region; (4) Implementation of smoke-free environment policies is dependent  upon health region; (5) Enforcement of smoke-free environment policies is dependent upon health region, and  (6) Effectiveness of smoke-free environment policies is dependent upon health region.  The following  recommendations were suggested: (1) Further studies assessing smoke-free environment policy enforcement should  be conducted annually; (2) Studies incorporating a qualitative research methodology regarding smoke-free  environment policy prevalence should be conducted; (3) Studies involving common smoke-free environment policies  at different states should be investigated, and (4) Additional in-depth surveys should be conducted to evaluate  health outcomes associated with the implementation of smoke-free environment policies.",
  "description_provenance": [
    "Author Email: mhousenick@yahoo.com",
    "Advisor Email: Baffic@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:42Z (GMT). No. of bitstreams: 1 Mitchell_Housenick_Dissertation.pdf: 1321505 bytes, checksum: 02b83a23431fc2322e085a97bb1ea9e0 (MD5)   Previous issue date: 2001-04-05"
  ],
  "handle": "27234",
  "identifier_other": "etd-04252001-013702",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252001-013702/",
  "identifier_uri": "http://hdl.handle.net/10919/27234",
  "publisher": "Virginia Tech",
  "relation_haspart": "Mitchell_Housenick_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Smoking Policy",
    "Worksite",
    "Environmental Tobacco Smoke"
  ],
  "title": "Assessment of the Prevalence of Smoke-Free Environment Policies Throughout the Commonwealth of Virginia at Worksites Employing Fifty or More Workers",
  "type": "Dissertation"
}