{
  "contributor_author": "Mecham, Jeffrey B.",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Anderson, Mark R.",
    "Dillard, John G.",
    "Wolfe, James F.",
    "Shultz, Allan R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:10:43Z",
  "date_adate": "2001-04-26",
  "date_available": "2014-03-14T20:10:43Z",
  "date_issued": "2001-04-23",
  "date_rdate": "2002-04-26",
  "date_sdate": "2001-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Commercially available 4,4â  -dichlorodiphenylsulfone (DCDPS) was successfully disulfonated with fuming sulfuric acid to yield 3,3â  -disodiumsulfonyl-4,4â  -dichlorodiphenylsulfone (SDCDPS).  Subsequently, DCDPS and SDCDPS were systematically reacted with 4,4â  -biphenol under nucleophilic step polymerization conditions to generate a series of high molecular weight, film-forming, ductile, ion conducting copolymers.  These were converted to the acid form and investigated as proton exchange membranes for fuel cells.  Hydrophilicity increased with the level of sulfonation.  However, water sorption increased gradually until about 50 mole percent SDCDPS was incorporated, and thereafter showed a large increase to yield water soluble materials for the 100% SDCDPS system.  Atomic force microscopy (AFM) confirmed that the morphology of the copolymers displayed continuity of the hydrophilic phase at 60 mole percent SDCDPS.  Conductivity measurements in the 40-50 mole percent SDCDPS range, where excellent mechanical strength was maintained, produced values of 0.1 S/cm or higher which were comparable to the control, Nafionâ ¢.  These compositions also show a high degree of compatibility with heteropolyacids such as phosphotungstic acid.  These inorganic compounds provide a promising mechanism for obtaining conductivity at temperatures well above the boiling point of water and membrane compositions containing them are being actively pursued.  The water soluble 100% SDCDPS system was further investigated by successfully functionalizing the endgroups to afford aromatic amines via appropriate endcapping with m-aminophenol.  Oligomers and polymers from 5-30 kg/mole number average molecular weight were synthesized and well characterized by NMR spectroscopy, endgroup titrations and size exclusion chromatography.  The diamino-telechelic sulfonated segment was reacted with several dianhydrides and diamines to produce multiblock, hydrophobic polyimide-hydrophilic sulfonated polyarylene ether copolymers.  Both ester-acid and amic acid synthesis routes were utilized in combination with spin-casting and bulk imidization.  A series of tough, film-forming segmented copolymers was prepared and characterized.  AFM measurements demonstrated the generation of quite well defined, nanophase-separated morphologies which were dependent upon composition as well as aging in a humid environment.  Characterizations of the segmented copolymers for conductivity, and water and methanol sorption were performed and comparisons to state-of-the-art perfluorinated Nafionâ ¢ systems were made.  It is concluded that the segmented or block systems have the potential to enhance certain desirable PEM characteristics in fuel cells, particularly those related to swelling, retention of mechanical strength at elevated temperatures, and critical adhesion issues in membrane electrode assemblies.",
  "description_provenance": [
    "Author Email: jeffers@vt.edu",
    "Advisor Email: jmcgrath@chemserver.chem.vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:43Z (GMT). No. of bitstreams: 1 finaldissertation.pdf: 2496485 bytes, checksum: e4da133ea99445866311a3186a7906d0 (MD5)   Previous issue date: 2001-04-23"
  ],
  "handle": "27238",
  "identifier_other": "etd-04252001-180802",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252001-180802/",
  "identifier_uri": "http://hdl.handle.net/10919/27238",
  "publisher": "Virginia Tech",
  "relation_haspart": "finaldissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Sulfonic Acid Sites",
    "Poly(arylene ether)",
    "Random Copolymer",
    "Poly(imide)",
    "Direct Copolymerization",
    "Segmented Copolymer",
    "Proton Exchange Membrane"
  ],
  "title": "Direct Polymerization Of Sulfonated Poly(arylene ether) Random Copolymers And Poly(imide)Sulfonated Poly(arylene ether) Segmented Copolymers: New Candidates For Proton Exchange Membrane Fuel Cell Material Systems",
  "type": "Dissertation"
}