{
  "contributor_author": "Binggeli, Brian T.",
  "contributor_committeecochair": "Sughrue, Jennifer A.",
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:42Z",
  "date_adate": "2001-04-29",
  "date_available": "2014-03-14T20:10:42Z",
  "date_issued": "2001-04-13",
  "date_rdate": "2002-04-29",
  "date_sdate": "2001-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "In response to reports alleging an alarming decline in student knowledge and achievement during the last two decades, America has witnessed a revival-like call for higher standards in public education. Driven by a public desire to measure schools and educators based on student achievement, policymakers have moved quickly to create politically expedient accountability reform laws. Research into early attempts show significant difficulties with regard to their political and legal viability. There is evidence to suggest that policymakers must develop a better understanding of the complex issues that surround both the development and implementation of such policies if those policies are to survive inevitable scrutiny and challenge and bring meaningful reform. This study is a descriptive policy analysis tracing the evolution of Floridaâ  s efforts since 1989 to bring accountability to public schools and educators based on measured student performance. A rich description of the political, educational, social, and legal issues that have helped shape efforts to craft such legislation is presented. Based on an analysis of the evolution of these reform efforts, implications for policymakers in Florida and other states, as well as the educational community at-large are reported.",
  "description_provenance": [
    "Author Email: btbingge@henrico.k12.va.us",
    "Advisor Email: jsugh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:42Z (GMT). No. of bitstreams: 1 dissertation2.pdf: 535070 bytes, checksum: 75c0dfbf314d0f9a4726852552a96b2d (MD5)   Previous issue date: 2001-04-13"
  ],
  "handle": "27237",
  "identifier_other": "etd-04252001-172838",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252001-172838/",
  "identifier_uri": "http://hdl.handle.net/10919/27237",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "law",
    "policy"
  ],
  "title": "An Analysis of Issues That Helped Shape Florida Public School Accountability Legislation: 1989-2000",
  "type": "Dissertation"
}