{
  "contributor_author": "Rabon-Stith, Karma Melisa",
  "contributor_committeechair": "Baffi, Charles R.",
  "contributor_committeemember": [
    "Roberto, Karen A.",
    "Redican, Kerry J.",
    "Nespor, Jan K.",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:43Z",
  "date_adate": "2001-04-26",
  "date_available": "2014-03-14T20:10:43Z",
  "date_issued": "2001-04-18",
  "date_rdate": "2002-04-26",
  "date_sdate": "2001-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "THE RELATIONSHIP BETWEEN SELECT VARIABLES AND THE BREAST CANCER SCREENING PRACTICES OF A CONVIENENT SAMPLE OF AFRICAN-AMERICAN WOMEN FROM GRAMBLING STATE UNIVERSITY AND THE WILLIS-KNIGHTON NEIGHBORHOOD CLINIC  ABSTRACT  By:  Karma M. Rabon-Stith Doctoral Candidate Virginia Polytechnic Institute and State University  Committee Chair  Dr. Charles R. Baffi Associate's Professor    \tOne of the leading causes of mortality for African-American women is breast cancer.  The national breast cancer mortality rate for African-American women is 28.0 per 100,000.  However, African-American women residing in Northwest Louisiana have a breast cancer mortality rate of 34.5 per 100,000 (American Cancer Society; National Cancer Institute; Landis, Murry, Boldern & Wingo, 1998). This is the fourth highest of all women living in the United States (Early Cancer Detection Program, Annual Report, 1999).  \tBreast cancer mortality is correlated to the stage at diagnosis. The earlier breast cancer is diagnosed and treated, the more likely women can survive the disease (Davis, Axelrod, Osborne & Telang, 1997). African-American women are frequently diagnosed with breast cancer at an advanced stage (Phillips, Cohen, & Moses, 1999). The frequent advanced stage diagnosis may be due to African-American women breast cancer screening practices.  When done correctly and as recommended, breast cancer screening can help women detect breast cancer at an early stage, when it is most treatable.  Since African-American women residing in Northwest Louisiana have the fourth highest national mortality rate, and little is known about their compliance with the recommendations of the American Cancer Society regarding breast cancer screening, there is a need to identify these practices of African-American women in Northwest Louisiana. \tThe purpose of this study was to examine the relationship between select variables and breast cancer screening practice.  A questionnaire was used to gather information from a convenient sample of 273 African-American women recruited from two sites located in Northwest Louisiana -- Grambling State University and the Willis-Knighton Neighborhood Clinic. The questionnaire was used to gather information about: demographics, knowledge, and individual breast cancer risk factors (age of menarche, full term pregnancy, history of breast condition or disease, type of breast condition or disease, age when gave birth to first child, menopause, age menopause began). Andersen's theoretical framework served as the guiding theory for the study. The hypotheses were analyzed by the chi square test of independence and logistic regression. \tResults from the chi-square test of independence indicated that breast cancer screening is dependent upon age, education, income, age when gave birth to first child, menopause, and age menopause began. In contrast, breast cancer screening is independent of breast cancer knowledge, age of menarche, full term pregnancy, history of breast condition or disease, type of breast condition or disease, and family history of breast cancer.   \tLogistic regression was used to predict the odds of breast cancer screening compliance by the women in this study.  The analysis found that having an annual income of 25,000 - 39,999 as the strongest income predictor of non-compliance. Logistic regression analysis found that having a Master's degree was the strongest educational attainment predictor of non-compliance.",
  "description_provenance": [
    "Author Email: krabon@vt.edu",
    "Advisor Email: kroberto@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: baffic@vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:43Z (GMT). No. of bitstreams: 1 01dissertation.pdf: 492096 bytes, checksum: b7a0f74b0df7af70f4ce9e60f48e5348 (MD5)   Previous issue date: 2001-04-18"
  ],
  "handle": "27239",
  "identifier_other": "etd-04252001-184453",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252001-184453/",
  "identifier_uri": "http://hdl.handle.net/10919/27239",
  "publisher": "Virginia Tech",
  "relation_haspart": "01dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "African-American women",
    "Northwest Louisiana",
    "breast cancer"
  ],
  "title": "The Relationship Between Select Variables and the Breast Cancer Screening Practices of a Convenient Sample of African-American Women From Grambling State University and the Willis-Knighton Neighborhood Clinic",
  "type": "Dissertation"
}