{
  "contributor_author": "Kniel, Kalmia Elisabeth",
  "contributor_committeechair": "Sumner, Susan S.",
  "contributor_committeemember": [
    "Lindsay, David S.",
    "Hackney, Cameron Raj",
    "Pierson, Merle D.",
    "Zajac, Anne M."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:10:43Z",
  "date_adate": "2002-04-26",
  "date_available": "2014-03-14T20:10:43Z",
  "date_issued": "2002-03-28",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Cryptosporidium parvum is a protozoan parasite historically associated with waterborne and more recently foodborne outbreaks of diarrheal illness.  Contamination of certain foods, such as unpasteurized apple cider, with infective oocysts may occur as oocysts are shed in the feces of common ruminants like cattle and deer that graze in and around orchards. Cryptosporidiosis can result in a severe illness for previously healthy individuals and a life-threatening illness in immunocompromised individuals. Disease occurs after the ingestion of small infective oocysts (4 to 5 mm in size).  The relatively thick membrane of the oocysts allows them to be resistant to chlorine and many other environmental pressures, making oocysts difficult to inactivate.  </p><p> In this study, alternative treatments to pasteurization were evaluated for their ability to inhibit C. parvum oocyst viability in fruit juices. Oocyst viability was analyzed with a cell culture infectivity assay, using a human illeocecal cell line (HCT-8) that is most similar to human infection. The percent inhibition of infection by each treatment was determined along with the corresponding log reduction for the treatments found to be most effective. Infection by treated oocysts was compared to that of control untreated oocysts. Cell monolayers were infected with 106 treated oocysts or a series of 10-fold dilutions. Parasitic life stages were visualized using an immunohistochemistry system and 100 microscope fields counted per monolayer. Organic acids and H2O2 were added on a wt/vol basis to apple cider, orange juice, and grape juices. Malic, citric, and tartaric acids at concentrations from 1%-5% inhibited C. parvum infectivity of HCT-8 cells by up to 88%. Concentrations ranging from 0.025%-3% H2O2 were evaluated where addition of 0.025% H2O2 to each juice resulted in a >5 log reduction of C. parvum infectivity as determined with an MPN-based cell culture infectivity assay. Treating apple cider, orange juice, and grape juice with ozone for a time period of 30 seconds up to 15 minutes at 6° and 22°C (0.9 g/L flow rate) inhibited C. parvum viability to > 90% as monitored in the cell culture assay. It is hypothesized that oocyst wall proteins that are necessary for infection are oxidized by the reactive oxygen species generated from the decomposition of the ozone and hydrogen peroxide treatments. These treatments or combinations thereof may offer potential alternatives to traditional pasteurization for fruit juices to successfully inhibit C. parvum viability.</p>",
  "description_provenance": [
    "Author Email: kkniel@vt.edu",
    "Advisor Email: sumners@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:43Z (GMT). No. of bitstreams: 2 body.pdf: 679995 bytes, checksum: cca0af4cae96983228958114de590dc4 (MD5) front.pdf: 19533 bytes, checksum: 64dab2cecf59e243f1d6be33d1861ee6 (MD5)   Previous issue date: 2002-03-28"
  ],
  "handle": "27243",
  "identifier_other": "etd-04252002-091549",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252002-091549/",
  "identifier_uri": "http://hdl.handle.net/10919/27243",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "body.pdf",
    "front.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "viability",
    "apple cider",
    "tartaric acid",
    "citric acid",
    "malic acid",
    "grape juice",
    "cell culture",
    "orange juice",
    "HCT-8 cells",
    "infectivity",
    "hydrogen peroxide",
    "ozone"
  ],
  "title": "Evaluation of chemical treatments and ozone on the viability  of Cryptosporidium parvum oocysts in fruit juices",
  "type": "Dissertation"
}