{
  "contributor_author": "Gunduz, Nazan",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Shultz, Allan R.",
    "Long, Timothy E.",
    "Wolfe, James F.",
    "Riffle, Judy S.",
    "Wightman, James P."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:10:43Z",
  "date_adate": "2001-04-26",
  "date_available": "2014-03-14T20:10:43Z",
  "date_issued": "2001-02-28",
  "date_rdate": "2002-04-26",
  "date_sdate": "2001-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Series of homo- and copolyimides containing controlled degrees of sulfonic acid ion conducting pendant groups have been synthesized from both phthalic (five-) and naphthalic (six-membered) dianhydrides and appropriate wholly aromatic diamines and heterocyclic analogues. The goal is to identify thermally and hydrolytically stable ion conducting polymers (ICP) suitable as proton exchange membranes, PEM, for fuel cells. The candidate ICP's have been synthesized and characterized for molecular weight, chemical composition, film forming properties, thermal transition behavior, boiling water stability, solvent solubility and water absorption and conductivity Commercially available five-membered ring dianhydrides such as 6FDA, BPDA, and six-membered ring dianhydrides such as naphthalene tetracarboxylic dianhydride (NDA) have been used. High molecular weight five-membered ring polyimides were obtained from an equimolar ratio of diamines and dianhydride using a one-pot ester-acid procedure by initially converting the dianhydride to a diester-diacid derivative, followed by the reaction with sulfonated and unsulfonated aryl diamines. The sulfonated diamine monomer was allowed to oligomerize with the diester-diacid of the dianhydride for 2-3 hours, before unsulfonated diamine was charged into the reaction flask. The levels of sulfonation in the polymer backbones were controlled by varying the mole ratio of sulfonated diamine to unsulfonated diamine. For the six-membered ring polyimides, phenolic solvents, e.g. m-cresol, have been used. In general, 4,4?-diamino-biphenyl-2,2?-disulfonic acid (DPS) has been employed as the source of the sulfonated unit. The chemical compositions of both sulfonated and unsulfonated polyimides were obtained using 1H-NMR and FT-IR. The sulfonic acid contents in both diamine monomers, as well as the sulfonated polyimides were also analyzed by acid-base potentiometric titration.  In all cases, high inherent viscosity values and good film forming ability of the polymers were the key indications of high molecular weight. The viscosity values increased with an increase of sulfonation degree in the polymers. This increase of viscosity in these ionomers can be attributed to the increase of polymer chain aggregation with their increasing ionic character. Polymers were fabricated into membranes via solution casting or spin casting from DMAc or m-cresol in order to study film-forming properties. The solution cast dry films of the sulfonated polyimide membranes gave tough, ductile membranes and demonstrated moderate to high water absorption, which is necessary for PEM fuel cells. However, swollen films, in general, showed poor hydrolytic stability which resulted in brittle membranes.   The solution-cast membranes were thermally analyzed to study the effect of the degree of sulfonation on the thermal properties of sulfonated polymers. All the thermograms of the sulfonated polyimide films exhibited a two-step degradation behavior. The first weight loss, observed between 300-400 oC, corresponds to desulfonation in the sulfonated block, and the second weight loss, observed for a temperature around 500 oC or above, corresponds to the polymer backbone degradation. The TGA thermograms indicated that the initial weight losses were steeper for polymers with higher sulfonation degrees. Furthermore, the weight loss temperature of sulfonated polyimides decreased and broadened with increasing sulfonation levels. However, the onset temperature of the first weight loss was independent of the degree of sulfonation. Weight loss data in TGA curves of the sulfonated polymers were used to calculate the degree of sulfonation. Experimental and theoretical values were in good agreement with each other. The sulfonated five-membered polyimide membranes were aged in an air-oven at increasing temperatures (30-220 oC) for 30 min and then titrated with TMAH using non- aqueous potentiometric titration. All the films that were aged up to 220 oC were still completely soluble in DMAc. Moreover, the sulfonic acid groups were unchanged.  In addition, several new flexible sulfonated and unsulfonated diamines and bis(naphthalic anhydride) monomers containing phosphineoxide [-P(O)-] or sulfone [-S(O)2 -] moieties in their structure have been synthesized and characterized with various analytical techniques. The structural design of naphthalic polyimides by incorporating bis(naphthalic anhydrides) was one approach to give a better solubility and processability of their related products.       Development of an iterative approach for defining the optimum degree of sulfonation that will produce the highest ionic conductivity while still retaining other important properties such as flexibility, strength, hydrolytic stability has been a goal of this research and will be discussed in the thesis.",
  "description_provenance": [
    "Author Email: ngunduz@vt.edu",
    "Advisor Email: ashultz@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: wolfe@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: wightman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:43Z (GMT). No. of bitstreams: 1 GunduzDiss.PDF: 4640191 bytes, checksum: 648e0a144920a84e97a838342c68ddea (MD5)   Previous issue date: 2001-02-28"
  ],
  "handle": "27240",
  "identifier_other": "etd-04252001-230115",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252001-230115/",
  "identifier_uri": "http://hdl.handle.net/10919/27240",
  "publisher": "Virginia Tech",
  "relation_haspart": "GunduzDiss.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "naphtalic polyimides",
    "Sulfonated polyimides",
    "conductivity",
    "ion-exchange capacity",
    "sulfonated diamines",
    "fuel cells"
  ],
  "title": "Synthesis and Characterization of Sulfonated Polyimides as Proton Exchange Membranes for Fuel Cells",
  "type": "Dissertation"
}