{
  "contributor_author": "Bryant, Jr., James William",
  "contributor_committeecochair": [
    "de la Garza, Jesus M.",
    "Weyers, Richard E."
  ],
  "contributor_committeemember": [
    "Lefter, James",
    "Reynolds, William T. Jr.",
    "Barker, Richard M."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:10:43Z",
  "date_adate": "2001-04-27",
  "date_available": "2014-03-14T20:10:43Z",
  "date_issued": "2001-04-19",
  "date_rdate": "2002-04-27",
  "date_sdate": "2001-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Concrete construction methods and practices influence the final in-place quality of concrete.  A low permeability concrete mixture does not alone ensure quality in-place concrete.  If the concrete mixture is not transported, placed and cured properly, it may not exhibit the desired durability and mechanical properties.   This study investigates the in-place permeation properties of low permeability concrete bridge decks mixtures used in the Commonwealth of Virginia.  Permeation properties were assessed in both the laboratory and in the field using 4-point Wenner array electrical resistivity, surface air flow (SAF), and chloride ion penetrability (ASTM C 1202-97).    Laboratory test specimens consisted of two concrete slabs having dimensions of 280 x 280 x 102-mm (11 x 11 x 4-in) and twelve 102 x 204-mm (4 x 8-in) cylinders per concrete mixture.  Specimens were tested at 7, 28 and 91-days.  Thirteen cylinder specimens per concrete mixture underwent standard curing in a saturated limewater bath.  The simulated field-curing regimes used wet burlap and plastic sheeting for 3 (3B) and 7 days (7B) respectively and was applied to both slabs and cylinder specimens.   Slab specimen were tested on finished surface using the SAF at 28 and 91 days, and 4-point electrical resistivity measurements at 1, 3, 7, 14, 28 and 91 days.  Compressive strength  (CS) tests were conducted at 7 and 28 days.  Chloride ion penetrability tests were performed at 7, 28, and 91 days.   Statistical analyses were performed to assess the significance of the relationships for the following: Total charge passed and initial current (ASTM C 1202-97); 3B resistivity and 7B resistivity; Slab and cylinder resistivity; Slab resistivity and ASTM C-1202-97 (Total Charge and Initial current); and Surface Air Flow and ASTM C-1202-97.   Field cast specimens, test slabs and cylinders, were cast on-site during concrete bridge deck construction.  The slab dimensions were 30.5 x 40.6 x 10.2-cm (12 x 16 x 4 in.), and the cylinders were 10.2 x 20.4-cm (4 x 8-in).  In-situ SAF and resistivity measurements were taken on the bridge deck at 14, 42 and 91 days.  In-place SAF and resistivity measurements on laboratory field cast slabs were taken at 7, 14 and 28-days.  ASTM C 1202-97 specimens were prepared from field cast cylinders and tested at 7 and 28 and 42-days.   The relationship between in-place permeation measures from field specimens was compared to laboratory data.   Results indicated no difference in chloride ion penetrability (Figures 7.4 and 7.5) and 28-day compressive strength (Figure 7.2) with regard to differing simulated field curing regimes, for same age testing.  There was no significant difference at the 95 % confidence level between 3B resistivity and 7B resistivity specimens tested at the same age (Figures 7.9 and 7.10).    A well defined relationship was observed between total charge passed and initial current (Figure 7-6).  An inverse power function was found to describe the relationship between charge passed/initial current and electrical resistivity for all laboratory mixtures used in this study (Figure 7.17 â   7.22).  Field data was used to validate laboratory established models for charge passed/initial current and electrical resistivity.  Laboratory established models were able to predict 30 to 50% of the field data (Figures 7.31 â   7.34).  Results indicate that the SAF lacked the sensitivity to classify the range of concretes used in this study (Figure 7.24).",
  "description_provenance": [
    "Author Email: jabryan2@vt.edu",
    "Advisor Email: chema@vt.edu",
    "Advisor Email: rweyers@vt.edu",
    "Advisor Email: lefter@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: barker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:43Z (GMT). No. of bitstreams: 2 Appendixes.pdf: 221798 bytes, checksum: 502c036e92b54530d480c774118ec837 (MD5) 01JBryantDissertation.pdf: 632413 bytes, checksum: aff2d40aa5254508100b458c4276d37f (MD5)   Previous issue date: 2001-04-19"
  ],
  "handle": "27241",
  "identifier_other": "etd-04252001-230753",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252001-230753/",
  "identifier_uri": "http://hdl.handle.net/10919/27241",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Appendixes.pdf",
    "01JBryantDissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Permeability",
    "Chloride Ion Penetrability",
    "High-Performance Concrete",
    "Concrete Resistivity",
    "Initial current",
    "Nondestructive Testing"
  ],
  "title": "Non-Invasive Permeability Assessment of High-Performance Concrete Bridge Deck Mixtures",
  "type": "Dissertation"
}