{
  "contributor_author": "Batts, Timothy W.",
  "contributor_committeechair": "Williams, Jay H.",
  "contributor_committeemember": [
    "Ward, Christopher W.",
    "Talmadge, Robert J.",
    "Moore, Laurence D.",
    "Moore, David"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:10:43Z",
  "date_adate": "2002-04-26",
  "date_available": "2014-03-14T20:10:43Z",
  "date_issued": "2002-04-19",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Fatigue during exercise is associated with reduced muscle glycogen.  However, evidence linking glycogen content to fatigue is lacking.  In this study we examined whether reduced muscle glycogen content limited SR function or muscle performance. Two groups of female Sprague-Dawley rats were fasted for 24 hr and exercised for 90 min to reduce muscle glycogen; rats fasted after exercise formed the low glycogen (LG) group.  Rats in the high glycogen (HG) group were allowed free access to food and a 5% sucrose solution. The LG group had 42% less muscle glycogen and 90% less glycogen associated with the sarcoplasmic reticulum (SR) than the HG group. Notably, time to exhaustion during a subsequent treadmill run (21 m/min at 10% grade) was markedly lower in the LG group (35 vs. 166.75 min).  Despite less glycogen, the LG group had a higher SR Ca2+ uptake rate (45%) and Ca2+-stimulated ATPase activity (51%) possibly due to a 33% greater SERCA content. Surprisingly, in situ gastrocnemius initial twitch and tetanic forces were not different between groups although the rates of relaxation were higher in the LG group.  The force responses to fatigue-inducing stimulus trains (20 Hz for 333 ms every 1 sec for 30 min) also were similar for both groups as were twitch and tetanic forces in the fatigued state.  These results suggest that despite reduction in exercise performance, reduced muscle glycogen does not limit muscle performance or SR function.",
  "description_provenance": [
    "Author Email: twbatts@vt.edu",
    "Advisor Email: jhwms@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:43Z (GMT). No. of bitstreams: 1 TWBdissertation.pdf: 1275849 bytes, checksum: 816a715640d575762e594d897d487e06 (MD5)   Previous issue date: 2002-04-19"
  ],
  "handle": "27244",
  "identifier_other": "etd-04252002-105730",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252002-105730/",
  "identifier_uri": "http://hdl.handle.net/10919/27244",
  "publisher": "Virginia Tech",
  "relation_haspart": "TWBdissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fatigue",
    "calcium",
    "SERCA",
    "metabolism"
  ],
  "title": "Effects of Reduced Muscle Glycogen on Sarcoplasmic Reticulum (SR), Muscle and Exercise Performance",
  "type": "Dissertation"
}