{
  "contributor_author": "Scott, Clara James",
  "contributor_committeechair": "Stewart, Daisy L.",
  "contributor_committeemember": [
    "Wildman, Terry M.",
    "LaPorte, James E.",
    "Asselin, Susan B.",
    "Camp, William G."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:10:44Z",
  "date_adate": "2002-04-29",
  "date_available": "2014-03-14T20:10:44Z",
  "date_issued": "2002-04-10",
  "date_rdate": "2003-04-29",
  "date_sdate": "2002-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to determine the perceptions of an expert group of secondary school business teachers regarding whether previously identified competencies for working with students who have disabilities are important for secondary business teachers. The research questions used as a guide to conduct the study were:  1.\tFrom a list of identified competencies compiled from course objectives and literature, to what extent did the members of the expert panel of secondary school business teachers in Virginia and agree on competencies that are essential for business teachers related to working with students who have disabilities?  2.\tWhat comparisons can be made among the ratings of competencies by the members of the expert panel? The data were collected using a modified, two-round Delphi technique. The initial instrument used in Round I was developed by the researcher based on a literature review and authenticated by a validation panel.  The 28 competencies were grouped in eight topical categories to assist in the review by the validation panel.  The 16 members of a nominated Delphi panel were business education teachers from Virginia.  The Delphi panel responded to the competencies using a five point Likert-type scale in which 1 = Strongly Disagree, 2 = Disagree, 3 = Neutral, 4 = Agree, 5 = Strongly Agree.  The Round II instrument consisted of four competencies that did not meet consensus in Round I by having a standard deviation equal to or less than 1, and consensus was achieved on all four competencies in Round II.  Of the original 28 competencies, 27 achieved the predetermined minimum mean score of 3.5 to be considered as important.  The category of classroom management had the highest mean rating of 4.61 on the 5.0 scale. Also, the mean ratings were high for the categories of inclusion (4.31) and individual education programs (4.29).  The two categories that had the lowest mean ratings (3.88) were characteristics of learners and transition services.   Recommendations based on the results were made for improved policy and practice and for further research.",
  "description_provenance": [
    "Author Email: clascott@aol.com",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Advisor Email: laporte@vt.edu",
    "Advisor Email: sasselin@vt.edu",
    "Advisor Email: wgcamp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:44Z (GMT). No. of bitstreams: 1 Dissertation-Scott.pdf: 3241588 bytes, checksum: 2eea625c07b561e67c15bdf46ee736c5 (MD5)   Previous issue date: 2002-04-10"
  ],
  "handle": "27249",
  "identifier_other": "etd-04252002-153349",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252002-153349/",
  "identifier_uri": "http://hdl.handle.net/10919/27249",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-Scott.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "special education",
    "special populations",
    "business education",
    "career and technical education",
    "competencies of business teachers"
  ],
  "title": "Competencies Needed by Business Teachers to Work with Students with Disabilities.",
  "type": "Dissertation"
}