{
  "contributor_author": "Fossa, Jr., Carl Edward",
  "contributor_committeechair": "Davis, Nathaniel J. IV",
  "contributor_committeemember": [
    "Midkiff, Scott F.",
    "Bostian, Charles W.",
    "Varadarajan, Srinidhi",
    "Pratt, Timothy J."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:10:44Z",
  "date_adate": "2002-04-26",
  "date_available": "2014-03-14T20:10:44Z",
  "date_issued": "2002-04-22",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research investigated the efficient utilization of wireless bandwidth in Code Division Multiple Access (CDMA)systems that support multiple data rates with Orthogonal Variable Spreading Factor (OVSF)codes. The specific problem being addressed was that currently proposed public-domain algorithms for assigning OVSF codes make inefficient use of wireless bandwidth for bursty data traffic sources with different Quality of Service (QoS) requirements. The purpose of this research was to develop an algorithm for the assignment of OVSF spreading codes in a Third-Generation (3G)Wideband CDMA (WCDMA)system. The goal of this algorithm was to efficiently utilize limited, wireless resources for bursty data traffic sources with different QoS requirements. \t The key contribution of this research was the implementation and testing of two code sharing techniques which are not implemented in existing OVSF code assignment algorithms. These techniques were termed statistical multiplexing and dynamic code sharing. The statistical multiplexing technique used a shared channel to support multiple bursty traffic sources. The dynamic code sharing technique supported multiple data users by temporarily granting access to dedicated channels. These techniques differed in terms of both complexity and performance guarantees.",
  "description_provenance": [
    "Author Email: cfossa@vt.edu",
    "Advisor Email: midkiff@vt.edu",
    "Advisor Email: ndavis@vt.edu",
    "Advisor Email: bostian@vt.edu",
    "Advisor Email: srinidhi@cs.vt.edu",
    "Advisor Email: tipratt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:44Z (GMT). No. of bitstreams: 1 FossaDissertation.pdf: 1393550 bytes, checksum: 6f96cc21f31a8697494c0a542981806c (MD5)   Previous issue date: 2002-04-22"
  ],
  "handle": "27248",
  "identifier_other": "etd-04252002-143156",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252002-143156/",
  "identifier_uri": "http://hdl.handle.net/10919/27248",
  "publisher": "Virginia Tech",
  "relation_haspart": "FossaDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "IP QoS",
    "wireless communications",
    "WCDMA",
    "OVSF Code Assignment",
    "3G"
  ],
  "title": "Dynamic Code Sharing Algorithms for IP Quality of Service in Wideband CDMA 3G Wireless Networks",
  "type": "Dissertation"
}