{
  "contributor_author": "Evavold, Suellen Ann",
  "contributor_committeechair": "Bohland, James R.",
  "contributor_committeecochair": "Carrig, Colin B.",
  "contributor_committeemember": [
    "Bailey, Carol A.",
    "de Wolf, Peggy L.",
    "Billingsley, Bonnie S."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:10:45Z",
  "date_adate": "2003-04-28",
  "date_available": "2014-03-14T20:10:45Z",
  "date_issued": "2003-04-23",
  "date_rdate": "2004-04-28",
  "date_sdate": "2003-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This qualitative research looks at the relationships between primary caregivers of mentally ill individuals and mental health professionals from the perspective of the caregivers. It reports the stories told to me by family members of mentally ill loved ones who were receiving mental health services in order to raise awareness of the challenges these caretakers face on a daily basis as they tried to support their loved ones in the community and the isolation they experienced because of current attitudes and practices of mental health professionals. Although family members voiced their frustrations at the relationship between themselves and mental health professionals, they were not complaining as much as viewing this study as a forum to vocalize years of frustration and recount numerous personally unsatisfying interactions and relationships with mental health professionals. I used four main research questions to guide the interviews in which I asked family members to share their experiences with mental health professionals. My investigation produced a general narrative of experiences rather than specific details about the treatment of family members. The overall results of my interviews suggest that family members believe a family-centered care approach in the treatment of mentally ill individuals and the respect of mental health care professionals for family members can enhance a mental health professionalâ  s ability to treat individuals with mental illness. These results provide useful insights into the challenges that mental health professionals need to address and highlight some of the changes they need to make for community mental health care programs to work for both the mentally ill and their caregivers.",
  "description_provenance": [
    "Author Email: suelar1011@aol.com",
    "Advisor Email: Bailey@vt.edu",
    "Advisor Email: woofer@vt.edu",
    "Advisor Email: jcarmin@vt.edu",
    "Advisor Email: jayjon@vt.edu",
    "Advisor Email: billingsley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:45Z (GMT). No. of bitstreams: 1 DISSERTATIONEVAV.pdf: 917678 bytes, checksum: 75ecdc6e5eed2508c9d8bd1241af7ae2 (MD5)   Previous issue date: 2003-04-23"
  ],
  "handle": "27255",
  "identifier_other": "etd-04252003-103632",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252003-103632/",
  "identifier_uri": "http://hdl.handle.net/10919/27255",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISSERTATIONEVAV.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Mental Health",
    "Keywords: Families",
    "Qualitative",
    "Family-Centered",
    "Mental Illness"
  ],
  "title": "Family Members of the Mentally Ill and Their Experiences with Mental Health Professionals",
  "type": "Dissertation"
}