{
  "contributor_author": "Greene, Ryan Thomas",
  "contributor_committeechair": "Getz, Hilda M.",
  "contributor_committeemember": [
    "Mathai, Christina",
    "Sporakowski, Michael J.",
    "Lawson, Gerard F.",
    "Cross, Lawrence H."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:44Z",
  "date_adate": "2003-04-30",
  "date_available": "2014-03-14T20:10:44Z",
  "date_issued": "2003-04-24",
  "date_rdate": "2004-04-30",
  "date_sdate": "2003-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this exploratory dissertation was to gather data regarding information technology and the internet as it related to clinical counselors. The findings have the potential to add to the sparse information base regarding use of technology and the internet in clinical counseling practice. The data for this dissertation was collected by surveying a national sample of 534 clinical counselors who were recruited from state clinical counseling organizations.  The survey instrument was done on-line and disseminated via the internet. Of those recruited, 215 counselors were used in the final data analysis. The survey instrument was designed to assess a) the extent to which counselors are knowledgeable of computer technologies, b) the extent to which their clients make use of the internet, and c) the extent to which they believe computer technology contributes to their professional practice.   The study found that clinical counselors in this sample rate themselves highly in terms of internet competence and their knowledge of information technologies. However, despite these high rates of knowledge, counselors are not implementing the internet in their counseling practices at very high rates. This research suggests that clients are increasingly becoming more internet savvy and are using the internet in their own mental health research. As such, counselors need to begin to implement internet components into their practice when appropriate.",
  "description_provenance": [
    "Author Email: rygreene@vt.edu",
    "Advisor Email: cmathai@vt.edu",
    "Advisor Email: eagle1@vt.edu",
    "Advisor Email: glawson@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: LawrenceCross@msn.com",
    "Made available in DSpace on 2014-03-14T20:10:44Z (GMT). No. of bitstreams: 1 dis2.pdf: 1238200 bytes, checksum: b65336a479d4b543b42de1a0aa8394d6 (MD5)   Previous issue date: 2003-04-24"
  ],
  "handle": "27254",
  "identifier_other": "etd-04252003-103331",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252003-103331/",
  "identifier_uri": "http://hdl.handle.net/10919/27254",
  "publisher": "Virginia Tech",
  "relation_haspart": "dis2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "internet",
    "computers",
    "technology",
    "Clinical counselors",
    "counseling"
  ],
  "title": "Clinical Counselors and the Internet: A National Survey Evaluating the Impact of the Internet on the Counseling Profession",
  "type": "Dissertation"
}