{
  "contributor_author": "Robertson, David Whittaker",
  "contributor_committeechair": "Eschenmann, Konrad Kurt",
  "contributor_committeemember": [
    "O'Reilly, Patrick A.",
    "Stewart, Daisy L.",
    "Price, William T. Jr.",
    "Baker, W. Kevin"
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:10:44Z",
  "date_adate": "2002-04-26",
  "date_available": "2014-03-14T20:10:44Z",
  "date_issued": "2002-04-22",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objective of this experiment was to compare three group decision-making strategies and their effects on the group decision-making process. Two of the strategies, Dialectical Inquiry and Devilâ  s Advocacy, were structured while the control condition, Unstructured Consensus Seeking, was non-directed, thus unstructured. The following dependent variables were measured: (a) decision quality, (b) cognitive conflict, (c) affective conflict, and (d) decision commitment. Seventy-two undergraduate participants were randomly assigned across 3 conditions into groups of 6 to solve an interactive group decision task. Thirty-six trained observers were randomly assigned across the same conditions to observe intra-group cognitive and affective conflict and to assess how well the undergraduate participants implemented the structured approaches. The unit of comparison was groups (n = 12). The results of this study were analyzed using analysis of variance and no statistical difference was found between the treatment groups on any of the four dependent variables measured. Cognitive conflict levels and commitment to the decision, while not statistically significant, were higher in the two structured conditions compared to the unstructured control condition. A discussion of these results along with directions for future research is provided.",
  "description_provenance": [
    "Author Email: drobertson@robertsonmarketing.com",
    "Advisor Email: baker@roanoke.edu",
    "Advisor Email: eschmann@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:44Z (GMT). No. of bitstreams: 2 Disserta.doc.pdf: 592356 bytes, checksum: 4d68c902ebb759eb33e2625938fbf215 (MD5) titlecontentetc.pdf: 46654 bytes, checksum: cd5e92f1f17255b72852b70c7631195b (MD5)   Previous issue date: 2002-04-22"
  ],
  "handle": "27252",
  "identifier_other": "etd-04252002-223855",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252002-223855/",
  "identifier_uri": "http://hdl.handle.net/10919/27252",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Disserta.doc.pdf",
    "titlecontentetc.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Group",
    "Consensus",
    "Structure",
    "Decision",
    "Conflict"
  ],
  "title": "A Comparison of Three Group Decision-Making Strategies and Their Effects on the Group Decision-Making Process",
  "type": "Dissertation"
}