{
  "contributor_author": "Matovic, Dragan",
  "contributor_committeechair": "McCleary, Ken W.",
  "contributor_committeemember": [
    "Weaver, Pamela A.",
    "Renaghan, Leo",
    "Murrmann, Suzanne K.",
    "Williams, John A."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:10:44Z",
  "date_adate": "2002-05-06",
  "date_available": "2014-03-14T20:10:44Z",
  "date_issued": "2002-04-17",
  "date_rdate": "2003-05-06",
  "date_sdate": "2002-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The primary objective of this study was to explore the relationship among various market structure constructs (consisting of barriers to entry, competition, growth, and market share) and their potential impact on financial performance. By applying theoretical underpinnings from the disciplines of marketing, strategy and industrial organization economics, and adapting them to the unique characteristics of the U.S. lodging industry, the above constructs were linked to produce the Lodging Market Structure (LMS) Model.  The study consisted of a cross-sectional analysis using a sample of 67 well-recognized hotel brands operating in the U.S. (representing 63 percent of the national guestroom inventory), covering a four-year period between 1996 and 1999.  Correlation and multiple regression analysis were used to examine the hypothesized relationships within the LMS model. This study represented the first comprehensive investigation of the competitive market structure of the U.S. lodging industry.  The key findings of the study indicate that the financial performance of hotel brands in the United States is strongly impacted by competitive market structure. Among the various market structure constructs studied, barriers to entry played the most dominant role in determining the level of financial performance of hotel brands. Based on a strong negative relationship, barriers to entry are very effective in reducing competition in the U.S. lodging industry.  Also, of the constructs studied, barriers to entry had the greatest influence on enhancing the market share of incumbent hotel brands. The growth rate of those incumbent brands has a positive relationship with barriers to entry.  As competition intensifies, the growth rate of hotel brands slows down. Increases in competition are negatively correlated with a brandâ  s market share. Competition has a strong negative relationship with the financial performance of hotel brands. Market share improves as the growth rate of hotel brands increases. As the growth rate of brands increases, profitability also improves.  Likewise, improvements in a hotel brandâ  s market share are positively related to increases in profitability. Lastly, the U.S. lodging market is becoming more competitive, and the industry has reached the mature stage of its lifecycle.",
  "description_provenance": [
    "Author Email: dmatovic@niagarafallsview.com",
    "Advisor Email: mccleary@vt.edu",
    "Advisor Email: weaver@vt.edu",
    "Advisor Email: lmr4@cornell.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: jawill06@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:44Z (GMT). No. of bitstreams: 1 matovic.pdf: 459088 bytes, checksum: 73fca8202f7f716c8539fb59d98bfb4f (MD5)   Previous issue date: 2002-04-17"
  ],
  "handle": "27250",
  "identifier_other": "etd-04252002-163659",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252002-163659/",
  "identifier_uri": "http://hdl.handle.net/10919/27250",
  "publisher": "Virginia Tech",
  "relation_haspart": "matovic.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "financial performance",
    "competition",
    "market structure",
    "lodging brands"
  ],
  "title": "The Competitive Market Structure of the U.S. Lodging Industry and its Impact on the Financial Performance of Hotel Brands",
  "type": "Dissertation"
}