{
  "contributor_author": "Pugh, Dylan Vicente",
  "contributor_committeechair": "Corcoran, Sean Gerald",
  "contributor_committeecochair": "Reynolds, William T. Jr.",
  "contributor_committeemember": [
    "Saraf, Ravi F.",
    "Farkas, Diana",
    "Kampe, Stephen L."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:10:45Z",
  "date_adate": "2003-04-28",
  "date_available": "2014-03-14T20:10:45Z",
  "date_issued": "2003-04-21",
  "date_rdate": "2004-04-28",
  "date_sdate": "2003-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Dealloying is a corrosion process in which one or more elements are selectively removed from an alloy leading to a 3-dimensional porous structure of the more noble element(s).  These porous structures have been known to cause stress corrosion cracking in noble metal alloy systems but more recent interest in using the corrosion process to produce porous metals has developed.  Applications for these structures range from high surface area electrodes for biomedical sensors to use as skeletal structures for fundamental studies (e.g. low temperature heat exchangers or sensitivity of surface diffusivity to chemical environment).  In this work we will review our current understanding of alloy corrosion including our most recent results demonstrating a more accurate method for calculating alloy critical potential based on potential hold experiments.  The critical potentials calculated through the potential hold method were â  0.030VMSE, 0.110VMSE, and 0.175VMSE   for Cu80Pt20, Cu75Pt25 Cu71Pt29 respectively.  We will present the use of porous metals for making surface diffusivity measurements in the Pt systems as a function of chemical environment.  A review of the use of small angle neutron scattering to make accurate measurements of pore size is presented and the sensitivity of pore size to electrolyte, electrolyte composition, applied potential and temperature will be explained.  The production of porous Pt with pore sizes ranging from 2-200nm is demonstrated.",
  "description_provenance": [
    "Author Email: dypugh@vt.edu",
    "Advisor Email: rsaraf@vt.edu",
    "Advisor Email: scg@vt.edu",
    "Advisor Email: diana@vt.edu",
    "Advisor Email: kampe@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:45Z (GMT). No. of bitstreams: 1 DissertationPugh.pdf: 12219688 bytes, checksum: 7a10d4675fcab772f96d2aa8c0012315 (MD5)   Previous issue date: 2003-04-21"
  ],
  "handle": "27256",
  "identifier_other": "etd-04252003-104756",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252003-104756/",
  "identifier_uri": "http://hdl.handle.net/10919/27256",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationPugh.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "surface diffusivities",
    "selective dissolution",
    "small angle neutron scattering",
    "nanoporous metals"
  ],
  "title": "Nanoporous Platinum",
  "type": "Dissertation"
}