{
  "contributor_author": "Mykerezi, Pavli K.",
  "contributor_committeecochair": [
    "Finch, Curtis R.",
    "Crunkilton, John R."
  ],
  "contributor_committeemember": [
    "Eschenmann, Konrad Kurt",
    "Price, William T. Jr.",
    "Clouse, James P."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:46Z",
  "date_adate": "2003-04-28",
  "date_available": "2014-03-14T20:10:46Z",
  "date_issued": "2003-04-09",
  "date_rdate": "2004-04-28",
  "date_sdate": "2003-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Potential Contribution of Vocational and Technical Education to the Future  Social-Economic Development of Albania. by Pavli K. Mykerezi (ABSTRACT) The purpose of this study was to determine the potential contribution of vocational and technical education to the future social-economic development of Albania. To achieve this purpose, a panel of experts was involved in the formulation of statements and the determination of each statement's value as a contributor to future social-economic development.  \tThis study was conducted using a Modified Delphi Technique to identify and prioritize statements generated as part of this research methodology. The study was accomplished through solicitation of responses from a 17 member panel of experts. The panel consisted of individuals representing government service, non-government organizations, Albanian educators, and international educators involved in different educational projects in Albania in the last ten years.  \tEach of the experts was asked to identify statements that vocational and technical education can contribute to the future social-economic development of Albania. Responses provided by the panel members and the statements added by the researcher were edited and organized into a list with 71 statements. The panel of experts was asked to rate this list and means and standard deviations were calculated for each statement. The criterion to determine the importance of statements was defined as a mean being equal or higher than 3.5 on a 5-point Likert scale. The criteria employed to determine panel consensus was defined as a standard deviation being equal or less than 1.00. From the list of 71 statements, 68 were concluded to have been important and have reached consensus by the panel. The 68 statements on which the panel of experts reached consensus were rank ordered according to their means. A content analysis of the ranked statements revealed that statements clustered around common themes. These themes included VTE's Planning Procedures and Policy, Program and Institutional Development, Values and Work Ethics, Productivity, Communication and Analytical Skills, and Linkages. From these results, it was concluded that the process for the development of an effective VTE program that will contribute to the social-economic development of Albania will be long and complex. This process will involve many people, agencies, and organizations all working together. Hence, it was recommended that the Ministry of Education and the Ministry of Labor and Social Affairs take the lead in this process.",
  "description_provenance": [
    "Author Email: pmykerez@vt.edu",
    "Advisor Email: escmann@vt.edu",
    "Advisor Email: crfinch@vt.edu",
    "Advisor Email: jcrunkil@vt.edu",
    "Advisor Email: wprice@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:46Z (GMT). No. of bitstreams: 2 Agenda.pdf: 111217 bytes, checksum: 9c387638beb7d28d0d8c6066a25d3fa0 (MD5) final.pdf: 1972049 bytes, checksum: b588eb40d18db8c5bcf894e9f27eeabc (MD5)   Previous issue date: 2003-04-09"
  ],
  "handle": "27259",
  "identifier_other": "etd-04252003-153149",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252003-153149/",
  "identifier_uri": "http://hdl.handle.net/10919/27259",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Agenda.pdf",
    "final.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Modefied Delphi Technique",
    "policy",
    "development"
  ],
  "title": "The Potential Contribution of Vocational and Technical Education to the Future Social-Economic Development of Albania",
  "type": "Dissertation"
}