{
  "contributor_author": "Pasquale, Anthony J.",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "Riffle, Judy S.",
    "Anderson, Mark R.",
    "McGrath, James E.",
    "Allen, Robert D."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:10:44Z",
  "date_adate": "2002-04-26",
  "date_available": "2014-03-14T20:10:44Z",
  "date_issued": "2002-04-22",
  "date_rdate": "2003-04-26",
  "date_sdate": "2002-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "High molecular weight star-shaped polystyrenes were prepared via the coupling of 2,2,6,6-tetramethyl-1-piperidinyloxy (TEMPO) terminated polystyrene oligomers with divinylbenzene (DVB) in m-xylene at 138 °C.  Linear polystyrene oligomers (Mn = 19,300 g/mol, Mw/Mn = 1.10) were synthesized in bulk styrene using benzoyl peroxide in the presence of TEMPO at approximately 130 °C.  In situ mid-infrared spectroscopy was successfully utilized to follow initiation, monomer conversion, and polymer formation.   Real-time data allowed for the determination of apparent rate constants of 2.1E-5 s-1 at 132 °C and 1.2E-5 s-1 at 126 °C from the profile of the decaying styrene vinyl carbon-hydrogen (=CH2) absorbance at 907 cm-1.  Coupling of the TEMPO terminated oligomers under optimum conditions resulted in a compact and dense product with a number average molecular weight exceeding 300,000 g/mol (Mw/Mn = 3.03) after 24 h, suggesting the formation of relatively well-defined star-shaped polymers.  Synthetic factors that affected the molecular weight, yield, and composition of maleic anhydride (MAH), norbornene (Nb), and tert-butyl 5-norbornene-2-carboxylate (NbTBE) terpolymers were investigated.  Pseudo first order kinetic analysis using in situ FTIR indicated that the observed rate of reaction was a strong function of the Nb/NbTBE ratio with a maximum of 6.7E-5 s-1 for a 50/0/50 Nb/NbTBE/MAH monomer ratio and a minimum of 1.1E-5 s-1 for a 0/50/50 Nb/NbTBE/MAH ratio.  Polymer yields were also observed to be a function of the Nb/NbTBE ratio and also decreased with increasing NbTBE.  Calculated work of adhesion values (Wadh) values were observed to increase as the content of NbTBE was increased.  193 nm photoresist formulations incorporating polymers with high NbTBE content showed increased imaging performance using 193 nm light and successfully produced sharp and defined features as small as 110 nm, which was demonstrated via scanning electron microscopy (SEM).  Additional functionality was introduced via the copolymerization of MAH with several norbornene (Nb) derivatives that were synthesized from facile Diels-Alder cycloaddition reactions of cyclopentadiene with a-olefins containing electron withdrawing groups.  Subsequent hydrolysis of the anhydride offered further versatility and provided an avenue to introduce aqueous base solubility into Nb/MAH copolymers.",
  "description_provenance": [
    "Author Email: ajpasquale@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: mark.anderson@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: rdallen@almaden.ibm.com",
    "Made available in DSpace on 2014-03-14T20:10:44Z (GMT). No. of bitstreams: 1 AJP_dissertation.pdf: 3812250 bytes, checksum: 714a3e61806e6dd241b6776526694bb3 (MD5)   Previous issue date: 2002-04-22"
  ],
  "handle": "27251",
  "identifier_other": "etd-04252002-212246",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252002-212246/",
  "identifier_uri": "http://hdl.handle.net/10919/27251",
  "publisher": "Virginia Tech",
  "relation_haspart": "AJP_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "maleic anhydride",
    "nitroxide mediated free radical polymerization",
    "alternating copolymerization",
    "norbornene",
    "in situ FTIR spectroscopy"
  ],
  "title": "Synthesis and Characterization of Multi-Component Polymeric Materials Prepared via Free Radical Polymerization",
  "type": "Dissertation"
}