{
  "contributor_author": "Look, Mary V.",
  "contributor_committeechair": "Kronenberg, Philip S.",
  "contributor_committeemember": [
    "Rees, Joseph V.",
    "Nonnemaker, Lynn",
    "Herdman, Terry L.",
    "Wolf, James F."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:10:44Z",
  "date_adate": "2003-04-28",
  "date_available": "2014-03-14T20:10:44Z",
  "date_issued": "2003-04-14",
  "date_rdate": "2004-04-28",
  "date_sdate": "2003-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examined how complexity theory might offer insight into the behavior of a population of large-scale networked organizational groups. Academic medical centers (AMCs), a large-scale social and policy system that plays a key role in the education of physicians, the conduct of research, and the provision of specialized clinical care, were chosen as an example to demonstrate the enhanced understanding that can be obtained from the application of complexity theory. Graphical and nonlinear mathematical tools were chosen to place this research study in contrast to studies that metaphorically apply the concepts of complexity theory to social systems.   Complexity science suggests that AMCs will demonstrate both nonlinearity and the emergence of patterned behaviors characteristic of self-organization in complex adaptive systems. Changes in the fiscal environment of AMCs, influenced by federal policy and the health care delivery market, were hypothesized to be among the factors that mediated changes in AMCsâ   activities and organizational relationships during a twenty-year period. The collection and examination of multiple indicators within the framework of a study model allowed development of a rich description of the AMC system and identification of patterned behaviors. Graphical analysis was used to identify underlying periodic and chaotic attractors in the AMC system. A logistic equation was used to confirm the presence of nonlinearity.   The presence of nonlinearity and the emergence of patterned behavior within schools in different managed care market groups suggested that it is appropriate to treat the population of AMCs as a complex adaptive system. The results of this research study also showed that AMCs have responded to the rise of managed care in the health care delivery marketplace by leveraging their institutional strengths. Identification of nonlinear properties offers a new perspective for understanding the behavior of a population of networked organizations, the management of large-scale systems, strategic planning, and policy formulation. Until researchers and managers recognize the coexistence of nonlinear and linear processes in social systems, they will make decisions on the basis of incomplete information.",
  "description_provenance": [
    "Author Email: mlook@qrc.com",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: philkvt@vt.edu",
    "Advisor Email: Lynn.Nonnemaker@hhs.gov",
    "Advisor Email: herdman@origin2.icam.vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:44Z (GMT). No. of bitstreams: 1 dissertation.pdf: 1504159 bytes, checksum: b54f9bac8ffef590b74ba84ae203daed (MD5)   Previous issue date: 2003-04-14"
  ],
  "handle": "27253",
  "identifier_other": "etd-04252003-081944",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252003-081944/",
  "identifier_uri": "http://hdl.handle.net/10919/27253",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Managed Care",
    "Academic Medical Centers",
    "Strategic Policy Systems",
    "Complexity Theory",
    "Nonlinear Dynamic Systems"
  ],
  "title": "Policy Systems and Their Complexity Dynamics:  Academic Medical Centers and Managed Care Markets",
  "type": "Dissertation"
}