{
  "contributor_author": "Burke, Dawne Raines",
  "contributor_committeecochair": [
    "Boucouvalas, Marcie",
    "Stubblefield, Harold W."
  ],
  "contributor_committeemember": [
    "Wiswell, Albert W.",
    "McKinney, Richard I.",
    "Cline, Marvin Gerald"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:47Z",
  "date_adate": "2004-04-28",
  "date_available": "2014-03-14T20:10:47Z",
  "date_issued": "2004-04-14",
  "date_rdate": "2005-04-28",
  "date_sdate": "2004-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT  This historical study investigated the genesis, unfolding, contributions, and demise issues associated with the institution of Storer College.  The primary goal was to produce an institutional narrative of Storer College that acknowledged the depth and dimension of its 90-year history, and recognized its three utmost administrators: the Doctors Brackett, McDonald, and McKinney.  The inquiry incorporated a broad range of primary and secondary sources, including previously untapped archival resources, in reconstructing the institutionâ  s narrative.  The study is predominantly set against the divergence of compounding social, economic, and political forces, including its relationship with the State of West Virginia that outlined the institutionâ  s development over time.  The global questions that framed the study were: What was Storer College?  How did it change over time?  Following the Civil Warâ  s destruction, the nation underwent an extended period of reconstruction.  Storer College grew out of several efforts exerted by the Free Will Baptists, a northern denomination under the aegis of the Northern Baptist Convention, who believed that education should be the primary focus for improving freedmen in the Shenandoah Valley.  Storer College was first established in West Virginia by the Free Will Baptists Home Mission Society through its Shenandoah Mission center, as the Harperâ  s Ferry Mission School in 1865.  In time, the institution experienced four overlapping developmental phases: (a) Mission School, 1865 â   1867, (b) Secondary Division, 1867 â   1884, (c) Secondary Expansion Division, 1884 â   1921, and (d) Collegiate Division, 1921 â   1955 before its closure in the wake of the 1954 Brown et al. v. Board of Education, Topeka, Kansas decision.  With the outgoing class of 1955, the institution was ultimately dismantled and subsumed under the federal aegis of the United States Department of Interior by 1960. Despite limited funding, Storer College functioned as a social change agent since through its institutional development it correspondingly contributed to the individual development of its studentsâ   literacy, morality, self-dependency, self-advocacy, and self-assertion.  These collective actions were among the first efforts toward community-building between and among the African-American community and consequently the communityâ  s greater relationship with the American society.",
  "description_provenance": [
    "Author Email: dburke@breezelink.net",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: awiswell@vt.edu",
    "Advisor Email: harold.stubblefield@worldnet.att.net",
    "Advisor Email: Richmc0741@aol.com",
    "Advisor Email: mgcline@aol.com",
    "Made available in DSpace on 2014-03-14T20:10:47Z (GMT). No. of bitstreams: 5 4SECTIONADXD.pdf: 87732 bytes, checksum: 9a5a239da3104d2b681d9da60a6578ef (MD5) 1SECTIONTitleCopyDed.pdf: 105868 bytes, checksum: 39ca865495e892f0b99ec511950f6bda (MD5) 2SECTIONTables.pdf: 141380 bytes, checksum: ae4a94864998e77e06a9abf4debce6e1 (MD5) 5SECTIONBibVitae.pdf: 210470 bytes, checksum: 67b56a02b03343269c31c71b266a67d1 (MD5) 3SECTIONBodyText.pdf: 1367918 bytes, checksum: 0b65f5d97e73ce131fa705a682eff4f8 (MD5)   Previous issue date: 2004-04-14"
  ],
  "handle": "27264",
  "identifier_other": "etd-04252004-173337",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252004-173337/",
  "identifier_uri": "http://hdl.handle.net/10919/27264",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "4SECTIONADXD.pdf",
    "1SECTIONTitleCopyDed.pdf",
    "2SECTIONTables.pdf",
    "5SECTIONBibVitae.pdf",
    "3SECTIONBodyText.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "institutional narrative",
    "American education",
    "African-American studies",
    "Civil War history",
    "philanthropy"
  ],
  "title": "Storer College: A Hope for Redemption in the Shadow of Slavery, 1865 - 1955",
  "type": "Dissertation"
}