{
  "contributor_author": "Chamberlain, Mark E",
  "contributor_committeecochair": [
    "Twiford, Travis W.",
    "Burge, Penny L."
  ],
  "contributor_committeemember": [
    "Parson, Stephen R.",
    "Shackelford, Pat",
    "Davis, S. John"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:46Z",
  "date_adate": "2004-04-29",
  "date_available": "2014-03-14T20:10:46Z",
  "date_issued": "2004-04-22",
  "date_rdate": "2004-04-29",
  "date_sdate": "2004-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Untitled Document</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <div class=Section1>   <p class=MsoNormal align=center style='text-align:center;line-height:150%'>Â </p>   <p class=MsoNormal style='text-indent:.5in;line-height:150%'>Henrico County Public Schools (HCPS) deployed laptop computers to over 23,000 middle and high school students in the division. Access to the computer network was through a wireless system that provided convenient and unlimited classroom arrangements without the restrictions required with cabled computer systems. Because each student was assigned a computer and assisted in obtaining low cost Internet service at home, this initiative also provided 24-hour access to digital information. This program was called the Teaching and Learning Initiative (TLI). Division leaders were striving to utilize this initiative not only to provide its students and teachers with 21st-century technologies that included access to the latest digital information, but also to change pedagogical practices in HCPS to a student-centered model. The purpose of this study was to determine the perceptions of students about the influence that this initiative has had on their classroom experiences. Secondary purposes included student perceptions of pedagogical changes in instruction, information acquisition, and recommendations that students would have for improving the TLI. Literature on computer use in schools is reviewed as it related to the HCPSâ   laptop initiative, as well as the importance of giving students a voice in change processes. Through a qualitative analysis of interviews with student focus groups from six of the 11 middle schools in the division, middle school studentsâ   perceptions of their experiences in the TLI were obtained. Analysis of focus group interviews, classroom observations, and studentsâ   logs of classroom activities provided triangulation. Data were analyzed inductively and results emerged organized by subcategories, categories, and themes. Results were reported in narrative form and explanatory tables, with an emphasis on findings related to the research questions of this study focusing on studentsâ   experiences in the TLI. Conclusions derived from this study were: Middle school students were keenly aware of their educational experiences and clearly articulated their thoughts; studentsâ   educational experiences changed during the TLI; some elements of constructivist classrooms were supported by laptop use, but not collaborative work; students obtained information from the Internet and websites, using textbooks less; computer reliability was a concern; cost to students for repairs raised equity issues; and benefits of the TLI went beyond the classroom.  </p> </div> <span style='font-size:12.0pt;mso-bidi-font-size:10.0pt;line-height:200%; font-family:Times;mso-fareast-font-family:Times;mso-bidi-font-family:\"Times New Roman\"; mso-ansi-language:EN-US;mso-fareast-language:EN-US;mso-bidi-language:AR-SA'><br clear=all style='page-break-before:always;mso-break-type:section-break'> </span></body> </html>",
  "description_provenance": [
    "Author Email: mechambe@henrico.k12.va.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: pjl15829@adelphia.net",
    "Advisor Email: janck@rdn.com",
    "Advisor Email: burge@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:46Z (GMT). No. of bitstreams: 1 CHAMBE~5.pdf: 400001 bytes, checksum: beca8d7720a879ec14bbe3fdcc30f37a (MD5)   Previous issue date: 2004-04-22"
  ],
  "handle": "27261",
  "identifier_other": "etd-04252004-103734",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252004-103734/",
  "identifier_uri": "http://hdl.handle.net/10919/27261",
  "publisher": "Virginia Tech",
  "relation_haspart": "CHAMBE~5.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Instruction",
    "Reform",
    "Laptop",
    "Student-centered instruction"
  ],
  "title": "Middle School Students' Perceptions of the Teaching and Learning Initiative: Laptops for Every Student",
  "type": "Dissertation"
}