{
  "contributor_author": "Smith, James Joseph",
  "contributor_committeecochair": [
    "Fortune, Jimmie C.",
    "Twiford, Travis W."
  ],
  "contributor_committeemember": [
    "Salmon, Richard G.",
    "Smith, John",
    "Rogers, Catherine S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:47Z",
  "date_adate": "2005-04-27",
  "date_available": "2014-03-14T20:10:47Z",
  "date_issued": "2005-04-20",
  "date_rdate": "2006-04-27",
  "date_sdate": "2005-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Abstract Researchers and reformers have suggested that school climate is an important aspect of effective schools (Hoy & Hannum, 1997, p. 290). Literature also suggests that effective schools have a positive school climate (Chrispeels, 1990).  The purpose of this study is to determine if the climate of schools affects the student achievement in school divisions in the Commonwealth of Virginia.  The construct study conducted herein relies exclusively upon data collected by the Virginia Department of Education (VDOE) and reported in the Discipline, Crime and Violence Incidents annual report (DCVI), the Free and Reduced Lunch report, and the Truancy report to form a climate index (CI). A Hierarchical Cluster analysis was used to determine relationships between school division climate, as measured by the CI, and student achievement, as measured by the Virginia Standards of Learning (SOL) Tests, in school divisions in the Commonwealth of Virginia. Based on the CI, there is a relationship between school division climate and student achievement in English/reading, mathematics, history/social science, and science in the Commonwealth of Virginia. Moreover, incidents of disorderly conduct combined with the number of students who receive free and reduced lunch are the best predictors of student achievement.",
  "description_provenance": [
    "Author Email: jasmit25@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: jsmith@vbschools.com",
    "Advisor Email: crogers@vbschools.com",
    "Made available in DSpace on 2014-03-14T20:10:47Z (GMT). No. of bitstreams: 1 SchoolDivisionClimate.pdf: 527270 bytes, checksum: 6de7fee01e07195b665660a265c89f32 (MD5)   Previous issue date: 2005-04-20"
  ],
  "handle": "27267",
  "identifier_other": "etd-04252005-093016",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252005-093016/",
  "identifier_uri": "http://hdl.handle.net/10919/27267",
  "publisher": "Virginia Tech",
  "relation_haspart": "SchoolDivisionClimate.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Accreditation",
    "Class-size.",
    "Student Achievement",
    "Socioeconomic Status and School Climate"
  ],
  "title": "The Relationship Between School Division Climate and Student Achievement of School Divisions in the Commonwealth of Virginia",
  "type": "Dissertation"
}