{
  "contributor_author": "Stemple, Jr., James David",
  "contributor_committeecochair": [
    "Parson, Stephen R.",
    "Burge, Penny L."
  ],
  "contributor_committeemember": [
    "Constantino, Steve",
    "Twiford, Travis W.",
    "Sanders, Mark E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:46Z",
  "date_adate": "2004-04-29",
  "date_available": "2014-03-14T20:10:46Z",
  "date_issued": "2004-04-22",
  "date_rdate": "2004-04-29",
  "date_sdate": "2004-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "High quality effective leadership for high schools is critical due to the social, political, and economic pressures placed upon public education. Due to these increasing pressures and ever higher accountability placed on principals, job satisfaction may decrease. The principalâ  s job is complex and demanding; however, thoughtful examination of the principalship and the variables that contribute to job satisfaction can better equip school district leaders to retain principals. Researching aspects of job satisfaction is important because a job is not merely life sustaining, but positively life-enhancing, and enriching (Darboe, 2003). Through my associations with other principals, I see many administrators who appear to be unsatisfied in their jobs. As a result of my interests and experiences, I have conducted a study, based on a previous study completed at the middle school level by JoAnn Newby (1999), to explore job satisfaction among high school principals in Virginia. For this study 183 high school principals in Virginia responded to an internet survey using the Minnesota Satisfaction Questionnaire (MSQ) to explore the specific variables of gender, age, salary, number of assistant principals, years as principal, tenure, school socio-economic status, school size, and school accreditation status to determine which variables may or may not contribute to job satisfaction. A multiple regression was utilized to determine the relative impact that the criterion variables in predicting job satisfaction. The findings of this study suggest that high school principals in Virginia were generally satisfied with their jobs. The principals who responded were least satisfied with their level of compensation and most satisfied with being of service to others. The step-wise multiple regression completed for this study revealed that the significant predictors of job satisfaction were the number of assistant principals and Virginia Accreditation status. Those principals whose schools were fully accredited and those principals who had three assistant principals were significantly more satisfied than those principals whose schools were not fully accredited and those principals who had less than or more than three assistants. Results from this study are useful as they serve as a motivating force for those who are trying to gain more information about the high school principalship in Virginia.",
  "description_provenance": [
    "Author Email: jstemple@vt.edu",
    "Advisor Email: s.constantino@verizon.net",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: msanders@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:46Z (GMT). No. of bitstreams: 1 Stempleetd[1].pdf: 275943 bytes, checksum: 6509a19c6e93364546a7da9da87f615c (MD5)   Previous issue date: 2004-04-22"
  ],
  "handle": "27262",
  "identifier_other": "etd-04252004-104719",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252004-104719/",
  "identifier_uri": "http://hdl.handle.net/10919/27262",
  "publisher": "Virginia Tech",
  "relation_haspart": "Stempleetd[1].pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Job Satisfaction",
    "High School Principals"
  ],
  "title": "Job Satisfaction of High School Principals in Virginia",
  "type": "Dissertation"
}