{
  "contributor_author": "Valimont, Robert Brian",
  "contributor_committeechair": "Casali, John G.",
  "contributor_committeemember": [
    "Kleiner, Brian M.",
    "Lancaster, Jeff A.",
    "Lockhart, Thurmon E.",
    "Trani, Antonio A."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:10:48Z",
  "date_adate": "2006-05-08",
  "date_available": "2014-03-14T20:10:48Z",
  "date_issued": "2006-04-20",
  "date_rdate": "2009-05-08",
  "date_sdate": "2006-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Researchers have long known that general aviation (GA) aircraft exhibit some of the most intense and potentially damaging sound environments to a pilotâ  s hearing. Yet, another potentially more ominous result of this noise-intense environment is the masking of the radio communications. Radio communications must remain intelligible, as they are imperative to the safe and efficient functioning of the airspace, especially the airspace surrounding our busiest airports, Class B and Class C. However, the high amplitude, low frequency noise dominating the GA cockpit causes an upward spreading of masking with such inference that it renders radio communications almost totally unintelligible, unless the pilot is wearing a communications headset. Even with a headset, some researchers have stated that the noise and masking effects overcome the headset performance and still threaten the pilotâ  s hearing and overall safety while in the aircraft.  \tIn reaction to this situation, this experiment sought to investigate the effects which active noise reduction (ANR) headsets have on the permissible exposure levels (PELs), speech intelligibility, workload, and ultimately the pilotâ  s performance inside the cockpit. Eight instrument-rated pilot participants flew through different flight tasks of varying levels and types of workload embedded in four 3.5 hour flight scenarios while wearing four different headsets. The 3.5 hours were considered long duration due the instrument conditions, severe weather conditions, difficult flight tasks, and the fatiguing effects of a high intensity noise environment. The noise intensity and spectrum in the simulator facility were specifically calibrated to mimic those of a Cessna 172. Speech intelligibility of radio communications was modified using the Speech Transmission Index (STI), while measures of flight performance and workload were collected to examine any relationships between workload, speech intelligibility, performance, and type of headset. \tIt is believed that the low frequency attenuation advantages afforded by the ANR headset decreased the signal-to-noise ratio, thereby increasing speech intelligibility for the pilot. This increase may positively affect workload and flight performance. Estimates of subjective preference and comfort were also collected and analyzed for relevant relationships. \tThe results of the experiment supported the above hypotheses. It was found that headsets which incorporate ANR technology do increase speech intelligibility which has a direct inverse influence on workload. For example, an increase in speech intelligibility is seen with a concomitant decrease in pilot workload across all types and levels of workload. Furthermore, flight task performance results show that the pilotâ  s headset can facilitate safer flight performance. However, the factors that influence performance are more numerous and complex than those that affect speech intelligibility or workload. Factors such as the operational performance of the communications system in the headset, in addition to the ANR technology, were determined to be highly influential factors in pilot performance.  \tThis study has concluded that the pilotâ  s headset has received much research and design attention as a noise attenuation device. However, it has been almost completely overlooked as a tool which could be used to facilitate the safety and performance of a general aviation flight. More research should focus on identifying and optimizing the headset components which contribute most to the results demonstrated in this experiment. The pilotâ  s headset is a component of the aviation system which could economically improve the safety of the entire system.",
  "description_provenance": [
    "Author Email: rvalimon@vt.edu",
    "Advisor Email: jcasali@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: jlancast@vt.edu",
    "Advisor Email: lockhart@vt.edu",
    "Advisor Email: vuela@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:48Z (GMT). No. of bitstreams: 1 Valimont_Dissertation.pdf: 3120639 bytes, checksum: 861c43fd45031591b9986eb663cb8553 (MD5)   Previous issue date: 2006-04-20"
  ],
  "handle": "27277",
  "identifier_other": "etd-04252006-110703",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252006-110703/",
  "identifier_uri": "http://hdl.handle.net/10919/27277",
  "publisher": "Virginia Tech",
  "relation_haspart": "Valimont_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "pilot performance",
    "headset design",
    "speech intelligibility",
    "active noise reduction",
    "mental workload",
    "flight simulation"
  ],
  "title": "Active Noise Reduction Versus Passive Designs in Communication Headsets: Speech Intelligibility and Pilot Performance Effects in an Instrument Flight Simulation",
  "type": "Dissertation"
}