{
  "contributor_author": "McLaurin, Shamla L.",
  "contributor_committeechair": "Johnson, Scott W.",
  "contributor_committeemember": [
    "Benningfield, Anna Beth",
    "Piercy, Fred P.",
    "Galway, Alison"
  ],
  "contributor_department": "Marriage and Family Therapy",
  "date_accessioned": "2014-03-14T20:10:48Z",
  "date_adate": "2005-04-27",
  "date_available": "2014-03-14T20:10:48Z",
  "date_issued": "2005-04-01",
  "date_rdate": "2005-04-27",
  "date_sdate": "2005-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As various forms of interpersonal family violence receive more attention in the literature, sibling abuse is still in the background. Despite the increasing knowledge about the prevalence, causes, and effects of sibling abuse, many of us continue to relegate it to a childhood occurrence. Sibling abuse symptoms continue to go unrecognized and its demoralizing effects continue to be ignored (Wiehe, 1990). Minimization and denial of sibling abuse have also contributed to constraining the extent of knowledge related to this phenomenon. The present study seeks to add to the existing research confirming the existence of sibling victimization and its long-term impacts.   This study has two primary purposes: 1) to capture the beliefs, feelings, and firsthand account of the abusive sibling experiences from the perspective of victims, and 2) to investigate the potential learned responses associated with sibling abuse and their possible impact on adult relationships by exploring participantsâ   emotional and relational histories, and belief systems. This study presents data taken from a clinical sample of six adult female sibling abuse survivors. Individual semi-structured interviews were conducted and data analyzed using cross case analysis, constant comparison, and analytic induction techniques. Data suggests the long-term impacts of learned responses associated with sibling abuse can be detrimental to both interpersonal relationships and mental health. Emergent themes related to family functioning and environment and resiliency after abuse are also presented. Implications of findings and suggestions for future research are discussed.",
  "description_provenance": [
    "Author Email: slmclaurin@hotmail.com",
    "Advisor Email: scottwj@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: agalway@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:48Z (GMT). No. of bitstreams: 1 mclaurindissertation2005.pdf: 627363 bytes, checksum: 58b75fba3f64775c7ad39be7297699ac (MD5)   Previous issue date: 2005-04-01"
  ],
  "handle": "27272",
  "identifier_other": "etd-04252005-155705",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252005-155705/",
  "identifier_uri": "http://hdl.handle.net/10919/27272",
  "publisher": "Virginia Tech",
  "relation_haspart": "mclaurindissertation2005.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "family systems",
    "mental health",
    "domestic violence",
    "sibling abuse",
    "learned helplessness"
  ],
  "title": "Childhood Experiences of Sibling Abuse: An investigation into learned helplessness",
  "type": "Dissertation"
}