{
  "contributor_author": "Hale, Kimberly Danielle",
  "contributor_committeechair": "Barksdale, Mary Alice",
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Niles, Jerome A.",
    "Sawyers, Janet K."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:48Z",
  "date_adate": "2005-04-26",
  "date_available": "2014-03-14T20:10:48Z",
  "date_issued": "2005-04-21",
  "date_rdate": "2008-04-26",
  "date_sdate": "2005-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Many aspects of teaching involve the personal dimension of teaching and yet this dimension is often neglected and overlooked as we prepare teachers and sustain teachers in their work.  The personal beliefs, attitudes and emotions of teachers often determine the decisions that teachers make in their classrooms.  Increasingly, educational researchers have found that effective teachers are aware of this dimension.  The aim of this study was to better understand how teachers' self perceptions and understandings of teaching evolve and change across their professional lives and what events contribute to these understandings.  A series of in-depth individual interviews were conducted with six early career public education teachers who were also alumni of the graduate teacher education program at Virginia Tech.  Interview data were supplemented with a review of artifacts from preservice teacher education program, visual representations of teacher identity development at various stages over the career of teaching and a timeline of significant events encountered during the teaching career.  Results of this research suggest that teachers' understandings of the multiple complexities of teaching deepen within the first years of teaching; teaching is emotional work; and the context of teaching heavily influences teachers' practice of teaching regardless of their beliefs about teaching.  Suggestions for university teacher education programs and local school districts are discussed.",
  "description_provenance": [
    "Author Email: kdhale@vt.edu",
    "Advisor Email: mbarksda@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:48Z (GMT). No. of bitstreams: 1 kimhaledissertation.pdf: 3292442 bytes, checksum: 33a645d625b1ee170ebd77a9dbdb1f52 (MD5)   Previous issue date: 2005-04-21"
  ],
  "handle": "27273",
  "identifier_other": "etd-04252005-161844",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252005-161844/",
  "identifier_uri": "http://hdl.handle.net/10919/27273",
  "publisher": "Virginia Tech",
  "relation_haspart": "kimhaledissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "personal dimension of teaching",
    "teacher identity",
    "teacher development",
    "emotions of teaching"
  ],
  "title": "Identity Formation and the Development of Self in Early Career Teachers",
  "type": "Dissertation"
}