{
  "contributor_author": "Krause, Richard Alan",
  "contributor_committeechair": "Kowalewski, Michal",
  "contributor_committeemember": [
    "Read, James Fredrick",
    "Miller, Arnold I.",
    "Xiao, Shuhai",
    "Scheckler, Stephen E."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:10:48Z",
  "date_adate": "2006-05-08",
  "date_available": "2014-03-14T20:10:48Z",
  "date_issued": "2006-04-14",
  "date_rdate": "2007-05-08",
  "date_sdate": "2006-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The fossil record is the primary source of information on the history of life.  As such, it is important to understand the limitations of this record.  One critical area in which there is still much work to be done is in understanding how the fossil record, and our interpretation of it, may be biased. <p> Herein, the fidelity between the life and death assemblage of an extant brachiopod with respect to morphological variability is studied using geometric morphometrics.  The results from several analyses confirm a high degree of morphological variability with little change in mean shape between the living and sub-fossil assemblage.  Additionally, there is no evidence of distinct morphogroups in either assemblage.  These trends persist at all depths and size classes indicating that this species could be recognized as a single, rather than multiple, species if only fossil data were available. <p> The second chapter involves the recognition and quantification of a worker bias in monographs of brachiopods and bivalves.  Most specimens studied came from the 65th to 69th percentile of their species' bulk-collected size-frequency distribution.  This indicates a significant bias toward monograph specimens that are larger than the mean size of the bulk sample.  When compared at the species level, this bias was found to be highly consistent among the 86 species included in the study.  Thus, size measurements of monographed specimens reliably and consistently record a similar size class for any given species, and this bias is easily corrected during meta-analyses.   <p> Chapter three focuses on bivalves and brachiopods from a modern tropical shelf and quantifies the magnitude of time averaging (temporal mixing) for these two different organisms.  This is accomplished by dating a suite of shells from each site using amino acid racemization calibrated with several radiocarbon dates.  By studying the age distributions for each species it is determined that, despite some site to site differences, both bivalve and brachiopod species exhibit a similar time averaging magnitude when collected from the same region or depositional system.  This indicates that fossil assemblages of these species may have very similar resolution.",
  "description_provenance": [
    "Author Email: rkrause@vt.edu",
    "Advisor Email: michalk@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:48Z (GMT). No. of bitstreams: 1 KrauseDissertation1.pdf: 3994883 bytes, checksum: 1f28102b70f73675ea0b4030a1060b08 (MD5)   Previous issue date: 2006-04-14"
  ],
  "handle": "27278",
  "identifier_other": "etd-04252006-173952",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252006-173952/",
  "identifier_uri": "http://hdl.handle.net/10919/27278",
  "publisher": "Virginia Tech",
  "relation_haspart": "KrauseDissertation1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "morphometrics",
    "bivalve",
    "brachiopod",
    "time averaging",
    "size"
  ],
  "title": "Ecological, Evolutionary, and Taphonomic Comparisons of Brachiopods and Bivalves at Multiple Spatial and Temporal Scales",
  "type": "Dissertation"
}