{
  "contributor_author": "Geller, Krista Scott",
  "contributor_committeechair": "Piercy, Fred P.",
  "contributor_committeemember": [
    "Glindemann, Kent E.",
    "Suthers-McCabe, H. Marie",
    "Meszaros, Peggy S.",
    "Stevenson, Michelle L."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:48Z",
  "date_adate": "2005-04-29",
  "date_available": "2014-03-14T20:10:48Z",
  "date_issued": "2005-04-21",
  "date_rdate": "2008-04-29",
  "date_sdate": "2005-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study developed and evaluated a 34-item scale designed to measure human and companion animal attachment. A total of 398 individuals, ranging in age from 18 to 87, who have a pet completed the Pet-Attachment Scale (PAS). These individuals also completed the Companion Animal Bonding Scale (CABS), which asks respondents how much caretaking they devote to their pets. The PAS and the CABS were highly correlated, r=-.68 (p<.001), with an overlapping variance of 46%. The inter-item consistency or Chronbachâ  s Alpha of the PAS was .961, compared to a Chronbachâ  s Alpha of .862 for the CABS. The factor analysis of the PAS revealed two factors; Companionship (12 items) and Emotional Fulfillment (7 items). Thus, the PAS can be shortened to 19 items for follow-up research. The factor analysis for the CABS revealed only one factor (i.e., caretaking), and the analysis suggested the scale could be reduced from 8 to 3 items. The strong correlations between the PAS and the CABS suggest concurrent, convergent, and construct validity for the PAS. A stepwise regression for the PAS revealed three significant predictors: 1) responsibility, 2) favorite pet chosen, and 3) gender. Women who were responsible for their pet, and did not select a particular pet as their favorite, scored highest on attachment to their pets. A stepwise regression for the CABS revealed four predictors: 1) responsibility, 2) favorite pet chosen, 3) live with this pet, and 4) gender. These predictors for the CABS were the same as for the PAS, with the addition that those who lived with their pet gave more caretaking than those who did not. Analysis of variance was used to explore the effects of the predictor variables on the PAS and the CABS. These analyses revealed significant effects of gender and age category on both pet attachment (PAS) and pet caretaking (CABS). Women in the middle age category were most attached to their pets (PAS) and gave the most caretaking to their pets (CABS). The unique feature of the PAS, not measured by the CABS, was an Emotional Fulfillment factor. Future research should distinguish between pet attachment as companionship versus emotional fulfillment.",
  "description_provenance": [
    "Author Email: kgeller@vt.edu",
    "Advisor Email: kglindem@vt.edu",
    "Advisor Email: msuthers@vt.edu",
    "Advisor Email: Meszaros@vt.edu",
    "Advisor Email: mstevens@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:48Z (GMT). No. of bitstreams: 3 01Title_Page.pdf: 460871 bytes, checksum: 7758beff6918ebf6dc14ebf4be141287 (MD5) 03Dissertation.pdf: 408063 bytes, checksum: 00e46a70aabfdeb0d277901339ac4801 (MD5) 02Abstract_Acknowledgements.pdf: 84418 bytes, checksum: a5e6c3e912d7cdb8b84452e59bce471d (MD5)   Previous issue date: 2005-04-21"
  ],
  "handle": "27274",
  "identifier_other": "etd-04252005-171558",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252005-171558/",
  "identifier_uri": "http://hdl.handle.net/10919/27274",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01Title_Page.pdf",
    "03Dissertation.pdf",
    "02Abstract_Acknowledgements.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "care",
    "responsibility",
    "bonding",
    "emotional fulfillment",
    "companionship",
    "companion animals",
    "Assessment device",
    "Attachment",
    "Pet"
  ],
  "title": "Quantifying the Power of Pets: The Development of an Assessment Device to Measure Attachment Between Humans and Companion Animals",
  "type": "Dissertation"
}