{
  "contributor_author": "Carter, Lemuria D.",
  "contributor_committeechair": "Belanger, France",
  "contributor_committeemember": [
    "Sheetz, Steven D.",
    "Fan, Weiguo Patrick",
    "Richardson, Frederick M.",
    "Hiller, Janine S."
  ],
  "contributor_department": "General Business, Accounting",
  "date_accessioned": "2014-03-14T20:10:48Z",
  "date_adate": "2006-05-10",
  "date_available": "2014-03-14T20:10:48Z",
  "date_issued": "2006-04-12",
  "date_rdate": "2006-05-10",
  "date_sdate": "2006-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "E-government is the use of information technology, especially telecommunications, to enable and improve the efficiency with which government services and information are provided to its constituents.  Internet voting is an emerging e-government initiative. It refers to the submission of votes securely and secretly over the Internet. In the United States some areas have already used Internet voting systems for local and state elections.    Many researchers argue that one of the most important social impacts of Internet voting is the effect it could have on voter participation.  Numerous studies have called for research on the impact of technology on voter turnout; however, existing literature has yet to develop a comprehensive model of the key factors that influence Internet voting adoption. In light of the gradual implementation of I-voting systems and the need for research on I-voting implications this study combines political science and information systems constructs to present an integrated model of Internet voter participation.  The proposed model of Internet voting adoption posits that a combination of technical, political and demographic factors amalgamate to influence the adoption of I-voting services. The study was conducted by surveying 372 citizens ranging in age from 18-75.  The findings indicate that an integrated model of I-voting adoption is superior to existing models that explore political science or technology adoption constructs in isolation. Implications of this study for research and practice are presented.",
  "description_provenance": [
    "Author Email: lecarter@vt.edu",
    "Advisor Email: belanger@vt.edu",
    "Advisor Email: sheetz@vt.edu",
    "Advisor Email: wfan@vt.edu",
    "Advisor Email: frich@vt.edu",
    "Advisor Email: jhiller@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:48Z (GMT). No. of bitstreams: 1 LCarter_Dissertation_etd_v3.pdf: 2116562 bytes, checksum: e00d85e73a19240ced69fad7becf295f (MD5)   Previous issue date: 2006-04-12"
  ],
  "handle": "27276",
  "identifier_other": "etd-04252006-044422",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252006-044422/",
  "identifier_uri": "http://hdl.handle.net/10919/27276",
  "publisher": "Virginia Tech",
  "relation_haspart": "LCarter_Dissertation_etd_v3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Electronic Government",
    "Voter Participation",
    "Technology Adoption",
    "Diffusion of Innovation",
    "Internet Voting"
  ],
  "title": "Political Participation in a Digital Age: An Integrated Perspective on the Impacts of the Internet on Voter Turnout",
  "type": "Dissertation"
}