{
  "contributor_author": "Warren, Andrea Frazier",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Soltner, Eugene",
    "Rogers, Catherine S.",
    "Fortune, Jimmie C."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:49Z",
  "date_adate": "2007-05-07",
  "date_available": "2014-03-14T20:10:49Z",
  "date_issued": "2007-04-17",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The No Child Left Behind (NCLB) Act of 2001 was established to improve student achievement among all public school students.  To accomplish this goal, this federal mandate requires each state to establish the seven set priorities under NCLB.  In addition, each state is required to establish and report their accomplishments and failures annually.  One priority listed under NCLB required that all public schools establish a safe learning environment for students, school staff, and parents (U.S. Government, 2001).  Some researchers have identified a high frequency of student discipline incidents, resulting in high suspension and expulsion rates, as a negative constuct that hinders teachers from establishing a nurturing learning environment.  As a result, students are unable to develop the skills they need to successfully pass their state-wide assessment test (Howard et. al., 1987; Hernandez & Seem, 2004).  Therefore, this study was designed to determined if there is a relationship between incidents of student discipline and student achievement across public school districts in Maryland, New Jersey, Pennsylvania, and Virginia.  For the purpose of this study, a hierarchical clustering analysis was used to create five clusters of  school divisions (N=1,108) within the four states according to similiarities.  To accomplish this task, a data matrix was created, which contains data of the total number of incidents for disorderly conduct, weapon violations, substance abuse, and violence; the number of students receiving free and reduced lunch; and the number of students by race/ethnicity for each school district within the four states. The findings indicate that there is a relationship between incidents of student discipline and student achievement among the four states.",
  "description_provenance": [
    "Author Email: afwarren@vbschools.com",
    "Advisor Email: carogers@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:49Z (GMT). No. of bitstreams: 1 DissertationFinal1.pdf: 221081 bytes, checksum: 19561b6ad5b19003decd821e04f8e3dd (MD5)   Previous issue date: 2007-04-17"
  ],
  "handle": "27281",
  "identifier_other": "etd-04252007-144250",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252007-144250/",
  "identifier_uri": "http://hdl.handle.net/10919/27281",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationFinal1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "student achievement",
    "student conduct",
    "school climate",
    "student discipline",
    "student behavior"
  ],
  "title": "The relationship between reported incidents of student discipline and student achievement across four Eastern states",
  "type": "Dissertation"
}