{
  "contributor_author": "Lilley, Stacey Custer",
  "contributor_committeechair": "Lawson, Gerard F.",
  "contributor_committeemember": [
    "Creamer, Elizabeth G.",
    "Bodenhorn, Nancy E.",
    "Curcio, Claire Cole Vaught"
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:10:49Z",
  "date_adate": "2007-05-04",
  "date_available": "2014-03-14T20:10:49Z",
  "date_issued": "2007-04-13",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Despite much attention given to effective teams in the workplace, school counseling teams have been neglected in the research. The primary purpose of this mixed methods study was to learn what characteristics secondary counselors perceive contribute to an effective school counseling team. The first research phase conducted six team interviews; themes emerging from the interviews yielded the development of the Effective School Counseling Team Questionnaire (ESCTQ). The following research questions were investigated:  What factors do counselors perceive contribute to their team's effectiveness?, Are the scores on the Effective School Counseling Team Questionnaire related to team effectiveness as described by school counselors? Is there a relationship between team characteristics (amount of time together, individual counseling experience, gender, age) and team effectiveness?  Is there a relationship between the perceptions of members of effective and ineffective teams? </p><p>The literature on effective team factors was reviewed and analyzed in three categories: internal, interpersonal, and external. Qualitative results indicated that the majority of participants viewed internal traits as the number one factor contributing to their team's success. Most frequent were competencies, respect, sharing duties, caring for each other and serving students.  </p><p>The second area participants listed as most important was interpersonal factors, such as communication, interactions, and planning. Overall, communication was cited as the number one factor needed for an effective team. Conclusions drawn suggested that teams need altruistic, personal qualities to feel most effective. These were summarized by participants as a team member who is caring, giving, and putting the needs of students first. The second key area for school counseling teams was support from external sources, primarily school administration and central office.  </p><p>In phase two, the questionnaire was developed and used to confirm the interview findings. During the second phase, the ESCTQ was administered to 199 secondary school counselors, yielding an 82.4% (n = 164) return rate. The survey when analyzed by teams did not show major significant differences between the teams; it did, however, confirm the qualitative findings of the internal and personal characteristics counselors of effective school teams posses.  </p><p>The survey also allowed team members to rate their current team and their ideal team. The difference between the two ratings (ie. gap score) showed there was a significant mean difference (20.50) between the means of those who perceived their team as highly effective (26.55) and those who perceived their team as least effective (6.05). When looking at the questionnaire this could be interpreted to mean that the team members who felt most effective had the smallest gap score between their current team and their ideal team. When teams' gap scores were compared to their overall team rating \"global\" scores, as the global score increased for a team their gap score decreased.  Meaning an effective team had fewer discrepancies (smaller gap) between their current and ideal team. Clearly, teams that perceive their team as \"relatively effective\" are rating the team closer to their ideal team than those that see their team as \"relatively ineffective\".  </p><p>In order to enhance performance of a counseling team, this study was important to assess school counseling team's effectiveness. Two research methods were used to analyze effective teams; this research provides valuable information relating to school counselors and effective teams. </p>",
  "description_provenance": [
    "Author Email: slilley@vt.edu",
    "Advisor Email: creamere@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: glawson@vt.edu",
    "Advisor Email: vaughtc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:49Z (GMT). No. of bitstreams: 1 SLilleyFinalDissertationETDs.pdf: 430407 bytes, checksum: 7741bd467d01438a331838092b40f361 (MD5)   Previous issue date: 2007-04-13"
  ],
  "handle": "27283",
  "identifier_other": "etd-04252007-163003",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252007-163003/",
  "identifier_uri": "http://hdl.handle.net/10919/27283",
  "publisher": "Virginia Tech",
  "relation_haspart": "SLilleyFinalDissertationETDs.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "effective teams",
    "school counseling teams",
    "mixed methods"
  ],
  "title": "Effective School Counseling Teams",
  "type": "Dissertation"
}