{
  "contributor_author": "LeBreton, Daniel Lawrence",
  "contributor_committeechair": "Foti, Roseanne J.",
  "contributor_committeemember": [
    "Singh, Kusum",
    "Hauenstein, Neil M. A.",
    "Carlson, Kevin D."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:10:49Z",
  "date_adate": "2008-05-06",
  "date_available": "2014-03-14T20:10:49Z",
  "date_issued": "2008-04-04",
  "date_rdate": "2008-05-06",
  "date_sdate": "2008-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Surveys and a brief-interval longitudinal design were employed to investigate the relationships between selected proactive leader influence behaviors (PLIBs) and followers창   commitment to their leaders.  Selected elements of followers창   implicit leadership theories (ILTs) were expected to moderate the PLIBs 창   commitment relationships.  Hypotheses were generated and tested in order to determine the extent to which (1) PLIBs constituted group-level phenomena and (2) PLIBs and ILTs were related to follower commitment.  Empirical evidence did not support treating PLIBs as group-level variables.  While PLIBs were related to commitment, hypotheses specifying ILT dimensions as moderators of the PLIB 창   commitment relationships were not supported.",
  "description_provenance": [
    "Author Email: dlebreto@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: kevinc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:49Z (GMT). No. of bitstreams: 2 LeBretonDissertationBody.pdf: 260597 bytes, checksum: 40f412c579472b4d5a33ebc394c19d5b (MD5) LeBretonDissertationFrontMatter.pdf: 21451 bytes, checksum: a1c074602e2d49629185e8c11d87960c (MD5)   Previous issue date: 2008-04-04"
  ],
  "handle": "27287",
  "identifier_other": "etd-04252008-135945",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252008-135945/",
  "identifier_uri": "http://hdl.handle.net/10919/27287",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "LeBretonDissertationBody.pdf",
    "LeBretonDissertationFrontMatter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "leadership",
    "implicit leadership theories",
    "influence",
    "aggregation",
    "multilevel modeling",
    "commitment"
  ],
  "title": "Leader Influence Behavior, Follower ILTs, and Follower Commitment:  A Multilevel Field Investigation",
  "type": "Dissertation"
}