{
  "contributor_author": "Rivera-Marrero, Olgamary",
  "contributor_committeechair": "Lloyd, Gwendolyn M.",
  "contributor_committeemember": [
    "Evia, Carlos",
    "Laubenbacher, Reinhard C.",
    "Wilson, Melvin Skip",
    "Burge, Penny L."
  ],
  "contributor_department": "Mathematics",
  "date_accessioned": "2014-03-14T20:10:49Z",
  "date_adate": "2007-05-05",
  "date_available": "2014-03-14T20:10:49Z",
  "date_issued": "2007-04-04",
  "date_rdate": "2007-05-05",
  "date_sdate": "2007-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The integration of discrete mathematics into the secondary school curriculum (grades 7-12) is an important consideration because the mathematical area is dynamic and interesting, providing students the development of mathematical thinking. Also, it provides for teachers the opportunity to develop innovative mathematics instruction. Since the publication of the document Curriculum and Evaluation Standards for School Mathematics (NCTM, 1989), it has been difficult to determine how many schools have integrated discrete mathematics as a separate or as an integrated course in the school mathematics curriculum. Moreover, the mathematics education research community has, for the most part, not focused on teachersâ   perceptions about teaching and learning discrete mathematics as an area of investigation.  Because of  the lack of research in this area, the researcher investigated preservice secondary mathematics teachers' perceptions about discrete mathematics and their reactions to the integration of discrete mathematis into the school curriculum. The researcher purposely selected four preservice secondary teachers who were enrolled in a mathematics course in the fall of 2005. Various data sources were used to get a deep understanding of each participant, including  selected coursework, an online survey, and interviews.    Results indicated that these preservice teachers perceive discrete mathematics as meaningful to students, as it emphasizes processes such as problem solving and mathematical thinking, and it provides opportunities to use innovative instruction. Because of this, the preservice teachers believe that discrete mathematics should be integrated in the school mathematics curriculum. In addition, several factors that affect the integration of discrete mathematics in the school were identified. These factors are the state curriculum and testing, the historical emphasis of algebra and calculus in the school curriculum, the National Council of Teachers of Mathematics (1989, 2000) Standards documents' views of discrete mathematics, teachers' views of discrete mathematics, the lack of knowledge of discrete mathematics, and the lack of materials and guidelines for teaching discrete mathematics.",
  "description_provenance": [
    "Author Email: oriveram@vt.edu",
    "Advisor Email: lloyd@math.vt.edu",
    "Advisor Email: carlos.evia@vt.edu",
    "Advisor Email: reinhard@vbi.vt.edu",
    "Advisor Email: skipw@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:49Z (GMT). No. of bitstreams: 1 DM-Dissertation-Olgamary-May2007.pdf: 2851465 bytes, checksum: 0c26e29c00f777401b791caf2f56542a (MD5)   Previous issue date: 2007-04-04"
  ],
  "handle": "27280",
  "identifier_other": "etd-04252007-140123",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252007-140123/",
  "identifier_uri": "http://hdl.handle.net/10919/27280",
  "publisher": "Virginia Tech",
  "relation_haspart": "DM-Dissertation-Olgamary-May2007.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "school mathematics curriculum",
    "teachersâ   perceptions",
    "discrete mathematics"
  ],
  "title": "The place of discrete mathematics in the school curriculum: An analysis of preservice teachersâ   perceptions of the integration of discrete mathematics into secondary level courses",
  "type": "Dissertation"
}