{
  "contributor_author": "Key, Kijona Farthing",
  "contributor_committeechair": "Meng, Xiang-Jin",
  "contributor_committeemember": [
    "Zhang, Chenming Mike",
    "Toth, Thomas E.",
    "Boyle, Stephen M.",
    "Buechner-Maxwell, Virginia A.",
    "Duncan, Robert B. Jr.",
    "Sriranganathan, Nammalwar"
  ],
  "contributor_department": "Biomedical and Veterinary Sciences",
  "date_accessioned": "2014-03-14T20:10:49Z",
  "date_adate": "2007-05-07",
  "date_available": "2014-03-14T20:10:49Z",
  "date_issued": "2007-04-19",
  "date_rdate": "2007-05-07",
  "date_sdate": "2007-04-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Porcine reproductive and respiratory syndrome (PRRS) is a viral disease that has devastated the global swine industry since the mid 1980s.  Although modified live vaccines (MLVs) are typically used for the prevention of clinical disease, they are not always fully effective.  Additionally, acute PRRS outbreaks, characterized by more severe clinical signs, have appeared in herds that were previously vaccinated.  In this dissertation, we further analyzed the pathogenesis of PRRSV through genetic characterization, assay development, and quasispecies evaluation using the PRRSV ORF5 gene while also attempting to develop an improved PRRS vaccine.         To explore the possible mechanism for the emergence of acute PRRS, the open reading frame 5 (ORF5) gene encoding the major envelope protein (GP5) of acute PRRSV isolates was characterized.  Sequence and phylogenetic analyses revealed that seven of the acute PRRS virus (PRRSV) isolates were related to other N. American PRRSV isolates while one isolate, 98-37120-2, was very closely related to and may have been derived from the MLV, RespPRRS.  We also developed a heteroduplex mobility assay (HMA) for quickly identifying PRRSV field isolates with significant nucleotide sequence identities (â  d98%) with the MLVs based on the amplification, denaturation, and reannealing of the ORF5 gene of the field isolates with those of MLV reference strains.  All of the field isolates that were highly related to RespPRRS (â  T2% nucleotide sequence divergence) were identified by the HMA to form homoduplexes with the reference RespPRRS MLV.        We also developed a unique strategy for infecting pigs with PRRSV, known as in vivo transfection, by bypassing the traditional in vitro cell culture step required for in vivo studies.  We demonstrated that inoculation of RNA transcripts of a PRRSV infectious cDNA clone directly into the lymph nodes and tonsils of pigs produces active PRRSV infection.  Using this method, we also examined the quasispecies populations of PRRSV. Finally, we evaluated the ability of Salmonella choleraesuis to express the PRRSV GP5, and tested its immunogenicity in mice.  Based on our data, there was no indication of Salmonella replication in the mice or any evidence of antibody production against S. choleraesuis or PRRSV GP5.",
  "description_provenance": [
    "Author Email: kkey@vt.edu",
    "Advisor Email: chzhang2@vt.edu",
    "Advisor Email: ttoth@vt.edu",
    "Advisor Email: smboyle@vt.edu",
    "Advisor Email: bmax@vt.edu",
    "Advisor Email: duncanr@vt.edu",
    "Advisor Email: nathans@vt.edu",
    "Advisor Email: xjmeng@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:49Z (GMT). No. of bitstreams: 1 KFK.VERSION.final.pdf: 794019 bytes, checksum: c79fbfd642bd8cf5d054ce23c95d2171 (MD5)   Previous issue date: 2007-04-19"
  ],
  "handle": "27282",
  "identifier_other": "etd-04252007-144727",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04252007-144727/",
  "identifier_uri": "http://hdl.handle.net/10919/27282",
  "publisher": "Virginia Tech",
  "relation_haspart": "KFK.VERSION.final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "PRRSV",
    "PRRS",
    "ORF5",
    "GP5",
    "virology",
    "vaccine",
    "porcine reproductive and respiratory syndrome"
  ],
  "title": "Molecular characterization of the major envelope protein of porcine reproductive and respiratory syndrome virus (PRRSV) and evaluation of its use for a diagnostic assay, vaccine development, and the examination of quasispecies evolution",
  "type": "Dissertation"
}