{
  "contributor_author": "Harris, Keith",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Melvin, Joseph",
    "Twiford, Travis W.",
    "Parson, Stephen R.",
    "Monk, Thelma"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:51Z",
  "date_adate": "2001-04-27",
  "date_available": "2014-03-14T20:10:51Z",
  "date_issued": "2001-04-13",
  "date_rdate": "2002-04-27",
  "date_sdate": "2001-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This project was a synthesis of studies of the disciplinary actions received by middle and high school African-American students in public schools. This synthesis was conducted for three reasons: (1) to identify and collect studies on the variables associated with the disciplining of African-American students, (2) to examine how the variables contribute to African-American students being disproportionately disciplined when compared to other ethnic groups, and (3) to examine how the variables could be managed so that the need to discipline African-American students is reduced. <p>Twenty-nine variables were identified from a synthesis of 13 studies. These variables were placed into three categories: personal variables, environmental variables, and institutional variables. Twenty-three variables were found to be associated with the number of disciplinary actions received by African-American students.  These variables are listed below by category: <p>Personal variables. Parental involvement, socioeconomic status, fondness of teacher, ethnicity, gender, feelings of alienation (powerlessness, normlessness), attitude toward peers, and social involvement (participation in school activities, number of positions of responsibility, frequency of association with adults, and frequency of association with African-Americans). <p>Environmental variable. Peer pressure. <p>Institutional variables.  Enforcement of school rules, organizational climate, sports activities, school violence, desegregation (influx of black students), level of satisfaction with the school environment (student activities, communication, school work, and decision-making opportunities), and in combination, perceived leader behaviors, perceived school climate, and school size. <p>Ten variables that contribute to the disproportionate number of disciplinary actions received by African-American students when compared to other ethnic groups were found. These variables are listed below by category: <p>Personal variables.  Grades in the previous semester, past discipline record, socio- economic status, ethnicity, gender, feelings of alienation (personal incapacity, guidelessness). <p>Environmental variable. School socioeconomic status. <p>Institutional variables. Student demeanor rating, desegregation (influx of African-American students). <p>Recommendations were made for managing the variables to reduce the need to discipline African-American students.  Recommendations included implementing initiatives on working with students in poverty, providing cultural diversity workshops for faculty, and analyzing discipline data for disparities in the number of disciplinary actions received by students.",
  "description_provenance": [
    "Author Email: keharri3@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:51Z (GMT). No. of bitstreams: 1 keith.pdf: 382118 bytes, checksum: b1e439e3ed6951d36039e0e51d4512d5 (MD5)   Previous issue date: 2001-04-13"
  ],
  "handle": "27294",
  "identifier_other": "etd-04262001-113145",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262001-113145/",
  "identifier_uri": "http://hdl.handle.net/10919/27294",
  "publisher": "Virginia Tech",
  "relation_haspart": "keith.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Black students",
    "High school",
    "Middle school",
    "Suspensions",
    "Disciplinary Actions",
    "African-American students"
  ],
  "title": "Variables Associated With the Disciplinary Actions Received by Middle and High School African-American Students in Public Schools: A Synthesis of Studies",
  "type": "Dissertation"
}