{
  "contributor_author": "Kantrovich, Adam Joseph",
  "contributor_committeecochair": [
    "Hillison, John H.",
    "Fortune, Jimmie C."
  ],
  "contributor_committeemember": [
    "Kerns, Waldon R.",
    "Price, William T. Jr.",
    "Legacy, James",
    "White, John M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:50Z",
  "date_adate": "2000-04-27",
  "date_available": "2014-03-14T20:10:50Z",
  "date_issued": "2000-04-20",
  "date_rdate": "2001-04-27",
  "date_sdate": "2000-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The review of the literature reveals the historical nature of Vocational Education programs and how they relate to the importance of Virginia Tech's two-year post-secondary Agricultural Technology Program. The literature review also provides a historical review of information regarding Virginia Tech's Agricultural Technology program, brief histories of other post-secondary land-grant two-year agricultural programs, vocational education philosophers, and two-year program evaluations. <p>The purpose of this study was to perform an evaluation of past performance of the two-year Agricultural Technology Program at Virginia Tech as perceived by the two-year program graduates. The study focused on two points, a) the graduate's opinions with regards toward the improvement of the program on behalf of the students, and b) the strength and weaknesses of the program in order to determine what the program has accomplished and where it should be headed. <p> Five research questions guided this study;  1. How pleased were the graduates with the education they received through the Agricultural Technology Program? <p> 2. What is the salary range of the graduate's first job after graduation and what is their present salary range? <p> 3. What were the strengths and weaknesses of the program as perceived from the graduates? <p> 4. What are the Agricultural Technology graduates current occupations? <p> 5.What recommendations do the graduates have for the improvement of the Agricultural Technology Program? <p> A survey instrument was used as the research method for the collection of the data. A pilot study was performed to test the survey instrument. Three rounds of survey instruments were sent to increase the possible response rate. A non-respondents study was performed to determine if there was a difference between the respondents and non-respondents of the survey instrument. Frequencies, mean, median, mode, and standard deviation were used in the analysis of the data. <p> The population consists of all of those that graduated from the two-year Agricultural Technology Program at Virginia Polytechnic Institute and State University from the date of the programs first graduation class (1989) to the fall semester of 1998. Because there was such a small number of subjects within the population, to prevent sampling error, and to be able to prevent any deviation of assumptions between the sample and the population the whole population was mailed an evaluation instrument. All three of the mailings yielded a total 215 received survey instruments for a 62% response rate from an N of 343. This left a total of 128 or 37% non-respondents. A reliability test was run in SPSS using the Cronbach Alpha method, also know as Alpha coefficient, the Standard Item Alpha = .7661. <p> The major conclusions of the study were that the Agricultural Technology Program graduates were pleased with the overall education that was received at Virginia Tech, the mean salary for the graduates first job was between $18,000 and $23,999, the mean of the graduates current job is between $24,000 and $29,999, the major strengths to the program were the mandatory internship requirement, the hands-on courses, and the advisors for the program, the weaknesses of the program are issues with the transferability of  credit hours to the four-year program, additional computer and technology courses and information are needed, and a lack of available elective course offerings. Just over 78% of the program graduates are employed within the field of agriculture and 16% have gone back to farm ownership or to work on the family farm. Some of the major recommendations that were made by the program graduates were to offer additional courses and options, add more emphasis to computers and technology, additional job placement services, and to allow students to take more four-year courses. <p> Based on the findings recommendations were made about further studies for the addition of courses, faculty, program options, more emphasis of technology in courses, curriculum development, job placement, and credit hour transferability. Specific recommendations were made for an external review to be performed of the Agricultural Technology Program, a formal review of curriculum, additional courses in computers and technology, and further research to be performed with regards to policy change in transferability of credit hours to the four-year program, addition of courses offered as electives, and for students to take courses provided by the four-year program.",
  "description_provenance": [
    "Author Email: akantrov@vt.edu",
    "Advisor Email: hillison@vt.edu",
    "Advisor Email: fortunejc@vt.edu",
    "Advisor Email: kernsw@vt.edu",
    "Advisor Email: wprice@vt.edu",
    "Advisor Email: jlegacy@siu.edu",
    "Advisor Email: jmwhite@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:50Z (GMT). No. of bitstreams: 1 disser.PDF: 477647 bytes, checksum: 805af3492bd86e128f35e176f01d9a8b (MD5)   Previous issue date: 2000-04-20"
  ],
  "handle": "27290",
  "identifier_other": "etd-04262000-11400044",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262000-11400044/",
  "identifier_uri": "http://hdl.handle.net/10919/27290",
  "publisher": "Virginia Tech",
  "relation_haspart": "disser.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "agricultural education",
    "evaluation",
    "Follow-up",
    "two-year agricultural programs"
  ],
  "title": "An Evaluation of Past Performance of the Two-Year Agricultural Technology Program at Virginia Tech as Perceived by Program Graduates",
  "type": "Dissertation"
}