{
  "contributor_author": "Lin-Gibson, Sheng",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "McGrath, James E.",
    "Lesko, John J.",
    "Shultz, Allan R.",
    "Ward, Thomas C."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:10:51Z",
  "date_adate": "2001-04-27",
  "date_available": "2014-03-14T20:10:51Z",
  "date_issued": "2001-04-12",
  "date_rdate": "2002-04-27",
  "date_sdate": "2001-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Void-free phenolic networks have been prepared by the reaction of phenolic novolac resins with various diepoxides.  The stoichiometric ratio can be adjusted to achieve networks with good mechanical properties while maintaining excellent flame retardance.  A series of linear, controlled molecular weight, 2,6-dimethylphenol endcapped cresol novolac resins have been synthesized and characterized.  The molecular weight control was achieved by adjusting the stoichiometric ratio of cresol to 2,6-dimethylphenol and using an excess of formaldehyde.  A dynamic equilibrium reaction was proposed to occur which allowed the targeted molecular weight to be obtained.   A 2000 g/mol ortho-cresol novolac resin was crosslinked by a diepoxide oligomer and by an epoxidized phenolic oligomer in defined weight ratios and the structure-property relationships were investigated.  The networks comprised of 60 or 70 weight percent cresol novolac exhibited improved fracture toughness, high glass transition temperatures, low water uptake, and good flame retardance.  The molecular weights between crosslinks were also determined for these networks. The stress relaxation moduli were measured as a function of temperature near the glass transition temperatures.  Crosslink densities as well as the ability to hydrogen bond affect the glassy moduli of these networks.  Rheological measurements indicated that cresol novolac/epoxy mixtures have an increased processing window compared to phenolic novolac/epoxy mixtures.  Maleimide functionalities were incorporated into cresol novolac oligomers, and these were crosslinked with bisphenol-A epoxy.  The processability of oligomers containing thermally labile maleimides were limited to lower temperatures.  However, sufficiently high molecular weight oligomers were necessary to obtain good network mechanical properties.  Networks prepared from 1250 g/mol cresol novolac containing maleimide functionilities and epoxy exhibited good network properties and could be processed easily.   Latent triphenylphosphine catalysts which are inert at processing temperatures (~140°C) but possess significant catalytic activity at cure temperatures 180-220°C were necessary for efficient composite fabrication using phenolic novolac/epoxy matrix resins.  Both sequestered catalyst particles and sizings were investigated for this purpose.  Phenolic novolac/epoxy mixtures containing sequestered catalysts exhibited significantly longer processing time windows than those containing free catalysts.  The resins also showed accelerated reaction rates in the presence of sequestered catalysts at cure temperatures.  Trihexylamine salt of a poly(amic acid) was sized onto reinforcing carbon fibers and the composite properties indicated that fast phenolic novolac/epoxy cure could be achieved in its presence.",
  "description_provenance": [
    "Author Email: linsheng@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: ashultz@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:51Z (GMT). No. of bitstreams: 1 SLGETD.pdf: 6475540 bytes, checksum: 8fcb211824491fc593724e2b72d9f4d1 (MD5)   Previous issue date: 2001-04-12"
  ],
  "handle": "27296",
  "identifier_other": "etd-04262001-142525",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262001-142525/",
  "identifier_uri": "http://hdl.handle.net/10919/27296",
  "publisher": "Virginia Tech",
  "relation_haspart": "SLGETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "composite",
    "latent catalyst",
    "flame retardance",
    "phenolic",
    "structure-property relationships",
    "epoxy",
    "Cresol novolac",
    "controlled molecular weight"
  ],
  "title": "Cresol Novolac/Epoxy Networks: Synthesis, Properties, and Processability",
  "type": "Dissertation"
}