{
  "contributor_author": "Holland, Dwight",
  "contributor_committeecochair": [
    "Prestrude, Albert M.",
    "Beaton, Robert J."
  ],
  "contributor_committeemember": [
    "Barfield, Woodrow S.",
    "Dryden, Robert D.",
    "Kemmerling, Paul T. Jr.",
    "Koelling, Charles Patrick"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:10:52Z",
  "date_adate": "2001-05-01",
  "date_available": "2014-03-14T20:10:52Z",
  "date_issued": "2000-01-17",
  "date_rdate": "2002-05-01",
  "date_sdate": "2001-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Dynamic Visual Acuity (DVA) in the visual periphery has not been extensively studied. DVA is a measure of an observer's ability to resolve critical details in a target when there is relative motion between the target and the observer. This dissertation examined static and dynamic acuity in the 25-55 deg region of retinal eccentricity under a variety of conditions. Functionally, this region of the visual field is just beyond the \"blind spot,\" but not yet in the \"far\" visual periphery of 60-90 deg of eccentricity. Traditionally, DVA research has been confined to the assessment of DVA for the foveal (or \"central\") visual system. However, the peripheral (or \"ambient\") visual system provides very important information content for the visual and neuro-vestibular systems. This peripheral visual information content is also used to create a sense of ego motion (termed \"vection\"), and for alerting the visual system to targets entering or leaving the field of view. Past findings involving visual acuity in the peripheral retina have demonstrated that peripheral acuity performance has components related to the notion of \"attention\" as well. This is particularly true if the peripheral vision research results are to be applied to visually and attentionally complex and/or dynamic real-world environments.</p><p> In this experiment, the 25-55 deg eccentric region of the retina was tested for DVA in 50 observers. This study used a mixed four-factor research design with Eccentricity (25, 35, 45, 50, 55 deg) as a between-subjects factor. Tracking Difficulty (monitor only, easiest, moderate, most difficult tracking levels), Landolt C Target Velocities (0.0, 4.88, 14.62, and 24.40 deg/s), and Target Direction (\"F/R:\" fixed or random direction of target appearance) were used as within-subjects factors. A computer presented the Landolt C ring targets under the stated conditions in a random fashion. Acuity was determined for each trial by a modified descending method-of-limits approach with the Landolt C ring target gap widths utilized as the determinant for the acuity measure. The Tracking Task was designated as the primary task, with the secondary task being to indirectly observe the orientation (up, down, right, left) of the Landolt C rings being presented under the various conditions of Target Velocity and Target Direction in the retinal periphery.</p><p> The resulting Analysis of Variance (ANOVA) revealed significant differences (p < 0.05) for each of the main effects of Eccentricity, Tracking Task Difficulty, Velocity, and Target Direction (F/R). Only two of the two-way interactions were found to be significant (p < 0.05)-- those of Tracking Difficulty x Target Velocity and Target Velocity x Target Direction interactions. The results are discussed in terms of the psychophysical, attention, and \"tunnel vision\" like models of peripheral visual performance, along with other related human factors literature in the domain of \"situation awareness\" that are relevant to this general problem area. </p><p>The results of a separate follow-on mini-study are discussed using a Two-way Contingency Table analysis across all of the treatment conditions when verbal intrusion was embedded in the previously described experimental conditions. This mini-study revealed a significant association (p < 0.05) with not seeing the peripheral targets as accurately when intrusion was present, versus when there was no verbal intrusion. This effect was more pronounced at the highest velocities (14.62 and 24.40 deg/s) as compared with the slower ones (0 and 4.88 deg/s) in terms of the strength of the association, as assessed by a Kappa test statistic.</p><p> Taken all together, and with consideration given to the relatable scientific literature, these results indicate that the more \"busy\" a person is with cognitive, visual, or motor-skills tasks, the more likely an individual will show degradation in static or dynamic peripheral visual acuity tasks. Peripheral vision often serves as a \"warning\" or \"status\" sensory modality for what is occurring in the local task environment, separate from the foveal visual system. Future research is suggested given the sensitivity of the peripheral visual system to these factors, particularly with regard to how factors involving the notion of attention may affect such \"peripheral visual awareness\" issues. These issues in turn may play an important role from a human factors and safety perspective in a variety of person-rated vehicular domains. Specific areas that are highlighted for future research in the domain of attention and \"peripheral visual awareness\" include the low-altitude high-performance flying realm, the flying environment more generally, and in other dynamic multi-task vehicular environments such as that encountered while simultaneously driving and using a car cellular phone.</p>",
  "description_provenance": [
    "Author Email: dwightholl@aol.com",
    "Made available in DSpace on 2014-03-14T20:10:52Z (GMT). No. of bitstreams: 1 DWIGHT.PDF: 7867717 bytes, checksum: ab05d6c5ed8ac7340278b07edff861f6 (MD5)   Previous issue date: 2000-01-17"
  ],
  "handle": "27297",
  "identifier_other": "etd-04262001-144048",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262001-144048/",
  "identifier_uri": "http://hdl.handle.net/10919/27297",
  "publisher": "Virginia Tech",
  "relation_haspart": "DWIGHT.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Tracking Task Loading",
    "Peripheral Visual Response",
    "Dynamic Visual Acuity"
  ],
  "title": "Peripheral Dynamic Visual Acuity Under Randomized Tracking Task Difficulty, Target Velocities, and Direction of Target Presentation",
  "type": "Dissertation"
}