{
  "contributor_author": "Altinkilic, Oya",
  "contributor_committeechair": "Hansen, Robert S.",
  "contributor_committeemember": [
    "Thompson, G. Rodney",
    "Pinkerton, John M.",
    "Shome, Dilip K.",
    "Keown, Arthur J."
  ],
  "contributor_department": "Finance, Insurance, and Business Law",
  "date_accessioned": "2014-03-14T20:10:53Z",
  "date_adate": "2001-04-27",
  "date_available": "2014-03-14T20:10:53Z",
  "date_issued": "2001-04-19",
  "date_rdate": "2005-03-23",
  "date_sdate": "2001-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Altinkiliç and Hansen (2000) show that underwriter spreads in seasoned equity offerings (SEOs) overwhelmingly reflect variable costs. This research attempts to begin filling the gap created by this result, as to what are the important constituents of the variable costs. In particular, I investigate the hypothesis that an important part of underwriter compensation is partial payment for anticipated market making activities in the secondary market, once the offer begins. I show that lead underwriter market making activities following an SEO are partly paid through the spread. The lower bound cost estimates show that the spreads for firms likely to require the most market making services are on average 100 basis points higher than those requiring the least services. On average, the compensation for market making activities amounts to 20% of the lead underwriter's total compensation. The results are robust to several considerations.",
  "description_provenance": [
    "Author Email: oaltinki@vt.edu",
    "Advisor Email: grod@vt.edu",
    "Advisor Email: jpinkert@vt.edu",
    "Advisor Email: dilip@vt.edu",
    "Advisor Email: emily@vt.edu",
    "Advisor Email: rob.hansen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:53Z (GMT). No. of bitstreams: 1 Oya.Altinkilic1.pdf: 618920 bytes, checksum: 82430c76fa04128b25f2d75516433d86 (MD5)   Previous issue date: 2001-04-19"
  ],
  "handle": "27301",
  "identifier_other": "etd-04262001-201956",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262001-201956/",
  "identifier_uri": "http://hdl.handle.net/10919/27301",
  "publisher": "Virginia Tech",
  "relation_haspart": "Oya.Altinkilic1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Issuance",
    "Investment Banking"
  ],
  "title": "An Examination of Seasoned Equity Offer Placement Effort",
  "type": "Dissertation"
}