{
  "contributor_author": "Mullins, Foney G.",
  "contributor_committeechair": "Salmon, Richard G.",
  "contributor_committeemember": [
    "Dawson, Christina M.",
    "Worner, Wayne Dempsey",
    "Driscoll, Lisa G.",
    "Stainback, George S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:53Z",
  "date_adate": "2001-04-27",
  "date_available": "2014-03-14T20:10:53Z",
  "date_issued": "2001-04-18",
  "date_rdate": "2002-04-27",
  "date_sdate": "2001-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>The purpose of this study was to present an historical analysis of the function of the Literary Fund of Virginia as it pertained to public school funding. The major questions central to this study were: (a) How has the Literary Fund addressed the funding needs of the Virginia public schools? (b) What significant changes have occurred in the apportionment of Literary Fund revenue? and (c) What are the future trends of the Literary Fund? <p>The political and social circumstances that prevailed in Virginia, prior to this funding initiative, were examined to determine what effects they had on its development. Primary documents also were examined to ascertain pertinent information for completion of this study. These included: House and Senate Journals; The Acts of the General Assembly; Virginia School Reports; Virginia Second Auditor Reports of the Literary Fund; Annual Reports of the Superintendent of Public Instruction; and the Code of Virginia. Secondary sources were used to provide background information about the historical events that helped shape the development and perpetuation of the Literary Fund. <p>Various government officials and a former Superintendent of Public Instruction were interviewed through use of a protocol. The purpose of these interviews was to gain insight on the likely future of the Literary Fund. Their answers to questions were analyzed to determine if consistent themes could be identified. These interviews, along with historical data collected, were examined in order to provide recommendations for future consideration by the Commonwealth of Virginia relative to the use of Literary Fund revenue.",
  "description_provenance": [
    "Author Email: fmullins@wcs.k12.va.us",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: tdawson@antiochsea.edu",
    "Advisor Email: wworner@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: ghstain@ehc.edu",
    "Made available in DSpace on 2014-03-14T20:10:53Z (GMT). No. of bitstreams: 1 Mullins_Foney.PDF: 410301 bytes, checksum: a4deff5d1f144e3e4cd58509c7261b52 (MD5)   Previous issue date: 2001-04-18"
  ],
  "handle": "27303",
  "identifier_other": "etd-04262001-230201",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262001-230201/",
  "identifier_uri": "http://hdl.handle.net/10919/27303",
  "publisher": "Virginia Tech",
  "relation_haspart": "Mullins_Foney.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Virginia public school finance",
    "Virginia public school funding",
    "literary fund"
  ],
  "title": "A History of the Literary Fund as a Funding Source for Free Public Education in the Commonwealth of Virginia",
  "type": "Dissertation"
}