{
  "contributor_author": "Banks, Claretha Hughes",
  "contributor_committeechair": "O'Reilly, Patrick A.",
  "contributor_committeemember": [
    "Winchester, Samuel",
    "Holmes, Glen A.",
    "Burton, John K.",
    "Eschenmann, Konrad Kurt"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:53Z",
  "date_adate": "2002-04-30",
  "date_available": "2014-03-14T20:10:53Z",
  "date_issued": "2002-04-24",
  "date_rdate": "2003-04-30",
  "date_sdate": "2002-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Virginia Tech's Faculty Development Institute (FDI) was developed to address issues related to the computer technology revolution; training and education of faculty; faculty professional development; and the university adjusting to change. The purpose of this study was to identify and compare the goals, expectations, and perceived outcomes that the university, FDI developers, and the initial participants had for Virginia Tech's FDI initiative as originally implemented.  Both qualitative and quantitative research methods were used in this study to identify the perceived outcomes for the developers and initial participants. The fundamental concepts of motivation theory, evaluation, personal recall, and self-perception theory are used help to describe and explain the findings of the study. Interview results from the five developers and historical document analysis were used to develop surveys for the 49 initial participants and the developers in order to provide validity for the results.  Interviews, historical documents and the survey results show that initial participants, developers and the university had very similar expectations for the outcomes during and/or immediately following the initial FDI workshop. There were wider differences in expectations of long-term outcomes as a result of the FDI initiative. The results also differ in terms of the extent to which participants and developers believed that their expectations were met short and long term.",
  "description_provenance": [
    "Author Email: clbanks@cox.net",
    "Advisor Email: oreilly@vt.edu",
    "Advisor Email: swinchester@nc.rr.com",
    "Advisor Email: gholmes@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:53Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 427246 bytes, checksum: 053af360eece6a0971a1e06f99384f84 (MD5)   Previous issue date: 2002-04-24"
  ],
  "handle": "27305",
  "identifier_other": "etd-04262002-095104",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262002-095104/",
  "identifier_uri": "http://hdl.handle.net/10919/27305",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Computer technology",
    "Motivational Theories",
    "Faculty Development"
  ],
  "title": "A DESCRIPTIVE ANALYSIS OF THE PERCEIVED EFFECTIVENESS OF VIRGINIA TECHâ  S FACULTY DEVELOPMENT INSTITUTE",
  "type": "Dissertation"
}