{
  "contributor_author": "Collins, Denise",
  "contributor_committeechair": "Creamer, Elizabeth G.",
  "contributor_committeemember": [
    "Hirt, Joan B.",
    "Blieszner, Rosemary",
    "Uttech, Melanie R.",
    "Creamer, Donald G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:53Z",
  "date_adate": "2001-04-27",
  "date_available": "2014-03-14T20:10:53Z",
  "date_issued": "2001-04-23",
  "date_rdate": "2002-04-27",
  "date_sdate": "2001-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Establishing a sense of identity is a central task in human development. This research pursued questions about how adult, self-identified feminist women conceptualize their identity, the role of feminism in that conceptualization, and the interaction of feminism with race and sexual orientation.</p> Forty women in five geographic regions across the United States were interviewed. The participants were faculty, administrators, classified staff, and graduate students affiliated with a university in the region. The interviews were completed during a week-long visit to each location; each interview lasted from 45 to 75 minutes. Interviews followed a semi-structured format, using a standard protocol. Questions in the interviews asked about the importance of feminism, occupation, relationships, religion, politics, race/ethnicity, and sexual orientation in the women's identities. The connection of feminism to each of the other identity areas was also asked of the participants.</p> The women in this study conceptualized identity as consisting of multiple elements, organized in one of two ways: (a) a whole with multiple parts and (b) a collection of multiple parts. The first is an integrated identity, where all elements are connected to each of the other elements, and the second is a contextual identity, where the connection of elements can depend on situational variables. The multiple identities include traditional categories of occupation, relationships, religion, politics, race, and sexual orientation, but also add other areas such as age, socioeconomic class, avocational interests, and feminism. </p> Women identify themselves as having multiple identities. The way participants in this study view feminism as an identity is organized in four categories: a set of values, a process to make meaning, a contextual identity, and an underlying construct. The categories of feminism vary in the degree to which feminism is connected with other identity elements. Women who view feminism as a set of values speak of it as a set of beliefs or an ideology that may or may not influence other identity areas. The participants who view feminism as a process to make meaning have either an interconnected or contextual view of feminism, with the added element of seeing feminism as a way to understand, interpret, and make decisions about experiences. Feminism as a contextual identity is connected with some parts of identity but not with all elements. For those whose view of feminism is as an underlying construct, feminism is interconnected and interactive with all of the other identity elements. </p> This study adds to the literature about feminism and feminist identity in three ways. First, it suggests that for women who identify themselves as feminists, feminism is not only an ideology but also an important element of their identity. Second, it asserts that a shared definition of feminism is not critical to determining its role in identity. Third, this study's findings challenge the Downing and Roush (1985) model of feminist identity as the principal model. The Downing and Roush model focuses on feminist consciousness rather than identity; it employs a singular, liberal definition of feminism; it ignores multiple identities and their interactions; and it hinges its highest achievement on activist participation. Each of these assumptions of the Downing and Roush model are contradicted by the findings of this research.</p> This study adds to the previous literature about identity in two ways. First, it expands the knowledge about adult women's identity by proposing a definition that takes into account the multiple identities that women have. Second, the findings challenge the limited areas by which identity has been traditionally defined. This study challenges the notion that identity is a singular, core construct based on traditional elements. Individuals must be allowed to identify the elements that make up their own identities. The results of this study also suggest that multiple identities, including race/ethnicity and sexual orientation, are mutually influencing and interconnected rather than independent or singular. Identity is constructed of multiple elements that must be examined together to understand the individual's own definition of self.",
  "description_provenance": [
    "Author Email: denisec@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Advisor Email: muttech@vt.edu",
    "Advisor Email: creamere@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:53Z (GMT). No. of bitstreams: 10 vita.pdf: 23414 bytes, checksum: b7d769041e89b244f59272a44c88b52c (MD5) references.pdf: 27591 bytes, checksum: 317f0add6d8c3369c323f373a663c6c0 (MD5) chap5.pdf: 20716 bytes, checksum: edb2fcb3751ff8a8bc2e5ba0bfb72bb5 (MD5) chap4.pdf: 89302 bytes, checksum: dcb288c0f4e78856e25c705756797af2 (MD5) front.pdf: 183432 bytes, checksum: 7f13c8ffebdb1a61231876fa9255b4a2 (MD5) chap3.pdf: 25060 bytes, checksum: 264554fd34a9867de0f4af0f5841c4a5 (MD5) chap6.pdf: 37379 bytes, checksum: af6ff5b83b2aa02e478855f6ae1edbc5 (MD5) appendix.pdf: 15513 bytes, checksum: 3f9a1fb0b58c5dba7f7b8630b10177d8 (MD5) chap1.pdf: 20317 bytes, checksum: dc01ec4158daa2b656249736ce2093bc (MD5) chap2.pdf: 79125 bytes, checksum: e002cf240ff0a3f968e5aa0ceca6f432 (MD5)   Previous issue date: 2001-04-23"
  ],
  "handle": "27300",
  "identifier_other": "etd-04262001-194845",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262001-194845/",
  "identifier_uri": "http://hdl.handle.net/10919/27300",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "vita.pdf",
    "references.pdf",
    "chap5.pdf",
    "chap4.pdf",
    "front.pdf",
    "chap3.pdf",
    "chap6.pdf",
    "appendix.pdf",
    "chap1.pdf",
    "chap2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "women",
    "university",
    "feminism",
    "identity"
  ],
  "title": "Feminist Identity",
  "type": "Dissertation"
}