{
  "contributor_author": "Ogle, Gwendolyn J.",
  "contributor_committeechair": "Burton, John K.",
  "contributor_committeemember": [
    "Holmes, Glen A.",
    "Cennamo, Katherine",
    "Weber, Larry J.",
    "Moore, David Michael"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:10:54Z",
  "date_adate": "2002-04-29",
  "date_available": "2014-03-14T20:10:54Z",
  "date_issued": "2002-04-10",
  "date_rdate": "2003-04-29",
  "date_sdate": "2002-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Evaluation is an integral part of instructional design. Formative evaluation, specifically, is a phase identified in many instructional design models and is recognized as an important step for program improvement and acceptance. Although evaluation has many models and approaches, very few deal specifically with formative evaluation. Further, no one set of guidelines has been found that provides a comprehensive set of procedures for planning and implementing a formative evaluation. Encapsulating such guidelines into a “tool” that automates the process was the author’s initial idea. The author’s intent in Chapter 2 was to find a model or checklist as a stepping off point for future formative evaluation tool development. In lieu of finding such a model, one was created (Chapter 3), pulling from several formative evaluation models and the author’s own experience. Chapter 3 also discusses the purpose behind developing a formative evaluation tool - to create an accessible, efficient, intuitive, and expedient way for instructional designers and developers to formatively evaluate their instruction or instructional materials. Chapter 4 focuses on the methodology selected to evaluate the tool, presented in prototype. Chapter 5 presents the results of the evaluation; comments received from the expert reviewers are presented and ideas for tool improvement are generated. Finally, the Appendices include the formative evaluation tool prototype as well as the documentation that accompanied the tool during its evaluation.   The initial idea behind this developmental dissertation was the creation of a formative evaluation tool. The focus of the dissertation itself, however, was on the justification for such a tool, and the literature behind the making of the model and consequently the tool. The result of this developmental dissertation was the prototype of an evaluation tool that with improvements and modifications is deemed promising by the experts who reviewed it. Although designed with formative evaluation in mind, it was generally agreed that this tool could be utilized for both formative and summative evaluation. The expert review was successful not because the tool was without fault, but because the review truly achieved its purpose – to identify areas of strength, weakness, and to suggest improvements.",
  "description_provenance": [
    "Author Email: gwen.ogle@vt.edu",
    "Advisor Email: gholmes@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: cennamo@vt.edu",
    "Advisor Email: lweber@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:54Z (GMT). No. of bitstreams: 2  vita.pdf: 12596 bytes, checksum: c7a9891631ed122dea5e7fd7bdbed361 (MD5)  etd.pdf: 5221786 bytes, checksum: 4c8a79bc05d478cf0ab631a243f99798 (MD5)    Previous issue date: 2002-04-10"
  ],
  "handle": "27309",
  "identifier_other": "etd-04262002-161146",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262002-161146/",
  "identifier_uri": "http://hdl.handle.net/10919/27309",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "vita.pdf",
    "etd.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "evaluation approaches",
    "evaluation tools",
    "evaluation models",
    "evaluation",
    "summative evaluation",
    "formative evaluation",
    "formative evaluation"
  ],
  "title": "Towards A Formative Evaluation Tool",
  "type": "Dissertation"
}