{
  "contributor_author": "Davis, Kirsten A.",
  "contributor_committeechair": "Songer, Anthony D.",
  "contributor_committeemember": [
    "Schulman, Robert S.",
    "de la Garza, Jesus M.",
    "Beliveau, Yvan J.",
    "Bonham, Thirwall W."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:10:56Z",
  "date_adate": "2004-04-28",
  "date_available": "2014-03-14T20:10:56Z",
  "date_issued": "2004-04-23",
  "date_rdate": "2004-04-28",
  "date_sdate": "2004-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This research project investigates individuals'   resistance to change brought about by new information technology implementation in the Architecture, Engineering, and Construction (AEC) industry.  By understanding how individual participants resist and adapt to change, their resistance can be better accommodated by the organization in the adoption of new information technology within the AEC industry.  This enables researchers and practitioners to understand how new technologies should be introduced within organizations.</p>    <p>A social architecture factor model associated with impeding/promoting use of information technologies was created based on a literature review of change management theory on resistance to change and attitude-behavior connections.  In Phase I of the research, the personality traits and behavioral characteristics individuals included in the original model were reduced to a smaller number of variables indicative of resistance to information technology change.  A revised social architecture factor model was created after this reduction.  The variable reduction and revised model were based on data collected from a 50-person sample of the AEC population.  At the conclusion of Phase I, a Resistance to Change Index (RTCI) was created, enabling estimations of the intensity of resistance an individual is likely to exhibit using the personality traits and behavioral characteristics kept in the revised social architecture factor model.</p>      <p>Phase II of the research investigated relationships between the RTCI and demographics of the individual using a 156-person sample of the AEC population.  This phase of the research determined whether different demographic groups within the AEC population exhibited differences in their RTCI.  The data analysis found several demographic groups that were different in their likelihood of resistance, including profession, gender, computer understanding and experience, and awareness of past or future changes occurring in their company.  </p>    <p>Age and education level were expected to have relationships with RTCI, based on industry stereotypes.  The data analysis found that these stereotypes have no scientific basis.  Two other stereotypes, gender and computer understanding and experience, were supported by the data analysis, however. </p>",
  "description_provenance": [
    "Author Email: kidavis2@vt.edu",
    "Advisor Email: schulman@vt.edu",
    "Advisor Email: chema@vt.edu",
    "Advisor Email: yvan@vt.edu",
    "Advisor Email: bonham@vt.edu",
    "Advisor Email: adsonger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:56Z (GMT). No. of bitstreams: 1  davis_etd.pdf: 20492884 bytes, checksum: e33f482544f48283a4f876e21839fd49 (MD5)    Previous issue date: 2004-04-23"
  ],
  "handle": "27316",
  "identifier_other": "etd-04262004-154350",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262004-154350/",
  "identifier_uri": "http://hdl.handle.net/10919/27316",
  "publisher": "Virginia Tech",
  "relation_haspart": "davis_etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Resistance to Change",
    "Change Management",
    "Resistance",
    "Technological Change",
    "Construction Industry",
    "Information Technology"
  ],
  "title": "Information Technology Change in the Architecture, Engineering, and Construction Industry: An Investigation of Individualsâ   Resistance",
  "type": "Dissertation"
}