{
  "contributor_author": "Hayes, Linda Scaparra",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Yakimowski-Srebnick, Mary E.",
    "Parson, Stephen R.",
    "Crockett, Jean B.",
    "Celata, Carla"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:56Z",
  "date_adate": "2004-04-30",
  "date_available": "2014-03-14T20:10:56Z",
  "date_issued": "2004-04-19",
  "date_rdate": "2005-04-30",
  "date_sdate": "2004-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "By July 1, 2003, all Virginia public school teachers must demonstrate proficiency on technology standards mandated by the Virginia Department of Education (VDOE). The responsibility for verifying each teacher’s level of proficiency was delegated to the local school divisions. Public schools across the Commonwealth of Virginia were not given specific direction on how to provide staff development or assess instructional personnel in technology skills except to suggest different web sites on the Department of Education’s home page. The Virginia Department of Education commissioned a study to assess the availability and use of technology in Virginia’s public schools (Virginia Department of Education, 1998a). Recommendations from the study suggest that Virginia should maintain high proficiency standards for teachers and administrators and should consider statewide prototypes, although no prototypes have been recommended by the VDOE. The purpose of this study is to describe and analyze the various methods utilized to assess instructional personnel across the Commonwealth of Virginia on technology standards. A survey was distributed electronically to the directors of technology in each school division in the Commonwealth of Virginia. Methods of assessing instructional personnel, perceptions of effectiveness and cost effectiveness of each method, incentives to meet demonstrated proficiency on the technology standards, and percentage of teachers meeting demonstrated proficiency on the technology standards were assessed on the survey instrument. A 79% response rate indicated that workshops, college courses and portfolio assessment were the methods most used in Virginia public schools. The most effective methods were reported to be workshops, mentoring, performance assessment and college courses. The most cost efficient methods were reported to be portfolio, and signed demonstrative proficiency statement. Recertification points and certificates were the most frequent incentives given to those who demonstrated proficiency of the technology standards. Sixty-nine school divisions reported 80 to 100% of their instructional personnel have demonstrated proficiency on the technology standards as of June 2002.",
  "description_provenance": [
    "Author Email: lihayes@cox.net",
    "Made available in DSpace on 2014-03-14T20:10:56Z (GMT). No. of bitstreams: 1  FinalDissertation.pdf: 3020969 bytes, checksum: 7099a9b493713dcf49b0d542dd5b8996 (MD5)    Previous issue date: 2004-04-19"
  ],
  "handle": "27317",
  "identifier_other": "etd-04262004-163156",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262004-163156/",
  "identifier_uri": "http://hdl.handle.net/10919/27317",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Licensure",
    "Technology Standards",
    "Instructional Personnel"
  ],
  "title": "Methods Used to Determine Technology Competence for Virginia Teachers",
  "type": "Dissertation"
}