{
  "contributor_author": "Cohen, Benjamin R",
  "contributor_committeechair": "Barrow, Mark V. Jr.",
  "contributor_committeemember": [
    "Luke, Timothy W.",
    "La Berge, Ann F.",
    "Goodrum, Matthew R.",
    "Burian, Richard M."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:10:56Z",
  "date_adate": "2005-04-29",
  "date_available": "2014-03-14T20:10:56Z",
  "date_issued": "2005-02-25",
  "date_rdate": "2010-10-12",
  "date_sdate": "2005-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is an analysis of systematic studies of the land in the early American Republic, from the 1790s to the 1840s; more specifically, it explores the role scientific and technical practices played within that eraâ  s improvement ethic.  I argue that science, as seen through the lens of agricultural chemistry and, to a lesser extent, geology, became an important, acceptable, and credible way to interact with early Republic land because it fit within the multivalent improvement ethic of that period. Through a study of the agricultural press, farmersâ   diaries, and county and statewide scientific surveys, I examine how scientific and technical practices aided agricultural improvement, how they were promoted or resisted by local farmers, and in what ways they gained social credibility for interpreting and interacting with agrarian nature.  Part I, â  The Place of Science,â   explores how science was interpreted by people. I there ask about the social, moral, instrumental, and literary places of agricultural science in rural culture. Part II, â  The Science of Place,â   asks instead how science interpreted the land, there studying county and state scientific surveys in Virginia.  Underlying the entire work is an exposition of the georgic ethic (as distinct from the pastoral ethic), which emphasizes the labor-based means through which most rural peoples understood their land and ties the moral plea for cultural improvement to the material pursuit of agricultural progress.<p>  The story herein introduces the production of an important set of conditions that allowed later scientific developments across the land to have meaning and significance: forms of communication, precedents of organization, field-tested modes of analysis, a tradition of improvement and experimentation, the long-standing search for solutions to soil exhaustion, increasingly mechanistic philosophies of soil composition, a market force to drive all of these, and a unique American political and agricultural environment into which the above could take shape. The lesson is not that the entirety of our modern scientific worldview can be traced to the activities of a disgruntled antebellum American farming class, but that this example of rural science and agricultural improvement provides a fruitful example of what it takes to make a scientific worldview. Thus, arguments about philosophical and conceptual bases for scientizing the landâ  topics of great importance in the fields of environmental history and various branches of science and technology studiesâ  gain strength and plausibility by reference to the workings of antebellum agents who first argued over the value of using science to define their land. <p>  By putting the circulation of agricultural science in the context of early Republic improvement-minded agents, we can better locate agrarian American culture into a post-Enlightenment setting, we are better equipped to recognize how everyday citizens came to treat scientific practices as legitimate means of interacting with their lands, and we have a more developed picture of how morality, materiality, and theory were wedded in the much-revered principles of practice and practicality.  The sum of those points highlights how traditional means of managing the land, as with religious doctrine, almanac strictures, the lessons inherited through family lineage by generations of daily practice, or uncodified folk knowledge in general, were being complemented with or displaced by organized, methodical, and systematicâ  eventually, scientificâ  practices on the land.",
  "description_provenance": [
    "Author Email: bcohen@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Advisor Email: alaberge@vt.edu",
    "Advisor Email: goodrum@vt.edu",
    "Advisor Email: barrow@vt.edu",
    "Advisor Email: rmburian@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:56Z (GMT). No. of bitstreams: 1 Notes_from_the_Ground_final.pdf: 5066227 bytes, checksum: de54ec34aa35d0a2ef8f70f34ea9a54b (MD5)   Previous issue date: 2005-02-25"
  ],
  "handle": "27318",
  "identifier_other": "etd-04262005-092204",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262005-092204/",
  "identifier_uri": "http://hdl.handle.net/10919/27318",
  "publisher": "Virginia Tech",
  "relation_haspart": "Notes_from_the_Ground_final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "nature",
    "science",
    "book farming",
    "improvement",
    "agricultural survey",
    "geological survey",
    "georgic ethic",
    "agricultural chemistry",
    "land",
    "place",
    "credibility",
    "authority"
  ],
  "title": "Notes from the Ground: Science and Agricultural Improvement in the Early American Republic",
  "type": "Dissertation"
}