{
  "contributor_author": "McWilliams, Karen P.",
  "contributor_committeechair": "Crockett, Jean B.",
  "contributor_committeemember": [
    "Gatewood, Thomas E.",
    "Driscoll, Lisa G.",
    "Byers, Larry",
    "Barskee-Carrow, Barbara"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:54Z",
  "date_adate": "2004-04-29",
  "date_available": "2014-03-14T20:10:54Z",
  "date_issued": "2004-04-05",
  "date_rdate": "2004-04-29",
  "date_sdate": "2004-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this linear-analytic exploratory case study is to illustrate the reintegration process from acute care and rehabilitative care to the traditional school setting after one has sustained a Traumatic Brain Injury (TBI). TBI is an unrecognized educational challenge. Few educational professionals are aware of the divarication of TBI. Traumatic Brain Injury is the leading cause of death and disability in children and adolescents in the United States. The review of literature reveals there is a void between the requirements of the law and educator preparedness regarding TBI. There is a need for a proactive means to enhance transition and reintegration of a TBI student from rehabilitation to the traditional school setting. The research study showed the schematic efforts of one school division to integrate a TBI student. This exploratory case study emphasized the importance of a proactive education treatment planning process that facilitates the transition to the school setting. The study is qualitative in design and examined the sequence of subtopics of the problem, a review of relevant literature, methods used, findings of the data collected and analyzed, and conclusions and implications from the findings. This case study is analogous to a single experiment. Data were gathered from archival records, educational records, medical records, teachers and therapists comments, friendsâ   perceptions, family histories, recollections, and interviews with participants in the reintegration process. There were three major domains that have been extracted from the case study. The first domain, the strengths and weakness of the student in the post traumatic brain injury environment were collated, collected, and analyzed. The second domain, the adaptation of Larry involved three general sub sets: (1) Larryâ  s self adaptation, (2) the participantsâ   roles in the studentâ  s adaptation, and (3) other influential factors in Larryâ  s adaptation. The third domain centers on the strengths and weaknesses of the strategies used by the school division in the reintegration process. The strengths fell into five general categories; (1) caring professional (2) existing structure for disabled students, (3) cooperation, (4) willingness of general education teachers to make accommodations, and (5) willingness of school-based clinicians to try a variety of approaches. The weaknesses consisted of seven categories; (1) little knowledge of TBI, (2) no in-house pro-active plan,(3) no historical data on TBI, (4) no written records, (5) not central structure (scattered resources), (6) no written plan, and (7) no roster teacher/case manager with authority to direct staff with TBI scenario. The study will enhance the understanding of TBI and will provide a meaningful guide to parents, educators, and school based clinicians. The results illustrated that the data base of this study contained the critical pieces of evidence, this evidence was presented neutrally, and the evidence is valid. A holistic overview of the findings included the major domains and data sources that were explored. Additionally, the integrant building blocks that support this holistic overview are provided. In conclusion this case study discusses implications and recommendations. Of note is the reconciliation of this case study with the literature on TBI.",
  "description_provenance": [
    "Author Email: kahayes@vt.edu, kmcwilliams@manassas.k12.va.us",
    "Advisor Email: tgatewoo@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: lbyers@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:54Z (GMT). No. of bitstreams: 1 Karenfinaletd.pdf: 386234 bytes, checksum: a79965b716a0215f607e046846044a7d (MD5)   Previous issue date: 2004-04-05"
  ],
  "handle": "27312",
  "identifier_other": "etd-04262004-141714",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262004-141714/",
  "identifier_uri": "http://hdl.handle.net/10919/27312",
  "publisher": "Virginia Tech",
  "relation_haspart": "Karenfinaletd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "School Reintegration Planning Guide",
    "Traumatic Brain Injury",
    "Reintegration",
    "Proactive Planning Process"
  ],
  "title": "Traumatic Brain Injury: A Case Study of the School Reintegration Process",
  "type": "Dissertation"
}