{
  "contributor_author": "Hyde, Brian",
  "contributor_committeechair": "Farkas, Diana",
  "contributor_committeemember": [
    "Corcoran, Sean Gerald",
    "Batra, Romesh C.",
    "Reynolds, William T. Jr.",
    "Kampe, Stephen L."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:10:55Z",
  "date_adate": "2004-04-28",
  "date_available": "2014-03-14T20:10:55Z",
  "date_issued": "2004-04-20",
  "date_rdate": "2004-04-28",
  "date_sdate": "2004-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Atomistic computer simulations were performed using embedded atom method interatomic potentials in &alpha;-Fe with impurities and defects.  The effects of intergranular carbon on fracture toughness and the mechanisms of fracture were investigated.  It was found that as the average grain size changes the dominant energy release mechanism also changes.  Because of this the role of the intergranular carbon changes and these mechanisms compete affecting the fracture toughness differently with changing grain size.  Grain boundary accommodation mechanisms are seen to be dominant in the fracture of nanocrystalline &alpha;-Fe.  To supplement this work we investigate grain boundary sliding using the &Sigma; = 5,(310)[001] symmetrical tilt grain boundary.  We observe that in this special boundary sliding is governed by grain boundary dislocation activity with Burgers vectors belonging to the DSC lattice.  The sliding process was found to occur through the nucleation and glide of partial grain boundary dislocations, with a secondary grain boundary structure playing an important role in the sliding process.  Interstitial impurities and vacancies were introduced in the grain boundary to study their role as nucleation sites for the grain boundary dislocations. While vacancies and H interstitials act as preferred nucleation sites, C interstitials do not.",
  "description_provenance": [
    "Author Email: bhyde@vt.edu",
    "Advisor Email: diana@vt.edu",
    "Advisor Email: sgc@vt.edu",
    "Advisor Email: rbatra@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: kampe@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:55Z (GMT). No. of bitstreams: 1 dissertation.pdf: 3707246 bytes, checksum: d327711c64a2890480ebca133d8d4a92 (MD5)   Previous issue date: 2004-04-20"
  ],
  "handle": "27315",
  "identifier_other": "etd-04262004-153825",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262004-153825/",
  "identifier_uri": "http://hdl.handle.net/10919/27315",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fracture",
    "Metals",
    "grain boundaries",
    "atomistic simulations",
    "C",
    "Fe"
  ],
  "title": "Effects of Carbon on Fracture Mechanisms in Nanocrystalline BCC Iron - Atomistic Simulations",
  "type": "Dissertation"
}