{
  "contributor_author": "Yang, Hailing",
  "contributor_committeechair": "Ward, Thomas C.",
  "contributor_committeemember": [
    "Long, Timothy E.",
    "Wilkes, Garth L.",
    "Moffitt, Ronald D.",
    "Marand, Hervé L."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:10:57Z",
  "date_adate": "2006-05-08",
  "date_available": "2014-03-14T20:10:57Z",
  "date_issued": "2006-04-21",
  "date_rdate": "2009-05-08",
  "date_sdate": "2006-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Adhesion Studies of Polymers: (I) Autohesion of Ethylene/1-Octene Copolymers; (II) Method Development and Adhesive Characterization of Pressure Sensitive Adhesive in Paper Laminates for Postage Stamps  Hailing Yang (Abstract) Autohesion is defined as the resistance to separation of two bonded identical films that have been joined together for a period of time under a given temperature and pressure. Studies on the autohesion phenomenon can provide fundamental insights into the physical processes of adhesive bond and failure, as well as the practical engineering issues such as crack healing, elastomer tack, polymer fusion, self-healing, and polymer welding. In the first part of this dissertation work, four ethylene/1-octene (EO) copolymers were used in the present study consisting of molecules with linear polyethylene backbone to which hexyl groups are attached at random intervals. These copolymers have similar number-average molecular weight (Mn) and polydispersity, but different 1-octene content. These hexyl groups act as the short branches and hinder the crystallization, reduce density to some extent in the solid state, lower the melting temperature, and decrease the stiffness of the bulk materials. A full understanding of the autohesion behavior of the ethylene/1-octene copolymers involves investigations at three different length scales: 1) the molecular scale which controls the interfacial structure; 2) the mesoscopic or microscopic scale which can provide information on the formation of interfaces and on how the energy is dissipated during a fracture process; and 3) the macroscopic scale at which the mechanical properties such as fracture energy can be obtained for a particular test geometry. In the present study, the effects of the branch content on the formation and fracture of the interface of these ethylene/1-octene assemblies were evaluated at the bonding temperatures (Tb) and bonding times (tb). The correlation among these three length scales was also investigated and modeled.  The adhesion strength of these symmetric interfaces of EO copolymers was investigated by T-peel fracture tests. The fracture of the interface is an irreversible entropy creating process which involved a substantial amount of energy dissipation. The results of such mechanical tests with respect to the bonding temperature (Tb), bonding time (tb) and peel rate indicated this energy dissipation is the result of a complicated interplay between the ability of the interface to transfer stress and its plastic and viscoelastic deformation properties. When Tb is much higher than the characteristic temperature (Tc), the interfaces were completely healed and cohesive failure was observed in T-peel tests. In this case, the fracture strength decreased with increasing branch content. In contrast, when Tb is very close to Tc, the fracture strength showed an increase with the branch content with either interfacial failure or cohesive failure being observed depending on the branch content and Tb. At higher peel rates, it is observed that higher peel energies are required to fracture the surfaces. Transmission electron microscopy (TEM) showed that the interfacial/interphase structure changed from amorphous to crystalline with an increase in the Tb.   The results from the bonding time effect studies showed that the peel energy is proportional to tb1/2 regardless of Tb. But the branch content and the Tb play an important role on the seal rate. Thus, higher seal rate was found for higher Tb and higher branch content. These results also suggest that the autohesion of ethylene/1-octene copolymers are strongly associated with the interactions of melted chains. The chain compositions of these Zeigler-Natta EO copolymers are highly heterogeneous with the branches concentrated in the lower molecular weight portion. Long linear chain segments could form large, well-ordered crystals that provide strong anchors for the tie molecules and therefore determine the density of inter-crystalline links. Short chains with lots of branches could behave as protrusions along the chain to obstruct chain disentanglement and limit a chain from sliding through a crystal. Due to these reasons, the short chains with branches would contribute much less than the long linear chains to the full peel strength after complete sealing. However, higher peel strengths could be obtained only at the higher temperatures or longer bonding times at which the long linear chains begin to melt and diffuse across the interface. On the other hand, the higher branch content samples have the lower crystallinity and could obtain the higher chain mobility at the lower bonding temperatures and with shorter bonding times. Therefore, higher seal strength was observed for the higher branch content samples at lower Tb.  Following T-peel fracture tests of ethylene/1-octene copolymer assemblies which showed interfacial failures, the fractured surfaces were investigated by using Atomic Force Microscopy (AFM) and characterized by fractal analysis together with the original films. The AFM images showed strong dependence on the peel rate and branch content.  Quantitatively, the fractal analyses demonstrated fractal characteristics at the different finite scales. Two regimes showing fractal features were identified for each surface. In regime I (low magnifications) the fracture test did not change the fractal dimensions much. But there were significant changes in regime II before welding and after T-peel fracture tests. The length scale that separated these two regimes is very close to the size of lamellar structures. The characteristic sizes at which the fractal characteristics emerge were shown to appear at larger scales for surfaces fractured at higher peel rates. This suggests that the appearance of fractal behavior at larger scales requires higher fracture energies. The characteristic sizes and fractal dimensions were shown to depend on the molecular structure. Because the fractal analysis suggests at least some crystalline lamellae on the surfaces still existed during T-peel fracture tests, a â  Stitch-weldingâ   has been therefore proposed as the autohesion mechanism in which only chains in the amorphous portions could inter-diffuse. In the second part of this dissertation work, a multi-layer lap-shear geometry has been designed and proven as a reliable testing method in evaluation of the dynamical mechanical properties of polyacrylic pressure sensitive adhesive (PSA) in paper lamination for postage stamp applications. In-situ testing of four different PSA stamp laminates constructed by laminating water-based polyacrylic PSAs to the stamp face papers were carried out using a dynamic mechanical analyzer (DMA) in the temperature range from -50 to 60 oC at frequencies 0.1, 1, 10, and 100 Hz. This geometry requires the tension mode on the DMA, but the results which were recorded as tensile properties were converted to shearing properties of the PSA layers in the laminate. The effect of the thickness (layers of laminates) on the dynamical mechanical properties has been studied and the results suggested that a multi-layer geometry with 5-10 layers could be an appropriate structure to produce enhanced responses. Therefore, the geometry with 8-layer laminates was used for frequency sweep/isothermal temperature and frequency sweep/temperature step tests. The results showed three relaxation responses that is, glassy, transition, and flow regions with respect to the frequencies and temperatures. These results also implied the viscoelastic characteristics of these PSA products. The tensile properties of the face papers were also tested using the same parameters as those of the multi-layer geometry. Significant differences were found between the shearing behaviors of the multi-layer geometry and the tensile behaviors of the elastic face paper. This suggests that the tensile deformation of the face paper in the multi-layer geometry could be ignored and the elastic paper did not contribute to the shearing properties of the PSA layers. Time-temperature superposition curves have been produced with reference temperature set at 23 oC, which can be used to predict the long term and short term performances of these samples at this temperature.  This method can be utilized as a standard testing method on the PSA adhesives in the laminate form. In addition to the dynamic mechanical properties, it can also be developed to be a general standard method on testing the rheological properties of adhesives, polymer melts and other viscous materials.",
  "description_provenance": [
    "Author Email: hayang@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: glwilkes@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: rmoffitt@vt.edu",
    "Advisor Email: hmarand@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:57Z (GMT). No. of bitstreams: 1 HailingYangRevisedDissertation2006.pdf: 8762177 bytes, checksum: c2899b434ca6d3d3fff8e0134a0dc6e5 (MD5)   Previous issue date: 2006-04-21"
  ],
  "handle": "27325",
  "identifier_other": "etd-04262006-221103",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262006-221103/",
  "identifier_uri": "http://hdl.handle.net/10919/27325",
  "publisher": "Virginia Tech",
  "relation_haspart": "HailingYangRevisedDissertation2006.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Autohesion",
    "Postage Stamp",
    "Viscoelsticity",
    "Fractals Analysis",
    "Pressure-Sensitive Adhesive",
    "LLDPE",
    "Fracture",
    "Multilayer Lap-shear",
    "Ethylene/1-Octene Copolymers",
    "and Time-Temperature Superposition"
  ],
  "title": "Adhesion Studies of Polymers: (I) Autohesion of Ethylene/1-Octene Copolymers; (II) Method Development and Adhesive Characterization of Pressure Sensitive Adhesive in Paper Laminates for Postage Stamps",
  "type": "Dissertation"
}