{
  "contributor_author": "Arbogast II, Terry E.",
  "contributor_committeechair": "Salmon, Richard G.",
  "contributor_committeemember": [
    "Inman, Deborah",
    "Twiford, Travis W.",
    "Alexander, M. David",
    "Underwood, Julie"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:57Z",
  "date_adate": "2005-04-28",
  "date_available": "2014-03-14T20:10:57Z",
  "date_issued": "2005-04-21",
  "date_rdate": "2007-04-28",
  "date_sdate": "2005-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>The research in this document provides a comprehensive investigation of public K â   12 funding in Virginia over the time period from 1974-75 to 2002-2003. No previous examination has been conducted for the Commonwealth of Virginia that has comprehensively analyzed the data over the life of the current finance formula. Over this approximate thirty-year time period, the trends in fiscal equity among school divisions were determined. The purpose of this research was to provide a better understanding of the current status of funding equity for the Commonwealth of Virginia and to document information that could be used in future litigation concerning the issue of both fiscal equity and educational adequacy. <p>To conduct this study, research studies and information pertaining to national funding issues, as well as Virginia funding issues, were collected and analyzed. This information, as well as prior litigation, was obtained from searches on ERIC, the Internet, and Westlaw. Next, fiscal and student data were obtained from the Virginia Education Association (VEA), the United States Department of Education, Bureau of Federal Impact Aid, and the Virginia Department of Education (VDOE) for the funding periods from FYs 1975 to 2003. These data included information regarding state expenditures, local expenditures, state sales taxes, federal revenue, and other fiscal and non-fiscal data pursuant to each of the approximately one hundred and thirty-five school divisions in Virginia. <p>The study also provided an analysis of the evolution of fiscal equity litigation during this time period. Further, the data obtained from the VEA and VDOE were examined to determine whether the funding disparities among school divisions have become more evident or less evident over this time period. In order to determine this, a series of statistics were applied to comparable data to determine the level of fiscal equity achieved by the Commonwealth for each of the selected fiscal years. The Verstegen-Stevens Fiscal Equity Statistics software was used with permission to apply the generally accepted equity statistics.",
  "description_provenance": [
    "Author Email: tarbogast@gilesk12.org",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:57Z (GMT). No. of bitstreams: 1 Arbogast.pdf: 3866076 bytes, checksum: d20c4671e1dc64c36680b6b515ef5970 (MD5)   Previous issue date: 2005-04-21"
  ],
  "handle": "27323",
  "identifier_other": "etd-04262005-222542",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262005-222542/",
  "identifier_uri": "http://hdl.handle.net/10919/27323",
  "publisher": "Virginia Tech",
  "relation_haspart": "Arbogast.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Educational Finance",
    "Elementary/Secondary Education",
    "Equity"
  ],
  "title": "An Historical Analysis on Fiscal Equity in Virginia 1974-2003",
  "type": "Dissertation"
}