{
  "contributor_author": "Juhan, Nicole McKeown",
  "contributor_committeechair": "Meng, Xiang-Jin",
  "contributor_committeemember": [
    "Huckle, William R.",
    "Tolin, Sue A.",
    "Boyle, Stephen M.",
    "Toth, Thomas E.",
    "Eng, Ludeman A."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:10:58Z",
  "date_adate": "2007-05-07",
  "date_available": "2014-03-14T20:10:58Z",
  "date_issued": "2007-04-20",
  "date_rdate": "2009-05-07",
  "date_sdate": "2007-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The non-pathogenic porcine circovirus type 1 (PCV1) was originally isolated as a persistent contaminant of the porcine kidney cell line PK-15.  Whereas, porcine circovirus type 2 (PCV2) causes postweaning multisystemic wasting syndrome (PMWS) in pigs, which is devastating to the swine industry.  My objectives were to determine the effect of maternally derived antibodies on PCV2 infection, assess the role of 2 amino acid substitutions in the PCV2 capsid protein in PCV2 attenuation, evaluate the effect of Rep gene exchange between PCV1 and PCV2 on growth characteristics of a chimeric PCV2, and evaluate the role of open reading frame (ORF) 3 of PCV2 in virus replication and pathogenesis in pigs. Under field conditions, PCV2 infection is widespread and most breeding pigs are seropositive.  Assessment of the role of PCV2 maternal antibodies in preventing PCV2 infection in piglets provided evidence that higher levels of maternal antibody provide more protection to piglets. Two amino acid substitutions in the PCV2 capsid protein that enhanced virus replication in vitro and attenuated the virus in vivo were evaluated for their pathogenicity in pigs.  The results indicated that P110A and R191S are collectively responsible for virus attenuation. \tPCV1 replicates better in PK-15 cells and grows at least 1-log titer higher than PCV2.  A chimeric PCV with the rep gene of PCV1 replacing that of PCV2 in the genomic backbone of PCV2 replicated more rapidly than PCV1 and PCV2, and more efficiently than PCV2, although to a titer similar to PCV1. \tThe ORF3 of PCV2 is believed to encode a protein involved in apoptosis.  The ORF3 start codon was mutated from ATG to GTG and the resulting mutant muPCV2 was infectious in vitro and in pigs; therefore ORF3 is dispensable for virus replication. The pathogenicity of muPCV2 was compared with PCV2 in vivo.  Delayed viremia and seroconversion, decreased viral loads, lower level of IgG antibodies, and lower amounts of PCV2 antigen in mesenteric lymph nodes suggested attenuation of muPCV2.  However, there was no significant difference in histological or gross lesions in tissues between PCV2- and muPCV2-inoculated groups.  The role of ORF3 in attenuation needs to be further elucidated.",
  "description_provenance": [
    "Author Email: nmckeown@vt.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: stolin@vt.edu",
    "Advisor Email: xjmeng@vt.edu",
    "Advisor Email: smboyle@vt.edu",
    "Advisor Email: ttoth@vt.edu",
    "Advisor Email: leng@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:58Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 692883 bytes, checksum: 93ea6843808f8f53d8ddfcbb6b2ba1a1 (MD5)   Previous issue date: 2007-04-20"
  ],
  "handle": "27329",
  "identifier_other": "etd-04262007-152532",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262007-152532/",
  "identifier_uri": "http://hdl.handle.net/10919/27329",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Postweaning multisystemic wasting syndrome",
    "virology",
    "molecular biology",
    "PMWS",
    "TT virus",
    "TTV",
    "PCV2",
    "Porcine circovirus"
  ],
  "title": "Molecular mechanisms of porcine circovirus 2 replication and pathogenesis",
  "type": "Dissertation"
}