{
  "contributor_author": "Amichev, Beyhan Y.",
  "contributor_committeechair": "Burger, James A.",
  "contributor_committeemember": [
    "Zelazny, Lucian W.",
    "Galbraith, John M.",
    "Prisley, Stephen P.",
    "Daniels, Walter Lee",
    "Fox, Thomas R."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:10:58Z",
  "date_adate": "2007-05-11",
  "date_available": "2014-03-14T20:10:58Z",
  "date_issued": "2007-04-11",
  "date_rdate": "2009-05-11",
  "date_sdate": "2007-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Carbon accreditation of forest development projects is essential for sequestering atmospheric CO2 under the provisions of the Kyoto Protocol. The carbon sequestration potential of surface coal-mined lands is not well known. The purpose of this work was to determine how to measure carbon sequestration and estimate the additional amount that could be sequestered using different reforestation methods compared to the common practice of establishing grasslands.    I developed a thermal oxidation technique for differentiating sequestered soil carbon from inorganic and fossilized carbon found at high levels in mine soils along with a geospatial and statistical protocol for carbon monitoring and accounting. I used existing tree, litter, and soil carbon data for 14 mined and 8 adjacent, non-mined forests in the Midwestern and Eastern coal regions to determine, and model sequestered carbon across the spectrum of site index and stand age in pine, mixed, and hardwood forest stands. Finally, I developed the framework of a decision support system consisting of the first iteration of a dynamic model to predict carbon sequestration for a 60-year period for three forest types (white pine, hybrid poplar, and native hardwoods) at three levels of management intensity: low (weed control), medium (weed control and tillage) and high (weed control, tillage, and fertilization).  On average, the highest amount of ecosystem carbon on mined land was sequestered by pine stands (148 Mg ha-1), followed by hardwood (130 Mg ha-1) and mixed stands (118 Mg ha-1). Non-mined hardwood stands contained 210 Mg C ha-1, which was about 62% higher than the average of all mined stands. After 60 years, the net carbon in ecosystem components, wood products, and landfills ranged from 20 to 235 Mg ha-1 among all scenarios. The highest net amount of carbon was estimated under mixed hardwood vegetation established by the highest intensity treatment. Under this scenario, a surface-mined land of average site quality would sequester net carbon stock at 235 Mg C ha-1, at a rate of 3.9 Mg C ha-1 yr-1, which was 100% greater than a grassland scenario. Reforestation is a logical choice for mined land reclamation if carbon sequestration is a management objective.",
  "description_provenance": [
    "Author Email: bamichev@vt.edu",
    "Advisor Email: zelazny@vt.edu",
    "Advisor Email: ttcf@vt.edu",
    "Advisor Email: prisley@vt.edu",
    "Advisor Email: wdaniels@vt.edu",
    "Advisor Email: trfox@vt.edu",
    "Advisor Email: jaburger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:58Z (GMT). No. of bitstreams: 1 Amichev_ETD_April25_2007_3.pdf: 18196479 bytes, checksum: d787b551f0b8589409b18736e8653284 (MD5)   Previous issue date: 2007-04-11"
  ],
  "handle": "27328",
  "identifier_other": "etd-04262007-102427",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262007-102427/",
  "identifier_uri": "http://hdl.handle.net/10919/27328",
  "publisher": "Virginia Tech",
  "relation_haspart": "Amichev_ETD_April25_2007_3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "geogenic carbon",
    "decision support system",
    "wood products",
    "mine soils",
    "pedogenic carbon",
    "soil organic carbon sequestration",
    "field protocol for carbon inventory"
  ],
  "title": "Biogeochemistry of Carbon on Disturbed Forest Landscapes",
  "type": "Dissertation"
}