{
  "contributor_author": "Einsla, Brian Russel",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Dillard, John G.",
    "Riffle, Judy S.",
    "Leo, Donald J.",
    "Esker, Alan R."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:10:56Z",
  "date_adate": "2005-04-27",
  "date_available": "2014-03-14T20:10:56Z",
  "date_issued": "2005-04-01",
  "date_rdate": "2005-04-27",
  "date_sdate": "2005-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Novel proton exchange membranes (PEMs) were investigated that show potential for operating at higher temperatures in both direct methanol (DMFC) and H2/air PEM fuel cells.  The need for thermally stable polymers immediately suggests the possibility of heterocyclic polymers bearing appropriate ion conducting sites.  Accordingly, monomers and random disulfonated poly(arylene ether) copolymers containing either naphthalimide, benzoxazole or benzimidazole moieties were synthesized via direct copolymerization.  The ion exchange capacity (IEC) was varied by simply changing the ratio of disulfonated monomer to nonsulfonated monomer in the copolymerization step.  Water uptake and proton conductivity of cast membranes increased with IEC.  The water uptake of these heterocyclic copolymers was lower than that of comparable disulfonated poly(arylene ether) systems, which is a desirable improvement for PEMs.  Membrane electrode assemblies were prepared and the initial fuel cell performance of the disulfonated polyimide and polybenzoxazole (PBO) copolymers was very promising at 80 C compared to the state-of-the-art PEM (NafionÂ®); nevertheless these membranes became brittle under operating conditions.  Several series of poly(arylene ether)s based on disodium-3,3â  -disulfonate-4,4â  -dichlorodiphenylsulfone (S-DCDPS) and a benzimidazole-containing bisphenol were synthesized and afforded copolymers with enhanced stability.  Selected properties of these membranes were compared to separately prepared miscible blends of disulfonated poly(arylene ether sulfone) copolymers and polybenzimidazole (PBI).  Complexation of the sulfonic acid groups with the PBI structure reduced water swelling and proton conductivity.  The enhanced proton conductivity of NafionÂ® membranes has been proposed to be due to the aggregation of the highly acidic side-chain sulfonic acid sites to form ion channels.  A series of side-chain sulfonated poly(arylene ether sulfone) copolymers based on methoxyhydroquinone was synthesized in order to investigate this possible advantage and to couple this with the excellent hydrolytic stability of poly(arylene ether)s.  The methoxy groups were deprotected to afford reactive phenolic sites and nucleophilic substitution reactions with functional aryl sulfonates were used to prepare simple aryl or highly acidic fluorinated sulfonated copolymers.  The proton conductivity and water sorption of the resulting copolymers increased with the ion exchange capacity, but changing the acidity of the sulfonic acid had no apparent effect.",
  "description_provenance": [
    "Author Email: beinsla@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: donleo@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:56Z (GMT). No. of bitstreams: 1 dissertation.pdf: 2935578 bytes, checksum: 00eaba56bb6b99384cfdac9a155729dc (MD5)   Previous issue date: 2005-04-01"
  ],
  "handle": "27320",
  "identifier_other": "etd-04262005-140621",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262005-140621/",
  "identifier_uri": "http://hdl.handle.net/10919/27320",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "poly(arylene ether)",
    "polybenzimidazole",
    "polybenzoxazole",
    "polyimide",
    "sulfonated copolymers",
    "proton exchange membrane",
    "fuel cell"
  ],
  "title": "High Temperature Polymers for Proton Exchange Membrane Fuel Cells",
  "type": "Dissertation"
}