{
  "contributor_author": "Amedy, Lynn",
  "contributor_committeechair": "Curcio, Joan L.",
  "contributor_committeemember": [
    "Cline, Marvin Gerald",
    "Hardebeck, Mary Anne",
    "Richards, Robert R.",
    "Parson, Stephen R.",
    "Sughrue, Jennifer A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:59Z",
  "date_adate": "1999-04-28",
  "date_available": "2014-03-14T20:10:59Z",
  "date_issued": "1999-04-15",
  "date_rdate": "2000-04-28",
  "date_sdate": "1999-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Remarkably few females hold the position of superintendent; although, there are capable women in the educational field who are qualified and interested. Researchers proposed many reasons for this disparity including the lack of studies regarding females in the superintendency. This void has made it difficult to determine a clear picture of what leadership behaviors female superintendents employ. Research questions included: (1) What leadership assumptions appear to form the basis for the leadership behaviors of these presently practicing female superintendents? (2) In what ways do those within each district leadership circle respond to these female superintendents when they function as leaders? (3) What political, educational, and demographic contexts frame the leadership behaviors of these female superintendents?  The purpose of this study was to identify and describe through case studies the leadership concepts drawn upon by specific females presently serving in the role of superintendent, the responses of those within the leadership circle regarding these leadership choices, and the situations that drove these superintendents' leadership decisions. Multiple case study design as well as multiple data gathering methods were employed in this study. The leadership choices of female superintendents were investigated in depth through interview, observation, and document analysis. Data was transcribed and coded using Ethnograph software. Common themes and patterns emerged through analysis of statements, situations observed, and interpretation of data collected.  These understandings have implications for the training and preparation of women for the superintendency. The study's findings indicated how these female superintendents applied their skills to leadership situations. These findings provided a baseline understanding of how these women proceeded in a top-level position such as the superintendency. In their own words, these women aided in creating a more comprehensive picture of a practicing female superintendent.",
  "description_provenance": [
    "Author Email: mlynnrob@aol.com",
    "Advisor Email: jcurcio@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:59Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 253541 bytes, checksum: 7cd0b827716748a84a400e4d0c5093b8 (MD5)   Previous issue date: 1999-04-15"
  ],
  "handle": "27336",
  "identifier_other": "etd-042699-151803",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042699-151803/",
  "identifier_uri": "http://hdl.handle.net/10919/27336",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Leadership",
    "Female Superintendents",
    "Women's Studies"
  ],
  "title": "A Qualitative Study of Female Superintendents:  Leadership Behaviors in Context",
  "type": "Dissertation"
}