{
  "contributor_author": "Guerra Huaman, Moises Daniel",
  "contributor_committeechair": "Ball, Joseph A.",
  "contributor_committeemember": [
    "Hagedorn, George A.",
    "Renardy, Michael J.",
    "Kim, Jong Uhn"
  ],
  "contributor_department": "Mathematics",
  "date_accessioned": "2014-03-14T20:10:58Z",
  "date_adate": "2011-05-12",
  "date_available": "2014-03-14T20:10:58Z",
  "date_issued": "2011-04-18",
  "date_rdate": "2011-05-12",
  "date_sdate": "2011-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "We study the structure of the set of extreme points of the compact convex set of matrix-valued holomorphic functions with positive real part on a finitely-connected planar domain R normalized to have value equal to the identity matrix at some prescribed point t0 in R. This leads to an integral representation for such functions more general than what would be expected from the result for the scalar-valued case. After Cayley transformation, this leads to a integral Agler decomposition for the matrix Schur class over R (holomorphic contractive matrix-valued functions over R). Application of a general theory of abstract Schur-class generated by a collection of test functions leads to a transfer-function realization for the matrix Schur-class over R, extending results known up to now only for the scalar case. We also explain how these results provide a new perspective for the dilation theory for Hilbert space operators having R as a spectral set.",
  "description_provenance": [
    "Author Email: moisesgg@vt.edu",
    "Advisor Email: ball@.vt.edu",
    "Advisor Email: hagedorn@vt.edu",
    "Advisor Email: mrenardy@vt.edu",
    "Advisor Email: kim@math.vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:58Z (GMT). No. of bitstreams: 1 GuerraHuaman_MD_D_2011.pdf: 470943 bytes, checksum: a4e63623d4a67644668193a94f04e8cf (MD5)   Previous issue date: 2011-04-18"
  ],
  "handle": "27334",
  "identifier_other": "etd-04262011-111257",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262011-111257/",
  "identifier_uri": "http://hdl.handle.net/10919/27334",
  "publisher": "Virginia Tech",
  "relation_haspart": "GuerraHuaman_MD_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "completely positive kernel",
    "extreme points.",
    "Schur class",
    "test functions"
  ],
  "title": "Schur-class of finitely connected planar domains: the test-function approach",
  "type": "Dissertation"
}