{
  "contributor_author": "Castanos, Ines Carolina",
  "contributor_committeechair": "Piercy, Fred P.",
  "contributor_committeemember": [
    "Scott, William",
    "Few-Demo, April L.",
    "Johnson, Scott W.",
    "Allen, Katherine R."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:58Z",
  "date_adate": "2009-06-08",
  "date_available": "2014-03-14T20:10:58Z",
  "date_issued": "2009-04-13",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Family businesses are a specific type of businesses that combine the family system with the business system. In this new system, emotions play an important role due to the long term relationships that exist amongst family members.  This emotional component provides family businesses with unique advantages as well as challenges. <p> Marriage and family therapists (MFTs) understand human relationships from a systemic approach.  This specific training allows MFTs to be particularly well suited to help family businesses better deal with relational issues they might face by providing families with a different perspective for solution.  Currently there is no consensus regarding the specific training MFTs should undergo in order to be better prepared to provide consulting services to family businesses. <p>  To meet this need, the purpose of this study is to identify the content for a model curriculum for MFT graduate students in family business consultation.  A modified Delphi method with a mixed methods approach was used to obtain the content that a model curriculum should have.   The Delphi method was used to obtain consensus on the opinions of MFT experts in family business consultation.  A mixed methodology was used to triangulate the data obtained and to enrich the data gathered from a quantitative analysis. The results of this study show that marriage and family therapists wishing to pursue a career as family business consultants would benefit from additional training in the following specific areas: multidisciplinary theoretical approaches to understanding family businesses, consultation as a business, differences between consultation and therapy, and supervised practice.   These results allowed the creation of curriculum components that could be used for a family business consultation course, workshops, and other educational events.  Specialized training can help therapists provide better services to family businesses as well as an additional career avenue for the field of family therapy.",
  "description_provenance": [
    "Author Email: carocas@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: wscott@radford.edu",
    "Advisor Email: alfew@vt.edu",
    "Advisor Email: scottwj@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:58Z (GMT). No. of bitstreams: 1 dissertation.pdf: 1579496 bytes, checksum: 89ddc3fc6c8c97de019f04f291418199 (MD5)   Previous issue date: 2009-04-13"
  ],
  "handle": "27332",
  "identifier_other": "etd-04262009-154837",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04262009-154837/",
  "identifier_uri": "http://hdl.handle.net/10919/27332",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "family business consultation",
    "marriage and family therapy curriculum",
    "and training"
  ],
  "title": "Family Business Consultation: A Delphi Study to Develop a Model Curriculum for Marriage and Family Therapists.",
  "type": "Dissertation"
}