{
  "contributor_author": "Schultz, Sheila R.",
  "contributor_committeechair": "Cline, Marvin Gerald",
  "contributor_committeemember": [
    "Parson, Stephen R.",
    "Hauenstein, Neil M. A.",
    "Wiswell, Albert W.",
    "Fortune, Jimmie C."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:10:59Z",
  "date_adate": "2000-05-01",
  "date_available": "2014-03-14T20:10:59Z",
  "date_issued": "2000-04-11",
  "date_rdate": "2001-05-01",
  "date_sdate": "2000-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The current study used data gathered as part of the Head Start/Public School Transition Project (Virginia Site), and included only data on the children who were part of  Cohort II (i.e., enrolled in kindergarten in 1993).  This database was examined to determine how select child and family characteristics uniquely contributed to parents' and teachers' ratings of the children's social skills and problem behaviors.  A series of exploratory factor analyses (EFA), using principal components extraction and varimax rotation, were conducted to identify from the available database underlying constructs associated with the children's development of social skills and problem behaviors.  Results of the EFA were used to construct predictor and dependent variables.  Separate univariate models were established at four time points and hierarchical multiple regression was used to examine the unique contributions of the various predictors of parent and teacher ratings of children's social skills and problem behaviors.  Of the demographic variables examined, the unique contribution of Hispanic ethnicity to parents' ratings of the children's social skills and problem behaviors was significant at all time points.  Other predictors that were significant and uniquely contributed the most to parents' ratings of the children's social skills included the family's routine (beginning of kindergarten), parenting style (end of kindergarten), and attitudes about the neighborhood (end of first grade).  Parents' attitudes about the behavior of children in the school was a significant predictor of parents' ratings of the children's problem behaviors.  None of the predictors contributed significantly to the teacher's ratings of the children's social skills or problem behaviors.",
  "description_provenance": [
    "Author Email: sschultz@humrro.org",
    "Advisor Email: mcline@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:59Z (GMT). No. of bitstreams: 7 etdREFERENCES.pdf: 40471 bytes, checksum: 3fe543d90092aea22b5cd94989d99112 (MD5) etdCONCLUSION-Chap5.pdf: 26401 bytes, checksum: 8eb650fee83b7bbac752af935537aae1 (MD5) etdRevRESULT-CHAP4.pdf: 597636 bytes, checksum: 5c262ded6719dded4d31b8beeb53ceb6 (MD5) etdRevMETHOD-CHAP3.pdf: 695825 bytes, checksum: 3d5bc6b7582983d1f3c1ae83f496216b (MD5) etd-LITERATURE-CHAP2.pdf: 96328 bytes, checksum: e9c35027bcd29ab7b41acee812a9cd0a (MD5) etdSTATPROB-CHAP1.pdf: 16553 bytes, checksum: 3e63d90ee06de3ec07ef6260e2a4fce4 (MD5) etdFrontMatter1.pdf: 69079 bytes, checksum: 25f4e4b4d934c47259ff8723807ab9e3 (MD5)   Previous issue date: 2000-04-11"
  ],
  "handle": "27338",
  "identifier_other": "etd-04272000-10170049",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272000-10170049/",
  "identifier_uri": "http://hdl.handle.net/10919/27338",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etdREFERENCES.pdf",
    "etdCONCLUSION-Chap5.pdf",
    "etdRevRESULT-CHAP4.pdf",
    "etdRevMETHOD-CHAP3.pdf",
    "etd-LITERATURE-CHAP2.pdf",
    "etdSTATPROB-CHAP1.pdf",
    "etdFrontMatter1.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "hierarchical multiple regression",
    "factor analysis",
    "disadvantaged children",
    "Head Start",
    "social growth"
  ],
  "title": "Socioemotional Development of Low-Income Children in the Public School Intervention Program",
  "type": "Dissertation"
}