{
  "contributor_author": "Klunk, Clare Dvoranchik",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "White, Orion F. Jr.",
    "Cline, Marvin Gerald",
    "McKeen, Ronald L.",
    "Stubblefield, Harold W."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:10:59Z",
  "date_adate": "1999-05-05",
  "date_available": "2014-03-14T20:10:59Z",
  "date_issued": "1999-04-14",
  "date_rdate": "2000-05-05",
  "date_sdate": "1999-04-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Many successful professionals, recognized for their experience, knowledge, competence and commitment to their field, experience a contradiction when they realize that their contributions are no longer valued by decision-makers in their organizations.  Professionals, regardless of gender, position, education, race or profession, who experience workplace devaluation agree that this experience devalues their contributions and demeans their sense of self.  \tThis study illuminates the professionals' perspective of workplace devaluation through their experience.  Within the framework of grounded theory methodology, this research examined three research questions:  (a) What is the experience of professionals' workplace devaluation? (b) How did professionals learn from the experience?  (c) What did professionals learn from the experience?  The unit of analysis is the professional within an organization.  Four participants were selected who (a) had several years experience with their organization; (b) were previously valued by the organization; (c) were current in their field; (d) had experienced workplace devaluation; and (e) were able to articulate insights, thoughts, and emotions on their experience.  Multiple interviews with each participant provided the data.    \tA comparative, iterative analysis of the data yielded: (a) a seven-phase process of the experience; (b) six constructs embedded in the process, and (c) four categories of learning.  The dialogic interview method facilitated the participants' apperception, reflection, and progress through the process.  Three emotions--fear, powerlessness, anger--and their interaction with the other constructs (autonomy, communication, personalization, authority, and recognition) influenced coping strategies and actions taken by each participant. The four narratives explicate the interrelationships of the findings.  Three major conclusions are:  (a) A rich description of the workplace devaluation experience offers a glimpse into the complexity of this topic and into the professionals' \"lived world.\"  (b) The learning process, grounded in the data, depicts how these four professionals used the power of their emotions to create balance within themselves as they attempted to explicate their situation of workplace devaluation.  (c) The results indicate that greater learning occurred in organizational knowledge and intrapersonal knowledge for these professionals.  Questions for further research are noted along with practical suggestions and recommendations for the praxis of adult educators, decision-makers, and professionals.",
  "description_provenance": [
    "Author Email: cdvoranc@capaccess.org",
    "Advisor Email: orionwhite@erols.com",
    "Advisor Email: mcline@vt.edu",
    "Advisor Email: marcie@vt.edu",
    "Made available in DSpace on 2014-03-14T20:10:59Z (GMT). No. of bitstreams: 2 etd2.pdf: 20633 bytes, checksum: 9fca32a4e64de87b58c08114d15c144e (MD5) etd1.pdf: 534636 bytes, checksum: 9bcfd4b9bb2118a3b23b7b230f8b9cab (MD5)   Previous issue date: 1999-04-14"
  ],
  "handle": "27337",
  "identifier_other": "etd-042699-162003",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042699-162003/",
  "identifier_uri": "http://hdl.handle.net/10919/27337",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etd2.pdf",
    "etd1.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "dialogic interview",
    "transpersonal learning",
    "workplace devaluation",
    "reflection",
    "organization culture; professionals' learning",
    "adult learning theory",
    "grounded theory",
    "learning from experience",
    "transformative learning"
  ],
  "title": "Workplace Devaluation:  Learning from Experience",
  "type": "Dissertation"
}