{
  "contributor_author": "Stuart, Virginia Barr",
  "contributor_committeecochair": [
    "Niles, Jerome A.",
    "Parson, Stephen R."
  ],
  "contributor_committeemember": [
    "Shareef, Reginald A. T.",
    "Yardley, Dianne R.",
    "Harris, Larry A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:00Z",
  "date_adate": "2000-04-27",
  "date_available": "2014-03-14T20:11:00Z",
  "date_issued": "2000-03-29",
  "date_rdate": "2001-04-27",
  "date_sdate": "2000-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "An acute shortage of African American teachers is well recognized. This shortage poses a problem as school systems  attempt to employ a representative number of African American teachers commensurate to their diverse student population. The purpose of this study was to examine why 10 African American teachers in Roanoke City selected teaching and remain in the profession and how those reasons were influenced by two motivational variables (academic self-concept of ability and self-efficacy). Factors further affecting this relationship, such as environmental influences (i.e., home, school, and community)and institutional influences (i.e., experiences in the workplace,job satisfaction, and school climate), also were examined. <P> \tThe research design was a single explanatory case study. Yin (1994) contends that \"how\" and \"why\" questions (as used in this study) are explanatory in nature and suitable for a case-study design. Two sources of data were used: an initial survey instrument on environmental factors and a second survey on institutional factors. Two separate interviews were conducted with both instruments. Both sources were intended to capture participants' perceptions relevant to their experiences. A purposive sample of 10 local African American teachers was selected. <P> \tPattern matching and explanation building were the  dominant modes of analysis. A conversational style with  narratives written was used to reflect the richness of language used by the participants to describe their experiences. <P> \tFindings revealed that home environmental experiences and preparation for teaching were positive overall because of practices used by parents and family members to socialize the the participants for success in school. Both direct assistance with school work and verbal encouragement enhanced academic self-concept of ability and self-efficacy for success in school and in teaching. <P> \tSchool experiences before and during college were found  rewarding and challenging. However, both types of experiences enhanced self-concept of ability and self-efficacy in attaining a teaching career as well as  succeeding and remaining in the profession.  Overall, rewarding experiences outweighed challenging ones. High expectations, assistance with school work, and teacher role models were typical examples of such experiences.  <P> \tTwo major community influences played a significant role in interest and retention in teacher-education programs: (a) involvement in church activities and (b) sponsorship for teacher-education programs through partnerships with business and industry. The former reinforced self-concept in ability, and the latter afforded some participants an opportunity to attend college and enter a teacher-education program. Results on institutional factors and teacher retention were associated with experiences as classroom teachers, interactions with colleagues,relationships with building principals, and perceptions of the school system as a whole.",
  "description_provenance": [
    "Author Email: vstuart@mail.roanoke.k12.va.us",
    "Advisor Email: rshareef@runet.edu",
    "Advisor Email: dyardley@vt.edu",
    "Advisor Email: lharris@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:00Z (GMT). No. of bitstreams: 1 dissertation.pdf: 402763 bytes, checksum: dcb50e920cc4e17300e712b069b0aad3 (MD5)   Previous issue date: 2000-03-29"
  ],
  "handle": "27340",
  "identifier_other": "etd-04272000-11120022",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272000-11120022/",
  "identifier_uri": "http://hdl.handle.net/10919/27340",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Sandra Graham",
    "motivational construct",
    "self-efficacy",
    "academic self-concept of ability",
    "African American",
    "Roanoke",
    "Selecting teaching"
  ],
  "title": "Reasons for Selecting a Teaching Career and Remaining in the Profession: a Conversation With 10 African American Roanoke City Teachers",
  "type": "Dissertation"
}