{
  "contributor_author": "Bradley, Kevin Wayne",
  "contributor_committeechair": "Hagood, Edward Scott Jr.",
  "contributor_committeemember": [
    "Foy, Chester L.",
    "Davis, Paul H.",
    "Brann, Daniel E.",
    "Hatzios, Kriton K."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:11:00Z",
  "date_adate": "2000-04-27",
  "date_available": "2014-03-14T20:11:00Z",
  "date_issued": "2000-04-26",
  "date_rdate": "2001-04-27",
  "date_sdate": "2000-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Johnsongrass [Sorghum halepense (L.) Pers.] and mugwort (Artemisia vulgaris L.) are both rhizomatous perennial weeds that are capable of rapidly colonizing a variety of different environments.  Separate experiments were conducted throughout Virginia from 1996 to 1999 to determine more effective methods for reducing infestations of these perennial weeds in the future.  Field and greenhouse experiments conducted on a resistant johnsongrass population discovered in New Kent County, Virginia revealed that this biotype exhibits low levels of resistance to the aryloxyphenoxypropionate (APP) herbicides quizalofop-P and fluazifop-P and the cyclohexanedione (CHD) herbicide sethoxydim.  Additional laboratory experiments revealed that resistance is not due to differential absorption, translocation, or metabolism of the APP and CHD herbicides in the resistant vs. the susceptible biotype.  However, acetyl-coenzyme A carboxylase (ACCase) assays revealed that resistance to the APP and CHD herbicides is conferred by an overproduction of the ACCase enzyme in the resistant compared to the susceptible johnsongrass biotype.  In field experiments conducted on mugwort infestations discovered in several counties throughout Virginia, 100% mugwort control was achieved with standard application rates of picloram at 4 months after treatment (MAT), and also greater than 70% mugwort control was achieved with the higher application rates of clopyralid, glyphosate, and dicamba at 4 MAT.  However, all other herbicides evaluated in these experiments provided less than 65% mugwort control at 4 MAT, even at exceptionally high use rates.  Additionally, the results from these trials revealed that sequential herbicide applications and sequential mowings prior to herbicide application are both effective mugwort control strategies.",
  "description_provenance": [
    "Author Email: kebradle@vt.edu",
    "Advisor Email: clfoy@vt.edu",
    "Advisor Email: padavis@vt.edu",
    "Advisor Email: dbrann@vt.edu",
    "Advisor Email: hatzios@vt.edu",
    "Advisor Email: shagood@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:00Z (GMT). No. of bitstreams: 1 kbradley.pdf: 410615 bytes, checksum: 811db761b613f4282bbb247c979b1788 (MD5)   Previous issue date: 2000-04-26"
  ],
  "handle": "27343",
  "identifier_other": "etd-04272000-14310037",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272000-14310037/",
  "identifier_uri": "http://hdl.handle.net/10919/27343",
  "publisher": "Virginia Tech",
  "relation_haspart": "kbradley.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "perennial weeds",
    "cyclohexanediones",
    "Aryloxyphenoxypropionate",
    "enzyme overproduction"
  ],
  "title": "CHARACTERIZATION OF THE MECHANISM OF RESISTANCE OF A JOHNSONGRASS (Sorghum halepense) BIOTYPE TO SELECTED GRAMINICIDES IN VIRGINIA AND RESPONSE OF MUGWORT (Artemisia vulgaris) TO SPECIFIC HERBICIDAL AND CULTURAL CONTROL STRATEGIES",
  "type": "Dissertation"
}