{
  "contributor_author": "Radcliffe, John Scott",
  "contributor_committeecochair": [
    "Fontenot, Joseph P.",
    "Harper, Allen F."
  ],
  "contributor_committeemember": [
    "Denbow, Donald Michael",
    "Pleasant, Robert Scott",
    "Davis, Barbara A."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:11:00Z",
  "date_adate": "2000-04-27",
  "date_available": "2014-03-14T20:11:00Z",
  "date_issued": "2001-04-13",
  "date_rdate": "2001-04-27",
  "date_sdate": "2000-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Forty-six barrows fitted with steered ileo-cecal valve cannulas were used in four experiments to evaluate the effects of supplementing swine diets with microbial phytase or beta-mannanase on the apparent ileal (AID) and/or apparent total tract digestibility (ATTD) of amino acids, N, Ca, P, DM and energy.  In Exp. 1, the addition of phytase to low CP corn-soybean meal based diets increased the AID of Ca (P < .01), P (P < .001), and all amino acids (P < .10) measured except Leu, Ser, Pro, Met, His and Tyr.  In Exp. 2, the addition of microbial phytase to corn-soybean meal, corn-soybean meal-wheat middlings, or corn-soybean meal-meat and bone meal based diets resulted in increased AID of Ca and P, but had no effect (P > .1) on amino acid digestibilities.  Diet type affected all digestibility measurements, but did not affect the efficacy of supplemental phytase.  In Exp. 3, the addition of microbial phytase to corn-wheat-soybean meal, corn-wheat-cannola, or sorghum-corn-soybean meal based diets led to an increased ( P <.05) AID of P, Asp, Thr, Ser, Ala, Tyr, Phe, Lys and Arg.  In Exp. 4, the addition of beta-mannanase to corn-soybean meal based swine diets led to an increased AID of DM and ATTD of energy.  In addition, the AID of all amino acids measured were increased numerically, with many of these values approaching significance.  The results of these studies demonstrate that supplementing pig diets with phytase or beta-mannanase, results in an increased digestibility of certain dietary components due to the breakdown of anti-nutritive compounds in the diet.",
  "description_provenance": [
    "Author Email: jradclif@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Advisor Email: rpleasan@vt.edu",
    "Advisor Email: cajunjoe@vt.edu",
    "Advisor Email: badavis@vt.edu",
    "Advisor Email: alharper@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:00Z (GMT). No. of bitstreams: 3 JSRChapter_9.pdf: 58725 bytes, checksum: ad500b2aa316d2e5bfcbdf87262ee43e (MD5) JSRAbstract.pdf: 4988 bytes, checksum: 9025021fbe71466b1ac8cd3ceeefbc8e (MD5) JSRadcliffeDissertation.pdf: 1435393 bytes, checksum: 09c66fb3151dd85e86eec604dfc945db (MD5)   Previous issue date: 2001-04-13"
  ],
  "handle": "27341",
  "identifier_other": "etd-04272000-13260013",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272000-13260013/",
  "identifier_uri": "http://hdl.handle.net/10919/27341",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "JSRChapter_9.pdf",
    "JSRAbstract.pdf",
    "JSRadcliffeDissertation.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "phytase",
    "digestibility",
    "amino acids",
    "cannula",
    "beta-mannanase"
  ],
  "title": "The Use of Steered Ileo-cecal Valve Cannulated Pigs to Evaluate the Effects of Adding Phytase or Beta-mannanase to the Diet on Amino Acid, Mineral and Energy Utilization",
  "type": "Dissertation"
}