{
  "contributor_author": "Yudd Moscoso, Regina",
  "contributor_committeechair": "Cline, Marvin Gerald",
  "contributor_committeemember": [
    "Wiswell, Albert K.",
    "Kronenberg, Philip S.",
    "Fortune, Jimmie C.",
    "Hutson, Barbara A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:00Z",
  "date_adate": "2000-05-02",
  "date_available": "2014-03-14T20:11:00Z",
  "date_issued": "2000-05-10",
  "date_rdate": "2001-05-02",
  "date_sdate": "2000-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract The Effects of School Characteristics on Student Academic Performance <p>This work expanded on previous research on school effectiveness by developing and testing hypotheses about the specific relationships between school characteristics---including aggregated student and classroom characteristics---and student academic performance. The work used data from the \"Early Childhood Transitions Project,\" a study of intensive social and educational services in a suburban school system, to identify and test the effect of a limited set of school-level characteristics on test score gains made by individual students on the Metropolitan Achievement Test (MAT) between the second and third grade. <p>The analyses found that there are differences in the size of schools, the percent of low performing students, and the percent of students who are non-English speaking across the schools in the sample. Test score gains are affected by concentrations of these types of students at the schools. Students at schools in this sample with high concentrations of non-English speaking students or high concentrations of Hispanic students achieve lower test score gains than students in other schools. Another \"concentration effect\" emerged from the analysis of high-performing students in the sample. In particular, female students with high scores on the second grade MAT who are in schools with large concentrations of students who perform poorly on the second grade exam have smaller third grade test score gains than similar students who are in schools without a concentration of low performing students. <p>These results suggest that more attention be paid to the influence that the characteristics of the student population have on the school's ability to implement the curriculum. As a first step, researchers may want to simply document the differences in the educational characteristics of students entering schools. This would provide evidence of the segregation that occurs across schools. Researchers may then want to conceptualize students within schools in terms of their homogeneity on demographic measures and their homogeneity on educational characteristics. This \"educational minority or majority\" concept may bring researchers closer to understanding the school environment, as it is organized by schools and experienced by children.",
  "description_provenance": [
    "Author Email: yuddr1@westat.com",
    "Advisor Email: wiswell@vt.edu",
    "Advisor Email: philkvt@vt.edu",
    "Advisor Email: fortunejc@vt.edu",
    "Advisor Email: bhutson@vt.edu",
    "Advisor Email: mcline@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:00Z (GMT). No. of bitstreams: 1 yudddissertation.pdf: 160731 bytes, checksum: b82fcf2eb22a6289f7929bdf28bb91c6 (MD5)   Previous issue date: 2000-05-10"
  ],
  "handle": "27346",
  "identifier_other": "etd-04272000-18110037",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272000-18110037/",
  "identifier_uri": "http://hdl.handle.net/10919/27346",
  "publisher": "Virginia Tech",
  "relation_haspart": "yudddissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "school accountability",
    "test score outcomes",
    "aggregated school measures"
  ],
  "title": "The Effects of School Characteristics on Student Academic Performance",
  "type": "Dissertation"
}