{
  "contributor_author": "Seals, Richard",
  "contributor_committeecochair": [
    "Knight, James W.",
    "Lewis, Gregory S."
  ],
  "contributor_committeemember": [
    "Sponenberg, Daniel Phillip",
    "Elgert, Klaus D.",
    "Hohenboken, William D."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:11:00Z",
  "date_adate": "2000-04-28",
  "date_available": "2014-03-14T20:11:00Z",
  "date_issued": "2000-04-21",
  "date_rdate": "2001-04-28",
  "date_sdate": "2000-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The uterine immune system is down regulated when exposed to P4. Five experiments were conducted to determine the in vivo and in vitro role(s) of P4 and prostaglandins in immune function(s) associated with uterine infections. In Exp. 1, postpartum ewes (d 0 = parturition) were supplemented with either OIL or P4 (beginning on d 10) or were SHAM or OVEX. Vena caval blood and lymphocytes were collected on d 14, and 16 to 19. All ewes received intrauterine inoculations of bacteria on d 15 and uteri were collected on d 20. Ewes receiving P4 developed infections. Lymphocytes were incubated with mitogens, PGE2, indomethacin (INDO; a PG synthesis inhibitor) or both in a 3 x 2 x 2 arrangement. Concanavalin A-stimulated blastogenesis in P4-OVEX ewes and PGE2 and PGE2+INDO treated lymphocytes was inhibited (P < .05). Cyclic ewes in their follicular or luteal phase received either intrauterine inoculations of saline or bacteria, vena caval blood was collected for 3 d, and uteri were collected. Lymphocytes were incubated with mitogens, PGE2 (Exp. 2), PGF2alpha (Exp. 3) and(or) INDO in a 3 x 2 x 2 arrangement. Only luteal phase ewes that received bacteria developed infections. In Exp. 2, Con A- and LPS-stimulated blastogenesis was greater for luteal than for follicular phase ewes. T lymphocyte proliferation was inhibited in ewes inoculated with bacteria. T lymphocyte proliferation tended to be higher (P = .09) when incubated with INDO. In Exp. 3, T lymphocyte proliferation in response to PGF2alpha was greater for follicular than for luteal phase ewes. Neutrophils were lower in ewes inoculted with bacteria. In Exp. 4 and 5, uteri of luteal-phase (d 6) ewes were inoculated with bacteria. Ewes received either 15 mg of Lutalyse or saline on d 9, and uteri were collected on d 11. Lutalyse reduced P4, tended to decrease neutrophils, allowed ewes to clear infections, and had no effect on blastogenesis. Methods for modulating uterine prostaglandins seem to reduce susceptibility to uterine infections.",
  "description_provenance": [
    "Author Email: rseals@vt.edu, rseals@evansville.net",
    "Advisor Email: dpsponen@vt.edu",
    "Advisor Email: kdelgert@vt.edu",
    "Advisor Email: knight@vt.edu",
    "Advisor Email: whohenbo@vt.edu",
    "Advisor Email: glewis@pwa.ars.usda.gov",
    "Made available in DSpace on 2014-03-14T20:11:00Z (GMT). No. of bitstreams: 1 rseals-etd.pdf: 856744 bytes, checksum: 924208dee04d06fe203452b3b6bfc915 (MD5)   Previous issue date: 2000-04-21"
  ],
  "handle": "27345",
  "identifier_other": "etd-04272000-16590044",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272000-16590044/",
  "identifier_uri": "http://hdl.handle.net/10919/27345",
  "publisher": "Virginia Tech",
  "relation_haspart": "rseals-etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "uterine infections",
    "prostaglandins",
    "sheep",
    "cattle",
    "lymphocytes"
  ],
  "title": "Prostaglandins Modulate the Uterine Response to Infectious Bacteria in Postpartum and Estrous Cyclic Ewes",
  "type": "Dissertation"
}