{
  "contributor_author": "Parker, Jennifer S.",
  "contributor_committeechair": "Benson, Mark J.",
  "contributor_committeemember": [
    "Hohenshil, Thomas H.",
    "Protinsky, Howard O. Jr.",
    "Sporakowski, Michael J.",
    "Anderson, Eileen S.",
    "Bird, Gloria W."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:00Z",
  "date_adate": "2000-04-28",
  "date_available": "2014-03-14T20:11:00Z",
  "date_issued": "2000-04-20",
  "date_rdate": "2001-04-28",
  "date_sdate": "2000-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<HTML> <HEAD> <META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=windows-1252\"> <META NAME=\"Generator\" CONTENT=\"Microsoft Word 97\"> <TITLE>ab</TITLE> <META NAME=\"Template\" CONTENT=\"C:PROGRAM FILESMICROSOFT OFFICEOFFICEhtml.dot\"> </HEAD> <BODY LINK=\"#0000ff\" VLINK=\"#800080\">  <P ALIGN=\"CENTER\">ABSTRACT</P> <P>Attachment and family systems theories provided a framework for examining parental structure and support and adolescent delinquency, substance abuse, peer relations, and self-esteem. Three parent scales: support, watchfulness and decidedness, and eight adolescent outcome variables assessing self-esteem, peer relations, and risk-behaviors were derived from the National Educational Longitudinal Study. The sample of 16,749 adolescents was diverse regarding race and ethnicity. All participants were in the tenth grade in the first wave and continued participation in the second wave two years later.</P> <P>Parental support was hypothesized to be associated with increased self-esteem, positive peer relationships and reduced risk behaviors. Although the research findings support the hypothesis for each of the adolescent variables, support was most related to adolescent self-esteem and peer alienation, consistent with an attachment schema. </P> <P>The hypothesis that parental watchfulness is linked to a reduction in adolescent high-risk behaviors was not supported. Instead, watchfulness was linked to self-esteem and peer alienation. These findings indicate that watchfulness, similar to support, is more related to internal processes rather than a mechanism for controlling behavior. </P> <P>Parental decidedness is associated with lower risk behaviors along with lower self-esteem and greater susceptibility to peer alienation. This construct, in contrast to support and watchfulness, presents a different direction of influence depending on the adolescent outcome. The direction of influence of decidedness is negative for self-esteem and peer relations and positive for adolescent risk reduction. </P> <FONT FACE=\"Times\"><P>The overall research findings indicate that high amounts of support and watchfulness are related to the most positive outcomes for adolescent self-esteem and peer relations. In contrast, the effect of parental decidedness was less salutary for self-esteem and peer relations. In summary, conclusions from this research have implications for theory and practice. For theory, the understanding of specific linkages between these parenting constructs and adolescent outcomes is advanced in this research. These linkages have implication for extensions and modifications of attachment and family systems theories. For practice, the findings suggest refinement in contemporary parent education and clinical work with families.</P></FONT></BODY> </HTML>",
  "description_provenance": [
    "Author Email: jeparke3@vt.edu, tjsmith@vt.edu",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: hprotins@vt.edu",
    "Advisor Email: eagle1@vt.edu",
    "Advisor Email: mbenson@vt.edu",
    "Advisor Email: eileen@vt.edu",
    "Advisor Email: birdfcd@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:00Z (GMT). No. of bitstreams: 1 JenniferParker.pdf: 255645 bytes, checksum: 5bdbe5c872447bfb3085b2c3addf98ac (MD5)   Previous issue date: 2000-04-20"
  ],
  "handle": "27344",
  "identifier_other": "etd-04272000-16110037",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272000-16110037/",
  "identifier_uri": "http://hdl.handle.net/10919/27344",
  "publisher": "Virginia Tech",
  "relation_haspart": "JenniferParker.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "substance abuse",
    "delinquency",
    "parenting",
    "attachment",
    "peer relations",
    "family systems",
    "parent-adolescent relations",
    "NELS",
    "self-esteem",
    "behavior problems"
  ],
  "title": "Parent Structure and Support and Adolescent Problems:  Delinquency, Substance Abuse, and Peer and Self-Esteem Deficits",
  "type": "Dissertation"
}