{
  "contributor_author": "DiFelice, Ronald Attilio",
  "contributor_committeechair": "Dillard, John G.",
  "contributor_committeemember": [
    "Ward, Thomas C.",
    "Marand, Hervé L.",
    "Wightman, James P.",
    "Long, Gary L."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:11:01Z",
  "date_adate": "2001-04-27",
  "date_available": "2014-03-14T20:11:01Z",
  "date_issued": "2001-04-18",
  "date_rdate": "2002-04-27",
  "date_sdate": "2001-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Plasma pretreatments are environmentally benign and energy efficient processes for modifying the surface chemistry of materials. In an effort to improve the strength of the titanium alloy/FM-5 polyimide adhesive joint for aerospace applications, oxygen plasma pretreatments and novel thin plasma polymerized (PP) films were investigated as adhesion promoters. Plasma treatments were carried out using custom-built, low pressure, radio frequency, inductively coupled plasma reactors. Ti-6Al-4V coupons were plasma treated and used to prepare miniature single lap shear (SLS) joints. The effects of plasma pretreatments on surface chemistry were studied using x-ray photoelectron spectroscopy (XPS), Auger electron spectroscopy (AES), Fourier transform infrared analysis (FTIR), and contact angle measurements. Relationships between composition, mechanical properties, and adhesion of PP films on Ti-6Al-4V and silicon wafers were investigated. The nanomechanical properties (modulus, hardness and adhesion) were studied using atomic force microscopy (AFM) nanoindentation and nanoscratch testing.  A design of experiments (DOE) three factorial model was used to optimize the parameters for oxygen plasma treatments. Oxygen plasma pretreatments enhanced joint strength by cleaning the titanium surface and creating an extended oxide layer. Nanoindentation of oxygen plasma treated substrates showed no change in the surface mechanical properties due to the oxygen plasma treatment. This suggested that the improved SLS strength of the oxygen plasma pretreated substrates was due to the cleaning of the substrate and the removal of carbonaceous contaminants, rather than any changes in the morphology of the oxide layer.  PP acetylene films were predominantly carbon, with oxygen as the other main constituent (incorporated mostly as C-O and C=O). For all SLS specimens tested, the adhesion between PP acetylene and FM-5 adhesive was adequate. However, the strength of SLS joints was limited by the adhesion of the PP acetylene to the Ti-6Al-4V substrate. The effects of a large number of plasma parameters, such as substrate pretreatment, carrier gas, input power, flow rate and film thickness were investigated. All samples failed at the PP film/Ti-6Al-4V interface or within the PP acetylene film, and thicker PP films yielded lower SLS strengths. PP films deposited at lower power exhibited higher hardness and reduced modulus than films deposited at higher power. Overall, thinner films exhibited higher hardness and reduced Young's modulus than thicker films. PP films of higher hardness yielded higher critical loads at debond (thickness normalized) during the nanoscratch test.  Thin films were developed via the vapor plasma polymerization of titanium(IV) isobutoxide (TiiB). XPS results suggested that titanium was incorporated into the film as TiO2 clusters dispersed in an organic matrix. No evidence for Ti-C was obtained from the XPS spectra. PP films of TiiB were much more compliant than PP acetylene films. This behavior was attributed to decreased fragmentation and lower crosslinking that occurred during PP TiiB film deposition. These PP films did not exhibit sol-gel-like qualities, and because of the way titanium was incorporated into the films, a more appropriate name for these films might be \"titanium dioxide-doped plasma polymerized films.\"",
  "description_provenance": [
    "Author Email: rd@vt.edu",
    "Advisor Email: tward@chemserver.chem.vt.edu",
    "Advisor Email: hmarand@chemserver.chem.vt.edu",
    "Advisor Email: jwightman@chemserver.chem.vt.edu",
    "Advisor Email: glong@chemserver.chem.vt.edu",
    "Advisor Email: john.dillard@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:01Z (GMT). No. of bitstreams: 1 Finaldissertation.PDF: 5742482 bytes, checksum: b4eebe8db1c00fa81d6ed4a46d06a99d (MD5)   Previous issue date: 2001-04-18"
  ],
  "handle": "27348",
  "identifier_other": "etd-04272001-000749",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272001-000749/",
  "identifier_uri": "http://hdl.handle.net/10919/27348",
  "publisher": "Virginia Tech",
  "relation_haspart": "Finaldissertation.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "FM-5 Adhesive",
    "Ti-6Al-4V",
    "Surface Pretreatments",
    "XPS",
    "Organo-metallics",
    "Plasma Polymerized Acetylene",
    "Oxygen Plasma",
    "Nanoscratch",
    "Surface Analysis",
    "Failure Mode",
    "Single Lap Shear",
    "silicon(111)",
    "AFM",
    "Nanoindentation",
    "Nanomechanical",
    "DOE"
  ],
  "title": "An Investigation of Plasma Pretreatments and Plasma Polymerized Thin Films for Titanium/Polyimide Adhesion",
  "type": "Dissertation"
}