{
  "contributor_author": "Parsons, Dennis D.",
  "contributor_committeechair": "Parson, Stephen R.",
  "contributor_committeemember": [
    "Richards, Robert R.",
    "Salmon, Richard G.",
    "O'Reilly, Patrick A.",
    "Earthman, Glen I."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:02Z",
  "date_adate": "2001-04-29",
  "date_available": "2014-03-14T20:11:02Z",
  "date_issued": "2001-04-23",
  "date_rdate": "2002-04-29",
  "date_sdate": "2001-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The Status of Public School/Business Collaborative Activities in Virginia, 1998-1999. Dennis D. Parsons Steve R. Parson, Chair  (ABSTRACT) The purpose of this study was to ascertain important information that was lacking about current school/business collaborative activities in the Commonwealth of Virginia and to compare those activities to the findings of a study conducted by Larkin C. Phillips of school/business collaborative activities during the 1990-91 school year.  This study used the same survey questions that were used by Phillips and was designed to provide the following information:   \t(a) Common characteristics of school divisions in Virginia that conducted collaborative activities during the 1998-99 school year as compared to the 1990-1991 school year, \t(b) The types of collaborative activities conducted in Virginia during the 1998-99 school years as compared to the 1990-1991 school year, \t(c) Current resources used to manage collaborative activities as compared to the 1990-91 school year, and \t(d) Types of businesses that participated in collaborative activities in 1998-99 as compared to the 1990-91 school year. \tA survey was sent to all superintendents of public school divisions in the Commonwealth of Virginia.  Superintendents from 99 school divisions, 76 percent of the school divisions in Virginia, returned the survey.  The responses indicated that 72 percent of the responding divisions conducted school/business collaborative activities during the 1998-99 school year.  This was an eight percent decrease from the 1990-1991 school year.   Of the school divisions reporting no collaborative activity in this study 89 percent were located in rural areas.  In contrast, more than 90 percent of the school divisions in cities and suburbs indicated collaborative activity with businesses.  Small school divisions and less wealthy school divisions were less likely to conduct collaborative activities than were larger and wealthier school divisions. The most conducted collaborative activities in the typical Virginia school division at all grade levels were: providing career awareness activities; providing special awards for pupils, teachers or the school; donating or loaning equipment or materials; and sponsoring tutoring programs for pupils.  As compared to the Phillips study, there were large increases in businesses providing tutoring at the elementary and middle/junior high school levels.  And at the high school level there was a 22 percent increase in partners providing internships for students. During the 1998-1999 school year in Virginia the management of collaborative activities was most often managed totally at each participating school.  The person most likely to initiate collaborative activity with business was the building principal. The most likely type of businesses involved in collaborative activities with school divisions was service, civic, manufacturing and retail.  The mining industry was least likely to be involved in collaborative activities.",
  "description_provenance": [
    "Author Email: parsons@spotsylvania.k12.va.us",
    "Advisor Email: parson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:02Z (GMT). No. of bitstreams: 10 abstract.pdf: 5688 bytes, checksum: cb1c1e37b386a1dc95e8424916e4a502 (MD5) Chapter2.pdf: 53300 bytes, checksum: 5e1b4ca0a101658f32c4a0668392dd63 (MD5) Chapter1.pdf: 16094 bytes, checksum: 0b4384251f80753ead3e5a9ec2c948a3 (MD5) Chapter4.pdf: 211341 bytes, checksum: f1a42f3d9c572793c18e49ced0c6ec4a (MD5) Contents.PDF: 17970 bytes, checksum: 99f55517cd95edc22ddcdb1de2aef54c (MD5) Chapter3.pdf: 14208 bytes, checksum: 7cad732dda595030642b5294b24ea657 (MD5) Acknowl.PDF: 4355 bytes, checksum: 0c5a754259a99824b83c0ad178a500f1 (MD5) Appendix.PDF: 398475 bytes, checksum: 06c699f6a7f1cce9275aab611caf1ef1 (MD5) Chapter5.pdf: 30537 bytes, checksum: 6d30d4fdd9b76a3a86b7076709b627a2 (MD5) Bibliog.PDF: 13556 bytes, checksum: ced78a7598aed96ab64966699eef5fb5 (MD5)   Previous issue date: 2001-04-23"
  ],
  "handle": "27354",
  "identifier_other": "etd-04272001-113857",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272001-113857/",
  "identifier_uri": "http://hdl.handle.net/10919/27354",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "abstract.pdf",
    "Chapter2.pdf",
    "Chapter1.pdf",
    "Chapter4.pdf",
    "Contents.PDF",
    "Chapter3.pdf",
    "Acknowl.PDF",
    "Appendix.PDF",
    "Chapter5.pdf",
    "Bibliog.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "public schools",
    "foundations",
    "partnerships",
    "Virginia",
    "Collaborative activities"
  ],
  "title": "The Status of Public School/Business Collaborative Activities in Virginia, 1998 - 1999",
  "type": "Dissertation"
}