{
  "contributor_author": "Clemenz, Candice E.",
  "contributor_committeechair": "Weaver, Pamela A.",
  "contributor_committeemember": [
    "Littlefield, James E.",
    "McCleary, Ken W.",
    "Murrmann, Suzanne K.",
    "Williams, John A."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:11:02Z",
  "date_adate": "2001-04-30",
  "date_available": "2014-03-14T20:11:02Z",
  "date_issued": "2001-04-25",
  "date_rdate": "2002-04-30",
  "date_sdate": "2001-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "To explore the viability of a new training evaluation criteria, theories from the areas of service, adult education, and training, were combined to form a model of Perceived Quality of Training and Transfer.  Operating from the paradigm that training is a service, a rigorous scale development process was initiated to discover the dimensions of perceived quality of training, a new construct within the realm of training evaluation based upon trainees' impressions of training.  Thirty-six supporting items, representing nine dimensions of perceived quality of training, formed the scale developed in the first phase of this study.  \tTo test and further refine the perceived quality of training scale, 164 trainees from six different instructor-led training classes in the hospitality industry completed pre-training and post-training surveys that evaluated scale items as expectations as well as perceptions of training.  Comparing measurement techniques, findings indicated that a perception only measure of training quality was more highly correlated with trainees' overall quality of training ratings than was a gap measure (perceptions minus expectations).  \tExploratory factor analysis conducted in phase 2 of the study revealed that the six dimensions of perceived quality of training, as determined by the perception measurement, are interactivity, climate, courtesy, relevance, tangibles, and credibility.  These dimensions are similar to the dimensions of service quality, thereby giving credence to the idea of tapping into eclectic literature bases to address issues of training evaluation.  Lastly, test results indicated that the perception measurement of the perceived training quality scale was significantly and positively correlated with trainees' intentions to use training when they returned to their jobs.",
  "description_provenance": [
    "Author Email: clemenz@vt.edu",
    "Advisor Email: jalittle@vt.edu",
    "Advisor Email: mccleary@vt.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: weaver@vt.edu",
    "Advisor Email: jawill06@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:02Z (GMT). No. of bitstreams: 1 clemenz.diss.pdf: 707587 bytes, checksum: 67ded6c4d817aee309aece879fac753f (MD5)   Previous issue date: 2001-04-25"
  ],
  "handle": "27356",
  "identifier_other": "etd-04272001-142531",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272001-142531/",
  "identifier_uri": "http://hdl.handle.net/10919/27356",
  "publisher": "Virginia Tech",
  "relation_haspart": "clemenz.diss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Evaluation of Training",
    "Perceived Quality of Training",
    "Training",
    "Service"
  ],
  "title": "Measuring Perceived Quality of Training in the Hospitality Industry",
  "type": "Dissertation"
}