{
  "contributor_author": "Bernard, Scott A.",
  "contributor_committeechair": "Kronenberg, Philip S.",
  "contributor_committeemember": [
    "Holden, Stephen H.",
    "Goodsell, Charles T.",
    "Worrall, Richard D.",
    "Wolf, James F."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:11:03Z",
  "date_adate": "2001-05-02",
  "date_available": "2014-03-14T20:11:03Z",
  "date_issued": "2001-04-18",
  "date_rdate": "2002-05-02",
  "date_sdate": "2001-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "EVALUATING CLINGER-COHEN ACT COMPLIANCE IN FEDERAL AGENCY CHIEF INFORMATION OFFICER POSITIONS  (ABSTRACT)  This dissertation develops a method for evaluating whether federal agencies have complied with the intent of the Clinger-Cohen Act (CCA) of 1996 as they established Chief Information Officer (CIO) positions.  The research is important because the CIO position, as envisioned by the CCA, oversees a growing information technology infrastructure that is increasingly becoming the primary vehicle for inter/intra-government communication and for delivering services to the public.  Yet despite this importance, CIO-related aspects of the CCA have not received in-depth evaluation in policy science or public administration literature.    The CCA specified many roles for the CIO position but provided few criteria for evaluating how agencies complied with the provisions that required the establishment of a CIO position.  Therefore, a seven-step policy analysis process was used to develop a federal agency CIO position evaluation method that would fill this gap.  This analytic research included describing the CCA's legislative context, modeling the federal CIO position, determining the intent of the CCA relative to CIO establishment, and devising a method to evaluate this activity.  This research approach was grounded in organizational theory related to institutional structure.  A validated â  Federal CIO Position Evaluation Methodâ   (FCPEM) is the result of the research.  FCPEM, which contains thirteen evaluation criteria, was tested and validated through key actor interviews at four federal agencies and focused on CIO position establishment activity between 1996 and 2000.  Additional research is required to replicate this finding in other agencies and to further validate the use of FCPEM in conducting this type of public policy inquiry.",
  "description_provenance": [
    "Author Email: sabernar@syr.edu",
    "Made available in DSpace on 2014-03-14T20:11:03Z (GMT). No. of bitstreams: 1 Dissertation_Final_Copy.pdf: 1368746 bytes, checksum: c73550026ae3e67eeae51b045a7f5275 (MD5)   Previous issue date: 2001-04-18"
  ],
  "handle": "27357",
  "identifier_other": "etd-04272001-191740",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272001-191740/",
  "identifier_uri": "http://hdl.handle.net/10919/27357",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Final_Copy.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Federal Information Resources Management",
    "ITMRA",
    "Clinger-Cohen Act",
    "CIO",
    "Chief Information Officer"
  ],
  "title": "Evaluating Clinger-Cohen Act Compliance in Federal Agency Chief Information Officer Positions",
  "type": "Dissertation"
}