{
  "contributor_author": "Fisher, Catherine Seaman",
  "contributor_committeechair": "Parks, David J.",
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:01Z",
  "date_adate": "2001-05-03",
  "date_available": "2014-03-14T20:11:01Z",
  "date_issued": "2001-02-21",
  "date_rdate": "2002-05-03",
  "date_sdate": "2001-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "(ABSTRACT)  David Parks, Committee Chair  Educational Leadership and Policy Studies  \tThe characteristics of career-threatened principals in Virginia as identified by Virginia superintendents were examined.  All superintendents of operating school divisions in Virginia were selected as the population for this study. A survey was used to generate data on demographic characteristics of career-threatened principals, their scores on administrative competencies, sources of information about these principals, interventions initiated by superintendents to assist career-threatened principals, and final career outcomes for these principals. Relationships among demographic variables and all other variables were analyzed.  A limited demographic profile of Virginia superintendents was generated. Data were analyzed using analysis of variance, t-test, and chi square analysis.  An alpha level of .05 was used for all analyses.  Findings \tThe career-threatened principals were generally male and were principals of high schools.  Most were assistant principals within their school divisions immediately before becoming principals.  They served an average of four years as principals with an average of two years under career-threatening conditions.  Principals who experienced career-threatening problems were unlikely to retain their jobs, with only 14.7% remaining in their principalships. Female principals were more likely dismissed from their principalships than males, and male principals were more likely to receive verbal reprimands as an intervention strategy than female principals. \tThose competencies receiving the lowest mean scores for these career-threatened principals were solving problems, making decisions, flexibility, delegating responsibilities, developing positive community relations, and developing positive school climate.  Superintendentsâ   personal observations were the primary source of information about these principals and the primary intervention was individual conference.",
  "description_provenance": [
    "Author Email: csfisher@henrico.k12.va.us",
    "Advisor Email: parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:01Z (GMT). No. of bitstreams: 4 Table_of_contents_Cover_She.pdf: 15495 bytes, checksum: d0e36f2e9dd815f29136e4ac16f4ae55 (MD5) Dedication_Acknowledgement.pdf: 4539 bytes, checksum: 11d0db3bb7688bba455b2bd01ac204b0 (MD5) Model_2.pdf: 4000 bytes, checksum: f814728aa4d74166df9e32b0b9fde266 (MD5) September_2000.pdf: 363448 bytes, checksum: d418fb56ebbf494e2474f81751a3201e (MD5)   Previous issue date: 2001-02-21"
  ],
  "handle": "27351",
  "identifier_other": "etd-04272001-085009",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272001-085009/",
  "identifier_uri": "http://hdl.handle.net/10919/27351",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Table_of_contents_Cover_She.pdf",
    "Dedication_Acknowledgement.pdf",
    "Model_2.pdf",
    "September_2000.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Superintendents",
    "Career-Threatened Principals",
    "Virginia"
  ],
  "title": "Career-Threatened Principals: Virginia Superintendents' Views",
  "type": "Dissertation"
}