{
  "contributor_author": "Ramsaroop, Errol Vishnu",
  "contributor_committeechair": "Finch, Curtis R.",
  "contributor_committeemember": [
    "Eschenmann, Konrad Kurt",
    "Stewart, Daisy L.",
    "Crunkilton, John R.",
    "Tlou, Josiah S."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:02Z",
  "date_adate": "2001-04-30",
  "date_available": "2014-03-14T20:11:02Z",
  "date_issued": "2001-04-19",
  "date_rdate": "2002-04-30",
  "date_sdate": "2001-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objectives of this study were to determine what perceived changes to VTE have the potential to improve development of the economy in the next 3 to 5 years and which of these identified changes will have the greatest impact. To achieve this objective, a selected group of experts representing international development, business, economies, labor, manufacturing, service industries, and education were asked to participate in the study. First, the experts were requested to list five to eight statements, based on their experience and perceptions, about what changes to VTE have the potential to improve the development of Trinidad and Tobago economy in the next 3 to 5 years. Next, they were asked to rank-order their identified 60 statements on a continuum that approximated a normal distribution from â  most importantâ   to â  least important.â   Rank-ordered statements were analyzed using Q-factor analysis (PQMethod). \tFrom the rank-ordered statements, eight factors were identified as having the potential to improve the development of Trinidad and Tobagoâ  s economy. These factors were (a) access to and quality of VTE, (b) VTE higher education programs, (c) VTE program quality, (d) VTE program comprehensiveness, (e) fundamental aspects of VTE, (f) preparation for and advancement in VTE careers, (g) meeting VTE student and program needs, and (h) understanding VTE's purpose. Statements associated with each factor serve to clarify the focus of VTE related activities that may be initiated to improve development of the economy. The most important of the identified factors was Factor 1(access to and quality of VTE) which accounted for 15% of the explained variance in the factor matrix. The second most important factors were Factor 3 (VTE program quality) and 5(fundamental aspects of VTE) with each accounting for 13% of the explained variance. All three of these factors (Factors 1, 3, and 5) had an average reliability coefficient of .800, a composite reliability of .889 at a significant value of p<.05.",
  "description_provenance": [
    "Author Email: eramsaro@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: jcrunkil@vt.edu",
    "Advisor Email: tlou@vt.edu",
    "Advisor Email: crfinch@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:02Z (GMT). No. of bitstreams: 2 errols-abstract.pdf: 35367 bytes, checksum: 5ade02868229317cf12059f2c8d9a0f2 (MD5) Chapter_Com-final.pdf: 2024833 bytes, checksum: 41c9405d455ee9d41cb4b6ff639259b6 (MD5)   Previous issue date: 2001-04-19"
  ],
  "handle": "27355",
  "identifier_other": "etd-04272001-131556",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272001-131556/",
  "identifier_uri": "http://hdl.handle.net/10919/27355",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "errols-abstract.pdf",
    "Chapter_Com-final.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Vocational and Technical Education",
    "Economic development"
  ],
  "title": "Vocational and Technical Education Changes that are Potential Contributors to the Economic Development of Trinidad and Tobago",
  "type": "Dissertation"
}