{
  "contributor_author": "Hamm, Jean Shepherd",
  "contributor_committeechair": "Kelly, Patricia Proudfoot",
  "contributor_committeemember": [
    "Uttech, Melanie R.",
    "Bailey, Carol A.",
    "Hicks, David",
    "Oliveira, Anthony J."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:03Z",
  "date_adate": "2003-05-02",
  "date_available": "2014-03-14T20:11:03Z",
  "date_issued": "2003-04-17",
  "date_rdate": "2004-05-02",
  "date_sdate": "2003-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p> From 1924-1959, the United Lutheran Church of America operated a girlsâ   boarding school in Southwest Virginia.  When Konnarock Training School opened, there were few educational opportunities in the isolated mountains, especially for girls.  Students from five states came to Konnarock, with some receiving eleven years of education there.  Konnarock Training School recruited faculty from throughout the United States and at least one teacher from Europe.  These individuals lived in the Virginia mountains, taught academic classes, and engaged in extensive community outreach. A unique level of cooperation existed among church, public schools systems, and government agencies during the schoolâ  s existence.  </p><p>  The mission of Konnarock Training School was to help women reach their potential and to become leaders in their families, their church, and their communities.  Students were taught, by example and by word, that they had a place in the church, that women did not have to accept prevailing social and economic circumstances, and that they could make decisions about their own lives.  The day-to-day examples given to the students became a scaffold for social change; KTS encouraged the women to become authors of their own lives.  </p><p>  This research is essentially a case study using a feminist oral history methodology.   A total of twenty-three interviews with eight women alumnae and faculty of KTS provides the basis for the study.  Interviews were transcribed and analyzed using the constant comparative method.  In addition, extensive archival material provided data for analysis.</p><p>  The central argument presented is that KTS was a community embodying both Christian and feminist ideals, one that looked toward the vision of a just, equitable world but that persisted in the real and imperfect world.  Overlapping themes leading to a view of the school as an example of feminist theology in practice are Family and Friends, Community, Identity, A Tradition of Leadership, and An Eschatological Focus.  The role that memory plays in the telling of oneâ  s oral history is also considered.</p><p>",
  "description_provenance": [
    "Author Email: jeanhamm@yahoo.com",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: baileyc@mail.vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:03Z (GMT). No. of bitstreams: 10  ACh4ETD.pdf: 307059 bytes, checksum: 86dc78af5184aec2765edbe32ef63b3e (MD5)  ARefETD.pdf: 128704 bytes, checksum: 25aeadf84e929b1ad05da46515fe2c61 (MD5)  ACh3ETD.pdf: 555277 bytes, checksum: 9f001c314d7d7529768a96dcfa24b511 (MD5)  AAETDPref.pdf: 128103 bytes, checksum: bec97b5c9f5e821b20d03aeb736123a4 (MD5)  XVita.pdf: 42530 bytes, checksum: 6e442672bd2d59e3461de7061c9da095 (MD5)  ACh2ETD.pdf: 366851 bytes, checksum: 575093fdb9858a3362acfccb061d405f (MD5)  XApdxETD.pdf: 235994 bytes, checksum: 082ce7a79416b0242252b86174b9c11a (MD5)  ACh1ETD.pdf: 144429 bytes, checksum: 0f09bc983f76f54ebb898a3e7292f315 (MD5)  ACh5ETD.pdf: 75912 bytes, checksum: 14aba76f2edccd35e767f54d67598451 (MD5)  AAETDfront.pdf: 82071 bytes, checksum: b72092298f16cc502f3d4df5aee2127e (MD5)    Previous issue date: 2003-04-17"
  ],
  "handle": "27358",
  "identifier_other": "etd-04272003-171303",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272003-171303/",
  "identifier_uri": "http://hdl.handle.net/10919/27358",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ACh4ETD.pdf",
    "ARefETD.pdf",
    "ACh3ETD.pdf",
    "AAETDPref.pdf",
    "XVita.pdf",
    "ACh2ETD.pdf",
    "XApdxETD.pdf",
    "ACh1ETD.pdf",
    "ACh5ETD.pdf",
    "AAETDfront.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Feminist theology",
    "feminist research",
    "oral history",
    "education"
  ],
  "title": "We Can't Die Without Letting Them Know We Were There:  Oral Histories of Konnarock Training School Alumnae and Faculty",
  "type": "Dissertation"
}