{
  "contributor_author": "Harmon, Sally Baden",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Niles, Jerome A.",
    "Parson, Stephen R.",
    "Harris, Larry A.",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:02Z",
  "date_adate": "2001-04-27",
  "date_available": "2014-03-14T20:11:02Z",
  "date_issued": "2000-11-14",
  "date_rdate": "2002-04-27",
  "date_sdate": "2001-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purposes of this case study were to describe how a learning contract was implemented for a seventh-grade life science class and to discover its effects on the learning experiences of the students.  A learning contract was a written agreement between the student and the teacher in which the student agreed to complete a variety of assignments for a particular grade. Learning contracts were issued to the students for three grading periods of six-weeks. A total of 137 students participated in the case study, which began in September 1997 and culminated at the end of the third grading period in January 1998.  The data were collected from three groups:   (a) 137 seventh-grade life science students, (b) 48 parents, and (c) the classroom teacher-researcher. In order to guide the collection and analysis of data, twenty-four questions were developed. These questions were then compiled into two surveys. Responses from the student survey indicated that students: (a) signed up for an A more than any other grade, (b) liked working in teams, (c) found it easy to find assignments, (d) set goals to earn high grades, and (e) felt good about their science grades.  For the first grading period, eighty-nine percent of parents surveyed responded that they were aware of their childrenâ  s learning contract grade, and sixty-two percent of the parents surveyed responded that they were satisfied with their childrenâ  s academic performance using the learning contract.  Taped interviews were conducted with former seventh-grade students and the teacher-researcher. In the taped interviews, students told of their positive learning experiences. The teacher-researcher kept a daily journal and used its contents as data.  As a result of this case study, the students and the teacher-researcher supported the continued use of the learning contract for the next school year.",
  "description_provenance": [
    "Author Email: sbharmon@earthlink.net",
    "Advisor Email: parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:02Z (GMT). No. of bitstreams: 10 Chapter2.pdf: 35040 bytes, checksum: cb395140b7219da7bfb3b13d4dfec9f8 (MD5) Chapter4.pdf: 25304 bytes, checksum: f8bce9abb215d8743246a0c58492b69c (MD5) Chapter1.pdf: 38892 bytes, checksum: 9e7d717bd825088db582ff652020c4c6 (MD5) Chapter7.pdf: 29616 bytes, checksum: dfc1aa169f796426c03e2711e8af6819 (MD5) Chapter6.pdf: 107738 bytes, checksum: 423ca1e21546d8bee2a17ee2b9aef326 (MD5) References.pdf: 11775 bytes, checksum: 77344d0decef93dc1da0d4c0b8fc3789 (MD5) Chapter5.pdf: 32299 bytes, checksum: dc4a8341191e17cec772e1da12f4c35a (MD5) Abstract.pdf: 20616 bytes, checksum: 9025ff2741a677ade79ef6d4e3759ae0 (MD5) Append.pdf: 166967 bytes, checksum: 65ff55e624aebfcafc22bab3fc0f5f06 (MD5) Chapter3.pdf: 43222 bytes, checksum: 870122d10de7503b1e6648ae05465a43 (MD5)   Previous issue date: 2000-11-14"
  ],
  "handle": "27353",
  "identifier_other": "etd-04272001-095844",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272001-095844/",
  "identifier_uri": "http://hdl.handle.net/10919/27353",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter2.pdf",
    "Chapter4.pdf",
    "Chapter1.pdf",
    "Chapter7.pdf",
    "Chapter6.pdf",
    "References.pdf",
    "Chapter5.pdf",
    "Abstract.pdf",
    "Append.pdf",
    "Chapter3.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Learning Contract",
    "Life Science",
    "Instructional Strategy",
    "Mixed-Ability Learner"
  ],
  "title": "The Implementation of a Learning Contract and the Effects on the Learning Experiences of Seventh-Grade Life Science Students",
  "type": "Dissertation"
}