{
  "contributor_author": "Gaidos, Joan Marie",
  "contributor_committeechair": "Alley, Marcus M.",
  "contributor_committeemember": [
    "Anderson-Cook, Christine M.",
    "Brann, Daniel E.",
    "Donohue, Stephen J.",
    "Zelazny, Lucian W."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:11:02Z",
  "date_adate": "2001-04-27",
  "date_available": "2014-03-14T20:11:02Z",
  "date_issued": "2001-04-12",
  "date_rdate": "2002-04-27",
  "date_sdate": "2001-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Determining optimum N fertilization rate and timing is critical to improve yields and economic sustainability for no-till winter wheat (Triticum aestivum L.) in the Virginia Coastal Plain.  Little data are available evaluating N management strategies, optimum N rate prediction methods, or potential NO3 leaching under no-till wheat in soils and climate similar to the mid-Atlantic region.  The objectives of our research were: (1) to determine economic optimum N fertilization rates and timings; (2) evaluate selected methods for predicting optimum N rates at GS 25 and GS 30; and (3) measure NO3 leaching loss under selected N management strategies.  Eleven experiments over three years evaluated N rates at GS 25 and GS 30.  Six experiments over two years evaluated pre-plant and December or GS 25 N rates under no-till winter wheat in farm fields of the Coastal Plain region of Virginia.  Nitrate leaching was measured under selected pre-plant and December or GS 25 N application rates.  All sites represented common Coastal Plain soil types and cultural practices for no-till wheat production.  Yield data were used to calculate economic optimum N rates for a range of combinations of N management strategies.  Optimum N rates were regressed against tiller density at GS 25, and wheat tissue N content and SPAD chlorophyll meter readings at GS 30, to determine their effectiveness as predictors of the optimum N rate at GS 25 or GS 30.  Tiller density was   an effective predictor of optimum GS 25 N rate in these split application management strategies.  However, wheat tissue N contents and SPAD chlorophyll meter readings were not effective predictors of optimum N application at GS 30.   Yields across all experimental designs were affected by planting date.  Timely planted no-till wheat consistently produced higher yields compared to late planted.  Sites under continuous no-till production for 8 years or more also produced higher yields than sites under continuous no-till production for less than 8 years.  Including an additional December N application with the more traditional N management strategy of pre-plant, GS 25 and GS 30 N applications improved yields.  Nitrate leaching loss at selected pre-plant and December or GS 25 N rates was not higher than background check plot levels under timely planted no-till wheat.  Additionally, economic optimum N application rates and timings at these sites did not produce NO3 leaching losses above background levels under timely or late planted wheat, except at one late planted site.  These data indicate N application rates and timings in no-till wheat can be managed for improved economic sustainability and reduced environmental impact.",
  "description_provenance": [
    "Author Email: jgaidos@vt.edu",
    "Advisor Email: candcook@vt.edu",
    "Advisor Email: malley@vt.edu",
    "Advisor Email: dbrann@vt.edu",
    "Advisor Email: donohue@vt.edu",
    "Advisor Email: zelazny@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:02Z (GMT). No. of bitstreams: 8 AppendixE.pdf: 672454 bytes, checksum: 50d7897ff47431a71cca7608eef7d012 (MD5) AppendixA.pdf: 56300 bytes, checksum: e734239ae631cac204dc28fa5430bb19 (MD5) AppendixC.pdf: 4444219 bytes, checksum: 274fbbbc038073f72c929dd1ac6865aa (MD5) AppendixD.pdf: 21922 bytes, checksum: cf54ee18e63129ea0e050f435e20b134 (MD5) AppendixF.pdf: 91602 bytes, checksum: cb436606c219bb64785d65b8da62b023 (MD5) Nitrogen.pdf: 479336 bytes, checksum: d8acc37b84cac83995e841cffea1dbfc (MD5) AppendixB.pdf: 3979907 bytes, checksum: 570521202f30b5cdbf598299cb506771 (MD5) Vita.pdf: 5121 bytes, checksum: 727fa27947279360db938fc4e2d4f2b6 (MD5)   Previous issue date: 2001-04-12"
  ],
  "handle": "27352",
  "identifier_other": "etd-04272001-094530",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272001-094530/",
  "identifier_uri": "http://hdl.handle.net/10919/27352",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "AppendixE.pdf",
    "AppendixA.pdf",
    "AppendixC.pdf",
    "AppendixD.pdf",
    "AppendixF.pdf",
    "Nitrogen.pdf",
    "AppendixB.pdf",
    "Vita.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Wheat",
    "Nitrogen",
    "Leaching",
    "No-till"
  ],
  "title": "Nitrogen Management in No-till Winter Wheat Production Systems",
  "type": "Dissertation"
}