{
  "contributor_author": "Bump, Maggie Bobbitt",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "Dillard, John G.",
    "Lesko, John J.",
    "McGrath, James E.",
    "Shultz, Allan R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:11:01Z",
  "date_adate": "2001-04-27",
  "date_available": "2014-03-14T20:11:01Z",
  "date_issued": "2001-04-18",
  "date_rdate": "2002-04-27",
  "date_sdate": "2001-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation research addresses the interrelationships between chemistry and network structure in epoxy networks as well as how mechanical properties of the resulting networks are affected by these relationships.  The effects of chemistry and network structure on interphase morphology and performance in vinyl ester/carbon fiber composites have also been investigated on both a macro and nanoscale.   Thermosets were prepared with blends of bisphenol-A and novel phosphine oxide based diepoxide oligomers using a siloxane or a novolac crosslinking agent.  In the siloxane cured networks the incorporation of the phosphine oxide group yielded networks with increased glass transition temperatures, from 71°C to 92°C, and water absorption, from 1 wt % to 5.5 wt %, due to the polar nature of the phosphine oxide bond.  Higher char yields were also observed with the addition of the phosphorus, 27 wt % compared to 11 wt % for bisphenol-A epoxy networks.  The bisphenol-A based epoxy/siloxane network was exceptionally ductile with a fracture toughness (K1c) of 2 MPa-m1/2.  In networks prepared with the novolac crosslinking agent hydrogen bonding, observed using FTIR, was evident even at temperatures above the network Tg and resulted in increased rubbery moduli with phosphine oxide incorporation.  Adhesive strengths to steel increased from ~9.7 MPa with bisphenol-A epoxy to ~13.8 MPa when the phosphine oxide containing epoxy was incorporated into the network. Within carbon fiber/vinyl ester composites, a series of tough ductile thermoplastics and a series of one-phase polyurethanes were investigated as carbon fiber sizings.  The three poly(hydroxyether)s resulted in different interphase morphologies due to their respective interdiffusion into the vinyl ester resin.  The unmodified poly(hydroxyether) was miscible with the vinyl ester resin at the elevated cure temperatures and adhesion between the fiber and bulk matrix was increased from 28 MPa with unsized fibers to 45 MPa with sized fibers.  The carboxylate modified poly(hydroxyether) was also miscible at elevated temperatures, however the interdiffused region was narrower, ~5 mm.  This system showed an increase in the fiber/matrix adhesion similar to that found for the unmodified poly(hydroxyether)/vinyl ester system and composite cyclic fatigue durability was improved by ~50 %.  Using a poly(hydroxyether ethanolamine) interphase material, which was not miscible with the resin, resulted in a sharp interface.  While the adhesion was not improved through the use of this sizing, the composite fatigue durability was still increased by a moderate amount, ~ 25%.  The one-phase polyurethanes were dispersible in water with incorporation of a minimum of 0.08 equivalents of N-methyldiethanolamine per mole of diisocyanate.  Fatigue durability in composite panels was not improved by the addition of the polyurethane sizings due to the miscibility of the sizing and the matrix.",
  "description_provenance": [
    "Author Email: mbobbitt@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: ashultz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:01Z (GMT). No. of bitstreams: 1 etd.pdf: 3373087 bytes, checksum: 46c11c5746d31e93f3811edf21f55c43 (MD5)   Previous issue date: 2001-04-18"
  ],
  "handle": "27350",
  "identifier_other": "etd-04272001-034637",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272001-034637/",
  "identifier_uri": "http://hdl.handle.net/10919/27350",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "structural adhesive",
    "epoxy",
    "Phosphine oxide",
    "composite interphase",
    "sizing",
    "water dispersible polyurethane"
  ],
  "title": "THE EFFECT OF CHEMISTRY AND NETWORK STRUCTURE ON MORPHOLOGICAL AND MECHANICAL PROPERTIES OF DIEPOXIDE PRECURSORS AND POLY(HYDROXYETHERS)",
  "type": "Dissertation"
}