{
  "contributor_author": "Mandrik, Carter A.",
  "contributor_committeechair": "Fern, Edward F.",
  "contributor_committeemember": [
    "Coupey, Eloise",
    "Harvey, Robert J.",
    "Axsom, Daniel K.",
    "Brinberg, David L."
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:11:03Z",
  "date_adate": "2003-05-21",
  "date_available": "2014-03-14T20:11:03Z",
  "date_issued": "1999-06-15",
  "date_rdate": "2003-05-21",
  "date_sdate": "2003-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examines between-brand price premiums from an information processing perspective.  A literature review is conducted in which price premiums are shown to depend on consumerâ  s ability, motivation and opportunity to process information relevant to making between-brand judgments of value.  A conceptual model is developed that incorporates these three constraints on brand information processing, but focuses on the antecedents of the motivation construct.  An experiment is conducted that tests the effects on information processing of four antecedents to motivation:  involvement, brand evaluation motive, economic concern, and need for cognition.  Results show that involvement interacts with motive in its effect on information processing amount, but not on processing style. Need for cognition is positively related to both amount and style of processing, but the economic concern results were mixed.  Finally, implications of the results are discussed and future research directions suggested.",
  "description_provenance": [
    "Author Email: cmandrik@ku.edu.tr",
    "Advisor Email: efern@vt.edu",
    "Advisor Email: ecoupey@vt.edu",
    "Advisor Email: harveyrj@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Advisor Email: dbrinber@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:03Z (GMT). No. of bitstreams: 1 dissfinal_pls.pdf: 627875 bytes, checksum: 4f09a9638307aaf56a67f22e48e42728 (MD5)   Previous issue date: 1999-06-15"
  ],
  "handle": "27359",
  "identifier_other": "etd-04272003-211725",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272003-211725/",
  "identifier_uri": "http://hdl.handle.net/10919/27359",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissfinal_pls.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "information processing model",
    "brand equity",
    "price premiums",
    "experiment",
    "brand and attribute processing"
  ],
  "title": "An Information Processing Perspective on Between-Brand Price Premiums: Antecedents and Consequences of Motivation",
  "type": "Dissertation"
}