{
  "contributor_author": "Roberts, Polly Sheffield",
  "contributor_committeecochair": [
    "Getz, Hilda M.",
    "Skaggs, Gary E."
  ],
  "contributor_committeemember": [
    "Garrison, James E.",
    "Hohenshil, Thomas H.",
    "Piercy, Fred P."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:11:03Z",
  "date_adate": "2004-05-03",
  "date_available": "2014-03-14T20:11:03Z",
  "date_issued": "2004-04-21",
  "date_rdate": "2005-05-03",
  "date_sdate": "2004-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The study addressed the problem that, although researchers have clearly identified areas of stress for clergy wives and suggested the use of counseling services, they have not identified effective counseling interventions. Clergy wives referred to non-clergy women married to Protestant clergymen. The study included (a) the development of Clergy Wife Wings (CWW), a 5-session psychoeducational group plan for 6 to 10 clergy wives, to alleviate ministry-related stress and (b) the formative evaluation of the plan in its first implementation. Conclusions drawn suggested that CWW showed good potential as an intervention in helping clergy wives to move towards alleviation of stress but needed revisions and additional implementation and evaluation. Recommendations provided a detailed list of specific revisions. \tCWW had an outcome goal for participants of decreasing ministry-related stress, particularly in three targeted stress domains: role expectations and time demands, clergy family boundary intrusiveness, and lack of social support. As presented in the literature review, the theoretical foundations in stress came from the multimodal-transactional model of stress and its treatment (Palmer, S. & Dryden, W., 1995) and from REBT. The literature review also contained, after a summary of the history of clergy wives, an overview of the plan, with references supporting the components. The plan included pre and post-group testing with two clergy-wife stress assessment instruments -- adaptations of the Clergy Family Life Inventory (Blanton, P., Morris, L, & Anderson, D., 1990) and of the Normative Stress Scale for Clergy Wives (Huebner, 1998). \tThe formative evaluation of the group plan, in its first implementation, identified themes concerning effectiveness, strengths, weaknesses, and suggestions for improvement. These themes emerged from the qualitative analysis of various documents completed by the 9 participants, the group facilitator, and a group observer. Qualitative findings suggested effectiveness of Clergy Wife Wings through themes of participant perceptions and of reported changes in their thinking and behavior related to stress. Quantitative findings, however, from the pre and post-group measures on the clergy-wife stress instruments did not suggest effectiveness, except for a significant decrease in stress related to two of 35 stressor statements. Discussion included possible reasons for the disparity between findings.",
  "description_provenance": [
    "Author Email: porobert@vt.edu",
    "Advisor Email: stressed@vt.edu",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:03Z (GMT). No. of bitstreams: 1 RobertsDissertation2.pdf: 2765602 bytes, checksum: 2104f5882cd3cc80fc972223646db2c7 (MD5)   Previous issue date: 2004-04-21"
  ],
  "handle": "27362",
  "identifier_other": "etd-04272004-134248",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272004-134248/",
  "identifier_uri": "http://hdl.handle.net/10919/27362",
  "publisher": "Virginia Tech",
  "relation_haspart": "RobertsDissertation2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "clergy wife",
    "psychoeducational group",
    "formative evaluation",
    "multimodal-transactional model of stress",
    "stress",
    "REBT"
  ],
  "title": "Alleviating Stress in Clergy Wives: The Development and Formative Evaluation of a Psychoeducational Group Intervention",
  "type": "Dissertation"
}