{
  "contributor_author": "Jamison, Kathleen A.",
  "contributor_committeecochair": [
    "Parks, David J.",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_committeemember": [
    "Rogers, Cosby Steele",
    "Niles, Jerome A.",
    "Parson, Stephen R."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:11:04Z",
  "date_adate": "2004-04-29",
  "date_available": "2014-03-14T20:11:04Z",
  "date_issued": "2003-08-29",
  "date_rdate": "2005-04-29",
  "date_sdate": "2004-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The level of learner engagement, performance, self-efficacy, and enjoyment on a knot-tying task by college students who received positive verbal and non-verbal learning-oriented feedback by trained facilitators was examined.  Secondary learner outcomes were learner perception of engagement and learner perception of facilitator support. Facilitator variables were attitude and competency. <p>Changes in facilitatorsâ   attitudes toward (1) flow theory (Csikszentmihalyi, 1997), (2) systematic feedback (Ilgen, Fisher, & Taylor, 1979; Liden & Mitchell, 1985; Locke & Latham, 1985), and (3) hands-on learning (Joplin, 1995; Kolb, 1984; Pfieffer & Jones, 1985; Williamson, 1995) were examined. Facilitatorsâ   competence in (1) delivering learning-oriented feedback, (2) using verbal learning-oriented feedback to increase learner engagement, and (3) using nonverbal learning-oriented feedback to increase learner engagement was measured. <p>One hundred twenty-six college students from an introductory human development class were randomly selected and randomly assigned to one of three treatment groups as facilitators, learners, or timekeepers for a knot-tying task. Twelve psychology majors, members of an independent study group in the same class, were trained as observers and randomly assigned to one of the three treatment groups. The treatment was the administration of learning-oriented feedback by trained facilitators during a knot-tying task. <p>The primary findings were that learning-oriented feedback provided by trained facilitators increased learner engagement, learner self-efficacy, learner task enjoyment, learner perception of facilitator support, and learner perception of personal engagement in the task. Learner performance was not affected by the administration of learning oriented feedback.  Facilitators showed significant change in their attitude toward flow theory, systematic feedback, and hands-on learning. <p>It can be concluded that facilitators who received training in learning-oriented feedback had a greater effect on the affective side of learning (engagement, self-efficacy, enjoyment) than those who did not receive training. However, the training of facilitators in the use of learning-oriented feedback had no effect on learner performance. Further, teaching a task using facilitated verbal and nonverbal cues positively affects how facilitators feel about flow theory, hands-on learning, and feedback. Further research to verify effects of learning-oriented feedback on learner engagement using other tasks is suggested. Additional research to examine the attitudes of facilitators is suggested.",
  "description_provenance": [
    "Author Email: jamisonk@vt.edu",
    "Advisor Email: rogersco@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:04Z (GMT). No. of bitstreams: 1 JamisonKDissertation.pdf: 2139761 bytes, checksum: f7fe3866f222daf6a47c8efe2a69dd9b (MD5)   Previous issue date: 2003-08-29"
  ],
  "handle": "27369",
  "identifier_other": "etd-04272004-220646",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272004-220646/",
  "identifier_uri": "http://hdl.handle.net/10919/27369",
  "publisher": "Virginia Tech",
  "relation_haspart": "JamisonKDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "learner enjoyment",
    "learner performance",
    "learning-oriented feedback",
    "learner engagement",
    "non-verbal feedback",
    "flow theory",
    "verbal feedback",
    "experiential learning",
    "facilitation",
    "learner self-efficacy"
  ],
  "title": "The Effects of Trained Facilitation of Learning-Oriented Feedback on Learner Engagement, Performance, Self-Efficacy, and Enjoyment",
  "type": "Dissertation"
}