{
  "contributor_author": "Isin, Emre Mehmet",
  "contributor_committeechair": "Castagnoli, Neal  Jr.",
  "contributor_committeemember": [
    "Kingston, David G. I.",
    "Bevan, David R.",
    "Carlier, Paul R.",
    "Tanko, James M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:11:04Z",
  "date_adate": "2004-04-30",
  "date_available": "2014-03-14T20:11:04Z",
  "date_issued": "2004-03-22",
  "date_rdate": "2004-04-30",
  "date_sdate": "2004-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The neuronal nitric oxide synthase (nNOS) inhibitor 7-nitroindazole (7-NI) protects against the neurotoxicity of MPTP in a mouse model of neurodegeneration. Since 7-NI also inhibits the monoamine oxidase-B (MAO-B) catalyzed bioactivation of MPTP, the role of nNOS inhibition as a mediator of 7-NIâ  s neuroprotective properties have been challenged. In order to examine in greater detail the neuroprotective effects of indazolyl derivatives, the synthesis of water soluble indazolyltetrahydropyridinyl derivatives as potential â  prodrugsâ   that may undergo MAO bioactivation in the brain was undertaken. During the course of the studies on the synthesis of indazolylpyridinium derivatives, precursors to these â  prodrugsâ  , an interesting reaction involving the rearrangement of 4-(2H-indazolyl)-1-methylpyridinium iodide to the corresponding 1H-isomer was encountered. A detailed investigation of this rearrangement reaction is reported in this thesis.  <p>The syntheses and interaction of nitroindazolyltetrahydropyridinyl â  prodrugsâ   with MAO-B have been investigated previously. Molecular docking studies that attempt to explain the MAO-B substrate and inhibitor properties of members of this series of compounds are described. Finally, the MAO-A substrate properties of nitroindazolyltetrahydropyridinyl derivatives are reported.",
  "description_provenance": [
    "Author Email: eisin@vt.edu",
    "Advisor Email: dkingsto@vt.edu",
    "Advisor Email: ncastagn@vt.edu",
    "Advisor Email: drbevan@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:04Z (GMT). No. of bitstreams: 4 04IsinChapter6-7.pdf: 3068884 bytes, checksum: 5999d633972c1dc0247266b42fb81697 (MD5) 01IsinMain.pdf: 386753 bytes, checksum: 1502ef5825fda469a30f14687ad961f6 (MD5) 02IsinChapter1-4.pdf: 1417737 bytes, checksum: 2c72e5565ac5fe32e58c7766b2fe779e (MD5) 03IsinChapter5.pdf: 1312114 bytes, checksum: e1b93d3d3efaac6e62088beac14313c2 (MD5)   Previous issue date: 2004-03-22"
  ],
  "handle": "27363",
  "identifier_other": "etd-04272004-162852",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272004-162852/",
  "identifier_uri": "http://hdl.handle.net/10919/27363",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "04IsinChapter6-7.pdf",
    "01IsinMain.pdf",
    "02IsinChapter1-4.pdf",
    "03IsinChapter5.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Regiospecific synthesis",
    "Monoamine oxidase",
    "Bioactivation",
    "Docking",
    "Neuroprotection",
    "Rearrangement"
  ],
  "title": "Studies on the Synthesis and Rearrangement of Indazolylpyridinium Derivatives Precursors to Potential Neuroprotective Prodrugs Bearing a 1,2,3,6-Tetrahydropyridinyl Carrier",
  "type": "Dissertation"
}