{
  "contributor_author": "Kim, Seehyung",
  "contributor_committeechair": "Khan, Mahmood A.",
  "contributor_committeecochair": "Tse, Eliza C.",
  "contributor_committeemember": [
    "Huo, Yang-Hwae",
    "Murrmann, Suzanne K.",
    "Singh, Kusum"
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:11:05Z",
  "date_adate": "2005-04-28",
  "date_available": "2014-03-14T20:11:05Z",
  "date_issued": "2005-04-14",
  "date_rdate": "2007-04-28",
  "date_sdate": "2005-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This research develops and tests a model of the service unit ownership and control patterns used by international service companies. The main purpose of this study is to investigate trivariate causal relationships among environmental factors, organizational structure, and perceived performance in the internationalization process of service firms. A service firm operating in foreign soil has a choice of three general entry mode strategies offering different degrees of ownership and control of its remote operating units located in foreign countries -- full ownership arrangement, joint venture arrangement, and franchising arrangement.</p><p>   The entry mode strategies chosen depend on the factors relating to internal environment of a specific firm, industry related factors in which the firm operates, and external environment of the operating units at national context. This study identifies these factors, investigates how they affect the firm's choice of entry modes, and finally examines the impact of entry mode on firm's performance. The overall model has been explained by contingency theory that conceptualizes optimal level of ownership and control mode as a response by the firm to the interplay of environmental factors and as a determinant of firm's performance. To this core can be added complementary theories which are borrowed from agency theory, transaction cost theory, and resource dependence theory. These theories explain the linkages between market entry mode and each type of environmental factors.  </p><p> In order to empirically test the hypotheses, data were collected from hospitality firms regarding the ownership structure of subsidiaries located in foreign countries. As a whole, the conceptual model developed in the study received strong support from the empirical study. This study found a positive impact of contingency fit on performance and so support contingency theory in which some combinations of the environmental dimensions and organizational structure will lead to better organizational performance. Another finding of this study indicates that the increased level of ownership and control will result in enhancing the level of perceived performance. It should be noted that contingency model-based mode choice would provide managers with the optimal performance because there is not one best performing mode choice in volatile international market.</p><p>  Next, the relationship of market environment with organizational structure was examined through three different perspectives. Market environment was investigated at firm, industry, and national context, which includes five factors -- monitoring uncertainty, asset specificity, cultural distance, political uncertainty, and economic uncertainty. \tThe model is suggestive of a picture in which five environmental factors vie for affecting the choice of market entry modes. All five environmental factors were found to be significantly related to firms' organizational structure. Among five environmental factors, cultural uncertainty has the largest effect on the choice of entry mode followed by monitoring uncertainty, political uncertainty, asset specificity, and economic uncertainty. </p><p>  One of the important implications of this research is the inclusion of franchising as an actual management strategy and competitive business practice that is related to international ownership and control strategy. Higher degrees of uncertainty associated with the foreign market encourage external dependence of the venture, in which the operation depends more heavily on local relationships. Franchising substitutes the loss of ownership by an increase of external relationships and it takes without losing control on retail operation. Resource exploitation depends on the local market for either inputs or outputs for better performance. Understanding the fit between the each set of contingent variables and the elements of ownership and control strategy will allow marketers to determine when franchising is the suitable mode of operation in global markets.  </p><p> Collectively, these results suggest that the choice of an organizational form for international service firms involves a complex balance of firm, industry, and country level factors. Managers can maximize performance by aligning entry mode strategy with external contextual circumstances as well as internal resources. Managers may also be able to make better mode choice decisions using the theory-driven criteria examined in this study, increasing their chances for financial and non-financial success.</p>",
  "description_provenance": [
    "Author Email: sekim6@vt.edu",
    "Advisor Email: huoya@uvsc.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: mahmood@vt.edu",
    "Advisor Email: elizatse@cuhk.edu.hk",
    "Made available in DSpace on 2014-03-14T20:11:05Z (GMT). No. of bitstreams: 1 SeehyungKim.pdf: 1181661 bytes, checksum: f4bbeaeedc7b76e1ce89dfac2552c7f6 (MD5)   Previous issue date: 2005-04-14"
  ],
  "handle": "27373",
  "identifier_other": "etd-04272005-160750",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272005-160750/",
  "identifier_uri": "http://hdl.handle.net/10919/27373",
  "publisher": "Virginia Tech",
  "relation_haspart": "SeehyungKim.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Environmental Factors",
    "Perceived Performance",
    "Structural Equation Modeling",
    "Ownership Structure",
    "Degree of Control",
    "Service Industry",
    "Entry Mode",
    "International Franchising"
  ],
  "title": "A Causal Model of Linkages between Environment and Organizational Structure, and Its Performance Implications in International Service Distribution: An Empirical Study of Restaurant and Hotel Industry",
  "type": "Dissertation"
}