{
  "contributor_author": "Fisher, Marc Lewis",
  "contributor_committeecochair": [
    "Brewster, Carlyle C.",
    "Miller, Dini M."
  ],
  "contributor_committeemember": [
    "Mullins, Donald E.",
    "Dickerman, Allan W.",
    "Husseneder, Claudia"
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:11:06Z",
  "date_adate": "2006-05-01",
  "date_available": "2014-03-14T20:11:06Z",
  "date_issued": "2006-04-25",
  "date_rdate": "2009-05-01",
  "date_sdate": "2006-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Termites are known to harbor within their gut a diverse assemblage of symbiotic microorganisms.  Little work has been done, however, to describe the diversity and function of the bacteria in the economically important eastern subterranean termite, Reticulitermes flavipes. The first object of this study was to characterize the bacterial diversity in the gut of R. flavipes using amplified rDNA restriction analysis (ARDRA) and 16S rRNA gene sequencing.  It was determined that ARDRA was an effective technique for characterizing the diversity of the termite gut microbiota.  Of the 512 clones analyzed in the ARDRA study, 261 different ARDRA profiles were found.  Forty-two 16S rRNA gene sequences were also analyzed, resulting in 33 different ribotypes.  Representatives from six major bacterial phyla, Proteobacteria, Spirochaetes, Bacteroidetes, Firmicutes, Actinobacteria, and the newly proposed â  Endomicrobia,â   were discovered.  Further analysis indicated that the gut of R. flavipes may harbor as many as 1,318 ribotypes per termite. The second objective was to determine if the gut bacterial diversity could be manipulated by changing the termiteâ  s food source.  Using ARDRA analysis, I found no evidence that changing the food source affected the termite gut bacterial diversity.  In addition, changing the food source did not induce aggression in nestmates fed on different food sources. The third objective was to search for patterns of coevolution between termites and their gut symbiotic bacteria.  Using rRNA gene sequences from this study and sequences from public databases (1,450 sequences total), a neighbor-joining tree demonstrated strong evidence for coevolution of termites and their symbiotic bacteria, especially in the phyla Bacteroidetes, Actinobacteria, Spirochaetes, and â  Endomicrobia.â    Many monophyletic clusters were entirely composed of phylotypes specific to Isoptera.",
  "description_provenance": [
    "Author Email: mafishe1@vt.edu",
    "Advisor Email: mullinsd@vt.edu",
    "Advisor Email: carlyleb@vt.edu",
    "Advisor Email: dinim@vt.edu",
    "Advisor Email: adickerm@vt.edu",
    "Advisor Email: chusseneder@agcenter.lsu.edu",
    "Made available in DSpace on 2014-03-14T20:11:06Z (GMT). No. of bitstreams: 2 Dissertation.pdf: 6493540 bytes, checksum: ced00c51adcd6f82edc55e5a51bd68c5 (MD5) ARDRA_Steps.pdf: 216324 bytes, checksum: b8983473984b1d400b22c68d238f1865 (MD5)   Previous issue date: 2006-04-25"
  ],
  "handle": "27379",
  "identifier_other": "etd-04272006-135047",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272006-135047/",
  "identifier_uri": "http://hdl.handle.net/10919/27379",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation.pdf",
    "ARDRA_Steps.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "diversity",
    "bacteria",
    "16S rRNA",
    "ARDRA",
    "termites",
    "symbiosis"
  ],
  "title": "Comparison of Subterranean Termite (Rhinotermitidae: Reticulitermes) Gut Bacterial Diversity Within and Between Colonies and to Other Termite Species Using Molecular Techniques (ARDRA and 16S rRNA Gene Sequencing)",
  "type": "Dissertation"
}