{
  "contributor_author": "Hollandsworth, Randall Jackson",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_committeemember": [
    "Burton, John K.",
    "Eschenmann, Konrad Kurt",
    "Wilkinson, Thomas W.",
    "Wildman, Terry M."
  ],
  "contributor_department": "Instructional Technology",
  "date_accessioned": "2014-03-14T20:11:05Z",
  "date_adate": "2005-04-29",
  "date_available": "2014-03-14T20:11:05Z",
  "date_issued": "2005-04-18",
  "date_rdate": "2005-04-29",
  "date_sdate": "2005-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research evaluates the theoretical and practical capabilities for design, development, and evaluation for a computer-based learning module for interpersonal communications.  A Type One developmental study provides an asynchronous review module for a professional leadership training provider to follow up instructor-led training.  The module consists of elearning review modules and animated simulations to practice the scenario-based skill practice.  The literature review identifies that using online technologies as an instructional strategy offers specific advantages for summative learning strategies.  In addition, studies find computer-based role-playing strategies can enhance the learning of interpersonal skills.   The use of computer-based, asynchronous strategies build from the findings of four relevant studies: Weller and Blaireâ  sâ   (1977) use of computer-assisted judging and feedback; Schroederâ  s (1986) use of videodisc technology to effectively teach interpersonal skills; Kass, Burke, Blevis, and Williamsonâ  s (1993) Guided Social Simulation Model; and Holsbrink-Engelâ  s (1997) use of computer-based role plays.  One key finding from the various studies suggests that transfer of learning and skill application are dependent on post-instructional maintenance following the initial learning event.  This review investigates the elements of learning interpersonal communications, the application of asynchronous strategies to achieve this learning, and effective post-instructional strategies that support comprehension and skill transfer.",
  "description_provenance": [
    "Author Email: rholland@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Advisor Email: twilkie@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:05Z (GMT). No. of bitstreams: 1 Rev2dissHollandsworth.pdf: 1953633 bytes, checksum: d549ff64cbd4c00a45e4abdf2388de99 (MD5)   Previous issue date: 2005-04-18"
  ],
  "handle": "27372",
  "identifier_other": "etd-04272005-143701",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272005-143701/",
  "identifier_uri": "http://hdl.handle.net/10919/27372",
  "publisher": "Virginia Tech",
  "relation_haspart": "Rev2dissHollandsworth.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "instructional evaluation",
    "leadership development",
    "online role-plays",
    "scenario-based learning",
    "simulations",
    "elearning",
    "online learning",
    "interpersonal communications"
  ],
  "title": "The Theoretical and Practical Considerations for Effective Design, Development,and Evaluation of an Asynchronous Review Module on Interpersonal Communications",
  "type": "Dissertation"
}