{
  "contributor_author": "Cannon, John Glen",
  "contributor_committeecochair": [
    "Stewart, Daisy L.",
    "Hillison, John H."
  ],
  "contributor_committeemember": [
    "Reaves, Dixie Watts",
    "Anderson, Glenn A.",
    "Jackman, W. Jay",
    "Duncan, Dennis W."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:05Z",
  "date_adate": "2005-04-28",
  "date_available": "2014-03-14T20:11:05Z",
  "date_issued": "2005-04-25",
  "date_rdate": "2005-04-28",
  "date_sdate": "2005-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Perceptions of the Influence of the Virginia Governorâ  s School for Agriculture on VGSA Alumni By John G. Cannon Abstract \tThe Virginia Governorâ  s School for Agriculture (VGSA) is a summer enrichment program for gifted and talented students from throughout the Commonwealth of Virginia. The program is sponsored by the Virginia Department of Education, and it takes place at Virginia Tech during the month of July each year. The program is housed in the Department of Agricultural and Extension Education in the College of Agriculture and Life Sciences. Students who participate in the program receive hands on, cutting edge instruction in the broad fields of agricultural sciences, natural resources, and veterinary medicine. \tThe nature of agriculture has and continues to evolve. Farmers comprise a very small portion of the population; however there are many careers in agriculture which require a steady supply of well-trained and highly educated professionals. It is projected that the demand for qualified college graduates to fill agricultural jobs will exceed supply. The VGSA has been developed as an agricultural literacy tool, to expose gifted and talented students to the diverse careers in the industry. \tThe purpose of this study was to examine the impact of the VGSA on the students who have completed the four classes. Specific objectives were to develop demographic information; to ascertain the perception of the influence of the VGSA on alumni choice of college, major, and career; and to ascertain the perception of the influence of the VGSA on alumni knowledge and perception of the agricultural industry. \tA survey instrument was sent to all students who had completed the VGSA (N=316). Over half of the alumni (n=182) returned the instrument. No significant difference was found between early, late, and non-responders.  \tThe findings show that the average VGSA student is a white female that resides in an urban area with a population greater than 20,000. This student has a high school GPA of 3.93 and is in the top 6% of her high school graduating class. She has an SAT math score of 627 and an SAT verbal score of 630. She is not a member of the FFA or 4-H. \tThe findings show that the VGSA does not have an overwhelming influence on alumni choice of college or college major. The VGSA does not have an overwhelming influence on alumni career goals. The findings show that the VGSA does have much influence on alumni knowledge and perception of the agricultural industry.",
  "description_provenance": [
    "Author Email: jocanno1@vt.edu",
    "Advisor Email: dixie@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: hillison@vt.edu",
    "Advisor Email: ganderso@pen.k12.va.us",
    "Advisor Email: JJackman.NAAE@uky.edu",
    "Advisor Email: dwd@uga.edu",
    "Made available in DSpace on 2014-03-14T20:11:05Z (GMT). No. of bitstreams: 1 CannonDissertation.PDF: 335869 bytes, checksum: b9e8231e6d7cc9e866faa4b8eabe7042 (MD5)   Previous issue date: 2005-04-25"
  ],
  "handle": "27371",
  "identifier_other": "etd-04272005-091304",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272005-091304/",
  "identifier_uri": "http://hdl.handle.net/10919/27371",
  "publisher": "Virginia Tech",
  "relation_haspart": "CannonDissertation.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Gifted and Talented Students",
    "Governor's School for Agriculture",
    "Agricultural Education",
    "Agricultural Literacy"
  ],
  "title": "Perceptions of the Influence of the Virginia Governorâ  s School for Agriculture on VGSA Alumni",
  "type": "Dissertation"
}