{
  "contributor_author": "Stempien, Jennifer Anne",
  "contributor_committeechair": "Kowalewski, Michal",
  "contributor_committeemember": [
    "Ward, Lauck W.",
    "Scheckler, Stephen E.",
    "Eriksson, Kenneth A.",
    "Daley, Gwen M.",
    "Xiao, Shuhai"
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:11:06Z",
  "date_adate": "2006-05-04",
  "date_available": "2014-03-14T20:11:06Z",
  "date_issued": "2006-04-06",
  "date_rdate": "2007-05-04",
  "date_sdate": "2006-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Coastal environments are important in many ways: they provide food and energy for coastal communities, have a variety of unique biologic habitats, and influence global climate.  These environments can change due to either anthropogenic or natural phenomena over a wide range of time scales. However, the often overlooked long-term (centennial to millennial) processes may be hidden behind short-term fluctuations observed today.  The need for a reference baseline of coastal habitats provides a new opportunity for paleontology, which is ideally equipped to document the long-term trends and reconstruct historical and ancient environments and communities. </p><p>  However due to taphonomic processes such as decay and diagenesis, there will always be some bias inherent to the fossil record. This bias has been often viewed as a negative aspect, undermining the utility of paleontological data for retrieving ecological and environmental records.  Yet, fossils are still one of the best sources of direct data about the past faunas and their ecosystems. To overcome the biases introduced by the fossilization process, researchers have used observations and experiments in modern systems as models to compare fossil deposits, a method called actualistic paleontology. Over recent years, such actuopaleontological approaches have been used increasingly to exploit distinct signatures of fossil deposits in environmental reconstructions, quantify effects of anthropogenic processes on invertebrate faunas and regional ecosystems, and even augment archaeological studies.</p><p>  Three studied included in this dissertation exploit different aspects of paleontological techniques to study coastal systems, including both Recent and fossil settings. Two of the studies use modern environments to serve as models for investigating preservation potential and potential biases that affect subfossil and fossil assemblages forming in intertidal environments, from whether certain fauna will be preserved to the biases inherent in a shell deposit. The final study, conducted at a fine geologic resolution, focuses on the morphology of a fossil ancestor of an extant mactrid bivalve that is ecologically important in many present-day coastal habitats and well-studied by ecologists and malacologists. The study attempts to quantify morphological effects of environmental changes that occur over geological time scales. </p>",
  "description_provenance": [
    "Author Email: stemp78@yahoo.com",
    "Advisor Email: lwward@vt.edu",
    "Advisor Email: scheckler@vt.edu",
    "Advisor Email: kaeson@vt.edu",
    "Advisor Email: daleyg@winthrop.edu",
    "Advisor Email: michalk@vt.edu",
    "Advisor Email: xiao@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:06Z (GMT). No. of bitstreams: 1 StempienETD.pdf: 1970445 bytes, checksum: 81e7d3a542557619ec2e3639eee99d9d (MD5)   Previous issue date: 2006-04-06"
  ],
  "handle": "27377",
  "identifier_other": "etd-04272006-101416",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272006-101416/",
  "identifier_uri": "http://hdl.handle.net/10919/27377",
  "publisher": "Virginia Tech",
  "relation_haspart": "StempienETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Morphology",
    "Actualistic Paleontology",
    "Bivalvia",
    "Quantitative",
    "Taphonomy",
    "Predation"
  ],
  "title": "Quantitative Studies of Late Neogene Coastal Environments Using Bivalve Subfossil and Fossil Assemblages",
  "type": "Dissertation"
}