{
  "contributor_author": "Billam, Padma",
  "contributor_committeechair": "Meng, Xiang-Jin",
  "contributor_committeemember": [
    "Pierson, Frank William",
    "Toth, Thomas E.",
    "Duncan, Robert B. Jr.",
    "Tu, Zhijian Jake"
  ],
  "contributor_department": "Biomedical and Veterinary Sciences",
  "date_accessioned": "2014-03-14T20:11:06Z",
  "date_adate": "2007-05-02",
  "date_available": "2014-03-14T20:11:06Z",
  "date_issued": "2007-04-16",
  "date_rdate": "2008-05-02",
  "date_sdate": "2007-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Hepatitis E is an acute, enterically transmitted disease of public health importance. The mechanism of pathogenesis of HEV is poorly understood due to the lack of an in vitro cell culture system and an ideal animal model system. With the discovery of avian HEV and its association with a hepatic disease (Hepatitis-Splenomegaly syndrome), chickens provide an excellent small homologous animal model system to study this important virus. The objectives of this dissertation were to utilize chickens as a model system to study the pathogenesis and replication of avian HEV under the natural route of infection, to identify potential extrahepatic replication sites, to determine and analyze the complete genomic sequence of the avirulent strain of avian HEV, and to study the compartive pathogenesis of the two isolates of avian HEV, the prototype pathogenic and avirulent strains of avian HEV.       We attempted to experimentally infect specific-pathogen-free (SPF) adult chickens by the natural fecal-oral route in order to systematically study HEV pathogenesis and replication and to characterize the clinical course and pathological lesions associated with avian HEV infection. Sixty-week-old, specific-pathogen-free (SPF) chickens were inoculated with 5 x104.5 50% chicken infectious dose of avian HEV by oronasal route and IV route. All oronasally- and IV- inoculated chickens had seroconverted to avian HEV antibodies and fecal virus shedding was detected variably from 1 to 20 DPI in the IV group, and from 10 to 56 DPI in the oronasal group. Avian HEV RNA was detected in serum, bile, and liver samples earlier during the course of infection in IV-inoculated chickens than in oronasally-inoculated ones. Gross liver lesions including subcapsular hemorrhages and enlargement of right intermediate lobe and microscopic hepatic lesions in the liver characterized by lymphocytic periphlebitis and phlebitis were observed in inoculated chickens. This is the first report of experimental HEV infection via its natural route in a homologous animal model system.      Very little is known about HEV pathogenesis and it has been hypothesized that HEV replicates in tissues other than liver. The replicating negative-strand viral RNA was detected by negative-strand-specific RT-PCR in liver, serum, colon, cecum, jejunum, ileum, duodenum and cecal tonsils,but not in other non-GIT tissues. Immunohistochemistry using an avian HEV capsid protein-specific anti-peptide antibody revealed positive signal in liver and GIT tissues including colon, jejunum, ileum, cecum, cecal tonsils and pancreas. The detection of avian HEV capsid antigen and replicative negative-strand viral RNA in the GIT tissues indicates that HEV replicates in the GI tract following infection by fecal-oral route.      The complete genomic sequence of an avirulent strain of avian HEV was determined using primer walking strategy. The full-length genome of the avirulent strain is 6649 nts in length and has a nucleotide sequence identity of 90.1% with the prototype pathogenic strain. Numerous non-silent mutations were observed in ORF1, the region coding for the nonstructural proteins. Six unique non-silent mutations were identified in the capsid-encoding ORF2 region and the ORF3 had four non-silent mutations. Phylogenetic analysis based on full-length genomic sequence revealed that the avirulent strain is clustered together with the pathogenic avian HEV and represents a branch distinct from mammalian HEVs.      In order to study the comparative pathogenesis between the pathogenic and avirulent strains of avian HEV, an infectious stock of the avirulent avian HEV was generated and infectivity titer was determined to be 5 x 102.5 CID50 per ml by experimentally infecting young SPF chickens. Six-week-old SPF chickens were inoculated with one of two strains of avian hepatitis E viruses, pathogenic avian HEV recovered from a chicken with HS syndrome and avirulent avian HEV isolated from a healthy chicken to study comparative pathogenesis. Most of the chickens seroconverted  by 3 wpi in both pathogenic avian HEV and avirulent avian HEV groups. Avian  HEV RNA was  detected in feces and serum of the chickens from both the inoculated group from 1 wpi. Microscopic liver lesions included lymphocytic periphlebitis and phlebitis the overall hepatic lesion mean score was higher for the pathogenic avian HEV group compared to the avirulent avian HEV and control groups, suggestive of attenuation      In summary, SPF chickens were experimentally infected with avian HEV by natural route to study the systematic pathogenesis and replication. Non-liver replication sites of avian HEV were also identified in a chicken model. The complete genomic sequence of an apparently avirulent strain of avian hepatitis E virus was determined and the comparative pathogenesis of avian hepatitis E virus isolates from a chicken with HS syndrome and from a healthy chicken was also studied by experimental infections in young SPF chickens. The results from this dissertation research have important implications for the understanding of HEV pathogenesis.",
  "description_provenance": [
    "Author Email: pbillam@vt.edu",
    "Advisor Email: pierson@vt.edu",
    "Advisor Email: ttoth@vt.edu",
    "Advisor Email: duncanr@vt.edu",
    "Advisor Email: xjmeng@vt.edu",
    "Advisor Email: jaketu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:06Z (GMT). No. of bitstreams: 1 PBillam.pdf: 2063614 bytes, checksum: b80292532917ec2002d90b640bea61f3 (MD5)   Previous issue date: 2007-04-16"
  ],
  "handle": "27382",
  "identifier_other": "etd-04272007-042355",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272007-042355/",
  "identifier_uri": "http://hdl.handle.net/10919/27382",
  "publisher": "Virginia Tech",
  "relation_haspart": "PBillam.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hepatitis E",
    "avian",
    "hepatitis E virus",
    "HEV"
  ],
  "title": "Mechanism of Pathogenesis and Replication of an Avian Strain of the Hepatitis E Virus in a Chicken Model",
  "type": "Dissertation"
}