{
  "contributor_author": "Bird, Mark Hilton",
  "contributor_committeechair": "Johnson, Scott W.",
  "contributor_committeemember": [
    "McWey, Lenore M.",
    "Benningfield, Anna Beth",
    "Piercy, Fred P."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:07Z",
  "date_adate": "2009-06-18",
  "date_available": "2014-03-14T20:11:07Z",
  "date_issued": "2009-04-24",
  "date_rdate": "2009-06-18",
  "date_sdate": "2009-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In recent decades there has been an increase in literature regarding sexual addiction as well as a growing number of clients presenting in therapy with problems related to their sexual behaviors (including internet sexual addiction). More recently, the impact of sexual addiction on couples has been noted, but little is known regarding how couples can be assisted in the recovery process. In this qualitative study, I explored in depth the critical change processes in couple therapy for sexual addiction from the therapistâ  s perspective, including the therapistâ  s role in that process. The findings suggest that couple recovery from sexual addiction includes (a) individual responsibility in recovery (which includes themes of trauma, family-of-origin, emotional reactivity, depersonalizing, and utilizing other resources), (b) couple recovery (which includes the themes of family-of-origin, communication, empathy, intimacy, trust, and sexual intimacy), (c) balancing individual recovery with couple recovery in the process of healing (which includes the themes of education, accountability, and couple perspective) and (d) distinguishing affairs from sexual addiction. I discuss the implications of study findings, offering a sequential outline of the process of therapy with couples who are struggling to recover from sexual addiction, including therapist interventions that may assist in that process. Limitations to the study and implications for future research in sexual addiction generally and MFT specifically are presented.",
  "description_provenance": [
    "Author Email: markbird.lmft@gmail.com",
    "Advisor Email: lmcwey@fsu.edu",
    "Advisor Email: abenning@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: scottwj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:07Z (GMT). No. of bitstreams: 1 MarkBirdDissertationSexualAddictionAndMFT.pdf: 862258 bytes, checksum: 5788281cfd5482b2b33f620d863a64f3 (MD5)   Previous issue date: 2009-04-24"
  ],
  "handle": "27386",
  "identifier_other": "etd-04272009-102213",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272009-102213/",
  "identifier_uri": "http://hdl.handle.net/10919/27386",
  "publisher": "Virginia Tech",
  "relation_haspart": "MarkBirdDissertationSexualAddictionAndMFT.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "recovery",
    "couple therapy",
    "marriage and family therapy",
    "Sex addiction"
  ],
  "title": "Sexaul Addiction and MFT: Therapists' Perspectives on Facilitating Individual and Relationship Healing",
  "type": "Dissertation"
}