{
  "contributor_author": "Wan, Li",
  "contributor_committeechair": "Friedman, Bruce H.",
  "contributor_committeemember": [
    "Bell, Martha Ann",
    "Harrison, David W.",
    "Castagnoli, Neal  Jr.",
    "Castagnoli, Kay P."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:06Z",
  "date_adate": "2006-05-11",
  "date_available": "2014-03-14T20:11:06Z",
  "date_issued": "2006-04-25",
  "date_rdate": "2009-05-11",
  "date_sdate": "2006-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Smoking is one of the leading causes of death in the world. About 80% of smokers start smoking before the age of 18. In the Appalachian area and the South in the United States, smoking percentages among adults and adolescents are higher than in other regions. Female smoking shows a variety of different trends from male smoking, and smoking brings particular health problems related to production to female smokers. These findings highlighted the importance of studying female teenage smokers in southwest Virginia. The initial project aimed to identify risk factors that might prevent smoking in an early stage. Dr. Helen Crawford led the Cognitive Neuroscience Lab at Virginia Tech in discovering the psychophysiological vulnerabilities of female teenage smokers. Toward this end, event-related potential (ERP), personality, and behavioral data were collected in teenage female smokers and non-smokers. These data were analyzed to examine possible psychophysiological vulnerabilities in female teenage smokers such as deficits in brain and cognitive function, personality traits, and environment influences. The purpose of this dissertation is to further analyze these data to elaborate and clarify the relationships among these vulnerabilities toward understanding teenage smoking behavior.   Participants were 49 teenage girls (smokers and non-smokers) with age from 14 to 18. The measures included sensory gating, platelet MAO-B activity, attention, memory, temperament, schizotypal personality, recognition of facial expressions, taste and smell. The initial set of analyses compared smokers and non-smokers, including those classified as high and low dependent, on all dependent measures. The results suggested some psychophysiological vulnerabilities in female teenage smokers, which have been used as support for the self-medication and the orbito-frontal dysfunction models of why teenagers smoke (Crawford et al., 2004). Further examination of these factors may help teenagers to reduce the smoking dependency and possibly improve cognitive function.  Specifically, this dissertation focused on the role of the variable of monoamine oxidase-B (MAO-B) in the correlations among sensory gating, MAO and other cognitive and personality measures. All smokers were divided into high and low MAO groups first. Comparison analyses were conducted between them. The high MAO group showed better sensory gating function than the low MAO group. Correlation analyses were conducted among all of the measures. The significant linear relationships between MAO and sensory gating, MAO and CO level and MAO and temperament were demonstrated. MAO activity positively correlated with the sensory gating function and negatively correlated with CO level and temperament characteristics. Finally, to explore the mechanisms of the relationship between MAO and sensory gating, the neurotransmitter systems related to MAO and sensory gating were discussed.",
  "description_provenance": [
    "Author Email: wan@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: dwh@vt.edu",
    "Advisor Email: bhfriedm@vt.edu",
    "Advisor Email: ncastagn@vt.edu",
    "Advisor Email: kcastagn@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:06Z (GMT). No. of bitstreams: 1 LiwDissertation.pdf: 1175023 bytes, checksum: 694bb4ec8d2044f6d750580a20c35821 (MD5)   Previous issue date: 2006-04-25"
  ],
  "handle": "27380",
  "identifier_other": "etd-04272006-140739",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272006-140739/",
  "identifier_uri": "http://hdl.handle.net/10919/27380",
  "publisher": "Virginia Tech",
  "relation_haspart": "LiwDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Sensory Gating",
    "Monoamine Oxidase",
    "Psychophysiological Vulnerabilities",
    "Neurotransmitters",
    "Teenage Smoking"
  ],
  "title": "Monoamine Oxidase and Sensory Gating: Psychophysiological Vulnerabilities among Teenage Smokers",
  "type": "Dissertation"
}