{
  "contributor_author": "Xing, Zengping",
  "contributor_committeechair": "Viehland, Dwight D.",
  "contributor_committeemember": [
    "Li, Jie-Fang",
    "Wang, Yu",
    "Odendaal, Willem Gerhardus"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:11:07Z",
  "date_adate": "2009-06-12",
  "date_available": "2014-03-14T20:11:07Z",
  "date_issued": "2009-04-10",
  "date_rdate": "2012-03-27",
  "date_sdate": "2009-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Magnetic sensors are widely used in the field of mineral, navigational, automotive, medical, industrial, military, and consumer electronics. Many magnetic sensors have been developed that are generated by specific laws or phenomena: such as search-coil, fluxgate, Hall Effect, anisotropic magnetoresistance (AMR), giant magnetoresistance (GMR), magnetoelectric (ME), magnetodiode, magnetotransictor, fiber-optic, optical pump, superconducting quantum interference device (SQUID), etc. Each of these magnetic field sensors has their merits and application areas. For low power consumption (<10uW), quasi-static frequency (<10Hz) and high sensitivity (<nT) application, magnetoelectric laminate sensors offer the best potential capability and thus are the topic of my dissertation. <p> Here, in this thesis, I have focused on designs and optimizations of magnetoelectric sensor units (i.e., sensors and circuit). To achieve my goals, I have developed some useful rules for ME sensor and detection circuit design. <p> For ME sensor optimization, designs should consider both frequencies far away from resonance and at resonance. For the former one, both internal and external noise contribution must be considered, as one of them will limit practical applications. With regards to the internal noise sources, I have developed two design optimization methods, designated as â  scale effectâ   and â  ME arrayâ  . I showed that they have the ability to increase the magnetic field detection sensitivity, which was verified by experiments. With regard to external noise consideration, I have investigated how the fundamental extrinsic noise sources (temperature fluctuation, vibration, etc) affect ME laminate sensors. A concept of separating signal and noise modes into difference is put forward. Optimization with this concept in mind required us to redesign the internal structure of ME laminate sensors. At the resonant frequency, the ME voltage coefficient &#8734;ME is the most important parameter. To enhance resonant gain in &#8734;ME, I have developed a three phase laminate concept, which is based on increasing the effective mechanical factor Q while reducing the resonant frequency. A ME voltage coefficient of &#8734;ME ~40V/cm.Oe has been achieved at resonance, which is about 2x higher than that of a conventional bending mode. <p> Investigations of detection circuit optimization were also performed. Component selection strategies and a new charge topology were considered. Proper component values were required to optimize the charge detection scheme. It was also found, under some specific conditions to satisfy the circuit stability, that if the lowest required measurement frequency of the charge source was f1, then that it was not necessary to make the high corner frequency fp of the charge amplifier lower than f1: as doing so would decrease the systemâ  s signal-to-noise ratio (SNR). A high pass, high order filter placed behind the charge amplifier was found to increase the charge sensitivity, as it narrows the intrinsic noise bandwidth and decreases the output noise contribution, while only slightly affecting the signalâ  s output amplitude. <p> Prototype ME unit were also constructed, and their noise level simulated by Pspice. Experimental results showed that prototypes ME unit can reach their detection limit. In addition, a new magneto-electric coupling mechanism was also found, which had a giant ME effect.",
  "description_provenance": [
    "Author Email: xing@vt.edu",
    "Advisor Email: dviehlan@vt.edu",
    "Advisor Email: Jiefang@mse.vt.edu",
    "Advisor Email: wangy@vt.edu",
    "Advisor Email: wgo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:07Z (GMT). No. of bitstreams: 1 xing-dissertation.pdf: 3581337 bytes, checksum: c35a735e6f6e7ee93ce78845edc9ae3a (MD5)   Previous issue date: 2009-04-10"
  ],
  "handle": "27387",
  "identifier_other": "etd-04272009-170508",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272009-170508/",
  "identifier_uri": "http://hdl.handle.net/10919/27387",
  "publisher": "Virginia Tech",
  "relation_haspart": "xing-dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Spice Simulation",
    "Low noise circuitry",
    "Noise Spectrum",
    "Magnetoelectric",
    "Sensors",
    "Modeling",
    "Actuators",
    "Optimization"
  ],
  "title": "Magnetoelectric Device and the Measurement Unit",
  "type": "Dissertation"
}