{
  "contributor_author": "McKinney, Hugh M",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Jarvis, John P.",
    "Morris, Linda E.",
    "Corderman, David"
  ],
  "contributor_department": "Adult Learning and Human Resource Development",
  "date_accessioned": "2014-03-14T20:11:07Z",
  "date_adate": "2007-05-01",
  "date_available": "2014-03-14T20:11:07Z",
  "date_issued": "2007-04-11",
  "date_rdate": "2007-05-01",
  "date_sdate": "2007-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<head> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\" /> <title>Hugh M. McKinney Abstract</title> </head>  <body> <p>As an FBI Agent  leading the FBI National Executive Institute (NEI) I met a number of law  enforcement leaders who, after becoming the chief their police department,  related that they thought they knew what the chiefs&rsquo; job was until the first  day they took that position. Contemporaneously, I learned from one of my NEI  students, who had also attended the Army War College (AWC), that the AWC  strategic leadership courses educated Colonels before they became Generals. These  seminal events gave me the idea to provide the NEI with studies on strategic  leadership in law enforcement. The outcome of a preliminary literature search  evidenced a paucity of research for strategic leadership involving law  enforcement executives and suggested the need for a study. The chiefs of police  in the Major Cities Chief (MCC) Association were an appropriate population for  such research since a wealth of wisdom resided in them. This study was aimed at  determining what their experience taught them about two global questions that  guided the inquiry: (a) What is the meaning and value of strategic leadership  for law enforcement officials in today&rsquo;s world, and (b) What is the  developmental process involved in transitioning from tactical to strategic  leader. A mailed instrument was used to gather data, including asking who the  participants considered the best strategic leaders in the MCC. Ten chiefs were  thereby peer-selected for face-to-face interviews that augmented, gave more  richness, and more depth to the data. Findings suggest that while strategic  leadership is still in process and escapes a finite definition, it includes a  big picture, systems/contingency view of dealing with issues rather than  incidents, continuous lifelong learning for themselves through assignments,  reflection, and education, but also involves developing their followers through  mentoring and delegation. This study found that the MCC perceive themselves as  strategic leaders. Their transitional process of becoming a strategic leader included  mentors, conflict, courage to stick with right decisions, integrity, and  political perspective. Further statistical analysis and study is recommended  comparing these data with other leadership studies to give a more distinct  definition of and a model for strategic leadership both in law enforcement and  the general population.</p> </body> </html>",
  "description_provenance": [
    "Author Email: ddsm01@bellsouth.net",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: jjarvis@fbiacademy.edu",
    "Advisor Email: linda_morris11495@yahoo.com",
    "Advisor Email: dcorderman@alallc.us",
    "Made available in DSpace on 2014-03-14T20:11:07Z (GMT). No. of bitstreams: 1 McKinneyETD042707a.pdf: 859223 bytes, checksum: 79f10916d62994dafd221a9e2a579643 (MD5)   Previous issue date: 2007-04-11"
  ],
  "handle": "27385",
  "identifier_other": "etd-04272007-195630",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272007-195630/",
  "identifier_uri": "http://hdl.handle.net/10919/27385",
  "publisher": "Virginia Tech",
  "relation_haspart": "McKinneyETD042707a.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Law Enforcement",
    "Strategic Leadership"
  ],
  "title": "THE MEANING, VALUE, AND EXPERIENCE OF STRATEGIC LEADERSHIP FOR LAW ENFORCEMENT EXECUTIVES IN TODAYâ  S WORLD",
  "type": "Dissertation"
}