{
  "contributor_author": "Guill, Stephen Gregory",
  "contributor_committeechair": "Herbert, William G.",
  "contributor_committeemember": [
    "Zedalis, Donald",
    "Bassaganya-Riera, Josep",
    "Gregg, John M.",
    "Gwazdauskas, Francis C.",
    "Nickols-Richardson, Sharon M."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:11:07Z",
  "date_adate": "2007-04-30",
  "date_available": "2014-03-14T20:11:07Z",
  "date_issued": "2007-04-20",
  "date_rdate": "2010-04-30",
  "date_sdate": "2007-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Obstructive sleep apnea syndrome (OSAS), a chronic respiratory disorder affecting as many as 1 in 5 adults, is associated with repetitive collapse of the upper airway during sleep and results in fragmented sleep and intermittent periods of hypoxia and hypercapnia.  If left untreated, OSAS increases the risk for hypertension, insulin resistance, metabolic syndrome (MetS) in a manner that is independent of obesity in mid-adulthood.  However, it is still unknown if evidence of these relationships is apparent in young adults with OSAS who are otherwise healthy and free of other chronic comorbidities.  Objectives:  To determine if functional and biochemical evidence of insulin resistance, MetS, and vascular endothelial dysfunction (VED) exists in young, overweight men with OSAS and if the combined effects of obesity and OSAS augments  the evidence of chronic disease pathogenesis beyond the effects of obesity alone.  Subjects:  Subjects were 12 overweight men with OSAS (age = 22.8 ± 0.8; BMI = 32.4 ± 1.0; apnea-hypopnea index (AHI) = 25.4 ± 5.4), 17 overweight men without OSAS (age = 22.5 ± 0.7; BMI = 31.6 ± 1.1; AHI = 2.2 ± 0.3), and 18 normal weight men without OSAS (age = 21.1 ± 0.5; BMI = 22.4 ± 0.4; AHI = 1.9 ± 0.3).  Methods: Subjects were evaluated for OSAS using an unsupervised, portable polysomnography test.  Total fat and central abdominal fat (CAF) were assessed using dual energy x-ray absorptiometry (DEXA).  Fasting blood samples were used to quantify biochemical markers for insulin resistance (glucose, insulin, adiponectin, IL-6, and TNF-á) and endothelial dysfunction (CRP, VEGF, and VEGFR2) using ELISA, RIA, and flow cytometry. MetS was defined according to Adult Treatment Panel III (ATP III) clinical standards.  Triglycerides, HDL cholesterol, and glucose were measured using a commercial lipid panel.  Resting blood pressure was obtained manually via auscultation.  VED was measured via strain gauge plethysmography, with endothelium-dependent vasodilatation being assessed from forearm reactive hyperemia after a 5-minute period of upper arm occlusion. Statistics: One-way ANOVA was used to determine group differences in variables.  Two-way ANOVA was used to evaluate group x time interactions during the 2-minute recovery period following upper arm occlusion.  Pearson partial correlation was used to assess relationships between continuous variables, with analyses being controlled for CAF or OSAS severity.  Spearman correlation was used to assess relationships between number of MetS components present and both indices of adiposity and OSAS severity.  Stepwise multiple linear regression analysis was used to determine significant predictors of OSAS severity, insulin resistance, components of the MetS, and endothelial dysfunction.   Results:  Overweight subjects with OSAS had more CAF, higher fasting triglycerides, and lower serum adiponectin concentrations than both overweight and normal weight non-apneic controls.  Furthermore, fasting triglycerides were directly correlated to OSAS severity, even after the influence of central abdominal fat was removed.  OSAS severity was an independent predictor of triglyceride levels, and vice versa.  Insulin resistance, leptin, insulin, and CRP were all higher in overweight subjects than controls, but no further differences were attributable to severity of OSAS.  No differences in IL-6, TNF-á, ADMA, and expression of VEGFR2 were noted between any groups.  No group or group x time interaction differences existed in regards to postocclusive reactive hyperemia responses.  Conclusions: Young men with OSAS exhibit several unique anthropometric and biochemical abnormalities that may indicate early pathogenesis of or increased risk for future development for cardiovascular and metabolic disorders.   Identification and treatment of OSAS at this age may be critical to prevent the onset and progression of these chronic disorders.",
  "description_provenance": [
    "Author Email: sguill@vt.edu",
    "Advisor Email: dzedalis@vcom.vt.edu",
    "Advisor Email: wgherb@vt.edu",
    "Advisor Email: jbassaga@vt.edu",
    "Advisor Email: jgregg@vt.edu",
    "Advisor Email: guaz@vt.edu",
    "Advisor Email: smn13@psu.edu",
    "Made available in DSpace on 2014-03-14T20:11:07Z (GMT). No. of bitstreams: 1 Guill_Dissertation.pdf: 981770 bytes, checksum: 160fc043e476ad87175f05e0859fbdcb (MD5)   Previous issue date: 2007-04-20"
  ],
  "handle": "27384",
  "identifier_other": "etd-04272007-155818",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272007-155818/",
  "identifier_uri": "http://hdl.handle.net/10919/27384",
  "publisher": "Virginia Tech",
  "relation_haspart": "Guill_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Obstructive Sleep Apnea Syndrome",
    "Insulin Resistance",
    "Metabolic Syndrome",
    "Endothelial Dysfunction",
    "Adipokine",
    "Central Abdominal Fat"
  ],
  "title": "The Influence of Obstructive Sleep Apnea Syndrome on Insulin Resistance, Metabolic Syndrome, and Endothelial Dysfunction in Young Men",
  "type": "Dissertation"
}