{
  "contributor_author": "Ali, Bader Nader",
  "contributor_committeechair": "Graham, Richard Terry",
  "contributor_committeemember": [
    "LaPorte, James E.",
    "Uysal, Muzaffer S.",
    "Minish, Roberta M.",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:07Z",
  "date_adate": "1999-04-28",
  "date_available": "2014-03-14T20:11:07Z",
  "date_issued": "1999-04-20",
  "date_rdate": "2005-10-12",
  "date_sdate": "1999-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This research was designed to investigate the utility, relevance, and efficacy levels in the application of Computer Electronic Mail (CEM) as a tool for the teaching and learning of English as a second language (ESL). The participants in the study consisted of 26 students (18 females and 8 males) selected from the population of full time middle-level students of English as a Second Language Kuwaiti Students (ESLKS) in Kuwait University (KU). </p><p> The Statistical findings of the study indicate that CEM is a useful and effective tool for the study of English as a second language among ESLKS. Positive significant differences were observed comparing pre-CEM and post-CEM scores in sentence structure, syntax, spelling, vocabulary, and the clarity of writing skills. A second dimension of the study was a survey of the participants' opinions and attitudes about CEM. The opinion survey assessed participants' perceptions of the relevance, usefulness, and effectiveness of CEM as a means of communication and as a tool for the learning of the English language. The study involved a pretest, a seven-week training in the use of CEM to communicate with native American English speakers, and a posttest of participants' performance in five critical language skills. This portion of the study also indicates the participants' overall satisfaction with CEM as useful tool both for developing English language skills, facilitating learning, building self-confidence in contacting and communicating with other people, stimulating interest in the learning of the English language, and helping in homework assignments. Participants also seem to perceive the relevance of CEM not only in the learning of English as a second language, but also in communication and in transmitting information, generating ideas, striking friendships, solving problems, and increasing work output.</p>",
  "description_provenance": [
    "Author Email: baderku@vt.edu",
    "Advisor Email: laporte@vt.edu",
    "Advisor Email: samil@vt.edu",
    "Advisor Email: minishr@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: graham@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:07Z (GMT). No. of bitstreams: 6 CHAPTERS.PDF: 800758 bytes, checksum: 50cd07354db9a788a9c4a23e38e4736a (MD5) VITA.PDF: 11583 bytes, checksum: fd535aed18edd45cd45213a3abdd5743 (MD5) REF..PDF: 47307 bytes, checksum: c7e1516537ea1282c094f86e14f42e84 (MD5) APPENDICES.PDF: 727074 bytes, checksum: eedc0fe99eedc21ca82c902efb808f23 (MD5) ALI.PDF: 404924 bytes, checksum: 98ea71bed546f0b9ce3e24ad5e5ec7ad (MD5) ALIAB.PDF: 29203 bytes, checksum: 79b26963e9e32fc6a999197245ab8522 (MD5)   Previous issue date: 1999-04-20"
  ],
  "handle": "27389",
  "identifier_other": "etd-042799-132803",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042799-132803/",
  "identifier_uri": "http://hdl.handle.net/10919/27389",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAPTERS.PDF",
    "VITA.PDF",
    "REF..PDF",
    "APPENDICES.PDF",
    "ALI.PDF",
    "ALIAB.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "E-mail",
    "Computer",
    "CEM",
    "Kuwait",
    "Internet",
    "ESL"
  ],
  "title": "THE INFLUENCE OF COMPUTER ELECTRONIC MAIL (CEM) ON THE PERFORMANCE AND COMPETENCE OF MIDDLE LEVEL ENGLISH AS A SECOND LANGUAGE (ESL) STUDENTS IN THE STATE OF KUWAIT",
  "type": "Dissertation"
}