{
  "contributor_author": "LaBoone, Emet L",
  "contributor_committeechair": "Doolittle, Peter E.",
  "contributor_committeemember": [
    "Burton, John K.",
    "Smith-Jackson, Tonya L.",
    "Whitt, Gary L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:06Z",
  "date_adate": "2006-05-09",
  "date_available": "2014-03-14T20:11:06Z",
  "date_issued": "2006-04-26",
  "date_rdate": "2006-05-09",
  "date_sdate": "2006-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The purpose of this study was to examine the effect of encoding specificity on learning in a multimedia environment. Based upon the theory of encoding specificity there should be a relationship between the modality for which a learner encodes information into memory and the modality used to assess the learnerâ  s knowledge. Modality attributes for purposes of this study included visual (animation) and verbal information (narration and text). </p>  <p>Two-hundred and fifteen students viewed a computer animation on lighting formation which was presented in one of three different modalities (animation with narration, animation with text, text only). Following the instruction students were assessed in one of three modalities (animation with narration, animation with text, text only) on recall and transfer. A 3 Encoding/Study x 3 Retrieval/Test (animation with narration, animation with text, text only) full-factorial post-test only design was used to assess the effects of matched and mismatched encoding and retrieval modalities in a multimedia environment. </p>  <p>Encoding specificity suggests that there is an interaction between the conditions at encoding and retrieval such to say that the to-be-remembered item will not be as effective during retrieval unless the cue was specifically encoded at time of storage. Unfortunately, the present study did not find much to support the claim of encoding specificity based upon modality. The use of modality in both encoding and retrieval condition to support encoding specificity was found only in the AT-AT matched recall group versus the mismatched groups. Furthermore, significance was not found in any of the matched mismatched transfer conditions. </p>",
  "description_provenance": [
    "Author Email: elaboone@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: smithjac@vt.edu",
    "Advisor Email: whitt@roanoke.edu",
    "Made available in DSpace on 2014-03-14T20:11:06Z (GMT). No. of bitstreams: 1 elaboonefinaletd.pdf: 1892751 bytes, checksum: 9455fa091b7651147555968763234029 (MD5)   Previous issue date: 2006-04-26"
  ],
  "handle": "27381",
  "identifier_other": "etd-04272006-153110",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04272006-153110/",
  "identifier_uri": "http://hdl.handle.net/10919/27381",
  "publisher": "Virginia Tech",
  "relation_haspart": "elaboonefinaletd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cognitive multimedia learning",
    "context dependent learning",
    "encoding specificity",
    "multimedia learning"
  ],
  "title": "The Effect of Encoding Specificity on Learning in a Multimedia Environment",
  "type": "Dissertation"
}