{
  "contributor_author": "Dunson, Debra Lynn",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Covington, Edward R.",
    "Gibson, Harry W.",
    "Dillard, John G.",
    "Riffle, Judy S.",
    "Shultz, Allan R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:11:08Z",
  "date_adate": "2000-05-02",
  "date_available": "2014-03-14T20:11:08Z",
  "date_issued": "2000-04-21",
  "date_rdate": "2001-05-03",
  "date_sdate": "2000-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A series of reactive phenylethynyl endcapped imide oligomers has been prepared in either fully cyclized or amic acid precursor form.  Soluble oligomers have been synthesized with controlled molecular weights ranging from 2- to 12 Kg/mol.  Molecular weight characterization was performed using SEC (size exclusion chromatography) and 13C-NMR, revealing good agreement between the theoretical and experimental (Mn) values.  Crosslinked polyimides were obtained by solution or melt processing the oligomers into films and gradually heating in a programmed temperature manner up to the appropriate reaction temperature for the phenylethynyl groups, which is approximately 350-400°C.  Thermal analysis of the resulting films showed high glass transition temperatures (>300°C) and excellent thermal stability, comparable to those found for thermoplastic control polyimides.  The crosslinked films also had exceptional solvent resistance as evidenced by a high gel fraction (greater than or equal to 95%) following extraction in common solvents for several days.  This was in contrast to the amorphous thermoplastic controls, which quickly dissolved upon immersion in solvents. \tThe monomers used for synthesizing the polyimide oligomers were varied systematically within the series to study the influence of both molecular structure and molecular weight on the physical and film-forming properties.  The incorporation of fluorinated monomers, such as 4,4'-(hexafluoroisopropylidene)diphthalic anhydride (6FDA), reduced water absorption and lowered the dielectric constant relative to non-fluorinated polyimides in the series.  When flexible ether linkages were incorporated in the repeat unit by using 4,4'-oxydianiline (ODA), relatively more ductile solvent-cast films were obtained from oligomers having Mn values as low as 10 Kg/mol.  Additionally, oligomer Mn and the relative rigidity/symmetry of the repeat unit structure greatly influenced the solubility of polyimides in NMP.  For example, even 6FDA/p-phenylenediamine based oligomers with Mn values targeted below 10 Kg/mol precipitated from NMP at 180°C during solution imidization. \tThe relationship between solution viscosities of polyimide and poly(amic acid) thermosetting oligomers and wetting/spreading ability to form continuous films during spin casting was elucidated.  Employing o-dimethoxybenzene (DMB) as a cosolvent with NMP improved the film-forming ability of the fully imidized 6FDA/ODA oligomer series.  This was evidenced by a decrease in viscosity (via suppression of physical-type gel formation) and better overall coverage and clarity of the films.  Humidity was found to have a detrimental effect, causing the polyimide oligomers to phase separate to form cloudy or porous films.  When moisture was reduced, oligomers having Mn greater than or equal to 6 Kg/mol formed spin cast films of <20 micrometer thickness with good qualitative adhesion to several inorganic substrates. \tDielectric constants (epsilon) were estimated for several of the polyimides by measuring the refractive indices (n) of the films and using Maxwell's relationship (epsilon at optical frequencies is equal to n raised to the second power).  The apparent dielectric constants were low, ranging from 2.47 to 2.75. \tThe novel combination of low dielectric constant, solvent resistance and isotropic physical properties inherent in the thermosetting polyimide oligomers makes these materials excellent candidates for use as thin film insulating layers in microelectronics packaging applications.",
  "description_provenance": [
    "Author Email: debidsn@aol.com",
    "Advisor Email: hgibson@chemserver.chem.vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: JUDYRIFFLE@aol.com",
    "Advisor Email: ashultz@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:08Z (GMT). No. of bitstreams: 1 debidunson2.pdf: 1169391 bytes, checksum: dbd78a9d72c692b1383de7d466847aed (MD5)   Previous issue date: 2000-04-21"
  ],
  "handle": "27394",
  "identifier_other": "etd-04282000-15260034",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282000-15260034/",
  "identifier_uri": "http://hdl.handle.net/10919/27394",
  "publisher": "Virginia Tech",
  "relation_haspart": "debidunson2.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "thermosetting oligomers",
    "dielectric films",
    "fluorinated polyimides",
    "phenylethynyl endcapped polyimides",
    "crosslinking",
    "polyimides"
  ],
  "title": "Synthesis and Characterization of Thermosetting Polyimide Oligomers for Microelectronics Packaging",
  "type": "Dissertation"
}