{
  "contributor_author": "Jawhar, Salwa Baker",
  "contributor_committeechair": "Lalik, Rosary V.",
  "contributor_committeemember": [
    "Barber, Elizabeth A.",
    "Singh, Kusum",
    "Stremmel, Andrew J.",
    "Magliaro, Susan G."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:08Z",
  "date_adate": "2000-05-01",
  "date_available": "2014-03-14T20:11:08Z",
  "date_issued": "2000-04-17",
  "date_rdate": "2001-05-01",
  "date_sdate": "2000-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "My goal in undertaking this research was to contribute to strengthening kindergarten educational practices in Kuwait with particular focus on literacy development. I was interested in the instructional techniques, tools, methods, language activities that would make sense to Arabic kindergartners and help them learn the formal, written register (i.e., formal literary Arabic) required in Kuwait. To this end, I used part of my graduate studies in education visiting and observing several kindergarten classes in the United States. During those visits, I noted that storybook reading was given a great deal of attention. Storybook reading is the process by which the teacher shares the content of storybooks with students, while at the same time encouraging social interaction (reading, showing illustrations, and encouraging student participation and conversation). This early exposure to storybook reading appears to support early literacy for American school children. <P> My aim in undertaking this study was to develop an appropriate and effective literacy program for young children in my country. Specifically, I wanted a case of literacy development and storybook reading that might reveal important patterns in teaching early literacy. I planned four research objectives: (1) to document and analyze a Head Start teacher's verbal explanation of literacy teaching and storybook reading; (2) to observe the teacher's practices with respect to literacy teaching and storybook reading; and (3) to examine the extent and nature of students' participation in classroom literacy activities including storybook reading. <P> My method of data collection was ethnographic, incorporating participant observation and verbal exchanges. I used the two methods simultaneously.  Participant observation (including field notes, jot notes, reflective journal, audio-tapes, video-tapes, pictures, and artifacts) gave me richer access to the internal dynamics of the storybook reading event.  Verbal exchanges, including in-depth interviews and informal discussions, enabled me to examine the participants' perceptions of literacy and literacy events.  In-depth interviews enabled me to probe for participants' explanation of any unusual observations. Informal discussion enabled me to probe certain situations that I did not anticipate, ask for explanations of things that just cropped up, and give the teacher and the students opportunities to share with me things they felt I should know. <P> The Head Start teacher explained that literacy spans most other activities and is a part of every day life. According to her, literacy occurs naturally while children are engaged in everyday routines at home, school, or in the community. She added that children learn reading and writing long before formal instruction and that there is a connection between print and the visual symbols that surround it. The use of storybook reading, she said, helps children to develop a positive attitude to books and a global sense of the world. To help children acquire literacy, the teacher provides an appropriate physical environment, including storybook reading, interaction with others, extensive involvement in literacy activities, and a generous display of print. The teacher used a multi-method approach and stimuli before, during, and after reading the story. Storybook reading was used to increase children's access to books, introduce the children to book conventions, integrate literacy and other curricular activities, encourage and empower students to actively participate in their learning, and to encourage cultural appreciation, and intercultural sensitivity. The students played several important roles during storybook reading: listening, conversing, collaborating, making decisions, choosing the books to be read, making seating arrangements, and helping the teacher. The four focal children manifested different reading characteristics including play reading, reading awareness, reading skills, reading development, writing and art, writing play, writing awareness, and writing skills. <P> The findings of this study indicate that storybook reading is not only a source of enjoyment but an important stepping-stone to other language skills and a great stimulus for creativity in young children.  To extend the insights that I have gained from the study   to my country, and as instructor in the Kindergarten Curriculum Instruction Department of the Kuwait Basic College of Education, I plan to model some of the most significant findings of the study in my teaching and teacher training activities. Aspects of the findings that I plan to model are: (a) integrated learning; (b) learner-centered education; (c) collaborative learning; (d) variations in method; and (e) student empowerment. In addition, I plan to implement a follow-up action research enabling my students to develop and implement a more child-centered, and more meaningful instructional practices in Kuwaiti kindergarten classrooms. Another way in which I plan to extend the benefits of this research to my country and other Arab-speaking countries is to publish this study in Arabic.",
  "description_provenance": [
    "Author Email: sjawhar@vt.edu",
    "Advisor Email: ebarber@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: astremme@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: rlalik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:08Z (GMT). No. of bitstreams: 1 JawharETD.pdf: 2796649 bytes, checksum: db9e8197b57eac7de727b59c5b56cb12 (MD5)   Previous issue date: 2000-04-17"
  ],
  "handle": "27392",
  "identifier_other": "etd-04282000-12330059",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282000-12330059/",
  "identifier_uri": "http://hdl.handle.net/10919/27392",
  "publisher": "Virginia Tech",
  "relation_haspart": "JawharETD.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Classroom instruction",
    "Literacy learning",
    "Emergent literacy",
    "Storybook reading",
    "Head Start Program"
  ],
  "title": "Emergent Literacy Development Through Storybook Reading: One Head Start Teacher's Explanations and Practices",
  "type": "Dissertation"
}