{
  "contributor_author": "Lee, Soo  Bum",
  "contributor_committeechair": "Khan, Mahmood A.",
  "contributor_committeemember": [
    "Weaver, Pamela A.",
    "Murrmann, Suzanne K.",
    "Harvey, Robert J.",
    "Huo, Yang-Hwae"
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:11:08Z",
  "date_adate": "1999-04-28",
  "date_available": "2014-03-14T20:11:08Z",
  "date_issued": "1999-04-23",
  "date_rdate": "2000-04-28",
  "date_sdate": "1999-04-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The growth of franchising has been an important trend in the hospitality industry, since it was introduced into the restaurant sector by Howard Johnsons in the 1930s. In recent years, because of intense competition quick service restaurants have experienced significant external and internal pressures. Such pressures have caused disputes and abuses of the system and have affected external suppliers, customers, and suppliers, as well as franchisees within the franchise system. Because the franchisor-franchisee relationship has yet to be fully explored, knowledge of the factors that produce a high-quality relationship between franchisor and franchisee are critical to the advancement of knowledge in the hospitality industry. Leader-Member Exchange (LMX) theory is offered of an effective theoretical model of antecedents that can predict the effectiveness the franchisor-franchisee relationship. This study presents a model based on a subset of the Leader-Member Exchange theory. Using the survey responses of franchisees in the restaurant industry, this study identifies the key factor that affect the franchisee's commitment, the franchisee's satisfaction with purchasing or operating franchise outlets, the effects of the franchisor's brand name on the quality of the relationship, the franchisee's perception of the franchisor's support, the franchisee's motivation to become a franchisee, and the franchisee's performance. The results of this study generally support the hypothesized model and provide strong support for the idea that the quality of the relationship between franchisee and franchisor plays a role in ensuring that the contractual relationship will lead to franchisee job satisfaction and financial success for both. The proposed model provides franchisors with valuable information for establishing an effective management strategy to improve the relationship between franchisor and franchisee and thus improve the rate of success of both franchisor and franchisee. Similarly, the model can assist both the franchisor and franchisee in understanding their policies in strategic terms and in integrating their different activities to provide the firm with the quality relationship required for maintaining advantage.",
  "description_provenance": [
    "Author Email: solee2@vt.edu",
    "Advisor Email: mahmood@vt.edu",
    "Advisor Email: weaver@vt.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: harveyrj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:08Z (GMT). No. of bitstreams: 6 title.pdf: 21301 bytes, checksum: 28364e13af8c6d9f4de147f2c48de328 (MD5) VITA.PDF: 6801 bytes, checksum: 24162a4a4b5c284ca1ac691d8b1199b8 (MD5) APPENDIXB.PDF: 108756 bytes, checksum: 25343bf9834ed526b85d4699e62be001 (MD5) APPENDIXA.PDF: 742212 bytes, checksum: 8d09c23cd21b874e41fca17e76384ec4 (MD5) APPENDIXC.PDF: 21938 bytes, checksum: bebef3cf5ceca4b9d28c7ed0da1d4c89 (MD5) dissertation.pdf: 595884 bytes, checksum: 4b6fc237877f24c975a59aac44cea25e (MD5)   Previous issue date: 1999-04-23"
  ],
  "handle": "27390",
  "identifier_other": "etd-042799-135429",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042799-135429/",
  "identifier_uri": "http://hdl.handle.net/10919/27390",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "title.pdf",
    "VITA.PDF",
    "APPENDIXB.PDF",
    "APPENDIXA.PDF",
    "APPENDIXC.PDF",
    "dissertation.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Franchising",
    "Foodservice Industry",
    "Structural Equations Modeling",
    "Quality Relationship",
    "Franchisee",
    "Franchisor"
  ],
  "title": "An Investigation of Factors Affecting the Quality of the Relationship between Franchisee and Franchisor and its Impact on Franchisee's Performance, Satisfaction, and Commitment: A Study of the Restaurant Franchise System",
  "type": "Dissertation"
}