{
  "contributor_author": "Tengjaroenkul, Bundit",
  "contributor_committeechair": "Smith, Bonnie J.",
  "contributor_committeemember": [
    "Smith, Stephen A.",
    "Hallerman, Eric M.",
    "Pfeiffer, Carl J.",
    "Caceci, Thomas"
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:11:08Z",
  "date_adate": "2000-05-02",
  "date_available": "2014-03-14T20:11:08Z",
  "date_issued": "2000-04-26",
  "date_rdate": "2001-05-02",
  "date_sdate": "2000-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The gross intestinal configuration of the Nile tilapia intestine changed dramatically from a short, straight intestinal tube at hatch (day 0) to a very complex, coiling pattern first attained at 9 weeks post-hatch. During the developmental period, gut length increased from 90% to 410% of body length. The rate of increase in both intestinal and body lengths took place at an accelerating rate as the fish aged. The great intestinal length provides an advantage to the fish in digestion and absorption of nutrients present in the less energy-efficient herbivorous diet. Formulation of commercial diets to match the development of the fish's intestine may offer commercial advantage.  <p> Appearance, localization and distribution of intestinal enzymes were observed in the fish at hatch and at mature stages using enzyme histochemistry. At hatch (day 0), most gut enzymes were already present in the intestinal brush border. As the fish matured, activities of the enzymes were widely distributed along the intestinal tract. The early appearance and broad distribution of activities of all studied intestinal enzymes may be one factor contributing to the rapid growth rate characteristic of tilapia, which differs markedly from other fish species.  <p> To investigate the possibility of using alfalfa as a potential protein food replacement in tilapia, the effects of different levels of alfalfa in feeds on growth and intestinal enzyme   activities were observed in the fish aged 3-15 weeks. Results demonstrated that replacing 20% and 40% of a commercial diet with alfalfa had an overall negative effect on body and intestinal growth, as well as the intestinal enzyme activities from age 3-9 weeks. Thus, using alfalfa as a food replacement is not optimal for fish of these young ages, but may yet be suitable for older fish.",
  "description_provenance": [
    "Author Email: btengjar@vt.edu",
    "Advisor Email: bjsmith@vt.edu",
    "Advisor Email: stsmith7@vt.edu",
    "Advisor Email: elitist@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:08Z (GMT). No. of bitstreams: 1 etd.pdf: 734280 bytes, checksum: 9c0c23154aca907d1ae3e24bee3dc87c (MD5)   Previous issue date: 2000-04-26"
  ],
  "handle": "27391",
  "identifier_other": "etd-04282000-10030006",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282000-10030006/",
  "identifier_uri": "http://hdl.handle.net/10919/27391",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Tilapia",
    "Morphology",
    "Intestine",
    "Enzyme",
    "Fish",
    "Ontogeny"
  ],
  "title": "Ontogenic Morphology and Enzyme Activities of the  Intestinal Tract of the Nile Tilapia, Oreochromis Niloticus",
  "type": "Dissertation"
}