{
  "contributor_author": "Boyd, Sr., Frederick Douglas",
  "contributor_committeecochair": [
    "Parks, David J.",
    "Parson, Stephen R."
  ],
  "contributor_committeemember": [
    "Richards, Robert R.",
    "Smith, Beth C.",
    "Dawson, Christina M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:08Z",
  "date_adate": "2000-04-30",
  "date_available": "2014-03-14T20:11:08Z",
  "date_issued": "2000-04-18",
  "date_rdate": "2001-04-30",
  "date_sdate": "2000-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Students in school districts throughout the United States are administered standardized tests in an effort to assess achievement. These annual \"academic rites of passage\" serve as measures of accountability to the citizenry of every locality served.  Many at-risk African-American males score in the lower two quartiles on these tests. Remediation efforts have not significantly raised the achievement of these students. However, there are teachers who are effective with these students. They use both verbal and non-verbal behaviors that facilitate learning. This study was designed to answer the question: What non-verbal behaviors are used by effective teachers of at-risk African-American male middle school students?   Data were collected via teacher observations using the Non-verbal Behavior Teacher Observation Form, an instrument developed to record nonverbal behaviors of teachers. The instrument consists of thirteen behaviors that cover seven non-verbal domains.  Four teachers were observed three times each for thirty minutes and two teachers were observed one time. The researcher selected a different at-risk male student each observation resulting in a total of fourteen teacher observations and their interactions with fourteen at-risk male students.   Descriptive statistics were used to identify most frequently and least frequently used non-verbal behaviors. When effective teachers in this study interacted with the at-risk African-American male middle school students, they frequently were in close proximity, changed their voice inflections, established eye contact, invaded students' territories (were within two feet), and gestured to students.  The results of this study may be used as a vehicle or catalyst for the implementation of a school or district-wide training program for teachers of at-risk African-American male students. These results may also be used for teacher preparation programs at the college or university level.",
  "description_provenance": [
    "Author Email: FDBoyd@aol.com",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: rrr7777@whro.net",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: bsmith@sbo.hampton.k12.va.us",
    "Advisor Email: tdawson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:08Z (GMT). No. of bitstreams: 1 dissertation.pdf: 383652 bytes, checksum: c21c458aefb23d42e04a4acc07470e08 (MD5)   Previous issue date: 2000-04-18"
  ],
  "handle": "27396",
  "identifier_other": "etd-04282000-16200048",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282000-16200048/",
  "identifier_uri": "http://hdl.handle.net/10919/27396",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Non-verbal behavior",
    "and Middle Schools",
    "At-risk African-American males"
  ],
  "title": "Non-Verbal Behaviors of Effective Teachers of At-Risk African-American Male Middle School Students",
  "type": "Dissertation"
}