{
  "contributor_author": "Bolt, Melanie A.",
  "contributor_committeechair": "Singh, Kusum",
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Garrison, James W.",
    "Fortune, Jimmie C.",
    "Cross, Lawrence H."
  ],
  "contributor_department": "Educational Research and Evaluation",
  "date_accessioned": "2014-03-14T20:11:08Z",
  "date_adate": "2003-05-01",
  "date_available": "2014-03-14T20:11:08Z",
  "date_issued": "2003-04-16",
  "date_rdate": "2005-09-14",
  "date_sdate": "2003-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study discussed the need for a broader public discourse on high-stakes accountability-based school reform that underscores teachersâ   perspectives. Also, the study discussed the need for fuller disclosure of the possible undesirable classroom effects of the reform. To address these needs, the study described teachersâ   perspectives on the Standards of Learning (SOL) school reform in Virginia, focusing upon teachersâ   views on the reformâ  s classroom effects. The domains of interest were (1) the adequacy of curriculum and the diversity of teachersâ   instructional strategies, (2) the quality of student learning, (3) teachersâ   sense of professional autonomy and level of teacher tension, and (4) school quality. The study examined whether there are differences in teachersâ   views based the income level of the school locale where teachers teach (low-, middle-, or high-income), the school type (elementary, middle, or high school) in which they teach, and teachersâ   status on whether they teach a SOL-tested subject (yes/no).  The participants of the study included 360 randomly selected teachers who were listed as members of Virginia Education Association (VEA). A survey research design was employed. The instrument included 80 Likert-type items, eight demographic items, and three open-ended questions. Inferential and descriptive statistics were reported for eight scales of the survey as were thematic trends in the qualitative data. The studyâ  s results suggested that the SOL program contributes to a hurried, high-pressure classroom culture that depletes the potentiality of the very ends of education the program is intended to achieve.  Teachers tended to report (1) an inadequacy of the SOL content standards, (2) a reduction of teachersâ   use of diverse instructional strategies and an inability of the SOL program to meet diverse student needs, (3) arbitrary SOL test cut-scores, (4) an inadequacy of the SOL pass rates to represent school quality, (5) a lack of diagnostic usefulness of SOL test scores, (6) an inadequacy of SOL testing and SOL test scores to hold schools accountable, (7) teachersâ   sense of diminished professional autonomy, and (8) teachersâ   mounting tension in the classroom. These results were juxtaposed to the views of policymakers and business leaders, the public at large, parents, and scholars in the field of education concerning the issue of high-stakes accountability-based school reform. Finally, the study discussed a conflict related to the purpose of public schooling between a prevailing narrative of many policymakers and business leaders and what have been the marginalized views of classroom teachers.",
  "description_provenance": [
    "Author Email: mbolt@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: wesley@vt.edu",
    "Advisor Email: fort6278@bellsouth.net",
    "Advisor Email: LawrenceCross@msn.com",
    "Made available in DSpace on 2014-03-14T20:11:08Z (GMT). No. of bitstreams: 1 etd.ps.pdf: 583580 bytes, checksum: 9aee2429cfa20b2843911a925e824a41 (MD5)   Previous issue date: 2003-04-16"
  ],
  "handle": "27398",
  "identifier_other": "etd-04282003-153343",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282003-153343/",
  "identifier_uri": "http://hdl.handle.net/10919/27398",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.ps.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "classroom effects",
    "teacher professional autonomy",
    "standards",
    "school quality",
    "instructional strategies",
    "testing",
    "student learning",
    "teacher tension",
    "high-stakes accountability",
    "curricula"
  ],
  "title": "Teachers'' Perspectives on the Standards of Learning School Reform in Virginia",
  "type": "Dissertation"
}