{
  "contributor_author": "Martin, Margaret Hill",
  "contributor_committeechair": "Heath-Camp, Betty A.",
  "contributor_committeecochair": "O'Reilly, Patrick A.",
  "contributor_committeemember": [
    "Sanders, Mark E.",
    "Basualdo, Eugenio",
    "Stewart, Daisy L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:09Z",
  "date_adate": "2003-05-14",
  "date_available": "2014-03-14T20:11:09Z",
  "date_issued": "2003-03-24",
  "date_rdate": "2003-05-14",
  "date_sdate": "2003-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This study sought to identify factors that influence the adoption of Web-based courses by State University of New York faculty members engaged in professional development and preparation of teachers. The central question of this research study was: What factors and concerns affect State University of New York teacher education faculty members' decisions regarding development and implementation of Web-based courses?  The study addressed issues raised during earlier research efforts on the objections, problems, or barriers to the use of distance learning during the academic preparation of teachers. Earlier studies revealed technical barriers surrounding the perceived reliability or unreliability of hardware components or software available to instructors. Non-technical problems centered on professional objections to online courses. Job security, intellectual property rights, course control, and the constant requirement to learn or maintain new skills were listed as concerns by faculty. Implementation of Web-based courses also required a training period for faculty.   Teacher education programs found within the State University of New York were selected as the focus of this study due to the availability of a structured resource for faculty seeking to develop and present online courses to their students.  State University of New York faculty respondents in these programs were experienced educators who viewed Web-based teaching within the context of pre-service teacher preparation as important or very important but were concerned about \"quality\" issues such as student discussion or interaction, the suitability of course content, and concerns that more time is needed to prepare online courses without any corresponding support or policy guidance from institutional administration.  Few courses were offered to pre-service teachers in the setting that was studied. Many respondents viewed the use of Web-mediated instruction as inconsistent with the requirements of pre-service classroom observation or other efforts to develop teaching skills. Several respondents reported that they had no online teaching experience but indicated some exposure to online teaching resources. This would suggest that hybrid courses (a mix of classroom contact supported by Web-based classes) should be explored.",
  "description_provenance": [
    "Author Email: mmartin4@oswego.edu",
    "Advisor Email: msanders@vt.edu",
    "Advisor Email: oreilly@vt.edu",
    "Advisor Email: heathb@vt.edu",
    "Advisor Email: basualdo@oswego.edu",
    "Advisor Email: daisys@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:09Z (GMT). No. of bitstreams: 1 MartinDiss2.pdf: 2305042 bytes, checksum: 141304b504f1d353db7239c92ec312f6 (MD5)   Previous issue date: 2003-03-24"
  ],
  "handle": "27399",
  "identifier_other": "etd-04282003-161823",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282003-161823/",
  "identifier_uri": "http://hdl.handle.net/10919/27399",
  "publisher": "Virginia Tech",
  "relation_haspart": "MartinDiss2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Web-based learning",
    "asynchronous learning",
    "teacher education",
    "distance education",
    "Online learning"
  ],
  "title": "Factors Influencing Faculty Adoption of Web-based Courses in Teacher Education Programs Within the State University of New York",
  "type": "Dissertation"
}