{
  "contributor_author": "Eberhardt, Darlene Michele",
  "contributor_committeecochair": [
    "Kincade, Doris H.",
    "Chen-Yu, Jessie H."
  ],
  "contributor_committeemember": [
    "Harrison, William L.",
    "Giddings, Valerie L.",
    "Hauser, Peter J.",
    "Gandour, Richard D."
  ],
  "contributor_department": "Apparel, Housing, and Resource Management",
  "date_accessioned": "2014-03-14T20:11:09Z",
  "date_adate": "2004-05-03",
  "date_available": "2014-03-14T20:11:09Z",
  "date_issued": "2004-04-22",
  "date_rdate": "2006-05-03",
  "date_sdate": "2004-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The safety of healthcare workers (HCW) has become a serious concern; therefore, a need for protection against bacterial penetration and transmission is realized. The purpose of this research is to examine whether antibacterial finishes can effectively reduce the presence of bacteria that have the potential for penetration and transmission on healthcare workers uniforms (HCWU). The specific objective of this research is to compare the antibacterial properties (i.e., bacterial reduction), two descriptive properties (i.e., fabric weight, fabric thickness), and one durability property (i.e., breaking strength loss due to abrasion) of a 65/35% polyester/cotton blend fabric treated with two commercially available antibacterial agents (i.e., 3-trimethoxysilylpropyldimethyloctadecyl ammonium chloride) or AEGIS Microbeshield, (AMS) and polyhexamethylene biguanide (PHMB) or Reputexâ  Â· before laundering and after 5, 10, and 25 laundering cycles. The independent variables were the treatments (i.e., AMS, PHMB, no treatment) and the laundering cycles (i.e., 0, 5, 10, 25). The dependent variables were the four fabric properties: (a) antibacterial properties against Staphylococcus aureus (S. aureus) and Klebsiella pneumoniae (K. pneumoniae) bacteria, (b) fabric weight, (c) fabric thickness, and (d) breaking strength loss due to abrasion. Multiple Analysis of Variance (MANOVA) and Two-way Analysis of Variance (ANOVA) were used to examine the effects of the independent variables and their interaction on each dependent variable.  \tThe results showed PHMB treated specimens had a significantly higher log reduction against both S. aureus and K. pneumoniae before laundering and after 5, 10 and 25 laundering cycles than AMS treated specimens and the no treatment specimens. Initially, AMS had some reduction against S. aureus and K. pneumoniae before laundering; however after laundering, the reductions against both bacteria were diminished greatly. As expected, the no treatment specimen had no reduction against S. aureus or K. pneumoniae before and after laundering. The addition of PHMB and AMS increased the fabric weight of 65/35% polyester/cotton fabric and kept the fabric thickness throughout 25 laundering cycles. The untreated specimens became thicker after 25 laundering cycles. In addition, the breaking strength loss due to abrasion indicated that treatments had no effect on fabric strength. In conclusion, adding antibacterial agents do have some influence on bacterial reduction for both Gram-positive and Gram-negative bacteria as well as descriptive properties (i.e., fabric weight, fabric thickness). However, there was no influence on durability property (i.e., breaking strength loss due to abrasion). More studies are needed to test both agents on other types of fabrics such 100% cotton and nonwoven to incorporate more treated HCWU in the marketplace.",
  "description_provenance": [
    "Author Email: deberhar@vt.edu",
    "Advisor Email: wiharri3@vt.edu",
    "Advisor Email: kincade@vt.edu",
    "Advisor Email: chenyu@vt.edu",
    "Advisor Email: vgidding@vt.edu",
    "Advisor Email: peter_hauser@ncsu.edu",
    "Advisor Email: gandour@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:09Z (GMT). No. of bitstreams: 4 03DME_DissertationVita04.pdf: 56542 bytes, checksum: 07076cffed35d4d79754b32591f695c6 (MD5) 01DME_ATitlePage.pdf: 45209 bytes, checksum: 6a36dc8353c07d1f89bf9a02d008a6f9 (MD5) 02DME_DissertationBody04.pdf: 748412 bytes, checksum: 38d6043fab47e78140ed595dfd346ba4 (MD5) 01DME_Dissertationfinal04.pdf: 126111 bytes, checksum: b0273a2ae162927ff0458f0baccb8d4c (MD5)   Previous issue date: 2004-04-22"
  ],
  "handle": "27403",
  "identifier_other": "etd-04282004-143926",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282004-143926/",
  "identifier_uri": "http://hdl.handle.net/10919/27403",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "03DME_DissertationVita04.pdf",
    "01DME_ATitlePage.pdf",
    "02DME_DissertationBody04.pdf",
    "01DME_Dissertationfinal04.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cotton",
    "fabrics",
    "antibacterial",
    "finish",
    "textile",
    "uniform"
  ],
  "title": "Antibacterial and Laundering Properties of Ams and Phmb as Finishing Agents for Healthcare Workers Uniforms",
  "type": "Dissertation"
}