{
  "contributor_author": "Belling Abler, Rebecca Alicia",
  "contributor_committeechair": "Miller, Orson K. Jr.",
  "contributor_committeemember": [
    "Nilsen, Erik T.",
    "Jones, Robert H.",
    "Eick, Matthew J.",
    "Daniels, Walter Lee"
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:11:09Z",
  "date_adate": "2004-04-29",
  "date_available": "2014-03-14T20:11:09Z",
  "date_issued": "2004-03-31",
  "date_rdate": "2004-04-29",
  "date_sdate": "2004-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Ectomycorrhizal fungi are essential to seedling establishment in disturbed sites.  This dissertation examines the effects of trace metals and soil disturbance on ectomycorrhizal fungi in the laboratory and the field.  The first experiment assessed Cu and Zn impact on growth of three ectomycorrhizal species in pure culture.   Suillus granulatus and Pisolithus tinctorius were more tolerant to Cu than Paxillus involutus, however, none of the species grew at 250 ppm Cu.  Suillus granulatus had the highest Zn tolerance, followed by Paxillus involutus and Pisolithus tinctorius.   Sectoring observed in Suillus granulatus was deemed spontaneous and not involved in metal tolerance.<P>           The second experiment examined the adsorption of copper and zinc to acidic Uchee fine loamy sand.  Contrary to expectations, the soil adsorbed up to 667 ppm Cu and 238 ppm Zn.   Adsorption occurred mainly in the non-crystalline fraction of the soil.   This analysis is a new approach in mycorrhizal research, and the crucial need for such tactics is discussed.<P>         The third experiment surveyed ectomycorrhizae on a mine reclamation project in Wise County, Virginia.  Pinus strobus trees planted 1, 8, 13, and 25 years prior to the experiment were sampled.  Colonization was lower than in well developed soils, but occurred on all seedlings.  Increased colonization and a late stage mycobiont (Tuber) occurred on roots taken from the 25 year old subsite.   A new observation was made of Suillus americanus on one year old seedlings.  Lack of species overlap among sites suggests localized inoculum sources.<P>           The last experiment explored Pinus strobus and Pinus virginiana seedlings naturally regenerating on acidic, bare-mineral soil exposed by a road cut in Floyd County, Virginia.   Ectomycorrhizal colonization ranged between 30 to 80 percent.  Wide variation among individual samples suggests patchy inoculum distribution.  Scleroderma citrinum, a common early-stage fungus, was dominant throughout.  Other early stage genera included Rhizopogon, Pisolithus, and Thelephora.  Mid to late stage genera including Suillus and Lactarius were identified.  Cenococcum, often a dominant taxon, was a minor taxon here.  The unusual presence of the ericoid mycobionts Hymenoscyphus and Oidiodendron is discussed. These results suggest that native inoculum can be an important resource for seedling recruitment.",
  "description_provenance": [
    "Author Email: rebellin@vt.edu",
    "Advisor Email: enilsen@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: eick@vt.edu",
    "Advisor Email: wdaniels@vt.edu",
    "Advisor Email: orsonk@frontiernet.net",
    "Made available in DSpace on 2014-03-14T20:11:09Z (GMT). No. of bitstreams: 1 Ablerdiss.pdf: 1486135 bytes, checksum: 441a9a692aca577124c80d75575c27aa (MD5)   Previous issue date: 2004-03-31"
  ],
  "handle": "27402",
  "identifier_other": "etd-04282004-124014",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282004-124014/",
  "identifier_uri": "http://hdl.handle.net/10919/27402",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ablerdiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "trace metals",
    "fungal diversity",
    "revegetation",
    "soil disturbance",
    "Ectomycorrhizal fungi"
  ],
  "title": "Trace metal effects on ectomycorrhizal growth, diversity, and colonization of host seedlings",
  "type": "Dissertation"
}