{
  "contributor_author": "Whitehurst, Cherie Cutler",
  "contributor_committeechair": "Crockett, Jean B.",
  "contributor_committeemember": [
    "Sughrue, Jennifer A.",
    "Salmon, Richard G.",
    "Asselin, Susan B.",
    "Parson, Stephen R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:10Z",
  "date_adate": "2004-05-03",
  "date_available": "2014-03-14T20:11:10Z",
  "date_issued": "2004-04-12",
  "date_rdate": "2006-05-03",
  "date_sdate": "2004-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The multi-case analysis utilized in this study describes how specially-designed instruction is being used to ensure that secondary students with disabilities have access to the general curriculum and are participating and progressing within it. Bronfenbrennerâ  s (1976) systemic model that presents interacting sub-systems in a series of nested educational environments was used as a guide for exploration. Case study schools included two high schools that serve partially suburban and partially rural communities within one school district. Review of documents, observations, and interviews were used to triangulate the data. Evolving display matrices were used to analyze the data. The matrix displays evolved as authentic categories emerged from within each case and across the two cases, and from within each level and across the four levels of the educational environment. To note differences, the data from two case schools as well as from the four educational environments were compared and contrasted.<p>  The consistent patterns of practice found at all levels of the educational environment included: (a) identifying and implementing accommodations and modifications needed for students with disabilities, (b) initiating special education and regular education collaboration activities, (c) monitoring student learning, (d) examining placement, and (e) providing professional development training.<p>  The findings from this study also revealed that the origin of the patterns of practice began at the macro-system level, or at the state department of education. It was found that the state policy context addressing the federal mandate is built on the vision of enabling students with disabilities to access the general curriculum. In addition, it was determined that the strategies to meet this vision are designed around the provision and implementation of state regulations, state professional development training, and state accountability measures. The conclusions suggest that the patterns of practice throughout the total high school environment of District A are initiated through state regulations, state professional development training, and state accountability measures, and support the participation and progress within the general education curriculum of secondary students with disabilities. A pattern of concern related to cluster grouping of inclusion students in secondary classrooms and their opportunities for genuine access to the general curriculum was noted.",
  "description_provenance": [
    "Author Email: cwhitehurst7@aol.com",
    "Advisor Email: jsugh@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: sasselin@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:10Z (GMT). No. of bitstreams: 1 attgc.pdf: 1073615 bytes, checksum: 9153344c9c9394564819e149d137afb9 (MD5)   Previous issue date: 2004-04-12"
  ],
  "handle": "27408",
  "identifier_other": "etd-04282004-233914",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282004-233914/",
  "identifier_uri": "http://hdl.handle.net/10919/27408",
  "publisher": "Virginia Tech",
  "relation_haspart": "attgc.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Inclusion",
    "Secondary Students with Disabilities",
    "Access to the General Curriculum"
  ],
  "title": "A Case Study of the Patterns of Practice Used to Provide Access to the General Curriculum for Secondary Students with Disabilities",
  "type": "Dissertation"
}