{
  "contributor_author": "Rogers, Sharon Dale",
  "contributor_committeecochair": [
    "Jarrott, Shannon E.",
    "Blieszner, Rosemary"
  ],
  "contributor_committeemember": [
    "Wojcik, Janet R.",
    "Stevenson, Michelle L.",
    "Mancini, Jay A."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:10Z",
  "date_adate": "2005-04-29",
  "date_available": "2014-03-14T20:11:10Z",
  "date_issued": "2005-04-25",
  "date_rdate": "2005-04-29",
  "date_sdate": "2005-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Coupled with normal age-related regression in muscle mass, adults with cognitive impairment are at high risk for exacerbated declines in muscle strength, associated psychological well-being, and overall independence. Working from the environmental press model, a 12-week strength training intervention was designed to both support participantsâ   continuing abilities and meet varied needs. Tailoring the environment helps optimize participation, which is essential if participants are to experience the greatest possible gains from a group-based exercise program.   The intervention was a group-based, progressive strength training program designed specifically for adults with dementia at two dementia care centers. The exercises were performed three times each week and the sessions were led by the centersâ   activities leaders.  Participants used hand-held barbells when performing the upper-body exercises.   Findings indicated that individuals retain the capability to enhance their own quality of life through active participation in a therapeutic intervention. This is illustrated by the consistent effort of exercising participants to perform appropriately during the exercise intervention. Not only were adults able to demonstrate effort to appropriately participate, but the intervention supported high levels of correct performance of the exercise repetitions which is important for achieving physical gains. Exercisers did not experience improvement in physical abilities nor did they significantly differ at posttest from non-exercising participants in measures of physical ability and function or quality of life. The program was deemed to be a feasible intervention for adults with dementia as indicated by both regular participant attendance at the program sessions and high levels of effort to engage appropriately in the exercises.  Due to the lack of opportunities for adults with dementia to participate in stimulating or meaningful activities, and the individualsâ   susceptibility to excess disability, the strength training program is a viable intervention to incorporate into the regular activities programming at dementia care centers. Future research should utilize the progress made by this study to continue exploring the environmental variables that most greatly affect the participation of adults with dementia, as well as outcome measurements that best capture important effects of participation in exercise for these individuals.",
  "description_provenance": [
    "Author Email: srogers@vt.edu",
    "Advisor Email: jwojcik@vt.edu",
    "Advisor Email: mstevens@vt.edu",
    "Advisor Email: mancini@vt.edu",
    "Advisor Email: sjarrott@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:10Z (GMT). No. of bitstreams: 1 SDRsubmission043005.pdf: 716869 bytes, checksum: 14562ec504fdbaf47ac7993798ef2100 (MD5)   Previous issue date: 2005-04-25"
  ],
  "handle": "27409",
  "identifier_other": "etd-04282005-015026",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282005-015026/",
  "identifier_uri": "http://hdl.handle.net/10919/27409",
  "publisher": "Virginia Tech",
  "relation_haspart": "SDRsubmission043005.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Alzheimer's disease",
    "resistance training",
    "engagement",
    "disability",
    "environmental press"
  ],
  "title": "Resistance Training for Adults with Alzheimer's Disease and Related Dementias: Feasibility of Program Implementation, Appropriateness of Participant Engagement, and Effects on Physical Performance and Quality of Life",
  "type": "Dissertation"
}