{
  "contributor_author": "Schaupp, Ludwig Christian",
  "contributor_committeechair": "Belanger, France",
  "contributor_committeemember": [
    "Rees, Loren Paul",
    "Barkhi, Reza",
    "Brown, Robert M.",
    "Fan, Weiguo Patrick"
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:11:11Z",
  "date_adate": "2005-05-04",
  "date_available": "2014-03-14T20:11:11Z",
  "date_issued": "2005-04-27",
  "date_rdate": "2008-05-04",
  "date_sdate": "2005-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As evidenced by the sheer number of websites presently on the Internet and the exorbitant amount of dollars that are spent on maintaining corporate websites determining the successfulness of these websites is of the utmost importance. In building a successful website the design must match the organizationâ  s objectives and these objectives need to be clearly defined. However, the objectives of a website differ depending upon the website type. As a result, from the user perspective, this results in varying ideas of satisfaction as well as success. Thus, from the user perspective determining success across websites is both goal and context specific. This dissertation investigated five variables which were believed to impact website satisfaction: information quality, system quality, perceived effectiveness, social influence, and trust. Theories in information systems success and information technology adoption provided theoretical foundations for this dissertation. The research was conducted by surveying multiple respondents, who were regular users of two different websites, each fitting into a different category within the taxonomy of websites. Structural equation modeling techniques were used to build the models of determinants of satisfaction for each website. The research results indicate that depending upon the type of website being evaluated different determinants of satisfaction were present. Four variables were found to be significant determinants of website satisfaction in the online community website: information quality, perceived effectiveness, social influence, and trust. However, in the information specific search website only three variables were found to significantly predict website satisfaction: information quality, system quality, and perceived effectiveness. Thus, this dissertation has shown that website usersâ   determinants of satisfaction and overall successfulness is dependent upon the context of the website being evaluated and that determinants of satisfaction are goal specific. Several contributions were made by this study. In particular, this research is one of the first to empirically measure determinants of satisfaction, from the user perspective, in varying website contexts.",
  "description_provenance": [
    "Author Email: lschaupp@vt.edu",
    "Advisor Email: belanger@vt.edu",
    "Advisor Email: lrees@vt.edu",
    "Advisor Email: reza@vt.edu",
    "Advisor Email: moren@vt.edu",
    "Advisor Email: wfan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:11Z (GMT). No. of bitstreams: 1 Website_Success.pdf: 763933 bytes, checksum: 8b98ce3145888b8eb148410ab4b15417 (MD5)   Previous issue date: 2005-04-27"
  ],
  "handle": "27418",
  "identifier_other": "etd-04282005-230021",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282005-230021/",
  "identifier_uri": "http://hdl.handle.net/10919/27418",
  "publisher": "Virginia Tech",
  "relation_haspart": "Website_Success.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Website Success",
    "IS Success",
    "Satisfaction"
  ],
  "title": "Website Success:  An Integrated Theoretical Model",
  "type": "Dissertation"
}