{
  "contributor_author": "Elliott, Susan F.",
  "contributor_committeecochair": [
    "Parks, David J.",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_committeemember": [
    "Spillman, Karen C.",
    "Mallory, Walter D.",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:11Z",
  "date_adate": "2005-04-29",
  "date_available": "2014-03-14T20:11:11Z",
  "date_issued": "2005-04-07",
  "date_rdate": "2005-04-29",
  "date_sdate": "2005-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to examine a reading initiative that was implemented with struggling 9<sup>th</sup> grade regular education students at a high school in northern Virginia. Pre and post tests of the Stanford Diagnostic Reading Test (SDRT), 4<sup>th</sup> Edition, were used to measure the reading performance of students enrolled in a reading intervention class compared to those in a control group. Attendance and discipline data were also collected and compared. Discussions with students enrolled in the reading class and representative artifacts (student work in portfolios, field notes from classroom observations and interview transcriptions) provided contextual elements to the study.  The quantitative results of the study were mixed. There was no statistically significant difference between students enrolled in the reading intervention class compared to those in the control group on academic performance, attendance, or behavior. Participants in the reading class scored higher on scanning (F (1, 29) = 11.21, p = .00) and vocabulary (F  (1, 29) = 5.96, p = .02) than those in the control group.Qualitative results indicated that students enrolled in the reading class who learned comprehension, scanning, and vocabulary strategies did not uniformly apply them during reading in core content areas (English, mathematics, science and social studies).",
  "description_provenance": [
    "Author Email: selliott@vt.edu",
    "Advisor Email: kcspill@pwcs.edu",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:11Z (GMT). No. of bitstreams: 1 SElliottetd.pdf: 1279296 bytes, checksum: dc2b5afd1dbec4b504adcb67e7b21202 (MD5)   Previous issue date: 2005-04-07"
  ],
  "handle": "27417",
  "identifier_other": "etd-04282005-185200",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282005-185200/",
  "identifier_uri": "http://hdl.handle.net/10919/27417",
  "publisher": "Virginia Tech",
  "relation_haspart": "SElliottetd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Struggling reader",
    "high school",
    "reading intervention"
  ],
  "title": "The Effects of a Reading Intervention Class on Regular Education  High School Students Who Struggle with Learning",
  "type": "Dissertation"
}