{
  "contributor_author": "Han, Jiho Y.",
  "contributor_committeechair": "Weaver, Pamela A.",
  "contributor_committeemember": [
    "Clemenz, Candice E.",
    "McCleary, Ken W.",
    "Littlefield, James E.",
    "Murrmann, Suzanne K."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:11:10Z",
  "date_adate": "2005-04-28",
  "date_available": "2014-03-14T20:11:10Z",
  "date_issued": "2005-04-22",
  "date_rdate": "2005-04-28",
  "date_sdate": "2005-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In the last five years, the world has experienced unexpected tragic events and natural disasters. However, international tourism is expected to grow continually and tourists are therefore becoming more concerned with safety and security during their international travel.   This dissertation investigated individualsâ   risk perception of vacationing at two scenario international destinations, Australia and Japan. While ten dimensions of perceived risk in international leisure travel were identified in the literature and one additional dimension of â  Communication Riskâ   was proposed for this study, only seven dimensions were found in this study: â  Health Risk,â   â  Value Risk,â   â  Psychological Risk,â   â  Social Risk,â   â  Terrorism Risk,â   â  Equipment Risk,â   and â  Communication Risk.â   The other four dimensions â   â  Financial Risk,â   â  Time Risk,â   â  Satisfaction Risk,â   and â  Political Instability Riskâ   â   were either merged into other dimensions or did not appear as an independent dimension in this study. The â  Communication Riskâ   which was proposed in this study was found to be a valid dimension of perceived risk in vacationing at international destinations.  The relationships of perceived risk to other factors were also examined. Individualsâ   characteristics of novelty seeking were negatively related to their risk perception, as were individualsâ   proficiency of the destinationâ  s native language. Those who have experience visiting the destination tended to perceive less risk in vacationing at the destination; the more familiarity/expertise with the destination, the less risk was perceived. When an individual perceived a higher level of risk towards a destination, s/he was less likely to vacation at the destination.  Individuals were more likely to choose a packaged tour than independent travel when they had a higher level of risk perception towards vacationing at a particular international destination.",
  "description_provenance": [
    "Author Email: jihan1@vt.edu",
    "Advisor Email: cclemenz@uwf.edu",
    "Advisor Email: mccleary@vt.edu",
    "Advisor Email: weaver@vt.edu",
    "Advisor Email: jalittle@vt.edu",
    "Advisor Email: smurrm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:10Z (GMT). No. of bitstreams: 1 jyhan2005.pdf: 2559803 bytes, checksum: 9e33f0e3459744f5a2c4595e041195d6 (MD5)   Previous issue date: 2005-04-22"
  ],
  "handle": "27410",
  "identifier_other": "etd-04282005-063252",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282005-063252/",
  "identifier_uri": "http://hdl.handle.net/10919/27410",
  "publisher": "Virginia Tech",
  "relation_haspart": "jyhan2005.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "International Leisure Travel",
    "Travel Purchase Decisions",
    "Familiarity/Expertise",
    "Past Experience",
    "Language Ability",
    "Psychographics",
    "Perceived Risk"
  ],
  "title": "The Relationships of Perceived Risk to Personal Factors, Knowledge of Destination, and Travel Purchase Decisions in International Leisure Travel",
  "type": "Dissertation"
}