{
  "contributor_author": "Eagle, Kimberly S",
  "contributor_committeechair": "Dudley, Larkin S.",
  "contributor_committeemember": [
    "Gooden, Susan T.",
    "Svara, James",
    "Wamsley, Gary L.",
    "Wolf, James F."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:11:11Z",
  "date_adate": "2005-05-03",
  "date_available": "2014-03-14T20:11:11Z",
  "date_issued": "2005-04-25",
  "date_rdate": "2005-05-03",
  "date_sdate": "2005-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The practice and study of public administration has long included questions of efficiency, effectiveness, and economy.  In the literature of the last decade, the New Public Management (NPM) movement argues that government should be run like a business and that entrepreneurial-based techniques should be utilized in an effort to enhance government performance.  The normative perspective, however, raises counter ideas. The primary purpose of this research is to examine the impact of managed competition, a NPM technique, on four primary study areas including (1) democratic governance, (2) the politics administration dichotomy, (3) organizational effects, and (4) accountability.  The study findings indicate that the economic model has had a significant impact on the four study areas to varying degrees. The theoretical propositions posed in the study center around principal-agent theory, public choice theory, and the market model and aid in reconciling the NPM perspective with normative considerations applicable to local government practice. Examining managed competition allows us to see how Charlotte has evolved in its attempt to meet demands from both perspectives.",
  "description_provenance": [
    "Author Email: keagle@vt.edu",
    "Advisor Email: stgooden@vcu.edu",
    "Advisor Email: Svara@social.chass.ncsu.edu",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:11Z (GMT). No. of bitstreams: 1 EagleFinal2.pdf: 8560469 bytes, checksum: 6fffb8547b25163f5107c90541284025 (MD5)   Previous issue date: 2005-04-25"
  ],
  "handle": "27412",
  "identifier_other": "etd-04282005-095141",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282005-095141/",
  "identifier_uri": "http://hdl.handle.net/10919/27412",
  "publisher": "Virginia Tech",
  "relation_haspart": "EagleFinal2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Public Management",
    "Charlotte",
    "managed competition",
    "normative theory"
  ],
  "title": "New Public Management in Charlotte, North Carolins: A Case Study of Managed Competition",
  "type": "Dissertation"
}