{
  "contributor_author": "Cohen, Jonathan Barry",
  "contributor_committeechair": "Fraser, James D.",
  "contributor_committeemember": [
    "Berkson, James M.",
    "Kirkpatrick, Roy L.",
    "Haas, Carola A.",
    "Voshell, J. Reese Jr."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:11:11Z",
  "date_adate": "2005-05-03",
  "date_available": "2014-03-14T20:11:11Z",
  "date_issued": "2005-04-19",
  "date_rdate": "2006-05-03",
  "date_sdate": "2005-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Storm-created nesting habitat and low wave energy moist sediment habitat (MOSH), such as intertidal sandflats, have long been considered important to the recovery of the piping plover (Charadrius melodus), a federally threatened shorebird.  Beach renourishment is a common practice on the U.S. Atlantic Coast for the protection of human property from storms, but it also prevents normal MOSH formation. We examined factors limiting piping plover nesting pair density and reproductive output on Atlantic Barrier Islands, 2001-2004, including one site that had been breached by a storm in 1992, and subsequently repaired and renourished by the U.S. Army Corps of Engineers.  We also investigated the short-term impact of beach renourishment at these sites.  Number of pairs at a site increased with beach area.  Pair density increased with MOSH availability at the site level.  Home range size increased as the distance from plover nests to MOSH increased.  Home range size was smaller for plovers with higher foraging rates in the territory-establishment period, but this effect was most likely independent of distance to MOSH.  Reproductive output was not apparently related to availability of MOSH to adults or broods, and was limited by predation.   Habitat widths, prey abundance, and brood habitat selection changed at two of our sites after renourishment.  However, similar changes occurred in reference areas.  Other research shows that in addition to long-term loss of storm-created features, beach stabilization can lead to loss of habitat and low reproductive success due to human development and an increased presence of introduced predators.  Management for recovery of this species should thus include permitting natural storm-mediated habitat creation to occur where feasible.  However, since we found no direct negative short-term impact of renourishment on prey or habitat availability, habitat restoration via renourishment of eroded beaches could be a viable strategy for plover recovery, if negative indirect short and long-term effects are mitigated.  Restoration projects should include restoration or creation of MOSH adjacent to nesting habitat, because MOSH attracts a high density of pairs and to offset long-term loss of storm-created habitat.   Human disturbance and predation must also be controlled at restoration sites.",
  "description_provenance": [
    "Author Email: jocohen1@vt.edu",
    "Advisor Email: jberkson@vt.edu",
    "Advisor Email: fraser@vt.edu",
    "Advisor Email: rlkirk@vt.edu",
    "Advisor Email: cahaas@vt.edu",
    "Advisor Email: jvoshell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:11Z (GMT). No. of bitstreams: 1 JonathanCohenSecondCorrections.pdf: 848603 bytes, checksum: 7cb8587a72930ee801b4f151fd7cda38 (MD5)   Previous issue date: 2005-04-19"
  ],
  "handle": "27414",
  "identifier_other": "etd-04282005-114849",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282005-114849/",
  "identifier_uri": "http://hdl.handle.net/10919/27414",
  "publisher": "Virginia Tech",
  "relation_haspart": "JonathanCohenSecondCorrections.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Population Dynamics",
    "Beach Renourishment",
    "Ornithology"
  ],
  "title": "Factors limiting piping plover nesting pair density and reproductive output on Long Island, New York",
  "type": "Dissertation"
}