{
  "contributor_author": "Rowland, B. Keith",
  "contributor_committeecochair": [
    "Alexander, M. David",
    "Sughrue, Jennifer A."
  ],
  "contributor_committeemember": [
    "Salmon, Richard G.",
    "Driscoll, Lisa G.",
    "Golding, Patricia S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:10Z",
  "date_adate": "2005-04-29",
  "date_available": "2014-03-14T20:11:10Z",
  "date_issued": "2005-04-08",
  "date_rdate": "2005-04-29",
  "date_sdate": "2005-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The primary guiding question proposed for this study is, what are the variations and commonalities in policies among the 132 school districts in the Commonwealth of Virginia that govern whether or not students who are educated at home have access to public school courses and extra-curricular activities? In order to obtain this information the study was conducted of two phases. The first phase consisted of a policy analysis in order to determine the scope and nature of home school policies across Virginiaâ  s 132 operational school districts, and whether they fall within the legal parameters established by state regulations and case law. The second phase involved ascertaining how school officials perceived local control of home schoolersâ   access to public school classes or extracurricular activities through a multiple case study. This phase involved interviewing the person designated to implement these policies from selected school districts. The intent was that the data analysis would provide the basis for recommending changes or perhaps no changes, in the stateâ  s role in governing home school access.",
  "description_provenance": [
    "Author Email: krowland@rcps.org",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: ldriscoll@vt.edu",
    "Advisor Email: tgolding@ccpsd.k12.va.us",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: jsughrue@fau.edu",
    "Made available in DSpace on 2014-03-14T20:11:10Z (GMT). No. of bitstreams: 1 krowlanddissertation.pdf: 1727817 bytes, checksum: bfdcf7c3a65e816aea65ef16cfee2d71 (MD5)   Previous issue date: 2005-04-08"
  ],
  "handle": "27411",
  "identifier_other": "etd-04282005-082915",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282005-082915/",
  "identifier_uri": "http://hdl.handle.net/10919/27411",
  "publisher": "Virginia Tech",
  "relation_haspart": "krowlanddissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Fifth",
    "First",
    "Compulsory Attendance",
    "Equal Access"
  ],
  "title": "Comparing and Contrasting Local School Board Policies That Govern Access to Public School Programs and Activities by Home Schooled Students in Virginia",
  "type": "Dissertation"
}