{
  "contributor_author": "Wallace, Adam Folger",
  "contributor_committeechair": "Dove, Patricia M.",
  "contributor_committeemember": [
    "Gibbs, Gerard V.",
    "Rimstidt, james Donald",
    "Davis, Richey M."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:11:13Z",
  "date_adate": "2008-05-16",
  "date_available": "2014-03-14T20:11:13Z",
  "date_issued": "2008-04-24",
  "date_rdate": "2008-05-16",
  "date_sdate": "2008-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Living systems possess seemingly bottomless complexity. Attempts to parse the details of one cellular process from all other concurrent processes are challenging, if not daunting undertakings. The apparent depth of this problem, as it pertains to biomineralization, is related to the small number of existing studies focused on the development of a mechanism-based understanding of intracellular mineralization processes. Molecular biologists and geneticists have only begun to turn their attention towards identification and characterization of molecules involved in regulating and controlling biomineral formation. With this new knowledge, a number of new and exciting research opportunities are currently awaiting development upon a barren landscape.  Silica biomineralization is one of these emerging frontiers. As new information about the chemical and structural nature of the macromolecules involved in biosilicification is revealed, the means these species employ to control the temporal and spatial onset of silica deposition in vivo become available for exploration. The first chapter of this dissertation outlines those aspects of silicate metabolism that are directly relevant to the controlled biomineralization of silica in eukaryotic organisms and identifies pervasive and unanswered questions surrounding biosilica formation. Particular attention is paid to the diatoms, which are the most abundant, and extensively investigated silica-mineralizing organisms in modern seas. The extent, and mechanism through which specific organic moieties work individually or in concert to direct mineral formation at biological interfaces is a central concern of modern biomineralization research. Chapter two addresses this forefront issue for silica mineralizing systems, and reports the results of an experimental investigation designed to measure the effects of individual surface-bound organic functional groups on the rate of surface-directed silica nucleation. Chapter three discusses an additional aspect of this research aimed at investigating the reactivity of nanoparticulate biogenic silica produced by marine phytoplankton and terrestrial plants in natural environments. Density Functional Theory and ab initio molecular orbital calculations are employed to explore potential mechanisms underlying the catalytic activity of divalent metal cations during the hydrolysis of Si â   O bonded networks.",
  "description_provenance": [
    "Author Email: afw@vt.edu",
    "Advisor Email: gvgibbs@vt.edu",
    "Advisor Email: dove@vt.edu",
    "Advisor Email: jd02@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:13Z (GMT). No. of bitstreams: 2 AFWallace_THESIS.pdf: 107570420 bytes, checksum: 11d1600de20e3fab3c162c47835de1c7 (MD5) Schiffbauer_permission.pdf: 64959 bytes, checksum: 46af678e223fddd44c69fe6303e0bcec (MD5)   Previous issue date: 2008-04-24"
  ],
  "handle": "27424",
  "identifier_other": "etd-04282008-223256",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282008-223256/",
  "identifier_uri": "http://hdl.handle.net/10919/27424",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "AFWallace_THESIS.pdf",
    "Schiffbauer_permission.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "computational chemistry",
    "diatoms",
    "silica",
    "nucleation theory",
    "atomic force microscopy",
    "silicate dissolution",
    "biomineralization"
  ],
  "title": "Biologically Controlled Mineralization and Demineralization of Amorphous Silica",
  "type": "Dissertation"
}