{
  "contributor_author": "Sernek, Milan",
  "contributor_committeecochair": [
    "Kamke, Frederick A.",
    "Glasser, Wolfgang G."
  ],
  "contributor_committeemember": [
    "Frazier, Charles E.",
    "Dillard, John G.",
    "Helm, Richard Frederick"
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:11:14Z",
  "date_adate": "2002-04-30",
  "date_available": "2014-03-14T20:11:14Z",
  "date_issued": "2002-04-24",
  "date_rdate": "2003-04-30",
  "date_sdate": "2002-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A wood surface, which is exposed to a high temperature condition, can experience inactivation. Surface inactivation results in reduced ability of an adhesive to properly wet, flow, penetrate, and cure. Thus, an inactivated wood surface does not bond well with adhesives.   The changes in surface chemistry, wettability, and adhesion of inactivated wood surfaces, including heartwood of yellow-poplar (Liriodendron tulipifera) and southern pine (Pinus taeda), were studied. Wood samples were dried from the green moisture content condition in a convection oven at five different temperature levels ranging from 50 to 200 °C. The comparative characterization of the surface was done by X-ray photoelectron spectroscopy (XPS), sessile drop wettability, and fracture testing of adhesive bonds.   The oxygen to carbon ratio (O/C) decreased and the C1/C2 ratio increased with drying temperature. The C1 component is related to carbon-carbon or carbon-hydrogen bonds, and the C2 component represents single carbon-oxygen bond. A low O/C ratio and a high C1/C2 ratio reflected a high concentration of non-polar wood components (extractives/VOCs) on the wood surface, which modified the wood surface from hydrophilic to more hydrophobic. Wettability was directly related to the O/C ratio and inversely related to the C1/C2 ratio. Contact angle decreased with time and increased with the temperature of exposure. Southern pine had a lower wettability than yellow-poplar, which was due to a greater concentration of non-polar hydrocarbon-type extractives and heat-generated volatiles on the surface. Solvent extraction prior to drying did not improved wettability, whereas, extraction after drying improved wettability. A contribution of extractives migration and VOCs generation played a significant role in the heat-induced inactivation process of southern pine.  The maximum strain energy release rate (Gmax) showed that surface inactivation was insignificant for yellow-poplar when exposed to drying temperatures < 187°C. The southern pine was most susceptible to inactivation at drying temperatures > 156°C, particularly when bonded with phenol-formaldehyde (PF) adhesive. Chemical treatments improved the wettability of inactivated wood surfaces, but an improvement in adhesion was not evident for specimens bonded with polyvinyl-acetate (PVA) adhesive. NaOH surface treatment was most effective for improving adhesion of the PF adhesive bond.",
  "description_provenance": [
    "Author Email: msernek@vt.edu",
    "Advisor Email: cfrazier@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: rfhelm@vt.edu",
    "Advisor Email: kamkefa@vt.edu",
    "Advisor Email: wglasser@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:14Z (GMT). No. of bitstreams: 1 WSInactivation.pdf: 2609264 bytes, checksum: 3a7753387751f0f60109d3e089bf0c76 (MD5)   Previous issue date: 2002-04-24"
  ],
  "handle": "27429",
  "identifier_other": "etd-04292002-083427",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04292002-083427/",
  "identifier_uri": "http://hdl.handle.net/10919/27429",
  "publisher": "Virginia Tech",
  "relation_haspart": "WSInactivation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "XPS",
    "Adhesion",
    "Wettability",
    "Wood Surface Inactivation"
  ],
  "title": "Comparative Analysis of Inactivated Wood Surfaces",
  "type": "Dissertation"
}