{
  "contributor_author": "Lee, Juneseok",
  "contributor_committeecochair": [
    "Dietrich, Andrea M.",
    "Lohani, Vinod K."
  ],
  "contributor_committeemember": [
    "Bosch, Darrell J.",
    "Scardina, Robert Paolo",
    "Trani, Antonio A.",
    "Younos, Tamim"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:11:12Z",
  "date_adate": "2008-05-01",
  "date_available": "2014-03-14T20:11:12Z",
  "date_issued": "2008-04-18",
  "date_rdate": "2009-05-01",
  "date_sdate": "2008-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Worldwide water distribution infrastructure system is old and deteriorating. A water system with its myriad appurtenances (including pumps and valves and tanks) is susceptible to hydraulic transients resulting in high and low pressure waves alternatively passing through the network. While both low and high pressure events structurally tax the already weak system, there is copious evidence indicating intrusion of contaminants into the drinking water pipes from the pipe창  s exterior environment due to low pressure events associated with water hammer phenomenon. These contaminants enter into the drinking water as the home plumbing system is a passive recipient from the water main. While the major (municipal) system is readily recognized as a vast infrastructure system of nearly 1,409,800 km of piping within the United States, the minor (plumbing) system that is at least 5 to 10 times larger is generally not well analyzed. In this study, an experimental plumbing rig was designed and implemented that replicates the range of pressures encountered in actual minor water distribution systems.  This research addresses how a pressure transient triggered within a house and from municipal systems can impact the service line with a possible suction effect. Experimental results on low pressure events and the accompanying numerical modeling showed good agreement.  The experiment also enabled visualization of the various pressure transient phenomena. It is demonstrated that hydraulic transients triggered from water mains result in low pressures events (up to -10 psig) in service lines which can allow possible intrusion of microbial and chemical contaminants at the service line. Structural integrity of service line and hydraulic integrity at water mains should be maintained to minimize any public health risks.    In the USA, about 90% of residential drinking water plumbing systems use copper pipes.  Pinhole leaks in copper plumbing pipes have become a nationwide concern because these leaks cause property damage, lower property values, and result in possibility of adversely affecting homeowners창   insurance coverage.  In addition, resulting mold damage may cause health concerns. This research also addresses the concerns of the affected homeowners by enabling them to decide on whether to continue to repair or replace their plumbing system, the factors to be considered in a replacement decision, and the type of material to use for replacement.  Plastic pipes such as PEX (cross-linked polyethylene), CPVC (Chlorinated Polyvinyl Chloride), and copper are considered in present analysis.  Other alternatives include an epoxy coating technique on the existing piping systems, without the need to tear into walls. Multiple attributes of a plumbing system including cost (material plus labor charges), taste and odor impacts, potential for corrosion, longevity of the pipe system, fire retardance, convenience of installation or replacement, plumber or general contractor창  s opinions or expertise, and proven record in the market are considered. Attributes and material rankings are formalized within the framework of the preference elicitation tools namely AHP (Analytical Hierarchical Process).  Surveys are conducted with selected homeowners in pinhole leak prone area in Southeastern US Community to observe their revealed and stated preferences.  Participants창   overall preference tradeoffs are reported in addition to comparing their revealed and stated preferences. Health effects, taste and odor of water turned out to be the most important factors from the survey. In real life, however, homeowners were not well aware of these safety issues related with plumbing materials. It is recommended that water professionals should work on bridging the gap between public perception and research results related to major and minor systems.",
  "description_provenance": [
    "Author Email: jsl0202@vt.edu",
    "Advisor Email: bosch@vt.edu",
    "Advisor Email: paolo@vt.edu",
    "Advisor Email: vuela@vt.edu",
    "Advisor Email: tyounos@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Advisor Email: vlohani@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:12Z (GMT). No. of bitstreams: 1 JLEE_PhD_Dissertation_Final.pdf: 4829958 bytes, checksum: 2ae734e24de534af6851dc4bf0524020 (MD5)   Previous issue date: 2008-04-18"
  ],
  "handle": "27422",
  "identifier_other": "etd-04282008-150534",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282008-150534/",
  "identifier_uri": "http://hdl.handle.net/10919/27422",
  "publisher": "Virginia Tech",
  "relation_haspart": "JLEE_PhD_Dissertation_Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "AHP (Analytical Hierarchical Process)",
    "Contaminant Intrusion",
    "Plumbing Systems",
    "Preference Trade-Offs",
    "Pressure Transients",
    "Water Hammer"
  ],
  "title": "Two Issues in Premise Plumbing: Contamination Intrusion at Service Line and Choosing Alternative Plumbing Material",
  "type": "Dissertation"
}