{
  "contributor_author": "Pati, Amrita",
  "contributor_committeechair": "Heath, Lenwood S.",
  "contributor_committeemember": [
    "Helm, Richard Frederick",
    "Ramakrishnan, Naren",
    "Shende, Anil M.",
    "Setubal, João C."
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2014-03-14T20:11:12Z",
  "date_adate": "2008-05-14",
  "date_available": "2014-03-14T20:11:12Z",
  "date_issued": "2008-04-14",
  "date_rdate": "2008-05-14",
  "date_sdate": "2008-04-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Genomes have both deterministic and random aspects, with the underlying DNA sequences exhibiting features at numerous scales, from codons to regions of conserved or divergent gene order. Genomic signatures work by capturing one or more such features eÂ±ciently into a compact mathematical structure. This work examines the unique manner in which oligonucleotides fit together to comprise a genome, within a graph-theoretic setting. A de Bruijn chain (DBC) is a marriage of a de Bruijn graph and a finite Markov chain. By representing a DNA sequence as a walk over a DBC and retaining specific information at nodes and edges, we are able to obtain the de Bruijn chain genomic signature (DBCGS), based on both graph structure and the stationary distribution of the DBC. We demonstrate that DBCGS is information-rich, efficient, sufficiently representative of the sequence from which it is derived, and superior to existing genomic signatures such as the dinucleotides odds ratio and word frequency based signatures. We develop a mathematical framework to elucidate the power of the DBCGS signature to distinguish between sequences hypothesized to be generated by DBCs of distinct parameters. We study the effect of order of the DBCGS signature on accuracy while presenting relationships with genome size and genome variety. We illustrate its practical value in distinguishing genomic sequences and predicting the origin of short DNA sequences of unknown origin, while highlighting its superior performance compared to existing genomic signatures including the dinucleotides odds ratio.    Additionally, we describe details of the CMGS database, a centralized repository for raw and value-added data particular to C. elegans.",
  "description_provenance": [
    "Author Email: apati@vt.edu",
    "Advisor Email: heath@vt.edu",
    "Advisor Email: helmrf@vt.edu",
    "Advisor Email: naren@vt.edu",
    "Advisor Email: shende@roanoke.edu",
    "Advisor Email: setubal@vbi.vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:12Z (GMT). No. of bitstreams: 1  Pati_Dissertation.pdf: 8819801 bytes, checksum: 88eef100e51f73170f52d130f300c862 (MD5)    Previous issue date: 2008-04-14"
  ],
  "handle": "27423",
  "identifier_other": "etd-04282008-150624",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04282008-150624/",
  "identifier_uri": "http://hdl.handle.net/10919/27423",
  "publisher": "Virginia Tech",
  "relation_haspart": "Pati_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Markov chains",
    "de Bruijn graphs",
    "Genomic signatures",
    "DNA words"
  ],
  "title": "Graph-based genomic signatures",
  "type": "Dissertation"
}