{
  "contributor_author": "Burcher, Chris L.",
  "contributor_committeechair": "Benfield, Ernest Fredrick",
  "contributor_committeemember": [
    "Angermeier, Paul L.",
    "Wynne, Randolph H.",
    "Voshell, J. Reese Jr.",
    "Webster, Jackson R."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:11:15Z",
  "date_adate": "2005-05-03",
  "date_available": "2014-03-14T20:11:15Z",
  "date_issued": "2005-04-12",
  "date_rdate": "2010-10-13",
  "date_sdate": "2005-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Streams are integrative systems spanning multiple spatial and temporal scales.  Stream researchers, land-use managers, and policy decision makers must consider the downstream displacement of streams when approaching questions about stream ecosystems.  The study of how anthropogenic land-use influences streams demands an ecosystem perspective, and this dissertation is an example of applying large scale analyses of stream reach responses, and linking the activity of humans in the landscape to stream structure and function.  I investigate whether rural development and agriculture land-cover types influence abiotic and biotic stream responses.  I establish a method for considering land-cover as an independent variable at multiple scales throughout a streamsâ   watershed using hydraulic modeling.  The travel time required for water to drain from the watershed to a stream reach provided a continuous index to delimit watershed sub portions along a spatial continuum.  Within travel time zones (TTZs), I consider land-use at increasingly larger scales relative to a stream reach within which biotic responses are typically measured.  By partitioning land-cover in TTZs, I was able to determine the spatial scale at which land-cover was most likely to influence in-stream responses.   I quantified a suite of physical and biotic responses typical to the aquatic ecology literature, and found that streams did not respond much to rural development.  Rural development influenced suspended and depositional sediments, and likely altered watershed hydrology though I was unable to find significant evidence supporting a hydrologic effect.  Subtle differences in assemblages suggest that differences in sediment dynamics influenced macroinvertebrates and fish.  Using the Land Cover Cascade (LCC) design, I link the influence of land-cover to biotic responses through a suite of multivariate models, focusing on sediment dynamics in an attempt to capture the subtle influence of hydrology and sediment dynamics.  My dissertation provides future researchers with improved methods for considering land-cover as an independent variable, as well as introduces multivariate models that link land-cover to sediment dynamics and biota.  My dissertation will assist future research projects in identifying specific mechanisms associated with stream responses to disturbance.",
  "description_provenance": [
    "Author Email: cburcher@vt.edu",
    "Advisor Email: benfield@vt.edu",
    "Advisor Email: biota@vt.edu",
    "Advisor Email: wynne@vt.edu",
    "Advisor Email: rvoshell@vt.edu",
    "Advisor Email: jwebster@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:15Z (GMT). No. of bitstreams: 1 DissertationCLB.pdf: 1686664 bytes, checksum: 7665cd1d3196697fdb352eff50c0503e (MD5)   Previous issue date: 2005-04-12"
  ],
  "handle": "27438",
  "identifier_other": "etd-04292005-164419",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04292005-164419/",
  "identifier_uri": "http://hdl.handle.net/10919/27438",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationCLB.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Appalachian",
    "stream assemblages",
    "North Carolina",
    "Blue Ridge physiographic province",
    "biodiversity"
  ],
  "title": "Biotic and abiotic responses to rural development and legacy agriculture by southern Appalachain streams",
  "type": "Dissertation"
}