{
  "contributor_author": "Lamb, Ashley B.",
  "contributor_committeecochair": [
    "Kok, Loke T.",
    "Salom, Scott M."
  ],
  "contributor_committeemember": [
    "Mullins, Donald E.",
    "Humble, Leland M.",
    "Lewis, Edwin E."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:11:15Z",
  "date_adate": "2005-04-29",
  "date_available": "2014-03-14T20:11:15Z",
  "date_issued": "2005-04-20",
  "date_rdate": "2005-04-29",
  "date_sdate": "2005-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Hemlock woolly adelgid (HWA), Adelges tsugae Annand (Hemiptera: Adelgidae), is an introduced pest injurious to hemlock trees (Tsuga spp.) in the eastern United States.  HWA currently infests hemlock in over 50% of its geographic range and has the potential to spread throughout its entire range.  Since HWA populations in the eastern United States are not regulated effectively by natural enemies (Wallace and Hain 2000), classical biological control is the most promising option for controlling this pest in the forest setting.  This work evaluates Laricobius nigrinus Fender (Coleoptera:  Derodontidae), a predator associated with HWA in western North America, is being evaluated as a potential biological control agent for HWA (Cheah et al. 2004).  Observations suggest that natural enemies may help keep HWA populations below injurious levels in the western United States (Mausel, pers. comm.).  Laboratory studies have revealed that L. nigrinus feed selectively on HWA and field studies in British Columbia, Canada have shown that its lifecycle is highly synchronous with HWA phenology.  This predator is being further evaluated for its suitability as a biological control agent.  In order to be a viable candidate, L. nigrinus must survive under natural field conditions in the eastern United States, reduce the density of HWA, and it must be amenable to mass rearing.   The survival, reproductive capability and predator efficiency of L. nigrinus were assessed over 3 years in the field.  In addition, the environmental factors regulating processes in the life cycle to develop and improve rearing procedures for this insect were identified.  In the first year, adults survived from February - May, laid up to 41 eggs/beetle, and consumed approximately 4.3 adelgids per day.  In the second season, L. nigrinus adults survived from November - April, laid up to 38 eggs/beetle and consumed approximately 4.5 adelgids per beetle throughout the study.  In both seasons, adelgid populations were significantly lower on branches with predators than those without predators.  This impact was demonstrated on both the winter and spring generation of HWA.  The feasibility of caged field releases of L. nigrinus was determined in a third field study.  An estimated 10, 000 L. nigrinus eggs were liberated in field cages in spring 2003.  The density of adelgids in the subsequent (spring) generation of the adelgids was significantly lower on branches with larval activity than those with no predators.  Despite extensive sampling, no F1 adults were observed, however F2 adults were recovered in the fall of 2004, 20 months after release. The L. nigrinus life stages incurring high mortality during rearing were identified and factors affecting survival in the feeding and non-feeding life stages were investigated.   Studies on the survival and feeding of adults, length of ovipositional period, density per cage, and survival of larvae were conducted.  The effect of type of pupation medium, moisture level, disturbance, soil sterilization, temperature, and photoperiod on survival of the non-feeding stages and time of emergence from aestivation was examined.  The most noteworthy finding, regarding rearing, is that aestivation can be extended by storing adults at high temperatures and long daylength throughout the summer and decreasing the temperature and daylength in the fall.  Based on the results of these studies, procedures for rearing L. nigrinus have been developed and it is currently being reared at two other institutions.  To date, over 8, 000 adults produced at Virginia Tech have been released in 6 states and both F1 and F2 adults have been recovered from multiple locations.",
  "description_provenance": [
    "Author Email: aslamb@vt.edu",
    "Advisor Email: mullinsd@vt.edu",
    "Advisor Email: ltkok@vt.edu",
    "Advisor Email: salom@vt.edu",
    "Advisor Email: lhumble@PFC.Forestry.CA",
    "Advisor Email: eelewis@ucdavis.edu",
    "Made available in DSpace on 2014-03-14T20:11:15Z (GMT). No. of bitstreams: 1 Lamb.Dissertation.pdf: 21335154 bytes, checksum: a280fec0a8e6f7893d03307b93012194 (MD5)   Previous issue date: 2005-04-20"
  ],
  "handle": "27436",
  "identifier_other": "etd-04292005-094622",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04292005-094622/",
  "identifier_uri": "http://hdl.handle.net/10919/27436",
  "publisher": "Virginia Tech",
  "relation_haspart": "Lamb.Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "rearing methods",
    "field evaluation",
    "biological control",
    "Adelgidae",
    "Adelges tsugae",
    "Derodontidae",
    "Laricobius nigrinus"
  ],
  "title": "Evaluating the suitability of Laricobius nigrinus Fender (Coleoptera: Derodontidae), a biological control agent for hemlock woolly adelgid, Adelges tsugae Annand (Hemiptera: Adelgidae)",
  "type": "Dissertation"
}