{
  "contributor_author": "Massie , Larry A.",
  "contributor_committeechair": "Salmon, Richard G.",
  "contributor_committeemember": [
    "Elitharp-Martin, Toni Marie",
    "Twiford, Travis W.",
    "Alexander, M. David",
    "Magill, C. Kenneth"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:16Z",
  "date_adate": "2010-05-17",
  "date_available": "2014-03-14T20:11:16Z",
  "date_issued": "2010-04-19",
  "date_rdate": "2010-05-17",
  "date_sdate": "2010-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Massie Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> A selected group of school superintendents and school board members who had served during the transition from appointed to elected school boards in Virginia from 1992 â   2006 were interviewed to determine their perceptions of the positive and negative effects of the change. Superintendents indicated the transition from appointed to elected school boards had a somewhat negative effect, while school board members said there was no effect. The law providing for the direct election of school board members in Virginia was approved April 1, 1992, and was &sect;22.1-57.1 through &sect;22.1-57.5 of the Code of Virginia (Elected School Boards Act, 1992). Prior to this time no provisions for the election of school boards in the state were set, and school boards were appointed, either by the local governing body (Underwood, 1992) or by a school board selection commission (Code of Virginia, 2009, &sect;22.1-36). The change in governance from appointed to elected school boards is an important phenomenon in Virginia , and the knowledge gained from the study could provide ways to lessen the stress which often exists in superintendent-school board relationships.</body> </html>",
  "description_provenance": [
    "Author Email: lmassie43@gmail.com",
    "Advisor Email: telitharp@pcva.us",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: kenmagill@vcu.org",
    "Made available in DSpace on 2014-03-14T20:11:16Z (GMT). No. of bitstreams: 1 Massie_LA_D_2010.pdf: 749684 bytes, checksum: 5cc9ba2c2a95aaf2d406bae4fb51beb4 (MD5)   Previous issue date: 2010-04-19"
  ],
  "handle": "27444",
  "identifier_other": "etd-04292010-134324",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04292010-134324/",
  "identifier_uri": "http://hdl.handle.net/10919/27444",
  "publisher": "Virginia Tech",
  "relation_haspart": "Massie_LA_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "elected school boards",
    "appointed school boards",
    "school board members",
    "superintendents"
  ],
  "title": "Perceptions of Superintendents and School Board Members Who Experienced the Transition from Appointed to Elected School Boards",
  "type": "Dissertation"
}