{
  "contributor_author": "Bao, Yeqing",
  "contributor_committeechair": "Fern, Edward F.",
  "contributor_committeemember": [
    "Ye, Keying",
    "Littlefield, James E.",
    "Sirgy, M. Joseph",
    "Klein, Noreen M."
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:11:17Z",
  "date_adate": "2001-05-01",
  "date_available": "2014-03-14T20:11:17Z",
  "date_issued": "2001-04-26",
  "date_rdate": "2002-05-01",
  "date_sdate": "2001-04-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation developed a comprehensive model conceptualizing the factors affecting children's choice of influence strategy and relative influence in family consumption decisions.  In particular, the model asserted that antecedent variables (i.e., family variables, individual characteristics of children, individual characteristics of parents, and parent-child interdependence) affect both directly and indirectly children's choice of influence strategy and relative influence.  Process variables (i.e., family socialization and power structure) mediate the effects of the antecedent variables.  In addition, effects of family socialization and power structure on children's choice of influence strategy and subsequent relative influence vary with the product type, decision stage, and subdecision.  Finally, children's relative influence is also dependent on their choice of influence strategy.   An empirical study was advanced to partially test the model.  Specifically, relationships among family socialization, power structure, children's choice of influence strategy, and their relative influence were empirically examined.  A field experimental interaction procedure was designed for data collection from parent/child dyads.  Multiple regressions were conducted to analyze the data.  Results showed moderate support to the hypothesized relationships.  However, most links in the testing model presented significant results.  It appears that the integration of consumer socialization theory and power relational theory provides better explanation to children's influence behavior than either theory does individually.",
  "description_provenance": [
    "Author Email: ybao@vt.edu",
    "Advisor Email: keying@vt.edu",
    "Advisor Email: jalittle@vt.edu",
    "Advisor Email: sirgy@vt.edu",
    "Advisor Email: efern@vt.edu",
    "Advisor Email: nklein@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:17Z (GMT). No. of bitstreams: 1 Etd.pdf: 1376543 bytes, checksum: e12df0084b769cbb3cefc1f30bae58f2 (MD5)   Previous issue date: 2001-04-26"
  ],
  "handle": "27448",
  "identifier_other": "etd-04302001-144238",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04302001-144238/",
  "identifier_uri": "http://hdl.handle.net/10919/27448",
  "publisher": "Virginia Tech",
  "relation_haspart": "Etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Parental Style",
    "Children's Influence",
    "Influence Strategy",
    "Parental Power"
  ],
  "title": "Effects of Parental Style and Power on Adolescentâ  s Influence in Family Consumption Decisions",
  "type": "Dissertation"
}