{
  "contributor_author": "Wigginton, Nicholas Scott",
  "contributor_committeechair": "Hochella, Michael F. Jr.",
  "contributor_committeemember": [
    "Lower, Brian H.",
    "Rosso, Kevin M.",
    "Heflin, James R."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:11:16Z",
  "date_adate": "2008-05-14",
  "date_available": "2014-03-14T20:11:16Z",
  "date_issued": "2008-04-21",
  "date_rdate": "2008-05-14",
  "date_sdate": "2008-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The electron transfer mechanisms of multiheme cytochromes were examined with scanning tunneling microscopy (STM). To simulate bacterial metal reduction mediated by proteins in direct contact with mineral surfaces, monolayers of purified decaheme cytochromes from the metal-reducing bacterium Shewanella oneidensis were prepared on Au(111) surfaces. Recombinant tetracysteine sequences were added to two outermembrane decaheme cytochromes (OmcA and MtrC) from S. oneidensis MR-1 to ensure chemical immobilization on Au(111). STM images of the cytochrome monolayers showed good coverage and their shapes/sizes matched that predicted by their respective molecular masses. Current-voltage (I-V) tunneling spectroscopy revealed that OmcA and MtrC exhibit characteristic tunneling spectra. Theoretical modeling of the single-molecule tunneling spectra revealed a distinct tunneling mechanism for each cytochrome: OmcA mediates tunneling current coherently whereas MtrC temporarily traps electrons via orbital-mediated tunneling. These mechanisms suggest a superexchange electron transfer mechanism for OmcA and a redox-specific (i.e. heme-mediated) electron transfer mechanism for MtrC at mineral surfaces during bacterial metal reduction. Additionally, a novel electrochemical STM configuration was designed to measure tunneling current from multiheme cytochromes to hematite (001) surfaces in various electrolyte solutions. Current-distance (I-s) profiles on hematite (001) reveal predictable electric double layer structure that changes with ionic strength. The addition of the small tetraheme cytochrome c (STC) from S. oneidensis on insulated Au tips resulted in modified tunneling profiles that suggest STC significantly modulates the double layer. This observation is relevant to understanding metal reduction in cases where terminal metal-reducing enzymes are unable to come in direct contact with reducible mineral surfaces. Electronic coupling to the mineral surface might therefore be mediated by a localized ion swarm specific to the mineral surface.",
  "description_provenance": [
    "Author Email: wigginto@vt.edu",
    "Advisor Email: brian.lower@pnl.gov",
    "Advisor Email: kevin.rosso@pnl.gov",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: hochella@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:16Z (GMT). No. of bitstreams: 1 Wigginton-revisions.pdf: 19827369 bytes, checksum: ca24e6e62aa8a5341240c74a5a8616b3 (MD5)   Previous issue date: 2008-04-21"
  ],
  "handle": "27441",
  "identifier_other": "etd-04292008-185236",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04292008-185236/",
  "identifier_uri": "http://hdl.handle.net/10919/27441",
  "publisher": "Virginia Tech",
  "relation_haspart": "Wigginton-revisions.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "geomicrobiology",
    "shewanella",
    "scanning tunneling microscopy",
    "hematite",
    "biogeochemistry"
  ],
  "title": "Interfacial and long-range electron transfer at the mineral-microbe interface",
  "type": "Dissertation"
}