{
  "contributor_author": "Morton, Clarresa Moore",
  "contributor_committeechair": "Alexander, M. David",
  "contributor_committeemember": [
    "Ostroth, D. David",
    "Hirt, Joan B.",
    "Muffo, John A.",
    "Leffel, Linda G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:17Z",
  "date_adate": "1999-04-30",
  "date_available": "2014-03-14T20:11:17Z",
  "date_issued": "1999-04-19",
  "date_rdate": "2000-04-30",
  "date_sdate": "1999-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this descriptive study was to develop and validate a list of the skills and knowledge that will be necessary for the career preparation of college union executive directors who will be hired in Research and Doctoral I universities in the next decade, (2000 to 2010).  The research design recognizes job congruencies and shared competencies between hospitality general managers and college union directors. <p>In designing this study, three separate but interrelated research methods were employed.  Those methods are (a)  A series of focused interviews with experts in the college union field;  (b)  A review of existing data, including job advertisements for union director positions; results from the Association of College Unions International data bank; literature from the college union field; and literature from the hospitality industry, related to general managers' competencies; and  (c)  An original questionnaire that was designed using the data gathered from the first two techniques.  The questionnaire was administered by mail to the research population, college union directors at Research I, Research II, and Doctoral I universities. <p> Ratings on the 86 competencies from the survey were tabulated, measures of central tendency were computed and characteristics were ranked in order of importance to answer the research questions.  Results indicated agreement among directors regarding the necessary knowledge and abilities for career preparation of union directors.  No significant differences existed between responses from Student Affairs and Business/Auxiliary Affairs, or between male and female respondents.  Significant differences were found between responses from directors at commuter and residential universities. <p>Findings from this study will provide guidance for persons who are interested in preparing for a career as a college union director and for veteran professionals who serve as mentors to newcomers into the field.",
  "description_provenance": [
    "Author Email: mortoncm@vt.edu",
    "Advisor Email: dostroth@vt.edu",
    "Advisor Email: mikealex@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: muffo@vt.edu",
    "Advisor Email: leffel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:17Z (GMT). No. of bitstreams: 1 etd.PDF: 620054 bytes, checksum: ba094cabbf9d831792f21310a4eb1805 (MD5)   Previous issue date: 1999-04-19"
  ],
  "handle": "27446",
  "identifier_other": "etd-042999-103343",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-042999-103343/",
  "identifier_uri": "http://hdl.handle.net/10919/27446",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Competencies",
    "Hospitality Management",
    "Higher Education",
    "College Unions"
  ],
  "title": "Knowledge and Skills Required for College Union Executive Directors at Research and Doctoral I Universities in the Next Decade",
  "type": "Dissertation"
}