{
  "contributor_author": "Kindelan, Julie Kinsley",
  "contributor_committeechair": "Creighton, Theodore B.",
  "contributor_committeemember": [
    "Tripp, Norman Wayne",
    "Day-Vines, Norma L.",
    "Eller, John F."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:16Z",
  "date_adate": "2011-05-17",
  "date_available": "2014-03-14T20:11:16Z",
  "date_issued": "2011-04-21",
  "date_rdate": "2011-05-17",
  "date_sdate": "2011-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<head> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" /> <title>Julie Kindelan Abstract</title> </head>  <body> <p>School safety is the utmost  priority for an elementary school administrator and is high on the list of  public concerns. The intent of this study was to identify the professional  development that Virginia Elementary School principals receive in the area of  handling student discipline. The study addressed the following research  questions: (a) to what extent do current elementary school administrators  receive training in the area of handling student discipline; (b) to what extent  do elementary school administrators receive training in the area of handling  student discipline in principal preparation coursework; (c) what are the most  prevalent topics when administrators receive training in the area of handling  student discipline; and (d) what future training, in the area of handling  student discipline, do elementary school administrators need? </p> This descriptive, quantitative study included a  survey, created by the researcher that was used to collect data from 103  elementary school administrators. The results indicate that the administrators  did not receive comprehensive training in the area of handling student  discipline. In particular, training regarding suspensions and minority  overrepresentation was severely lacking while the training around safety and  security was the most prevalent. Forty-nine percent of the administrators  indicated that their principal preparation programs did not address student  discipline in a required coursework. The results of this study provide school  district leaders with information on current gaps in the area of student  discipline included in professional development provided to elementary school  administrators in principal preparation programs and during their tenure as  administrators. </body> </html>",
  "description_provenance": [
    "Author Email: juliekindelan@me.com",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: ndayvine@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: jfeller@stcloudstate.edu",
    "Made available in DSpace on 2014-03-14T20:11:16Z (GMT). No. of bitstreams: 1 Kindelan_JK_D_2011.pdf: 1492645 bytes, checksum: 330d7a946c44e87b650e9cf71ebda0e6 (MD5)   Previous issue date: 2011-04-21"
  ],
  "handle": "27445",
  "identifier_other": "etd-04292011-161142",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04292011-161142/",
  "identifier_uri": "http://hdl.handle.net/10919/27445",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kindelan_JK_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "principal preparation coursework",
    "classroom management",
    "positive behavior support",
    "minority overrepresentation",
    "suspension",
    "administrator",
    "elementary school",
    "student discipline",
    "safety and security"
  ],
  "title": "Elementary School Administrator Training in the Area of  Handling Student Discipline",
  "type": "Dissertation"
}