{
  "contributor_author": "Creech, Linda Sue",
  "contributor_committeechair": "Allen, Katherine R.",
  "contributor_committeemember": [
    "Roberto, Karen A.",
    "Blieszner, Rosemary",
    "Schlenker, Eleanor D.",
    "Teaster, Pamela B."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:17Z",
  "date_adate": "2002-05-01",
  "date_available": "2014-03-14T20:11:17Z",
  "date_issued": "2002-04-19",
  "date_rdate": "2003-05-01",
  "date_sdate": "2002-04-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html>  <head>  <title>Sue Creech's Abstract</title>  <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\">  </head>    <body bgcolor=\"#FFFFFF\" text=\"#000000\">    <p>The purpose of this study was to examine factors that influence the experience     of urinary incontinence (UI) as it relates to sexual intimacy for older women.     Additionally, I wanted to identify perceived areas of intervention that might     positively influence the experience of UI as it relates to sexual intimacy for     participants. The sample consisted of 10 women who ranged in age from 65 to     81. </p>  <p>The theoretical framework guiding this study was a systemic perspective in     which how participants make meaning is given prominence. Symbolic interactionism,     social constructionism, and systems perspective are interwoven to provide the     foundation for this study. Data were collected utilizing in-depth interviews.     Self-portraits were introduced to enrich conversation during the second interview.   </p>  <p>Three conclusions were drawn from this study. First, feelings of secrecy that     permeated this project were manifested in the lack of willing participants as     well as brevity of responses during interactions with participants. Second,     participants indicated a tendency to minimize their incontinence and to manage     their symptoms without formal medical intervention. Third, participants offered     perceived potential interventions that might positively influence the experience     of UI. These included the provision information related to UI in a way that     does not require individuals to request the information, such as brochures at     physicians' offices, post-surgical follow-up, and individuals from whom participants     would be most comfortable receiving such information. </p>  </body>  </html>",
  "description_provenance": [
    "Author Email: lcreech@vt.edu, screech@lynchburg.net",
    "Advisor Email: kroberto@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Advisor Email: schlenkr@vt.edu",
    "Advisor Email: pteaster@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:17Z (GMT). No. of bitstreams: 1  CreechEND2.pdf: 2079703 bytes, checksum: bc6aa880a97580a64b4ed5eef102401b (MD5)    Previous issue date: 2002-04-19"
  ],
  "handle": "27449",
  "identifier_other": "etd-04302002-112913",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04302002-112913/",
  "identifier_uri": "http://hdl.handle.net/10919/27449",
  "publisher": "Virginia Tech",
  "relation_haspart": "CreechEND2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "urinary incontinence",
    "sexual intimacy",
    "urinary incontinence and sexual intimacy"
  ],
  "title": "Urinary Incontinence and Sexual Intimacy:  Older Women's Perceptions",
  "type": "Dissertation"
}