{
  "contributor_author": "Catlin, Daniel Herbert",
  "contributor_committeechair": "Fraser, James D.",
  "contributor_committeemember": [
    "Kelly, Marcella J.",
    "Berkson, James M.",
    "Hallerman, Eric M.",
    "Walters, Jeffrey R."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:11:16Z",
  "date_adate": "2009-06-09",
  "date_available": "2014-03-14T20:11:16Z",
  "date_issued": "2009-04-20",
  "date_rdate": "2009-06-09",
  "date_sdate": "2009-04-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Habitat loss and predation are threatening many shorebird populations worldwide.  While habitat preservation often is preferable, sometimes habitat needs to be restored or created in order to stave off immediate declines.  The Great Plains population of piping plovers (Charadrius melodus) was listed as threatened in 1986, and habitat loss and predation appear to be limiting the growth of this population.  On the Missouri River, piping plovers nest on sandbars, but the damming of the mainstem of the Missouri in the mid-twentieth century reduced the natural capacity of the Missouri River to create sandbar habitat.  In 2004, the United States Army Corps of Engineers (USACE) implemented a habitat creation project on the Gavins Point Reach of the Missouri River (stretch of river immediately downriver from the Gavins Point Dam) in an effort to promote recovery of piping plovers and the endangered least tern (Sternula antillarum).  The USACE built 3 sandbars in 2004 â   2005 and built another sandbar on Lewis and Clark Lake in 2007.  We studied the population dynamics of piping plovers in relationship to this newly engineered habitat.  We monitored 623 nests on 16 sandbar complexes, to evaluate habitat selection, determine the factors affecting nesting success, and compare nesting success between natural and engineered habitat.  From these 623 nests, we banded 357 adults and 685 chicks to investigate the factors affecting adult and juvenile survival.  We used a logistic-exposure model to calculate nest survival.  Adult and juvenile survival was calculated using Cormack-Jolly-Seber based models in Program MARK.  We used the estimates from these studies to create a matrix population model for piping plovers nesting on the Gavins Point Reach.  We used this model to predict the effects of engineered habitat on the population growth rate. Piping plovers selected for engineered sandbars and against natural and natural/modified habitats.  Daily survival rate (DSR) on engineered habitats was significantly higher than on natural or natural modified habitats (log odds: 2.71, 95% CI: 1.20 â   6.08).  Predator exclosures around nests did not affect DSR after controlling for the effects of date, nest age, and clutch size.  Piping plover juvenile survival to recruitment was negatively related to nesting density on the relatively densely populated engineered sandbars.  On the less dense natural sandbars, survival to recruitment was positively correlated with density.  Adult survival did not appear to be related to density within our study.  Movement within the study area was related also to density.  Juveniles from densely populated engineered sandbars were more likely to leave engineered habitat to nest on natural sandbars than were juveniles hatched on less densely populated engineered sandbars.  Movements among sandbars by breeding adults suggested that adults preferred engineered habitat.  It is possible that juveniles moved to natural habitats because they were unable to compete with adults for the more desirable engineered habitats.  Adults and juveniles emigrated from the study area at a higher rate after the 2006 breeding season, a year when water discharge was higher, nesting densities were higher, and reproductive success was lower (as a result of predation) than in the other years.  Deterministic modeling suggested that engineered habitat significantly increased population growth.  Decreased productivity over time and associated predicted negative population growth suggest that the amount of engineered habitat created was inadequate to sustain population growth, and/or that relatively high water discharge and nesting densities coupled with low reproductive rates and high emigration rates could lead to rapid declines in the plover population.  Continued research is needed to determine the effects of these factors on long-term population growth.  Our results suggest that habitat creation could be a viable short-term solution to population declines in shorebird populations limited by habitat loss, but high densities and increased predation associated with habitat creation indicate that other, long-term solutions may be required.",
  "description_provenance": [
    "Author Email: dcatlin@vt.edu",
    "Advisor Email: fraser@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:16Z (GMT). No. of bitstreams: 1 Catlin_Final_Population_Dynamics_of_Piping_Plovers_on_the_Missouri_River_draft2.pdf: 710140 bytes, checksum: 5f3b0d548547085f0351260dc1195cee (MD5)   Previous issue date: 2009-04-20"
  ],
  "handle": "27442",
  "identifier_other": "etd-04292009-140737",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04292009-140737/",
  "identifier_uri": "http://hdl.handle.net/10919/27442",
  "publisher": "Virginia Tech",
  "relation_haspart": "Catlin_Final_Population_Dynamics_of_Piping_Plovers_on_the_Missouri_River_draft2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Charadrius melodus",
    "nesting success",
    "survival",
    "density-dependent",
    "population viability analysis",
    "Missouri River",
    "Piping plovers",
    "population ecology",
    "demography",
    "bird",
    "avian",
    "reproduction"
  ],
  "title": "Population Dynamics of Piping Plovers (Charadrius melodus) on the Missouri River",
  "type": "Dissertation"
}