{
  "contributor_author": "Andes, Glenda Gilmore",
  "contributor_committeechair": "Beamish, Julia O.",
  "contributor_committeemember": [
    "Casto, Marilyn D.",
    "Cross, Lawrence H.",
    "Parrott, Kathleen R.",
    "Emmel, JoAnn"
  ],
  "contributor_department": "Housing, Interior Design, and Resource Management",
  "date_accessioned": "2014-03-14T20:11:18Z",
  "date_adate": "2004-05-07",
  "date_available": "2014-03-14T20:11:18Z",
  "date_issued": "2004-04-20",
  "date_rdate": "2007-05-24",
  "date_sdate": "2004-04-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The number of older persons is increasing, both in actual number and as a percentage of the population.  As an individual ages his or her body changes and the ability to deal with the demands of an environment usually decreases.  A well designed, supportive environment may help older persons to utilize their homes more fully, more safely, and allow them to live independently in their homes longer.  Use of kitchens and bathrooms may present the greatest challenge and the greatest safety hazard and in order to remain independent, an older person must be able to use these rooms fully and safely.   \tThe purpose of this study was to determine what supportive feature are being included in the kitchens and bathrooms of homes being built for persons living in age-restricted retirement communities.  A list of research and design recommendations based on empirical research was compiled and ordered into categories of supportive features for general, kitchen, and bathroom design for seniors.  Design recommendations were provided for most elements in kitchens and bathrooms designed for senior citizens and point values were assigned to individual supportive features on the basis of safety and ease of use.  Based on this evidence, two data collection tools were created to assess kitchens and bathroom of homes designed for senior living.  Hypotheses were developed relating characteristics of the locations of the retirement communities, characteristics of the retirement communities, and characteristics of the individual homes to the percentage of possible points earned in kitchens and bathrooms of homes studied.   \tAge-restricted retirement communities were identified and contacted by telephone to determine if they met the criteria for inclusion in the study and permission to study the retirement communities was obtained from community representatives.  Sixty homes in 23 communities from four states were surveyed using the data collection tools and photographed for this study.   \tData were entered into a statistical computer program and a scoring system for evaluating and comparing kitchens, bathrooms of different types, and total homes was developed.  Kitchens in the retirement community homes studied had 46% - 76% of the possible number of recommended supportive kitchen features.  Bathrooms had 48% - 57%, bathtubs had 58%, and separate showers had 48% - 52% of the possible number of recommended supportive bathroom features.  Kitchens in larger, more expensive retirement homes had higher Kitchen Percentage Scores and bathrooms in communities that were developed by not-for-profit communities had higher Bathroom Percentage Scores.   \tThe kitchen and bathroom assessment tools created for this study are the result of compiling 40 years of research recommendations.  These tools provide the means to compare kitchens and bathrooms of different homes, regardless of the configuration or combination of appliances and fixtures within the rooms.  Scores of different rooms or houses can be compared using either the total score or the percentage score for number of supportive features.  Comparisons can be made without consideration for the style, size, or degree of opulence in the homes.  The assessment tools can be refined for use by members of different professions.",
  "description_provenance": [
    "Author Email: gandes@vt.edu",
    "Advisor Email: mcasto@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: jbeamish@vt.edu",
    "Advisor Email: homes@vt.edu",
    "Advisor Email: jemmel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:18Z (GMT). No. of bitstreams: 1 GGAndes2.pdf: 1958712 bytes, checksum: 29944142b8615e32ada7a4682c2c1663 (MD5)   Previous issue date: 2004-04-20"
  ],
  "handle": "27456",
  "identifier_other": "etd-04302004-152444",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04302004-152444/",
  "identifier_uri": "http://hdl.handle.net/10919/27456",
  "publisher": "Virginia Tech",
  "relation_haspart": "GGAndes2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "universal design",
    "kitchen design",
    "bathroom design",
    "senior design",
    "interior design",
    "housing"
  ],
  "title": "Supportive Design Features in Kitchens and Bathrooms of Age-Restricted Retirement Community Homes",
  "type": "Dissertation"
}