{
  "contributor_author": "Will, Kelli England",
  "contributor_committeechair": "Geller, E. Scott",
  "contributor_committeemember": [
    "Winett, Richard A.",
    "Finney, Jack W.",
    "Ollendick, Thomas H.",
    "Jones, Russell T."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:17Z",
  "date_adate": "2002-04-30",
  "date_available": "2014-03-14T20:11:17Z",
  "date_issued": "2002-04-26",
  "date_rdate": "2003-04-30",
  "date_sdate": "2002-04-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The \"Actively Caring for KIDS Process,\"   a multi-component program that taught retail store sales associates to act as behavior-change agents for child passenger safety, was implemented at a nationwide-chain discount store and evaluated with an interrupted time series design and a similar control site for comparison. Key components of the KIDS Process included a) training of sales associates to act as behavior-change agents at the point-of-purchase, b) the use of in-store awareness and supportive materials such as posters and sales associate buttons, and c) incentives for participation in checkpoints. Safety-seat checks (n = 31) were held in store parking lots, where caregiversâ   safety-seat installations (n = 241) were recorded as safe or at-risk for a variety of criteria and then the seats were reinstalled correctly. Research assistants posing as child caregivers visited the retail stores (n = 156) with the purported objective of obtaining information about selecting and installing a safety seat. Information given by sales associates was systematically recorded as safe or at-risk on a checklist. A 2 (Store) x 2 (Phase) ANOVA on sales associates' percent safe information scores revealed a significant interaction and no main effects. The Control store did not differ across the two phases, but scores at the intervention store were significantly higher after the intervention than during pre-intervention and when compared to the Control store during post-intervention. The training of sales associates resulted in an average 65% increase in percent safe scores. At the parking lot checks, 93 percent of seats checked were misused in one or more ways, with an average of four errors per seat. ANOVA and Chi-square analyses indicated that the intervention failed to have an impact on child safety-seat misuse observed or on the number of participants attending the checkpoints. This is likely a result of few parents attending the checkpoints who had talked to our trained associates. To target more parents, this intervention might be better placed at well-baby checkups.",
  "description_provenance": [
    "Author Email: keenglan@vt.edu",
    "Advisor Email: esgeller@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: rtjones@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:17Z (GMT). No. of bitstreams: 1  KWilldissertation.pdf: 7456045 bytes, checksum: 6445f8bf07180b43b5b2adf820daedb7 (MD5)    Previous issue date: 2002-04-26"
  ],
  "handle": "27450",
  "identifier_other": "etd-04302002-143323",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04302002-143323/",
  "identifier_uri": "http://hdl.handle.net/10919/27450",
  "publisher": "Virginia Tech",
  "relation_haspart": "KWilldissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "community intervention",
    "unintentional injury prevention",
    "motor vehicle safety",
    "child passenger safety",
    "child safety seats"
  ],
  "title": "Evaluating an Actively Caring for KIDS Process: A Behavioral-Community Program to Reduce Child Safety-Seat Misinformation and Misuse",
  "type": "Dissertation"
}