{
  "contributor_author": "Neatrour, Matthew Aaron",
  "contributor_committeecochair": [
    "Jones, Robert H.",
    "Golladay, Stephen W."
  ],
  "contributor_committeemember": [
    "Webster, Jackson R.",
    "Burger, James A.",
    "Nilsen, Erik T."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:11:18Z",
  "date_adate": "2005-05-03",
  "date_available": "2014-03-14T20:11:18Z",
  "date_issued": "2005-04-21",
  "date_rdate": "2006-05-03",
  "date_sdate": "2005-04-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Soil nutrients are often heterogeneously distributed in space and time at scales relevant to individual plants, and plants can respond by selectively proliferating their roots within nutrient-rich patches.  However, many environmental factors may increase or decrease the degree of root proliferation by plants.  I explored how soil fertility, nitrogen (N) or phosphorus (P) limitation, and soil oxygen availability affected root system response to nutrient heterogeneity in forested wetland ecosystems of southeastern United States.  Fine root biomass was not correlated with soil nutrient availability within wetland ecosystems, but was related to ecosystem-scale fertility.  Root systems generally did not respond to P-rich patches in both floodplain (nutrient-rich) and depressional swamps (nutrient-poor) swamps, but results were inconclusive because the growth medium (sand) potentially hindered root growth.   In floodplain forests, roots proliferated into N-rich patches but not P-rich patches, even though litterfall N:P ratios were > 15, which suggested that these ecosystems were P-limited.  The combination of nutrient and oxygen heterogeneity affected root proliferation and biomass growth of three common floodplain forest species (Liquidambar styraciflua, Fraxinus pennsylvanica, and Nyssa aquatica) in a potted study, which was related to speciesâ   flood tolerance.  My results suggest that the environmental context of plants can affect roots system response to nutrient heterogeneity in forested wetland ecosystems and highlights the need for field studies that investigate this phenomenon.  Learning how environmental conditions affect plant response to nutrient heterogeneity at a fine-scale will provide better predictions of nutrient cycling, plant competition and succession, and forest productivity, which are important factors that determine carbon sequestration and timber production.",
  "description_provenance": [
    "Author Email: mneatrou@vt.edu",
    "Advisor Email: jwebster@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: jaburger@vt.edu",
    "Advisor Email: sgollada@jonesctr.org",
    "Advisor Email: enilsen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:18Z (GMT). No. of bitstreams: 1 Neatrour_dis.pdf: 675628 bytes, checksum: e4ec83d2f1e1f8bda671a9d5b8fa6fca (MD5)   Previous issue date: 2005-04-21"
  ],
  "handle": "27457",
  "identifier_other": "etd-04302005-191841",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04302005-191841/",
  "identifier_uri": "http://hdl.handle.net/10919/27457",
  "publisher": "Virginia Tech",
  "relation_haspart": "Neatrour_dis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "root proliferation",
    "root foraging",
    "nutrient heterogeneity",
    "forested wetlands"
  ],
  "title": "Factors affecting root system response to nutrient heterogeneity in forested wetland ecosystems",
  "type": "Dissertation"
}