{
  "contributor_author": "Seitz, Katrina Nannette",
  "contributor_committeechair": "Bryant, Clifton D.",
  "contributor_committeecochair": "de Wolf, Peggy L.",
  "contributor_committeemember": [
    "Jones, Kathleen W.",
    "Shoemaker, Donald J.",
    "Axsom, Daniel K."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:11:20Z",
  "date_adate": "2001-05-03",
  "date_available": "2014-03-14T20:11:20Z",
  "date_issued": "2001-04-18",
  "date_rdate": "2002-05-03",
  "date_sdate": "2001-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Transition of Methods of Execution in North Carolina: A Descriptive Social History of Two Time Periods, 1935 and 1983   Katrina N. Seitz  (ABSTRACT)   The death penalty has been an area of focus in several academic disciplines, yet modest literature has been generated which examines the sanction from a sociological perspective. Most of the sociological interest in capital punishment is directed at examining and explaining racial disparities in sentencing, its effectiveness as a deterrent to violent crime, or its use as a mode of formal social control. Although execution methods have changed frequently over time in the United States, there is a paucity of research examining this phenomenon through a sociological lens. The extant literature identifies changing societal ideologies regarding the use of institutionalized violence as the impeti for legislative shifts in methods of execution. While these studies are useful in partially explaining method changes through time, there is a dearth of work which specifically addresses the dialectical process by which meanings attached to methods of punishment are socially constructed and negotiated, what social agents are engaged, and how this process occurs with respect to historical context.  This dissertation examines the legislative changes in execution methods at two points in time in North Carolinaâ  s history, 1935 and 1983. Grounded in a hybrid theoretical foundation of functionalist and interactionist perspectives, this study is a qualitative analysis of historical primary and secondary data. One goal of this project is to identify how social context informed ideologies of state-sanctioned death. Furthermore, this study attempts to reveal some of the various social agents who engaged in the process of negotiating meaning, how this process manifested itself, and how historical context may have influenced differences in legislative motive during the two transition years.   A comparative analysis of the data reveals that deference to the institutions of science, technology, and medicine was vital to the process of socially reconstructing and redefining methods of execution at both points in time. However, findings also indicate that public exposure to an existing method of execution as well as historically relative ideologies concerning state-sanctioned death greatly affect how the negotiation of meaning transpires.",
  "description_provenance": [
    "Author Email: lethal@vt.edu",
    "Advisor Email: kjwj@vt.edu",
    "Advisor Email: woofer@vt.edu",
    "Advisor Email: shoemake@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Advisor Email: cbryant@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:20Z (GMT). No. of bitstreams: 1 dissertation.pdf: 864933 bytes, checksum: 77faa4c2f1be0464422bb6eb795e89ad (MD5)   Previous issue date: 2001-04-18"
  ],
  "handle": "27466",
  "identifier_other": "etd-05012001-122101",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012001-122101/",
  "identifier_uri": "http://hdl.handle.net/10919/27466",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Executions",
    "North Carolina",
    "Deviance",
    "Capital Punishment"
  ],
  "title": "The Transition of Methods of Execution in North Carolina: A Descriptive Social History of Two Time Periods, 1935 and 1983",
  "type": "Dissertation"
}