{
  "contributor_author": "Marte, Judson Sloan",
  "contributor_committeechair": "Kampe, Stephen L.",
  "contributor_committeemember": [
    "Reynolds, William T. Jr.",
    "Sturges, Robert H.",
    "Crowe, C. Robert",
    "Christodoulou, Leonitus",
    "Aning, Alexander O."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:11:19Z",
  "date_adate": "2000-07-14",
  "date_available": "2014-03-14T20:11:19Z",
  "date_issued": "1999-01-12",
  "date_rdate": "2001-07-14",
  "date_sdate": "2000-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A systematic and scientific approach has been applied to the study of codeformation processing.  A series of composites having mechanically-dissimilar phases were developed in which the high temperature flow behavior of the reinforcement material could be varied independent of the matrix.  This was accomplished through the use of a series of intermetallic matrix composites (IMCs) as discontinuous reinforcements in an otherwise conventional metal matrix composite. The IMCs are produced using an in-situ reaction synthesis technique, called the XDâ ¢ process.  The temperature of the exothermic synthesis reaction, called the adiabatic temperature, has been calculated and shown to increase with increasing volume percentage of TiB2 reinforcement.  Further, this temperature has been shown to effect the size and spacing of the TiB2, microstructural features which are often used in discontinuous composite strength models. Study of the high temperature flow behavior of the components of the metal/IMC composite is critical to the development of an understanding of codeformation.  A series of compression tests performed at 1000Â° to 1200Â°C and strain-rates of 10-3 and 10-4 sec-1.  Peak flow stresses were used to evaluate the influence of material properties and process conditions.  These data were incorporated into phenomenologically-based constitutive equations that have been used to predict the flow behavior.  It has been determined that plastic deformation of the IMCs occurs readily, and is largely TiB2 independent, at temperatures approaching the melting point of the intermetallic matrices.",
  "description_provenance": [
    "Author Email: marte@crd.ge.com",
    "Advisor Email: kampe@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: sturges@vt.edu",
    "Advisor Email: croweb@vt.edu",
    "Advisor Email: lechrist@vt.edu",
    "Advisor Email: aaning@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:19Z (GMT). No. of bitstreams: 1 Jud_Marte_thesis.pdf: 17784869 bytes, checksum: 3e517d5a4d03314fcb5f836fc70f16d3 (MD5)   Previous issue date: 1999-01-12"
  ],
  "handle": "27463",
  "identifier_other": "etd-05012000-11530012",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012000-11530012/",
  "identifier_uri": "http://hdl.handle.net/10919/27463",
  "publisher": "Virginia Tech",
  "relation_haspart": "Jud_Marte_thesis.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Reaction Synthesis",
    "Powder Metallurgy",
    "Extrusion",
    "Intermetallic Matrix Composites",
    "Metal Matrix Composites",
    "Codeformation"
  ],
  "title": "CODEFORMATION PROCESSING OF MECHANICALLY-DISSIMILAR METAL/INTERMETALLIC COMPOSITES",
  "type": "Dissertation"
}