{
  "contributor_author": "Chen, Hengheng",
  "contributor_committeechair": "Ge, Suqin",
  "contributor_committeemember": [
    "You, Wen",
    "Salehi-Isfahani, Djavad",
    "Haller, Hans H.",
    "Ashley, Richard A."
  ],
  "contributor_department": "Economics (Science)",
  "date_accessioned": "2014-03-14T20:11:19Z",
  "date_adate": "2012-05-16",
  "date_available": "2014-03-14T20:11:19Z",
  "date_issued": "2012-04-20",
  "date_rdate": "2012-05-16",
  "date_sdate": "2012-04-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation consists of three essays studying the effects of collective household decisions on early childhood development from both empirical and theoretical perspectives. The first chapter outlines the dissertation, by presenting the motivations, methods, conclusions, and policy implications for the entire dissertation. <p> Chapter two examines early childhood development using a collective model with children's cognitive production. We jointly estimate the home input demand with children's cognitive production functions based on a simultaneous equations model. Biases are considered that are caused by the non-random selection of time inputs and possible correlations across inputs and outcomes functions. A direct measure of time inputs relying on children's time diaries from the Child Development Supplement of the Panel Study of Income Dynamics (PSID-CDS) has been constructed. We thereby relax the assumption that there is no difference between parental time spent on children and leisure. Our results show that parental time inputs, especially the active time interacting with children's daily activities, have substantial effects on both children's math and reading test scores. The time inputs vary across parents' age, race, and eduction levels. <p>  In chapter three, we conduct a standard Blinder-Oaxaca decomposition to evaluate the role of home inputs in the black-white test score gaps based on the empirical model presented in chapter two. Aside from the finding that children's ability accounts for a large proportion of the differences, we find that home inputs can also explain a significant portion of the gap. When the maternal time is equalized at the average levels of white children, the racial differences in children's reading and math test scores can be closed by approximately 30%-50%.<p>   The last chapter extends a collective model with household production to the general equilibrium framework. We concentrate on the impacts of a global bargaining power shift within the household on children's cognitive achievement, especially on those who live with single mothers. The model shows that a global bargaining power change in favor of the female may not necessarily be beneficial to the children living with their single mothers. An increase of female's market equilibrium wage rate as a result of reduced labor supply by married women may induce single mothers to work longer hours, spend less time with children, and compensate them with more monetary investment compared with the case when the equilibrium wage rate stays constant.",
  "description_provenance": [
    "Author Email: hchen07@vt.edu",
    "Advisor Email: wenyou@vt.edu",
    "Advisor Email: salehi@vt.edu",
    "Advisor Email: haller@vt.edu",
    "Advisor Email: ashleyr@vt.edu",
    "Advisor Email: ges@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:19Z (GMT). No. of bitstreams: 1 CHEN_H_D_2012.pdf: 2554351 bytes, checksum: f5fee8847ac5ca1e9b5104056009f4b7 (MD5)   Previous issue date: 2012-04-20"
  ],
  "handle": "27461",
  "identifier_other": "etd-04302012-153847",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-04302012-153847/",
  "identifier_uri": "http://hdl.handle.net/10919/27461",
  "publisher": "Virginia Tech",
  "relation_haspart": "CHEN_H_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "General Equilibrium",
    "Simultaneous Equations Model",
    "Collective Model",
    "Parental Time",
    "Black-White Test Score Gap",
    "Children's Cognitive Development"
  ],
  "title": "Three Essays on Family Economics and Early Childhood Development",
  "type": "Dissertation"
}