{
  "contributor_author": "Shenal, Brian V.",
  "contributor_committeechair": "Harrison, David W.",
  "contributor_committeemember": [
    "Winett, Richard A.",
    "Bell, Martha Ann",
    "Stephens, Robert S.",
    "Ollendick, Thomas H."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:20Z",
  "date_adate": "2000-05-01",
  "date_available": "2014-03-14T20:11:20Z",
  "date_issued": "2000-04-27",
  "date_rdate": "2001-05-01",
  "date_sdate": "2000-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This experiment tested hypotheses linking the right cerebral regulation of hostility and cardiovascular reactivity.  First, replication of previous research supporting heightened cardiovascular reactivity (mean arterial pressure, systolic blood pressure, diastolic blood pressure, and heart rate) among high-hostile participants was attempted.  Second, dynamic variations in functional cerebral asymmetry in response to pain (cold pressor stressor) and affective verbal learning (positive and negative valenced word lists) were measured. <p>High- and low-hostile participants (n = 64) were identified using the Cook Medley Hostility Scale.  Participants completed either the cold-pressor stressor condition or the no-stress control condition as well as the negative and the positive affective verbal learning test.  Cardiovascular measures (MAP, SBP, DBP, and HR) before and after the stress or no-stress condition and before and after the negative and the positive affective learning tasks were recorded. <p>The results demonstrated that high-hostiles had difficulty processing emotional stimuli.  High-hostiles were reliably impaired in emotional word learning.  Further, results suggested that negative affective learning produced proactive interference for the learning or recall of subsequently presented information.  Positive affective learning produced diametrically opposite effects with retroactive interference for the recall of previously presented information. Also, high-hostiles' cardiovascular reactivity to a physical stressor was independent of the valence of the learning task.  In contrast, low-hostiles' cardiovascular reactivity was valence dependent with activation to both the positive list concurrent with stress and to the negative list concurrent with no stress.   Finally, the results indicated that the effect of the affective learning lists, on the heart, is stress dependent.  Neuropsychological theories of ANS regulation and emotion are discussed in relation to the primary findings and a new model of lateralized regulation is proposed.",
  "description_provenance": [
    "Author Email: bshenal@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: dwh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:20Z (GMT). No. of bitstreams: 1 ETD.PDF: 290644 bytes, checksum: 551e0fe7d51d0174134f14417da2cb74 (MD5)   Previous issue date: 2000-04-27"
  ],
  "handle": "27464",
  "identifier_other": "etd-05012000-12160050",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012000-12160050/",
  "identifier_uri": "http://hdl.handle.net/10919/27464",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Neuropsychology",
    "Lateralization",
    "Cardiovascular Reactivity",
    "Hostility",
    "Stress"
  ],
  "title": "Dynamic Effects of Stress and Hostility: Group Differences in Cardiovascular Regulation and Learning",
  "type": "Dissertation"
}