{
  "contributor_author": "Watkinson, Jonathan I.",
  "contributor_committeechair": "Welbaum, Gregory E.",
  "contributor_committeemember": [
    "Veilleux, Richard E.",
    "Beers, Eric P.",
    "Scheckler, Stephen E.",
    "Miller, Orson K. Jr."
  ],
  "contributor_department": "Horticulture",
  "date_accessioned": "2014-03-14T20:11:20Z",
  "date_adate": "2002-05-01",
  "date_available": "2014-03-14T20:11:20Z",
  "date_issued": "2002-04-23",
  "date_rdate": "2003-05-01",
  "date_sdate": "2002-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The analysis of gene changes associated with formation of the mycorrhizal symbiosis between orchid and fungi could have broad implications for plant pathogen interactions.  Fungi associated with North American terrestrial orchids were once included in the pathogenic genus Rhizoctonia.  This suggests that orchids are able to overcome or utilize normally pathogenic pathways to establish symbioses. A differential display technique was employed to analyze gene changes in orchid in response to a fungus.  Samples of RNA from roots of Cypripedium parviflorum var. pubescens (CyPP) grown in the presence or absence of a mycorrhizal fungus; Thanatephorus pennatus, were analyzed using AFLP differential display.  Forty-four fragments were selected out of 5000 as being differentially expressed, but only 15 sequences were obtained.  Most showed homology to ribosomal genes. Two represented genes believed to be regulated by the mycorrhizal interaction: trehalose-6-phosphate synthase/phosphatase (Tps), which showed down-regulation and nucleotide binding protein (NuBP), which showed up-regulation.  The Tps partial clone identifies 2100 bp at the 3' end of the gene and encodes a protein of 667 amino acids.  The NuBP gene is approximately 1200bp in length and encodes a protein of 352 amino acids.  The Tps gene exists in multiple copies with high expression in roots and low expression in rhizomes and leaves.  The NuBP gene exists as a single copy and has a low level of expression in rhizomes and leaves.  Expression of Tps is induced by sucrose, but reduced by trehalose. Cultivation of CyPP with non-mycorrhizal fungi did not affect expression of Tps or NuBP.  Trehalose induced NuBP expression whereas sucrose did not.  A second species of mycorrhizal fungi induced expression of NuBP but reduced expression of Tps.  Analysis of Tps expression in Arabidopsis was done using promoter:GUS fusions.  The Tps promoter:GUS plants revealed that Tps expression is constitutive in roots. Regulation of Tps driven GUS is expressed throughout seedlings.  GUS was not detected in leaves of older plants but was detected in anthers and stigmatic surfaces of flowers.  Expression of GUS driven by Tps showed a strong wound response and was present in the junction between siliques and pedicels.",
  "description_provenance": [
    "Author Email: jowatki2@vt.edu",
    "Advisor Email: welbaum@vt.edu",
    "Advisor Email: veilleux@vt.edu",
    "Advisor Email: ebeers@vt.edu",
    "Advisor Email: scheckler@vt.edu",
    "Advisor Email: ormiller@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:20Z (GMT). No. of bitstreams: 12 Chpt2.pdf: 99495 bytes, checksum: 1ba8bd161452d5fe53e3603a7495cd10 (MD5) Chpt2-2.pdf: 1125578 bytes, checksum: 4422dc398dc3893792725cdc4da2ef4a (MD5) Conclusion.pdf: 74442 bytes, checksum: 6517344349d4c6ec97e2e84266318054 (MD5) References.pdf: 35693 bytes, checksum: c10e7edbb7042331928d1ec4cc06dc47 (MD5) Chpt3.pdf: 111143 bytes, checksum: a053008e56d64adfa2102d93bcb9fb31 (MD5) Chpt1.pdf: 109726 bytes, checksum: f36942101480d8f4d12f82aeba239542 (MD5) Chpt3-4.pdf: 212637 bytes, checksum: 0ff9a36f4ac43d49cbb380fe20d718de (MD5) Chpt3-3.pdf: 828935 bytes, checksum: a7eb0b3c94e7b9725060d944a0c6f0fe (MD5) Abstract.pdf: 109541 bytes, checksum: c77d0803183628142ed3872d86827907 (MD5) Chpt3-2.pdf: 211207 bytes, checksum: 6871716b9fd13eaa3f4f550bc758f236 (MD5) Chpt4.pdf: 135551 bytes, checksum: a1eafce913cded808089873d324ce700 (MD5) Chpt4-2.pdf: 241294 bytes, checksum: 165208fc2b1c648bc246ba996287e6ec (MD5)   Previous issue date: 2002-04-23"
  ],
  "handle": "27467",
  "identifier_other": "etd-05012002-091107",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012002-091107/",
  "identifier_uri": "http://hdl.handle.net/10919/27467",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chpt2.pdf",
    "Chpt2-2.pdf",
    "Conclusion.pdf",
    "References.pdf",
    "Chpt3.pdf",
    "Chpt1.pdf",
    "Chpt3-4.pdf",
    "Chpt3-3.pdf",
    "Abstract.pdf",
    "Chpt3-2.pdf",
    "Chpt4.pdf",
    "Chpt4-2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "orchid",
    "Arabidopsis thaliana",
    "symbiosis",
    "differential display",
    "sugar",
    "transformation"
  ],
  "title": "Characterization of two genes, trehalose-6-phosphate synthase/phosphatase and nucleotide binding protein, shown to be differentially regulated in roots of Cypripedium parviflorum var. pubescens grown with a mycorrhizal fungus Thanatephorus pennatus",
  "type": "Dissertation"
}