{
  "contributor_author": "Lee, Hyung-Ryong",
  "contributor_committeechair": "Murrmann, Suzanne K.",
  "contributor_committeemember": [
    "Weaver, Pamela A.",
    "Chen, Joseph S.",
    "Singh, Kusum",
    "Murrmann, Kent F."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:11:20Z",
  "date_adate": "2000-05-01",
  "date_available": "2014-03-14T20:11:20Z",
  "date_issued": "2000-04-27",
  "date_rdate": "2001-05-01",
  "date_sdate": "2000-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to identify the impact of interpersonal working relationships on employees' justice perceptions and the effects of those perceptions on employees' work-related attitudes and behavior in the hospitality industry. This study examined the mediating role played by distributive and procedural justice in linking leader-member exchange and job satisfaction, organizational commitment, and turnover intentions in the hospitality industry. The model was evaluated using structural equation modeling (SEM). <p>The results indicated that distributive justice had a direct positive influence on job satisfaction and was negatively related to turnover intentions. Distributive justice was also found to have a strong impact on procedural justice. Procedural justice had a direct positive influence on job satisfaction. However, procedural justice was negatively related to organizational commitment, and was positively associated with turnover intentions. Thus, distributive justice played a more vital role in employees' work-related outcomes than did procedural justice.  <p>This study also indicated empirical evidence of the impact of interpersonal working relationships on employees' justice perceptions. That is, the quality of interpersonal working relationships promoted employees' perceptions of fairness. Therefore, both distributive and procedural justice played a vital mediating role in the relationships among LMX, and job satisfaction, organizational commitment, and turnover intentions. <p>This study provides guidelines to help managers better understand how to reduce employee turnover, increase job satisfaction and organizational commitment, and make better decisions about outcomes and procedures for their employees.",
  "description_provenance": [
    "Author Email: hylee5@vt.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: weaver@vt.edu",
    "Advisor Email: joechen@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: murrmann@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:20Z (GMT). No. of bitstreams: 1 dissertation.pdf: 432380 bytes, checksum: 8c5b9e8d4733e9b66e297787a9a3af3b (MD5)   Previous issue date: 2000-04-27"
  ],
  "handle": "27465",
  "identifier_other": "etd-05012000-14210002",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012000-14210002/",
  "identifier_uri": "http://hdl.handle.net/10919/27465",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Organizational Commitment",
    "Turnover Intentions",
    "Job Satisfaction",
    "Leader-Member Exchange",
    "Organizational Justice"
  ],
  "title": "An Empirical Study of Organizational Justice as a Mediator in the Relationships among Leader-Member Exchange and Job Satisfaction, Organizational Commitment, and Turnover intentions in the Lodging Industry",
  "type": "Dissertation"
}