{
  "contributor_author": "Morse, Ricardo Stuart",
  "contributor_committeechair": "Dudley, Larkin S.",
  "contributor_committeemember": [
    "Wamsley, Gary L.",
    "White, Orion F. Jr.",
    "Rees, Joseph V.",
    "Pethtel, Ray D."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:11:21Z",
  "date_adate": "2004-05-12",
  "date_available": "2014-03-14T20:11:21Z",
  "date_issued": "2004-04-29",
  "date_rdate": "2005-05-12",
  "date_sdate": "2004-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Community renewal is a dominant theme in American society today. It has been said that public administration could and should be a leader in the community renewal movement, yet for the most part the field of public administration fails to â  getâ   community. This study advances and explores a concept of community learning as part of a broader effort to better understand what a community perspective means for public administration theory and practice. The contributions of this study are two-fold. First, a concept of community learning is drawn from a variety of literature streams that share an ethos of collaborative pragmatism. Community learning occurs when the knowledge created in the integrative â  community processâ   is fed-forward and embedded at the level of community structure. Furthermore, a â  learning communityâ   is found where the community learning process is institutionalized at the level of community structure. While community learning is a term being used to some degree in the field of community development, a concept of how communities might learn has yet to be offered. Thus, the conceptualization offered here seeks to fill this gap in the literature.  This study also explores the community learning concept empirically in the context of an action research project in Wytheville, Virginia. Here participants worked with a Virginia Tech research team to better understand their community and develop a unified â  visionâ   for the communityâ  s future. The study revealed that the collective or collaborative learning of the â  community processâ   can occur over time and also in the form of punctuated group â  a-haâ   moments. In either case, the learning process is one where new knowledge is created in the form of new or altered shared meaning or new ideas. This learning was fed-forward to the community level to become community learning in three ways: 1) as the learning took place in the community field, meaning the participants of the learning process represented the different institutions that make up community structure; 2) through the integrative medium of local media outlets; and 3) through formal and informal processes of knowledge transfer from the group to community level, where the community level was represented by a citizens committee.  As communities institutionalize learning processes they can be said to be â  learning communities.â   Evidence from the Wytheville study provides insights into how this might happen. The implications for the practice of a â  new public serviceâ   are explored as well as future areas of research relevant to the community learning approach. The study concludes by suggesting what a community perspective for public administration might mean as community learning is a concept based in this perspective.",
  "description_provenance": [
    "Author Email: rmorse@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: mcswite@sbcglobal.net",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: rpethtel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:21Z (GMT). No. of bitstreams: 2 R_Morse_ETD_2004a.pdf: 1501550 bytes, checksum: 18dfbf60b6411b0aeb018d67cf0e9cea (MD5) R_Morse_CV_2004.pdf: 34577 bytes, checksum: 44c3c66af01076c5915424881dfbcaaf (MD5)   Previous issue date: 2004-04-29"
  ],
  "handle": "27472",
  "identifier_other": "etd-05012004-075658",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012004-075658/",
  "identifier_uri": "http://hdl.handle.net/10919/27472",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "R_Morse_ETD_2004a.pdf",
    "R_Morse_CV_2004.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "collaboration",
    "dialogue",
    "community development",
    "Participation",
    "community learning",
    "public administration"
  ],
  "title": "Community Learning: Process, Structure, and Renewal",
  "type": "Dissertation"
}