{
  "contributor_author": "Waller, George Darryl",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Martin, Rosalie Marie",
    "Craig, James R.",
    "Hill, Christine"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:22Z",
  "date_adate": "2007-05-07",
  "date_available": "2014-03-14T20:11:22Z",
  "date_issued": "2007-03-29",
  "date_rdate": "2009-05-07",
  "date_sdate": "2007-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> For several decades music educators have proposed that the study of music has a significant impact on student academic achievement, attendance rates, and student conduct. In an era of higher student and teacher accountability, increasing budget cuts, the federal No Child Left Behind Act (NCLB), and stringent state standards of learning, a number of educators have argued that education in music can boost test scores, attendance, attitudes toward school, reduce discipline referrals, and increase overall academic achievement.  </p> <p>  The purpose of this study was to quantify general education claims by examining high school academic achievement data, attendance rates, and student conduct of the 2006 graduating class in one Southeast Virginia school division.  </p> <p> In addition, this study briefly explores the impact that music education has on the human brain and on academic achievement at the elementary school and secondary school levels. Moreover, influences that integrating music has on academic achievement in general education courses, arts integration programs, and elements of an effective music education program are explored. Specific research studies provide evidence to support key concepts and the need for additional research. </p> <p> The research design includes the independent variables: subject and number of years enrolled in formal music courses or no formal music courses, gender, ethnicity, and enrollment in formal music courses or no formal music courses in high school, grades nine through twelve. The dependent variables include: academic achievement as measured by grade twelve weighted cumulative grade point average (GPA), attendance rate as measured by the number of absences in grade twelve, and student conduct as measured by the number of discipline referrals in grade nine through grade twelve. </p> <p> Four research questions were used to explore academic achievement, attendance rate, and student conduct with regard to music or no music courses taken in grades nine through twelve. Ethnicity and gender were reported using the common dependent variables among participants in three populations â   entire study population, music population, and non music population. </p> <p> Conclusions were based upon sophisticated statistical tests including descriptive and inferential statistics, correlations, analysis of variance (ANOVA), and regression statistics. These tests confirmed the four research questions and null hypotheses that music students out perform their non music counterparts in academic achievement, attendance rate, and student conduct. Although the studied school division does not distinguish between excused and unexcused absences, music students had fewer days absent than non music students.</p> <p>",
  "description_provenance": [
    "Author Email: darrylwaller@cox.net",
    "Advisor Email: rowhite@vt.edu",
    "Advisor Email: jimcraig@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: christine.hill@nn.k12.va.us",
    "Made available in DSpace on 2014-03-14T20:11:22Z (GMT). No. of bitstreams: 1 WALLERDissertationFINALDEFENSE2.pdf: 4259728 bytes, checksum: 50023b166db3769a91782da174d3bb2d (MD5)   Previous issue date: 2007-03-29"
  ],
  "handle": "27477",
  "identifier_other": "etd-05012007-153415",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012007-153415/",
  "identifier_uri": "http://hdl.handle.net/10919/27477",
  "publisher": "Virginia Tech",
  "relation_haspart": "WALLERDissertationFINALDEFENSE2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Attendance Rate",
    "Music Education",
    "Student Conduct",
    "Academic Achievement",
    "Secondary Education",
    "Brain Research (The Mozart Effect)"
  ],
  "title": "The Impact of Music Education on Academic Achievement, Attendance Rate, and Student Conduct on the 2006 Senior Class in One Southeast Virginia Public School Division",
  "type": "Dissertation"
}