{
  "contributor_author": "Smith, Juliann",
  "contributor_committeechair": "Bodenhorn, Nancy E.",
  "contributor_committeemember": [
    "Hutchins, David E.",
    "Forrest, Alan W.",
    "Allen, Katherine R.",
    "Getz, Hilda M."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:11:22Z",
  "date_adate": "2004-05-06",
  "date_available": "2014-03-14T20:11:22Z",
  "date_issued": "2004-04-09",
  "date_rdate": "2004-05-06",
  "date_sdate": "2004-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ASSESSING PROSPECTIVE STUDENTS FOR MASTERâ  S LEVEL CACREP COUNSELING PROGRAMS: EVALUATION OF PERSONAL-EMOTIONAL CHARACTERISTICS<p>  by<p>  Juliann Smith, LPC, NCC<p>  Committee Chair:  Nancy Bodenhorn<p>  Counselor Education<p>  (ABSTRACT)<p>  The purpose of this study consisted of three main components: 1) to identify effective counselor characteristics in the literature; 2) to describe existing admission requirements of counseling programs; and, if a need was determined, 3) to develop a framework for a standard set of admission requirements, balanced between cognitive-behavioral characteristics and personal-emotional characteristics, to more thoroughly assess prospective masterâ  s level counseling students.<p> This study discusses the typical admission requirements of master's level CACREP (The Council for Accreditation of Counseling and Related Educational Programs) counseling programs and what the research indicates are characteristics of effective counselors. A literature review of effective counselor characteristics and graduate admission requirements was conducted, CACREP guidelines were examined, and admission requirements and procedures for all 129 CACREP counselor education programs were analyzed. The findings from the literature review were then compared with the data collected and analyzed from existing masterâ  s level CACREP counseling programs to determine gaps between the literature-identified characteristics of effective counselors and current admission criteria of CACREP programs. Follow-up telephone interviews with a faculty of leadership stature from a sample of 20 CACREP counseling programs were conducted. After determining a need, information collected was used to develop a framework for a standard set of admission requirements.<p>    Results indicated that currently, a) there is no framework for a standard set of admission requirements for assessing prospective students for masterâ  s level counseling programs that identify personal-emotional characteristics, b) there are gaps between what the literature identifies as effective counselor characteristics and what is typically assessed during admission, c) an agreement exists that the counseling profession must do a better job of gate-keeping, and d) that a framework of admission requirements is needed by counselor educators to assist in a more thorough screening and examination of personal characteristics of prospective students. Finally, e) this research established a foundation for this framework of a standard set of admission requirements that could be used by faculty to more exhaustively assess prospective masterâ  s level counseling students.",
  "description_provenance": [
    "Author Email: jusmith7@vt.edu",
    "Advisor Email: dhutch@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: aforrest@radford.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:22Z (GMT). No. of bitstreams: 17 15APPENDIXE_Question8AFAR.pdf: 242264 bytes, checksum: d39c6033f5679b586aa6a05e21e4fb7c (MD5) 01TitlePage.pdf: 14431 bytes, checksum: 402c8d352314c7cd98cc9da8ca282bf3 (MD5) 02Abstract.pdf: 15798 bytes, checksum: 94a674c253635a2bb5181d445b756f78 (MD5) 03Acknowledgments.pdf: 26915 bytes, checksum: c3cb36a5f6e8a2d2801550b49c94dbfd (MD5) 16APPENDIXF_Question8PFAR.pdf: 224359 bytes, checksum: 59c3049bc648f1548c2c984e6ead503a (MD5) 17VITAE.pdf: 77445 bytes, checksum: 54882ace71378f7157dd5e79901a7bee (MD5) 11APPENDIXA_ChartedECCs_Refs.pdf: 44630 bytes, checksum: d31cb695ab663861c03f980723b6bde9 (MD5) 10References.pdf: 80210 bytes, checksum: c28a446d27e750a8af8c7e94fe5c6bae (MD5) 13APPENDIXC_ParticipantInformedConsent.pdf: 25249 bytes, checksum: 8288e66ffaa7870c28d3d63677192960 (MD5) 07ChapterThree.pdf: 72485 bytes, checksum: 6fcac88d877d09d72a7767a7d46521a8 (MD5) 08ChapterFour.pdf: 163732 bytes, checksum: 47fd0ad134da21ae8f05642d0abdc87e (MD5) 09ChapterFive.pdf: 85091 bytes, checksum: 3d14e413e88d1394c5814cc4a619bbdf (MD5) 05ChapterOne.pdf: 88382 bytes, checksum: e653ffc4de41851063d81e7c38140e09 (MD5) 04TableofContents.pdf: 35802 bytes, checksum: 1ed0dcd34d4f2bfd83ad2cf4f36034fc (MD5) 12APPENDIXB_FollowupProtocol.pdf: 51741 bytes, checksum: a8c0c34b9f8650447b2a754122ff2cc7 (MD5) 06ChapterTwo.pdf: 103636 bytes, checksum: b80c105b61b8ed6bcca1508373e3d9c1 (MD5) 14APPENDIXD_GrpdResponsesofProgs.pdf: 292916 bytes, checksum: 89783d7d3868a492540488914cdac40b (MD5)   Previous issue date: 2004-04-09"
  ],
  "handle": "27473",
  "identifier_other": "etd-05012004-220548",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012004-220548/",
  "identifier_uri": "http://hdl.handle.net/10919/27473",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "15APPENDIXE_Question8AFAR.pdf",
    "01TitlePage.pdf",
    "02Abstract.pdf",
    "03Acknowledgments.pdf",
    "16APPENDIXF_Question8PFAR.pdf",
    "17VITAE.pdf",
    "11APPENDIXA_ChartedECCs_Refs.pdf",
    "10References.pdf",
    "13APPENDIXC_ParticipantInformedConsent.pdf",
    "07ChapterThree.pdf",
    "08ChapterFour.pdf",
    "09ChapterFive.pdf",
    "05ChapterOne.pdf",
    "04TableofContents.pdf",
    "12APPENDIXB_FollowupProtocol.pdf",
    "06ChapterTwo.pdf",
    "14APPENDIXD_GrpdResponsesofProgs.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Effective Counselor Characteristics",
    "Admission Requirements",
    "Personal Emotional",
    "Assessing",
    "Graduate Students"
  ],
  "title": "Assessing Prospective Students for Master's Level CACREP Counseling Programs: Evaluation of Personal-Emotional Characteristics",
  "type": "Dissertation"
}