{
  "contributor_author": "Dika, Sandra",
  "contributor_committeechair": "Singh, Kusum",
  "contributor_committeemember": [
    "Garrison, James W.",
    "Skaggs, Gary E.",
    "Allen, Katherine R.",
    "Janosik, Steven M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:21Z",
  "date_adate": "2003-05-02",
  "date_available": "2014-03-14T20:11:21Z",
  "date_issued": "2003-04-29",
  "date_rdate": "2004-08-28",
  "date_sdate": "2003-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study seeks to offer a meaningful statement about the relative importance of self-processes and activated social capital in the process that links high school students and educational outcomes. The conceptual model for the study draws on the large and diverse body of research that aims to understand the process and effects of the interaction of the person and his or her environment. It is hypothesized that adaptive self-processes and social capital are positively related to school engagement, educational aspirations, and actual performance in school; and, that these factors mediate the effects of family background and other potential social capital on educational outcomes. The data for this study were obtained from a sample of N=1,176 in grades 9-12 from three school divisions in Virginia. Students completed the School Relationships and Experiences Survey (SRES), an instrument designed for this study. The study uses structural equation modeling (SEM) to model the relationships between the variables of interest.   Data were analyzed using LISREL 8.3 (Jöreskog & Sörbom, 1993). The covariance structure models tested include both single-indicator and multiple-indicator constructs. The analysis follows the two-step procedure suggested by Anderson and Gerbing (1988). First, a measurement model was tested using confirmatory factor analysis to develop a model with acceptable fit to the data. In step two, the theoretical model of interest was specified as an a priori model. This theoretical model was then tested and revised until a theoretically meaningful and statistically acceptable model was found.   In conclusion, the results of the analyses are discussed, and possible explanations for the results are proposed. Directions for future research are outlined, including the need for cross-validation of this model on additional samples of high school students. Social capital has previously been conceptualized primarily as family resources and parent-child relationships. This study provides promising initial evidence that activated social capital (education-related support received by adolescents from the broader social network) has stronger and more meaningful effects on academic engagement and other educational outcomes than the more passive indicators of social capital used in previous research.  This work was supported by a doctoral fellowship from the Social Sciences and Humanities Research Council of Canada (SSHRC) and a grant from the ASPIRES program at Virginia Tech.",
  "description_provenance": [
    "Author Email: sdika@vt.edu",
    "Advisor Email: wesley@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:21Z (GMT). No. of bitstreams: 13 chapter1.pdf: 142378 bytes, checksum: dea5596e63776324512164a58d310db9 (MD5) VITA.pdf: 39370 bytes, checksum: 549f99df852a2e85df64da6f9920fa03 (MD5) chapter2.pdf: 181270 bytes, checksum: e7f992f859d0dbf4cdca064788a7f4ad (MD5) appendix_e.pdf: 269551 bytes, checksum: f07f98357033650b29622da7bc7ce7a4 (MD5) etd.pdf: 191191 bytes, checksum: 9ce505ecca7431d0edb76f3c56d6f27a (MD5) chapter4.pdf: 1710051 bytes, checksum: 904a7734737515e40cc2afb8bfa7f3ac (MD5) references.pdf: 151195 bytes, checksum: 8cbd4e4086ce5268d3a2f095bb49f855 (MD5) appendix_d.pdf: 63050 bytes, checksum: 260c39a4584358dcd3a6cad45e021693 (MD5) chapter3.pdf: 140369 bytes, checksum: b7bac651e797ee8c5a56a956bc1dfdb9 (MD5) appendix_a.pdf: 220648 bytes, checksum: 40e37c20261f00acdfa19a1a8e3b4f76 (MD5) appendix_c.pdf: 84804 bytes, checksum: e66aade91a5a33ba48b86b0bc3c2f60b (MD5) chapter5.pdf: 155744 bytes, checksum: 5c582ec477ba9c263877923615fd2763 (MD5) appendix_b.pdf: 894716 bytes, checksum: eeb355d3866e8979eb895c39d0ab17d0 (MD5)   Previous issue date: 2003-04-29"
  ],
  "handle": "27470",
  "identifier_other": "etd-05012003-162439",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012003-162439/",
  "identifier_uri": "http://hdl.handle.net/10919/27470",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chapter1.pdf",
    "VITA.pdf",
    "chapter2.pdf",
    "appendix_e.pdf",
    "etd.pdf",
    "chapter4.pdf",
    "references.pdf",
    "appendix_d.pdf",
    "chapter3.pdf",
    "appendix_a.pdf",
    "appendix_c.pdf",
    "chapter5.pdf",
    "appendix_b.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "high school students",
    "social capital",
    "structural equation modeling",
    "engagement"
  ],
  "title": "The effects of self-processes and social capital on the educational outcomes of high school students.",
  "type": "Dissertation"
}