{
  "contributor_author": "Boyle, Joseph Edward",
  "contributor_committeechair": "Bryant, Clifton D.",
  "contributor_committeemember": [
    "Bailey, Carol A.",
    "Fuhrman, Ellsworth R.",
    "Shoemaker, Donald J."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:11:22Z",
  "date_adate": "2007-05-11",
  "date_available": "2014-03-14T20:11:22Z",
  "date_issued": "2007-04-19",
  "date_rdate": "2007-05-11",
  "date_sdate": "2007-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation attempts to explore the nature of a particular food consumption pattern using a number of different deviance theories in order to outline the career path of vegetarianism. Using semi-structured interviews with 45 practicing vegetarians from two regions of the United States, the career path of the vegetarians was developed around David Matzaâ  s (1969) theory of becoming deviant. Within each stage of Matzaâ  s classic work, more specific theories were applied to explain the friction between vegetarianism and the more socially-accepted practice of meat eating within the United States. The framework of the stages includes the affinity for, affiliation with, and signification of vegetarian ideology and practice. Each stage within the theory is also a stage in the development of the vegetarian identity. The more specific theories utilized to explain phenomena within each particular stage attempt to show a progression from initially being interested in the ideals and practice of vegetarianism to becoming and verbalizing as a mature, practicing vegetarian. Finally, the vegetarians interviewed were asked to give the prognosis for the future of vegetarianism.",
  "description_provenance": [
    "Author Email: crimguy3434@verizon.net",
    "Advisor Email: cbryant@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: shoemake@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:22Z (GMT). No. of bitstreams: 1 Boyle_Sociology_Dissertation_May071.pdf: 640125 bytes, checksum: 4871d106a0c3e3921af597071a3ddedf (MD5)   Previous issue date: 2007-04-19"
  ],
  "handle": "27476",
  "identifier_other": "etd-05012007-104133",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012007-104133/",
  "identifier_uri": "http://hdl.handle.net/10919/27476",
  "publisher": "Virginia Tech",
  "relation_haspart": "Boyle_Sociology_Dissertation_May071.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "accounts",
    "deviant religious conversion",
    "conversion models",
    "integrated theory",
    "deviance",
    "vegetarianism",
    "social learning theory"
  ],
  "title": "Becoming Vegetarian: An Analysis of the Vegetarian Career Using an Integrated Model of Deviance",
  "type": "Dissertation"
}