{
  "contributor_author": "Delabbio, Juliette Lee",
  "contributor_committeecochair": [
    "Johnson, Gerald R.",
    "Murphy, Brian R."
  ],
  "contributor_committeemember": [
    "Woart, Anthony",
    "McMullin, Steve L.",
    "Hallerman, Eric M."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:11:21Z",
  "date_adate": "2003-05-06",
  "date_available": "2014-03-14T20:11:21Z",
  "date_issued": "2003-04-21",
  "date_rdate": "2004-05-06",
  "date_sdate": "2003-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In aquaculture, biosecurity consists of policies, procedures and measures used to prevent or control the spread of fish disease. The focus of this research was the practice of biosecurity in the recirculation sector of finfish aquaculture in the United States and Canada.  Specifically, this research: 1) identified and characterized finfish recirculation facilities in the United States and Canada; 2) assessed biosecurity utilization in these facilities; 3) examined the relationship between biosecurity utilization and fish culture variables; 4) examined the relationship between biosecurity utilization and socio-demographics of personnel operating these facilities; 5) described the attitudes, perceptions and beliefs about fish disease and biosecurity utilization of personnel, and 6) described the lived-experience of biosecurity practice of workers at these facilities.  This research was comprised of two separate components using different methodologies.  The first component was a self-administered, mail-back questionnaire sent to the managers of 152 finfish recirculation facilities in the United States and Canada in fall of 2001.  The second component was a series of in-depth interviews conducted with 31 workers at 12 salmonid recirculation facilities in spring of 2002.  Grounded theory methodology was used for the interview process and subsequent data analysis for the second component.  An 86% response rate was achieved in the mail survey.  Aquaculture activities using recirculation technologies were quite varied in purpose of operation, size of production, and life stages held.  Four groups of fishes dominated the recirculation sector and constituted the primary production of over 45% of this sector of aquaculture.  This sector was heavily reliant on ground water resources.  Forty-one percent of finfish recirculation facilities did not have a secondary source of water supply.   Biosecurity utilization is not homogenous within the recirculation sector.  Frequency of biosecurity utilization was related to primary water source, type of fish grown, purpose of the operation and country of operation.  Biosecurity was an important concern of facility operators, although among facility operators there were differences in perception of disease risk and benefits of biosecurity utilization.  Analysis of results of this study resulted in formulation of the Practice of Biosecurity Theory (PBT).  The theory describes a three-phase process in the practice of biosecurity: (1) orientation, when workers begin their initiation into the practice of biosecurity; (2) routine, when practice of biosecurity becomes a habitual behavior; and (3) thoughtful approach, where knowledge of fish health needs and biosecurity practices are integrated into a repertoire of biosecurity strategies that are situation- and site-specific.  The practice of biosecurity was affected by three environmental conditions; personal biography, managementâ  s role, and peer pressure.    This research gives educators, extension agents, researchers and government policy-makers a quantitative description of finfish recirculation aquaculture in the United States and Canada.  It also provides baseline information on biosecurity utilization in recirculation aquaculture.  This research provides insight into the human dimensions aspect of the practice of biosecurity and, therefore, may have application to other areas of agri-business.",
  "description_provenance": [
    "Author Email: jdelabbi@hotmail.com",
    "Advisor Email: awoart@bluefield,.wvnet.edu",
    "Advisor Email: Gjohnson@upei.ca",
    "Advisor Email: Murphybr@vt.edu",
    "Advisor Email: smcmulli@vt.edu",
    "Advisor Email: ehallerm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:21Z (GMT). No. of bitstreams: 1 Delabbio.pdf: 1087993 bytes, checksum: 0303bf8f25e1b1b10299b9cee5afa010 (MD5)   Previous issue date: 2003-04-21"
  ],
  "handle": "27471",
  "identifier_other": "etd-05012003-232119",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012003-232119/",
  "identifier_uri": "http://hdl.handle.net/10919/27471",
  "publisher": "Virginia Tech",
  "relation_haspart": "Delabbio.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "aquaculture",
    "Human Dimensions",
    "Attitudes",
    "United States",
    "finfish",
    "Recirculation",
    "Beliefs",
    "Canada",
    "biosecurity"
  ],
  "title": "Biosecurity in the Recirculation Sector of Finfish Aquaculture in the United States and Canada",
  "type": "Dissertation"
}