{
  "contributor_author": "Mahmoud, Morsi Mohamed",
  "contributor_committeechair": "Clark, David E.",
  "contributor_committeemember": [
    "Viehland, Dwight D.",
    "Suchicital, Carlos T. A.",
    "Pickrell, Gary R.",
    "Lu, Guo-Quan"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:11:23Z",
  "date_adate": "2007-05-04",
  "date_available": "2014-03-14T20:11:23Z",
  "date_issued": "2007-04-24",
  "date_rdate": "2007-05-04",
  "date_sdate": "2007-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The lithium disilicate (LS2) glass system provides the basis for a large number of useful glass-ceramic products. Microwave processing of materials such as glass-ceramics offers unique benefits over conventional processing techniques. Variable frequency microwave (VFM) processing is an advanced processing technique developed to overcome the hot spot and the arcing problems in microwave processing. In general, two main questions are addressed in this dissertation: 1-\tHow does microwave energy couple with a ceramic material to create heat? and, 2-\tIs there a â  microwave effectâ   and if so what are the possible explanations for the existence of that effect? The results of the present study show that VFM processing was successfully used to crystallize LS2 glass at a frequency other than 2.45 GHz and without the aid of other forms of energy (hybrid heating). Crystallization of LS2 glass using VFM heating occurred in a significantly shorter time and at a lower temperature as compared to conventional heating.  Furthermore, the crystallization mechanism of LS2 glass in VFM heating was not exactly the same as in conventional heating. Although LS2 crystal phase (Orthorhombic Ccc2) was developed in the VFM crystallized samples as well as in the conventionally crystallized samples as x-ray diffraction (XRD) confirmed, the structural units of SiO4 tetrahedra (Q species) in the VFM crystallized samples were slightly different than the ones in conventionally crystallized samples as the Raman spectroscopy revealed. Moreover, the observed reduction in the crystallization time and apparent temperature in addition to the different crystallization mechanism observed in the VFM process both provided experimental evidence to support the presence of the microwave effect in the LS2 crystallization process. Also, the molecular orbital model was successfully used to predict the microwave absorption in LS2 glass and glass-ceramic. This model was consistent with experiments and indicated that microwave-material interactions were highly dependent on the structure of the material. Finally, a correlation between the Fourier transform infrared reflectance spectroscopy (FTIRRS) peak intensities and the volume fraction of crystals in partially crystallized LS2 glass samples was established.",
  "description_provenance": [
    "Author Email: momahmou@vt.edu",
    "Advisor Email: viehland@mse.vt.edu",
    "Advisor Email: dclark@vt.edu",
    "Advisor Email: ctas@vt.edu",
    "Advisor Email: pickrell@vt.edu",
    "Advisor Email: gqlu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:23Z (GMT). No. of bitstreams: 1 Morsidissertationfinal3.pdf: 10708995 bytes, checksum: 4063a0b786b29300340fceedf49d9c28 (MD5)   Previous issue date: 2007-04-24"
  ],
  "handle": "27478",
  "identifier_other": "etd-05012007-164214",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012007-164214/",
  "identifier_uri": "http://hdl.handle.net/10919/27478",
  "publisher": "Virginia Tech",
  "relation_haspart": "Morsidissertationfinal3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Variable frequency microwave processing",
    "Crystallization",
    "Glass-ceramic",
    "Lithium disilicate glass",
    "Microwave-material interactions"
  ],
  "title": "Crystallization of Lithium Disilicate Glass Using Variable Frequency Microwave Processing",
  "type": "Dissertation"
}