{
  "contributor_author": "Sullivan, Sean Robert",
  "contributor_committeechair": "Roberts-Wollmann, Carin L.",
  "contributor_committeemember": [
    "Thangjitham, Surot",
    "Sotelino, Elisa D.",
    "Rojiani, Kamal B.",
    "Davis, Rodney T.",
    "Cousins, Thomas E."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:11:23Z",
  "date_adate": "2007-05-02",
  "date_available": "2014-03-14T20:11:23Z",
  "date_issued": "2007-04-27",
  "date_rdate": "2007-05-02",
  "date_sdate": "2007-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A bridge with precast bridge deck panels was built at the Virginia Tech Structures Laboratory to examine constructability issues, creep and shrinkage behavior, and strength and fatigue performance of transverse joints, different types of shear connectors, and different shear pocket spacings.  The bridge consisted of two AASHTO type II girders, 40 ft long and simply supported, and five precast bridge deck panels.  Two of the transverse joints were epoxied male-female joints and the other two transverse joints were grouted female-female joints.  Two different pocket spacings were studied: 4 ft pocket spacing and 2 ft pocket spacing.  Two different shear connector types were studied:  hooked reinforcing bars and a new shear stud detail that can be used with concrete girders.   The construction process was well documented.  The change in strain in the girders and deck was examined and compared to a finite element model to examine the effects of differential creep and shrinkage.  After the finite element model verification study, the model was used to predict the long term stresses in the deck and determine if the initial level of post-tensioning was adequate to keep the transverse joints in compression throughout the estimated service life of the bridge.  Cyclic loading tests and shear and flexural strength tests were performed to examine performance of the different pocket spacings, shear connector types and transverse joint configurations.  A finite element study examined the accuracy of the AASHTO LRFD shear friction equation for the design of the horizontal shear connectors. The initial level of post-tensioning in the bridge was adequate to keep the transverse joints in compression throughout the service life of the bridge.  Both types of pocket spacings and shear connectors performed exceptionally well.  The AASHTO LRFD shear friction equation was shown to be applicable to deck panel systems and was conservative for determining the number of shear connectors required in each pocket.  A recommended design and detailing procedure was provided for the shear connectors and shear pockets.",
  "description_provenance": [
    "Author Email: sullivas@vt.edu",
    "Advisor Email: surot@vt.edu",
    "Advisor Email: sotelino@vt.edu",
    "Advisor Email: krojiani@vt.edu",
    "Advisor Email: Rodney.Davis@VDOT.Virginia.gov",
    "Advisor Email: wollmann@vt.edu",
    "Advisor Email: tcousins@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:23Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 8187995 bytes, checksum: 37e6d0574f28d7408646a325ab87fd02 (MD5)   Previous issue date: 2007-04-27"
  ],
  "handle": "27479",
  "identifier_other": "etd-05012007-174012",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012007-174012/",
  "identifier_uri": "http://hdl.handle.net/10919/27479",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Bridge Deck",
    "Post-Tensioning",
    "Deck Panels",
    "Shear Connectors"
  ],
  "title": "Construction and Behavior of Precast Bridge Deck Panel Systems",
  "type": "Dissertation"
}