{
  "contributor_author": "McFadden, Joseph William",
  "contributor_committeechair": "Corl, Benjamin A.",
  "contributor_committeemember": [
    "McGilliard, Michael L.",
    "Herbein, Joseph H. Jr.",
    "Hanigan, Mark D."
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:11:23Z",
  "date_adate": "2009-05-05",
  "date_available": "2014-03-14T20:11:23Z",
  "date_issued": "2009-04-27",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Consumer demand for milk fat has declined due to the increased risk of cardiovascular disease associated with consuming a high saturated fat diet.  Milk fat synthesis is energetically expensive for the dairy cow, especially during early lactation or periods of poor nutrition.  Thus, manipulating milk fat production and composition may promote the synthesis of more market-valuable milk components and improve energy utilization in dairy cows during periods of increased energy demand.  Therefore, the objective of the present studies was to identify molecular proteins that regulate fatty acid synthesis in bovine mammary epithelial cells.  The regulation of lipogenic genes including acetyl-CoA carboxylase (ACC) and fatty acid synthase (FAS) is controlled by transcription factors including sterol regulatory element binding protein-1 (SREBP1) and liver X receptor (LXR).  In vivo, diet-induced milk fat depression or supplementing diets with polyunsaturated fatty acids inhibits milk fat synthesis by regulating SREBP1 expression.  Results confirm that polyunsaturated fatty acids inhibit fatty acid synthesis in bovine mammary epithelial cells by regulating the expression of SREBP1.  In hepatocytes, LXR can regulate the transcription of SREBP1 in addition to ACC and FAS.  Results confirm that LXR activation enhanced synthesis of fatty acids in bovine mammary epithelial cells by promoting the transcription of FAS and SREBP1.  Activation of LXR was unable to prevent the inhibitory effect of polyunsaturated fatty acids on fatty acid synthesis.  In the lactating mammary gland, LXR may contribute to the synthesis of fatty acids by regulating the expression of SREBP1.  In addition to modifying the expression of lipogenic genes, some enzymes can be phosphorylated by AMP-activated protein kinase (AMPK), an energy-sensing protein, inhibiting their activity.  Presence of AMPK mRNA was identified in bovine mammary epithelial cells and activation of AMPK dramatically decreased fatty acid synthesis in bovine mammary epithelial cells.  In the lactating mammary gland, AMPK may sense energy availability and regulate milk fat synthesis to control energy utilization.  Identification of SREBP1, LXR, and AMPK as regulators of fatty acid synthesis in bovine mammary epithelial cells may lead to the development of technologies allowing dairy producers to modify milk fat production and composition to meet consumer demand and maximize profitability.",
  "description_provenance": [
    "Author Email: jwm@vt.edu",
    "Advisor Email: mcg@vt.edu",
    "Advisor Email: herbeinj@vt.edu",
    "Advisor Email: bcorl@vt.edu",
    "Advisor Email: mhanigan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:23Z (GMT). No. of bitstreams: 1 JosephWMcFaddenDissertation.pdf: 830223 bytes, checksum: bc74043d179ac901ea22858f7cedc578 (MD5)   Previous issue date: 2009-04-27"
  ],
  "handle": "27483",
  "identifier_other": "etd-05012009-113142",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012009-113142/",
  "identifier_uri": "http://hdl.handle.net/10919/27483",
  "publisher": "Virginia Tech",
  "relation_haspart": "JosephWMcFaddenDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fat synthesis",
    "bovine mammary epithelial cell"
  ],
  "title": "Identification of molecular targets regulating fatty acid synthesis in bovine mammary epithelial cells",
  "type": "Dissertation"
}