{
  "contributor_author": "Ballentine, Howard Monroe",
  "contributor_committeechair": "Janosik, Steven M.",
  "contributor_committeemember": [
    "Hirt, Joan B.",
    "Ridgwell, Diana M.",
    "Creamer, Elizabeth G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:24Z",
  "date_adate": "2010-05-20",
  "date_available": "2014-03-14T20:11:24Z",
  "date_issued": "2010-04-20",
  "date_rdate": "2010-05-20",
  "date_sdate": "2010-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Persistence is an important issue in higher education (Tinto, 1987a). Although social and economic benefits of a college education are well documented (Baum & Ma, 2007; Institute for Higher Education Policy, 2004), during the last 100 years the college graduation rate has remained at approximately 50% (Education Policy Institute, 2004). While prior academic achievement has proven to be a successful predictor of success in college (Camara & Echtnernacht, 2000; Sadler, Cohen, & Kockesen, 1997; Tinto, 1993), it does not account for all the variability in student retention. Research has shown that other factors, including social adaptation, physical fitness, and emotional stability can contribute to whether an individual continues to persist past the first year of college (Astin, 1993; McClanahan, 2004; Tinto, 1987b). \tThe purpose of this study was to examine the relationship between self-reported wellness and academic success in first-year health science college students. In addition the study sought to determine if the relationship between wellness and academic success differs by gender, academic program, or ethnicity. Also examined was whether the factors of wellness could be used to predict academic success. Wellness was defined using the Myers and Sweeney (2005) conceptual framework, as measured in a series of constructs, including the coping self, creative self, essential self, physical self, social self and an overall wellness score. Academic success was defined as first semester grade point average. The study also controlled for high school grade point average (HSGPA) and scholastic aptitude test score (SAT) as factors of prior academic achievement that may affect academic success in college.\t \tThe findings suggest that the impact of wellness differs by ethnicity and academic program. In addition, certain factors of wellness can be used to help predict academic success in the first semester of college. Finally, overall wellness had little if any bearing on academic success in first-time, first-year students.",
  "description_provenance": [
    "Author Email: hballent@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: dridgwel@vt.edu",
    "Advisor Email: creamere@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:24Z (GMT). No. of bitstreams: 1 Ballentine_HM_D_2010.pdf: 327244 bytes, checksum: 5b4b08050cbfff11d6e06758c5b47949 (MD5)   Previous issue date: 2010-04-20"
  ],
  "handle": "27484",
  "identifier_other": "etd-05012010-212110",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012010-212110/",
  "identifier_uri": "http://hdl.handle.net/10919/27484",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ballentine_HM_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Five-factor Wellness Inventory",
    "grade-point average",
    "Academic success",
    "persistence",
    "wellness"
  ],
  "title": "The Relationship Between Wellness and Academic Success in First-year College Students",
  "type": "Dissertation"
}