{
  "contributor_author": "Hall, Judith King",
  "contributor_committeechair": "Burton, John K.",
  "contributor_committeemember": [
    "Doolittle, Peter E.",
    "Lockee, Barbara B.",
    "Moore, David Michael",
    "Morrill, Robert W."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:24Z",
  "date_adate": "2000-05-04",
  "date_available": "2014-03-14T20:11:24Z",
  "date_issued": "2000-04-21",
  "date_rdate": "2001-05-04",
  "date_sdate": "2000-05-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Research on the cognitive style field dependence-independence establishes its influence on learning and students' outcomes across academic disciplines and at all levels of schooling.  Field dependent learners generally perform less well than field independent individuals in most instructional environments.  The consequences of cognitive style differences have not been thoroughly pursued by geography educators, and field dependent learners are generally disadvantaged.  Review of literature suggests that field dependent learners may perform well in hypermedia-based environments configured to support their learning needs.  This study presented geography students with a computer program that contained jigsaw puzzles made from maps and randomly varied the type of interactivity available to learners when solving the puzzles.  Field dependent learners were expected to solve the puzzles more quickly and accurately when they were able to interact with the jigsaw puzzle.  The interactive treatments provided by the program did not improve the performance of field dependent individuals as expected.",
  "description_provenance": [
    "Author Email: juhall@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: morrill@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:24Z (GMT). No. of bitstreams: 2 JudithHallVitae.pdf: 4169 bytes, checksum: fe91befc77af77ab9bd2fd39603687c7 (MD5) JudithHallDissertation.pdf: 2115456 bytes, checksum: d33601e869bb93f7ba240a2243d6b3bd (MD5)   Previous issue date: 2000-04-21"
  ],
  "handle": "27487",
  "identifier_other": "etd-05022000-19260058",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05022000-19260058/",
  "identifier_uri": "http://hdl.handle.net/10919/27487",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "JudithHallVitae.pdf",
    "JudithHallDissertation.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "visual perceptiveness",
    "hypermedia",
    "GEFT",
    "cognitive style",
    "geography education"
  ],
  "title": "Field Dependence-Independence and Computer-based Instruction in Geography",
  "type": "Dissertation"
}