{
  "contributor_author": "Grenville, N. Delia",
  "contributor_committeechair": "Kleiner, Brian M.",
  "contributor_committeemember": [
    "Smith-Jackson, Tonya L.",
    "Rosson, Mary-Beth",
    "Williges, Robert C.",
    "Denson, Mila W."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:11:24Z",
  "date_adate": "2001-05-08",
  "date_available": "2014-03-14T20:11:24Z",
  "date_issued": "2001-04-11",
  "date_rdate": "2002-05-08",
  "date_sdate": "2001-05-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A study was conducted to determine the preferences for the design of distributed meeting rooms used for video enhanced electronic meeting systems (VEMS).  Although there is a significant body of literature in the group communication domain, the research in this multidisciplinary area has paid minimal attention to users' environmental preferences in the design of a meeting space.   A basic science approach through three studies was used to explore the variables that defined the design of a distributed meeting space from the user's perspective.  Twenty-five inexperienced college-enrolled participants and twenty-five experienced Naval professionals used foam-core pieces to create a design of their ideal distributed meeting space.  Thirty-seven variables were used to categorize qualitative attributes of the designs.  Three types of designs emerged from the sample population: v-shaped, conference (u-shaped or oval), and theater (auditorium) style.   A nonexperimental design was used to measure the impact of the heuristics on the users' physical design of their distributed meeting spaces.  Post-meeting evaluation results were promising and indicated that the heuristics were usable and that participating in the design could have a positive impact on user's subjective rating of their meeting experience.  Overall, inexperienced users did not believe that the heuristics were necessary to determine the best room design for their team's needs. In the third study, six experts conducted an expert evaluation of a distributed meeting room site. Most experts were not able to identify context-specific design issues such as camera angle and lighting with the static information that they were provided.  The experts subjective ratings indicated that the heuristics were usable and were useful for room designers.  The overall findings indicated that experience level had a significant impact on user's perception of important equipment in a distributed meeting room.  Naïve users were more concerned with visual communication and assigned more importance to public displays (p=.035).  Experienced users were more concerned with audio communication and assigned more importance to microphone control (p=.024).  In addition, general findings from this research include a new methodology for generating participatory ergonomic tools.",
  "description_provenance": [
    "Author Email: degrenvi@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: smithjac@vt.edu",
    "Advisor Email: rosson@vt.edu",
    "Advisor Email: williges@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:24Z (GMT). No. of bitstreams: 3 Backmatter.pdf: 1161262 bytes, checksum: 7c2a012968d5047b734e22466b6d6f64 (MD5) study1.PDF: 33147 bytes, checksum: 3274696da6be8f98aff0db3ff11df84b (MD5) etd.pdf: 1113125 bytes, checksum: 13f26a4282d92af2506e05b5e148aba2 (MD5)   Previous issue date: 2001-04-11"
  ],
  "handle": "27489",
  "identifier_other": "etd-05022001-160336",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05022001-160336/",
  "identifier_uri": "http://hdl.handle.net/10919/27489",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Backmatter.pdf",
    "study1.PDF",
    "etd.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Participatory Ergonomics",
    "Heuristics",
    "Participatory Design",
    "Electronic Meeting Systems",
    "Room Design",
    "Video Teleconferencing",
    "Macroergonomics",
    "Distributed meetings"
  ],
  "title": "Developing Heuristics to Optimize the Configuration of the Video-Mediated Environment",
  "type": "Dissertation"
}