{
  "contributor_author": "Fawcett, Yvonne Bennett",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Kinlaw, Patrick C.",
    "Glenn, William J.",
    "Cash, Carol S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:23Z",
  "date_adate": "2008-05-21",
  "date_available": "2014-03-14T20:11:23Z",
  "date_issued": "2008-04-30",
  "date_rdate": "2008-05-21",
  "date_sdate": "2008-05-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "When George W. Bush signed the No Child Left Behind (NCLB) legislation in 2002, each state sought to individually address the challenges of higher standards and more stringent accountability measures.  While NCLB and state accountability programs are clear about the student performance results that schools are expected to achieve, they often do not provide schools with much guidance in terms of how to accomplish these objectives.  Schools that fail to meet NCLB accountability standards in Virginia are at risk of a plethora of interventions.  One of these sanctions is the installment of a turnaround principal to a low-performing school.  \tThe context of turnaround schools is a relatively new area of research and, as such, contains little by way of additive data on the subject.  The purpose of this descriptive case study was to determine through principal interviews, teacher focus group interviews, observations and document review, whether the major instructional leadership practices identified in the research as impacting student achievement (setting direction, communication, curriculum and instruction, collaboration and shared leadership, family and community connections, and organizational structure) were evident in the practices of the turnaround principal.  \tFindings of the study revealed that all of the major instructional practices identified in the research as impacting student achievement were evident in the practices of the turnaround principal.  Two additional leadership practices were identified as a result of this studyâ  s findings.",
  "description_provenance": [
    "Author Email: yfawcett@vt.edu, ysmfaw@aol.com",
    "Advisor Email: pckinlaw@henrico.k12.va.us",
    "Advisor Email: wglenn@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:23Z (GMT). No. of bitstreams: 2 02Fawcettdissertation-1.pdf: 2508847 bytes, checksum: 29e2c58c8777886c9833a66ea3b84278 (MD5) 01FawcettIntroduction-3.pdf: 129259 bytes, checksum: 148de2e032cbe07967177bb849f4c598 (MD5)   Previous issue date: 2008-04-30"
  ],
  "handle": "27480",
  "identifier_other": "etd-05012008-193811",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05012008-193811/",
  "identifier_uri": "http://hdl.handle.net/10919/27480",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "02Fawcettdissertation-1.pdf",
    "01FawcettIntroduction-3.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "leadership",
    "academic achievement",
    "at-risk students",
    "turnaround schools"
  ],
  "title": "A Case Study Of:  Leadership Practices of the Turnaround Principal",
  "type": "Dissertation"
}