{
  "contributor_author": "Siddaramappa, Shivakumara Swamy",
  "contributor_committeechair": "Inzana, Thomas J.",
  "contributor_committeemember": [
    "Mukhopadhyay, Biswarup",
    "Meng, Xiang-Jin",
    "Boyle, Stephen M.",
    "Tyler, Brett M."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:11:26Z",
  "date_adate": "2007-05-05",
  "date_available": "2014-03-14T20:11:26Z",
  "date_issued": "2007-04-09",
  "date_rdate": "2007-05-05",
  "date_sdate": "2007-05-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Histophilus somni is a commensal of the mucosal surfaces of respiratory and reproductive tracts of cattle and sheep. However, as an opportunistic pathogen, H. somni can cause diseases such as pneumonia, myocarditis, abortion, arthritis, and meningo-encephalitis. Previously, several virulence factors/mechanisms had been identified in H. somni of which the phase-variable lipooligosaccharide, induction of host cell apoptosis, intraphagocytic survival, and immunoglobulin Fc binding proteins were well characterized. To further understand the biological properties of H. somni, the genomes of pneumonia strain 2336 and preputial strain 129Pt have been sequenced. Using the genome sequence data and comparative analyses with other members of the Pasteurellaceae, putative genes that encode proteases, restriction-modification enzymes, hemagglutinins, glycosyltransferases, kinases, helicases, and adhesins have been identified in H. somni. Most of the H. somni strain-specific genes were found to be associated with prophage-like sequences, plasmids, and/or transposons. Therefore, it is likely that these mobile genetic elements played a significant role in creating genomic diversity and phenotypic variability among strains of H. somni. Functional characterization of H. somni luxS in the genomic context revealed that the gene encodes S-ribosylhomocysteinase that can complement biosynthesis of AI-2 quorum sensing signal molecules in Escherichia coli DH5alpha. It was also found that several pathogenic isolates of H. somni form a prominent biofilm and that luxS as well as phosphorylcholine expression can influence biofilm formation by H. somni. In conclusion, comparative analyses of the genomes and functional characterization of putative genes have shed new light on the versatility and evolution of H. somni.",
  "description_provenance": [
    "Author Email: ssiddara@vt.edu",
    "Advisor Email: bmukhopa@vt.edu",
    "Advisor Email: xjmeng@vt.edu",
    "Advisor Email: smboyle@vt.edu",
    "Advisor Email: tinzana@vt.edu",
    "Advisor Email: brtyler@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:26Z (GMT). No. of bitstreams: 7 03_CHAPTER_III.pdf: 779424 bytes, checksum: 150c5fa40130ce13287643a34625106b (MD5) 00_FRONT_MATTER.pdf: 57898 bytes, checksum: 06e46c229317031263393cbe557f94e4 (MD5) 04_CHAPTER_IV.pdf: 1452261 bytes, checksum: 15c1e978caaef7fbba68d0a809c135e0 (MD5) 02_CHAPTER_II.pdf: 1013439 bytes, checksum: 3db7d9ec43e7c1bfa718f4f5f3357814 (MD5) 05_CHAPTER_V.pdf: 449393 bytes, checksum: 0f593aba58422dd22e4a3685354669d8 (MD5) 06_CHAPTER_VI.pdf: 197840 bytes, checksum: 9f34403b3d02a88aa55a85d9c5412a85 (MD5) 01_CHAPTER_I.pdf: 464017 bytes, checksum: 7ee7d41437a43155984f2dbf03445080 (MD5)   Previous issue date: 2007-04-09"
  ],
  "handle": "27499",
  "identifier_other": "etd-05022007-150407",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05022007-150407/",
  "identifier_uri": "http://hdl.handle.net/10919/27499",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "03_CHAPTER_III.pdf",
    "00_FRONT_MATTER.pdf",
    "04_CHAPTER_IV.pdf",
    "02_CHAPTER_II.pdf",
    "05_CHAPTER_V.pdf",
    "06_CHAPTER_VI.pdf",
    "01_CHAPTER_I.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Bacteriophage",
    "Haemophilus",
    "Genome",
    "Histophilus",
    "Plasmid",
    "Restriction-Modification",
    "LuxS",
    "Biofilm"
  ],
  "title": "Comparative and Functional Genomic Studies of Histophilus somni (Haemophilus somnus)",
  "type": "Dissertation"
}