{
  "contributor_author": "Smith, Sandra F.",
  "contributor_committeecochair": [
    "Elitharp-Martin, Toni Marie",
    "Salmon, Richard G."
  ],
  "contributor_committeemember": [
    "Driscoll, Lisa G.",
    "Martin, Rosalie Marie"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:26Z",
  "date_adate": "2007-05-10",
  "date_available": "2014-03-14T20:11:26Z",
  "date_issued": "2007-04-26",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-05-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Special education is a field inherent with compliance and accountability issues. Special Education Administrators are tasked with the responsibility of implementing programs and maintaining compliance with state and federal standards while ensuring high quality educational performance. This research examined how the current Special Education Administrators are being held accountable under NCLB and IDEA. In addition, the previous roles and responsibilities of Special Education Administrator were reviewed in order to provide background information and to provide insight into Special Education Administratorsâ   perceptions of key responsibilities under NCLB and IDEA 2004. The guiding questions for this study are: (1) What do Special Education Administrators perceive as their role and responsibilities under NCLB and IDEA 2004? (2) Do Special Education Administrators perceive their evaluation tool as an adequate measure of the current roles and responsibilities by which they are held accountable under NCLB and IDEA 2004? (3) Does the criteria by which Special Education Administrators are evaluated reflect what the research supports as those components related to roles and responsibilities under NCLB and IDEA 2004? </p><p> The research design included quantitative and qualitative methods of analysis. The population for this study was stratified sample of 30 Special Education Administrators for the Commonwealth of Virginia. An online survey was utilized to conduct the initial research. In addition, in-depth interviews of special education administrators were conducted in order to gain a better understanding of how they are currently being held accountable. </p><p> Research revealed that Special Education Administrators perceive they are currently being held accountable under NCLB and IDEA; though research concludes that current performance evaluation methodology does not measure the professional standards, including the roles and responsibilities of the Special Education Administrator. The conclusions of this study emphasize the importance of examining the performance evaluation procedures for Special Education Administrators in the Commonwealth of Virginia.</p>",
  "description_provenance": [
    "Author Email: sasmith2@vt.edu",
    "Advisor Email: telithar@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: rowhite@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:26Z (GMT). No. of bitstreams: 1 sandrafsmith242.pdf: 918539 bytes, checksum: e1412b4150e7cb03a2de5bd2268a3b1c (MD5)   Previous issue date: 2007-04-26"
  ],
  "handle": "27498",
  "identifier_other": "etd-05022007-144441",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05022007-144441/",
  "identifier_uri": "http://hdl.handle.net/10919/27498",
  "publisher": "Virginia Tech",
  "relation_haspart": "sandrafsmith242.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Special Education Administrator",
    "Evaluation",
    "Accountability"
  ],
  "title": "Evaluation Measures: Do They Measure the Special Education Administratorâ  s Roles and Responsibilities by Which They Are Held Accountable under NCLB and IDEA 2004",
  "type": "Dissertation"
}