{
  "contributor_author": "Vijarnwannaluk, Sathon",
  "contributor_committeechair": "Zallen, Richard H.",
  "contributor_committeemember": [
    "Ritter, Alfred L.",
    "Di Ventra, Massimiliano",
    "Heflin, James R.",
    "Indebetouw, Guy J."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:11:25Z",
  "date_adate": "2002-05-03",
  "date_available": "2014-03-14T20:11:25Z",
  "date_issued": "2002-04-25",
  "date_rdate": "2003-05-03",
  "date_sdate": "2002-05-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Optical studies of heavily-doped GaAs:C grown at low temperature by molecular beam epitaxy were performed using room-temperature photoluminescence, infrared transmission, and Raman scattering measurements. The photoluminescence experiments show that in LT-GaAs:C films grown at temperatures below 400 C, nonradiative recombination processes dominate and photoluminescence is quenched. When the growth temperature exceeds 400 C, band-to-band photoluminescence emission appears. We conclude that the films change in character from LT-GaAs:C to normal GaAs:C once the growth temperature reaches 400 C. Annealing, however, shows a different behavior. Once grown as LT-GaAs:C, this material retains its nonconducting nonluminescing LT characteristics even when annealed at 600 C. The Raman-scattering measurements showed that the growth temperature and the doping concentration influence the position, broadening, and asymmetry of the longitudinal-optical phonon Raman line. We attribute these effects to changes in the concentration of interstitial carbon in the films. Also, the shift of the Raman line was used to estimate the concentration of arsenic-antisite defects in undoped LT-GaAs. The infrared transmission measurements on the carbon-doped material showed that only a fraction of the carbon atoms occupy arsenic sites, that this fraction increases as the growth temperature increases, and that it reaches about 100% once the growth temperature reaches 400 C. The details of all these measurements are discussed.  <p> Infrared transmission and photoluminescence measurements were also carried out on heavily-doped GaAs:C films grown by molecular beam epitaxy at the standard 600 C temperature. The infrared results reveal, for dopings under 5 x 10<sup>19</sup> cm<sup>-3</sup>, a linear relation between doping concentration and the integrated optical absorption of the carbon localized-vibrational-mode band. At higher dopings, the LVM integrated absorption saturates. Formation of C<sub>As</sub>-C<sub>As</sub> clusters is proposed as the mechanism of the saturation. The photoluminescence spectra were successfully analyzed with a simple model assuming thermalization of photoelectrons to the bottom of the conduction band and indirect-transition recombination with holes populating the degenerately doped valence band. The analysis yields the bandgap reduction and the Fermi-level-depth increase at high doping.",
  "description_provenance": [
    "Author Email: vsathon@vt.edu, vsathon@hotmail.com",
    "Advisor Email: rzallen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:25Z (GMT). No. of bitstreams: 1 vsathon.pdf: 869813 bytes, checksum: 764db01e04fdd323a5957efbb6d1ba2f (MD5)   Previous issue date: 2002-04-25"
  ],
  "handle": "27491",
  "identifier_other": "etd-05022002-145350",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05022002-145350/",
  "identifier_uri": "http://hdl.handle.net/10919/27491",
  "publisher": "Virginia Tech",
  "relation_haspart": "vsathon.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "carbon-doped",
    "infrared",
    "gallium arsenide",
    "LT-GaAs",
    "Raman",
    "localized vibrational mode",
    "photoluminescence",
    "GaAs",
    "GaAs:C"
  ],
  "title": "Optical studies of GaAs:C grown at low temperature and of localized vibrations in normal GaAs:C",
  "type": "Dissertation"
}