{
  "contributor_author": "Ondich, Gregory George",
  "contributor_committeechair": "Rees, Joseph V.",
  "contributor_committeemember": [
    "Wolf, James F.",
    "Wamsley, Gary L.",
    "White, Orion F. Jr.",
    "Goodsell, Charles T."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:11:24Z",
  "date_adate": "2001-05-03",
  "date_available": "2014-03-14T20:11:24Z",
  "date_issued": "2001-04-20",
  "date_rdate": "2002-05-03",
  "date_sdate": "2001-05-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>At the start of the twenty-first century, U.S. Environmental Protection Agency (EPA) officials can look back on nearly thirty years of meaningful accomplishments.  Toxic releases are down, the air and water are cleaner, and waste disposal methods are greatly improved.  Although this is a record of which EPA officials should be proud, is it sufficient to carry them into the next century?  Conventional wisdom among scholars, environmental policy advocates, and even EPA officials indicates that it is not.   \t<p>The new century is bringing complex challenges and, in some cases, the changing conditions are threatening the progress EPA has struggled to achieve.  Some of the tools and approaches this agency has relied upon historically, such as notice and comment rulemaking, single stakeholder consultations, and positional leadership, are no longer adequate to address existing environmental challenges and new emerging environmental problems.   \t<p>The Common Sense Initiative (CSI) was launched by EPA in mid-1994 as a fundamentally different approach to environmental protection.  Its sector-based, multistakeholder, consensus decision-making process was counter to EPA's traditional command-and-control approach.  CSI was created with the intent to heal the growing dysfunctional relationships that exist among government co-regulators (i.e., EPA and state and local agencies), the regulated industry, and non-governmental organizations (i.e., environmentalists and environmental justice organizations).  Even though EPA officials realized the limitations of the existing regulatory approach, they had trouble \"giving up control.\"    \t<p>Nonetheless, during the four-year history of the CSI process, EPA personnel had an opportunity to see themselves in a different light and to operate in a new organizational regime.  Rather than being just regulators, they were able to become solvers of environmental problems.  Rather than being position-oriented, they were able to become person-oriented.  Instead of seeking ownership and control, they were able to obtain leverage through partnerships and collaboration.  In short, EPA officials were building social capital and a new style of managementâ  facilitative leadership.  A facilitative leader leads without controlling, communicates without being condescending, and uses synergism to help groups achieve \"win-win\" results.  This new paradigm has the potential to help EPA better adapt in the next generation system of environmental protection.",
  "description_provenance": [
    "Author Email: ondich.greg@epa.gov",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: orionwhite@erols.com",
    "Advisor Email: goodsell@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:24Z (GMT). No. of bitstreams: 9 9vita.pdf: 3299 bytes, checksum: d8b2fb4de8fbfa816fd6c1acda389212 (MD5) 7Appendices.pdf: 75014 bytes, checksum: e2c57a84f5d3287cf3e8aea335a4d4cb (MD5) 4Part3.pdf: 213794 bytes, checksum: 4a9731aee236b331943de1c79cd80114 (MD5) 6Part5.pdf: 49356 bytes, checksum: 2ea141b5c3626f6ba924822108a113d9 (MD5) 1AbstractTbleofCont.pdf: 16517 bytes, checksum: 03b22ee4fe52681836fad0e3ed53d4ad (MD5) 5Part4.pdf: 212372 bytes, checksum: 1f222f01651d51ec1b670a504665acf0 (MD5) 8Bibliography2.pdf: 30588 bytes, checksum: dc0ec7a004628a725444888a212c14ac (MD5) 3Part2.pdf: 254047 bytes, checksum: abaee2117f929a74f08d80081d270aa3 (MD5) 2Part1.pdf: 37031 bytes, checksum: 4459d91b16837996f80d30f14a32864e (MD5)   Previous issue date: 2001-04-20"
  ],
  "handle": "27490",
  "identifier_other": "etd-05022001-222601",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05022001-222601/",
  "identifier_uri": "http://hdl.handle.net/10919/27490",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "9vita.pdf",
    "7Appendices.pdf",
    "4Part3.pdf",
    "6Part5.pdf",
    "1AbstractTbleofCont.pdf",
    "5Part4.pdf",
    "8Bibliography2.pdf",
    "3Part2.pdf",
    "2Part1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "consensus-building",
    "collaboration",
    "facilitative leadership"
  ],
  "title": "New Role Orientations for U.S. EPA Officials in the Next Generation System of Environmental Protection",
  "type": "Dissertation"
}