{
  "contributor_author": "Yamagiwa, Takayoshi Jose",
  "contributor_committeechair": "Orden, David R.",
  "contributor_committeecochair": "Peterson, Everett B.",
  "contributor_committeemember": [
    "Hilmer, Christiana E.",
    "Haller, Hans H.",
    "Norton, George W."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:11:25Z",
  "date_adate": "2005-05-11",
  "date_available": "2014-03-14T20:11:25Z",
  "date_issued": "2005-04-21",
  "date_rdate": "2005-05-11",
  "date_sdate": "2005-05-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation explores technical regulations (sanitary and phytosanitary (SPS) measures, technical barriers to trade, and geographical indications) in Central American agricultural and food trade. In the first part, a framework to systematically evaluate the broad issues for developing countries is presented. Evaluation of the issues for Central America is based on interviews with about 100 persons in the region and in the United States (US), and on secondary sources. The topic is of significance in Central America, especially when related to SPS measures. The World Trade Organization (WTO) Agreements have had relatively little direct impact in improving Central Americaâ  s response to technical regulations, while homologous Central American regional institutions may have been more successful, with indirect support from the WTO and the US, in reducing the incidence of illegitimate regulations in intra-regional trade. Central America may implement illegitimate barriers more against others in the region than against the US. Although the Central America Free Trade Agreement (CAFTA) may support Central Americaâ  s capacity to meet more stringent technical regulations, the improvement may not be sufficiently perceptible.  The potential for Central American greenhouse tomato exports to the US is analytically evaluated in the second part. These tomatoes may be admitted as the ban based on the risk of introduction of the Mediterranean fruit fly is partially lifted, due in part on discussions in the CAFTA negotiations. Mature green, vine-ripe and greenhouse tomatoes are heterogeneous in demand, and vine-ripe tomatoes are but greenhouse tomatoes are not heterogeneous by origin. A static partial equilibrium model is constructed for the US tomato market, where demand is based on multi-stage budgeting and supply is a function of own tomato price. When the Central American greenhouse excess supply function is introduced to the model, the region exports to the US, the aggregate greenhouse quantity increases, and its prices decrease. As greenhouse preference increases, greenhouse quantity and prices also increase. Changes are perceptible but small in the mature green and vine-ripe markets in the expected direction. Access by Central America is particularly beneficial when US consumer preferences shift further toward greenhouse over other tomatoes.",
  "description_provenance": [
    "Author Email: tyamagiwa@gmail.com",
    "Advisor Email: chilmer@vt.edu",
    "Advisor Email: haller@vt.edu",
    "Advisor Email: d.orden@cgiar.org",
    "Advisor Email: petrsone@vt.edu",
    "Advisor Email: gnorton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:25Z (GMT). No. of bitstreams: 1 YamagiwaETD.pdf: 1235142 bytes, checksum: 020170253b4f7325ee849bf033a8dd5b (MD5)   Previous issue date: 2005-04-21"
  ],
  "handle": "27494",
  "identifier_other": "etd-05022005-140116",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05022005-140116/",
  "identifier_uri": "http://hdl.handle.net/10919/27494",
  "publisher": "Virginia Tech",
  "relation_haspart": "YamagiwaETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "sanitary and phytosanitary measures",
    "trade",
    "Central America",
    "CAFTA",
    "tomato"
  ],
  "title": "An Assessment of Technical Barriers in Central American Agricultural and Food Trade",
  "type": "Dissertation"
}