{
  "contributor_author": "Tiwari, Siddharth",
  "contributor_committeechair": "Youngman, Roger R.",
  "contributor_committeemember": [
    "Paulson, Sally L.",
    "Lewis, Edwin E.",
    "Brewster, Carlyle C.",
    "Johnson, Charles S."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:11:26Z",
  "date_adate": "2007-05-07",
  "date_available": "2014-03-14T20:11:26Z",
  "date_issued": "2007-04-26",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-05-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Field studies were conducted over two growing seasons to evaluate the effect of different levels of third instar European corn borer, Ostrinia nubilalis Hübner (Lepidoptera: Crambidae), on whole-plant dry matter in corn grown for silage.  Mean (± SEM) whole-plant dry matter was significantly greater by 18.8% in uninfested control plants than in plants with an infestation level of 6 larvae/plant in 2004.  Whole-plant dry matter in 2005 was significantly greater by 10.5% in control plants than in plants with an infestation level of 5 larvae/plant.  Economic injury levels were calculated for each year using regression equations between whole-plant dry matter and European corn borer infestation level.  Plant growth stage and infestation level had no effect on percent acid detergent fiber, neutral detergent fiber, and crude protein values for either year. Greenhouse studies were conducted to examine the relationship between aboveground herbivory by European corn borer and belowground herbivory by root knot nematode, Meloidogyne incognita Chitwood (Tylenchida: Heteroderidae), in corn.  Two experiments were conducted to measure belowground herbivory by M. incognita in juvenile penetrations and eggs/root system.  In the first experiment, the main effects interaction was not significant for either M. incognita juvenile penetrations or eggs/root system.  Overall mean juvenile penetrations/root system across all three growth stages, at infestation levels of 1 and 3 larvae/plant were significantly less than in the non-infested control.  In addition, overall mean eggs/root system at an infestation level of 3 larvae/plant were significantly less than in the control.  In the second experiment, the main effects interaction was significant for both juvenile penetrations and eggs/root system.  At the 8 and 10 leaf growth stages, juvenile penetrations/root system at infestation levels of 1 and 3 larvae/plant were significantly less than in the control.  In addition, eggs/root system at an infestation level of 3 larvae/plant were significantly less than in the control, at all growth stages.  In the reciprocal study, which examined the effect of different M. incognita inoculation levels on European corn borer stalk tunneling, no significant effect of inoculation level on European corn borer stalk tunneling was found.",
  "description_provenance": [
    "Author Email: stiwari@vt.edu",
    "Advisor Email: spaulson@vt.edu",
    "Advisor Email: eelewis@ucdavis.edu",
    "Advisor Email: carlyleb@vt.edu",
    "Advisor Email: spcdis@vt.edu",
    "Advisor Email: youngman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:26Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 438730 bytes, checksum: ca69574b5322167cfe809280cce65cfa (MD5)   Previous issue date: 2007-04-26"
  ],
  "handle": "27501",
  "identifier_other": "etd-05022007-155905",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05022007-155905/",
  "identifier_uri": "http://hdl.handle.net/10919/27501",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "corn silage",
    "aboveground herbivory",
    "belowground herbivory",
    "European corn borer",
    "root knot nematode"
  ],
  "title": "The Effects of European corn borer on whole-plant yieldand root knot nematode fitness in corn",
  "type": "Dissertation"
}