{
  "contributor_author": "Gallagher, John Paul",
  "contributor_committeechair": "Dingus, Thomas A.",
  "contributor_committeemember": [
    "Neale, Vicki L.",
    "Kurstedt, Harold A. Jr.",
    "Wierwille, Walter W.",
    "Barfield, Woodrow S."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:11:27Z",
  "date_adate": "2001-05-04",
  "date_available": "2014-03-14T20:11:27Z",
  "date_issued": "2001-04-25",
  "date_rdate": "2002-05-04",
  "date_sdate": "2001-05-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An Assessment of the Attention Demand Associated with the Processing of Information for In-Vehicle Information Systems (IVIS) John Paul Gallagher (ABSTRACT) Technological interventions are being considered to alleviate congestion and to improve the quality of driving on our nationâ  s highways. These new technology interventions will be capable of increasing the amount of information provided to the driver; therefore, steps must be taken to ensure they do not require a high attention demand. (Limited attention resources can be diverted from the primary task of driving to a secondary in-vehicle task). The attention demand required as part of the process of extracting information has been studied relatively extensively. However, the processing required to make complex decisions is not well understood and provides cause for concern. This study investigated the attention demand required to perform several types of tasks, such as selecting a route, selecting the cheapest route, and selecting the fastest route. The three objectives of this study were: 1) To investigate driver performance during IVIS tasks that required additional processing of information after the extraction of information from a visual display. 2) To develop a method for evaluating driver performance with regard to safety. This task was accomplished by performing an extensive review of the literature, and developing two composite measures. 3) To provide descriptive data on the proportion of drivers who exceeded a threshold of driver performance for each of the different IVIS tasks. An instrumented vehicle, equipped with cameras and sensors, was used to investigate on-road driver behavior on a four-lane divided road with good visibility. A confederate vehicle was driven in front of the instrumented vehicle to create a vehicle following situation. Thirty-six drivers participated in this study. Age, presentation format, information density, and type of task were the independent variables used in this study. Results from this study indicate that a high proportion of driversâ   will have substantially degraded performance performing IVIS tasks such as selecting a route or a hotel from several possibilities. Findings also indicate that tasks involving computations, such as selecting the quickest or cheapest route, require a high attention demand and consequently should not be performed by a driver when the vehicle is in motion. In addition, text-based messages in paragraph format should not be presented to the driver while the vehicle is in motion. The graphic icon format should be utilized for route planning tasks.",
  "description_provenance": [
    "Author Email: jgallagher@asante.org",
    "Advisor Email: tdingus@vt.edu",
    "Advisor Email: vlewis@vt.edu",
    "Advisor Email: hak@vt.edu",
    "Advisor Email: waltw@vt.edu",
    "Advisor Email: barfield@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:27Z (GMT). No. of bitstreams: 15 AppendixU.pdf: 36676 bytes, checksum: 147b210ee7dd77645e18299f4e7097f1 (MD5) AppendixV.pdf: 38392 bytes, checksum: 18ae049f272ad6e7e1fa74884281b159 (MD5) AppendixP.pdf: 51207 bytes, checksum: b93d8d9862048a734dc7ba160e77551d (MD5) AppendixM.pdf: 56200 bytes, checksum: c704376f0f718abe0b740b1c69684911 (MD5) AppendixX.pdf: 54727 bytes, checksum: 3d5ffef6bbcd9f071fc832f193a658a0 (MD5) VITA.pdf: 10209 bytes, checksum: 1d7a50b2b6b0ca5ae7cfc7c8e2f2740b (MD5) AppendixA-L.pdf: 1352651 bytes, checksum: f140ce93a117e261d0f65b6713117709 (MD5) AppendixS.pdf: 30366 bytes, checksum: f2ac2fe1eebe7be2ede87c2531792f33 (MD5) Dissertation.pdf: 776033 bytes, checksum: f6827d57f06e93dc05d53ae084073f74 (MD5) AppendixQ.pdf: 47011 bytes, checksum: 9099064c5feaf8d9b5799967362b75e9 (MD5) AppendixR.pdf: 36983 bytes, checksum: c64b894408dfb6bb8762b6ca2c7bd28b (MD5) AppendixW.pdf: 25726 bytes, checksum: db6c7b42bb1c64790e4a556b5b2a55bb (MD5) AppendixO.pdf: 35102 bytes, checksum: 4ed5e06d28530b46d8bba701a4e078f4 (MD5) AppendixT.pdf: 25820 bytes, checksum: 2f37bdf8eea0df5b463cf8496c2d2737 (MD5) AppendixN.pdf: 55165 bytes, checksum: d4ffb345cc9ebfaa241e430e3f1d8497 (MD5)   Previous issue date: 2001-04-25"
  ],
  "handle": "27505",
  "identifier_other": "etd-05032001-092804",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05032001-092804/",
  "identifier_uri": "http://hdl.handle.net/10919/27505",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "AppendixU.pdf",
    "AppendixV.pdf",
    "AppendixP.pdf",
    "AppendixM.pdf",
    "AppendixX.pdf",
    "VITA.pdf",
    "AppendixA-L.pdf",
    "AppendixS.pdf",
    "Dissertation.pdf",
    "AppendixQ.pdf",
    "AppendixR.pdf",
    "AppendixW.pdf",
    "AppendixO.pdf",
    "AppendixT.pdf",
    "AppendixN.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "IVIS",
    "In-vehicle infromation systems",
    "ITS",
    "attention demand",
    "situation awareness"
  ],
  "title": "An Assessment of the Attention Demand Associated with the Processing of Information for In-Vehicle Information Systems (IVIS)",
  "type": "Dissertation"
}