{
  "contributor_author": "Smidl, Sarah Lynn",
  "contributor_committeechair": "Garrison, James W.",
  "contributor_committeemember": [
    "Benson, Mark J.",
    "Stremmel, Andrew J.",
    "Allen, Katherine R.",
    "Hill, Lynn T."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:29Z",
  "date_adate": "2006-05-09",
  "date_available": "2014-03-14T20:11:29Z",
  "date_issued": "2006-04-18",
  "date_rdate": "2006-05-09",
  "date_sdate": "2006-05-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this qualitative study was to focus on the laughter-provoking events and situations that supported the teaching, learning, and relationships of 13 kindergarten children, one teacher, and one researcher in a public school classroom in Southwestern Virginia.  This study drew on principles from portraiture, ethnography, and case studies, and primarily utilized observation, fieldnotes, informal interviews, and audiotape to document daily events and conversations. Discussion of the importance of laughter for these children, teacher, and researcher begins with three short case study portraits on different children, including how their varying personalities and interests prompted me to use laughter with them in varying ways.  Next, the importance and meanings of laughter in the group is given focus, specifically the daily morning group where the entire class came together at once with the classroom teacher.  Next, four themes that surfaced early in my research that were filled with laughter are portrayed, primarily how they demonstrated continuity throughout the semester.  Then, the stimuli in the daily curriculum or discourse that were laughable are described, with specific focus on how laughter can be important to, or help facilitate learning.  Last, I will summarize my findings to discuss the practical applications of laughter and humor for the teacher.",
  "description_provenance": [
    "Author Email: ssmidl@vt.edu",
    "Advisor Email: mbenson@vt.edu",
    "Advisor Email: Andrew.Stremmel@sdstate.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: wesley@vt.edu",
    "Advisor Email: hillfam@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:29Z (GMT). No. of bitstreams: 1 Dissertation_complete.pdf: 2329119 bytes, checksum: 3ebe8651589621d3c526ca413ec55a4f (MD5)   Previous issue date: 2006-04-18"
  ],
  "handle": "27516",
  "identifier_other": "etd-05032006-124750",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05032006-124750/",
  "identifier_uri": "http://hdl.handle.net/10919/27516",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_complete.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "laughter",
    "humor",
    "relationships",
    "kindergarten",
    "children"
  ],
  "title": "Portraits of Laughter in \"Kid\"ergarten Children: The Giggles and Guffaws That Support Teaching, Learning, and Relationships",
  "type": "Dissertation"
}