{
  "contributor_author": "Schiffbauer, James Daniel",
  "contributor_committeechair": "Xiao, Shuhai",
  "contributor_committeemember": [
    "Kowalewski, Michal",
    "Eriksson, Kenneth A.",
    "Scheckler, Stephen E.",
    "Bodnar, Robert J."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:11:31Z",
  "date_adate": "2009-05-28",
  "date_available": "2014-03-14T20:11:31Z",
  "date_issued": "2009-05-01",
  "date_rdate": "2012-03-27",
  "date_sdate": "2009-05-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Over the past decade, the study of organismal or systematic paleobiology has been progressing into a new age of digital paleobiology, in which advanced instrumentation is utilized for primary data collection and analyses. Having been progressing throughout this field of study, advanced instrumentsâ  commonly electron- and ion- microbeam equipmentâ  have been employed for numerous fossils over the entire range of geologic time, from microfossils to macrofossils and from the Archean (beginning at 3800 Ma) to the Cenozoic (ending at the recent). These techniques, predominantly used for geochemical, morphological, and ultra-/micro-structural analyses, have unlocked an incredible amount of detail contributing to our understanding of fossil organisms, their modes of life, and their biological affinities. But further, as these techniques continue to grow and become popularized in various fields of paleobiological study, they are certain to significantly progress our comprehension and knowledge of the evolution of life through time. <p> While the chapters presented in this dissertation may not have a unifying theme in terms of a distinct fossil organism or specific time in Earthâ  s history, furthering the use of electron- and ion- microbeam instrumentation and expanding the paleo-genres to which digital paleobiological approaches may be applied encompasses the fundamental intention of my research. Two of the chapters reported here focus on the geochemical, ultrastructural, and microstructural investigation of organic-walled microfossils, or acritarchs, from the Paleoproterozoic (2500â  1600 Ma) and Mesoproterozoic (1600â  1000 Ma), using a range of advanced instrumentation including field emission scanning electron microscopy, transmission electron microscopy, laser Raman spectroscopy, electron microprobe, secondary ion mass spectroscopy, and focused ion beam electron microscopy. Moving into the Neoproterozoic (1000â  542 Ma), the third primary research chapter utilizes field emission scanning electron microscopy for high-resolution, high magnification imaging and quantitative evaluation of an entire fossil assemblageâ  from acritarchs and algal fossils to the earliest metazoan embryos. This study was conducted in an effort to examine and describe the phosphatization taphonomic window of the Doushantuo Formation of South China, which is a prime example of exceptional preservation. Finally, the fourth primary research chapter reported here uses field emission scanning electron microscopy and environmental scanning electron microscopy in a field of paleobiology in which advanced instrumentation has been highly underutilized â   predatory-prey interactions. This research examines microstructural characteristics of predatory drill holes in both modern and fossil organisms in an attempt to mitigate the identification of predation traces in the fossil record.",
  "description_provenance": [
    "Author Email: jdschiff@vt.edu; jdschiffbauer@gmail.com",
    "Advisor Email: xiao@vt.edu",
    "Advisor Email: michalk@vt.edu",
    "Advisor Email: kaeson@vt.edu",
    "Advisor Email: stephen@vt.edu",
    "Advisor Email: rjb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:31Z (GMT). No. of bitstreams: 1 JDSchiffbauerPhDGeosciences.pdf: 137677468 bytes, checksum: 5950afba2c8a167f7e52981cef43f46b (MD5)   Previous issue date: 2009-05-01"
  ],
  "handle": "27519",
  "identifier_other": "etd-05032009-125004",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05032009-125004/",
  "identifier_uri": "http://hdl.handle.net/10919/27519",
  "publisher": "Virginia Tech",
  "relation_haspart": "JDSchiffbauerPhDGeosciences.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "acritarchs",
    "predator-prey interactions",
    "digital paleobiology"
  ],
  "title": "Contributions and New Methods in Paleontology: Geochemical, Ultrastructural, and Microstructural Characterization of Archean, Proterozoic, and Phanerozoic Fossils",
  "type": "Dissertation"
}