{
  "contributor_author": "Briggs, John Whitfield",
  "contributor_committeechair": "Sheetz, Steven D.",
  "contributor_committeemember": [
    "Barkhi, Reza",
    "Brozovsky, John A.",
    "Killough, Larry N.",
    "Rosson, Mary Beth"
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:11:28Z",
  "date_adate": "2004-05-05",
  "date_available": "2014-03-14T20:11:28Z",
  "date_issued": "2003-12-11",
  "date_rdate": "2006-05-05",
  "date_sdate": "2004-05-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Computerized decision aids are powerful tools to assist with decision-making.  Decision models are designed to incorporate and analyze available data in order to present a recommended solution to a problem.  Business decision makers, including accountants, have much to gain from integrating decision support technology with their own skills and experience.  Several studies have determined that there are many instances in which these decision aids perform favorably to human decision-makers.  Despite this fact, studies have shown that reliance upon these aids is incomplete, even when they process data in a highly efficient manner.<br><br> \t On the other hand, decision aids have limitations.  If such a decision support system is not updated to match changing conditions, relying on the aid can lead to suboptimal decision-making.<br><br> \t This study uses a laboratory experiment involving a managerial accounting task: prediction of manufacturing overhead costs.  In the experimental scenario, a decision support system's recommended solutions become inaccurate due to a shift in environmental conditions.    The first research objective is to determine whether subjects rely on the aid's advice before this change and, to their detriment, after the change.  The second research objective is to examine whether the feedback environment, the timing of the decision aid's inclusion into the task, or the inherent confidence level of the task participant affect the tendency to rely on the aid in both of these environmental conditions.<br><br>  The results of the study provide evidence that decision-makers rely on decision aids, and are susceptible to over-reliance on them.  These findings add to the results of prior studies that only examine a single trial task.  Additionally, it is determined that the timing of a decision aid's recommendation can affect the degree to which it is relied upon.  Next, there is evidence that feedback environment can help reliance and mitigate over-reliance.  There is no evidence that task confidence affects reliance.  Lastly, decision aids result in longer amounts of time used to complete the task.",
  "description_provenance": [
    "Author Email: jobriggs@vt.edu",
    "Advisor Email: reza@vt.edu",
    "Advisor Email: jbrozovs@vt.edu",
    "Advisor Email: sheetz@vt.edu",
    "Advisor Email: larry@vt.edu",
    "Advisor Email: mrosson@psu.edu",
    "Made available in DSpace on 2014-03-14T20:11:28Z (GMT). No. of bitstreams: 1 JWBriggsDiss.pdf: 576405 bytes, checksum: d0cbc174eaf794b5a04955550c316c55 (MD5)   Previous issue date: 2003-12-11"
  ],
  "handle": "27511",
  "identifier_other": "etd-05032004-003013",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05032004-003013/",
  "identifier_uri": "http://hdl.handle.net/10919/27511",
  "publisher": "Virginia Tech",
  "relation_haspart": "JWBriggsDiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "decision support systems",
    "reliance",
    "decision aid",
    "decision making"
  ],
  "title": "An Examination of Decision Aid Reliance in a Dynamic Environment",
  "type": "Dissertation"
}