{
  "contributor_author": "Strayhorn, Terrell Lamont",
  "contributor_committeechair": "Creamer, Donald G.",
  "contributor_committeemember": [
    "DePauw, Karen P.",
    "Olsen, Deborah",
    "Janosik, Steven M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:29Z",
  "date_adate": "2005-05-04",
  "date_available": "2014-03-14T20:11:29Z",
  "date_issued": "2005-04-21",
  "date_rdate": "2007-05-04",
  "date_sdate": "2005-05-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Graduate student persistence rarely has been studied, yet it is a very important issue for many higher education constituentsâ  including senior administrators, academic deans, faculty members, students, and families.  In light of an alarming statistic that approximately 50% of all graduate students fail to complete their degree, there have been few studies to examine this phenomenon and no new models to explain the relationship between factors that influence graduate student persistence.  This dissertation examined persistence by graduate students to degree using data from the National Center for Education Statisticsâ   Baccalaureate and Beyond (B&B:93/97) Longitudinal Survey.  First, I proposed a logical model of graduate student persistence using economic, academic, and non-academic variables.  Then, I tested the modelâ  s ability to predict graduate student persistence to degree.  Analyses were conducted to answer the following questions:  1.  Does more than money matter in predicting graduate student persistence? 2.  To what extent do economic, academic and non-academic factors included in the integrated model predict graduate student persistence? a)  Does this differ by graduate student status (e.g., masterâ  s and doctoral)?  If so, how? 3.  Using the integrated model, does the likelihood of persisting in graduate school vary by race/ethnicity?  If so, how? a)  How do student aid and undergraduate debt influence the observed racial/ethnic group differences in persistence?  The results of this study suggest that more than money matters when predicting graduate student persistence.  The integrate model of graduate student persistence, developed for this study, is statistically significantly better at predicting graduate student persistence than a model that only includes economic factors.  The integrated model tested to be most fit for predicting persistence among doctoral students.  And, finally, using the model, the likelihood of persisting in graduate school varies by race/ethnicity.  Student aid tends to improve oneâ  s chances of persisting in graduate school while undergraduate debt is associated with failing to persist in graduate school.",
  "description_provenance": [
    "Author Email: terrells@vt.edu",
    "Advisor Email: kpdepauw@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: dolsen@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:29Z (GMT). No. of bitstreams: 1 StrayhornTL2005v4.pdf: 517699 bytes, checksum: 76c7d3186441f3b63d2b246e8641a440 (MD5)   Previous issue date: 2005-04-21"
  ],
  "handle": "27514",
  "identifier_other": "etd-05032005-063502",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05032005-063502/",
  "identifier_uri": "http://hdl.handle.net/10919/27514",
  "publisher": "Virginia Tech",
  "relation_haspart": "StrayhornTL2005v4.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "graduate students",
    "economics",
    "logistic",
    "persistence"
  ],
  "title": "More than Money Matters: An Integrated Model of Graduate Student Persistence",
  "type": "Dissertation"
}