{
  "contributor_author": "Viren, Vejoya",
  "contributor_committeecochair": [
    "Rogers, Cosby Steele",
    "Sawyers, Janet K."
  ],
  "contributor_committeemember": [
    "Stremmel, Andrew J.",
    "Fu, Victoria R.",
    "Uttech, Melanie R."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:32Z",
  "date_adate": "2003-05-30",
  "date_available": "2014-03-14T20:11:32Z",
  "date_issued": "2003-05-05",
  "date_rdate": "2005-05-30",
  "date_sdate": "2003-05-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT  \tThis qualitative study was conducted to examine the phenomenon of conflict as a relational process as it is played out in the natural settings of two classrooms. The researcher sought to explore the developmental potential that conflict affords children as they try to make meaning of their relationships within the peer culture. It breaks away from the cyclical and linear models of conflict interactions as it tries to understand the reciprocal role of individual and culture in the initiation, sustenance, and resolution of peer conflicts. The study was also designed to explore the researcher role as participator and observer on a continuum with participant at one extreme and observer on the other.\t \tData for the study were collected through participant observations over a period of two semesters for the first study and five weeks for the second. The purpose was to examine disputes, particularly verbal exchanges made during these disputes, for insights of the child's understanding of the peer dynamics and culture that prevailed in the classrooms. Interpretive analysis of these disputes helped to embed the interactive events in their historical and sociocultural contexts. \tThe results of this study increase our understanding of the developmental aspects of conflict and give us a glimpse of the meaning children make of their disputes. It reinforces the view that (a) children are capable of managing their conflicts without much adult intervention, (b) that the larger peer culture often dictates the initiation and outcome of conflicts, and (c) that conflicts provide an ideal opportunity for children to develop perspective taking and for testing the terms of their relationship with peers.",
  "description_provenance": [
    "Author Email: vviren@vt.edu",
    "Advisor Email: astremme@vt.edu",
    "Advisor Email: vfu@vt.edu",
    "Advisor Email: rogersco@vt.edu",
    "Advisor Email: DrMelanie@cox.net",
    "Advisor Email: sawyers@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:32Z (GMT). No. of bitstreams: 4 Vejoya_dissertation_CV.pdf: 15758 bytes, checksum: e25036fe911348988b09d280b399658e (MD5) Vejoya_dissertation_contents.pdf: 8900 bytes, checksum: 29759fdae4ed8d03407bab60b0365c63 (MD5) Vejoya_dissertation_titlepage.pdf: 6993 bytes, checksum: ab2ffb2b928c280e7e965a9b58ecb0b7 (MD5) Vejoya_dissertation_main.pdf: 480324 bytes, checksum: 205dc6bb6065c552dad97429cce717c6 (MD5)   Previous issue date: 2003-05-05"
  ],
  "handle": "27526",
  "identifier_other": "etd-05042003-200744",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05042003-200744/",
  "identifier_uri": "http://hdl.handle.net/10919/27526",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Vejoya_dissertation_CV.pdf",
    "Vejoya_dissertation_contents.pdf",
    "Vejoya_dissertation_titlepage.pdf",
    "Vejoya_dissertation_main.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "conflict",
    "classroom culture",
    "preschool",
    "interaction"
  ],
  "title": "Making meaning of conflict: A qualitative inquiry in two preschool classrooms.",
  "type": "Dissertation"
}