{
  "contributor_author": "Yildirim, Ismail",
  "contributor_committeechair": "Yoon, Roe-Hoan",
  "contributor_committeemember": [
    "Luttrell, Gerald H.",
    "Adel, Gregory T.",
    "Jordan, J. L.",
    "Wightman, James P."
  ],
  "contributor_department": "Mining and Minerals Engineering",
  "date_accessioned": "2014-03-14T20:11:32Z",
  "date_adate": "2001-05-07",
  "date_available": "2014-03-14T20:11:32Z",
  "date_issued": "2001-04-18",
  "date_rdate": "2002-05-07",
  "date_sdate": "2001-05-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Microcalorimetric measurements and contact angle measurements were conducted to study the surface chemistry of powdered minerals.  The contact angle measurements were conducted on both flat and powdered talc samples, and the results were used to determine the surface free energy components using Van Oss-Chaudhury-Good (OCG) equation.  It was found that the surface hydrophobicity of talc increases with decreasing particle size.  At the same time, both the Lifshitz-van der Waals (gSLW) and the Lewis acid-base (gSAB) components (and, hence, the total surface free energy (gS)) decrease with decreasing particle size.  The increase in the surface hydrophobicity and the decrease in surface free energy (gS) can be attributed to preferential breakage of the mineral along the basal plane, resulting in the exposure of more basal plane surfaces to the aqueous phase. Heats of immersion measurements were conducted using a flow microcalorimeter on a number of powdered talc samples.  The results were then used to calculate the contact angles using a rigorous thermodynamic relation.  The measured heat of immersion values in water and calculated contact angles showed that the surface hydrophobicity of talc samples increase with decreasing particle size, which agrees with the direct contact angle measurements.  A relationship between advancing water contact angle qa, and the heat of immersion (-DHi) and surface free energies was established.  It was found that the value of -DHi decrease as qa increases. The microcalorimetric and direct contact angle measurements showed that acid-base interactions play a crucial role in the interaction between talc and liquid.  Using the Van Oss-Chaudhury-Goodâ  s surface free energy components model, various talc powders were characterized in terms of their acidic and basic properties.  It was found that the magnitude of the Lewis electron donor, gS-, and the Lewis electron acceptor, gS+, components of surface free energy is directly related to the particle size.  The gS- of talc surface increased with decreasing particle size, while the gS+ slightly decreased.  It was also found that the Lewis electron-donor component on talc surface is much higher than the Lewis electron-acceptor component, suggesting that the basal surface of talc is basic. The heats of adsorption of butanol on various talc samples from n-heptane solution were also determined using a flow microcalorimeter.  The heats of adsorption values were used to estimate % hydrophilicity and hydrophobicity and the areal ratios of the various talc samples.  In addition, contact angle and heat of butanol adsorption measurements were conducted on a run-of-mine talc sample that has been ground to two different particle size fractions, i.e., d50=12.5 mm and d50=3.0 mm, respectively.  The results were used to estimate the surface free energy components at the basal and edge surfaces of talc.  It was found that the total surface free energy (gS) at the basal plane surface of talc is much lower than the total surface free energy at the edge surface.  The results suggest also that the basal surface of talc is monopolar basic, while the edge surface is monopolar acidic.  The results explain why the basicity of talc surface increases with decreasing particle size as shown in the contact angle and microcalorimetric measurements. Furthermore, the effects of the surface free energies of solids during separation from each other by flotation and selective flocculation were studied.  In the present work, a kaolin clay sample from east Georgia was used for the beneficiation tests.  First, the crude kaolin was subjected to flotation and selective flocculation experiments to remove discoloring impurities (i.e., anatase (TiO2) and iron oxides) and produce high-brightness clay with GE brightness higher than 90%.  The results showed that a clay product with +90% brightness could be obtained with recoveries (or yields) higher than 80% using selective flocculation technique.  It was also found that a proper control of surface hydrophobicity of anatase is crucially important for a successful flotation and selective flocculation process.  Heats of immersion, heats of adsorption and contact angle measurements were conducted on pure anatase surface to determine the changes in the surface free energies as a function of the surfactant dosage (e.g. hydroxamate) used for the surface treatment.  The results showed that the magnitude of the contact angle and, hence, the surface free energy and its components on anatase surface varies significantly with the amount of surfactant used for the surface treatment.",
  "description_provenance": [
    "Author Email: isyildir@vt.edu",
    "Advisor Email: luttrell@vt.edu",
    "Advisor Email: ryoon@vt.edu",
    "Advisor Email: adel@vt.edu",
    "Advisor Email: wightman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:32Z (GMT). No. of bitstreams: 9 07Chapter6.pdf: 57559 bytes, checksum: 2a7d0cbfa33e11c5b788de3af55b8657 (MD5) 04Chapter3.pdf: 2421876 bytes, checksum: c16be7b481920dbc37f04380dcda8440 (MD5) 02Chapter1.pdf: 312979 bytes, checksum: 761556f7e7b2ecda71f2d7f60ed76da8 (MD5) 05Chapter4.pdf: 274092 bytes, checksum: 3738ed3d505c60ef209633fedba9c3fc (MD5) 02Main.pdf: 117350 bytes, checksum: 6f2578f15470851fc4f89746ecb94bc6 (MD5) 06Chapter5.pdf: 2685424 bytes, checksum: 7545d8fda95fc74182b076b6d764fb40 (MD5) 03Chapter2.pdf: 333683 bytes, checksum: 2bb6ee5b574ce33f293720f70d632012 (MD5) 09Vita.pdf: 34269 bytes, checksum: c8de8a67004ad6f53a3a14a2da77c3c9 (MD5) 08Chapter7.pdf: 56285 bytes, checksum: b1b1db2f170b6f6f59ad1f523c35ef46 (MD5)   Previous issue date: 2001-04-18"
  ],
  "handle": "27525",
  "identifier_other": "etd-05042001-163337",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05042001-163337/",
  "identifier_uri": "http://hdl.handle.net/10919/27525",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "07Chapter6.pdf",
    "04Chapter3.pdf",
    "02Chapter1.pdf",
    "05Chapter4.pdf",
    "02Main.pdf",
    "06Chapter5.pdf",
    "03Chapter2.pdf",
    "09Vita.pdf",
    "08Chapter7.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Hysterisis",
    "Contact angle",
    "Edge surface",
    "Basal surface",
    "Surface free energy",
    "Microcalorimeter",
    "Aspect ratio",
    "Areal ratio",
    "Anatase",
    "Selective flocculation",
    "Hydroxamates",
    "Hydrophobicity",
    "Polymer flocculant",
    "Kaolin",
    "Immersion",
    "Acidity",
    "Flotation",
    "Adsorption",
    "Basicity",
    "Interfacial surface tension",
    "Talc",
    "Apolar",
    "Polar",
    "Equilibrium spreading pressure"
  ],
  "title": "Surface Free Energy Characterization of Powders",
  "type": "Dissertation"
}