{
  "contributor_author": "Zalich, Michael Andrew",
  "contributor_committeecochair": [
    "Riffle, Judy S.",
    "St. Pierre, Tim"
  ],
  "contributor_committeemember": [
    "McGrath, James E.",
    "Long, Timothy E.",
    "Davis, Richey M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:11:32Z",
  "date_adate": "2005-05-12",
  "date_available": "2014-03-14T20:11:32Z",
  "date_issued": "2005-04-29",
  "date_rdate": "2005-05-12",
  "date_sdate": "2005-05-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Magnetic nanoparticles are of considerable interest owing to their potential applications in biotechnology and the magnetic recording industry.  Iron oxides have received much attention owing to their oxidative stability and biocompatibility; however, other transition metals and their alloys are also under investigation.  Cobalt has one of the largest magnetic susceptibilities of these materials, but it readily oxidizes upon exposure to air resulting in antiferromagnetic oxide.  Hence, coating cobalt nanoparticles with an oxygen-impermeable sheath would confer numerous benefits.  Cobalt nanoparticles were prepared by the thermolysis of dicobalt octacarbonyl in two block copolymer micellar systems, wherein the copolymers were precursors to graphite or silica.  Subsequent heat treatment of the samples at 600-700oC was conducted to condense the polymer coating around the cobalt nanoparticles and form oxygen impervious graphite or silica sheaths. Magnetic and structural characterization of these novel materials afforded pertinent information about their physical properties.  Magnetic susceptometry indicated that the graphite coated cobalt nanoparticles resisted oxidation for over one year.  The silica coated cobalt nanoparticles had high saturated specific magnetic moments, but the coatings were brittle and grinding the particles resulted in oxidation over time.  Transmission electron microscopy (TEM), high-resolution TEM (HRTEM) and energy-filtered TEM (EFTEM) were employed to study particle size and structural differences of the cobalt nanoparticles before and after heat treatment.  The mean particle size and size distribution increased for the graphite coated cobalt particles, due to particle sintering at 700oC.  In the silica coated cobalt nanoparticle system, the mean particle size increased when the sample was heat-treated at 600oC leading to a bimodal distribution.  This bimodal distribution was explained by a fraction of the particles sintering, while others remained discrete.  When the silica system was heat treated at 700oC, the particle size and size distribution remained similar to those of the pre-heat-treated sample, indicating that no sintering had taken place.  The rapid pyrolysis of the polymer at 700oC may serve to lock the cobalt nanoparticles into a silica matrix, thus preventing them from coming into contact with one another and sintering.  Several diffraction techniques (selected area electron diffraction (SAD), nano-beam electron diffraction (NBD) and x-ray diffraction (XRD)) were used to probe the crystal structure of graphite and silica coated cobalt nanoparticles, which was determined to be predominantly face-centered cubic.   Anisotropic magnetic nanoparticles (nanorods) have an increased magnetophoretic mobility over spherical magnetic nanoparticles with the same equatorial radius.  This property makes them attractive candidates for in vivo biological applications.  Anisotropic mixed ferrite nanoparticles were coated with a biocompatible hydrophilic block copolymer to render them dispersible in aqueous media.  Polymer coated mixed ferrite particles exhibited magnetic properties similar to that of pure magnetite, as the total level of other transition metals in the nanoparticulate system was less than 5%.  Electron energy loss spectroscopy (EELS) and (EFTEM) confirmed that the dominant elements in the mixed ferrite nanoparticles were iron and oxygen.  Furthermore, HRTEM, SAD and XRD analyses indicated that the crystal structure for the mixed ferrite nanoparticles was inverse spinel.  X-ray diffraction peaks at low angles for the coated mixed ferrite rods corresponded to poly(ethylene oxide) peaks, suggesting that the block copolymer employed as a dispersant was associated with the particles.",
  "description_provenance": [
    "Author Email: mzalich@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: stpierre@physics.uwa.edu.au",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:32Z (GMT). No. of bitstreams: 1 MAZdissertation05.05.05final.pdf: 3356880 bytes, checksum: f9f55033adfdb5317037fd4560b88cc3 (MD5)   Previous issue date: 2005-04-29"
  ],
  "handle": "27528",
  "identifier_other": "etd-05042005-133847",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05042005-133847/",
  "identifier_uri": "http://hdl.handle.net/10919/27528",
  "publisher": "Virginia Tech",
  "relation_haspart": "MAZdissertation05.05.05final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "transmission electron microscopy",
    "cobalt",
    "magnetite",
    "nanoparticle",
    "x-ray diffraction",
    "electron diffraction",
    "SQUID",
    "magnetic susceptometry"
  ],
  "title": "Physical Properties of Magnetic Macromolecule-Metal and Macromolecule-Metal Oxide Nanoparticle Complexes",
  "type": "Dissertation"
}