{
  "contributor_author": "Xu, Hao",
  "contributor_committeechair": "Rappaport, Theodore S.",
  "contributor_committeemember": [
    "Pratt, Timothy J.",
    "Woerner, Brian D.",
    "Kohler, Werner E.",
    "de Wolf, David A.",
    "Brown, Gary S."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:11:31Z",
  "date_adate": "2000-05-05",
  "date_available": "2014-03-14T20:11:31Z",
  "date_issued": "2000-04-26",
  "date_rdate": "2001-05-05",
  "date_sdate": "2000-05-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research focuses on radio wave propagation at millimeter-wave frequencies. A measurement based channel characterization approach is taken in the investigation.   First, measurement techniques are analyzed. Three types of measurement systems are designed, and implemented in measurement campaigns: a narrowband measurement system, a wideband measurement system based on Vector Network Analyzer, and sliding correlator systems at 5.8+AH4AXA-mbox{GHz}, 38+AH4AXA-mbox{GHz} and 60+AH4AXA-mbox{GHz}. The performances of these measurement systems are carefully compared both analytically and experimentally.  Next, radio wave propagation research is performed at 38+AH4AXA-mbox{GHz} for Local Multipoint Distribution Services (LMDS). Wideband measurements are taken on three cross-campus links at Virginia Tech. The goal is to determine weather effects on the wideband channel properties. The measurement results include multipath dispersion, short-term variation and signal attenuation under different weather conditions. A design technique is developed to estimate multipath characteristics based on antenna patterns and site-specific information.   Finally, indoor propagation channels at 60+AH4AXA-mbox{GHz} are studied for Next Generation Internet (NGI) applications. The research  mainly focuses on the characterization of space-time channel structure. Multipath components are resolved both in time of arrival (TOA) and angle of arrival (AOA). Results show an excellent correlation between the propagation environments and the channel multipath structure.   The measurement results and models provide not only guidelines for wireless system design and installation, but also great insights in millimeter-wave propagation.",
  "description_provenance": [
    "Author Email: haoxu@vt.edu",
    "Advisor Email: tipratt@vt.edu",
    "Advisor Email: woerner@vt.edu",
    "Advisor Email: kohler@mail.math.vt.edu",
    "Advisor Email: dadewolf@vt.edu",
    "Advisor Email: randem@vt.edu",
    "Advisor Email: wireless@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:31Z (GMT). No. of bitstreams: 1 final.pdf: 6461537 bytes, checksum: d26f0b4cb76e3746e81fd179316a9fa5 (MD5)   Previous issue date: 2000-04-26"
  ],
  "handle": "27522",
  "identifier_other": "etd-05042000-16180036",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05042000-16180036/",
  "identifier_uri": "http://hdl.handle.net/10919/27522",
  "publisher": "Virginia Tech",
  "relation_haspart": "final.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "BMS",
    "channel measurements",
    "channel models",
    "LMDS",
    "broadband wireless",
    "60 GHz",
    "radio wave propagation",
    "wireless communications",
    "38 GHz",
    "millimeter-wave",
    "NGI"
  ],
  "title": "Terrestrial radio wave propagation at millimeter-wave frequencies",
  "type": "Dissertation"
}