{
  "contributor_author": "Roberts, Jody Alan",
  "contributor_committeechair": "Burian, Richard M.",
  "contributor_committeemember": [
    "Luke, Timothy W.",
    "Pitt, Joseph C.",
    "Hirsh, Richard F.",
    "Breslau, Daniel"
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:11:32Z",
  "date_adate": "2006-06-09",
  "date_available": "2014-03-14T20:11:32Z",
  "date_issued": "2005-12-13",
  "date_rdate": "2006-06-09",
  "date_sdate": "2006-05-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this dissertation, I examine the evolution of the green chemistry movement from its inception in the early 1990s to the present day. I focus my study on the discursive strategies employed by leaders of the movement to establish green chemistry and to develop and institute changes in the practice of the chemical sciences. The study looks specifically at three different strategies. The first is the construction of a historical narrative. This history comes from the intersection of the chemical sciences with environmentalism in the United States retold to place chemistry in a central position for understanding global environmental health issues and green chemistry as the natural response to these problems. The second involves the attempts made to develop a concrete definition for green chemistry as well as a set of guiding principles for the practice of this alternative form of chemistry. The establishment of the definition and the principles, I argue, constitutes an important move in constituting the field as a very specific interdisciplinary group with a forged identity and the beginnings of a system for determining what properly â  countsâ   as green chemistry. The third comes from the intersection of this history within the defining principles of the movement intersect to create a specific set of green chemistry practices, and how these practices manifest themselves in conference and pedagogical settings. Finally, I offer an overview of where the movement currently stands, offering a critical perspective on the future potential of the field. I argue that recent episodes indicate that the movement has not succeeded in accomplishing what it set out to do, and will continue to encounter problems unless a refashioning of the movement takes place. To offer perspective on green chemistry as a movement, I examine it through the lens of other (e.g., Frickel and Gross 2005) attempts to explore scientific movements as a special class of social movements.",
  "description_provenance": [
    "Author Email: jody@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Advisor Email: jcpitt@vt.edu",
    "Advisor Email: rhirsh@vt.edu",
    "Advisor Email: dbreslau@vt.edu",
    "Advisor Email: rmburian@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:32Z (GMT). No. of bitstreams: 1 Roberts_Revised_Final_v2.pdf: 1020466 bytes, checksum: 989b547836c4a8d4dca426290a1ef7d1 (MD5)   Previous issue date: 2005-12-13"
  ],
  "handle": "27529",
  "identifier_other": "etd-05042006-093037",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05042006-093037/",
  "identifier_uri": "http://hdl.handle.net/10919/27529",
  "publisher": "Virginia Tech",
  "relation_haspart": "Roberts_Revised_Final_v2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Disciplining",
    "Discursive Strategies",
    "Chemistry Studies",
    "Scientific Movements",
    "Green Chemistry"
  ],
  "title": "Creating Green Chemistry: Discursive Strategies of a Scientific Movement",
  "type": "Dissertation"
}