{
  "contributor_author": "Wilding, Matthew David",
  "contributor_committeechair": "Baird, Donald G.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "McGrath, James E.",
    "Kiran, Erdogan R."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:11:33Z",
  "date_adate": "2007-05-09",
  "date_available": "2014-03-14T20:11:33Z",
  "date_issued": "2007-04-24",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-05-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>  This thesis is concerned with the development of a continuous melt extrusion process utilizing CO2 for the production of materials that cannot be typically melt processed.  The first goal of this study is to determine under what conditions it is possible to use CO2 to plasticize and, thereby, reduce the viscosity of an acrylonitrile (AN) copolymer in an extrusion process and render it melt processable.  In order to assess whether it was possible to absorb adequate amounts of CO2 in short residence times by injection into a single screw extruder, a slit-die rheometer was attached to the end of the extrusion system for the purpose of directly assessing the viscosity reduction.  A chemorheological analysis was performed on 65 and 85% AN copolymers to establish the temperature at which the 85% material would be stable for melt processing.  This, coupled with studies correlating the degree of Tg and viscosity reduction with the amount of absorbed CO2, allowed one to establish conditions for melt extrusion of the 85% AN.  It was determined that the 85% AN material should absorb at least 5 weight percent CO2 for a processing temperature reduction of 26°C in the extrusion process. </p> <p>       The second goal of this study is to determine to what extent CO2 can be used as a processing aid to melt process polyethylenes of higher molecular weight than can be typically melt processed.  To assess the ability to melt process high molecular weight polyethylenes with CO2, the viscosity of a 460,000 g/mol HDPE plasticized with various amounts of absorbed CO2 as determined with the slit-die rheometer.  A relationship was developed to determine the maximum molecular weight polyethylene that could be processed at a given viscosity reduction due to absorbed CO2.  The viscosity of a blend of 40 weight percent UHMWPE with the 460,000 g/mol HDPE with 12 weight percent CO2 was reduced to that of the pure 460,000 g/mol HDPE as predicted by the relationship.  Preliminary studies using a pressurized chamber attached to the exit of the die allowed one to assess the conditions under which suppression of foaming is possible.</p>",
  "description_provenance": [
    "Author Email: mwilding@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: ekiran@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:33Z (GMT). No. of bitstreams: 1 mdw_etd.pdf: 2562853 bytes, checksum: 440beae1671b88e38ae08dbff4bbd740 (MD5)   Previous issue date: 2007-04-24"
  ],
  "handle": "27537",
  "identifier_other": "etd-05042007-184715",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05042007-184715/",
  "identifier_uri": "http://hdl.handle.net/10919/27537",
  "publisher": "Virginia Tech",
  "relation_haspart": "mdw_etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "polyethylene",
    "extrusion",
    "acrylonitrile"
  ],
  "title": "Melt Processing Thermally Unstable and High Molecular Weight Polymers with Supercritical Carbon Dioxide",
  "type": "Dissertation"
}