{
  "contributor_author": "Slusher, Jennifer Jordan",
  "contributor_committeecochair": [
    "Burge, Penny L.",
    "Lawson, Gerard F."
  ],
  "contributor_committeemember": [
    "Allen, Katherine R.",
    "Getz, Hilda M."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:11:33Z",
  "date_adate": "2007-05-08",
  "date_available": "2014-03-14T20:11:33Z",
  "date_issued": "2007-05-03",
  "date_rdate": "2007-05-08",
  "date_sdate": "2007-05-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As leadership theory continues to develop and change, so do the attempts to enhance experiences for women in higher education. Women face many obstacles, which include lack of role models in student and institutional leaders (Astin & Leland, 1991). Traditionally, institutions offer no specific leadership programs or curricula and pay minimal attention to the leadership development of their students (Cress, Astin, Zimmerman-Oster, & Burkhardt, 2001). This study was a case study with an in-depth analysis of the establishment of a womenâ  s leadership education and training program at Hollins University in Roanoke, Virginia.  Six students, four administrators, and one intern were interviewed to illustrate the process of the planning of the program, its implementation and current operations, and the complexities involved. Document analysis and observations were utilized as well. The study was focused on the impact of the program on the students and administrators involved in the development of the program during this period. The researcher also described how the Batten Leadership Institute has evolved over the past five years with a focus on how it came into being, what it was like, then and now, and changes that have occurred.  \tThe findings are organized by three phases: 1) conceptualization, 2) implementation, and 3) refinement and expansion. The phases are based on a chronological framework and resulting categories and themes emerged. Results indicate the participantsâ   described their leadership skills improved because of their participation and experience in the BLI. The Communication Skills Group and its interpersonal component as well the presence of positive female role-models created the most personal transformation for the student participants. The studentsâ   previous ideas and definitions of leadership became more comprehensive. As a result of their personal transformation, their perceptions of the BLI changed from initial uncertainty and hesitation to admiration and support. The program expanded significantly over the first five years. Programmatic challenges have been addressed and many positive changes have occurred. Hollins administrators embraced the BLI and fully supported future expansions within Hollins University and in the Roanoke community.",
  "description_provenance": [
    "Author Email: salvy9@verizon.net",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: glawson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:33Z (GMT). No. of bitstreams: 1 Slusher_Final_Dissertation.pdf: 1198424 bytes, checksum: 02d0785929d7bc57414fd1a72100f3e2 (MD5)   Previous issue date: 2007-05-03"
  ],
  "handle": "27535",
  "identifier_other": "etd-05042007-081602",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05042007-081602/",
  "identifier_uri": "http://hdl.handle.net/10919/27535",
  "publisher": "Virginia Tech",
  "relation_haspart": "Slusher_Final_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Leadership Training",
    "Womenâ  s Colleges",
    "Womenâ  s Leadership Development"
  ],
  "title": "The Development of the Batten Leadership Institute at Hollins University:  A Case Study",
  "type": "Dissertation"
}