{
  "contributor_author": "Mendiratta, Neeraj K.",
  "contributor_committeechair": "Yoon, Roe-Hoan",
  "contributor_committeemember": [
    "Rimstidt, james Donald",
    "Luttrell, Gerald H.",
    "Adel, Gregory T.",
    "Corcoran, Sean Gerald"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:11:35Z",
  "date_adate": "2000-05-05",
  "date_available": "2014-03-14T20:11:35Z",
  "date_issued": "2000-05-02",
  "date_rdate": "2001-05-05",
  "date_sdate": "2000-05-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Sulfide minerals are a major source of metals; however, certain sulfide minerals, such as pyrite and pyrrhotite, are less desirable.  Froth flotation is a commonly used separation technique, which requires the use of several reagents to float and depress different sulfide minerals.  Xanthate, a thiol collector, has gained immense usage in sulfide minerals flotation.  However, some sulfides are naturally hydrophobic and may float without a collector. Iron sulfides, such as pyrite and pyrrhotite, are few of the most abundant minerals, yet economically insignificant.  Their existence with other sulfide minerals leads to an inefficient separation process as well as environmental problems, such as acid mine drainage during mining and processing and SO2 emissions during smelting process.  A part of the present study is focused on understanding their behavior, which leads to undesired flotation and difficulties in separation.  The major reasons for the undesired flotation are attributed to the collectorless hydrophobicity and the activation with heavy metal ions. To better understand the collectorless hydrophobicity of pyrite, Electrochemical Impedance Spectroscopy (EIS) of freshly fractured pyrite electrodes was used to study the oxidation and reduction of the mineral.  The EIS results showed that the rate of reaction increases with oxidation and reduction.  At moderate oxidizing potentials, the rate of reaction is too slow to replenish hydrophilic iron species leaving hydrophobic sulfur species on the surface.  However, at higher potentials, iron species are replaced fast enough to depress its flotation.  Effects of pH and polishing were also explored using EIS. Besides collectorless hydrophobicity, the activation of pyrrhotite with nickel ions and interaction with xanthate ions makes the separation more difficult.  DETA and SO2 are commonly used as pyrrhotite depressants; however, the mechanism is not very well understood.  Contact angle measurements, cyclic voltammetry and Tafel studies have been used to elucidate the depressing action of DETA and SO2.  It was observed that DETA and SO2 complement each other in maintaining lower pulp potentials and removing polysulfides.  DETA also helps in deactivating pyrrhotite.  Therefore, the combined use of DETA and SO2 leads to the inhibition of both the collectorless flotation and the adsorption of xanthate. The adsorption of xanthate on sulfide minerals is a mixed-potential mechanism, i.e., the anodic oxidation of xanthate requires a cathodic counterpart.  Normally, the cathodic reaction is provided by the reduction of oxygen.  However, oxygen can be replaced by other oxidants.  Ferric ions are normally present in the flotation pulp.  Their source could be either iron from the grinding circuit or the ore itself.  The galvanic studies were carried out to test the possibility of using ferric ions as oxidants and positive results were obtained. Tafel studies were carried out to measure the activation energies for the adsorption of ethylxanthate on several sulfide minerals.  Pyrite, pyrrhotite (pure and nickel activated), chalcocite and covellite were studied in 10-4 M ethylxanthate solution at pH 6.8 at temperatures in the range of 22 â   30 0C.  The Tafel studies showed that xanthate adsorbs as dixanthogen (X2) on pyrite and pyrrhotite, nickel dixanthate (NiX2) on nickel-activated pyrrhotite and cuprous xanthate (CuX) on both chalcocite and covellite.  However, the mechanism for xanthate adsorption on each mineral is different.  The free energy of reaction estimated from the activation energies are in good agreement with thermodynamically calculated ones.",
  "description_provenance": [
    "Author Email: neeraj@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: ryoon@vt.edu",
    "Advisor Email: luttrell@vt.edu",
    "Advisor Email: adel@vt.edu",
    "Advisor Email: sgc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:35Z (GMT). No. of bitstreams: 1 Neeraj.pdf: 1183360 bytes, checksum: d971f0bcf8e50b60db3620340763cf0c (MD5)   Previous issue date: 2000-05-02"
  ],
  "handle": "27545",
  "identifier_other": "etd-05052000-16090038",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05052000-16090038/",
  "identifier_uri": "http://hdl.handle.net/10919/27545",
  "publisher": "Virginia Tech",
  "relation_haspart": "Neeraj.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "DETA",
    "Covellite",
    "Chalcopyrite",
    "Xanthate.",
    "Sphalerite",
    "Pyrrhotite",
    "Tafel",
    "Pyrite",
    "Activation Energy",
    "Chalcocite",
    "Sulfides",
    "Activation",
    "SO2"
  ],
  "title": "Kinetic Studies of Sulfide Mineral Oxidation and Xanthate Adsorption",
  "type": "Dissertation"
}