{
  "contributor_author": "Harris, Linda Ann",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "Ward, Thomas C.",
    "McGrath, James E.",
    "Lesko, John J.",
    "Dillard, John G."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:11:35Z",
  "date_adate": "2002-05-15",
  "date_available": "2014-03-14T20:11:35Z",
  "date_issued": "2002-04-19",
  "date_rdate": "2003-05-15",
  "date_sdate": "2002-05-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Magnetic nanoparticles that display high saturation magnetization and high magnetic susceptibility are of great interest for medical applications.  Nanomagnetite is particularly desirable because it displays strong ferrimagnetic behavior, and is less sensitive to oxidation than magnetic transition metals such as cobalt, iron, and nickel.  Magnetite nanoparticles can be prepared by co-precipitating iron (II) and iron (III) chloride salts in the presence of ammonium hydroxide at pH 9-10.  One goal of this work has been to develop a generalized methodology for stabilizing nanomagnetite dispersions using well-defined, non-toxic, block copolymers, so that the resultant magnetite-polymer complexes can be used in a range of biomedical materials.    Hydrophilic triblock copolymers with controlled concentrations of pendent carboxylic acids were prepared.  The triblock copolymers contain carboxylic acids in the central urethane segments and controlled molecular weight poly(ethylene oxide) tail blocks.  They were utilized to prepare hydrophilic-coated iron oxide nanoparticles with biocompatible materials for utility in magnetic field guidable drug delivery vehicles.  The triblock copolymers synthesized contain 3, 5, or 10 carboxylic acids in the central segments with Mn values of 2000, 5000 or 15000 g/mol poly(ethylene oxide) tail blocks.  A method was developed for preparing ~10 nm diameter magnetite surfaces stabilized with the triblock polymers.  The carboxylic acid is proposed to covalently bind to the surface of the magnetite and form stable dispersions at neutral pH.  The polymer-nanomagnetite conjugates described in this thesis have a maximum of 35 wt. % magnetite and the nano-magnetite particles have an excellent saturation magnetization of ~66 - 78 emu/g Fe3O4.  Powder X-ray diffraction (XRD) confirms the magnetite crystal structure, which appears to be approximately single crystalline structures via electron diffraction spectroscopy analysis (EDS).  These materials form stable magnetic dispersions in both water and organic solvents.",
  "description_provenance": [
    "Author Email: liharris@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: john.dillard@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:35Z (GMT). No. of bitstreams: 1 LAH-etd.pdf: 4140558 bytes, checksum: 8032c7e5e05aaa6f4abd8459add7ec30 (MD5)   Previous issue date: 2002-04-19"
  ],
  "handle": "27547",
  "identifier_other": "etd-05052002-231800",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05052002-231800/",
  "identifier_uri": "http://hdl.handle.net/10919/27547",
  "publisher": "Virginia Tech",
  "relation_haspart": "LAH-etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "phase separation",
    "structural adhesive",
    "vinyl ester",
    "poly(ethylene oxide)",
    "iron oxide",
    "drug delivery",
    "fiber reinforced polymer composite",
    "carboxylic acid",
    "nanoparticles",
    "superparamagnetic",
    "colloidal dispersion"
  ],
  "title": "Polymer Stabilized Magnetite Nanoparticles and Poly(propylene oxide) Modified Styrene-Dimethacrylate Networks",
  "type": "Dissertation"
}