{
  "contributor_author": "Srigiriraju, Lakshmipathi",
  "contributor_committeechair": "Semtner, Paul J.",
  "contributor_committeemember": [
    "Bloomquist, Jeffrey R.",
    "Mullins, Donald E.",
    "Sharakhov, Igor V.",
    "Pfeiffer, Douglas G.",
    "Reed, Thomas David"
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:11:36Z",
  "date_adate": "2008-05-29",
  "date_available": "2014-03-14T20:11:36Z",
  "date_issued": "2008-04-10",
  "date_rdate": "2009-05-29",
  "date_sdate": "2008-05-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The tobacco-adapted form of the green peach aphid, Myzus persicae (Sulzer), is one of the most important insect pests of tobacco in the United States and around the world.  Insecticides play a major role in controlling the aphid on tobacco because natural enemies usually fail to maintain its populations below damaging levels.  The aphid has a history of developing resistance to many insecticides.  Therefore, baseline information on the aphidâ  s susceptibility to imidacloprid and other insecticides is critical for developing future resistant management programs to minimize losses attributed to the aphid.  Studies were conducted on colonies of the tobacco-adapted form of the green peach aphid collected from nine states in the eastern United States in 2004-2007.  The susceptibility of 151 colonies to imidacloprid was determined in serial leaf-dip bioassays.  When combined over the four years, 18, 14, and 4% of the colonies had 10- to 20-fold, 20- to 30-fold, and 30- to 90-fold resistance ratios, respectively, suggesting that high levels of resistance to imidacloprid are present in field populations of the aphid.  A colony collected near Clayton, NC had the highest LC50 value (31 ppm) combined over six tests and three years, but the average resistance ratios for the first three runs was over 130-fold (48 ppm).  Geographic location had little effect on susceptibility to imidacloprid.  Aphid colonies (136) including red, green, and orange color morphs were screened for total esterase activity using microplate assay with 1-Naphthyl acetate as the substrate.  The green morphs generally had lower esterase levels than the red and orange morphs.  All orange morphs had among the highest esterase activities.  Esterase activities of red and green morphs were positively correlated with LC50 values as determined by leaf-dip bioassays for acephate and methomyl.  All 25 colonies tested for esterase gene amplification had either E4 or FE4 gene amplification.  The amplification of both E4 and FE4 seen as an 865-bp band characteristic of the FE4 gene and an additional 381-bp band characteristic of a deleted upstream region of the E4 gene occurred in all (4) orange morphs and one (1 of 9) green morph.  Target-site insensitivity of acetylcholinesterase (AChE), as modified AChE resistance (MACE) was assessed in 65 colonies of field-collected tobacco-adapted forms of M. persicae.  Eight colonies over a range of AChE activity were selected to study inhibition of AChE in the presence of two carbamate insecticides, methomyl and pirimicarb.  IC50 values for methomyl ranged from 0.35 to 2.4 Î¼M while six of eight colonies had lower values with a range of 0.16 to 0.30 Î¼M for pirimicarb.  Two colonies that were inhibited by methomyl had very high IC50 values of 40.4 and 98.6 Î¼M for pirimicarb.  Such insensitivity may be due to mutations in the ace2 gene, but this needs to be confirmed by genetic and molecular analysis.  Glutathione S- transferases (GSTs), isoenzymes that are involved in the metabolism and detoxification of many xenobiotic compounds were quantified for 100 colonies by CDNB conjugation.  There was a wide range of GST activity for the red (8 to 343 pmol/min/mg protein) and green (15.3 to 330 pmol/min mg protein) morphs, but all six orange morphs collected in 2007 had a narrower range (160 to 211 pmol/min/mg protein).  About 45% of the red morphs had GST activity from 200-300 pmol/min/mg of protein, while 53% of the green morphs had a range of 100-200 pmol/min/mg protein.  The influence of temperature-mediated synergisms on the toxicity of insecticides in red and green color morphs of the tobacco-adapted from of M. persicae were evaluated using leaf-dip bioassay procedures in laboratory incubators.  Post-exposure temperatures of 15, 20, and 25oC were evaluated for four classes of insecticides, acephate, imidacloprid, lambda-cyhalothrin, and methomyl.  The temperature change from 15 to 20oC caused almost a 3-fold increase in toxicity to the red and green color morphs for methomyl, acephate, and imidacloprid.  In contrast, the toxicity of lambda-cyhalothrin decreased as the temperature increased, showing a negative temperature coefficient.  Bioassay experiments conducted with the red morph for indirect estimates of imidacloprid concentrations in flue-cured tobacco showed that leaf position, imidacloprid rate and time after application affected the concentration of the toxicant in the leaf.  The differences in aphid mortality between the lower and upper leaf positions indicate that the concentration of imidacloprid and its metabolites were unevenly distributed with the lowest mortality for aphids feeding on the younger, upper leaves and the highest for those feeding on the older, lower leaves.  In field experiments, higher aphid populations occurred on tobacco treated with imidacloprid less than the field recommended rate of 41.4 ml/1,000 plants.  The development of aphid populations in the field was consistent with the laboratory bioassays.  Field trials were conducted to evaluate the performance of various insecticides currently registered for aphid control on tobacco.  Imidacloprid applied as a tray drench treatment and acephate as foliar sprays were the most effective treatments.  Moderate declines in control with imidacloprid were observed at 75-87 d after transplanting in 2006 and 2007.  Aldicarb gave good to excellent control in one of three years, but only fair to poor control in the other two years.  Methomyl and lambda-cyhalothrin gave good control in all three years except the residual was shorter.  The poor performance of aldicarb in the two years may have been related to the presence of E4 or FE4 resistance in the naturally occurring TGPA in the experimental plots.",
  "description_provenance": [
    "Author Email: pathi@vt.edu",
    "Advisor Email: psemtner@vt.edu",
    "Advisor Email: jbquist@vt.edu",
    "Advisor Email: mullinsd@vt.edu",
    "Advisor Email: igor@vt.edu",
    "Advisor Email: dgpfeiff@vt.edu",
    "Advisor Email: threed@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:36Z (GMT). No. of bitstreams: 1 SPathi.pdf: 2728945 bytes, checksum: 81087a6d9c47dda898c7c076c9f13ac5 (MD5)   Previous issue date: 2008-04-10"
  ],
  "handle": "27549",
  "identifier_other": "etd-05052008-173054",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05052008-173054/",
  "identifier_uri": "http://hdl.handle.net/10919/27549",
  "publisher": "Virginia Tech",
  "relation_haspart": "SPathi.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Myzus persicae",
    "Myzus nicotianae",
    "tobacco aphid",
    "insecticide resistance"
  ],
  "title": "Quantification of insecticide resistance in the tobacco-adapted form of the green peach aphid, Myzus persicae (Sulzer)(Hemiptera: Aphididae)",
  "type": "Dissertation"
}