{
  "contributor_author": "Brabrand, Scott Sorensen",
  "contributor_committeechair": "Alexander, M. David",
  "contributor_committeemember": [
    "Twiford, Travis W.",
    "Salmon, Richard G.",
    "Mallory, Walter D.",
    "Byers, Larry",
    "Caldwell, M. Teressa"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:35Z",
  "date_adate": "2003-05-19",
  "date_available": "2014-03-14T20:11:35Z",
  "date_issued": "2003-04-21",
  "date_rdate": "2003-05-19",
  "date_sdate": "2003-05-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Virginia Principals and School Law    Scott S. Brabrand   (ABSTRACT)   \tThis study sought to determine Virginia Public School principals창   knowledge of school law as it related to the type, length/quantity, and recency of law preparation they received.  Other variables measured included how their level of knowledge was associated with their length of administrative experience and with their description of the school community in which they worked. \tAn on-line survey instrument was designed to collect demographic and professional information and to test knowledge of court cases and federal and state statutes.  Three hundred and twelve principals completed the survey, representing all grade levels and all regions in the State of Virginia.  The principals창   knowledge of school law was measured by a forty item true-false test that addressed four key areas of school law selected by a panel of experts: student issues, teacher/administrator issues, tort liability, and church/state relations. \tThe data were analyzed using analysis of variance and post hoc tests.  The findings of this study indicated a significant difference of the means, &#940; =.05, between the principals창   knowledge of school law in the category of tort liability and the recency of legal preparation.  Principals who received their legal preparation over 10 years ago scored significantly lower on the tort section of the test than those who received their legal preparation only 5-10 years ago.   \tFindings also indicated that principals across all categories of school law displayed only a fair knowledge of school law, earning a mean score of 29.359 out of 40 or 73.3%.  The principals창   weakest area of school law was in the category of church/state relations.  These findings would provide valuable information for the design of principal preparation programs.  They would also encourage state educational policymakers and local school divisions to strengthen the professional development of principals on legal matters.",
  "description_provenance": [
    "Author Email: scott.brabrand@fcps.edu",
    "Advisor Email: mdavid@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:35Z (GMT). No. of bitstreams: 1 ssb1final.pdf: 1598938 bytes, checksum: e592764f138261bcd74f5281aef0eaf8 (MD5)   Previous issue date: 2003-04-21"
  ],
  "handle": "27548",
  "identifier_other": "etd-05052003-155102",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05052003-155102/",
  "identifier_uri": "http://hdl.handle.net/10919/27548",
  "publisher": "Virginia Tech",
  "relation_haspart": "ssb1final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Public School",
    "Virginia",
    "School Law",
    "Principals"
  ],
  "title": "Virginia Principals and School Law",
  "type": "Dissertation"
}