{
  "contributor_author": "Waller, LaChelle Monique",
  "contributor_committeechair": "Tyler, Brett M.",
  "contributor_committeemember": [
    "McDowell, John M.",
    "Hoeschele, Ina",
    "Maroof, M. A. Saghai"
  ],
  "contributor_department": "Interdisciplinary",
  "date_accessioned": "2014-03-14T20:11:34Z",
  "date_adate": "2010-05-10",
  "date_available": "2014-03-14T20:11:34Z",
  "date_issued": "2010-04-08",
  "date_rdate": "2010-05-10",
  "date_sdate": "2010-05-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Quantitative resistance is controlled by multiple genes and has been shown to be a durable form of resistance to pathogens affecting cultivated crops including soybeans (Glycine max L. Merr). Root rot of soybean caused by Phytophthora sojae ranks among the most damaging soybean diseases. Quantitative resistance has proven durable in soybean against P. sojae, however the molecular mechanisms underlying this form of resistance are still unknown. The objective of this project is to gain insight into molecular basis of quantitative resistance in the soybean-P. sojae pathosystem. The approach was to use global transcriptional profiling based on microarray technology to identify genes that were differentially expressed in four cultivars of soybeans with varying levels of quantitative resistance at different time points during infection by P. sojae. Our results provide a better understanding of the potential regulatory factors that may contribute to quantitative resistance during early hours of P. sojae infection.",
  "description_provenance": [
    "Author Email: lmwaller@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Advisor Email: inah@vbi.vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: bmtyler@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:34Z (GMT). No. of bitstreams: 1 Waller_LaChelleM_D_2010.pdf: 697617 bytes, checksum: 8b668d4be45a755a772e68ca65aef298 (MD5)   Previous issue date: 2010-04-08"
  ],
  "handle": "27541",
  "identifier_other": "etd-05042010-145729",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05042010-145729/",
  "identifier_uri": "http://hdl.handle.net/10919/27541",
  "publisher": "Virginia Tech",
  "relation_haspart": "Waller_LaChelleM_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Transcriptional Profiling",
    "Quantitative Resistance",
    "Regulatory Factors"
  ],
  "title": "Transcriptional profiling of potential regulatory factors modulating defense mechanisms in soybean during Phytophthora sojae infection",
  "type": "Dissertation"
}