{
  "contributor_author": "Aime, Mary Catherine",
  "contributor_committeechair": "Miller, Orson K. Jr.",
  "contributor_committeemember": [
    "Porter, Duncan M.",
    "Scheckler, Stephen E.",
    "Vilgalys, Rytas J.",
    "Falkinham, Joseph O. III"
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:11:35Z",
  "date_adate": "2001-05-07",
  "date_available": "2014-03-14T20:11:35Z",
  "date_issued": "2001-05-01",
  "date_rdate": "2002-05-07",
  "date_sdate": "2001-05-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Fungi of the Crepidotaceae are characterized by saprotrophic habit, filamentous cuticle, and brown-pigmented basidiospores that lack either a germ pore or plage.  The majority of species belong to Crepidotus, distinguished by their pleurotoid basidiomata.  Because of their diverse morphology, the presence of several conflicting classifications, and lack of data regarding the biology, phenotypic plasticity, or phylogeny of these fungi, the present study sought first to determine phylogenetic relationships among the different taxonomic groups as a basis for addressing other aspects of Crepidotus biology and evolution.    Sequencing analyses show the Crepidotaceae is not monophyletic, and the family concept is revised. Crepidotus and its sister genus Simocybe are found to be monophyletic.  At least nine phylogenetic lineages within Crepidotus were uncovered, although relationships between them could not be resolved.  However, none of the previously proposed infrageneric classifications are reflective of phylogeny.  Morphological, biological, and phylogenetic species concepts were compared within a single phylogenetic unit, termed the Sphaerula group, showing an unusual amount of phenotypic plasticity exists within species, and a taxonomic revision of these species proposed.  Also reported are several unique or unusual aspects of Crepidotus biology, including presence of a prolonged latent period prior to basidiospore germination; spontaneous reversion of differentiated hymenial cells to vegetative growth; and the revelation that structures previously termed pleurocystidia are actually the expression of secondary growth from basidia.  Results from mating system, culture, and type studies, reassessment of morphological characters traditionally applied to agaric taxonomy, and a revised life cycle for the Crepidoti are presented.",
  "description_provenance": [
    "Author Email: maime@vt.edu",
    "Advisor Email: duporter@vt.edu",
    "Advisor Email: stephen@vt.edu",
    "Advisor Email: ormiller@vt.edu",
    "Advisor Email: fungi@DUKE.edu",
    "Advisor Email: jofIII@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:35Z (GMT). No. of bitstreams: 1 final.pdf: 4750901 bytes, checksum: b36a4d7c264b3bd9913630204f8d8a9c (MD5)   Previous issue date: 2001-05-01"
  ],
  "handle": "27546",
  "identifier_other": "etd-05052001-173519",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05052001-173519/",
  "identifier_uri": "http://hdl.handle.net/10919/27546",
  "publisher": "Virginia Tech",
  "relation_haspart": "final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Melanomphalia",
    "morphogenesis",
    "Tubaria",
    "species concepts",
    "Pleurotellus",
    "fungal biology"
  ],
  "title": "Biosystematic Studies in Crepidotus and the Crepidotaceae (Basidiomycetes, Agaricales)",
  "type": "Dissertation"
}