{
  "contributor_author": "Warner, Charles David",
  "contributor_committeecochair": [
    "Morgan, Samuel D.",
    "Creamer, Donald G."
  ],
  "contributor_committeemember": [
    "Nespor, Jan K.",
    "Fortune, Jimmie C.",
    "Wildman, Terry M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:36Z",
  "date_adate": "1999-05-20",
  "date_available": "2014-03-14T20:11:36Z",
  "date_issued": "1999-05-05",
  "date_rdate": "2000-05-20",
  "date_sdate": "1999-05-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Abstract  \tThe primary purpose of this study was to compare the opinions of community college administrators, art faculty members, and art students concerning institutional options and policy alternatives for the exhibition of controversial student art work in the community colleges of Maryland.  The research questions addressed the concept of academic freedom, the principle of institutional neutrality, and the context of the presentation.   \t Three community colleges were selected for the study.  Data were collected in two stages.  Information gathered in the first stage of this project was used to collect data during the second stage.  In phase one the researcher went to the three schools and conducted individual interviews to determine the perceived facts surrounding a controversial art incident.  The researcher recorded what the participants thought were the issues that contributed to the controversy, what principles they thought were employed in the solution, and reactions to how it was handled.  The researcher prepared a brief and objective case study of each incident. \t     \tPhase two of this project involved the researcher taking the case studies back to the three sites for group interviews.  There were three group interviews conducted at each of the three community colleges.  One group was  made up of two administrators,  another group included two or three arts faculty members, and the third group involved four or more art students.  Each group was asked to respond to questions stemming from the research areas of academic freedom, institutional neutrality, and context of the presentation.  Each group was asked to comment regarding the issues, the administrative response, and concerns in the three case studies.  Each group was asked to chose a policy from a list of three options for covering controversial student art exhibits.  \tThe results show different opinions exist between administrators, art faculty, and art students concerning academic freedom, institutional neutrality, and the exhibition of controversial student art.  It is important to note however, the opinions do not divide precisely along administrator, faculty, and student classification lines.  Most of the participants selected the policy which provided for group discussion during any controversy over student art.  There is a need for educational institutions to become proactive in this area.",
  "description_provenance": [
    "Author Email: warnerd@hcc.cc.md.us",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: samorgan@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: DGC2@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:36Z (GMT). No. of bitstreams: 1 CDWDISS1.PDF: 258262 bytes, checksum: b9d79f5ab83e60a565e3ee0f94b0cf7b (MD5)   Previous issue date: 1999-05-05"
  ],
  "handle": "27553",
  "identifier_other": "etd-050599-164700",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-050599-164700/",
  "identifier_uri": "http://hdl.handle.net/10919/27553",
  "publisher": "Virginia Tech",
  "relation_haspart": "CDWDISS1.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "academic freedom",
    "censorship"
  ],
  "title": "Opinions of Administrators, Faculty, and Students Regarding Academic Freedom and Student Artistic Expression",
  "type": "Dissertation"
}