{
  "contributor_author": "Vendemia, Jennifer Mary Coplin",
  "contributor_committeechair": "Crawford, Helen J.",
  "contributor_committeemember": [
    "Friedman, Bruce H.",
    "Prestrude, Albert M.",
    "Sturgis, Ellie T.",
    "Harrison, David W."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:36Z",
  "date_adate": "1999-05-21",
  "date_available": "2014-03-14T20:11:36Z",
  "date_issued": "1999-05-04",
  "date_rdate": "2000-05-21",
  "date_sdate": "1999-05-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Repressors, defined as individuals possessing an increased cortical sensitivity to anxiety-provoking stimuli combined with the tendency to avoid such stimuli, may be differentiated from low- and high-anxious individuals.  This study investigated behavioral performance, electrophysiological reactivity (EEG), and cardiovascular reactivity (heart rate, systolic and diastolic blood pressure) in three major coping style groups (repressors, low-anxious, and high-anxious) during low and high stressful conditions.  Conditions were rest, cognitive stress (computerized Stroop Interference Task, with and without negative emotional stimuli), and physiological stress (cool water vs. ice cold water left hand immersions).  Participants were 49 healthy, right handed university undergraduate women, chosen with Weinberger et al.'s (1979) criteria according to their differentially extreme scores on the Marlowe-Crowne Social Desirability Scale and the Spielberger Trait Anxiety Scale.  Although mixed, findings supported the proposal that these three groups utilize differential attentional strategies and interpretive biases during both neutral and negative stimuli.  In the word interference Stroop condition, reaction times (RTs) were longer for negative than neutral stimuli.  Unexpected RT differences occurred in low and high error groups across the three coping styles.  High error scoring repressors had longer RTs than low error/low-anxious; high-anxious/low error and high-anxious/high error groups did not differ.  Repressors perceived the cold water as being less distressful and painful than the low- and high-anxious groups.  No heart rate differences occurred.  Diastolic and systolic blood pressure increased following cool and cold water immersion.  Unexpectedly, the high-anxious group exhibited significantly lower diastolic blood pressure than the other groups, both at rest and following the stressors.  EEG activation pattern differences were observed.  During anticipation for cool immersion, in comparison to the high-anxious group, repressor and low-anxious groups showed less right parietal involvement suggestive of less arousal (Heller, 1993).  During cool water immersion, frontal and parietal differences were observed across groups.  During the Stroop Interference Task, repressors showed greater right frontal involvement than other groups.  The data are most supportive of Eysenck and Derakshan's (1997) four-factor theory that proposes differential and attentional biases for these three groups.  Suggestions for future research and practical applications in health fields are discussed.",
  "description_provenance": [
    "Author Email: vendemia@mindspring.com",
    "Advisor Email: bhfriedm@vt.edu",
    "Advisor Email: alpres@vt.edu",
    "Advisor Email: sturgis@vt.edu",
    "Advisor Email: dwh@vt.edu",
    "Advisor Email: hjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:36Z (GMT). No. of bitstreams: 4 JMCV_d4.PDF: 819557 bytes, checksum: 25f7a23973ccbde48bddd299a52e37e2 (MD5) JMCV_d2.PDF: 320161 bytes, checksum: 0d9a4d0eecfd88c8adbea6718b1deca1 (MD5) JMCV_d1.PDF: 161234 bytes, checksum: f89d2e761146379428575a08d218028a (MD5) JMCV_d3.PDF: 195580 bytes, checksum: 5aec22ce11bcfa10b52dd8e9ede79072 (MD5)   Previous issue date: 1999-05-04"
  ],
  "handle": "27552",
  "identifier_other": "etd-050599-122533",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-050599-122533/",
  "identifier_uri": "http://hdl.handle.net/10919/27552",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "JMCV_d4.PDF",
    "JMCV_d2.PDF",
    "JMCV_d1.PDF",
    "JMCV_d3.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "repressor coping style",
    "stroop",
    "eeg",
    "personality"
  ],
  "title": "Repressors vs. Low- and High-Anxious Coping Styles: EEG, Heart Rate, and Blood Pressure Differences During Cognitive and Cold Pressor Pain Stressors",
  "type": "Dissertation"
}