{
  "contributor_author": "McClain-Furmanski, Dennis",
  "contributor_committeechair": "Crawford, Helen J.",
  "contributor_committeemember": [
    "Harrison, David W.",
    "Bell, Martha Ann",
    "Lickliter, Robert E.",
    "Castagnoli, Neal  Jr."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:36Z",
  "date_adate": "2002-05-06",
  "date_available": "2014-03-14T20:11:36Z",
  "date_issued": "2002-05-02",
  "date_rdate": "2003-05-06",
  "date_sdate": "2002-05-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The effects of smoking cigarettes on sensory gating, P50 and stimulus-bound gamma band (32-48 Hz) oscillations were examined in two paradigms: paired-tone and oddball. During a paired-tone paradigm, our previous work (Crawford, McClain-Furmanski, Castagnoli, & Castagnoli, Neuroscience Letters 317(2002) 151-155) found heavy smokers exhibited chronic (rather than acute) effects in the frontal region: (1) larger P50 and GBO responses; (2) greater P50 and GBO sensory gating suppression, as well as earlier GBO sensory gating suppression. During an oddball paradigm, we (McClain-Furmanski, Crawford, Castagnoli & Castagnoli, in prep.) found an acute effect between 0 and 20 ms post-stimulus in the GBO, however we were unable to determine whether this effect was due to nicotine or the act of smoking.    In the present study, participants were 24 heavy cigarette (20+/day) right-handed, non-depressed smokers with no known medical or psychiatric problems, and no known familial history of psychiatric problems.  In the morning, they were tested after abstaining overnight and after smoking a cigarette containing either 1.1 mg of nicotine, or a denicotinized cigarette (< 0.04 mg). In study 1 (oddball paradigm), although some effects were found related to nicotine and/or smoking, observed as condition by group interactions with the groups changing differently across conditions, they differed in temporal and spatial localization from those hypothesized. Thus, the present study was unable to differentiate between nicotine effects and effects due to the act of smoking. In study 2 (paired-pulse paradigm), in traditional evoked potential analysis, we observed signficant chronic sensory gating, as measured by the ratio of N40-P50 amplitude in response to the second tone (S2) as compared to the response to the first tone (S1). The effect was greatest at the hypothesized location (FCZ). In time series analysis of the underlying GBO, we replicated our earlier findings in that S2/S1 effects could be detected across 60 msec of the response. These results are discussed in relation to the neurochemistry and neural processes underlying sensory gating at GBO production, as well as in relation to the known and hypothesized psychpharmacological effects of smoking tobacco. Furthermore, these results are related to the theorized basis of addiction.",
  "description_provenance": [
    "Author Email: dmcclain@vt.edu",
    "Advisor Email: hjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:36Z (GMT). No. of bitstreams: 1 McClainFurmanskiAmend.pdf: 685915 bytes, checksum: 433dc4726f191f77ff6f85c2bef4c9bb (MD5)   Previous issue date: 2002-05-02"
  ],
  "handle": "27555",
  "identifier_other": "etd-05062002-134953",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05062002-134953/",
  "identifier_uri": "http://hdl.handle.net/10919/27555",
  "publisher": "Virginia Tech",
  "relation_haspart": "McClainFurmanskiAmend.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Tobacco",
    "EEG",
    "Sensory Gating"
  ],
  "title": "Synchronized Gamma Oscillations Underlying Mid-latency Auditory Evoked Potentials: Assessment of Effects of  Psychopharmacologically Active Components of Tobacco",
  "type": "Dissertation"
}