{
  "contributor_author": "Hendry, Jamie R.",
  "contributor_committeecochair": [
    "Wokutch, Richard E.",
    "Stephens, Carroll U."
  ],
  "contributor_committeemember": [
    "Smith, Wanda J.",
    "Freeman, R. Edward",
    "Starik, Mark"
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:11:36Z",
  "date_adate": "2002-05-06",
  "date_available": "2014-03-14T20:11:36Z",
  "date_issued": "2002-05-02",
  "date_rdate": "2007-05-06",
  "date_sdate": "2002-05-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation sought to develop a grounded theory explaining how ENGOs assess the environmental performance of firms, select target industries and firms, and influence those targeted industries and firms. A preliminary model based on research in the fields of social movements, neo-institutional theory, stakeholder theory, and corporate social performance was developed. The model contained 21 propositions: seven regarding assessment, nine regarding targeting, and five regarding influencing. Interviews were conducted with 33 representatives of five ENGOs: Natural Resources Defense Council (NRDC), Greenpeace, Environmental Defense (ED), World Resources Institute (WRI), and Union of Concerned Scientists (UCS). NRDC and WRI served as pilot studies. NRDC, Greenpeace, and ED were considered case studies for the purpose of drawing inferences about the propositions. Insufficient interviews were conducted at WRI and UCS to draw inferences from them; however, data from these interviews was included in the dissertation to the extent it provided additional support for the inferences drawn. Qualitative methods were used to analyze the data. Results regarding the propositions were presented, as well as additional findings going beyond the propositions. A grounded theory of how ENGOs assess, target, and influence firms was developed based on the results; a model to accompany the grounded theory was also developed.",
  "description_provenance": [
    "Author Email: jhendry@bucknell.edu",
    "Advisor Email: wokutch@vt.edu",
    "Advisor Email: cstephen@vt.edu",
    "Advisor Email: wjsmith@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:36Z (GMT). No. of bitstreams: 1 DissHen.pdf: 542684 bytes, checksum: 0f33c1ab781f22e86f4c1af46cdb3891 (MD5)   Previous issue date: 2002-05-02"
  ],
  "handle": "27554",
  "identifier_other": "etd-05062002-093959",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05062002-093959/",
  "identifier_uri": "http://hdl.handle.net/10919/27554",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissHen.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "grounded theory",
    "stakeholder theory",
    "corporate environmental performance",
    "organizations and the natural environment",
    "environmental movement",
    "neo-institutional theory"
  ],
  "title": "Environmental NGOs and Business: A Grounded Theory of Assessment, Targeting, and Influencing",
  "type": "Dissertation"
}