{
  "contributor_author": "Reynolds, Gregory Durelle",
  "contributor_committeechair": "Lickliter, Robert E.",
  "contributor_committeecochair": "Cooper, Robin K. Panneton",
  "contributor_committeemember": [
    "Harrison, David W.",
    "Bell, Martha Ann",
    "Hoffman, Kurt A."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:37Z",
  "date_adate": "2002-05-15",
  "date_available": "2014-03-14T20:11:37Z",
  "date_issued": "2002-05-02",
  "date_rdate": "2003-05-15",
  "date_sdate": "2002-05-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Prenatal sensory stimulation can have facilitative or interfering effects upon subsequent perceptual learning and development in bobwhite quail.  Exposure to moderate amounts of unimodal prenatal sensory stimulation has been shown to accelerate early intersensory responsiveness, while exposure to concurrent prenatal bimodal sensory stimulation has been shown to interfere with perceptual learning and development.  An immediate mechanism that may underlie this developmental intersensory interference is the arousal level of the organism associated with exposure to prenatal bimodal stimulation.  Concurrent bimodal stimulation is known to elicit significantly higher levels of behavioral arousal and heart rate in bobwhite quail embryos.  This study investigated the possibility that increased arousal associated with prenatal bimodal stimulation could have enduring effects upon subsequent postnatal behavioral organization and perceptual abilities in bobwhite quail.  \tSubjects were exposed to one of three prenatal stimulation regimes: (a) concurrent bimodal (auditory/visual) stimulation, (b) unimodal auditory stimulation, or (c) no supplemental stimulation.  Chicks exposed to concurrent prenatal bimodal stimulation demonstrated significantly greater levels of behavioral activity as well as decreased social behavior in the open-field when compared to unimodal auditory subjects and controls.  Additionally, prenatal bimodal exposure may have led to a failure to utilize multimodal maternal cues in determining species-specific perceptual preferences in the days following hatching.  All exposure groups demonstrated postnatal auditory learning of a maternal call, thus no interference effect was found for concurrent prenatal bimodal stimulation on postnatal auditory learning.  These results suggest that concurrent prenatal bimodal stimulation has enduring effects upon postnatal behavioral arousal that may impact perceptual responsiveness of bobwhite quail in the days following hatching.",
  "description_provenance": [
    "Author Email: greynold@vt.edu",
    "Advisor Email: dwh@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: khoffma@vt.edu",
    "Advisor Email: licklite@fiu.edu",
    "Advisor Email: cooperr@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:37Z (GMT). No. of bitstreams: 1 01Reynoldsdissertation.pdf: 318344 bytes, checksum: 9149afb86d16ea5856cbbc6f908af055 (MD5)   Previous issue date: 2002-05-02"
  ],
  "handle": "27556",
  "identifier_other": "etd-05062002-190928",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05062002-190928/",
  "identifier_uri": "http://hdl.handle.net/10919/27556",
  "publisher": "Virginia Tech",
  "relation_haspart": "01Reynoldsdissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "bobwhite quail",
    "perceptual development",
    "behavioral arousal"
  ],
  "title": "Effects of Prenatal Sensory-Evoked Arousal on Postnatal Behavior and Perceptual Responsiveness in Bobwhite Quail (Colinus virginianus)",
  "type": "Dissertation"
}