{
  "contributor_author": "Wright, Linda F.",
  "contributor_committeechair": "Tripp, Norman Wayne",
  "contributor_committeemember": [
    "Earthman, Glen I.",
    "Craig, James R.",
    "Brewer, B. J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:36Z",
  "date_adate": "2011-06-13",
  "date_available": "2014-03-14T20:11:36Z",
  "date_issued": "2011-04-22",
  "date_rdate": "2011-06-13",
  "date_sdate": "2011-05-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html xmlns=\"http://www.w3.org/1999/xhtml\"> <head> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" /> <title>Linda F. Wright Abstract</title> </head>  <body> <p>The  purpose of the study was to identify student summer activities and determine  whether a relationship exists between the activities and mathematics testing  change scores measured from spring to fall. This current effort built upon  research conducted by Heyns (1978), Burkam et al. (2004), Downey et al. (2004),  and Alexander et al. (2007). The commonality in findings that existed among all  of these efforts was that learning loss occurred in the absence of instruction  such as that experienced during the normal school term. A quantitative,  correlational study was conducted using a survey method which requested that  parents answer questions concerning the nature of activities and daily structure  experienced by their children during the summer break. </p> <p>The Group Mathematics Assessment and  Diagnostic Evaluation (GMADE) testing platform was  used to generate quantitative measurements of  mathematics skills for exiting second graders in the spring of 2010 and for  these same students as entering third graders in the fall of 2010. A voluntary  sample of 57 students from elementary schools in a suburban school district in Southwestern Virginia participated in the testing process.  At the conclusion of all testing and at the point at which all surveys were  completed, student scoring differentials from spring to fall were compared to  the activity and daily structure components reported in the survey for  potential correlations between that information and mean gain test results.  </p> <p>This study sought potential correlations between types of  summer activities and documented change between mathematics spring and fall  test scores. Results of data analysis from this research will assist leaders in  understanding whether activities bear a relationship to mathematics score  changes. Should those relationships be established, the findings would assist  leaders in determining which activities should be encouraged or discouraged  during the summer break to avoid score declines. The findings indicated that  though summer mathematics learning loss did occur for the participants, no  correlation between activities and test score change could be established. Implications  of these findings and suggestions for the future are presented in the final  chapter.</p> </body> </html>",
  "description_provenance": [
    "Author Email: lfwright@rcs.k12.va.us",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: jcraig44@vt.edu",
    "Advisor Email: bjbrewer@ameliaschools.com",
    "Advisor Email: wtripp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:36Z (GMT). No. of bitstreams: 1 Wright_LF_D_2011.pdf: 2531899 bytes, checksum: 0c390fb24c2040691956af053f5a2480 (MD5)   Previous issue date: 2011-04-22"
  ],
  "handle": "27550",
  "identifier_other": "etd-05052011-121508",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05052011-121508/",
  "identifier_uri": "http://hdl.handle.net/10919/27550",
  "publisher": "Virginia Tech",
  "relation_haspart": "Wright_LF_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Keywords: summer learning loss",
    "year-round education",
    "summer break"
  ],
  "title": "An Identification of Student Summer Activities and Their Relationship to Mathematics Testing Performance Measured From Spring to Fall",
  "type": "Dissertation"
}