{
  "contributor_author": "Keller, Melissa Dawn",
  "contributor_committeechair": "Schmale, David G. III",
  "contributor_committeemember": [
    "Vinatzer, Boris A.",
    "Thomason, Wade E.",
    "Baudoin, Antonius B. A. M."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:11:38Z",
  "date_adate": "2011-05-12",
  "date_available": "2014-03-14T20:11:38Z",
  "date_issued": "2011-04-26",
  "date_rdate": "2011-05-12",
  "date_sdate": "2011-05-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Fusarium head blight (FHB) is one of the most economically important diseases of small grains and continues to impact crops when environmental conditions are favorable to Gibberella zeae (Fusarium graminearum), the causal agent of the disease.  Corn residues are considered to be primary sources of inoculum for epidemics of FHB.  Therefore, knowledge of the movement of Gibberella zeae from a local source of infested corn residue is critical to the management of FHB in wheat and barley.  Previous research made significant progress in defining the spatial dissemination of inoculum sources of G. zeae within agricultural fields, but was unable to clearly distinguish between within-field and background sources.  Using amplified fragment length polymorphism, released clones of G. zeae were tracked within wheat and barley fields.  This strategy allowed the distinction between the contributions of released clones to FHB, compared to that of background inocula.  Corn residue infested with clones of G. zeae was placed into small replicated plots in winter wheat fields in New York and Virginia in 2007 and 2008 and wheat spikes were collected at 0, 3, 6, and â ¥24 m from the inoculum sources.  Recovery of released clones decreased an average of 90% between 3 and 6 m from inoculum sources.  Various amounts of corn residue infested with a single clone of G. zeae were placed into small replicated plots in winter wheat and barley fields in Virginia from 2008 to 2010.  The use of minimal or conventional tillage and a moderately resistant cultivar of wheat or barley may reduce the contribution of within-field inocula to FHB; however, environmental conditions play an important role in the effectiveness of these management strategies. With the increase of corn production due to incentives for ethanol-based fuel, overwintering sites for G. zeae on corn residue are likely to increase.  Our work contributes to an increased understanding of the influence of overwintered corn residue to FHB which will also direct future research on how to reduce the inoculum potential from within-field sources.",
  "description_provenance": [
    "Author Email: keller23@vt.edu",
    "Advisor Email: vinatzer@vt.edu",
    "Advisor Email: wthomaso@vt.edu",
    "Advisor Email: dschmale@vt.edu",
    "Advisor Email: abaudoin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:38Z (GMT). No. of bitstreams: 1 Keller_MD_D_2011.pdf: 1626248 bytes, checksum: 4dea2327a15de0bde2c66a9cd7cb867e (MD5)   Previous issue date: 2011-04-26"
  ],
  "handle": "27565",
  "identifier_other": "etd-05062011-114409",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05062011-114409/",
  "identifier_uri": "http://hdl.handle.net/10919/27565",
  "publisher": "Virginia Tech",
  "relation_haspart": "Keller_MD_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Fusarium head blight",
    "scab",
    "amplified fragment length polymorphism",
    "Fusarium graminearum",
    "Gibberella zeae"
  ],
  "title": "The Contribution of Within-Field Inoculum Sources of Gibberella zeae to Fusarium Head Blight in Winter Wheat and Barley",
  "type": "Dissertation"
}