{
  "contributor_author": "Bradshaw, Yvonne M.",
  "contributor_committeecochair": [
    "Madison-Colmore, Octavia D.",
    "Cline, Marvin Gerald"
  ],
  "contributor_committeemember": [
    "Hohenshil, Thomas H.",
    "Capps, C. Frederick",
    "McGrady, Harold J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:39Z",
  "date_adate": "2001-05-08",
  "date_available": "2014-03-14T20:11:39Z",
  "date_issued": "2001-05-01",
  "date_rdate": "2002-05-08",
  "date_sdate": "2001-05-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to (a) identify educational counseling interventions and accommodations that learning disabled (LD) postsecondary students received that contributed to their academic success and (b) identify barriers and issues that LD students experienced in accessing services. Ten postsecondary students were identified and classified as LD that had attended a community college in Northern Virginia and volunteered to participate in this study.  Out of the ten, two students were selected for this research study.  These students were interviewed using a two-part questionnaire (Appendix C).  The questionnaire included significant factors and variables frequently associated with postsecondary success.  Questions in part I of the Questionnaire pertained to the LD student창  s profile (e.g., medical and social history, employment, volunteer work, hobbies, education including special education experiences, language therapy, and assessments).  Questions in part II consisted of the recommended support services identified in the literature (e.g., disability awareness, accommodations, self-advocacy skills, academic remediation, parent and counselor advocacy, computer technology, career counseling, transition services, and rehabilitation counseling) often delivered to LD students.  Psychological and educational assessments were also obtained, reviewed, and coded. The interviews were tape recorded in order to assure concise descriptive information from the student창  s own 창  personal창   past and current educational experiences.  Each student reported that they had received a great deal of assistance by another individual who had been most instrumental in helping them over come their postsecondary academic barriers.  These individuals were also interviewed.  The interviews were transcribed, and the data collected were coded. Two in-depth comprehensive case studies were developed by reviewing and recording data from the interviews, psychological assessments, and educational records.  All narrative material was subsequently analyzed by coding procedures used in grounded theory.",
  "description_provenance": [
    "Author Email: ymbrad@erols.com",
    "Advisor Email: omadison@vt.edu",
    "Advisor Email: mcline@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:39Z (GMT). No. of bitstreams: 3 Vita.pdf: 9387 bytes, checksum: 6ba3e270ad86574cb1c5a8e42ca19970 (MD5) PartI.pdf: 29389 bytes, checksum: a992d604f682741e6be9c7e1ee085604 (MD5) PartII.pdf: 868838 bytes, checksum: ecb929f12faf1eb0e55af6455bd643b3 (MD5)   Previous issue date: 2001-05-01"
  ],
  "handle": "27568",
  "identifier_other": "etd-05072001-105417",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05072001-105417/",
  "identifier_uri": "http://hdl.handle.net/10919/27568",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Vita.pdf",
    "PartI.pdf",
    "PartII.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Postsecondary College Students",
    "Anxiety Disorders",
    "Accommodations",
    "Auditory Processing Deficits",
    "Learning Disabilities"
  ],
  "title": "Case Studies of Postsecondary College Students with Learning Disabilities",
  "type": "Dissertation"
}