{
  "contributor_author": "Stamos, Dimitrios Georgios",
  "contributor_committeecochair": [
    "Hajj, Muhammad R.",
    "Telionis, Demetri P."
  ],
  "contributor_committeemember": [
    "Plaut, Raymond H.",
    "Diplas, Panayiotis",
    "Hendricks, Scott L."
  ],
  "contributor_department": "Engineering Mechanics",
  "date_accessioned": "2014-03-14T20:11:39Z",
  "date_adate": "2000-05-09",
  "date_available": "2014-03-14T20:11:39Z",
  "date_issued": "2000-04-27",
  "date_rdate": "2001-05-09",
  "date_sdate": "2000-05-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An experimental investigation of the interaction of water waves with flexible structures acting as breakwaters was carried out. Wave profiles, mapped out by water level measuring transducers, were studied to provide information on the performance of different breakwater models. A new signal analysis procedure for determining reflection coefficients based on wavelet theory was developed and compared to a conventional method. The reliability of using wavelet analysis to separate a partial standing wave into incident and reflected wave components was verified with a numerical example. It was also verified by the small variance in the estimates of the incident wave height from independent experimental measurements. Different geometries of rigid and flexible structures were constructed and examined. Reflection, transmission and energy loss coefficients were obtained over them. The influence of various properties of the models, such as the width and the internal pressure, on the effectiveness in reflecting or absorbing the incident wave energy was determined. Various factors which affect the performance of the breakwater, including the water depth, the wave length and the wave amplitude, were measured and documented. Suspended and bottom-mounted models were considered. The flow field over and near a hemi-cylindrical breakwater model was also examined using a flow visualization technique. An overall comparison among the models has also been provided. The results showed that the rectangular models, rigid and flexible, are the most effective structures to dissipate wave energy. The flow visualization technique indicated that the flow conforms with the circular geometry of a hemi-cylindrical breakwater model, yielding no flow separation.",
  "description_provenance": [
    "Author Email: dstamos@vt.edu",
    "Advisor Email: rplaut@vt.edu",
    "Advisor Email: pdiplas@vt.edu",
    "Advisor Email: hndrxsl@vt.edu",
    "Advisor Email: mhajj@vt.edu",
    "Advisor Email: telionis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:39Z (GMT). No. of bitstreams: 1 Final.pdf: 12000781 bytes, checksum: ed65fd0c39c5f1a78423927b00a7e140 (MD5)   Previous issue date: 2000-04-27"
  ],
  "handle": "27567",
  "identifier_other": "etd-05072000-17180046",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05072000-17180046/",
  "identifier_uri": "http://hdl.handle.net/10919/27567",
  "publisher": "Virginia Tech",
  "relation_haspart": "Final.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Morlet wavelet",
    "reflection",
    "transmission and energy loss coefficients",
    "flexible breakwaters",
    "flow visualization"
  ],
  "title": "Experimental Analysis of the Interaction of Water Waves With Flexible Structures",
  "type": "Dissertation"
}