{
  "contributor_author": "Severance, Paul Michael",
  "contributor_committeechair": "Wiswell, Albert W.",
  "contributor_committeemember": [
    "Hardy, Christopher R.",
    "McAleer, George",
    "Alfieri, Paul A.",
    "Boucouvalas, Marcie"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:37Z",
  "date_adate": "2005-06-24",
  "date_available": "2014-03-14T20:11:37Z",
  "date_issued": "2005-04-25",
  "date_rdate": "2005-06-24",
  "date_sdate": "2005-05-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The sea state changes that have occurred in the global security arena since the fall of the Berlin Wall and the demise of the Soviet Union dramatically transformed the U.S. interagency national security process.  More recently, the tragic events of 9-11 have further refocused national security endeavors inward to homeland security imperatives while Operations Enduring Freedom and Iraqi Freedom have revalidated the need effective interagency coordination.  This research represents a â  first cutâ   at characterizing the construct of unity of effort in the interagency national security process by identifying attributes of this organizational virtue.  The intent was to examine the dimensionality of the construct and thus facilitate theory building by consolidating extant knowledge and identifying key success factors as well as elements threatening operational success. This study focused on the interagency national security policy process and was intended to accommodate a wider understanding of unity of effort as it applies to that area of endeavor. Multiple interviews, focus groups, and surveys from 448 military and civilian adult respondents were used in the analysis. Content analysis, analysis of variance, and principle component analysis were the primary analytic methods used.  The most conceptually sound factor structure for organizational unity of effort consisted of four factors: (a) Organizational Context and Interpersonal Dynamics, (b) Leadership and Decision Making Structure, (c) Strategic Orientation, and (d) Organizational Infrastructure and Resources. The detailed examination of this construct produced clearly acceptable internal reliability coefficients on all scales and relatively strong evidence of construct validity in the related factor analyses. Separate internal factor structures were investigated for two test groups drawn from the sample population. Although there was not perfect fidelity in the two derived factor structures, sufficient internal structures emerged that strongly validated the underlying factor structure for organizational unity of effort. This factor structure remained relatively stable when examined for selected demographic sub-groups drawn from the larger sample.  The clear relationships of this factor construct revealed strong empirical support for a theoretical basis for the construct of organizational unity of effort. Moreover, the results of this study offer the potential for development of a simple and valid conceptualization of organizational unity of effort. It is hoped that this research serves to advance a conceptual framework that helps the interagency national security community evaluate unity of effort in the national security policy process and create new or reconfigure existing organizational entities in response to threats to U.S. national security.",
  "description_provenance": [
    "Author Email: severancep@ndu.edu",
    "Advisor Email: chris.hardy@dau.mil",
    "Advisor Email: mcaleerg.@cox.net",
    "Advisor Email: paul.alfieri@dau.mil",
    "Advisor Email: awiswell@vt.edu",
    "Advisor Email: marcie9@attglobal.net",
    "Made available in DSpace on 2014-03-14T20:11:37Z (GMT). No. of bitstreams: 1 Severance.pdf: 3417701 bytes, checksum: 8311261986f3745fb52b2ed0e3bde0ed (MD5)   Previous issue date: 2005-04-25"
  ],
  "handle": "27561",
  "identifier_other": "etd-05062005-145638",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05062005-145638/",
  "identifier_uri": "http://hdl.handle.net/10919/27561",
  "publisher": "Virginia Tech",
  "relation_haspart": "Severance.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Unity of effort",
    "coordination",
    "national security",
    "interagency"
  ],
  "title": "Characterizing the Construct of Organizational Unity of Effort In the Interagency National Security Policy Process",
  "type": "Dissertation"
}