{
  "contributor_author": "Ozolins, Peter Charles",
  "contributor_committeechair": "Rodriguez-Camilloni, Humberto L.",
  "contributor_committeemember": [
    "Jones, James R.",
    "Grossman, Lawrence S.",
    "Tlou, Josiah S."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:11:38Z",
  "date_adate": "2010-05-07",
  "date_available": "2014-03-14T20:11:38Z",
  "date_issued": "2010-04-30",
  "date_rdate": "2010-05-07",
  "date_sdate": "2010-05-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Buildings have significant and complex impacts both in their construction and in their use. Green building rating systems have been developed and promoted in more economically-advanced countries to offer guidelines to reduce negative impacts and to promote sustainable practices of building construction and operations. The green building rating system called Leadership in Energy and Environmental Design (LEED), established in 1995 by the U.S. Green Building Council, is increasingly accepted as a meaningful measure for sustainability in building design and construction in the U.S.  The Building Research Establishment Environmental Assessment Method (BREEAM) rating system in the U.K. and the Green Star rating system in Australia serve similar roles in their respective areas. How applicable are these green building rating systems to countries with different building cultures, climates and economic parameters?  The research is based on my work as an architect and participant observer using case study analysis of several buildings that I have designed in Madagascar and Tanzania.  The research indicates that several important aspects particular to the developing country contexts of Madagascar and Tanzania â   such as labor and security - are not addressed by existing green building rating systems that have been developed in the context of more economically-advanced countries. Such rating systems typically give prominence to aspects such as mechanical systems and indoor air quality that are of limited relevance to the contexts of Madagascar and Tanzania.  The results have implications for the development of green building rating systems that address the particular contexts of developing countries. By taking into account parameters such as those found in Madagascar and Tanzania and similar developing countries, the benefits of using an accepted measure of sustainability can be more effectively extended to the developing country sector.",
  "description_provenance": [
    "Author Email: peter@peterozolinsarchitect.com",
    "Advisor Email: wolverine@vt.edu",
    "Advisor Email: lgrossmn@vt.edu",
    "Advisor Email: hcami@vt.edu",
    "Advisor Email: tlou@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:38Z (GMT). No. of bitstreams: 1 POdissertationFINAL.pdf: 40296313 bytes, checksum: cd9d31e5f643f63058d09bcce055e303 (MD5)   Previous issue date: 2010-04-30"
  ],
  "handle": "27563",
  "identifier_other": "etd-05062010-150249",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05062010-150249/",
  "identifier_uri": "http://hdl.handle.net/10919/27563",
  "publisher": "Virginia Tech",
  "relation_haspart": "POdissertationFINAL.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "construction",
    "architecture",
    "sustainability",
    "developing countries",
    "green building"
  ],
  "title": "Assessing Sustainability in Developing Country Contexts: The Applicability of Green Building Rating Systems to Building Design and Construction in Madagascar and Tanzania",
  "type": "Dissertation"
}