{
  "contributor_author": "Reed, Tracy Nelson",
  "contributor_committeechair": "Jenkins, James Gregory",
  "contributor_committeemember": [
    "Kumar, Raman",
    "Bhattacharjee, Sudip",
    "Oler, Mitchell J.",
    "Salbador, Debra A."
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:11:38Z",
  "date_adate": "2010-05-20",
  "date_available": "2014-03-14T20:11:38Z",
  "date_issued": "2010-05-03",
  "date_rdate": "2011-12-23",
  "date_sdate": "2010-05-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examines the effect of accountability and client risk on auditor efficiency and effectiveness during an audit review task.  I considered two types of accountability.  The first type is outcome accountability, which represents the type of accountability in the current audit review process.  The second type of accountability is process accountability, which is not currently utilized in the audit review process.  I also examined two levels of client risk (high and low) because client risk has been shown to impact efficiency and effectiveness of the audit review process.  An internet-based experimental instrument was utilized for this study.  Participants were practicing auditors.<p> \tFindings indicate that process accountability improved performance by exhibiting both an increase in identification of errors and a decrease in likelihood of agreement with the preparer.  Findings also show that process accountability decreases efficiency by increasing overall time to complete the study and the amount of information reviewed.  These results suggest that process accountability, the act of documenting the process used to perform a task, may reduce the chances of audit failure, making the reduction in efficiency acceptable.  <p> \t I also find that participants in the process accountability and high risk groups may have experienced information overload.  Both high client risk and process accountability have been shown to increase attention to information and time spent on a task.  A decrease in errors   identified by individuals in this group when compared to individuals in the process accountability and low risk group may indicate information overload.  Also, attrition rates and followup responses from participants who did not complete the study indicate that information overload may have been an issue for participants in the process accountability/high risk group.",
  "description_provenance": [
    "Author Email: tnreed@vt.edu",
    "Advisor Email: rkumar@vt.edu",
    "Advisor Email: sudipb@vt.edu",
    "Advisor Email: greg.jenkins@vt.edu",
    "Advisor Email: moler@vt.edu",
    "Advisor Email: salbador@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:38Z (GMT). No. of bitstreams: 4 Reed_TN_D_2010_IRBApprovalAmendment.pdf: 228401 bytes, checksum: ebc997197799a8c66c82d0aa3625a0ca (MD5) Reed_TN_D_2010_Copyright.pdf: 18243 bytes, checksum: 47d6d3c7be687fad9110dab1e54d46a4 (MD5) Reed_TN_D_2010.pdf: 3329335 bytes, checksum: 30b378adcbe35c135e694c95efe61320 (MD5) Reed_TN_D_2010_IRBApproval.pdf: 230928 bytes, checksum: b5946c29fe590846b1bc5fcb8e9f6707 (MD5)   Previous issue date: 2010-05-03"
  ],
  "handle": "27564",
  "identifier_other": "etd-05062010-153513",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05062010-153513/",
  "identifier_uri": "http://hdl.handle.net/10919/27564",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Reed_TN_D_2010_IRBApprovalAmendment.pdf",
    "Reed_TN_D_2010_Copyright.pdf",
    "Reed_TN_D_2010.pdf",
    "Reed_TN_D_2010_IRBApproval.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Audit Efficiency",
    "Client Risk",
    "Audit Effectiveness",
    "Accountability",
    "Audit Review"
  ],
  "title": "The Effect of Process Accountability on the Evaluation of Audit Evidence: An Examination of the Audit Review Process",
  "type": "Dissertation"
}