{
  "contributor_author": "Ryu, Sang-Ouk",
  "contributor_committeechair": "Desu, Seshu B.",
  "contributor_committeecochair": "Reynolds, William T. Jr.",
  "contributor_committeemember": [
    "Yoo, In Kyeong",
    "Claus, Richard O.",
    "Joshi, Pooran C."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:11:38Z",
  "date_adate": "1999-05-12",
  "date_available": "2014-03-14T20:11:38Z",
  "date_issued": "1999-05-03",
  "date_rdate": "2000-05-12",
  "date_sdate": "1999-05-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The (1-x)SrBi2Ta2O9-xBi3TaTiO9 thin films fabricated by modified metalorganic solution deposition technique showed much improved properties compared to SrBi2Ta2O9: a leading candidate material for memory applications. A pyrochlore free crystalline phase was obtained at a low annealing temperature of 600 oC and grain size was found to be considerably increased for the (1-x)SrBi2Ta2O9-xBi3TaTiO9 compositions. The film properties were found to be strongly dependent on the composition and annealing temperatures. The measured dielectric constant of the thin films was in the range 180-225 for films with 10-50 mol % of Bi3TaTiO9 content in the solid solution. Ferroelectric properties of (1-x)SrBi2Ta2O9-xBi3TaTiO9 thin films were significantly improved compared to SrBi2Ta2O9. For example, the observed 2Pr and Ec values for films with 0.7SrBi2Ta2O9-0.3Bi3TaTiO9 composition, annealed at 650 oC, were 12.4 micro C/cm2 and 80 kV/cm, respectively. The solid solution thin films showed less than 5 % decay of the polarization charge after 10^10 switching cycles and good memory retention characteristics after about 10^6 s of memory retention. The size and temperature effect of 0.7SrBi2Ta2O9-0.3Bi3TaTiO9 thin films were studied by determining how the ferroelectric properties vary with film thickness and temperature. It was found that the ferroelectric properties were determined by the grain size, and not by the thickness of the film in our studied thickness range of 80-350 nm. A 80 nm thick film showed good ferroelectric properties similar to the 350 nm thick film. Thermal stability of  the 0.7SrBi2Ta2O9-0.3Bi3TaTiO9 thin film was found to be much better compared to the SrBi2Ta2O9 and Pb(Zr,Ti)O9 thin films due to its higher Curie temperature and lower Schottky activation energy according to temperature changes. Also, 0.7SrBi2Ta2O9-0.3Bi3TaTiO9 thin films has shown good ferroelectric properties on multilayer system such as PtRh/PtRhOx/poly-Si suggest their suitability for high density FRAM applications.",
  "description_provenance": [
    "Author Email: saryu@vt.edu",
    "Advisor Email: inyoo@vt.edu",
    "Advisor Email: sdesu@ecs.umass.edu",
    "Advisor Email: reynols@vt.edu",
    "Advisor Email: roclaus@vt.edu",
    "Advisor Email: joshipc@aol.com",
    "Made available in DSpace on 2014-03-14T20:11:38Z (GMT). No. of bitstreams: 8 Chapter1.pdf: 803518 bytes, checksum: 4de4a6d6b40ea3973a5f07696c81c10f (MD5) Chapter5.pdf: 187087 bytes, checksum: f4fbd27981ff00abc76004a8802a4c82 (MD5) CHAPT2.PDF: 333380 bytes, checksum: 607945097dfe11ac37812d3fd856c490 (MD5) Chapter6.pdf: 149058 bytes, checksum: 050aa5ee629c05f35651d3033904b69d (MD5) Captions.pdf: 26518 bytes, checksum: 889813a3e6977ddae4233a3b84d865c8 (MD5) Chapter3.pdf: 433086 bytes, checksum: 455d78f95fd9b070fd3b2cb682483730 (MD5) Chapter4.pdf: 261570 bytes, checksum: 22213748b0c026854ffa4af4dc3b0504 (MD5) Title_abs.pdf: 9180 bytes, checksum: a5bcbc0053724fbad4edfa2f4040d1ba (MD5)   Previous issue date: 1999-05-03"
  ],
  "handle": "27566",
  "identifier_other": "etd-050699-154541",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-050699-154541/",
  "identifier_uri": "http://hdl.handle.net/10919/27566",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter1.pdf",
    "Chapter5.pdf",
    "CHAPT2.PDF",
    "Chapter6.pdf",
    "Captions.pdf",
    "Chapter3.pdf",
    "Chapter4.pdf",
    "Title_abs.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Ferroelectrics",
    "Strontium Bismuth Tantalate",
    "Thin films"
  ],
  "title": "Synthesis and Characterization of Ferroelectric (1-x)SrBi2Ta2O9-xBi3TaTiO9 thin films for Non-volatile memory Applications",
  "type": "Dissertation"
}