{
  "contributor_author": "Tomblin, David Christian",
  "contributor_committeechair": "Barrow, Mark V. Jr.",
  "contributor_committeemember": [
    "Patzig, Eileen Crist",
    "Allen, Barbara L.",
    "Hull, Robert Bruce IV"
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:11:40Z",
  "date_adate": "2009-06-01",
  "date_available": "2014-03-14T20:11:40Z",
  "date_issued": "2009-04-27",
  "date_rdate": "2011-04-25",
  "date_sdate": "2009-05-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The main argument of this dissertation is that the White Mountain Apache Tribeâ  s appropriation of ecological restoration played a vital role in reinstituting control over knowledge production and eco-cultural resources on the Fort Apache Indian Reservation in the second half of the twentieth century. As a corollary, I argue that the shift in knowledge production practices from a paternalistic foundation to a community-based approach resulted in positive consequences for the ecological health of the Apachean landscape and Apache culture. The democratization of science and technology on the reservation, therefore, proved paramount to the reestablishment of a relatively sustainable Apache society. <p> Beginning with the Indian New Deal, the White Mountain Apache slowly developed the capacity to employ ecological restoration as an eco-political tool to free themselves from a long history of Euro-American cultural oppression and natural resource exploitation. Tribal restoration projects embodied the dual political function of cultural resistance to and cultural exchange with Western-based land management organizations. Apache resistance challenged Euro-American notions of restoration, nature, and sustainability while maintaining cultural identity, reasserting cultural autonomy, and protecting tribal sovereignty. But at the same time, the Apache depended on cultural exchange with federal and state land management agencies to successfully manage their natural resources and build an ecologically knowledgeable tribal workforce.  <p> Initially adopting a utilitarian conservation model of land management, restoration projects aided the creation of a relatively strong tribal economy. In addition, early successes with trout, elk, and forest restoration projects eventually granted the Tribe political leverage when they sought to reassume control over reservation resources from the Bureau of Indian Affairs and the Fish and Wildlife Service. Building on this foundation, Apache restoration work significantly diverged in character from the typical Euro-American restoration project by the 1990s. While striving toward self-sufficiency, the Tribe hybridized tribal cultural values with Western ecological values in their restoration efforts. These projects evolved the tripartite capacity to heal ecologically degraded reservation lands, to establish a degree of economic freedom from the federal government, and to restore cultural traditions. Having reversed their historical relationship of subjugation with government agencies, the Apache currently have almost full decision-making powers over tribal eco-cultural resources.",
  "description_provenance": [
    "Author Email: dtomblin@vt.edu",
    "Advisor Email: barrow@vt.edu",
    "Advisor Email: ecrist@vt.edu",
    "Advisor Email: ballen@vt.edu",
    "Advisor Email: hullrb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:40Z (GMT). No. of bitstreams: 1 Tomblin_Dissertation_ETD3.pdf: 5806225 bytes, checksum: 8ed7674d4f4033c847bf374d455bf929 (MD5)   Previous issue date: 2009-04-27"
  ],
  "handle": "27577",
  "identifier_other": "etd-05072009-225418",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05072009-225418/",
  "identifier_uri": "http://hdl.handle.net/10919/27577",
  "publisher": "Virginia Tech",
  "relation_haspart": "Tomblin_Dissertation_ETD3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Ecological Restoration",
    "Eco-cultural Resources",
    "Natural Resource Management",
    "Fish and Wildlife Service",
    "Boundary Work",
    "Native Americans",
    "White Mountain Apache Tribe",
    "Bureau of Indian Affairs"
  ],
  "title": "Managing Boundaries, Healing the Homeland: Ecological Restoration and the Revitalization of the White Mountain Apache Tribe, 1933 â   2000",
  "type": "Dissertation"
}