{
  "contributor_author": "Beidler, Kyle Joseph",
  "contributor_committeechair": "Miller, Patrick A.",
  "contributor_committeemember": [
    "Bork, Dean R.",
    "Zahm, Diane L.",
    "Koebel, Charles Theodore"
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:11:39Z",
  "date_adate": "2007-05-21",
  "date_available": "2014-03-14T20:11:39Z",
  "date_issued": "2007-05-04",
  "date_rdate": "2010-05-21",
  "date_sdate": "2007-05-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "New Urbanism is an all-encompassing term that refers to an increasingly popular set of design tenets that draw upon traditional urban forms in the creation or redevelopment of residential communities.  Although design professionals are increasingly adopting these design tenets in the creation of new communities, there is no research that either supports or rejects New Urbanismâ  s underlying assumption that neotraditional design tenets are capable of fostering a â  sense of place.â    Therefore, this research explores how a â  sense of placeâ   arises for residents of a neotraditional neighborhood located in Blacksburg, Virginia.  This research then investigates the influence physical form has on the development of a sense of place for the individuals living within this community.   <p> In an attempt to answer these questions, this research project employs an existential-phenomenological approach to understand the specified people-place relationships.  The transformation of space into place for the participants living within the study area was consistent with two distinct, existing theories regarding the development of a sense of place.  Analysis indicates that social interaction in the form of un-structured chance encounters with neighbors heavily influences the transformation of mere space into place.  Further analysis indicates that such encounters are not directly related to density.  Rather, the proximity of the housing, the connection between the public and private realm, and the relationship of the housing to the un-built environment all emerge as key factors in encouraging such residential experiences.  The results are discussed in the context of TND design tenets and a theory of neighborhood design is presented.",
  "description_provenance": [
    "Author Email: kbeidler@vt.edu",
    "Advisor Email: pmiller@vt.edu",
    "Advisor Email: drbork@vt.edu",
    "Advisor Email: dzahm@vt.edu",
    "Advisor Email: tkoebel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:39Z (GMT). No. of bitstreams: 3 s06-036.pdf: 164894 bytes, checksum: 8630f0e15b7a14c384f65e212dd43b6d (MD5) s06-036Cont1.pdf: 157740 bytes, checksum: c42f71c93ad4456ec58c0bf89e8b3184 (MD5) SenseofPlaceandNewUrbanism.pdf: 2801852 bytes, checksum: 35efa6233db66b1c1fe30e036ae85073 (MD5)   Previous issue date: 2007-05-04"
  ],
  "handle": "27571",
  "identifier_other": "etd-05072007-161545",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05072007-161545/",
  "identifier_uri": "http://hdl.handle.net/10919/27571",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "s06-036.pdf",
    "s06-036Cont1.pdf",
    "SenseofPlaceandNewUrbanism.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "community design",
    "new urbanism",
    "sense of place"
  ],
  "title": "Sense of Place and New Urbanism: Towards a Holistic Understanding of Place and Form",
  "type": "Dissertation"
}