{
  "contributor_author": "Lee, Hae-Seung",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Esker, Alan R.",
    "Davis, Richey M.",
    "Dillard, John G.",
    "Riffle, Judy S."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:11:39Z",
  "date_adate": "2009-06-04",
  "date_available": "2014-03-14T20:11:39Z",
  "date_issued": "2009-04-24",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-05-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The potential success of a proton exchange membrane (PEM) fuel cell as an alternative energy source depends highly upon the development of high performance PEMs.  Typically, state-of-the-art PEMs have been perfluorinated sulfonated ionomer membranes such as Nafion® by DuPont. Although these membranes demonstrate good mechanical and electrochemical properties under moderate operating conditions (e.g., < 80 ºC), their performance at high temperature (e.g., > 80 ºC) and low relative humidity (RH) drastically deteriorates. To overcome these problems, PEM materials with enhanced properties are essential.   Recently, the McGrath group has shown that PEM materials with hydrophilic-hydrophobic segments can significantly improve proton conductivity under low RH by forming enhanced hydrophilic domain connectivity.   In this dissultation, novel multiblock copolymers based on disulfonated hydrophilic-hydrophobic multiblocks were synthesized and investigated for their potential application as PEMs.  The relationship between copolymer chemical composition and resulting properties was probed with a variety of hydrophilic and hydrophobic segments.  Most multiblock copolymers in this research were developed with fully disulfonated poly(arylene ether sulfone) (BPS100) as the hydrophilic segment,   and various high performance polymers including polyimides, poly(arylene ether sulfone)s, and poly(arylene ether ketone)s as the hydrophobic segment. Ionic groups on the hydrophilic blocks act as proton conducting sites, while the non-ionic hydrophobic segments provide mechanical and dimensional stability. The correlation between the fuel cell performances and the hydrophilic-hydrophobic sequences was also evaluated.  The morphological structures of the multiblock copolymers were investigated using tapping mode atomic force microscopy (TM-AFM), transmission electron microscopy (TEM), and dynamic mechanical analysis (DMA). The experiments demonstrated a well-defined nanophase separated morphology.  Moreover, changes in block length had a pronounced effect on the development of phase separated morphology of the system. Proton conductivity measurements elucidated the transport process in the system, with the multiblock copolymers demonstrating higher conductivities compared to Nafion and random copolymer systems with similar ion exchange capacity (IEC) values. The new materials are strong candidates for use in PEM systems.",
  "description_provenance": [
    "Author Email: hslee@vt.edu, bart8314@gmail.com",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:39Z (GMT). No. of bitstreams: 1 HSLEE_ETD.pdf: 5092620 bytes, checksum: 78c4b19f014f3b73d93a90b1de3c4a87 (MD5)   Previous issue date: 2009-04-24"
  ],
  "handle": "27574",
  "identifier_other": "etd-05072009-123321",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05072009-123321/",
  "identifier_uri": "http://hdl.handle.net/10919/27574",
  "publisher": "Virginia Tech",
  "relation_haspart": "HSLEE_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "polyimide",
    "morphology",
    "multiblock copolymer",
    "fuel cell",
    "polybenzimidazole",
    "disulfonated copolymer",
    "proton exchange membrane",
    "poly(arylene ether sulfone)"
  ],
  "title": "Synthesis and Characterization of Multiblock Copolymer Proton Exchange Membranes for High Temperature Fuel Cell Applications",
  "type": "Dissertation"
}