{
  "contributor_author": "Samur, Yavuz",
  "contributor_committeechair": "Evans, Michael A.",
  "contributor_committeemember": [
    "Burton, John K.",
    "Potter, Kenneth R.",
    "Chang, Mido"
  ],
  "contributor_department": "Learning Sciences and Technologies",
  "date_accessioned": "2014-03-14T20:11:41Z",
  "date_adate": "2012-05-29",
  "date_available": "2014-03-14T20:11:41Z",
  "date_issued": "2012-04-26",
  "date_rdate": "2012-05-29",
  "date_sdate": "2012-05-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Educational games have been demonstrated to increase engagement and engagement has been demonstrated to increase achievement. Therefore, the researcher attempted to investigate how to better measure engagement and refine the measurement of engagement in this study. To frame the engagement, three domains of engagement â   behavioral, cognitive, and emotionalâ   are analyzed in detail to be able to examine the qualities of each type. Moreover, three game attributes â  clear goals, immediate feedback, and balance between challenges and skills- are presented and discussed as fundamental features of virtual manipulatives and educational games used in this study to make an impact on studentsâ   engagement. To measure effects of educational games and virtual manipulatives on three domains of engagement, the researcher designed an engagement survey that examines each domain separately with their sub-domains. The Cronbachâ  s alphas for engagement pre-test and post-test were found .89 and .91 respectively. In this pre-test and post-test quasi-experimental design, four fifth-grade classrooms (N=86) from four schools in southwest Virginia were assigned as three experimental groups and one control group. In the first experimental group, participants played an educational game called Candy Factory and in the second experimental group, the students played another educational game called Pearl Diver on iPod Touch for eight days consecutively, for 20 minutes each. In the third experimental group, participants performed activities with virtual manipulatives, whereas in the control group, participants did paper-and-pencil drills for the same duration. All of the groups studied on the same topic, fractions. After taking the engagement pre-test survey data into analysis as a covariate, the study examined the effect of the treatment on engagement post-test data by using analysis of covariance (ANCOVA). According to the results of ANCOVA, experimental group studentsâ   engagement scores were found significantly higher than control group studentsâ  , F(1,80)=11.568, p=.001. When three domains of engagement were analyzed, significant differences were found among all three domains between experimental and control groups. When the researcher conducted separate analysis for educational games group and virtual manipulatives group, students who played educational games were also found significantly different than control group students in terms of all three domains of engagement and general engagement, F(1, 58)= 8.883, p=.004. In addition to this, students who did activities with virtual manipulatives showed significantly higher engagement than students who did paper-and-pencil drills in control group, F(1, 46)= 7.967, p=.007. Statistical difference was found in emotional and cognitive engagement while the results showed no significant difference in behavioral engagement between virtual manipulatives and control group students. Therefore, all three research hypotheses were supported by the ANCOVA results. Results should be interpreted with caution because the findings apply only to a small portion of the population. The three game attributes were considered as the main determining factors to engage students more to the content. This dissertation contributes to the field by developing more refined measure of engagement and the engagement instrument was tested in the context of educational games and virtual manipulatives. Results showed that studentsâ   engagement in three domains increases significantly when media are embedded with appropriate attributes.",
  "description_provenance": [
    "Author Email: ysamur@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: mae@vt.edu",
    "Advisor Email: kpotter@exchange.vt.edu",
    "Advisor Email: mchang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:41Z (GMT). No. of bitstreams: 1 Samur_Y_D_2012.pdf: 3459872 bytes, checksum: 43db2f668a6f45ad5fef13382b75de8c (MD5)   Previous issue date: 2012-04-26"
  ],
  "handle": "27583",
  "identifier_other": "etd-05072012-185722",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05072012-185722/",
  "identifier_uri": "http://hdl.handle.net/10919/27583",
  "publisher": "Virginia Tech",
  "relation_haspart": "Samur_Y_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "virtual manipulatives",
    "game features",
    "mathematics",
    "domains of engagement",
    "educational games"
  ],
  "title": "Measuring Engagement Effects of Educational Games and Virtual Manipulatives on Mathematics",
  "type": "Dissertation"
}