{
  "contributor_author": "Lei, Zhentian",
  "contributor_committeechair": "Helm, Richard Frederick",
  "contributor_committeemember": [
    "Glasser, Wolfgang G.",
    "Frazier, Charles E.",
    "Kingston, David G. I.",
    "Hess, John L."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:11:42Z",
  "date_adate": "2002-05-15",
  "date_available": "2014-03-14T20:11:42Z",
  "date_issued": "2002-04-25",
  "date_rdate": "2003-05-15",
  "date_sdate": "2002-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Ellagitannins are plant phenolics characterized by biaryl-coupled gallic acid moieties esterified to a D-glucose core. They are widely distributed through higher plants. In the case of oaks, ellagitannin concentrations in heartwood can reach up to 10% (dry wt. basis). These secondary metabolites are not only important physiologically but also influence the economic value and quality of wood products that contain them.  Efforts were made to develop and validate the methods used to quantify both soluble and insoluble ellagitannins. First, the efficiencies of the two commonly used extraction solvents, aqueous acetone and aqueous methanol were evaluated. The results showed that aqueous acetone is superior to aqueous methanol in obtaining higher vescalagin and castalagin yields. In a separate study, the method used for determining insoluble ellagitannins was found to under-estimate the contents of insoluble ellagitannins in wood products. Anhydrous methanolic HCl was found to be an excellent reagent for releasing insoluble ellagic acid and gallic acid (as methyl gallate) from biomass substrates. Optimization of both the reaction conditions and the gradient HPLC analysis has led to the development of a robust and reliable protocol.   The chemical stability of the two predominant ellagitannins in oaks (vescalagin and castalagin) were evaluated in aqueous methanol and water. It was found that oxygen, pH and higher temperature (60 oC) affect their stability with higher temperature being the most prominent factor. Both vescalagin and castalagin were found unstable in methanolic solutions. Vestalagin, however, is less stable than castalagin.    In the course of finding alternative models for ellagitannin biosynthesis study, both callus tissues and suspension cell cultures of white oak (Quercus alba) and sweetgum (Liquidambar styraciflua) were investigated for their possible use as models for ellagitannin biosynthesis. It was found that oak callus tissue cultures (Quercus alba) are capable of producing ellagitannins, and the production and profile of ellagitannins can be modified by adjusting the media composition. Comparison of extracts from the heartwood of Quercus alba with those from callus tissue reveals that they have similar ellagitannin profiles. Through manipulation of the media nitrogen and copper concentrations the callus tissue produced almost 3 times as much castalagin and vescalagin. Suspension cells of Quercus alba and Liquidambar styraciflua were found to be unsuitable for the study of biosynthesis of ellagitannins. These cells either did not produce any detectable level of ellagitannins or the production was unstable. Although the suspension cells could be elicited to produce ellagic acid with glycanases (Driselase), the levels of ellagic acid were too low for quantitative metabolic studies.  A method using high performance liquid chromatography â   mass spectrometry was developed and optimized with purified ellagitannins. Ellagitannins analyzed under the optimal conditions all provide base peaks of (M-H)- from which the molecular weights of the ellagitannins can be determined. Mild fragmentation was also achieved to give fragments characteristic of ellagitannins (loss of ellagic acid and gallic acid if present). These characteristic peaks allow for rapid identification of ellagitannins from other secondary metabolites present in the samples. Application of the HPLC/ESI-MS in the identification of monomeric ellagitannins in white oak heartwood extracts revealed that it can unambiguously identify the two monomeric ellagitannins, castalagin and vescalagin, and their degradation product, ellagic acid. The key fragmentation pathways of the ellagitannins are also described.  Finally, preliminary work using proteomics to study the heartwood formation was conducted. Proteins from transition zone and sapwood were determined and resolved with two-dimensional electrophoresis. It was found that both sapwood and transition woods contain active enzyme(s) capable of catalyzing formation of ellagic acid from pentagalloylglucose. Preliminary results from the 2-D gel separation of sapwood and transition wood proteins showed more protein spots in sapwood than in transition wood, suggesting that sapwood not only had higher protein levels but also a great total number of proteins. The lower complexity of the transition wood proteome suggests that this material may be a good substrate for studying the biaryl-coupling process.",
  "description_provenance": [
    "Author Email: zhlei@vt.edu",
    "Advisor Email: wglasser@vt.edu",
    "Advisor Email: cfrazier@vt.edu",
    "Advisor Email: helmrf@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: jlhess@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:42Z (GMT). No. of bitstreams: 3 116.pdf: 415122 bytes, checksum: 490f5c3bceb6fa5cb51ccc95c9f1daee (MD5) Dissertation.PDF: 3434440 bytes, checksum: 1fa9a30cb5bc3910e82e21f402c801ef (MD5) 110_111.pdf: 281919 bytes, checksum: 189417850b52f82fe3e34afbf2c40aa7 (MD5)   Previous issue date: 2002-04-25"
  ],
  "handle": "27588",
  "identifier_other": "etd-05082002-094755",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082002-094755/",
  "identifier_uri": "http://hdl.handle.net/10919/27588",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "116.pdf",
    "Dissertation.PDF",
    "110_111.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Oak",
    "HPLC/ESI-MS",
    "Sweetgum",
    "Ellagitannins"
  ],
  "title": "Monomeric Ellagitannins in Oaks and Sweetgum",
  "type": "Dissertation"
}