{
  "contributor_author": "Ferro, David L.",
  "contributor_committeechair": "Pitt, Joseph C.",
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:11:42Z",
  "date_adate": "2001-08-28",
  "date_available": "2014-03-14T20:11:42Z",
  "date_issued": "2001-01-19",
  "date_rdate": "2002-08-28",
  "date_sdate": "2001-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This study examines the character of colonial American newspaper science to understand how and to what extent the newspaper contributed to the movement of information between those engaged in science and the public.  It explores the issue of the origins of science and the press in America and characterizes the public role of enlightenment science in articles and advertisements pertaining to matters of health, invention and the natural world.  The focus is on the mid-Atlantic region of colonial American newspapers including all the extant issues of the Pennsylvania Gazette, Maryland Gazette, Virginia Gazette, and American Weekly Mercury between the years 1728 to 1765.  This study aims at informing the discussions of Enlightenment thought in colonial America and the role the newspaper played in the public acceptance of the processes of natural philosophy.  </p><p> The findings reveal that in the eighteenth century the colonial American newspaper became the textual locus through which the negotiations of what would and would not constitute acceptable public explanations of numerous subjects, including natural phenomena, were played out.  Along with the public lecture, the newspaper became a primary device where actors and artifacts made legitimizing natural claims to a larger audience and enlisted allies in both scientific and broader disputes.  In this way the American colonies paralleled Britain which had seen an increase in the public witnessing of an empirical natural philosophy and an appeal to economic and social gain for that philosophy since the late seventeenth century.   In order to enroll a broader constituency, natural philosophers used the newspaper to argue for the value of rational and empirical exploration and its products in everyday affairs, matters of state, and even entertainment.   </p><p> Despite the negotiation through the pages of the general periodical, and despite the lack of strong differentiation between 창  virtuosi창   and 창  lay창   philosophers, the newspaper seldom became a principle place of exchange for the theory and practice of science between those doing science.  With some notable and interesting exceptions, the public infrequently became privy to vanguard scientific theory and scientific disputes or enjoyed direct participation through the newspaper. Nevertheless, in eighteenth-century British America, the drive for public acceptance of natural philosophical explanations by those engaged in its explorations made the representative power of the newspaper critical to the success of science.  By promoting an empirical view of the world the newspaper helped create a contemporary science, science communication and a society, that to varying degrees accepted the practices of science.</p>",
  "description_provenance": [
    "Author Email: davidferro@yahoo.com",
    "Advisor Email: jcpitt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:42Z (GMT). No. of bitstreams: 11 01COVER-ABSTRACT.pdf: 8371 bytes, checksum: 478056bb16c2e6398d3cc4ef515c7d01 (MD5) 08CHAPTER-6.pdf: 222462 bytes, checksum: a372970a0a58a540d9e397c96fc2e07f (MD5) 11REFERENCES-VITA.pdf: 53788 bytes, checksum: 4af5f0eb155e3b6d22222bcab9e5d62a (MD5) 07CHAPTER-5.pdf: 125437 bytes, checksum: 525d285950ebf02d18c234c34fd10435 (MD5) 06CHAPTER-4.pdf: 94572 bytes, checksum: 2f6d9f59b0467525ff72720067269303 (MD5) 04CHAPTER-2.pdf: 49934 bytes, checksum: f887679291c1eeb4fa04a304212c1e29 (MD5) 10CHAPTER-8.pdf: 14220 bytes, checksum: 493db715fc36b3746ab8dd3cdf71c9a5 (MD5) 03CHAPTER-1.pdf: 14739 bytes, checksum: bff15051c3dd8aef222fcf45da8addf6 (MD5) 09CHAPTER-7.pdf: 103080 bytes, checksum: 0f366bcea06656f7f35a0d783fd1a51b (MD5) 05CHAPTER-3.pdf: 24780 bytes, checksum: bbc1b410ed270e11c21dd43ef9dd3213 (MD5) 02TABLE-OF-CONTENTS.pdf: 8344 bytes, checksum: 63edb0403e66f67bb72d09f4afb2773e (MD5)   Previous issue date: 2001-01-19"
  ],
  "handle": "27585",
  "identifier_other": "etd-05082001-010142",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082001-010142/",
  "identifier_uri": "http://hdl.handle.net/10919/27585",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01COVER-ABSTRACT.pdf",
    "08CHAPTER-6.pdf",
    "11REFERENCES-VITA.pdf",
    "07CHAPTER-5.pdf",
    "06CHAPTER-4.pdf",
    "04CHAPTER-2.pdf",
    "10CHAPTER-8.pdf",
    "03CHAPTER-1.pdf",
    "09CHAPTER-7.pdf",
    "05CHAPTER-3.pdf",
    "02TABLE-OF-CONTENTS.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Enlightenment",
    "Press",
    "Public"
  ],
  "title": "Selling Science in the Colonial American Newspaper: How the Middle Colonial American General Periodical  Represented Nature, Philosophy, Medicine, and Technology, 1728 - 1765",
  "type": "Dissertation"
}