{
  "contributor_author": "Strunk, Pia Christina",
  "contributor_committeechair": "Lickliter, Robert E.",
  "contributor_committeecochair": "Bell, Martha Ann",
  "contributor_committeemember": [
    "Cooper, Robin K. Panneton",
    "Marshall-Baker, Anna",
    "Finney, Jack W."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:42Z",
  "date_adate": "2002-07-23",
  "date_available": "2014-03-14T20:11:42Z",
  "date_issued": "2001-12-07",
  "date_rdate": "2003-07-23",
  "date_sdate": "2002-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine the effects of multi-modal stimulation (differing amounts of light and vocal stimulation) on preterm infantsâ   behavioral and state organization. Specifically, we looked at the effects that supplemental vocal stimulation (taped female voice) had when varied in amount of exposure (three times a day versus once a day) and when provided in different lighting conditions (â  typical illuminationâ   versus â   decreased illumination).  Forty infants were placed in one of four groups: Standard Illumination/High Voice (SIHV), Standard Illumination /Low Voice (SILV), Decreased Illumination/High Voice (DIHV) and Decreased Illumination/Low Voice (DILV).  Infants receiving standard illumination were exposed to the vocal stimulus in standard NICU lighting conditions (approximately 20 lux), whereas infants in the â  lowâ   lighting conditions were exposed to the stimulus in darkened conditions (approximately 3 lux).  Infants receiving high vocal stimulation listened to a taped female voice three times a day, whereas infants receiving low vocal stimulation were exposed to the voice only once a day.  Each infant received 10 minutes of exposure per session over five consecutive days.  Infants were videotaped in their incubator for 10 minutes before, during, and after the stimulus exposure (total of 30 minutes) for each day.  The videotapes were then scored on the infantâ  s frequency of stress related behaviors and self-regulatory behaviors before, during, and after the stimulus for each day.  Results indicated that both lighting levels and vocal stimulation altered preterm infantsâ   stress and self-regulatory behaviors, and that these effects were dependent on both the day and the stimulus condition the infant was in. In addition, the vocal stimulation and lighting levels had an effect on the states that infants exhibited during and after the presentation of stimulation. These results suggest that the occurrence of different types and amounts of stimulation have an effect on behavioral organization of the preterm infant, and these effects are highly dependent on both history and context in which this stimulation is presented",
  "description_provenance": [
    "Author Email: pstrunk@uwsp.edu, pstrunk@yahoo.com",
    "Advisor Email: cooperr@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: licklite@fiu.edu",
    "Advisor Email: finney@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:42Z (GMT). No. of bitstreams: 2 VITA.pdf: 17679 bytes, checksum: 27c5bfdf05b32625d3462bb9b60a528b (MD5) DisserationComplete.pdf: 200238 bytes, checksum: 0da9c7e6880b0879ce8c6edbd650ecb3 (MD5)   Previous issue date: 2001-12-07"
  ],
  "handle": "27587",
  "identifier_other": "etd-05082002-091550",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082002-091550/",
  "identifier_uri": "http://hdl.handle.net/10919/27587",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "VITA.pdf",
    "DisserationComplete.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "auditory stimulation",
    "pretern infants",
    "lighting"
  ],
  "title": "Effects of Auditory Stimulation in Low and High Light Conditions on Behavioral and State Organization in Preterm Infants",
  "type": "Dissertation"
}