{
  "contributor_author": "Schroeder, Aaron David",
  "contributor_committeechair": "Wamsley, Gary L.",
  "contributor_committeemember": [
    "Pethtel, Ray D.",
    "Dickey, John W.",
    "Colvard, James E.",
    "O'Toole, Lawrence"
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:11:42Z",
  "date_adate": "2001-07-27",
  "date_available": "2014-03-14T20:11:42Z",
  "date_issued": "2001-01-24",
  "date_rdate": "2002-07-27",
  "date_sdate": "2001-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this dissertation is the delineation of a new approach, or, more precisely, a new â  roleâ   and â  methodological system,â   for those persons engaged in building and managing multi-actor structures, or â  networks,â   for the purpose of policy implementation. As policy formulation and implementation can be viewed increasingly as taking place inter-organizationally, and consisting of individuals, special-interest groups, public organizations, private organizations, non-profits, etc., none of whom have the individual power to autonomously determine the strategies and actions of all the other actors, policy processes can no longer be viewed as the implementation of ex ante formulated goals, but instead must be seen as an interaction process in which actors exchange information about problems, preferences and means, and trade-off goals and resources. That is, the context of â  getting things doneâ   in the public sector is changing from a singular organizational context to a multiple-organization network context. Managerially, we must respond accordingly.  While there has been an increasing recognition in the literatures of at least three distinct fields of enquiry [political science, organization theory, and policy science] that such networks are becoming the â  realityâ   of daily operation, much less has been written attempting to aid the acting administrator to function successfully within this new setting. Even less has been written concerning how to actually build and use a network setting to oneâ  s advantage in an implementation endeavor.  We are left in need of a new way to successfully approach implementation through complex multi-actor settings. As it becomes increasingly difficult to administer policy implementation through a single, public organization, the need for new tools and understanding that will enable us to achieve public ends in such complex settings becomes apparent. Such an approach must work to successfully accommodate the increased role of extra-organizational actors, a new role of the administrator as â  network facilitator,â   and still afford the ability to plan for and carry out project implementation. \t Because the invention of such an approach will require the accommodation of a different view of the administrative world (i.e. a more dynamic context, ephemeral definitions, new roles and responsibilities, and a new method to approaching work life), its development cannot constitute a straightforward reshuffling of the boxes of the administrative process, or the simple adoption of some new buzzwords. It demands, instead, that we begin by asking some fundamental ontological (what is reality) and epistemological (how can we know it) questions. It is after addressing these fundamental concerns that this volume will work to build a new approach to functioning proactively in a network setting.  Following a discussion on what the role of â  network facilitatorâ   means in relation to current understanding of public management, this treatise will describe a new methodological system for use by the administrator playing such a role. The â  methodological systemâ   for building implementation networks that is advocated here is composed of three overlapping methodologies: 1) â  Contextual Assessmentâ   - Mapping a Networkâ  s Political-Economy; 2) â  Stakeholder Analysis & Managementâ   â   Understanding Who Should be at the Table and Furthering the Conditions for Cooperation; and, 3) â  Joint Visioningâ   â   The Facilitation of Project Planning in a Network Setting.  In the chapter on â  contextual assessment,â   the reader will be introduced to a method that uses the political economy framework of Wamsley and Zald to derive an interview instrument for use by a recently appointed network facilitator (somebody appointed the responsibility of â  getting something doneâ   cross-organizationally). Combining the political economic framework with other standard qualitative methods, including gaining entrance, selecting interview type, snowballing, and quota sampling, one should be able to assess the existing political and economic environment surrounding a potential implementation network and, further, begin to select from that environment a first set of stakeholders in the budding implementation network. This method will result in a â  conceptual mappingâ   of the environment from which one may begin to select potential resources to build an implementation network.  Following that, the reader will be introduced to two methods, that when used together, will allow for the analysis, categorization, and selection of network stakeholders. Taken together, these methods can be referred to as â  stakeholder analysis.â   It is the successful selection and management of these stakeholders that will result in the formation of a young implementation network.  Finally, the reader will be introduced to a method of â  joint-visioning,â   a process for working with a set of stakeholders to create a shared understanding of the social/organizational and technical/functional systems required for a new implementation network to function. While the theoretical conception here of joint-visioning is new, the techniques suggested to support this method are probably the least original of the techniques associated with the three methods introduced in this volume (in that they are based on recognized methods of group facilitation). The joint-visioning method proposed here is probably most remarkable for what it is not, corporate strategic planning. A discussion about the problems of adopting corporate strategic planning in the public sector will begin this section, followed by a discussion of why something else, like joint visioning, is probably more appropriate.  Each methodology has been constructed from the ground up by appropriating parts of different methodologies that have been advocated in different areas of application. Specifically, methods, approaches, and understandings have been appropriated from the literatures of corporate management, stakeholder analysis, action research, political economy, community facilitation, knowledge engineering and management, and strategic planning. These methods have been combined and modified to better serve as tools for network establishment and management.  This methodological system has been developed as much from experience as from scholarly analysis. Accordingly, a case study, one that has directly led to the development of many concepts in this system, will be discussed and used for â  real-worldâ   elaboration of the concepts described. Specifically, each of these methods will be accompanied by an in-depth discussion on how it was applied in the â  Travel Shenandoahâ   case study. Benefits, as well as problems with the proposed methods will be highlighted. Where appropriate, possible modifications to a method will be suggested.",
  "description_provenance": [
    "Author Email: aaron@vtti.vt.edu",
    "Advisor Email: rpethtel@vt.edu",
    "Advisor Email: wamsley@vtti.vt.edu",
    "Advisor Email: jdickey@vt.edu",
    "Advisor Email: jcolvard@vt.edu",
    "Advisor Email: cmsotool@arches.uga.edu",
    "Made available in DSpace on 2014-03-14T20:11:42Z (GMT). No. of bitstreams: 1 ImplementationNetworks.pdf: 689955 bytes, checksum: 9c921a5b7be2d5f6d5984c5688f45977 (MD5)   Previous issue date: 2001-01-24"
  ],
  "handle": "27586",
  "identifier_other": "etd-05082001-162010",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082001-162010/",
  "identifier_uri": "http://hdl.handle.net/10919/27586",
  "publisher": "Virginia Tech",
  "relation_haspart": "ImplementationNetworks.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Public Administration",
    "Facilitation",
    "Policy Networks",
    "Implementation Networks",
    "Stakeholders",
    "Political Economy",
    "Public-Private Partnership"
  ],
  "title": "Building Implementation Networks: Building Multi-organizational, Multi-sector Structures for Policy Implementation",
  "type": "Dissertation"
}