{
  "contributor_author": "Nguyen, Quang Tran",
  "contributor_committeechair": "Baird, Donald G.",
  "contributor_committeemember": [
    "Marand, Eva",
    "Davis, Richey M.",
    "McGrath, James E."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:11:43Z",
  "date_adate": "2007-06-28",
  "date_available": "2014-03-14T20:11:43Z",
  "date_issued": "2007-04-25",
  "date_rdate": "2007-06-28",
  "date_sdate": "2007-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An environmentally benign process, which uses supercritical carbon dioxide (sc-CO2) as a processing aid, was developed in this work to help exfoliate and disperse nanoclay into the polymer matrices at high clay content. The process involves the use of a pressurized CO2 chamber to assist in the exfoliation and delivery of the clay into a stream of polypropylene (PP) melt within the extruder. This CO2 method was evaluated and compared to other conventional processing techniques. It was observed that the conventional direct-melt compounding methods, with and without the direct injection of CO2, did not show much improvement in the mechanical properties due to their inability to adequately exfoliate the nanoparticles into the polymer matrix.  The commercial RTP sample prepared using a TSE and a MA compatibilizer showed moderate improvements in the clay dispersion and properties due to high shear forces and mixing capabilities of TSE. The most improvements were seen from the technique of using the pressurized CO2 chamber, which directly injected pre-mixed sc-CO2 and nanoclay into the polypropylene melt during extrusion. It was observed that the mechanical properties of the PP nanocomposites prepared using the CO2 chamber technique, especially when combined with maleic anhydride (MA) compatibilizer, outperformed those of the commercial RTP samples and those of samples prepared using conventional melt compounding techniques. WAXD and TEM data showed a good degree of exfoliation for clay concentrations as high as 6.8 wt% when the clay was expanded and mixed with CO2. At this concentration, mechanical properties such as yield strength and modulus increased by as much as 13% and 69%, respectively, relative to the pure PP, and approximately 15% higher than those of samples prepared by direct melt compounding (without the use of CO2). Furthermore, yield-like behavior in the viscosity and a plateau in the low-frequency behavior of storage modulus, Gâ  , was also attributed to polymer-clay interaction due to strong hydrogen bonding between MA groups and the hydroxyl groups on the clay surface, not just solely to the formation of percolation network due to exfoliation between clay platelets that is commonly reported in literature for clay-filled functionalized polypropylene.",
  "description_provenance": [
    "Author Email: qnguyen@vt.edu",
    "Advisor Email: emarand@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:43Z (GMT). No. of bitstreams: 1 QNguyen_PhD_Dissertation_All_Final.pdf: 6392600 bytes, checksum: 2d23ced7d29fd8ba7be0f1082b91dc1c (MD5)   Previous issue date: 2007-04-25"
  ],
  "handle": "27596",
  "identifier_other": "etd-05082007-185651",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082007-185651/",
  "identifier_uri": "http://hdl.handle.net/10919/27596",
  "publisher": "Virginia Tech",
  "relation_haspart": "QNguyen_PhD_Dissertation_All_Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "nanocomposites",
    "nanoclay",
    "supercritical carbon dioxide",
    "extrusion.",
    "Polypropylene",
    "maleated polypropylene"
  ],
  "title": "Process for Improving the Exfoliation and Dispersion of Nanoclay Particles into Polymer Matrices Using Supercritical Carbon Dioxide",
  "type": "Dissertation"
}