{
  "contributor_author": "Stephenson, Allison Elaine",
  "contributor_committeechair": "Dove, Patricia M.",
  "contributor_committeemember": [
    "Read, James Fredrick",
    "Rimstidt, james Donald",
    "De Yoreo, James J."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:11:44Z",
  "date_adate": "2009-06-11",
  "date_available": "2014-03-14T20:11:44Z",
  "date_issued": "2009-05-06",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Elemental proxy models for temperature and seawater chemistry begin by assuming compositional signatures reflect environmental conditions of formation.  The Mg/Ca ratio in marine cements and calcified skeletal structures is a widely used proxy for reconstructing past earth environments.  Many studies have positively correlated Mg content in biogenic carbonates with temperature, but it is difficult to differentiate the effect of temperature from other environmental factors. Supersaturation, precipitation rate, salinity, pH, and ion concentration have also been proposed as drivers of Mg/Ca. Furthermore, it is difficult to distinguish environmental signatures from the â  vital effect,â   or the influences superimposed by the growth needs and metabolic activities of the organism.  To construct viable paleoenvironmental proxies from biomineral compositions, we must resolve the effects of environmental conditions from the vital effects of the organism by first understanding the underlying thermodynamic and kinetic mechanisms for incorporating minor and trace elements. <p> Using in situ Atomic Force Microscopy, controlled solution chemistries, and different ion microprobe techniques, this dissertation investigates the kinetics and thermodynamics of calcite growth to establish an inorganic baseline for uptake of Mg. I use this information to quantify the enhancement in Mg/Ca due to the presence of hydrophilic 27-mer peptides, demonstrating a possible origin of vital effects. Likewise I measure the effect of ionic strength on signatures and find that growth rate and background electrolyte proved more important than salinity in determining Mg contents.  <p> The findings contribute to the ongoing discussion regarding the relative importance of unique seawater parameters in determining Mg/Ca in calcite. Mg contents are significantly enhanced by biomolecules relative to the amounts attributed to temperature differences, while Mg content is less influenced by salinity variation than by changing supersaturation or driving force. In addition to sorting out the relative importance of environmental factors, our results begin to address the interplay of these different parameters in concert, and at different scales. At sites of calcification, the local biochemistry within an organism may shift in response to more saline waters. At a geological scale, interpreting past temperatures and particularly those of the Last Glacial Maximum depends on our ability to sort out and account for this interplay of salinity and temperature on Mg/Ca. Processes underlying inorganic and biogenic carbonate mineralization and interpretations of their formation environments are better understood by examining the influence of environmental parameters and biomolecular chemistry on kinetics and thermodynamics of calcite growth and stability.",
  "description_provenance": [
    "Author Email: allison.stephenson@gmail.com",
    "Advisor Email: jread@vt.edu",
    "Advisor Email: dove@vt.edu",
    "Advisor Email: jdr@vt.edu",
    "Advisor Email: jjdeyoreo@lbl.gov",
    "Made available in DSpace on 2014-03-14T20:11:44Z (GMT). No. of bitstreams: 1 Stephenson_Dissertation.pdf: 78802902 bytes, checksum: b8ba7871c9de543352bd1193dba33d91 (MD5)   Previous issue date: 2009-05-06"
  ],
  "handle": "27598",
  "identifier_other": "etd-05082009-131100",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082009-131100/",
  "identifier_uri": "http://hdl.handle.net/10919/27598",
  "publisher": "Virginia Tech",
  "relation_haspart": "Stephenson_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Carbonate",
    "Mg/Ca",
    "Paleoenvironment",
    "Crystal Growth",
    "Biomineralization"
  ],
  "title": "Establishing a Baseline for Kinetic and Thermodynamic Origins of Vital Effects: Toward an Understanding of Factors Controlling Mg Signatures in Calcite",
  "type": "Dissertation"
}