{
  "contributor_author": "Ishida, Chiharu",
  "contributor_committeecochair": [
    "Klein, Noreen M.",
    "Brown, James R."
  ],
  "contributor_committeemember": [
    "Lambe, C. Jay",
    "Keith, Janet E.",
    "Nakamoto, Kent",
    "Wokutch, Richard E."
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:11:43Z",
  "date_adate": "2007-05-17",
  "date_available": "2014-03-14T20:11:43Z",
  "date_issued": "2007-04-27",
  "date_rdate": "2007-05-17",
  "date_sdate": "2007-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The theoretical frameworks of transaction cost economics and agency theory are widely used to design appropriate governance structure for constraining opportunism within marketing channels. These approaches generally assume that marketing channel managers are opportunistic, and only economic constraints deter opportunism in exchange relationships. However, some empirical studies have shown that managers do not always behave opportunistically even if conditions permit such behavior. In addition, some researchers have proposed a â  cycle of self-fulfilling prophecyâ   and have argued that the uncritical assumption of opportunism and excessive use of control mechanisms such as monitoring only exacerbates the problem. Thus, it is important to identify conditions in which opportunism likely occurs.  The present research argues that marketing channel managers exhibit differing propensities for opportunism (PFO), and it spans three levels of analysis to identify contributing factors. The individual-level analysis treats marketing channel managers as a heterogeneous population and investigates the impact of individual traits on their behaviors in business relationships. At the dyadic level, I modify standard microeconomics models to incorporate norms of fairness. Finally, the extra-dyadic level of analysis goes beyond the traditional dyadic focus to include network-wide social influence on a relationship. Using the data collected from 162 unit franchieees. the hypotheses were tested using structural path analyses.  The findings of this dissertation provide guidance on the extent to which costly and potentially damaging control mechanisms are really necessary in a given marketing channel relationship. Overall, the research contributes to the existing literature by re-examining a fundamental behavioral assumption about marketing channel managers and providing an alternative framework that can meaningfully inform us as to when and why opportunism occurs.",
  "description_provenance": [
    "Author Email: cishida@vt.edu",
    "Advisor Email: lambecj@seattleu.edu",
    "Advisor Email: jkeith@vt.edu",
    "Advisor Email: nklein@vt.edu",
    "Advisor Email: J.Brown@mail.wvu.edu",
    "Advisor Email: nakamoto@vt.edu",
    "Advisor Email: wokutch@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:43Z (GMT). No. of bitstreams: 1 Dissertation_Ishida_Spring2007.pdf: 1241721 bytes, checksum: 7a772062784f3848350a6ee86f2f74e0 (MD5)   Previous issue date: 2007-04-27"
  ],
  "handle": "27595",
  "identifier_other": "etd-05082007-154957",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082007-154957/",
  "identifier_uri": "http://hdl.handle.net/10919/27595",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Ishida_Spring2007.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Propensity for Opportunism",
    "Opportunistic Behaviors",
    "Opportunism",
    "Marketing Channel"
  ],
  "title": "Bad Apples, Bad Barrels, and the Structure of Marketing Channel Relationships: Analyses of the Propensity for Opportunism and Opportunistic Behaviors",
  "type": "Dissertation"
}