{
  "contributor_author": "Rovniak, Liza Sharon",
  "contributor_committeechair": "Winett, Richard A.",
  "contributor_committeemember": [
    "Anderson, Eileen S.",
    "Wojcik, Janet R.",
    "Finney, Jack W.",
    "Stephens, Robert S."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:42Z",
  "date_adate": "2003-05-19",
  "date_available": "2014-03-14T20:11:42Z",
  "date_issued": "2003-04-22",
  "date_rdate": "2006-05-19",
  "date_sdate": "2003-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of the present study was to examine the relative effectiveness of two different ways of operationalizing a mastery experience in an e-mail based fitness walking program. Mastery experiences are considered the best way to increase exercise self-efficacy (Bandura, 1997), which is strongly associated with regular physical activity, but little research has systematically explored how effective mastery experiences can be developed. Fifty-nine sedentary adult women were randomly assigned to a mastery experience group (n=29) that operationalized mastery experiences in a manner consistent with Banduraâ  s social cognitive theory, or to a standard care group (n=30) that operationalized mastery experiences in a manner consistent with standard care. Both intervention conditions received the same physical activity prescription and were designed to promote equivalent levels of contact with the experimenter over the 12-week program. The effects of the program were examined on overall adherence to the program, one-mile walk test times, estimated VO2max, social cognitive outcomes, and program evaluation ratings. Both the mastery experience group and the standard care group had similar levels of adherence to the program. The mastery experience group demonstrated a significantly greater improvement in one-mile walk test time than the standard care group. Although the mastery experience group also showed a larger increase in estimated VO2max  than the standard care group, this difference did not reach significance. The mastery experience group had significantly greater increases in goal-setting relative to the standard care group, but the intervention did not show any differences between the two groups on three measures of self-efficacy. In program evaluation ratings, the mastery experience group demonstrated greater satisfaction with the program than the standard care group.",
  "description_provenance": [
    "Author Email: lrovniak@projects.sdsu.edu",
    "Advisor Email: eileen@vt.edu",
    "Advisor Email: jwojcik@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:42Z (GMT). No. of bitstreams: 1 dissfinaletd.pdf: 187066 bytes, checksum: ccfb48471d7c8e4a6c946f22c86c82b3 (MD5)   Previous issue date: 2003-04-22"
  ],
  "handle": "27590",
  "identifier_other": "etd-05082003-172912",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082003-172912/",
  "identifier_uri": "http://hdl.handle.net/10919/27590",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissfinaletd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mastery experiences",
    "feedback",
    "goal setting",
    "physical activity",
    "social cognitive theory"
  ],
  "title": "Operationalizing Mastery Experiences in E-mail-Based Fitness Walking Programs",
  "type": "Dissertation"
}