{
  "contributor_author": "Carleton, Karen Anne",
  "contributor_committeechair": "Wiswell, Albert W.",
  "contributor_committeemember": [
    "Studds, Susan",
    "Cline, Marvin Gerald",
    "Boucouvalas, Marcie"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:43Z",
  "date_adate": "2005-05-24",
  "date_available": "2014-03-14T20:11:43Z",
  "date_issued": "2005-04-26",
  "date_rdate": "2005-05-24",
  "date_sdate": "2005-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Lamplighter:  Strategic Leadersâ   Views on Leadership  Karen Anne Carleton  ABSTRACT   \tThe vast quantity of leadership literature discusses factors that may contribute to leader development.  However, strategic leadersâ  defined as those individuals in key positions at the organizational apexâ  are a subsection of the research that deserves more attention.  In particular, what sets these leaders apart or enables them to excel is an area of particular interest and is explored in this dissertation.  The purpose of this study was to understand the process of leadership development, specifically through the experience and beliefs of successful senior leaders.    The study addressed the following questions:    1.\tHow do strategic leaders for the federal government describe effective leadership? 2.\tHow do they explain the development of effective strategic leadership? 3.\tHow do the described behaviors of strategic leadership compare to the Executive Core Qualifications established for civilian federal government leaders by the Office of Personnel Management?  To answer the research questions, the study employed grounded theory as the primary analytic procedure.  The subjects interviewed were from areas of the federal government dealing with national security, predominantly Department of Defense.  Both military and civilians subjects participated.  Data were analyzed qualitatively and a conceptual model of strategic leadership behavior was developed.  Finally, implications and suggestions as to how to foster the development of such capacities are offered. The findings show, as did earlier behavioral research, that the two aspects of task and relationship are important to successful leaders.  In this case, both functioned predominantly in the leadersâ   behavior, but under the fabric of their contextual experience built on their own self-efficacy and relations with others.  It follows that more attention paid to developing self-mastery and strong relationship skills are in order. Since studies on military leadership vice civilian federal service are more likely, the findings were examined in relation to the established qualifications for senior civilian leaders, revealing a gap.  While the qualifications for senior executives are behavior oriented, the research indicates a need for stronger focus on personal development, growth as an individual, and contributions made to the development of others.  The relationship aspect of leadership does not receive the proper emphasis.",
  "description_provenance": [
    "Author Email: carleton111@msn.com",
    "Advisor Email: studdss@ndu.edu",
    "Advisor Email: mgcline@aol.com",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: awiswell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:43Z (GMT). No. of bitstreams: 4 4Backpt2KAC.pdf: 105625 bytes, checksum: 7d31a1a9aef3bc7f17d621ed6c6c2864 (MD5) 2BodyKAC.pdf: 381940 bytes, checksum: 0247617d7d3f58845b993e8585b6654b (MD5) 1FrontKAC.pdf: 76908 bytes, checksum: 5f75fa8cde96f981709766862a2fe22b (MD5) 3BackKAC.pdf: 460532 bytes, checksum: e4882e51d5ac178753b1a99d8f2769ef (MD5)   Previous issue date: 2005-04-26"
  ],
  "handle": "27592",
  "identifier_other": "etd-05082005-162107",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082005-162107/",
  "identifier_uri": "http://hdl.handle.net/10919/27592",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "4Backpt2KAC.pdf",
    "2BodyKAC.pdf",
    "1FrontKAC.pdf",
    "3BackKAC.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "leadership development",
    "strategic leadership",
    "adult education",
    "adult learning",
    "stratified systems theory",
    "senior executive service"
  ],
  "title": "The Lamplighter:  Strategic Leadersâ   Views on Leadership",
  "type": "Dissertation"
}