{
  "contributor_author": "Jebo, Jennifer Lee",
  "contributor_committeechair": "Calasanti, Toni M.",
  "contributor_committeemember": [
    "Bailey, Carol A.",
    "Bryant, Clifton D.",
    "Wimberley, Dale W.",
    "Hughes, Michael D."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:11:43Z",
  "date_adate": "2005-05-24",
  "date_available": "2014-03-14T20:11:43Z",
  "date_issued": "2005-04-29",
  "date_rdate": "2007-05-24",
  "date_sdate": "2005-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Military wives continue to represent the majority of military spouses and as a result, most research on military spouses has focused exclusively on them. Utilizing data from the 1999 Survey of Active Duty Spouses, one goal of this study was to address this gap in the literature by examining how male and female military spouses differ. The results indicated that military husbands were more likely to have military experience themselves than military wives. Military husbands were also more likely to be older than female spouses and less likely to have children. Men were also more likely to indicate that their employment was not a concern during the familyâ  s last permanent change of station move. The primary goal of this study was to examine the influence of gender on military spousesâ   support for their active duty spousesâ   retention in the U.S. Military. Previous research has indicated that spousal support plays an important role in military personnelâ  s retention decisions. Other factors that were considered for their influence on spouse support for retention included age, race/ethnicity, education, children, personal military experience, employment concerns during the familyâ  s last move, the hours worked per week by the active duty spouse, the rank of the active duty spouse, and the military spouseâ  s satisfaction with the military lifestyle. The results of this regression analysis indicated that military husbands are less supportive of their active duty spousesâ   retention than military wives. Satisfaction with the military lifestyle was found to be the most significant predictor of military spousesâ   support for their active duty spousesâ   retention in the U.S. Military. Of the other factors, age, race/ethnicity, education, the hours worked per week by the active duty spouse, and the presence of children in the family were also found to be significant predictors of spouse support for retention. As satisfaction with the military lifestyle was demonstrated to be a significant influence on spouse support for retention, this study also involved an examination of gender differences in satisfaction with the military lifestyle. Gender was not found to be a significant influence on satisfaction with the military lifestyle. Factors that were found to significantly influence satisfaction included the military spouseâ  s age, race/ethnicity, concerns about employment, hours worked per week by the active duty spouse and the rank of the active duty spouse. Concerns about employment during the familyâ  s last move and the hours worked per week by the active duty spouse were both found to have a negative influence on military spousesâ   satisfaction with the military lifestyle.",
  "description_provenance": [
    "Author Email: Jennifer.Jebo@YouthVillages.org",
    "Advisor Email: toni@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: cbryant@vt.edu",
    "Advisor Email: dale.wimberley@vt.edu",
    "Advisor Email: mdh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:43Z (GMT). No. of bitstreams: 2 JeboDissertation1.pdf: 41538 bytes, checksum: a37f678569c5db6081d0eb1f5ff0a68c (MD5) JeboDissertation2.pdf: 383479 bytes, checksum: a9a7134e61efb6f8935c274637b9c1e4 (MD5)   Previous issue date: 2005-04-29"
  ],
  "handle": "27593",
  "identifier_other": "etd-05082005-223807",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082005-223807/",
  "identifier_uri": "http://hdl.handle.net/10919/27593",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "JeboDissertation1.pdf",
    "JeboDissertation2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "spouses and employment",
    "military sociology",
    "gendered division of labor.",
    "Gender"
  ],
  "title": "An Untraditional Life: Male Spouses of Female Military Personnel",
  "type": "Dissertation"
}