{
  "contributor_author": "Ozturk, Mehmet Ali",
  "contributor_committeechair": "Singh, Kusum",
  "contributor_committeemember": [
    "Potter, Kenneth R.",
    "Fortune, Jimmie C.",
    "Cross, Lawrence H.",
    "Harvey, Robert J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:45Z",
  "date_adate": "2001-05-09",
  "date_available": "2014-03-14T20:11:45Z",
  "date_issued": "2001-04-25",
  "date_rdate": "2005-02-20",
  "date_sdate": "2001-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study explored the factors that influence public high school students' advanced math course-taking. The factors investigated were parental involvement, peers' educational aspirations, students' own educational aspirations, and math self-concept. These factors were further examined for students in different settings as defined by school demographic variables of urbanicity, minority concentration, and poverty concentration. The study analyzed longitudinal data from the National Education Longitudinal Study of 1988 (NELS: 88), using structural equation modeling. Results indicated that parental involvement was much more important than peer influence for students' educational aspirations, and in turn, for their advanced level mathematics course-taking. Parental involvement had a larger effect for students in high-minority, high-poverty urban schools, who, on the average, had taken the smallest number of advanced mathematics courses, compared to students in other settings. Results from the study indicated that African-American students' math self-concepts were not affected by their previous math achievement, suggesting the lack of feedback about their mathematics performance. Recommendations based on the findings included improving parental involvement for all students, especially for students in high-minority, high-poverty urban schools, and providing more feedback to African-American students about their level of performance in mathematics and its consequences in terms of advanced math course-taking.",
  "description_provenance": [
    "Author Email: mozturk@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: harveyrj@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:45Z (GMT). No. of bitstreams: 1 mozturk.pdf: 358956 bytes, checksum: 33df43a12360ae93c678297ab9a8ca63 (MD5)   Previous issue date: 2001-04-25"
  ],
  "handle": "27603",
  "identifier_other": "etd-05092001-114549",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092001-114549/",
  "identifier_uri": "http://hdl.handle.net/10919/27603",
  "publisher": "Virginia Tech",
  "relation_haspart": "mozturk.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Educational Aspirations",
    "Math Self-Concept",
    "Peer Influence",
    "Parental Involvement",
    "Mathematics Course-Taking"
  ],
  "title": "Personal and Social Factors That Influence Advanced Course-Taking during High School",
  "type": "Dissertation"
}