{
  "contributor_author": "Honeycutt, Hunter Gibson",
  "contributor_committeechair": "Lickliter, Robert E.",
  "contributor_committeecochair": "Cooper, Robin K. Panneton",
  "contributor_committeemember": [
    "Bell, Martha Ann",
    "Burian, Richard M.",
    "Hoffman, Kurt A."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:45Z",
  "date_adate": "2002-07-15",
  "date_available": "2014-03-14T20:11:45Z",
  "date_issued": "2002-05-03",
  "date_rdate": "2003-07-15",
  "date_sdate": "2002-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The fact that sensory modalities do not become functional at the same time raises the question of how sensory systems and their particular experiential histories might influence one another. Few studies have addressed how modified stimulation to earlier-emerging modalities might influence the functioning of relatively later-developing modalities. Previous findings have shown that enhanced prenatal tactile and vestibular (proximal) stimulation extended and delayed normal patterns of auditory and visual responsiveness to species-typical maternal cues in bobwhite quail respectively.  Although these results were attributed to the increased amount of sensory stimulation, these results may be a function of when prenatal augmented proximal exposure took place. To address this issue the present study exposed groups of bobwhite quail embryos to equivalent amounts of augmented tactile and vestibular stimulation either at a time when a later-emerging modality (auditory or visual) was beginning to functionally emerge or when it had already functionally emerged.  Results indicate that differences in the timing of augmented tactile and vestibular stimulation led to differences in subsequent auditory and visual responsiveness. Embryos were unable to learn a maternal call prior to hatching when enhanced proximal stimulation coincided with auditory functional emergence implicating a deficit in auditory functioning, but did learn a maternal call when enhanced proximal stimulation occurred after auditory functional emergence.  Augmented proximal stimulation that coincided with visual functional emergence did not appear to influence normal visual responsiveness, but when proximal stimulation occurred after visual emergence, chicks displayed an accelerated approach response to species-typical visual cues.  These findings support the view that the timing of enhanced stimulation to earlier-emerging modalities is important, and have meaningful implications for intersensory theory and research.",
  "description_provenance": [
    "Author Email: hhoneycu@vt.edu",
    "Advisor Email: licklite@fiu.edu",
    "Advisor Email: cooperr@vt.edu",
    "Advisor Email: mabell@vr.edu",
    "Advisor Email: rmburian@vt.edu",
    "Advisor Email: khoffma@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:45Z (GMT). No. of bitstreams: 1 Dissertationrevised.pdf: 309896 bytes, checksum: e7a1640bf8756dc835cd0f06271608dd (MD5)   Previous issue date: 2002-05-03"
  ],
  "handle": "27607",
  "identifier_other": "etd-05092002-191403",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092002-191403/",
  "identifier_uri": "http://hdl.handle.net/10919/27607",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertationrevised.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "intersensory",
    "perceptual development",
    "tactile and vestibular",
    "bobwhite quail"
  ],
  "title": "The Influence of Enhanced Tactile and Vestibular Sensory Stimulation on Subsequent Auditory and Visual Responsiveness: A Matter of Timing",
  "type": "Dissertation"
}