{
  "contributor_author": "Li, Hong",
  "contributor_committeechair": "Newton, William E.",
  "contributor_committeemember": [
    "Chen, Jiann-Shin",
    "White, Robert H.",
    "Larson, Timothy J.",
    "Gregory, Eugene M."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:11:45Z",
  "date_adate": "2002-05-21",
  "date_available": "2014-03-14T20:11:45Z",
  "date_issued": "2002-04-30",
  "date_rdate": "2003-05-21",
  "date_sdate": "2002-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Mo-nitrogenase consists of two component proteins, the Fe protein and the MoFe protein. The site of substrate binding and reduction within the Mo-nitrogenase is provided by a metallocluster, the FeMo cofactor, located in the a-subunit of the MoFe protein. The FeMo cofactor창  s polypeptide environment appears to be intimately involved in the delicate control of the MoFe protein창  s interactions with its substrates and inhibitors (Fisher K et al., 2000c). In this work, the a-subunit 278-serine residue of the MoFe protein was targeted because (i) a serine residue at this position is conserved both in the Mo-nitrogenase from all organisms examined and in the alternative nitrogenases (Dean, DR and Jacobson MR, 1992); (ii) its hydroxyl group hydrogen bonds to the Sg of the a-subunit 275-cysteine residue that directly ligates the FeMo cofactor; and (iii) its proximity to the a-subunit 277-arginine residue, which may be involved in providing the entry/exit route for substrates and products (Shen J et al., 1997).         Altered MoFe proteins of A. vinelandii nitrogenase, with the a278Thr, a278Cys, a278Ala and a278Leu substitutions, were used to study the interactions of H+, C2H2, N2 and CO with the enzyme. All strains, except the a278Leu mutant strain, were Nif+. From measurement of the Km for C2H2 (C2H4 formation) for the altered MoFe proteins, the a278Ala and a278Cys MoFe proteins apparently bind C2H2 similarly to the wild type, whereas the a278Thr and the a278Leu MoFe proteins both have a Km ten-times higher than that of the wild type. Unlike wild type, these last two altered MoFe proteins both produce C2H6. These results suggest that C2H2 binding is affected by substitution at the a-278 position. Moreover, when reducing C2H2, the a278Ala and a278Cys MoFe proteins respond to the inhibitor CO similarly to the wild type, whereas C2H2 reduction catalyzed by the a278Thr MoFe protein is much more sensitive to CO. Under nonsaturating concentrations of CO, the a278Leu MoFe protein catalyzes the reduction of C2H2 with sigmoidal kinetics, which is consistent with inhibitor-induced cooperativity between at least two C2H4-evolving sites. This phenomenon was previously observed with the a277His MoFe protein, in which the a-subunit 277-arginine residue had been substituted (Shen J et al., 1997). Together, these data suggest that the MoFe protein has at least two C2H2-binding sites, one of which may be located near the a277-278 residues and, therefore, most likely on the Fe4S3 sub-cluster of the FeMo cofactor. Like the wild type, N2 is a competitive inhibitor of the reduction of C2H2 by the a278Thr, a278Cys and a278Ala MoFe proteins. Apparently, the binding of N2 in these altered MoFe proteins is similar to that with the wild type MoFe protein, suggesting that the aSer278 residue is not directly involved in N2 binding and reduction. Previous work suggested that both a high-affinity and low-affinity C2H2-binding site were present on the MoFe protein (Davis LC et al., 1979; Christiansen J et al., 2000). Our results are generally consistent with this suggestion.         Currently, there is not much information about the proton donors and how the protons necessary to complete all substrate-to-product transformations are transferred. The dependence of activity on pH (activity-pH profiles) has provided useful information about the nature of the groups involved in proton transfer to the FeMo cofactor and the bound substrate. Approximately bell-shaped activity-pH profiles were seen for all products from catalysis by all the MoFe proteins tested whether under Ar, in the presence of C2H2 as a substrate, or with CO as an inhibitor. The profiles suggested that at least two acid-base groups were required for catalytic activity. The pKa values of the deprotonated group and protonated group were determined from the pH that gave 50% maximum specific activity. These pKa values for the altered a278-substituted MoFe proteins and the a195Gln MoFe protein under various assay atmospheres were compared to those determined for the wild type. It was found that the pKa value of the deprotonated group was not affected by either substitution or changing the assay atmosphere. The wild type MoFe protein has a pKa (about 8.3) for the protonated group under 100% argon that was not affected very much by the substitution by Cys, Ala and Leu, whereas the Thr substitution shifted the pKa to about 8, which was the same as that of the wild type MoFe protein in the presence 10% CO.  The pKa values for the protonated group for all the altered MoFe proteins were not changed with the addition of 10% CO. These results suggest that the aSer278 residue, through hydrogen bonding to a direct ligand of the FeMo cofactor, is not one of the acid-base groups required for activity. However, this residue may 창  fine-tune창   the pKa of the responsible acid-base group(s) through interaction with the aHis195 residue, which has been suggested (Dilworth MJ et al., 1998; Fisher K et al., 2000b) to be involved in proton transfer to substrates, especially for N2 reduction. The activity-pH profiles under different atmospheres also support the idea that more than one proton pathway appears to be involved in catalysis, and specific pathway(s) may be used by individual substrates.",
  "description_provenance": [
    "Author Email: holi2@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:45Z (GMT). No. of bitstreams: 1 Hongdissertation.pdf: 2303782 bytes, checksum: fe2a1d582ee92cc3fe3e6496fedbd763 (MD5)   Previous issue date: 2002-04-30"
  ],
  "handle": "27608",
  "identifier_other": "etd-05092002-213137",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092002-213137/",
  "identifier_uri": "http://hdl.handle.net/10919/27608",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hongdissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "altered nitorgenases",
    "Mo-nitrogenase",
    "Biological nitrogen fixation",
    "amino acid substitution"
  ],
  "title": "Azotobacter vinelandii Nitrogenase: Multiple Substrate-Reduction Sites and Effects of pH on Substrate Reduction and CO Inhibition",
  "type": "Dissertation"
}