{
  "contributor_author": "Mitchell, Sheila",
  "contributor_committeechair": "Lindsay, David S.",
  "contributor_committeemember": [
    "Blagburn, Byron L.",
    "Witonsky, Sharon G.",
    "Sriranganathan, Nammalwar",
    "Zajac, Anne M."
  ],
  "contributor_department": "Biomedical and Veterinary Sciences",
  "date_accessioned": "2014-03-14T20:11:44Z",
  "date_adate": "2011-06-16",
  "date_available": "2014-03-14T20:11:44Z",
  "date_issued": "2008-04-11",
  "date_rdate": "2011-06-16",
  "date_sdate": "2011-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Coccidia are obligate intracellular parasites belonging to the phylum Apicomplexa. Many coccidia are of medical and veterinary importance such as Cystoisospora species and Toxoplasma gondii. The need to discover new anticoccidial therapies has increased due to development of resistance by the parasite or toxicity issues in the patient. The goals of this work were to develop a model for canine coccidiosis while proving that Cystoisospora canis is a true primary pathogen in dogs and to determine the efficacy of a new anticoccidial agent. A canine coccidiosis model would be useful in evaluating new anticoccidial treatments. Oral infections with 5 X 104 (n=2) and 1 X 105 (n=20) sporulated C. canis oocysts were attempted in 22 purpose bred beagle puppies. Clinical signs associated with disease were observed in all dogs. Bacterial and viral pathogens were ruled out by transmission electron microscopy (TEM) and bacterial growth assays. Development of C. canis in cell culture was also evaluated.  The efficacy of ponazuril, a new anticoccidial drug, was examined in T. gondii. In vitro studies were conducted to determine the activity of ponazuril on tachyzoites and how this agent affects development of apicomplexcan parasites. The tachyzoite production assay was conducted. Ponazuril at a dose of 1.0 Âµg/ml had a significant affect on tachyzoite reproduction. Comparisons were made on how ponazuril affects T. gondii and Neospora caninum. Inhibition of T. gondii tachyzoites occurred after the second round of replication and with N. caninum tachyzoites after 4 rounds of replication. Results of TEM revealed ponazuril affects replication of T. gondii and N. caninum differently.  \tThe efficacy of ponazuril to prevent and treat acute and chronic toxoplasmosis was investigated. Mice treated prophylactically with ponazuril were completely protected from developing an acute T. gondii infection. Fatal toxoplasmosis was prevented in mice starting treatment 3 and 6 days post infection at a dose of 20 mg/kg. Immunohistochemistry was used to evaluate ponazurilâ  s effect on chronic toxoplasmosis. Sections of brain were scored according to the number of tissue cysts present. Ponazuril also proved to be highly active against toxoplasmic encephalitis in an interferon-gamma knockout mouse model.",
  "description_provenance": [
    "Author Email: shmitch2@gmail.com",
    "Advisor Email: blagbbl@vetmed.auburn.edu",
    "Advisor Email: switonsk@vt.edu",
    "Advisor Email: nathans@vt.edu",
    "Advisor Email: lindsayd@vt.edu",
    "Advisor Email: azajac@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:44Z (GMT). No. of bitstreams: 2 Mitchell_SM_D_2008.pdf: 3565606 bytes, checksum: 05c89caf12ad143411e5800cbb7eb7f7 (MD5) Mitchell_SM_D_2008_Copyright.pdf: 1635998 bytes, checksum: c2fa44c969d7c2c8bccf8e7a12ddd19f (MD5)   Previous issue date: 2008-04-11"
  ],
  "handle": "27600",
  "identifier_other": "etd-05082011-151930",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082011-151930/",
  "identifier_uri": "http://hdl.handle.net/10919/27600",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Mitchell_SM_D_2008.pdf",
    "Mitchell_SM_D_2008_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "animal model",
    "monozoic cyst",
    "cell culture",
    "Toxoplasma gondii",
    "treatment",
    "Apicomplexa",
    "coccidia",
    "canine"
  ],
  "title": "Development of a Canine Coccidiosis Model and the Anticoccidial Effects of a New Chemotherapeutic Agent",
  "type": "Dissertation"
}