{
  "contributor_author": "Butler, William M",
  "contributor_committeechair": "Goff, Richard M.",
  "contributor_committeemember": [
    "Terpenny, Janis P.",
    "Mason, William H.",
    "Williams, Christopher B."
  ],
  "contributor_department": "Engineering Education",
  "date_accessioned": "2014-03-14T20:11:44Z",
  "date_adate": "2012-05-30",
  "date_available": "2014-03-14T20:11:44Z",
  "date_issued": "2012-05-02",
  "date_rdate": "2012-05-30",
  "date_sdate": "2012-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "It has been said that engineers create that which never was. The university experience is a key component in preparing engineers who support the creation of products and systems that improve the world we live in. The way in which engineers have been trained in universities has changed throughout history in America, moving from an apprentice-like approach to the still-used engineer scientist. Some in industry and academia feel that this model of engineer preparation needs to change in order to better address the complexities of engineering in the 21st century, and help fill a perceived gap between academic preparation and 21st century industrial necessity. A new model for student preparation centering on engineering design called the Live Simulation Based Learning (LSBL) approach is proposed based upon the theories of situated learning, game-based learning, epistemic frames, and accidental competencies. This dissertation discusses the results of a study of the application of LSBL in a two term capstone design class in aerospace engineering aircraft design at Virginia Tech. It includes LSBLâ  s impact on student professional and technical skills in relation to aerospace engineering design practice. Results indicate that the participants found the LSBL experience to be more engaging than the traditional lecture approach and does help students respond and think more like aerospace engineering practicing professionals and thus begin to address the â  gapâ   between academia and industry.",
  "description_provenance": [
    "Author Email: mbphd11@vt.edu",
    "Advisor Email: richgoff@vt.edu",
    "Advisor Email: terpenny@iastate.edu",
    "Advisor Email: whmbburg@me.com",
    "Advisor Email: cbwill@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:44Z (GMT). No. of bitstreams: 2 Butler_WM_D_2012.pdf: 2786728 bytes, checksum: 865180316fcd20b8467a343d69333101 (MD5) Butler_WM_D_2012_Copyright.pdf: 159860 bytes, checksum: b43653b61e5c0d6602be1bdef1ac9f48 (MD5)   Previous issue date: 2012-05-02"
  ],
  "handle": "27601",
  "identifier_other": "etd-05082012-183206",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082012-183206/",
  "identifier_uri": "http://hdl.handle.net/10919/27601",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Butler_WM_D_2012.pdf",
    "Butler_WM_D_2012_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "aerospace",
    "design",
    "engineering education",
    "simulation"
  ],
  "title": "The Impact of Simulation-Based Learning in Aircraft Design on Aerospace Student Preparedness for Engineering Practice: A Mixed Methods Approach",
  "type": "Dissertation"
}