{
  "contributor_author": "Law, Mary Kate",
  "contributor_committeechair": "Axsom, Daniel K.",
  "contributor_committeemember": [
    "Dunsmore, Julie C.",
    "Winett, Richard A.",
    "Clum, George A. Jr."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:45Z",
  "date_adate": "2012-05-30",
  "date_available": "2014-03-14T20:11:45Z",
  "date_issued": "2012-04-27",
  "date_rdate": "2012-05-30",
  "date_sdate": "2012-05-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The abundance of forgiveness research has advanced scientific knowledge of the construct.  Its multifaceted nature, however, has created specialization and domain-dependent research (e.g., close-relationship vs. non-relationship forgiveness).  The current paper argues that a comprehensive framework that could be applied across domains is needed.  The general principles perspective (Higgins, 1990, 1999), which identifies mechanisms that explain both chronic and situational variance, was used as a framework for forgiveness, specifically the mechanisms of accessibility and need for closure.  Two studies tested the principles, a two-part study (N = 244 and 78, respectively) and an online survey (N = 214).  The two-part study tested chronic accessibility for forgiveness (Accessibility Study One) within the context of the religiosity-forgiveness relationship (an area that has previously produced complex and contradictory results) and both the chronic and situational influence of need for closure (Need for Closure Study).  The online survey was designed to test both situational and chronic accessibility (Accessibility Study Two) by priming half of the participants with religious words.  Students from a large, Mid-Atlantic university participated.  For accessibility, it was proposed that religious individuals would have higher chronic accessibility for forgiveness, because of the emphasis religions place on it; similarly, it was proposed that increasing accessibility for religiosity would increase situational accessibility for forgiveness.  Results supported a weak, positive relationship between religiosity and chronic accessibility for forgiveness; however, increased accessibility did not relate to likelihood to forgive future transgressions.  For situational accessibility, the religious prime did not successfully influence accessibility for religiosity; thus, situational accessibility could not be tested.  For need for closure, it was proposed that forgiveness requires some comfort with uncertainty in order to engage in the process.  Therefore, chronic need for closure was expected to negatively relate to likelihood to forgive future transgressions.  Results replicated this previously found relationship.  For situational need for closure, manipulated through perceived time limitations, it was proposed that it would interact with chronic forgiveness to predict likelihood to forgive, because as need for closure increases so too does automaticity.  Forgiveness is arguably an automatic response for someone high in chronic forgiveness.  Results did not support the interaction effect.  In general, the project supported the chronic influence of the principles but did not support the situational.  The limitations of the current project necessitate further inquiry for clarification, though some conclusions are suggested.  Results suggest that motivations may be more influential than cognitions in forgiveness, that forgiveness research may require more highly contextualized models, and thus that the potential advantages of a comprehensive framework will require more sophisticated theoretical and empirical work.",
  "description_provenance": [
    "Author Email: mklaw@vt.edu",
    "Advisor Email: jdunsmor@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:45Z (GMT). No. of bitstreams: 4 Law_MaryK_D_2012.pdf: 1216614 bytes, checksum: 729d1c13268102fa60a0c796635096af (MD5) Law_MaryK_D_2012_IRB1.pdf: 201100 bytes, checksum: 5153e58e8a26c04bf4d03f4502d35278 (MD5) Law_MaryK_D_2012_IRB3.pdf: 238037 bytes, checksum: a5dcbf56a7467b06b1229a74ce10132f (MD5) Law_MaryK_D_2012_IRB2.pdf: 220051 bytes, checksum: 288b1afd62621a008dceb8dc307499f4 (MD5)   Previous issue date: 2012-04-27"
  ],
  "handle": "27602",
  "identifier_other": "etd-05082012-210125",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05082012-210125/",
  "identifier_uri": "http://hdl.handle.net/10919/27602",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Law_MaryK_D_2012.pdf",
    "Law_MaryK_D_2012_IRB1.pdf",
    "Law_MaryK_D_2012_IRB3.pdf",
    "Law_MaryK_D_2012_IRB2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "trait forgiveness",
    "religiosity",
    "accessibility",
    "need for closure",
    "general principles",
    "forgiveness"
  ],
  "title": "Testing Underlying Mechanisms of Forgiveness:  Need for Closure and Accessibility",
  "type": "Dissertation"
}