{
  "contributor_author": "Cosenzo, Keryl Ann",
  "contributor_committeechair": "Franchina, Joseph J.",
  "contributor_committeemember": [
    "Denbow, Donald Michael",
    "Friedman, Bruce H.",
    "Harrison, David W.",
    "Crawford, Helen J."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:45Z",
  "date_adate": "2002-05-21",
  "date_available": "2014-03-14T20:11:45Z",
  "date_issued": "2002-04-16",
  "date_rdate": "2003-05-21",
  "date_sdate": "2002-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This investigation examined the effects of emotion and lateralized presentation of a list of affective words on the learning of that list. This investigation also attempted to assess the separate influences of emotion and arousal on verbal performance. Experiment I was a 2x2 factorial design: two types of pictures from the International Affective Picture System (IAPS), negative or neutral and two gender conditions, male and female. Experiment I was used to verify that the IAPS results in an emotional response. Heart rate (HR) and skin conductance level (SCL) were measured during IAPS presentation. Emotion was assessed after IAPS presentation. Results showed the negative IAPS condition elicited significantly greater increases in SCL and decreases in HR, less self-reported of pleasantness and more self-reported activation than the neutral IAPS condition.  Women had significantly lower SCL and higher HR than men; men and women did not differ in reported emotion. Experiment I verified that the negative IAPS elicit changes in SCL and negative emotion in men and women. Experiment II was a 2 x 2 x 2 mixed factorial design: two types of IAPS (negative or neutral), two AAVL conditions (positive and neutral AAVL words or negative and neutral AAVL words) and two presentation conditions (AAVL presented to the left ear (LE) or right ear (RE)). The measure of performance on the AAVL was the number of correct responses. HR and SCL were measured during presentation of the IAPS and of the AAVL. In the negative IAPS condition, performance on negative AAVL was significantly better than that for the positive AAVL; for presentation of the AAVL to the RE, performance on the negative AAVL was significantly better than that for the positive and neutral AAVLs. IAPS condition or ear of presentation alone did not significantly impact on AVVL performance or on SCL and HR during the recitation of the AAVL. Evidence showed that the effect of emotion on performance is a function of mood congruent processing and possibly the allocation of hemispheric resources.",
  "description_provenance": [
    "Author Email: kcosenzo@vt.edu",
    "Advisor Email: jjfranch@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:45Z (GMT). No. of bitstreams: 1 Etd.pdf: 273782 bytes, checksum: a65b25fd75293322d5ec39f8f91fb13b (MD5)   Previous issue date: 2002-04-16"
  ],
  "handle": "27609",
  "identifier_other": "etd-05092002-233958",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092002-233958/",
  "identifier_uri": "http://hdl.handle.net/10919/27609",
  "publisher": "Virginia Tech",
  "relation_haspart": "Etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Negative Emotion",
    "Hemispheric Presentation",
    "Verbal Learning",
    "Performance"
  ],
  "title": "Influence of the Negative IAPS and Method of Hemispheric Presentation on Performance on the Affective Auditory Verbal Learning Test",
  "type": "Dissertation"
}