{
  "contributor_author": "Slotta, Douglas J.",
  "contributor_committeechair": "Heath, Lenwood S.",
  "contributor_committeemember": [
    "Ramakrishnan, Naren",
    "Murali, T. M.",
    "Vergara, John Paul",
    "Potts, Malcolm",
    "Helm, Richard Frederick"
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2014-03-14T20:11:46Z",
  "date_adate": "2005-05-24",
  "date_available": "2014-03-14T20:11:46Z",
  "date_issued": "2005-05-05",
  "date_rdate": "2005-05-24",
  "date_sdate": "2005-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Analyses based upon rank correlation methods, such as Spearman's Rho and Kendall's Tau, can provide quick insights into large biological data sets.  Comparing expression levels between different technologies and models is problematic due to the different units of measure. Here again, rank correlation provides an effective means of comparison between the two techniques. Massively Parallel Signature Sequencing (MPSS) transcript abundance levels to microarray signal intensities for Arabidopsis thaliana are compared.  Rank correlations can be applied to subsets as well as the entire set. Results of subset comparisons can be used to improve the capabilities of predictive models, such as Predicted Highly Expressed (PHX). This is done for Escherichia coli.  Methods are given to combine predictive models based upon feedback from experimental data. The problem of feature selection in supervised learning situations is also considered, where all features are drawn from a common domain and are best interpreted via ordinal comparisons with other features, rather than as numerical values. This is done for synthetic data as well as for microarray experiments examining the life cycle of Drosophila melanogaster and human leukemia cells. Two novel methods are presented based upon Rho and Tau, and their efficacy is tested with synthetic and real world data. The method based upon Spearman's Rho is shown to be more effective.",
  "description_provenance": [
    "Author Email: dslotta@vt.edu",
    "Advisor Email: ramakris@trinetra.cs.vt.edu",
    "Advisor Email: murali@cs.vt.edu",
    "Advisor Email: jpvergara@ateneo.edu",
    "Advisor Email: geordie@vt.edu",
    "Advisor Email: helmrf@vt.edu",
    "Advisor Email: heath@cs.vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:46Z (GMT). No. of bitstreams: 1 dis.pdf: 1544251 bytes, checksum: 486c30392101bd78a792bc2aa3066143 (MD5)   Previous issue date: 2005-05-05"
  ],
  "handle": "27613",
  "identifier_other": "etd-05092005-105158",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092005-105158/",
  "identifier_uri": "http://hdl.handle.net/10919/27613",
  "publisher": "Virginia Tech",
  "relation_haspart": "dis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "MPSS",
    "bioinformatics",
    "microarrays",
    "spoiler count",
    "rank-order",
    "feature selection"
  ],
  "title": "Evalutating Biological Data Using Rank Correlation Methods",
  "type": "Dissertation"
}