{
  "contributor_author": "Wagner, Teresa Ann",
  "contributor_committeechair": "Harvey, Robert J.",
  "contributor_committeemember": [
    "Bell, Martha Ann",
    "Carlson, Kevin D.",
    "Skaggs, Gary E.",
    "Crawford, Helen J."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:46Z",
  "date_adate": "2004-05-11",
  "date_available": "2014-03-14T20:11:46Z",
  "date_issued": "2004-04-30",
  "date_rdate": "2007-05-11",
  "date_sdate": "2004-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The performance of the Wagner Assessment Test (WAT; Wagner & Harvey, in press) when administered using computer adaptive testing (CAT) methods was examined using the original 103-item WAT pool and an expanded 263-item pool. Although previous research (e.g., Wagner & Harvey, in press) has shown that the WAT outperforms the Watson Glaser Critical Thinking Appraisal (WGCTA; Watson & Glaser, 1980) in terms of test information, standard error, and susceptibility to successful guessing, it was hypothesized that a significant lengthening of the WAT item pool would be necessary in order to achieve acceptable CAT item-exposure rates. Using item parameters derived in an N = 423 college-student sample, Monte Carlo methods were used to conduct CAT sessions in an N = 5,000 sample of simulated raters; theta estimation accuracy and item-exposure levels at test lengths of 20, 40, and 60 items were examined. Results indicated that both b-blocking a-stratified (BAS) and Fisher maximum-information (FMI) methods of item selection exhibited strong convergence with the true theta scores; however, only BAS yielded acceptable item-exposure rates in CAT tests of these lengths.",
  "description_provenance": [
    "Author Email: tewagner@vt.edu",
    "Advisor Email: harveyrj@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: kevinc@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: hjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:46Z (GMT). No. of bitstreams: 1 TeresaAnnWagnerDissertation.pdf: 3083631 bytes, checksum: fc8d2c49aac23066b1d9b920193107d8 (MD5)   Previous issue date: 2004-04-30"
  ],
  "handle": "27612",
  "identifier_other": "etd-05092004-213057",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092004-213057/",
  "identifier_uri": "http://hdl.handle.net/10919/27612",
  "publisher": "Virginia Tech",
  "relation_haspart": "TeresaAnnWagnerDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Item Exposure",
    "Critical Thinking",
    "WAT",
    "Wagner Assessment Test",
    "Computer Adaptive Testing",
    "CAT"
  ],
  "title": "Item Exposure issues in the Wagner Assessment Test: A Computer Adaptive Testing Approach",
  "type": "Dissertation"
}