{
  "contributor_author": "Lau, Rebecca  S.",
  "contributor_committeechair": "Cobb, Anthony Terry",
  "contributor_committeemember": [
    "Bonham, Thirwall W.",
    "Connerley, Mary L.",
    "Hauenstein, Neil M. A."
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:11:46Z",
  "date_adate": "2008-06-04",
  "date_available": "2014-03-14T20:11:46Z",
  "date_issued": "2008-04-30",
  "date_rdate": "2008-06-04",
  "date_sdate": "2008-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Both leader-member exchange (LMX) and organizational justice have commanded a great deal of attention in organizational research.  Despite this attention, these two research areas are seldom integrated for examination.  This dissertation aimed at helping to integrate these two areas and extend them to a higher level of analysis.  Two models were developed at the individual- and group-levels of analysis.  In the individual-level model, LMX quality was hypothesized to interact with role breadth self-efficacy (RBSE) and two group characteristics â   LMX differentiation and intra-group communication â   to impact justice perceptions.  It was further hypothesized that justice perceptions would mediate the association between LMX quality and various individual outcomes.  In the group-level model, it was hypothesized that LMX differentiation would impact justice climate strength in groups which in turn would affect group-level outcomes.  Moreover, justice climate strength was hypothesized to impact these group-level outcomes through two group processes â   relationship conflict and team-member exchange (TMX).  Data collected from 413 members constituting 87 groups in a corps of cadets revealed that LMX quality interacted with RBSE, LMX differentiation, and intra-group communication to affect procedural and interactional justice perceptions.  In addition, distributive, procedural, and interactional justice perceptions partially mediated the impact of LMX quality on group membersâ   commitment to the leader, satisfaction with the leader, job performance, and citizenship behaviors to different degrees.  When extended to the group-level of analysis, LMX differentiation in groups was found to lower the strength of distributive, procedural, and interactional justice climates in the groups.  These weak justice climates promoted more relationship conflict and hindered social exchange among group members.  They also dampened group membersâ   commitment to the group, satisfaction with the group, group performance, and citizenship behaviors in the group.   Contributions, practical implications, and future directions for research on LMX and organizational justice are discussed.",
  "description_provenance": [
    "Author Email: slau@vt.edu",
    "Advisor Email: tcobb@vt.edu",
    "Advisor Email: bonham@vt.edu",
    "Advisor Email: maryc@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:46Z (GMT). No. of bitstreams: 1 RLau_Dissertation.pdf: 523727 bytes, checksum: c34df561a9be5badbf46c1667b535b00 (MD5)   Previous issue date: 2008-04-30"
  ],
  "handle": "27616",
  "identifier_other": "etd-05092008-134102",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092008-134102/",
  "identifier_uri": "http://hdl.handle.net/10919/27616",
  "publisher": "Virginia Tech",
  "relation_haspart": "RLau_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Leader-member exchange",
    "organizational justice",
    "LMX differentiation",
    "justice climates"
  ],
  "title": "Integration and Extension of Leader-Member Exchange and Organizational Justice and Individual- and Group-Levels of Analysis",
  "type": "Dissertation"
}