{
  "contributor_author": "Bhootra, Ajay",
  "contributor_committeechair": "Cliff, Michael T.",
  "contributor_committeemember": [
    "Gulen, Huseyin",
    "Kadlec, Gregory B.",
    "Kumar, Raman"
  ],
  "contributor_department": "Finance, Insurance, and Business Law",
  "date_accessioned": "2014-03-14T20:11:46Z",
  "date_adate": "2008-06-04",
  "date_available": "2014-03-14T20:11:46Z",
  "date_issued": "2008-05-01",
  "date_rdate": "2008-06-04",
  "date_sdate": "2008-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation consists of two essays.  In the first essay, I examine the source of momentum in stock returns.  The reversal of momentum returns has been interpreted as evidence that momentum results from delayed overreaction to information.  I examine momentum and reversals conditional on firmsâ   share issuance (net of repurchases) during the momentum holding period and show that (1) among losers, the momentum returns are statistically significant, but the reversals are non-existent, for both issuers and non-issuers; (2) among winners, momentum and reversals are restricted to issuers, but are non-existent among non-issuers.  After further conditioning on firm size, I find that winner reversals are restricted to small, equity issuing firms.  After excluding these small issuers from the sample, the remaining firms have strong momentum profits with no accompanying reversals.  The evidence suggests that the return reversals are a manifestation of the poor performance of equity issuing firms.  Further, while investor overreaction potentially contributes to the momentum among winners, a large fraction of firms do not earn any significant abnormal returns following initial price continuation, suggesting that underreaction, and not delayed overreaction to information, is the dominant source of momentum in stock returns.<p>  In the second essay, I examine alternative explanations of reversals in stock returns.  George and Hwang (2007) find that long-term reversals in stock returns are driven by investorsâ   incentive to defer payment of taxes on locked-in capital gains rather than by overreaction to information.  I show that return reversals are instead attributable to the negative relationship between firmsâ   composite share issuance and future stock returns documented in Daniel and Titman (2006).  The ability of locked-in capital gains measures to forecast stock returns is largely subsumed by the composite share issuance measure.  My results do not support the hypothesis that capital gains taxes drive long-term return reversals.",
  "description_provenance": [
    "Author Email: abhootra@vt.edu",
    "Advisor Email: mcliff@vt.edu",
    "Advisor Email: hgulen@vt.edu",
    "Advisor Email: kadlec@vt.edu",
    "Advisor Email: rkumar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:46Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 572412 bytes, checksum: 27c599b9c04a872a7cf8c3b2d592dc05 (MD5)   Previous issue date: 2008-05-01"
  ],
  "handle": "27617",
  "identifier_other": "etd-05092008-141032",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092008-141032/",
  "identifier_uri": "http://hdl.handle.net/10919/27617",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "underreaction",
    "reversals",
    "composite share issuance",
    "locked-in capital gain taxes",
    "intangible information",
    "momentum",
    "delayed overreaction"
  ],
  "title": "Two Essays on Momentum and Reversals in Stock Returns",
  "type": "Dissertation"
}