{
  "contributor_author": "Dwyer, James Fitzgerald",
  "contributor_committeecochair": [
    "Morrison, Joan L.",
    "Fraser, James D."
  ],
  "contributor_committeemember": [
    "Walters, Jeffrey R.",
    "Prisley, Stephen P.",
    "Hopkins, William A."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:11:46Z",
  "date_adate": "2010-06-14",
  "date_available": "2014-03-14T20:11:46Z",
  "date_issued": "2010-05-06",
  "date_rdate": "2010-06-14",
  "date_sdate": "2010-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Like many species, Floridaâ  s population of Northern Crested Caracaras (Caracara cheriway, hereafter â  caracaraâ  ) is likely declining due to loss of breeding habitat.  Consequently, management-oriented restrictions on landscape modification are applied where breeding occurs, but management rarely is extended beyond breeding areas.  Focusing management on breeding areas can be effective if all caracaras occupy breeding areas, all breeding areas are detected, and no intermittent breeding occurs.  Management may not operate as intended if any of these criteria are unmet.  To explore this possibility, I investigated the movement, habitat, survival, and social biology of non-breeding caracaras.  I also investigated long-term occupancy of breeding habitat, and factors contributing to detection of breeding.   \tNon-breeding caracaras occupy areas much larger than individual breeding territories, particularly during breeding seasons.  Pastures occupied by cattle were the most used habitat, but non-breeding caracaras also occupied habitats atypical of breeding areas.  Specifically, citrus groves were occupied extensively, and row crops were used particularly during breeding seasons.  Non-breeding caracaras also shared communal roosts, sometimes with hundreds of conspecifics, and roosts were occupied year-round.  Survival of non-breeding caracaras was lowest during breeding seasons.  Adult non-breeding caracaras persisted in groups for multiple years without establishing breeding territories.  This implies that breeding habitat is limited and saturated.  Given the proportion of adults in groups, adults also were the first to find carrion more often than expected.  Apparently, young caracaras benefit from grouping by following adults.  I found caracaras at all sampled breeding areas where nests were originally documented during the 1990s, and found nests at 83% of territories where nests likely existed.  I also found that observer experience, visit start time, and weather affected the probability that a nest would be detected.  Thus, not all caracaras occupy breeding areas, and not all breeding attempts are likely to be detected.  Long-term occupancy of breeding areas should render annual verification of nesting unnecessary as a trigger for maintaining management actions.  Rather management should persist even without confirmation of annual breeding.   Caracara management also may be optimized through supporting the non-breeding population by maintaining a matrix of cattle pasture and citrus groves, particularly around roosts.",
  "description_provenance": [
    "Author Email: biojimmi@yahoo.com",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: joan.morrison@trincoll.edu",
    "Advisor Email: fraser@vt.edu",
    "Advisor Email: prisley@vt.edu",
    "Advisor Email: hopkinsw@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:46Z (GMT). No. of bitstreams: 1 Dwyer_JF_D_2010.pdf: 5431936 bytes, checksum: 92ccedbe77bde4d7bee1b109d6cc3aa3 (MD5)   Previous issue date: 2010-05-06"
  ],
  "handle": "27618",
  "identifier_other": "etd-05092010-132909",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092010-132909/",
  "identifier_uri": "http://hdl.handle.net/10919/27618",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dwyer_JF_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Crested Caracara",
    "core area",
    "Caracara cheriway",
    "bird",
    "avian",
    "roost",
    "raptor",
    "range",
    "program MARK",
    "Northern Crested Caracara",
    "survival",
    "social biology",
    "season",
    "threatened species.",
    "population monitoring",
    "occupancy",
    "non-breeding",
    "floater",
    "Florida",
    "habitat",
    "home range",
    "immature",
    "intermittent breeding",
    "modeling",
    "movement"
  ],
  "title": "ECOLOGY OF NON-BREEDING AND BREEDING CRESTED CARACARAS (CARACARA CHERIWAY) IN FLORIDA",
  "type": "Dissertation"
}