{
  "contributor_author": "Crossley, Danielle Suzanne",
  "contributor_committeecochair": [
    "Tripp, Norman Wayne",
    "Cash, Carol S."
  ],
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Kilkelly, Ann G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:47Z",
  "date_adate": "2010-05-26",
  "date_available": "2014-03-14T20:11:47Z",
  "date_issued": "2010-05-04",
  "date_rdate": "2011-05-26",
  "date_sdate": "2010-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "To ensure an educational opportunity for every child that passes through Americaâ  s schoolhouse doors, it is imperative that non-heterosexual studentsâ   educational needs are not ignored in the educational milieu (Zirkel, 2006). In the last decade or so, the desire of non-heterosexual students to organize Gay-Straight Alliance (GSA) clubs on high school campuses have been met with angst by school leaders (Duncan & Rogers, 2008). Despite the passage of the Equal Access Act (EAA) in 1984, school leaders have often denied  non-heterosexual students the right to establish GSA clubs on campus, consequently resulting in these students utilizing the judicial system as the venue to assert their rights under the law (Essex, 2005). As it is imperative that educational leaders understand the legal rights of all students under their care, and make informed decisions in order to avoid costly litigation, this research focused on analyzing the Equal Access Act of 1984, federal case law, legal commentary, and historical documents, in order to track the developments of non-heterosexual studentsâ   ability to utilize the EAA to establish GSA clubs in the public schools in the United States. The study employed a traditional legal research methodology as described by Alder (1993) and Russo (1993), relying on electronic data bases and traditional legal finding tools to carry out the research. From the resulting legislation, case law, scholarly commentary, and other relevant documents reviewed and analyzed, an accurate historical perspective on the EAA as it relates to the formation of GSA clubs was constructed. In addition, the significant themes that arose from the findings were synthesized in order to offer guidance to educational leaders and policymakers when facing requests from students to establish GSA clubs on school property. Recommendations for school leaders when considering such requests from students to form GSA clubs under the EAA are provided.",
  "description_provenance": [
    "Author Email: dcrossle@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: akilkell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:47Z (GMT). No. of bitstreams: 1 Crossley_DS_D_2010.pdf: 1330928 bytes, checksum: 6fec9d73da0eebee500157200d83bb6b (MD5)   Previous issue date: 2010-05-04"
  ],
  "handle": "27619",
  "identifier_other": "etd-05092010-211253",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092010-211253/",
  "identifier_uri": "http://hdl.handle.net/10919/27619",
  "publisher": "Virginia Tech",
  "relation_haspart": "Crossley_DS_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Gay-Straight Alliances",
    "educational policy",
    "school law",
    "Equal Access Act of 1984",
    "non-heterosexual students (LGBT)"
  ],
  "title": "The Equal Access Act: â  Not the Access for All Students Except Gay Students Actâ  : Federal Judicial Decisions and Their Implications for School Systemsâ   Policies and Practices Regarding Student Requests to Establish Gay Straight Alliance Clubs in Public Schools",
  "type": "Dissertation"
}