{
  "contributor_author": "Baker, Della A.",
  "contributor_committeechair": "Creamer, Donald G.",
  "contributor_committeemember": [
    "Scales, Glenda Rose",
    "Janosik, Steven M.",
    "Uttech, Melanie R.",
    "Minish, Roberta M."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:48Z",
  "date_adate": "2001-05-11",
  "date_available": "2014-03-14T20:11:48Z",
  "date_issued": "2001-05-07",
  "date_rdate": "2002-05-11",
  "date_sdate": "2001-05-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The purpose of this qualitative case study was to describe the evaluation of university-community engagement scholarship through the college level promotion and tenure process at Southeastern University and to determine the value of faculty engagement as scholarship through that process. This study also examined useful criteria for judging such scholarship. In designing this study, three research methods were employed. Those methods were (a) interviews with faculty and department heads within the College of Education, and other university administrators at Southeastern University; (b) a review of university documents germane to the promotion and tenure process; and (c) an examination of dossier comment forms about a fictional dossier.  <p>Data were transcribed, coded, and categorized using content analysis. A role-ordered matrix was designed to display the perceptions and attitudes of the participants interviewed regarding the evaluation of engagement scholarship within the College of Education at Southeastern University.  <p>A conceptually clustered matrix was used to display empirical data that related by theme. A case dynamics matrix was used as an attempt to link consequential processes. An event network was helpful in displaying relationships among the respondents regarding the promotion and tenure process. This network depicted the people within that process and the flow of major communication that affects the promotion and tenure process.  <p>This study resulted in a model of engagement scholarship and a model for promoting engagement within a university setting. Findings from this study included a list of criteria offered by the resondents that paralleled those proposed by Glassick et al (1997). Perceived values of engagement scholarship were mixed and depended on whether such scholarship produced publications, grants, and contracts. This study might be useful for persons being evaluated for university-community engagement scholarship and for those evaluating university-community engagement scholarship in university setting.",
  "description_provenance": [
    "Author Email: debaker@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:48Z (GMT). No. of bitstreams: 1 della_ps.pdf: 782673 bytes, checksum: f6e4a8d0bad76e38db52bbd273b8a681 (MD5)   Previous issue date: 2001-05-07"
  ],
  "handle": "27625",
  "identifier_other": "etd-05102001-213726",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05102001-213726/",
  "identifier_uri": "http://hdl.handle.net/10919/27625",
  "publisher": "Virginia Tech",
  "relation_haspart": "della_ps.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Evaluating University Scholarship",
    "Engagement Scholarship",
    "Promotion and Tenure"
  ],
  "title": "The Evaluation of University-Community Engagement Scholarship Within the College Level Promotion and Tenure Process",
  "type": "Dissertation"
}