{
  "contributor_author": "Chandler, Helena Kate",
  "contributor_committeechair": "Clum, George A. Jr.",
  "contributor_committeemember": [
    "Cooper, Lee D.",
    "Cooper, Robin K. Panneton",
    "Winett, Richard A.",
    "Finney, Jack W."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:48Z",
  "date_adate": "2002-06-12",
  "date_available": "2014-03-14T20:11:48Z",
  "date_issued": "2002-05-07",
  "date_rdate": "2003-06-12",
  "date_sdate": "2002-05-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Associations between the experience of traumatic events and illness behaviors such as health complaints and healthcare use are reported in recent studies.   Posttraumatic Stress Disorder (PTSD) symptoms and diagnosis have been found to mediate this trauma-illness relationship.  Differences in health behaviors have additionally been noted in the literature, with trauma victims engaging in more negative health behaviors, which may subsequently affect illness status.  Further, illness behaviors such as somatic complaints and healthcare utilization are influenced by modeling and reinforcement of such behaviors. The current study sought to evaluate the contributions of negative health behaviors, illness-related learning history, and PTSD symptoms on trauma victims' health complaints, functional health status, and utilization of healthcare services. The final sample included 298 undergraduate students at a large southeastern university.  Participants provided information about their trauma histories, health behaviors, illness-related learning history and current illness behaviors on group-administered self-report questionnaires.  Consent to obtain utilization information from the university health center was also obtained.  Hierarchical regression analyses were used to assess the additive contributions of the predictor variables. The results indicated that health complaints, functional health status, and utilization behavior are each influenced by trauma history, with more illness behavior associated with greater trauma severity.  In addition, health behaviors, illness-related learning history and PTSD symptoms all contribute to the prediction of health complaints and functional health status.  Utilization behavior, however, was predicted only by trauma history and learning history.  Further, the different types of learning history (modeling, reinforcement, priming) appear to affect different illness behaviors.  Implications of the study are discussed.",
  "description_provenance": [
    "Author Email: hechandl@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: cooperr@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:48Z (GMT). No. of bitstreams: 1 chandler1.pdf: 278747 bytes, checksum: f8487795cf8cf3d878c9c85d626484f8 (MD5)   Previous issue date: 2002-05-07"
  ],
  "handle": "27626",
  "identifier_other": "etd-05102002-083741",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05102002-083741/",
  "identifier_uri": "http://hdl.handle.net/10919/27626",
  "publisher": "Virginia Tech",
  "relation_haspart": "chandler1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "utilization behavior",
    "health complaints",
    "learning",
    "health behavior",
    "PTSD"
  ],
  "title": "Factors affecting the relationship between trauma and illness behavior",
  "type": "Dissertation"
}