{
  "contributor_author": "Figliano, Fred Joseph",
  "contributor_committeechair": "Wells, John G.",
  "contributor_committeemember": [
    "Williams, Thomas O. Jr.",
    "Wilkins, Jesse L. M.",
    "Paretti, Marie C.",
    "Jones, Brett D."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:48Z",
  "date_adate": "2011-05-24",
  "date_available": "2014-03-14T20:11:48Z",
  "date_issued": "2011-05-02",
  "date_rdate": "2011-05-24",
  "date_sdate": "2011-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This document outlines the development of a Design Log Instrument (DLI) intended for use in identifying moments of abstraction as evidence of STEM content knowledge transfer. Many theoretical approaches to explaining knowledge transfer are rooted in a belief that transfer occurs through knowledge abstraction (Reed, Ernst, & Banerji, 1974; Gick & Holyoak, 1980, 1983). The DLI prompts participants to be reflective during technological/engineering design activities. During the development of this instrument, a three-phase multiple case: embedded design was used. Three distinct Phases accommodated the collection and analysis of data necessary for this investigation: Phase 1: Pilot Case Study, Phase 2: Establishing Content Validity, and Phase 3: Establishing Construct Validity. During Phase 3, data from the DLI was collected at each of seven work sessions from two design teams each working through different engineering problems. At the end of Phase 3, a comparison of abstractions found in DLI responses and observation data (Audio/Video transcripts) indicated the extent to which the DLI independently reflected those abstractions revealed in observations (Audio/Video transcripts). Results of this comparison showed that the DLI has the potential to be 68% reliable to reveal abstracted knowledge. Further analysis of these findings showed ancillary correlations between the percent abstractions found per DLI reflective prompt and the percent abstractions found per T/E design phase. Specifically, DLI Reflective Prompts 2 and 3 correlate with T/E Design Phases 3 and 4 (58% and 76% respectively of the total abstractions) which deal with design issues related to investigating the problem and developing alternate solutions. DLI Reflective Prompts 4 and 5 correlate with T/E Design Phases 5 and 6 (22% and 24% respectively of total abstractions) which deal with design issues related to choosing a solution and developing a prototype. Findings also indicate that there are highs and lows of abstraction throughout the T/E design process. The implications of these highs and lows are that specific phases of the T/E design process can be targeted for research and instruction. By targeting specific T/E design phases, a researcher or instructor can increase the likelihood of fostering abstractions as evidence of STEM content knowledge transfer.",
  "description_provenance": [
    "Author Email: figlian2@vt.edu",
    "Advisor Email: thwilli1@vt.edu",
    "Advisor Email: wilkins@vt.edu",
    "Advisor Email: mparetti@vt.edu",
    "Advisor Email: brettjones@vt.edu",
    "Advisor Email: jgwells@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:48Z (GMT). No. of bitstreams: 2 Figliano_FJ_D_2011_1.pdf: 5310059 bytes, checksum: 0072e3e46c35fcf276e8e03a2ac6a653 (MD5) Figliano_FJ_D_2011_fairuse.pdf: 1259690 bytes, checksum: 7163cf1d351d135959ae1249516142a2 (MD5)   Previous issue date: 2011-05-02"
  ],
  "handle": "27620",
  "identifier_other": "etd-05092011-154501",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092011-154501/",
  "identifier_uri": "http://hdl.handle.net/10919/27620",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Figliano_FJ_D_2011_1.pdf",
    "Figliano_FJ_D_2011_fairuse.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Abstractions",
    "Knowledge Transfer",
    "Technological Design",
    "Instrument Development",
    "Design Log"
  ],
  "title": "Development of an Instrument to Evidence Knowledge Abstractions in Technological/Engineering Design-Based  Activities",
  "type": "Dissertation"
}