{
  "contributor_author": "Inger, Kerry Katharine",
  "contributor_committeechair": "Cloyd, C. Bryan",
  "contributor_committeemember": [
    "Hansen, T. Bowe",
    "Mansi, Sattar A.",
    "Salbador, Debra A.",
    "Seago, W. Eugene"
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:11:48Z",
  "date_adate": "2012-05-23",
  "date_available": "2014-03-14T20:11:48Z",
  "date_issued": "2012-04-30",
  "date_rdate": "2012-05-23",
  "date_sdate": "2012-05-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This paper examines the relative valuation of alternative methods of tax avoidance.  Prior studies find that firm value is positively associated with overall measures of tax avoidance; I extend this research by providing evidence that investors distinguish between methods of tax reduction in their valuation of tax avoidance.  The impact of tax avoidance on firm value is a function of tax risk, permanence of tax savings, tax planning costs, implicit taxes and contrasts in disclosures of tax reduction in the financial statements.  My empirical results suggest that tax avoidance resulting from stock option tax benefits is positively associated with firm value, accelerated depreciation is not associated with firm value and deferral of residual tax on foreign earnings is negatively associated with firm value.   Prior studies that find the positive association between firm value and tax avoidance is attenuated in poorly governed firms suggest the discount results from investor concern of managerial opportunism.  Self-serving managers conceal diversion of tax savings from investors under the pretext that aggressive tax positions must be hidden from tax authorities in the financial statements.  Under this theory transparent tax reduction methods that are clearly supported by the law should not be discounted by investors of poorly governed firms.  However, I find that tax avoidance resulting from transparent stock option tax deductions is discounted in poorly governed firms, while tax avoidance derived from opaque deferral of the residual tax on foreign earnings is not, inconsistent with investors believing that managers are exploiting the compromised information environment associated with complex tax transactions.",
  "description_provenance": [
    "Author Email: kkinger1@vt.edu",
    "Advisor Email: bcloyd@vt.edu",
    "Advisor Email: bhansen1@vt.edu",
    "Advisor Email: smansi@vt.edu",
    "Advisor Email: salbador@vt.edu",
    "Advisor Email: seago@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:48Z (GMT). No. of bitstreams: 1 Inger_KK_D_2012.pdf: 826599 bytes, checksum: 3d5f1458d9ac64bddd00c416b846d362 (MD5)   Previous issue date: 2012-04-30"
  ],
  "handle": "27623",
  "identifier_other": "etd-05092012-162233",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05092012-162233/",
  "identifier_uri": "http://hdl.handle.net/10919/27623",
  "publisher": "Virginia Tech",
  "relation_haspart": "Inger_KK_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Tax Avoidance",
    "firm value",
    "corporate governance"
  ],
  "title": "Relative valuation of alternative methods of tax avoidance",
  "type": "Dissertation"
}