{
  "contributor_author": "Zakaria, Zulkifli",
  "contributor_committeechair": "Finch, Curtis R.",
  "contributor_committeemember": [
    "Tegarden, David P.",
    "Price, William T. Jr.",
    "Lockee, Barbara B.",
    "Asselin, Susan B."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:48Z",
  "date_adate": "2001-05-11",
  "date_available": "2014-03-14T20:11:48Z",
  "date_issued": "2001-05-08",
  "date_rdate": "2002-05-11",
  "date_sdate": "2001-05-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Factors Related to Information Technology Implementation in the Malaysian Ministry of Education Polytechnics  Zulkifli Zakaria   (ABSTRACT)  The purpose of this study was to examine factors related to information technology (IT) implementation in the curriculum. The focus was on Malaysian Ministry of Education Polytechnic (MoEP) faculty membersâ   attitudes toward IT, as well as IT availability and IT use in teaching. The response rate from the 332 surveys sent to the MoEP was 75.9%.  Faculty members as a whole appeared to have readiness for adoption of changes related to IT use in teaching despite the lack of IT use in general. The use of selected IT items was skewed greatly in the direction of non-use. Faculty attitudes toward the use of IT in their teaching were very positive.   The overall professional development experiences in IT that respondents had were greatly skewed toward non-participation. Results for items associated with supports services showed that they were available for faculty use.  Sixty-nine percent of the respondents reported to face barriers to the use IT in their teaching.  The extent of IT use in general for male respondents and female respondents showed a significant difference among gender. ANOVA revealed no difference between MoEP membership and IT use in general. Analysis of department membership and IT use in general revealed no difference between the two. Highest level of education had a low significant correlation with extent of IT use in general. A low negative correlation was shown between highest level of education and other demographic variables. Age had a moderate positive correlation with years served for the MoEP and a high correlation with years served for the MoE. Years served for the MoEP also has a moderate correlation with years served for the MoE. There were no significant correlations among variables except for online discussion and teaching load. Highest level of education showed a low correlation with email, WWW, and scanner.  Multiple regression analysis was conducted to determine what variables were the best predictors of IT use. Results revealed an R2 of 0.04. Highest level of education contributed significantly to the variance. Adoption proneness proved to be a predictor for IT use in teaching, while other selected demographic variables were not significant predictors.",
  "description_provenance": [
    "Author Email: zzakaria@vt.edu",
    "Advisor Email: dtegarde@vt.edu",
    "Advisor Email: wprice@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: crfinch@vt.edu",
    "Advisor Email: sasselin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:48Z (GMT). No. of bitstreams: 2 Abstract.txt: 1346 bytes, checksum: 44b4476fa11598af6099067beb7e5c13 (MD5) etd.PDF: 322936 bytes, checksum: 8fe276c322f9461f6651673df4796a03 (MD5)   Previous issue date: 2001-05-08"
  ],
  "handle": "27624",
  "identifier_other": "etd-05102001-181229",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05102001-181229/",
  "identifier_uri": "http://hdl.handle.net/10919/27624",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Abstract.txt",
    "etd.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Faculty",
    "Attitude",
    "Information Technology Use",
    "Malaysia",
    "Adoption Proneness"
  ],
  "title": "Factors Related to Information Technology Implementation in the Malaysian Ministry of Education Polytechnics",
  "type": "Dissertation"
}