{
  "contributor_author": "Perkins, Susan Nadine",
  "contributor_committeechair": "Piercy, Fred P.",
  "contributor_committeemember": [
    "Dolbin-MacNab, Megan L.",
    "Blow, Adrian J.",
    "Doolittle, Peter E."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:49Z",
  "date_adate": "2010-05-25",
  "date_available": "2014-03-14T20:11:49Z",
  "date_issued": "2010-04-29",
  "date_rdate": "2010-05-25",
  "date_sdate": "2010-05-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Researchers and clinicians report that they think the client is the most influential component in determining the outcome of therapy. Although a variety of studies have examined the impact of various client factors on the outcome of couple therapy, this research is not cohesive and produces inconsistent results. The purpose of this multi-method study is to present a sense of the range and depth of client factors that influence the outcome of couple therapy. The use of qualitative and quantitative methods allowed the data to build on existing research while expanding the range of client factors considered. Data were gathered using a dynamic, web-based survey which assigned participants to discuss a case of successful or unsuccessful couple therapy. Participants provided their own descriptions of influential client characteristics. Participants also rated how important they thought several literature-based client factors were. Quantitative data analysis utilized descriptive statistics, principal components analysis, and logistic regression. Qualitative data were analyzed in two stages, using content analysis. Results indicated that couples can be conceptualized by five arenas of couple focus; these arenas accurately predicted whether participants were discussing a successful or unsuccessful case of couple therapy 85.9% of the time. Regarding individual client characteristics, in general, clients whose couple therapy was successful tended to be open to each other and committed to the relationship and to therapy. Unsuccessful couple therapy tended to focus on a greater number of individual issues. Couple dynamics characteristics differed according to outcome groups; participants described four types of couple dynamics that influenced couple therapy to be unsuccessful. Data showed that many client factors influenced the outcome of couple therapy, and that uncommon client characteristics could be vital to the outcome of some cases. Participants described a clientâ  s life events as impacting the outcome of couple therapy by increasing one personâ  s vulnerability to his or her partner. If the partner acted in a way that created a sense of connection or support, this contributed to successful couple therapy. The results are presented in connection to previous research, when possible. Finally, implications for theory, research, and clinical work with couples are discussed.",
  "description_provenance": [
    "Author Email: sperkins.research@gmail.com",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: mdolbinm@vt.edu",
    "Advisor Email: blowa@msu.edu",
    "Advisor Email: pdoo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:49Z (GMT). No. of bitstreams: 1 sperkins_dissertation_2010.pdf: 3233652 bytes, checksum: 524ce9047eb64d40d7b58dea0d154f2a (MD5)   Previous issue date: 2010-04-29"
  ],
  "handle": "27631",
  "identifier_other": "etd-05102010-165141",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05102010-165141/",
  "identifier_uri": "http://hdl.handle.net/10919/27631",
  "publisher": "Virginia Tech",
  "relation_haspart": "sperkins_dissertation_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "common factors",
    "client factors",
    "therapy",
    "outcomes"
  ],
  "title": "Influential Client Factors: Understanding and Organizing Therapists' Perceptions Of Client Factors That Influence Reported Outcome of Therapy",
  "type": "Dissertation"
}