{
  "contributor_author": "Geist, Brian Lee",
  "contributor_committeechair": [
    "Robinson, Hans D.",
    "Robertson, John L."
  ],
  "contributor_committeemember": [
    "Zimmerman, Kurt L.",
    "Park, Kyungwha",
    "Indebetouw, Guy J."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:11:49Z",
  "date_adate": "2009-06-10",
  "date_available": "2014-03-14T20:11:49Z",
  "date_issued": "2009-04-24",
  "date_rdate": "2009-06-10",
  "date_sdate": "2009-05-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The first thermal cycling experiments of ionic self-assembled multilayer (ISAM) films have been reported examining their survivability through repeated thermal cycles from -20° C to 120° C in ambient atmospheric conditions. The films were constructed from alternating layers of Nile Blue A and gold nanoparticles which provided a strong absorbance in the optical wavelength range. No degradation of the optical characteristics of the ISAM films was observed [1]. Techniques for measuring the capacitance and resistivity of various ISAM films have also been developed allowing for a more complete electrical characterization of ISAM films. Capacitance measurements enabled a calculation of the dielectric function and breakdown field strength of the ISAM films. The capacitance measurement technique was verified by measuring the dielectric function of a spin-coated thin film PMMA, which has a well characterized dielectric function [2]. Surface-enhanced Raman spectroscopy (SERS) has been studied as a possible detection method for malignant melanoma revealing spectral differences in blood sera from healthy horses and horses with malignant melanoma. A SERS microscope system was constructed with the capability of resolving the Raman signal from biologically important molecules such as beta-carotene and blood sera. The resulting Raman signals from sera collected from horses with malignant melanoma were found to have additional peaks not found in the Raman signals obtained from sera collected from healthy horses. A systematic analysis of the combination of absorbance and fluorescence signals of blood sera collected from populations of healthy dogs and dogs with cancer has resulted in a rapid and cost-effective method for monitoring protein concentrations that could possibly be used as part of a cancer screening process. This method was developed using the absorbance and fluorescence signals from known serum proteins, the combinations of which were used to match the absorbance and fluorescence signals of blood sera allowing for an accurate determination of protein concentrations in blood sera [3]. Finally, a novel method for measuring the melting point of DNA in solution using capacitance measurements is presented. This method allows for the determination of the melting temperature as well as the melting entropy and melting enthalpy of DNA strands. Two different short strands of DNA, 5'-CAAAATAGACGCTTACGCAACGAAAAC-3' along with its complement and 5'-GGAAGAGACGGAGGA-3' along with its complement were used to validate the technique as the characteristics of these strands could be modeled using theoretical methods. This experimental technique allows for the precise determination of the melting characteristics of DNA strands and can be used to evaluate the usefulness of theoretical models in calculating the melting point for particular strands of DNA. Additionally, a micro-fluidic device has been proposed that will allow for a rapid and cost-effective determination of the melting characteristics of DNA [4].",
  "description_provenance": [
    "Author Email: bgeist@vt.edu",
    "Advisor Email: kzimmerm@vt.edu",
    "Advisor Email: kyungwha@vt.edu",
    "Advisor Email: gindebet@vt.edu",
    "Advisor Email: hansr@vt.edu",
    "Advisor Email: drbob@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:49Z (GMT). No. of bitstreams: 1 etd.pdf: 3099046 bytes, checksum: f092f29f0992fd922a8eb97b1300d613 (MD5)   Previous issue date: 2009-04-24"
  ],
  "handle": "27630",
  "identifier_other": "etd-05102009-235018",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05102009-235018/",
  "identifier_uri": "http://hdl.handle.net/10919/27630",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Localized surface Plasmon resonance",
    "DNA melting",
    "Ionic self-assembled multilayer films",
    "cancer detection",
    "Nanoscale biomaterials",
    "Surface-enhanced Raman spectroscopy"
  ],
  "title": "Properties of Nanoscale Biomaterials for Cancer Detection and Other Applications",
  "type": "Dissertation"
}