{
  "contributor_author": "Hoover, Katherine N",
  "contributor_committeechair": "Stern, Marc J.",
  "contributor_committeemember": [
    "Mortimer, Michael J.",
    "Hull, Robert Bruce IV",
    "Dudley, Larkin S."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:11:49Z",
  "date_adate": "2012-05-17",
  "date_available": "2014-03-14T20:11:49Z",
  "date_issued": "2012-05-01",
  "date_rdate": "2012-05-17",
  "date_sdate": "2012-05-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examines how the U.S. Forest Service implements and uses public involvement during the agencyâ  s planning processes as mandated by the National Environmental Policy Act. Focused from the perspective of the agency personnel leading the process, this study is informed by both quantitative and qualitative analyses. Chapters two and three report the results of a web-based survey completed by 489 Forest Service employees. Chapter two shows that these employees most commonly view public involvement as a means for obtaining substantive information that could be used to improve the management decision. Chapter two also reveals that agency personnel who view public involvement as only a procedural requirement tend to achieve less positive process outcomes, but those who explicitly create opportunities for interactive dialogue with the public tend to achieve more positive outcomes, including more positive perceptions of the public involvement process and agency-public relationships. Chapter three shows that agency employees commonly believe more public influence should and does happen during the earlier stages of the planning process, but that agency employees also desire more public influence throughout the process. Chapter four uses qualitative interviews with 16 of the survey respondents to build upon the insights from chapter three. By exploring what may be constraining public influence from occurring at the desired levels, chapter four describes how agency personnel can impact how much public influence happens. The final chapter highlights the importance of looking beyond the specific public involvement technique employed during the process to the nature of the agency-public interactions. Agency personnel who are willing to engage in extra effort to translate public values into substantive management concerns generally achieve more desirable forms of public influence. They also help satisfy the publicâ  s desires to communicate their visions for the management of the National Forests. Key barriers include heavy workloads, negative views of the public, and over-reliance on minimum procedural requirements. Conversely, strong normative beliefs about the positive role of the public in agency planning, leadership commitment, and a recognition of the discretion afforded planning personnel can lead to higher levels of desired public influence.",
  "description_provenance": [
    "Author Email: knhoover@vt.edu",
    "Advisor Email: mortimer@vt.edu",
    "Advisor Email: hullrb@vt.edu",
    "Advisor Email: mjstern@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:49Z (GMT). No. of bitstreams: 1 Hoover_K_D_2012.pdf: 1280485 bytes, checksum: bed473a7d9f219bfbf0020d14a97438a (MD5)   Previous issue date: 2012-05-01"
  ],
  "handle": "27634",
  "identifier_other": "etd-05102012-103508",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05102012-103508/",
  "identifier_uri": "http://hdl.handle.net/10919/27634",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hoover_K_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "natural resources planning",
    "environmental planning",
    "public involvement",
    "natural resources policy",
    "federal public lands",
    "National Environmental Policy Act"
  ],
  "title": "Public Involvement in the U.S. Forest Service",
  "type": "Dissertation"
}