{
  "contributor_author": "Cyterski, Trina Doran",
  "contributor_committeechair": "Gustafson, Sigrid B.",
  "contributor_committeemember": [
    "Franchina, Joseph J.",
    "Harrison, David W.",
    "Axsom, Daniel K.",
    "Friedman, Bruce H."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:50Z",
  "date_adate": "1999-05-27",
  "date_available": "2014-03-14T20:11:50Z",
  "date_issued": "1999-04-07",
  "date_rdate": "2012-11-20",
  "date_sdate": "1999-05-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to answer questions about affect intensity and self-perceived arousal differences in aberrant self-promoters (ASPs) and in individuals high and low in affect intensity (AI). Participants in the study completed a task asking them to respond as quickly and accurately as possible to letter strings presented for 200ms on a computer screen. They completed the task once with letter strings that formed words with an emotional valance and a second time with neutral-valence words. After each task, participants made self-reports of Energy and Tense dimensions of arousal as measured by the Activation-Deactivation Adjective Checklist. As first formulated, the study examined 4 groups of n = 30 (ASPs, non-ASP controls, high-AIs, and low-AIs). Results showed that, as hypothesized, ASPs scored significantly lower than high-AIs on the Affect Intensity Measure (AIM). Other hypotheses were not supported by analyses of the original four groups. However, because about 1/3 of the ASPs exhibited high AIM scores, ASPs were divided into primary and secondary types: (a) those who scored low and (b) those who scored high on the AIM. Subsequent post hoc analyses, based on the hypotheses that had not been supported initially, were conducted on five groups of n = 7. The study found that low-AI ASPs reported significantly lower arousability levels than high-AIs. Results also showed that controls, high-AIs, and low-AIs all reacted significantly more slowly to emotional words than to neutral words. Low-AI ASPs failed to demonstrate this response-time slowing, indicating that, like psychopaths, ASPs may process positive, negative, and neutral stimuli similarly. Additional results indicated that low-AI ASPs decreased both energetic and tension arousal levels after the emotional word task, compared to the neutral word task, whereas high-AIs reported corresponding increases in these types of arousal. These findings support Larsen and Diener's (1987) theory regarding arousal differences in high- and low-AIs. Implications of these findings are discussed in terms of a weak Behavioral Inhibition System (Gray, 1987).",
  "description_provenance": [
    "Author Email: tdoran@vt.edu",
    "Advisor Email: jjfranch@vt.edu",
    "Advisor Email: dwh@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Advisor Email: sgustafson@air-dc.org",
    "Advisor Email: bhfriedman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:50Z (GMT). No. of bitstreams: 1 ASP1.PDF: 226797 bytes, checksum: e8a51b5df625baad4afe4ea5b946fe06 (MD5)   Previous issue date: 1999-04-07"
  ],
  "handle": "27638",
  "identifier_other": "etd-051099-123041",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-051099-123041/",
  "identifier_uri": "http://hdl.handle.net/10919/27638",
  "publisher": "Virginia Tech",
  "relation_haspart": "ASP1.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "psychopathy",
    "affect intensity",
    "arousal",
    "emotion",
    "aberrant self-promotion"
  ],
  "title": "Affect Intensity and Perceptions of Arousal in a Subclinical Level of Psychopathy Termed Aberrant Self-Promotion",
  "type": "Dissertation"
}