{
  "contributor_author": "Carter, Ayesha DonNell",
  "contributor_committeechair": "Sible, Jill C.",
  "contributor_committeemember": [
    "Huckle, William R.",
    "Rutherford, Charles L.",
    "Tyson, John J.",
    "Elgert, Klaus D."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:11:51Z",
  "date_adate": "2005-05-26",
  "date_available": "2014-03-14T20:11:51Z",
  "date_issued": "2005-04-28",
  "date_rdate": "2008-05-26",
  "date_sdate": "2005-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Early Xenopus laevis embryonic cell cycles exemplify rapid, non-pathological cell cycles without checkpoint pathways to arrest cell cycles in response to DNA assaults.  There is no transcription or apoptosis during these cell cycles, and they continue unperturbed until the 12th cell cycle, marking a period called the midblastula transition (MBT).  At the MBT, the embryo undergoes a period of developmental remodeling: gap phases are acquired, zygotic transcription is initiated, and the maternal mRNAs are degraded.  After the MBT, checkpoint pathways can be activated in response to unreplicated DNA, and apoptosis initiates when continued embryonic survival is compromised.  These studies examine how cell cycle regulation and apoptotic regulation are related.  Specifically, the role of two cell cycle components, Chk1 and cyclin A1/Cdk2, during apoptosis was studied during early development of Xenopus embryos. Chk1 is a serine/threonine kinase that inhibits the activity of cyclin-dependent kinases (Cdks) in response to unreplicated DNA.  In the pre-MBT embryo, Chk1 is present, but inactive.  Injection of mRNA encoding dominant-negative Chk1 (DN-Chk1) into single-celled embryos results in the initiation of apoptosis after the MBT.  The loss of Chk1 function also results in the initiation of additional rapid rounds of DNA replication after the MBT.  These results suggest that Chk1 has a required function for the embryo after the MBT, possibly through the regulation of a cyclin/Cdk complex responsible for the apoptotic checkpoint. Cyclin A1 is a maternally provided mRNA that is degraded at the MBT.  Prior to the MBT, cyclin A1 complexes exclusively with Cdc2 to regulate mitosis.  When embryos are treated with ionizing radiation (IR), cyclin A1 activity and protein level persist after the MBT, and cyclin A1 complexes with Cdk2.  When treated with aphidicolin, cyclin A1-associated activity and protein level persists.  Injection of cyclin A1/Cdk2 into single-cell embryos results in apoptosis after the MBT; however, inhibition of cyclin A1 expression does not abrogate apoptosis.  Therefore, cyclin A1/Cdk2 activity is sufficient, but not required, for the initiation of apoptosis in the early Xenopus embryo.  These studies show that Chk1 and cyclin A1/Cdk2 have roles in regulating apoptosis in the post-MBT embryo.",
  "description_provenance": [
    "Author Email: aycarter@gmail.com",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: rutherfo@vt.edu",
    "Advisor Email: tyson@vt.edu",
    "Advisor Email: siblej@vt.edu",
    "Advisor Email: kdelgert@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:51Z (GMT). No. of bitstreams: 1 FinalFRED.pdf: 6382807 bytes, checksum: b439fa82726cedecbd1a745566a2df43 (MD5)   Previous issue date: 2005-04-28"
  ],
  "handle": "27644",
  "identifier_other": "etd-05112005-112547",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112005-112547/",
  "identifier_uri": "http://hdl.handle.net/10919/27644",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalFRED.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "apoptosis",
    "cyclin/Cdks",
    "Chk1",
    "MBT",
    "Xenopus laevis"
  ],
  "title": "Loss of Chk1 Function and Exogenous Expression of Cyclin A1/Cdk2 Results in Apoptosis after the MBT in Early Xenopus laevis Embryos",
  "type": "Dissertation"
}