{
  "contributor_author": "Calata, Jesus Noel",
  "contributor_committeechair": "Lu, Guo-Quan",
  "contributor_committeemember": [
    "Kampe, Stephen L.",
    "Aning, Alexander O.",
    "Meehan, Kathleen",
    "Suchicital, Carlos T. A."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:11:51Z",
  "date_adate": "2005-05-24",
  "date_available": "2014-03-14T20:11:51Z",
  "date_issued": "2005-05-04",
  "date_rdate": "2005-05-24",
  "date_sdate": "2005-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Constrained sintering is an important process for many applications.  The sintering process almost always involves some form of constraint, both internal and external, such as rigid particles, reinforcing fibers and substrates to which the porous body adheres.  The densification behavior of zinc oxide and cordierite-base crystallizable glass constrained on a rigid substrate was studied to add to the understanding of the behavior of various materials undergoing sintering when subjected to external substrate constraint. Porous ZnO films were isothermally sintered at temperatures between 900°C and 1050°C.  The results showed that the densification of films constrained on substrates is severely reduced.  This was evident in the sintered microstructures where the particles are joined together by narrower necks forming a more open structure, instead of the equiaxed grains with wide grain boundaries observed in the freestanding films.  The calculated activation energies of densification were also different.  For the density range of 60 to 64%, the constrained film had an activation energy of 391 ± 34 kJ/mole compared to 242 ± 21 kJ/mole for the freestanding film, indicating a change in the densification mechanism.  In-plane stresses were observed during the sintering of the constrained films.  Yielding of the films, in which the stresses dropped slight or remained unchanged, occurred at relative densities below 60% before the stresses climbed linearly with increasing density followed by a gradual relaxation.  A substantial amount of the stresses remained after cooling. Free and constrained films of the cordierite-base crystallizable glass (glass-ceramic) were sintered between 900°C and 1000°C.  The substrate constraint did not have a significant effect on the densification rate but the constrained films eventually underwent expansion.  Calculations of the densification activation energy showed that, on average, it was close to 1077 kJ/mole, the activation energy of the glass, indicating that the prevailing mechanism was still viscous flow.  The films expanded earlier and faster with increasing sintering temperature.  The expansion was traced to the formation of pores at the interface with the silicon substrate and to a lesser extent on aluminum nitride.  It was significantly reduced when the silicon substrate was pre-oxidized at 900°C, leading to the conclusion that the pore formation at the interface was due to poor wetting, which in turn was caused by the loss of the thin oxide layer through a reaction with the glass.",
  "description_provenance": [
    "Author Email: jcalata@vt.edu",
    "Advisor Email: kampe@vt.edu",
    "Advisor Email: aaning@vt.edu",
    "Advisor Email: gqlu@vt.edu",
    "Advisor Email: kameehan@vt.edu",
    "Advisor Email: ctas@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:51Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 3163990 bytes, checksum: f155427c4b2aa6890208eb80d6fdcb17 (MD5)   Previous issue date: 2005-05-04"
  ],
  "handle": "27645",
  "identifier_other": "etd-05112005-132525",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112005-132525/",
  "identifier_uri": "http://hdl.handle.net/10919/27645",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "zinc oxide",
    "in-plane stress",
    "ceramic",
    "constrained sintering",
    "rigid substrate",
    "crystallizable glass"
  ],
  "title": "Densification Behavior of Ceramic and Crystallizable Glass Materials Constrained on a Rigid Substrate",
  "type": "Dissertation"
}