{
  "contributor_author": "Joyce, Bradley Ryan",
  "contributor_committeechair": "Rutherford, Charles L.",
  "contributor_committeemember": [
    "Stevens, Ann M.",
    "Melville, Stephen B.",
    "Gregory, Eugene M.",
    "Sible, Jill C."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:11:51Z",
  "date_adate": "2006-06-12",
  "date_available": "2014-03-14T20:11:51Z",
  "date_issued": "2006-05-05",
  "date_rdate": "2007-06-12",
  "date_sdate": "2006-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Regulation of gene expression is known to be a critical factor involved in proper development, responses to environmental cues, metabolism, energy conservation, and disease. Gene expression is regulated at several levels including transcription, mRNA splicing, post translational modification, and the rate of protein degradation. The developmental control of alkaline phosphatase (alp) in Dicytostelium has provided a focal point for the study of gene regulation at the level of de novo synthesis. </p><p>The localization of alkaline phosphatase (alp) expression during development was characterized by fusing the 5' flanking sequence to the lacZ reporter and using an in situ  Î -galactosidase staining method.  The localization of lacZ expression corresponds with that of the endogenous ALP enzyme suggesting that alp is regulated at the level of transcription. In order to identify temporal regulatory elements within the alp promoter a series of 5' and internal promoter deletions were generated and fused to the lacZ reporter.  The data from these promoter deletion constructs indicated a regulatory element within the -683 to -468 bp sequence that is required for normal expression of alp during development.  A series of small internal and 5' promoter deletions were designed within the -683 to -468 bp regulatory sequence. The results from these promoter deletion-reporter gene fusions suggested a DNA regulatory element is located within a 26-bp sequence beginning at the -620 bp site.  </p><p> \tThe function of cis-acting regulatory elements were evaluated using the electromobility shift assay (EMSA) to identify sequence specific DNA-protein interactions on the alp promoter.  We report the characterization of three DNA-binding activities with the 20% ammonium sulfate (AS) slug nuclear fraction.  These DNA-binding activities appear to be related as they all require magnesium or calcium for effective binding to the alp promoter.  Interestingly, the DNA-binding proteins appeared to interact with a GT-rich sequence that contained a G-box binding factor (GBF) consensus element.  </p><p> \tAdditionally, a DNA-binding activity observed in the 80% AS slug nuclear extract was characterized and sequentially purified using conventional and affinity chromatography techniques.  The DNA-binding protein was identified as TFII, a protein that was previously identified during the investigation of glycogen phosphorylase-2 (gp2) regulation.  A comparison of the alp and gp2 probes used to identify TFII suggests a DNA-binding site, ACAATGN8-12CACTA.  The ability of TFII to bind specifically with the promoter of two functionally different genes suggests that it may regulate the temporal and/or spatial expression of several Dictyostelium genes.  </p>",
  "description_provenance": [
    "Advisor Email: ams@vt.edu",
    "Advisor Email: melville@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Advisor Email: siblej@vt.edu",
    "Advisor Email: rutherfo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:51Z (GMT). No. of bitstreams: 1 Joyce-Dissertation.pdf: 1859041 bytes, checksum: b0cabf4fb7c719a9110206514f65080f (MD5)   Previous issue date: 2006-05-05"
  ],
  "handle": "27646",
  "identifier_other": "etd-05112006-111312",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112006-111312/",
  "identifier_uri": "http://hdl.handle.net/10919/27646",
  "publisher": "Virginia Tech",
  "relation_haspart": "Joyce-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "promoter analysis",
    "alkaline phosphatase",
    "protein purification",
    "Dictyostelium"
  ],
  "title": "The Regulation of Alkaline Phosphatase during the Development of Dictyostelium",
  "type": "Dissertation"
}