{
  "contributor_author": "Dawson, Donna Kay",
  "contributor_committeechair": "Roberto, Karen A.",
  "contributor_committeemember": [
    "Schlenker, Eleanor D.",
    "Blieszner, Rosemary",
    "Hutchinson, Susan R.",
    "Teaster, Pamela B."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:50Z",
  "date_adate": "2000-05-16",
  "date_available": "2014-03-14T20:11:50Z",
  "date_issued": "2000-05-05",
  "date_rdate": "2001-05-16",
  "date_sdate": "2000-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Hip fracture in older adults may be the sentinel event leading to functional decline, long-term disability, and death. For the substantial number of older persons who fracture a hip each year, the chances of full functional recovery remains relatively low. The purpose of this study was to examine the differences between older persons with hip fracture who recover fully and those individuals who do not fully recover.  A chronic disease trajectory framework guided the theoretical design of the research.  Data were collected from the medical records of 102 persons aged 60 years and older who sustained a proximal hip fracture from 1993 to 1998 at a medical center in North Carolina.  Data included personal characteristics, prefracture health status, hospital factors, rehabilitation features, and functional outcomes. The analysis consisted of a two-step hierarchical logistic regression model with the control variables of age, prefracture ambulation status, and prefracture cognitive status entered first and the variables of type of therapy program, frequency of therapy, number of therapy provider organizations, and location of therapy at 4 weeks entered second. Significance of the final model was observed, Chi-Square(7, n = 99)= 43.55, p < .05. Significant individual predictors (p < .05) in the model were prefracture ambulation status (43.56 odds ratio) and cognitive status (6.44 odds ratio). Post-hoc  analysis of the cases revealed a substantial lack of stability in ambulation status from three months post-fracture to the six-month and one-year follow-up. Findings support other research studies that indicate prefracture personal characteristics of older persons  who fracture a hip are the most influential factors in predicting successful recovery. Linkage of the findings to the chronic disease trajectory model suggests that intervention efforts should focus on prevention, health promotion, and policies that extend the ability of health care providers to assist older persons with hip fracture in managing their conditions.",
  "description_provenance": [
    "Author Email: dodawson@vt.edu",
    "Advisor Email: kroberto@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Advisor Email: hutchins@vt.edu",
    "Advisor Email: teaster@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:50Z (GMT). No. of bitstreams: 2 edtversiondissertation.PDF: 199695 bytes, checksum: c61de00d506e9de204d771ab1fc573ea (MD5) titletoc.PDF: 11542 bytes, checksum: e829550a1232af08a3ef3ac77ddeb7c9 (MD5)   Previous issue date: 2000-05-05"
  ],
  "handle": "27641",
  "identifier_other": "etd-05112000-15470008",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112000-15470008/",
  "identifier_uri": "http://hdl.handle.net/10919/27641",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "edtversiondissertation.PDF",
    "titletoc.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "mobility",
    "older adult",
    "functional recovery",
    "chronic disease",
    "hip fracture"
  ],
  "title": "Determinants of Nonrecovery Following Hip Fracture in Older Adults: a Chronic Disease Trajectory Analysis",
  "type": "Dissertation"
}