{
  "contributor_author": "Ostroff, Wendy Louise",
  "contributor_committeechair": "Cooper, Robin K. Panneton",
  "contributor_committeemember": [
    "Franchina, Joseph J.",
    "Lickliter, Robert E.",
    "Finney, Jack W.",
    "Bell, Martha Ann"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:50Z",
  "date_adate": "2000-05-11",
  "date_available": "2014-03-14T20:11:50Z",
  "date_issued": "2000-05-09",
  "date_rdate": "2004-04-19",
  "date_sdate": "2000-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Research indicates that infants lose the capacity to perceive distinctions in nonnative sounds as they become sensitive to the speech sounds of their native language (i.e., by 10- to 12-months of age).  However, investigations into the decline in nonnative phonetic perception have neglected to examine the role of non-linguistic information.  Exaggerated prosodic intonation and facial input are prominent in the infantsâ   language-learning environment, and both have been shown to ease the task of speech perception.  The current investigation was designed to examine the impact of infant-directed (ID) speech and facial input on infantsâ   ability to discriminate phonemes that do not contrast in their native language.  Specifically, 11-month-old infants were tested for discrimination of both a native phoneme contrast and a nonnative phoneme contrast across four conditions, including an auditory manipulation (ID speech vs. AD speech) and a visual manipulation (Face vs. Geometric Form).  The results indicated that infants could discriminate the native phonemes across any of the four conditions.  Furthermore, the infants could discriminate the nonnative phonemes if they had enhanced auditory and visual information available to them (i.e., if they were presented in ID speech with a synchronous facial display), and if the nonnative discrimination task was the infantsâ   first test session.  These results suggest that infants do not lose the capacity to discriminate nonnative phonemes by the end of the first postnatal year, but that they rely on certain language-relevant and non-linguistic sources of information to discriminate nonnative sounds.",
  "description_provenance": [
    "Author Email: wendy.ostroff@sonoma.edu",
    "Advisor Email: jjfranch@vt.edu",
    "Advisor Email: duckling@vt.edu",
    "Advisor Email: rpcooper@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:50Z (GMT). No. of bitstreams: 1 WendysETD.pdf: 192377 bytes, checksum: cfc922e8eecfd91df929d9f272941ca0 (MD5)   Previous issue date: 2000-05-09"
  ],
  "handle": "27640",
  "identifier_other": "etd-05112000-14500056",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112000-14500056/",
  "identifier_uri": "http://hdl.handle.net/10919/27640",
  "publisher": "Virginia Tech",
  "relation_haspart": "WendysETD.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Speech Perception",
    "Infant Language Learning",
    "Phoneme Perception"
  ],
  "title": "Non-linguistic Influences on Infants' Nonnative Phoneme Perception: Exaggerated prosody and Visual Speech Information Aid Discrimination",
  "type": "Dissertation"
}