{
  "contributor_author": "Spencer, C. Thomas",
  "contributor_committeechair": "Potts, Malcolm",
  "contributor_committeemember": [
    "Claus, G. W.",
    "Larson, T. J.",
    "Gregory, E. M.",
    "Rivard, Christopher J."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:11:51Z",
  "date_adate": "2006-05-11",
  "date_available": "2014-03-14T20:11:51Z",
  "date_issued": "1996-08-01",
  "date_rdate": "2011-12-02",
  "date_sdate": "2006-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Aspects of recombinant enzyme production were characterized in genetically engineered Escherichia coli.   Five strains transformed with the xylose isomerase overproduction system (pRK248/pTXI-1) were compared, based on parameters of cell metabolism and inducible enzyme activity in shake flask cultures. E. coli strain LE392 (pRK248/pTXI-l) performed the best with respect to nearly all of the parameters tested.   The stability of the overproducing  plasmids  was  tested  in  prolonged  serial   shake  flask  cultures. Segregational instability occurred in cultures lacking antibiotic selective pressure.   The onset of this instability was influenced by host strain, plasmid construct and cultivation media.  Despite its occurrence, the degree of plasmid instability, even in the worst case, would not be detrimental in the proposed application of this overproduction system.  The cell mass and enzyme production of strain LE392 (pRK248/pTXI-1) was characterized in  four batch cultures.   It was determined that both carbon source starvation and the accumulation of acetate as a byproduct of glucose metabolism diminished the E. coli's ability to produce xylose isomerase. The peak enzyme production was determined to be 1320 International Units (IU) of xylose isomerase activity per liter of culture. The cell mass and enzyme production of strain LE392 (pRK248/pTXI-l) was studied in fed-batch cultures. The amount of xylose isomerase the cells produced was dependent on the degree of glucose limitation they experienced during cultivation. The peak enzyme production was 3250 IU/L. The results of these experiments were interpreted in the context of this overproduction system and its proposed application for the production of ethanol from plant biomass.",
  "description_provenance": [
    "Author Email: Thomas.Spencer@tengion.com",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Made available in DSpace on 2014-03-14T20:11:51Z (GMT). No. of bitstreams: 1 LD5655.V856_1996.S734.pdf: 4209513 bytes, checksum: 48411b23f351414838dc7f8df970f19c (MD5)   Previous issue date: 1996-08-01"
  ],
  "format_medium": "BTD",
  "handle": "27651",
  "identifier_other": "etd-05112006-154826",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112006-154826/",
  "identifier_uri": "http://hdl.handle.net/10919/27651",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1996.S734.pdf",
  "subject": [
    "intramolecular oxidoreductases",
    "recombinant enzyme",
    "﻿Escherichia coli"
  ],
  "subject_lcc": "LD5655.V856 1996.S734",
  "title": "Overproduction of xylose isomerase in recombinant Escherichia coli,",
  "type": "Dissertation"
}