{
  "contributor_author": "Grady, Julie R.",
  "contributor_committeechair": "Glasson, George E.",
  "contributor_committeemember": [
    "Dolan, Erin L.",
    "Nespor, Jan K.",
    "Abraham, Jane L.",
    "Brand, Brenda R."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:11:52Z",
  "date_adate": "2007-05-16",
  "date_available": "2014-03-14T20:11:52Z",
  "date_issued": "2007-04-30",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Untitled Document</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>The purpose of this exploratory qualitative study was to investigate the practice of scientific inquiry in two secondary biology classes and one agriculture class from different schools in different communities. The focus was on teachers' interests and intentions for the students' participation in inquiry, the voices contributing to the inquiry, and students' opportunities to confront their conceptions of the nature of science (NOS). The Partnership for Research and Education in Plants (PREP) served as the context by providing students with opportunities to design and conduct original experiments to help elucidate the function(s) of a disabled gene in <em>Arabidopsis thaliana </em>. </p> <p>Transcripts of teacher and student semi-structured interviews, field notes of classroom observations and classroom conversations, and documents (e.g., student work, teacher handouts, school websites, PREP materials) were analyzed for evidence of the practice of scientific inquiry. </p> <p>Teachers were interested in implementing inquiry because of potential student learning about scientific research and because PREP supports course content and is connected to a larger scientific project outside of the school. Teachers' intentions regarding the implementation of inquiry reflected the complexity of their courses and the students' previous experiences. All inquiries were student-directed. The biology students' participation more closely mirrored the practice of scientists, while the agriculture students were more involved with the procedural display of scientific inquiry. All experiences could have been enhanced from additional knowledge-centered activities regarding scientific reasoning. </p> <p>No activities brought explicit attention to NOS. Biology activities tended to implicitly support NOS while the agriculture class activities tended to implicitly contradict NOS. Scientists' interactions contributed to implied support of the NOS. There were missed opportunities for explicit attention to NOS in all classes. </p> <p>The major voices contributing to the inquiry in all classrooms included those of teachers, students, technology, scientists, textbooks, and mandated standards; however, they were more prevalent in the biology classrooms than the agriculture classroom. The powers influencing the voice frequency may be related to the teachers' own teaching and research experiences, as well as the alignment of the expectations and values of students' participation in scientific inquiry and those associated with the school-classroom communities and the students' identities. </p> </body> </html>",
  "description_provenance": [
    "Author Email: jgrady@vt.edu",
    "Advisor Email: edolan@vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: glassong@vt.edu",
    "Advisor Email: janea@vt.edu",
    "Advisor Email: bbrand@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:52Z (GMT). No. of bitstreams: 1 JGradyETD5-10-07rev.pdf: 1106504 bytes, checksum: 3daaea129b2c3bc2a95192b511f1b469 (MD5)   Previous issue date: 2007-04-30"
  ],
  "handle": "27652",
  "identifier_other": "etd-05112007-091413",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112007-091413/",
  "identifier_uri": "http://hdl.handle.net/10919/27652",
  "publisher": "Virginia Tech",
  "relation_haspart": "JGradyETD5-10-07rev.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Agriculture Education",
    "Science Education",
    "Voices",
    "Nature of Science",
    "Scientific Inquiry"
  ],
  "title": "An Investigation of the Practice of Scientific Inquiry in Secondary Science and Agriculture Courses",
  "type": "Dissertation"
}