{
  "contributor_author": "Willis-Walton, Susan M.",
  "contributor_committeechair": "Gary L. Wamsley",
  "contributor_committeemember": [
    "John A. Rohr",
    "Joseph V. Rees",
    "John W. Dickey"
  ],
  "contributor_department": "Public Administration/Public Affairs",
  "date_accessioned": "2014-03-14T20:11:53Z",
  "date_adate": "2009-05-27",
  "date_available": "2014-03-14T20:11:53Z",
  "date_issued": "2009-04-28",
  "date_rdate": "2013-05-21",
  "date_sdate": "2009-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A comprehensive survey of more than 1,500 former participants in the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC) along with more than 300 semi-structured interviews with former WIC participants were designed and conducted in order to identify the barriers influencing eligible program participants to leave the program prematurely.  Results from the two phases of data collection were used to determine why eligible families are leaving the WIC program, to better understand the program participation barriers cited by former program participants in order to facilitate the development of a typology of program â  leavers,â   and to identify the policy and organizational components that provide context for premature WIC program departure by participants.  A narrative approach to organizational understanding and Symbolic Interactionism are utilized to provide a theoretical framework for highlighting program areas which may contribute to the participation barriers discovered in this research.  Implications for public administration and policy evaluation are provided.",
  "description_provenance": [
    "Author Email: suwillis@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: jrohr@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: jdickey@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:53Z (GMT). No. of bitstreams: 1 swilliswaltonfinalETD.pdf: 824232 bytes, checksum: ead9b4dc5d8cda4636573d9056c0419a (MD5)   Previous issue date: 2009-04-28"
  ],
  "handle": "27659",
  "identifier_other": "etd-05112009-154340",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112009-154340/",
  "identifier_uri": "http://hdl.handle.net/10919/27659",
  "publisher": "Virginia Tech",
  "relation_haspart": "swilliswaltonfinalETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Organization Theory",
    "Research Methodologies for Policy Evaluation",
    "WIC",
    "Program Evaluation"
  ],
  "title": "Nutrition for Some:  A Comprehensive Study of Why Eligible Families Leave the WIC Program",
  "type": "Dissertation"
}