{
  "contributor_author": "Robson, Victoria Elizabeth",
  "contributor_committeechair": "Foti, Roseanne J.",
  "contributor_committeemember": [
    "Stephens, Robert S.",
    "Hauenstein, Neil M. A.",
    "Wildman, Terry M."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:52Z",
  "date_adate": "2007-08-22",
  "date_available": "2014-03-14T20:11:52Z",
  "date_issued": "2007-05-08",
  "date_rdate": "2007-08-22",
  "date_sdate": "2007-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The present study examined the role of oneâ  s own self-perceptions of leadership in predicting both leadership prototypes and leadership perceptions of others. Additionally, this study explored gender differences in leadership prototypes and perceptions of leadership. Participants completed a measure of their own self-perceptions of their leadership traits (i.e., sensitivity, intelligence, dedication, and dynamism) and an instrument that assessed their leadership prototypes (i.e., sensitivity, intelligence, dedication, and dynamism). Next, participants were presented with a 22 minute tape of four actors (2 male, 2 female) portraying mutual fund mangers in a simulated work setting. Participants then rated one male (Bob) and one female (Sue) actor on the specific leadership characteristics (i.e., sensitivity, intelligence, dedication, and dynamism) they exhibited on the tape as well as an overall assessment of leadership emergence and effectiveness. The results demonstrated that leadership prototypes mediated the relationship between self-perceptions of leadership abilities and ratings of leadership characteristics for Bob and Sue. It was also found that the match between perceptions of Bob and Sue and an individualâ  s leadership prototype predicted overall ratings of leadership emergence and leadership effectiveness. Finally, the results from the present study suggested that men and women perceive leadership similarly.",
  "description_provenance": [
    "Author Email: vrobson@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:52Z (GMT). No. of bitstreams: 2 s07-175.pdf: 150670 bytes, checksum: f8db32613f7b5bb9a0be489ef71b9692 (MD5) dissertation_vr_etd.pdf.pdf: 889583 bytes, checksum: 7a2e718971bfdf5ceb42c537bd798d29 (MD5)   Previous issue date: 2007-05-08"
  ],
  "handle": "27654",
  "identifier_other": "etd-05112007-105215",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112007-105215/",
  "identifier_uri": "http://hdl.handle.net/10919/27654",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "s07-175.pdf",
    "dissertation_vr_etd.pdf.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "leadership prototype",
    "leadership effectiveness",
    "leadership emergence",
    "self-perceptions"
  ],
  "title": "It's All About Me: The Role of the Self in Predicting Leadership Perceptions",
  "type": "Dissertation"
}