{
  "contributor_author": "Lee, Dongryul",
  "contributor_committeechair": "Haller, Hans H.",
  "contributor_committeemember": [
    "Giles, Robert H. Jr.",
    "Tideman, Thorwald Nicolaus",
    "Kats, Amoz"
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:11:52Z",
  "date_adate": "2009-06-04",
  "date_available": "2014-03-14T20:11:52Z",
  "date_issued": "2009-04-29",
  "date_rdate": "2009-06-04",
  "date_sdate": "2009-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation consists of three essays on theoretical analysis of economic agents' decision making and incentives.  Chapter 1 gives an outline of the subjects to be examined in the subsequent chapters and shows their conclusions in brief.  Chapter 2 explores the decision problem of a superordinate (a principal) regarding whether to delegate its authority or right to make a decision to a subordinate (an agent) in an organization.  We first study the optimal contracting problem of the superordinate that specifies the allocation of the authority and wage in a principal-agent setting with asymmetric information, focusing on two motives for delegation, \"informative\" and \"effort-incentive-giving\" delegation.  Further, we suggest delegating to multiple agents as a way of addressing the asymmetric information problem within an organization, focusing on another motive for delegation, \"strategic\" delegation.             Chapter 3 analyzes the behavior of players in a particular type of contest, called \"the weakest-link contest\".  Unlike a usual contest in which the winning probability of a group in a contest depends on the sum of the efforts of all the players in the group, the weakest-link contest follows a different rule: the winning probability of a group is determined by the lowest effort of the players in the group.  We first investigate the effort incentives of the players in the weakest-link contest, and then check whether the hungriest player in each group, who has the largest willingness to exert effort, has an incentive to incentivize the other players in his group in order to make them exert more effort.  Chapter 4 examines the decision making of software programmers in the software industry between an open source software project and a commercial software project.  Incorporating both intrinsic and extrinsic motivation on open source project participation into a stylized economic model based on utility theory, we study the decision problem of the programmers in the software industry and provide the rationale for open source project participation more clearly.  Specifically, we examine the question of how the programmers' intrinsic motivation, extrinsic motivation, and abilities affect their project choices between an open source project and a commercial project, and effort incentives.",
  "description_provenance": [
    "Author Email: lee78@vt.edu",
    "Advisor Email: rgilles@vt.edu",
    "Advisor Email: ntideman@vt.edu",
    "Advisor Email: amoz@vt.edu",
    "Advisor Email: haller@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:52Z (GMT). No. of bitstreams: 1 GAWM.pdf: 622446 bytes, checksum: def8cbe069a37b7f0953e7b1a3141daa (MD5)   Previous issue date: 2009-04-29"
  ],
  "handle": "27656",
  "identifier_other": "etd-05112009-111101",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112009-111101/",
  "identifier_uri": "http://hdl.handle.net/10919/27656",
  "publisher": "Virginia Tech",
  "relation_haspart": "GAWM.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Open-source Projects",
    "Intrinsic and Extrinsic Motivations",
    "Public Goods",
    "Delegation",
    "Weakest-link Contests",
    "Incentives",
    "Information"
  ],
  "title": "Three Essays on Economic Agents' Incentives and Decision Making",
  "type": "Dissertation"
}