{
  "contributor_author": "Jordal, Christian Edward",
  "contributor_committeechair": "Allen, Katherine R.",
  "contributor_committeemember": [
    "Few-Demo, April L.",
    "Kaestle, Christine E.",
    "Keeling, Margaret L."
  ],
  "contributor_department": "Marriage and Family Therapy",
  "date_accessioned": "2014-03-14T20:11:54Z",
  "date_adate": "2011-05-26",
  "date_available": "2014-03-14T20:11:54Z",
  "date_issued": "2011-04-27",
  "date_rdate": "2011-05-26",
  "date_sdate": "2011-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Married bisexuals who come out to their heterosexual partners do not invariably divorce. This qualitative study included 14 intact, mixed orientation married couples. The mean marriage duration was 14.5 years, and the mean time since the bisexual spouse had come out was 7.9 years. The research focused the negotiation processes around three constructs: (a) sexual identity; (b) gender identity; and (c) marital commitment. Dyadic interviews were used to generate a grounded theory of the identity and commitment negotiation processes occurring among intact mixed orientation married couples. The findings revealed two sexual identity trajectories: Bisexuals who identify before marriage and reemerge within marriage; or bisexuals who do not identity before marriage but who emerge from within marriage. Two gender identity processes were reported: gender non-conformity and deliberate gender conformity. Finally, two negotiation processes around marital commitment were found:  (a) closed marital commitment, and (b) open marital commitment. Closed marital commitment was defined as monogamous. Open marital commitment had four subtypes: (a) monogamous with the option to open; (b) open on one side (i.e., the bisexual spouse was or had the option to establish a tertiary relationship outside the marriage); (c) open on both sides or polyamorous; and (d) third-person inclusive (i.e.. couples had or were seeking a third person to bring into their marriage for both spouses). The implications for research and clinical practice were discussed.",
  "description_provenance": [
    "Author Email: cjordal@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: alfew@vt.edu",
    "Advisor Email: kaestle@vt.edu",
    "Advisor Email: mkeeling@mail.smu.edu",
    "Made available in DSpace on 2014-03-14T20:11:54Z (GMT). No. of bitstreams: 1  Jordal_CE_D_2011.pdf: 1179625 bytes, checksum: 110450c2c73af8d31409838f5cde0358 (MD5)    Previous issue date: 2011-04-27"
  ],
  "handle": "27664",
  "identifier_other": "etd-05112011-160023",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112011-160023/",
  "identifier_uri": "http://hdl.handle.net/10919/27664",
  "publisher": "Virginia Tech",
  "relation_haspart": "Jordal_CE_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Bisexuality",
    "gender",
    "marital commitment",
    "mixed orientation marriage"
  ],
  "title": "\"Making it Work\": A Grounded Theory of How Mixed Orientation Married Couples Commit, Sexually Identify, and Gender Themselves",
  "type": "Dissertation"
}