{
  "contributor_author": "Lee, Hanbae",
  "contributor_committeechair": "Escobar, Jeffery",
  "contributor_committeemember": [
    "Hanigan, Mark D.",
    "Harper, Allen F.",
    "Ponder, Monica A."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:11:54Z",
  "date_adate": "2012-05-31",
  "date_available": "2014-03-14T20:11:54Z",
  "date_issued": "2012-04-30",
  "date_rdate": "2012-05-31",
  "date_sdate": "2012-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The nutritional value of an amino acid (AA) is determined by its bioavailability, however concept of digestibility is mostly used in practical situations.  Four studies were conducted to test 2 exogenous factors that were hypothesized to affect the AA digestibility in non-ruminant animals.  In study 1, broiler chicks were randomly allotted to 4 dietary treatments of control and distillers dried grains with solubles (DDGS, 20%) diets supplemented or not with a novel mixture of carbohydrases.  Results indicated the ability of carbohydrase mixture to increase energy utilization of the DDGS diet, with significant improvements in AA digestibility, consequently improving growth performance of broilers. Study 2 examined effect of the carbohydrase mixture in pigs fed a high DDGS diet.  Ileal cannulated growing pigs (n = 8, 64.3 Â± 0.5 kg) were allotted to 4 dietary treatments in a replicated 4 Ã  4 Latin Square design.  Control and DDGS (40%) diets were supplemented or not with a mixture of carbohydrases.  Numeric increases for AA digestibility, along with a decreased tendency of urinary energy output suggested a possibility for improved nutrient utilization in pigs when carbohydrases were supplemented to 40% corn DDGS diet.  Collectively, carbohydrase seems less effective for swine applications due to greater water content and consequently a lower viscosity in pig digesta. Next, study 3 showed changes in AA digestibility and endogenous AA losses (EAAL) when pigs were challenged orally with Salmonella enterica serovar Typhimurium.  Nursery pigs (n = 48, 17.9 Â± 0.5 kg) were randomly assigned to a 2 Ã  2 factorial arrangement consisting of two diets (control or N-free) and inoculation (sterile broth or 9.8 Ã  10^9 CFU of Salmonella).  Measurements at 24 and 72 h post-inoculation indicated that AA digestibility of pigs is impaired through the initial phase of Salmonella infection and gradually restored, but not fully by 72 h. Finally, study 4 determined the dynamic fluctuations of EAAL and subsequent AA digestibility in response to Salmonella Typhimurium measured at multiple time points.  Ileal cannulated pigs (n = 8, 76.0 Â± 1.4 kg) were randomly assigned to either a control or a N-free diet and challenged orally with 1.3 Ã  10^10 CFU of Salmonella.  Inflammatory diarrhea was associated with reduced AA digestibility and increased EAAL showing respective peak values at 8-16 h post-inoculation.  Alterations in AA digestibility and EAAL were gradually recovered to near pre-inoculation values by 56-64 h post-inoculation, but showed impaired digestibility at 72-80 h post-inoculation.",
  "description_provenance": [
    "Author Email: hblee@vt.edu",
    "Advisor Email: Jeffery.Escobar@novusint.com",
    "Advisor Email: mhanigan@vt.edu",
    "Advisor Email: alharper@vt.edu",
    "Advisor Email: mponder@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:54Z (GMT). No. of bitstreams: 1 Lee_HB_D_2012.pdf: 2280008 bytes, checksum: 840155977f9438b35d218a27e86a5406 (MD5)   Previous issue date: 2012-04-30"
  ],
  "handle": "27667",
  "identifier_other": "etd-05112012-081827",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112012-081827/",
  "identifier_uri": "http://hdl.handle.net/10919/27667",
  "publisher": "Virginia Tech",
  "relation_haspart": "Lee_HB_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "amino acids",
    "pigs",
    "broilers",
    "DDGS",
    "carbohydrase",
    "Salmonella Typhimurium"
  ],
  "title": "Impact of exogenous factors on amino acid digestibility in non-ruminants",
  "type": "Dissertation"
}