{
  "contributor_author": "Sonaer, Gokhan",
  "contributor_committeechair": "Schneller, Meir I.",
  "contributor_committeemember": [
    "Singal, Vijay",
    "Ince, Ozgur S.",
    "Easterwood, John C.",
    "Cliff, Michael T."
  ],
  "contributor_department": "Finance, Insurance, and Business Law",
  "date_accessioned": "2014-03-14T20:11:53Z",
  "date_adate": "2011-05-31",
  "date_available": "2014-03-14T20:11:53Z",
  "date_issued": "2011-04-15",
  "date_rdate": "2011-05-31",
  "date_sdate": "2011-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation consists of two chapters. First chapter examines whether herding by actively managed equity funds affects their performance. For this purpose, first the effect of herding on stock returns is reexamined and evidence is found that, during the herding quarter, stocks bought intensely by herds outperform stocks sold intensely by herds. Controlling for subsequent quarter herding, this performance difference reverses, an indication that herding drives prices away from their fundamental values. It is also shown that herding funds benefit from this activity during the quarter in which they herd. The evidence is provided that herded stocks positively contribute to the herding fundsâ   trade portfolio returns in the following quarter, but no association is found between the extent to which funds herd and their holding-based and subsequent quarter net returns. Introducing the concept of leader and follower funds this study shows that the subsequent quarter performance of funds that lead the herd is superior to that of follower funds. However, because leader and follower funds do not strongly retain their status overtime, they exhibit similar long-run performances.   Second chapter examines whether mutual funds herd in industries and the extent to which such herding impacts industry valuations and fund performance. Using two herding measures proposed by Lakonishok, Shleifer, and Vishny (1992) and Sias (2004) it is documented that mutual funds herd in industries beyond what would be expected by chance. It is shown that industry herding is not driven by investor flows and that it is not a manifestation of individual stock herding. The evidence suggests that, during the herding quarter(s), industries that experience strong buy herding by mutual funds outperform industries that experience strong sell herding. Industries that are subjected to strong herding by mutual funds exhibit no return reversals indicating that this activity does not destabilize industry values. Using a modified Grinblatt, Titman and Wermersâ   (1995) fund herding measure that quantifies the degree to which a fund joins the herd during a given quarter, no compelling evidence is found that industry herding affects the subsequent performance of herding funds.",
  "description_provenance": [
    "Author Email: gsonaer@vt.edu",
    "Advisor Email: singal@vt.edu",
    "Advisor Email: oince@vt.edu",
    "Advisor Email: jceast@vt.edu",
    "Advisor Email: MCliff@analysisgroup.com",
    "Made available in DSpace on 2014-03-14T20:11:53Z (GMT). No. of bitstreams: 1 Sonaer_Gokhan_D_2011.pdf: 755238 bytes, checksum: 3b9ee2e240c12d59b839bf571961fdda (MD5)   Previous issue date: 2011-04-15"
  ],
  "handle": "27663",
  "identifier_other": "etd-05112011-141521",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112011-141521/",
  "identifier_uri": "http://hdl.handle.net/10919/27663",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sonaer_Gokhan_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Herding",
    "Mutual Funds"
  ],
  "title": "Two Essays on Mutual Fund Herding",
  "type": "Dissertation"
}