{
  "contributor_author": "Easley, Brian Gerard",
  "contributor_committeechair": "Klunk, Clare D.",
  "contributor_committeecochair": "Few-Demo, April L.",
  "contributor_committeemember": [
    "Renard, Paul D.",
    "Combs, Paul William"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:54Z",
  "date_adate": "2011-06-24",
  "date_available": "2014-03-14T20:11:54Z",
  "date_issued": "2011-04-29",
  "date_rdate": "2011-06-24",
  "date_sdate": "2011-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract Private and public sector organizations have become increasingly interested in promoting diversity.  Due to barriers attributed to race and gender, women and minorities often find it hard to break through the glass ceiling.  Mentoring is a tool to assist with breaking through the glass ceiling.  This interest has led to extensive growth in mentoring research and the design of a more expanded concept, developmental networks.  Little empirical research informs our understanding of Black women in developmental networks and their political identities within those networks.   This qualitative study, within the framework of grounded theory method and of case study research, examines two research questions: (1)\tWhat do Black women federal senior executives value within their developmental networks?  (2)\tHow do Black women federal senior executives construct political identity within their developmental networks? \t Applying the conceptual framework of Black feminist thought and developmental network support theories the study examined the developmental relationships of three Black women senior executives.  This research highlights the development of a group of high achievers and the contributions of their self-identified support systems.  Data analysis from unstructured person-to-person interviews, a questionnaire, and researcher theoretical memos identified the themes support network, self-definition and self-determination, and ecology of life.  The most visible codes were significant friendship, workplace behavior, social network composition, and Black woman.   In conclusion, the women valued relationships that produced psychosocial outcomes such as friendship, trust, honesty, direct feedback, and reciprocity.  They also valued relationships where they received workplace guidance and career exposure from mentor, friend, sponsor, and ally developers within or outside of the workplace.  The women developed networks that provided closeness and consisted of developers from different social arenas.  They defined their political identities, roles, coping strategies for life challenges and fostered relationships that recognized the importance of ethnic/racial respect, and understanding personal strength.  In addition, the women preferred informal developmental relationships with Black and male developers of different ages. Due to a small sample size, self-reported data and the application of grounded theory method, the findings of this study were interpreted with caution.  Provided were recommendations for future research and practice.",
  "description_provenance": [
    "Author Email: bigenyc@verizon.net",
    "Advisor Email: prenard@vt.edu",
    "Advisor Email: alfew@vt.edu",
    "Advisor Email: cdklunk@vt.edu",
    "Advisor Email: pwcombs@comcast.net",
    "Made available in DSpace on 2014-03-14T20:11:54Z (GMT). No. of bitstreams: 1 Easley_BG_D_2011.doc.pdf: 2843738 bytes, checksum: d8480dd864f5573ab68d7283fe8adeaa (MD5)   Previous issue date: 2011-04-29"
  ],
  "handle": "27666",
  "identifier_other": "etd-05112011-211149",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112011-211149/",
  "identifier_uri": "http://hdl.handle.net/10919/27666",
  "publisher": "Virginia Tech",
  "relation_haspart": "Easley_BG_D_2011.doc.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Black feminist thought",
    "leadership",
    "mentoring",
    "Black women",
    "career development",
    "political identity",
    "developmental network",
    "senior executive service"
  ],
  "title": "Developmental Networks, Black Feminist Thought, and Black Women Federal Senior Executives: A Case Study Approach",
  "type": "Dissertation"
}