{
  "contributor_author": "Mammei, Juliette Mae",
  "contributor_committeechair": "Pitt, Mark L.",
  "contributor_committeemember": [
    "Mizutani, Tetsuro",
    "Blecher, Marvin",
    "Vogelaar, Robert Bruce",
    "Schmittmann, Beate"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:11:53Z",
  "date_adate": "2010-06-04",
  "date_available": "2014-03-14T20:11:53Z",
  "date_issued": "2010-04-30",
  "date_rdate": "2010-06-04",
  "date_sdate": "2010-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The experiments discussed in this thesis exploit parity violation in elastic electron proton scattering in order to measure properties of the nucleon. Both experiments make use of the high quality, highly polarized electron beam available at Thomas Jefferson National Accelerator Facility. Qweak will measure the weak mixing angle, sin<sup>2</sup>&theta;<sub>W</sub>, via a measurement of the weak charge of the proton, at a four-momentum transfer, Q<sup>2</sup>~0.026 GeV<sup>2</sup>/c<sup>2</sup>. The precision of this measurement gives Qweak access to new physics at the scale of 2.3 TeV, making it a test of the standard model. The G0 experimental program provides the fully separated contributions of the strange quark to the charge and magnetization distributions of the nucleon at two different values of four-momentum transfer, Q<sup>2</sup> ~ 0.22 and 0.63 GeV<sup>2</sup>/c<sup>2</sup>.  The measurement of the strange quark content of the proton in the G0 experimental program and other parity-violating electron scattering experiments provides a measurement of the hadronic contribution to the asymmetry in Qweak.  In addition, G0 was able to measure the parity-conserving beam normal single spin asymmetries that provide a measurement of the imaginary part of two photon exchange. The measurement of this asymmetry is necessary to understand the systematic contribution to measurements of parity-violating asymmetries, but it is also an important physics result. Recent theoretical work has shown that higher order radiative effects, such as two photon exchange, may be able to explain discrepancies between experiments which measure the ratio of the electric and magnetic form factors of the proton. The measurement of the transverse or beam normal single spin asymmetries provides a benchmark for theories that estimate the size of radiative corrections that are important for precision electroweak scattering experiments such as those described in this thesis. The results of the measurement of the transverse asymmetries at backward angles in G0 are presented at the two values of Q<sup>2</sup> ~ 0.22 and 0.63 GeV<sup>2</sup>/c<sup>2</sup> for hydrogen. Results for deuterium, which can provide the first measurements of the beam normal single spin asymmetries on the neutron, are also presented.",
  "description_provenance": [
    "Author Email: crowder@jlab.org",
    "Advisor Email: mizutani@vt.edu",
    "Advisor Email: pitt@vt.edu",
    "Advisor Email: blecherm@alphamb.phys.vt.edu",
    "Advisor Email: vogelaar@vt.edu",
    "Advisor Email: physics.chair@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:53Z (GMT). No. of bitstreams: 2 Mammei_JM_D_2010.pdf: 16040211 bytes, checksum: 112350cb4e1aaeb5ad91daf92addcef7 (MD5) Mammei_JM_D_2010_Copyright.pdf: 299745 bytes, checksum: e6e51a41d09b0fc97f7f6660a0110e16 (MD5)   Previous issue date: 2010-04-30"
  ],
  "handle": "27661",
  "identifier_other": "etd-05112010-155435",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112010-155435/",
  "identifier_uri": "http://hdl.handle.net/10919/27661",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Mammei_JM_D_2010.pdf",
    "Mammei_JM_D_2010_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Strange quark",
    "transverse",
    "beam normal single spin asymmetry",
    "G0",
    "Qweak"
  ],
  "title": "Parity-Violating Elastic Electron Nucleon Scattering: Measurement of the Strange Quark Content of the Nucleon and Towards a Measurement of the Weak Charge of the Proton",
  "type": "Dissertation"
}