{
  "contributor_author": "Herbert, Andrew Scott",
  "contributor_committeechair": "Roberts, Paul Christopher",
  "contributor_committeemember": [
    "Myles, Kevin M.",
    "Witonsky, Sharon G.",
    "Meng, Xiang-Jin"
  ],
  "contributor_department": "Biomedical and Veterinary Sciences",
  "date_accessioned": "2014-03-14T20:11:53Z",
  "date_adate": "2009-06-01",
  "date_available": "2014-03-14T20:11:53Z",
  "date_issued": "2009-04-27",
  "date_rdate": "2009-06-01",
  "date_sdate": "2009-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Influenza epidemics continue to cause morbidity and mortality within the human population despite widespread vaccination efforts. This, along with the ominous threat of an avian influenza pandemic (H5N1), demonstrates the need for a much improved, more sophisticated influenza vaccine. Our group has developed an in vitro model system for producing a membrane-bound Cytokine-bearing Influenza Vaccine (CYT-IVAC). Numerous cytokines are involved in directing both innate and adaptive immunity and it is our goal to utilize the properties of individual cytokines and other immunomodulatory proteins to create a more immunogenic vaccine. Here we report methodologies for the construction of membrane-bound cytokine fusion constructs in which our cytokine of interest (mouse GM-CSF, mouse IL-2, mouse IL-4) was fused to the membrane anchoring regions of viral Hemagglutinin (HA). Progeny virions, produced from influenza infected MDCK cells expressing membrane-bound cytokines, readily incorporated membrane-bound cytokines during budding and these cytokines on the virus particles retained bioactivity following viral inactivation. In vivo vaccination studies in mice showed enhanced antibody titers and improved protection following lethal challenge in those mice vaccinated with IL-2 and IL-4-bearing CYT-IVACâ  s compared to the conventional wild-type vaccine without membrane-bound cytokines. In addition, the immune response induced by IL-2 and IL-4-bearing CYT-IVACs was skewed toward Th1 (cellular) mediated immunity compared to the Th2 (humoral) dominated response induced with wild-type vaccination. Cellular mediated immunity afforded by IL-2 and IL-4 CYT-IVACs was manifested as enhanced influenza specific T cell proliferation and activation. In conclusion, we have developed a novel methodology to introduce bioactive membrane-bound cytokines directly into virus particles in order to augment the immunogenicity of inactivated, whole virus influenza vaccines.",
  "description_provenance": [
    "Author Email: asherbert@vt.edu",
    "Advisor Email: kmmyles@vt.edu",
    "Advisor Email: switonsk@vt.edu",
    "Advisor Email: xjmeng@vt.edu",
    "Advisor Email: pcroberts@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:53Z (GMT). No. of bitstreams: 1 AndrewHerbertDissertation.pdf: 25549953 bytes, checksum: d4719cb71c781de8671f391c59854a55 (MD5)   Previous issue date: 2009-04-27"
  ],
  "handle": "27660",
  "identifier_other": "etd-05112009-180421",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112009-180421/",
  "identifier_uri": "http://hdl.handle.net/10919/27660",
  "publisher": "Virginia Tech",
  "relation_haspart": "AndrewHerbertDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "influenza",
    "viral vaccine",
    "membrane-bound cytokines",
    "vaccine adjuvant",
    "immunomodulatory protein"
  ],
  "title": "Cytokine-bearing Influenza Vaccine: Adjuvant Potential of Membrane-bound Immunomodulators",
  "type": "Dissertation"
}