{
  "contributor_author": "Park, Yeonjeong",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeecochair": "Lockee, Barbara B.",
  "contributor_committeemember": [
    "Shrum, Judith L.",
    "Burton, John K."
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:11:53Z",
  "date_adate": "2010-05-27",
  "date_available": "2014-03-14T20:11:53Z",
  "date_issued": "2010-04-28",
  "date_rdate": "2010-05-27",
  "date_sdate": "2010-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A university is an academic place with students from a variety of cultures. Non-native English speaking (NNS) graduate students are a group representing diverse cultural backgrounds. However, these studentsâ   challenges in linguistic and socio-cultural adjustment impact their effective learning and academic success. Intercultural Communicative Competence (ICC) is an important ability that they need to consider. It assesses attitude, skills, knowledge, adaptability, flexibility, and communication ability with culturally different people.     Researchers in Instructional Design and Technology (IDT) have suggested that instructional designers should understand diverse learnersâ   abilities and cultural characteristics and apply them in their Instructional Design (ID) strategies. However, the existing ID models do not specifically include ICC as a consideration in the design process. Furthermore, there has been a lack of research on culturally diverse or minority students.     Considering NNS graduate studentsâ   characteristics, cultural diversity, and need to develop ICC, the researcher reviewed three social theories of learning: social learning theory, sociocultural and cultural-historical activity theory, and situated learning theory. Socially engaged learning, a synthesized framework, was recommended for NNS graduate students along with effective ID strategies.     This research investigated perceptions on ICC and ID strategies for socially engaged learning in a sample of 208 NNS graduate students. Quantitative methods were used to assess studentsâ   ICC level and perceptions of effective instructional strategies in four categories: (1) studentsâ   gradual engagement and active participation, (2) learning in rich cultural context, (3) self-regulation and learning ownership, and (4) integration of communication technologies.      Results showed that NNS graduate students were diverse in background characteristics, academic disciplines, cultural origins, and previous experiences; they perceived a moderately high level of ICC; and they generally had positive views on ID strategies for socially engaged learning. This research can help instructional designers and instructors in higher education to better understand the needs of NNS graduate students and to prepare them to study more effectively and have more valuable intercultural experiences.",
  "description_provenance": [
    "Author Email: ypark78@vt.edu",
    "Advisor Email: jshrum@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:53Z (GMT). No. of bitstreams: 1 Park_Y_D_2010.pdf: 824381 bytes, checksum: 7689e8381dd608eb048a980e30bb0162 (MD5)   Previous issue date: 2010-04-28"
  ],
  "handle": "27662",
  "identifier_other": "etd-05112010-235930",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112010-235930/",
  "identifier_uri": "http://hdl.handle.net/10919/27662",
  "publisher": "Virginia Tech",
  "relation_haspart": "Park_Y_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "instructional design strategies",
    "intercultural communicative competence",
    "international graduate students",
    "non-native English speakers",
    "socially engaged learning"
  ],
  "title": "Instructional Design Implications for Non-native English Speaking Graduate Students: Perceptions on Intercultural Communicative Competences and Instructional Design Strategies for Socially Engaged Learning",
  "type": "Dissertation"
}