{
  "contributor_author": "Hamm, Laura Mae",
  "contributor_committeechair": "Dove, Patricia M.",
  "contributor_committeemember": [
    "Hochella, Michael F. Jr.",
    "De Yoreo, James J.",
    "Rimstidt, james Donald"
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:11:55Z",
  "date_adate": "2012-05-30",
  "date_available": "2014-03-14T20:11:55Z",
  "date_issued": "2012-04-30",
  "date_rdate": "2012-05-30",
  "date_sdate": "2012-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Organisms have evolved a remarkable ability to mineralize complex skeletons and functional biomaterials. These structures are nucleated and grown in close associaiton with macromolecular assemblages of proteins and polysaccharides that are implicated in regulating all stagees of mineralization. Because of this intimate association of organic with inorgaic components, many studies have investigated the effects of particular organic species on mineral morphology, phase, and growth rate. However, the diversity and species-specific nature of the organic assemblages associated with biominerals across a wide variety of taxa, has limited our understanding of how organisms use biomolecules to regulate skeletal formation. It is clear that a mechanistic picture of biomolecular controls on mineralization requires molecular-level investigations of the interplay between organic and inorganic components at all stages of crystallizaiton.  This dissertation presents the findings from theoretical and experimental studies of the physical mechanisms that underlie biomolecule controls on mineral formation. Molecular dynamics simulations probe the effects of acidic molecules on the hydration of alkaline earth cations. After first calculating baseline hydration properties for magnesium, calcium, strontium, and barium, I determine the effects of carboxylate-containing molecules on cation hydration state as well as the kinetics and thermodynamics of water exchange. Experimental work utilizes self-assembled monolayers as proxies for matrix macromolecules in order to understand their effects on CaCO3 nucleation kinetics and thermodynamics. Estimates of nucleation rates and barriers are made from optical microscopy data and correlated with measurements of crystal â   substrate rupture force from dynamic force microscopy.   These investigations show that an important function of biomolecules in directing mineralization lies in their ability to modulate cation hydration. Both chemical functionality and molecular conformation are influential in regulating the kinetics and thermodynamics of mineral nucleation, and these effects may be predicted by the strength of interaction between organic and inorganic components. These findings contribute to a mechanistic understanding of how organic matrices act to regulate biomineral formation. They demonstrate a plausible physical basis for how carboxyl-rich biomolecules accelerate the kinetics of biomineral growth and suggest roles for organic species in the nucleation and pre-nucleation stages of mineralization.",
  "description_provenance": [
    "Author Email: maehamm6@vt.edu",
    "Advisor Email: dove@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:55Z (GMT). No. of bitstreams: 1 Hamm_LM_D_2012.pdf: 21439795 bytes, checksum: fcdfa6f925238f4a8a0e981da534b6d9 (MD5)   Previous issue date: 2012-04-30"
  ],
  "handle": "27670",
  "identifier_other": "etd-05112012-142331",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112012-142331/",
  "identifier_uri": "http://hdl.handle.net/10919/27670",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hamm_LM_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "biomineralization",
    "calcium carbonate",
    "nucleation rate",
    "cation hydration",
    "molecular dynamics"
  ],
  "title": "Calcium carbonate biomineralization: A theoretical and experimental investigation of biomolecular controls on nucleation and growth",
  "type": "Dissertation"
}