{
  "contributor_author": "Christie, Israel Craig",
  "contributor_committeechair": "Friedman, Bruce H.",
  "contributor_committeemember": [
    "Davy, Kevin P.",
    "Harrison, David W.",
    "Bell, Martha Ann"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:56Z",
  "date_adate": "2005-05-24",
  "date_available": "2014-03-14T20:11:56Z",
  "date_issued": "2005-05-09",
  "date_rdate": "2008-05-24",
  "date_sdate": "2005-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The autonomic flexibility model has proven to be a useful theoretical tool relating reductions in physiological variability found to accompany anxiety and concomitant reductions in behavioral (e.g., cognitive and emotional) flexibility. The present study aimed to extend the autonomic flexibility model through the inclusion of individual differences in the sensitivity of the independent motivational systems presumed to underlie anxiety and impulsivity, namely the behavioral inhibition and activation systems (BIS/BAS; Gray, 1994). Contrary to the predicted inverse relationship between BIS sensitivity and measures of physiological variability, findings suggest BAS sensitivity is associated with increased trait-like vagally mediated heart rate variability across diverse tasks as well as greater flexibility in responding within tasks. Numerous BIS*BAS interactions emerged as significant predictors of trait reactivity. Results are discussed in terms of the interface between (1) mesolimbic dopaminergic projections to the nucleus accumbens and (2) the network of central nervous system structures believed to play a large role in controlling peripheral physiology.",
  "description_provenance": [
    "Author Email: ichristie@vt.edu",
    "Advisor Email: kdavy@vt.edu",
    "Advisor Email: dwh@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: bhfriedm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:56Z (GMT). No. of bitstreams: 1 Israel.Christie.Dissertation.pdf: 634027 bytes, checksum: de53897c8fed3ab56747fdd59140a2c2 (MD5)   Previous issue date: 2005-05-09"
  ],
  "handle": "27676",
  "identifier_other": "etd-05122005-102838",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05122005-102838/",
  "identifier_uri": "http://hdl.handle.net/10919/27676",
  "publisher": "Virginia Tech",
  "relation_haspart": "Israel.Christie.Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Behavioral Inhibition/Activation",
    "Neurovisceral Integration",
    "Autonomic Flexibility",
    "Pre-Ejection Period",
    "Heart Rate Variability"
  ],
  "title": "Behavioral Inhibition/Activation and Autonomic Control of the Heart: Extending the Autonomic Flexibility Model",
  "type": "Dissertation"
}