{
  "contributor_author": "Gibson, Glen R",
  "contributor_committeechair": "Campbell, James B. Jr.",
  "contributor_committeemember": [
    "Carstensen, Laurence William Jr.",
    "Stiles, Kenneth L.",
    "Wynne, Randolph H.",
    "Zipper, Carl E."
  ],
  "contributor_department": "Geography",
  "date_accessioned": "2014-03-14T20:11:55Z",
  "date_adate": "2012-05-14",
  "date_available": "2014-03-14T20:11:55Z",
  "date_issued": "2012-05-09",
  "date_rdate": "2012-05-14",
  "date_sdate": "2012-05-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The main objective of this dissertation was to assess whether cultivated area in Iraq, as estimated using satellite remote sensing, changed during and as a result of war and sanctions. The first study used MODIS NDVI data during OIF and the end of UN sanctions to study changes in cultivated area for Iraq as a whole and to identify spatial patterns. The results revealed significant changes in cultivated area for Iraq as a whole, with cultivated area decreasing over 35,000 ha per year. Regionally, there was little change in cultivated area in northern governorates in the Kurdish Autonomous Region, significant decreases in governorates in central Iraq, and initial increases in governorates containing the southern marshlands followed by decreases related to drought. The second study used Landsat images converted to NDVI to study changes in cultivated area in central Iraq for four periods of conflict, and relates those changes to effects on food security. The results indicated that cultivated area changed little between the Iran-Iraq War (1980 to 1988) and the Gulf War (1990 to 1991), increased by 20 percent (from 1.72 to 2.04 Mha) during the period of United Nations sanctions (1990 to 2003), and dropped to below pre-sanction levels (1.40 Mha) during Operation Iraqi Freedom (2003 to 2011). Finally, the third study builds on findings from the second study to address patterns of agricultural land abandonment in central Iraq. The largest areas of abandoned land were those cultivated during the Late Sanctions period (2000-2003). Further, the results indicate that proximity to surface water and roads are strong indicators of continuity of agricultural land use, and that abandoned lands are positioned in peripheral regions more distant from surface water and the transportation grid. We also found that surface soil salinity is increasing in the cultivated lands of central Iraq, regardless of whether it was cultivated during every period or during only a single period. The overall findings indicate that the UN sanctions had the greatest impact on cultivated area, which increased during sanctions, when food imports all but ceased, and then decreased after sanctions ended and food imports resumed.",
  "description_provenance": [
    "Author Email: ggibson@vt.edu",
    "Advisor Email: jayhawk@vt.edu",
    "Advisor Email: carstens@vt.edu",
    "Advisor Email: kls@vt.edu",
    "Advisor Email: wynne@vt.edu",
    "Advisor Email: czip@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:55Z (GMT). No. of bitstreams: 1 Gibson_GR_D_2012.pdf: 2147320 bytes, checksum: 44c72bb9476051e31c5901868d81c848 (MD5)   Previous issue date: 2012-05-09"
  ],
  "handle": "27671",
  "identifier_other": "etd-05112012-150734",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05112012-150734/",
  "identifier_uri": "http://hdl.handle.net/10919/27671",
  "publisher": "Virginia Tech",
  "relation_haspart": "Gibson_GR_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cultivation",
    "sanctions",
    "food security",
    "food imports",
    "land abandonment"
  ],
  "title": "War and Agriculture: Three Decades of Agricultural Land Use and Land Cover Change in Iraq",
  "type": "Dissertation"
}