{
  "contributor_author": "Sira, Natalia",
  "contributor_committeecochair": [
    "Rogers, Cosby Steele",
    "Sawyers, Janet K."
  ],
  "contributor_committeemember": [
    "Garrison, James E.",
    "Cross, Lawrence H.",
    "Fu, Victoria R."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:11:55Z",
  "date_adate": "2003-05-27",
  "date_available": "2014-03-14T20:11:55Z",
  "date_issued": "2003-01-27",
  "date_rdate": "2004-05-27",
  "date_sdate": "2003-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT   Body image or satisfaction with physical appearance has been established as an important aspect of self-worth and mental health across the life span. It is related to self-esteem, sexuality, family relationships and identity.  Given the fact that physical appearance is a multifaceted structural concept that depends, not only on inner-biological, but also a psychological and socio-cultural components, the purpose of this study was to examine variables that are related to and influenced by satisfaction with physical appearance. Body mass index (BMI), eating disturbances, attachment (to mother, to father and to peers), global self-worth, parental control, peer influence and pressure regarding eating and media influence were examined in relation satisfaction with physical appearance.  College students in a large southeastern university (195 males and 340 females) completed two subscales of Harter's Self-Perception Scale for College Students.  Each subject self-reported his/her weight and height and these were used calculate weight/height ratio known as the body mass index.  Participants also reported on attachment (to mother, to father and to peers) using the Inventory of Parent and Peer attachment scales (Armsden & Greenberg, 1987), Peer Influence Scale (Mukai, 1993) and the Media Influence scale which was developed for this project.    Differences between male and female perceptions of physical appearance in relationship to BMI were found: Among women, higher BMIs were associated with lower scores on perceptions of physical appearance  (r = -. 429, p £  .001), whereas for males BMIs were not related to satisfaction with physical appearance.  For both males and females, satisfaction with physical appearance was significantly and negatively (r = -.258, p  £ .01) associated with media influence.  Media influence was related to higher scores on the EAT 26 scale that measured disturbed eating attitudes and behaviors (r = .307, p  £ .01).  Females were affected by this association more so than were males.  However, males appeared to not to be immune to such influence.  Peer influence and peer pressure was another influential factor for both gender groups and it was associated with high eating disturbance scores (r = .369, p £  .01 for peer influence, and r = .413, p £ .01 for peer pressure).  Attachment variables were associated with satisfaction of physical appearance and global self-worth in a different manner for adolescent females and males. For males, satisfaction with physical appearance was positively related to attachment to mother (r = .135, p £ .05) and father (r = .170, p £ .05) and negatively associated with maternal control (r = -. 246, p £ . 001).  For females, only attachment to mother (r = .082, p £  .05) was positively associated satisfaction with physical appearance.  While there were many significant bivariate correlational findings, there were few significant coefficients in a regression analyses, presumably because of the high intercorrelations between the predictor variables.  For females, BMI was the best predictor of satisfaction with physical appearance, whereas for males, the feeling of global self-worth was the strongest variable in predicting satisfaction with physical appearance.  Satisfaction with physical appearance is an essential part of global self-worth and is constructed differently by males and females.  For females, high BMI was negatively related to satisfaction with physical appearance as well as global self-worth.  On the other hand, for males neither global self-worth nor perceptions of physical appearance were affected by high BMIs.  More research is needed to understand the complexity of influences on satisfaction with physical appearance as well as construction of global self-worth and its domains for both sexes.",
  "description_provenance": [
    "Author Email: nkee@vt.edu",
    "Advisor Email: rogersco@vt.edu",
    "Advisor Email: jgarris@usit.net",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: sawyers@vt.edu",
    "Advisor Email: vfu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:55Z (GMT). No. of bitstreams: 1 Diss.fin.pdf: 2442477 bytes, checksum: a7bd0e915e18f3e8fbe1a490c7b31e6a (MD5)   Previous issue date: 2003-01-27"
  ],
  "handle": "27674",
  "identifier_other": "etd-05122003-121553",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05122003-121553/",
  "identifier_uri": "http://hdl.handle.net/10919/27674",
  "publisher": "Virginia Tech",
  "relation_haspart": "Diss.fin.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Body Image",
    "eating behavior",
    "BMI",
    "attachment",
    "peer pressure",
    "gender differences"
  ],
  "title": "Body Image: Relationhsip to Attachment, Body Mass Index and Dietary Practices among College Students",
  "type": "Dissertation"
}