{
  "contributor_author": "Sullivan, Gregory Paul",
  "contributor_committeechair": "Sanders, Mark E.",
  "contributor_committeemember": [
    "Wells, John G.",
    "Potter, Kenneth R.",
    "McBee, Janice K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:11:56Z",
  "date_adate": "2006-06-19",
  "date_available": "2014-03-14T20:11:56Z",
  "date_issued": "2006-05-09",
  "date_rdate": "2006-06-19",
  "date_sdate": "2006-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Research suggests that high stakes testing impacts teachers창   decisions regarding curriculum and instruction, which, in turn, impacts student learning.  Because Virginia administered SOL tests for Computer/Technology, then discontinued them, a study was possible comparing teachers창   perceptions and actual student achievement of those taught while the high-stakes tests were in place and those taught after the tests were discontinued.  A survey was administered to all elementary and middle school classroom teachers in a midsize urban Virginia school division to determine their perceptions of the effects of high-stakes testing.  Cross tabulations were performed based upon: school level; on whether the teacher had taught prior to, or only after, the SOL tests were implemented; and whether the teacher perceived he/she was teaching a high or low percentage of lower socio-economic status (SES) students.  In addition to the survey, the 2002 versions of the Virginia Computer/Technology Standards of Learning (C/T SOL) assessments were administered to all 2005 fifth and eighth grade students within the same school division.  Statistical comparisons of the means of raw scores from the 2002 fifth (n = 625) and eighth (n = 641) grade groups and the 2005 fifth (n = 583) and eighth (n = 522) grade groups were conducted.  Comparisons were also conducted on scores from each test between groups of students who qualified for free and reduced price lunches and those that did not qualify.  Finally, statistical comparisons were made between the scaled scores of students who were eighth graders in 2005 (n = 397) and their scaled scores as fifth graders when tested in 2002.   The study found a majority of teachers felt high-stakes testing creates pressure and changes the focus of instruction to tested areas at the expense of other activities and non-tested content.    When the means of the scores of students who took the C/T SOL tests in 2002 were compared to those from 2005, the scores for the students taught under the high-stakes testing pressure were significantly better than those tested in 2005.  Further, this gap in student achievement was more pronounced for lower SES students, suggesting a widening of the 창  digital divide.창",
  "description_provenance": [
    "Author Email: gsulliva@vt.edu",
    "Advisor Email: jgwells@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: jmcbee@vt.edu",
    "Advisor Email: msanders@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:56Z (GMT). No. of bitstreams: 1 SullivanDissertation.pdf: 1406144 bytes, checksum: 820cce909beca8de191447ebda8a6d04 (MD5)   Previous issue date: 2006-05-09"
  ],
  "handle": "27678",
  "identifier_other": "etd-05122006-170604",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05122006-170604/",
  "identifier_uri": "http://hdl.handle.net/10919/27678",
  "publisher": "Virginia Tech",
  "relation_haspart": "SullivanDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "high stakes testing",
    "computer/technology",
    "digital divide"
  ],
  "title": "The Impact of High Stakes Testing on Curriculum, Teaching, and Learning",
  "type": "Dissertation"
}