{
  "contributor_author": "Kitner-Triolo, Melissa Hughes",
  "contributor_committeechair": "Crawford, Helen J.",
  "contributor_committeemember": [
    "Bell, Martha Ann",
    "Blieszner, Rosemary",
    "Prestrude, Albert M.",
    "Franchina, Joseph J.",
    "Zonderman, Alan B."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:55Z",
  "date_adate": "2000-05-19",
  "date_available": "2014-03-14T20:11:55Z",
  "date_issued": "2000-05-03",
  "date_rdate": "2001-05-19",
  "date_sdate": "2000-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "PREDICTING FUTURE AGE-RELATED COGNITIVE DECLINE: PROCESSING SPEED AND FRONTAL LOBE FUNCTIONING by  Melissa H. Kitner-Triolo Helen J. Crawford, Ph.D., Chair Abstract The present study assessed the impact of aging on cognitive functioning over six to 16 years in exceptionally healthy individuals (20 to 79 years) drawn from the Baltimore Longitudinal Study of Aging.  The first study (N = 380 women, 757 men) examined the relationship between age and speed of processing as measured by five reaction time (RT) tasks (simple reaction time to complex reaction time involving varying amounts of inhibitory and working memory processing).  Unlike previous research, this study additionally assessed the impact of processing speed, working memory, inhibitory processing, and interference RT measures in predicting future performance 6-16 years later (N=103) on (1) mental status (Blessed Information-Memory-Concentration, Mini-Mental State Examination), and prefrontal mediated neuropsychological tests (Trail Making A and B; verbal and category fluency; WAIS digits forward and backwards, California Verbal Learning Test proactive interference index).  Regression analyses assessed which theoretical approach, speed of processing (Salthouse, 1996) or prefrontal cortex (Hasher & Zacks, 1988; West, 1996), better explained cognitive change.  Age-related cognitive slowing was observed for initial RT tasks.  Especially among the oldest studied (62-79 years of age), slower speed of processing was accelerated by task complexity.   Increases in response time were substantially steeper for older as opposed to younger participants.  Men were faster than women were on simple RT and a RT task that involved inhibitory processing.  A 6-9 year age decline in speed of processing only occurred among individuals over 60 years.  RT omission and commission errors showed similar results.   Hierarchical regression analyses determined that RT tasks involving inhibitory control, working memory and interference were most predictive of future prefrontal-mediated cognitive performance (Trail Making B, digit span backwards, letter and   category fluency). Prediction of the prefrontal outcome measures of Trail Making A and digit span forward performance from simple reaction time was mediated by the RT measures (inhibitory control, working memory and interference), but not the other way around.  Thus, the data most strongly support the Inhibitory Deficit (Hasher & Zacks, 1988) and Prefrontal Cortex Function (West, 1996) theories.  There was little support for the processing speed theory (Salthouse, 1996).",
  "description_provenance": [
    "Author Email: Melissa@lpc.grc.nia.nih.gov",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Advisor Email: alpres@vt.edu",
    "Advisor Email: hjc@vt.edu",
    "Advisor Email: jjfranch@vt.edu",
    "Advisor Email: abz@lpc.grc.nia.nih.gov",
    "Made available in DSpace on 2014-03-14T20:11:55Z (GMT). No. of bitstreams: 1 Melissahkt.pdf: 364141 bytes, checksum: 85698885e7826dbf3537de38d3b4b83a (MD5)   Previous issue date: 2000-05-03"
  ],
  "handle": "27673",
  "identifier_other": "etd-05122000-16440006",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05122000-16440006/",
  "identifier_uri": "http://hdl.handle.net/10919/27673",
  "publisher": "Virginia Tech",
  "relation_haspart": "Melissahkt.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Working Memory",
    "Cross-sectional aging",
    "Interference",
    "Inhibition",
    "Reaction Time",
    "Longitudinal aging",
    "Prefrontal cortex"
  ],
  "title": "Predicting Future Age-Related Cognitive Delcine: Processing Speed and Frontal Lobe Functioning",
  "type": "Dissertation"
}