{
  "contributor_author": "Mitra, Arijit",
  "contributor_committeechair": "Rimstidt, james Donald",
  "contributor_committeemember": [
    "Schreiber, Madeline E.",
    "Dove, Patricia M.",
    "Chermak, John A."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:11:58Z",
  "date_adate": "2008-05-30",
  "date_available": "2014-03-14T20:11:58Z",
  "date_issued": "2008-04-29",
  "date_rdate": "2008-05-30",
  "date_sdate": "2008-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p style='text-align:justify;line-height:150%'>SiO<sub>2</sub> is the most abundant oxide in the earth and its properties, behaviors and interactions are of immense scientific and technological importance. Of particular importance are the interactions of silica with aqueous fluids because these fluids are present in nearly every natural setting. The dissolution of silica and glass by HF plays a very important role in technology and is widely used for the etching of silica and silicate glasses in the glass industry, in the flint industry, in surface micromachining, in etching of glass fibers for near-field optical probes, in the creation of frosted surfaces for decorative applications like frosted glass and cosmetic vials.</p>  <p style='text-align:justify;text-indent:.5in;line-height:150%'>I performed 57 batch reactor experiments in acidic fluoride solutions to measure the dissolution rate of quartz. Quartz dissolution rate data from other published studies were combined with the rate data from my experiments and these 75 data were analyzed using multiple linear <span class=GramE>regression</span> to produce an empirical rate law for quartz</p>  <p align=center style='text-align:center;line-height:150%'>r<sub>qz</sub> = 10<sup>-4.53</sup> (e<sup>-18932/RT</sup>) a<sub>HF</sub><sup>1.18</sup> a<sub>H+</sub><sup>-0.39</sup></p>  <p style='line-height:150%'>where -5.13 < a<sub>HF</sub><sub> </sub>< 1.60, -0.28 < <i style='mso-bidi-font-style:normal'>pH</i> < 7.18, and 25 < <i style='mso-bidi-font-style:normal'>T</i> < 100 Â°C.</p>  <p style='text-align:justify;text-indent:.5in;line-height:150%'>Similarly, 97 amorphous silica dissolution rate data from published studies were analyzed using multiple linear regression to develop an empirical rate law for amorphous silica</p>  <p align=center style='text-align:center;line-height:150%'>r<sub>as</sub> = 10<sup>0.48</sup> (e<sup>-34243/RT</sup>) a<sub>HF</sub><sup>1.50</sup> a<sub>H+</sub><sup>-0.46</sup></p>  <p style='line-height:150%'>where -5.13 < a<sub>HF</sub><sub> </sub>< 1.60, -0.28 < <i style='mso-bidi-font-style:normal'>pH</i> < 7.18 and 25 < <i style='mso-bidi-font-style:normal'>T</i> < 70 Â°C.</p>  <p style='text-align:justify;text-indent:.5in;line-height:150%'>An examination of the empirical rate laws suggests that the rate-determining step in the reaction mechanism involves a coordinated attack of HF and H<sup>+</sup> on the Si-O bond where the H<sup>+</sup> ion, acting as a Lewis acid, attacks the bridging O atom, while the F end of a HF molecule, acting as a Lewis base, attacks the Si atom. This allows a redistribution of electrons from the Si-O bond to form a O-H and a Si-FH bond, thus â  breakingâ   the Si-O bond.</p>  <p style='text-align:justify;text-indent:.5in;line-height:150%'>In order to quantify the effect of fluoride on the dissolution of silica, I also performed a series of 81 quartz dissolution and 20 amorphous silica dissolution experiments in batch reactors over a pH range of 0 to 7 to investigate the effect of H<sup>+</sup> on silica dissolution rates. Between pH 3.5 and 7 silica dissolution rates are independent of pH, but they increase significantly below pH 3.5, so that the dissolution rate of both quartz and amorphous silica at pH 0 is more than an order magnitude faster than the dissolution rate at pH 3.5. I found that the empirical rate law for the dissolution of the â  disturbed surfaceâ   of quartz in the pH range of 0 to 3.5 is</p>  <p align=center style='text-align:center;line-height:150%'>r<sub>qz,pH</sub> = 10<sup>-0.23</sup> (e<sup>-59392/RT</sup>) a<sub>H+</sub><sup>0.28</sup></p>  <p style='text-align:justify;line-height:150%'>where 0 < pH < 3.5 and 25 < T < 55Â°C. The empirical rate law for amorphous silica dissolution in the pH range 0 to 3.5 is</p>  <p align=center style='text-align:center;line-height:150%'>r<sub>qz,pH</sub> = 10<sup>0.56</sup> (e<sup>-64754/RT</sup>) a<sub>H+</sub><sup>0.40</sup></p>  <p style='line-height:150%'>where 0 < pH < 3.5 and 25 < T < 55Â°C.</p>  <p style='text-align:justify;text-indent:.5in;line-height:150%'>Based on the empirical rate laws I suggest that the rate-determining step in the reaction mechanism involves a coordinated attack of H<sub>3</sub>O<sup>+</sup>, acting as a Lewis acid reacts, on a bridging O atom and the O end of a H<sub>2</sub>O, acting as a Lewis base, on the Si atom. This results in a redistribution of electrons from the Si-O bridging bond to form two Si-OH surface species.</p>",
  "description_provenance": [
    "Author Email: amitra@vt.edu",
    "Advisor Email: mschreib@vt.edu",
    "Advisor Email: dove@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: jchermak@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:58Z (GMT). No. of bitstreams: 4 Dissertation_ARIJIT_MITRA.pdf: 7680064 bytes, checksum: dd54e5136fe2947d90698a578ad0b5e1 (MD5) Chapter_2_Raw_Data.pdf: 35387 bytes, checksum: 1f5573114a4fd7812ceb6f287498224e (MD5) Chapter_3_Raw_Data_Quartz_Experiments.pdf: 55303 bytes, checksum: d4497a982f85741766aef73414ac0abc (MD5) Chapter_3_Raw_Data_Amorphous_Silica_Experiments.pdf: 28950 bytes, checksum: 282226b67bc04408c6cfd2e57135c159 (MD5)   Previous issue date: 2008-04-29"
  ],
  "handle": "27681",
  "identifier_other": "etd-05122008-150550",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05122008-150550/",
  "identifier_uri": "http://hdl.handle.net/10919/27681",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation_ARIJIT_MITRA.pdf",
    "Chapter_2_Raw_Data.pdf",
    "Chapter_3_Raw_Data_Quartz_Experiments.pdf",
    "Chapter_3_Raw_Data_Amorphous_Silica_Experiments.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "dissolution kinetics",
    "dissolution rate",
    "quartz",
    "hydrofluoric acid",
    "silica",
    "low pH"
  ],
  "title": "Silica dissolution at low pH in the presence and absence of fluoride",
  "type": "Dissertation"
}