{
  "contributor_author": "Lee, Myoungbae",
  "contributor_committeechair": "Baird, Donald G.",
  "contributor_committeemember": [
    "McGrath, James E.",
    "Martin, Stephen M.",
    "Davis, Richey M."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:11:58Z",
  "date_adate": "2009-06-09",
  "date_available": "2014-03-14T20:11:58Z",
  "date_issued": "2009-04-27",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The overall objective of the project, on which this thesis is based, is to develop a novel hydrocarbon-based proton exchange membrane (PEM) material that can produce a proton conductivity of 0.1 S/cm at the operating conditions of 50 % relative humidity and 120 oC, which is the performance target set by the U.S. DOE for automotive application. As a part of this project, our efforts have been focused on the investigation of the effects of solution-casting conditions on the final morphology and properties of disulfonated poly(arylene ether sulfone) multiblock copolymer films from the viewpoint of phase separation of block copolymers. Of equal importance to this work, is a possibility of utilizing a rheological technique for monitoring the transformation and kinetics of block copolymers during solvent removal process, which was initially examined in order to provide fundamental quantitative understanding and practical information on the solvent removal process. <p> Our results demonstrated that solvent selectivity and drying temperature as well as the block length had considerable effects on the final morphology and properties. The proton conductivity could be significantly increased by simply utilizing a selective solvent, dimethylacetamide (DMAC), which is good and marginal for the sulfonated and unsulfonated blocks, respectively, rather than N-methyl-2-pyrrolidone (NMP), a neutral solvent for both blocks. The drying temperature was also observed to have considerable   effects on the final properties, being coupled with the effects of solvent selectivity. Also, it was shown that the multiblock copolymer consisting of longer blocks was more sensitive to the processing conditions. From the morphological study using transmission electron microscopy and small-angle X-ray scattering, evidences for the above observations were obtained.<p> In the second part of this dissertation, the evolution of GÎ  and GË  of the solutions of a styrene-butadiene-styrene (SBS) triblock copolymer in toluene was obtained as a function of concentration using a modified parallel-plate device and a rheology test scheme developed in this study in an effort to quantify the phase separation kinetics. Then, the information on the phase transformation and kinetics of the SBS block copolymer in the solution was obtained by analyzing the GÎ  and GË  data with the Avrami equation. The Avrami exponent was found to be approximately 1, which indicates that the phase transformation occurred by a one-dimensional growth mechanism. The rate constant showed a strong concentration-dependence. After the initial increase up to 45 vol %, the rate constant drastically decreased and, finally, converged to 0 at 70 vol %. It is believed that, at the concentration range below 45 vol %, the phase separation became more intense as the polymer molecules had more chances to interact owing to the concentration increase. However, above 45 vol %, the phase transformation became weaker due to the limited mobility of the polymer molecules, which finally led to a â  kinetically frozen-inâ   structure, in which the polymer molecules could not move any longer. Thus, it can be concluded that the solvent removal rate is one of the dominant factors that decide the final microstructures of solution-cast block copolymer films.",
  "description_provenance": [
    "Author Email: keumsa@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: martinsm@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:58Z (GMT). No. of bitstreams: 2 letterandchecklist.pdf: 932930 bytes, checksum: 01c82c3143f59db06e4988e6b612fd25 (MD5) dissertationMLee.pdf: 23444693 bytes, checksum: c577e83e37eb11ba1dabdac3f82eead2 (MD5)   Previous issue date: 2009-04-27"
  ],
  "handle": "27685",
  "identifier_other": "etd-05122009-215044",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05122009-215044/",
  "identifier_uri": "http://hdl.handle.net/10919/27685",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "letterandchecklist.pdf",
    "dissertationMLee.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "phase separation kinetics",
    "block copolymer",
    "proton exchange membrane",
    "solvent selectivity",
    "processing temperature"
  ],
  "title": "Solution-casting of Disulfonated Poly(arylene ether sulfone) Multiblock  Copolymer Films for Proton Exchange Membranes",
  "type": "Dissertation"
}