{
  "contributor_author": "Robertson, Heather C",
  "contributor_committeechair": "Brott, Pamelia E.",
  "contributor_committeemember": [
    "Day-Vines, Norma L.",
    "Ulrich, Lorene B.",
    "Belli, Gabriella M."
  ],
  "contributor_department": "Counselor Education and Supervision",
  "date_accessioned": "2014-03-14T20:11:58Z",
  "date_adate": "2010-06-04",
  "date_available": "2014-03-14T20:11:58Z",
  "date_issued": "2010-05-04",
  "date_rdate": "2010-06-04",
  "date_sdate": "2010-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The study explored factors related to life satisfaction for military members transitioning to teaching. Schlossbergâ  s (1981) model of human adaptation to transition was used to articulate the career transition factors of readiness, confidence, control, perceived support, and decision independence. The Career Transitions Inventory (Heppner, 1992), Satisfaction with Life Scale (Deiner, 1985), demographic variables, and open-ended questions were used to examine relationships.  The data were collected using a secure online survey with a total of 136 usable responses from the Troops to Teachers database. Participants were overwhelmingly male (86%), married (86%), white (79%), and not of Hispanic origin (87%), which were reflective of an earlier Troops to Teachers study (Feistrizer, 2005). A weak correlation was found with life satisfaction and the variables of confidence and control. Stepwise regression revealed that combined control and readiness accounted for approximately 16% of the variance in life satisfaction. Additional relationships were noted between time in transition and income, as well as time in transition and support.  Generally, participants were satisfied with life, which may indicate successful adaptation post-military transition. Results supported earlier studies demonstrating that internal/psychological factors (i.e., confidence, readiness, control) are positively linked to successful career transition. However, results did not mirror research on external factors (i.e., support) being related to successful career transition. Participantsâ   insights indicated that preparing for, investing in, and having a positive attitude might benefit others pursuing a mid-life career transition. Further, helping and serving others, recognizing their accomplishments, and finding work/life balance reflected satisfaction in both military and teaching careers. Limitations of the study included low response rates, lack of diversity among the respondents, and findings not generalizable to other populations. Implications for counseling individuals in mid-life military career transitions are to (a) incorporate confidence and control as counseling foci, (b) address social/family and financial supports during transitions, and (c) draw from previous meaningful experiences (i.e., military) to deal with transition. Future research with populations that fully encapsulate stages of transition and are representative of more diversity can further contribute to our understanding of mid-life career transition.",
  "description_provenance": [
    "Author Email: heatherR@vt.edu",
    "Advisor Email: ndayvine@vt.edu",
    "Advisor Email: lorene.ulrich@gmail.com",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: pbrott@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:58Z (GMT). No. of bitstreams: 1 Robertson_HC_D_2010.pdf: 2559556 bytes, checksum: 2b1c13e8a486e435d4727e9c6fb457e6 (MD5)   Previous issue date: 2010-05-04"
  ],
  "handle": "27686",
  "identifier_other": "etd-05122010-100341",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05122010-100341/",
  "identifier_uri": "http://hdl.handle.net/10919/27686",
  "publisher": "Virginia Tech",
  "relation_haspart": "Robertson_HC_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Life Satisfaction",
    "Career Transition",
    "Troops to Teachers"
  ],
  "title": "Life Satisfaction among Midlife Career Changers: A Study of Military Members Transitioning to Teaching",
  "type": "Dissertation"
}