{
  "contributor_author": "Orr, Jeb Stuart",
  "contributor_committeechair": "Davy, Kevin P.",
  "contributor_committeemember": [
    "Hulver, Matthew W.",
    "Davy, Brenda M.",
    "Frisard, Madlyn I.",
    "Rivero, Jose M."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:11:58Z",
  "date_adate": "2009-06-04",
  "date_available": "2014-03-14T20:11:58Z",
  "date_issued": "2009-05-06",
  "date_rdate": "2009-06-04",
  "date_sdate": "2009-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Aging is characterized by a progressive stiffening of large elastic arteries in the cardiothoracic region.  Importantly, large artery stiffness is an independent predictor of cardiovascular events and mortality in both healthy and diseased populations.  The results of several studies suggest that obesity, particularly visceral adiposity, is associated with the accelerated stiffening of central elastic arteries in middle-aged and older adults.  Despite the widely recognized association between obesity, aging and arterial stiffness, there remains a paucity of information regarding both the initiation of arterial stiffening and effective treatment strategies.  To address these issues, we tested the hypotheses that weight gain increases arterial stiffness in nonobese young males, and atorvastatin treatment reduces large artery stiffness in overweight and obese middle-aged and older adults.  Consistent with our first hypothesis, weight gain increased arterial stiffness in nonobese young men.  In addition, we demonstrated that, independent of total body fat, those individuals with relatively larger increases in abdominal visceral fat also experienced correspondingly larger increases in arterial stiffness.  Regarding our second hypothesis, atorvastatin treatment decreased arterial stiffness in overweight and obese middle-aged and older adults.  Importantly, the reduction in arterial stiffness with atorvastatin appeared to be independent of the reduction in C-reactive protein.  The findings of the present studies could potentially lead to the identification of effective strategies for the prevention and treatment of arterial stiffening in the population.",
  "description_provenance": [
    "Author Email: orr@vt.edu",
    "Advisor Email: kdavy@vt.edu",
    "Advisor Email: hulvermw@vt.edu",
    "Advisor Email: bdavy@vt.edu",
    "Advisor Email: frisardm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:58Z (GMT). No. of bitstreams: 1 ORR.pdf: 3398328 bytes, checksum: 947b7e28e1833749adb94dd96dc94916 (MD5)   Previous issue date: 2009-05-06"
  ],
  "handle": "27682",
  "identifier_other": "etd-05122009-002824",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05122009-002824/",
  "identifier_uri": "http://hdl.handle.net/10919/27682",
  "publisher": "Virginia Tech",
  "relation_haspart": "ORR.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "visceral fat",
    "aging",
    "weight gain",
    "arterial stiffness",
    "obesity"
  ],
  "title": "The Effects of Weight Gain and Atorvastatin Treatment on Arterial Stiffness",
  "type": "Dissertation"
}