{
  "contributor_author": "Loehn, Clayton William",
  "contributor_committeechair": "Tracy, Robert J.",
  "contributor_committeemember": [
    "Hudson, Michael",
    "Ross, Nancy L.",
    "Law, Richard D.",
    "Dahl, Peter S."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:11:59Z",
  "date_adate": "2011-06-06",
  "date_available": "2014-03-14T20:11:59Z",
  "date_issued": "2011-04-28",
  "date_rdate": "2011-06-06",
  "date_sdate": "2011-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In order to evaluate the electron microprobe (EMP) method for chemical dating of monazite, we chemically analyzed selected suites of monazite grains that were previously dated by standard U/Pb isotopic methods at three laboratories each equipped with a sensitive high resolution ion microprobe (SHRIMP). Representing diverse igneous and metamorphic lithologies, these grains yielded conventional isotopic ages ranging in age from Neoarchean to Devonian. Chemical dating was performed at Virginia Tech using a Cameca SX-50 EMP in which the analytical routines and settings were specifically optimized for monazite geochronology, including correction of analytical peaks for all major spectral interferences and correction of peak intensities for local background emission. Placement of cross-grain analytical traverses was based on backscattered electron (BSE) images together with wavelength-dispersive (WD) generated X-ray maps for Y, Th, U, and Ca, which revealed the internal compositional complexity of each grain. Shorter EMP traverses were selected adjacent to each SHRIMP pit in order to provide the best possible comparison of ages obtained by the two dating methods. Synthesis protocol for key elemental measurements (Y, Th, U, and Pb) was developed utilizing the 1Ï  elemental errors associated with individual analyses, providing an objective approach for data synthesis. Analytical dates were either accepted or excluded based on analytical and spatial justifications. Isotopic dating techniques utilize three independent age calculations, provided the sample is old enough to have accumulated sufficient 207Pb (i.e., â ¥~1000 Ma). Similarly, the chemical dating method can utilize two independent age calculations (i.e., Th/Pb and U/Pb) and a U-Th-Pbtotal centroid age in Th/Pb vs. U/Pb space, verified independently against the calculated Th* or U* CHIME ages. Across the entire 2,200 m.y. age range represented by the sample set, the chemical ages calculated from the EMP data chemical ages are internally consistent (within 2Ï  error) with the previously measured SHRIMP isotopic ages, except in one case where bulk mixing of discrete age domains within an ablation pit led to an isotopically discordant apparent age. Overall, this study illustrates that EMP chemical dating (1) represents both an accurate and precise primary method for dating monazite from igneous and polymetamorphic terrains; (2) provides superior spatial resolution for obtaining meaningful ages from small and/or irregular domains of discrete age that may be irresolvable or misinterpreted by other dating techniques that sample larger volumes; and (3) illuminates the geological meaning of isotopically discordant monazite ages obtained using conventional methods with lower spatial resolution (e.g., SHRIMP).",
  "description_provenance": [
    "Author Email: cloehn@email.arizona.edu",
    "Advisor Email: mhudson@ashland.edu",
    "Advisor Email: rtracy@vt.edu",
    "Advisor Email: nross@vt.edu",
    "Advisor Email: rdlaw@vt.edu",
    "Advisor Email: pdahl@kent.edu",
    "Made available in DSpace on 2014-03-14T20:11:59Z (GMT). No. of bitstreams: 1 LoehnPhDETD.pdf: 6391396 bytes, checksum: 47b41ee613283697866aa777b4a0fe40 (MD5)   Previous issue date: 2011-04-28"
  ],
  "handle": "27688",
  "identifier_other": "etd-05122011-164811",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05122011-164811/",
  "identifier_uri": "http://hdl.handle.net/10919/27688",
  "publisher": "Virginia Tech",
  "relation_haspart": "LoehnPhDETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Monazite",
    "chemical dating",
    "U-Th-Pb dating",
    "electron microprobe"
  ],
  "title": "Investigation of the monazite chemical dating technique",
  "type": "Dissertation"
}