{
  "contributor_author": "Filer, Kimberly L",
  "contributor_committeechair": "Chang, Mido",
  "contributor_committeemember": [
    "Skaggs, Gary E.",
    "Singh, Kusum",
    "Allen, Katherine R."
  ],
  "contributor_department": "Educational Research and Evaluation",
  "date_accessioned": "2014-03-14T20:11:58Z",
  "date_adate": "2009-06-12",
  "date_available": "2014-03-14T20:11:58Z",
  "date_issued": "2009-04-30",
  "date_rdate": "2012-09-10",
  "date_sdate": "2009-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examines social structural effects on student mathematics preparation and identification with a science, technology, engineering, or mathematics (STEM) field, as well as the social psychological factors that may mediate those effects. Using demographic, academic, attitudinal, and school policy data from the Educational Longitudinal Study of 2002 (ELS: 2002) for over 14,000 students from a nationally representative sample, this research tests a model of mathematics course taking and selection of a STEM field linking social identity and self processes with academic decision making. Using structural equation modeling (SEM) to assess the relationships between the latent and observed variables, specifically examining mathematics self-efficacy and social support variables and how they mediate the effects of background variables and prior mathematics achievement on mathematics course taking and subsequent choice of a STEM major, the initial model tests the use of advanced mathematics course taking as a proxy to a college major in a STEM field.  <p> This study further develops a second model linking social identity and mathematics course taking using the nested structure of the data to consider the role of school grouping policies on mathematics course taking. Hierarchical linear modeling (HLM) is employed to measure the effects of individual socio-economic level, race, gender, and coping resources within schools with different course selection and ability grouping policies on high school mathematics course taking. <p> The results of structural equation modeling supported most formulations of the conceptual model and showed significant effect of coping resources on mathematics course taking and subsequent STEM matriculation. Furthermore, females showed lower mathematics self-efficacy and were less likely to enter a STEM field of study than males although they experienced higher levels of social support and math course taking. Findings from the hierarchical linear models suggested that studentsâ   mathematics course taking was related to coping variables, but it varied by course enrollment policy at the school level. The effects of school policy were not consistent across racial groups. The study had both theoretical and practical significance, providing insights for increased diversity in STEM majors as well as policy implications at the high school level.",
  "description_provenance": [
    "Author Email: kfiler@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: kusingh@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: mchang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:58Z (GMT). No. of bitstreams: 1 Filer_ETD_submit.pdf: 1158984 bytes, checksum: b4dcabe0d2a92c83dc72551bc79f23a5 (MD5)   Previous issue date: 2009-04-30"
  ],
  "handle": "27684",
  "identifier_other": "etd-05122009-140809",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05122009-140809/",
  "identifier_uri": "http://hdl.handle.net/10919/27684",
  "publisher": "Virginia Tech",
  "relation_haspart": "Filer_ETD_submit.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "social support",
    "self-efficacy",
    "mathematics preparation",
    "STEM matriculation",
    "course selection"
  ],
  "title": "Understanding the Leaking Pipeline:  The Effects of Self-Efficacy and Student Choice on High School Mathematics Preparation and STEM Matriculation",
  "type": "Dissertation"
}