{
  "contributor_author": "Sutphin, Cathy McNeely",
  "contributor_committeechair": "Hillison, John H.",
  "contributor_committeemember": [
    "Bird, Gloria W.",
    "Stewart, Daisy L.",
    "Camp, William G.",
    "Meadows, Robert Ray"
  ],
  "contributor_department": "Agricultural Education",
  "date_accessioned": "2014-03-14T20:11:59Z",
  "date_adate": "1999-05-13",
  "date_available": "2014-03-14T20:11:59Z",
  "date_issued": "1999-05-03",
  "date_rdate": "2000-05-13",
  "date_sdate": "1999-05-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Most research studies of American agricultural education begin with an overview of the events leading to the passage of the Smith-Hughes Act of 1917. By doing so, researchers have neglected an important, foundational era of agricultural education. With the passage of the Morrill Acts of 1862 and 1890, states began establishing land-grant colleges to provide instruction in the scientific method of agriculture. However, the faculty found that students attending the colleges were ill prepared for collegiate level agricultural courses.  At the same time, there was increased interest in agricultural education due in part to the establishment of the land-grant system and later the development of a national system of experiment stations. This interest, coupled with a strong national movement to improve secondary education, provided the incentive to for educational leaders to campaign for secondary agricultural education. Hence, the movement for Congressional district agricultural schools began. The state legislatures of Alabama, Georgia, and Virginia established a system of Congressional district agricultural schools. The states of Arkansas and Oklahoma set up similar systems. These schools only lasted a short time but had a great influence on the development of agricultural education, cooperative extension, and public education in general. The purpose of this dissertation is to document the establishment and accomplishments of Congressional district agricultural schools in the United States with an emphasis on Virginia. An overview of the agricultural schools in states other than Virginia is provided. The events leading to the development of such schools in Virginia are described as well as the statutory establishment. Finally, the researcher has described the 11 Virginia Congressional district agricultural schools and their accomplishments are documented.   A careful review of related material was conducted. The major outcomes of this study are as follows. First, the study provides historical documentation of the Virginia Congressional district agricultural schools. Secondly the study explores the strong programming partnership that developed between extension and the Congressional district agricultural schools in Virginia. Lastly, the study highlights the importance of the Congressional district agricultural schools in the foundational development of the public school system, the cooperative extension program, and vocational education in Virginia.",
  "description_provenance": [
    "Author Email: cmsutph@vt.edu",
    "Advisor Email: birdfcd",
    "Advisor Email: daisys",
    "Advisor Email: wgcamp",
    "Advisor Email: hillison",
    "Advisor Email: bmeadows",
    "Made available in DSpace on 2014-03-14T20:11:59Z (GMT). No. of bitstreams: 1 cmsfd.PDF: 1731694 bytes, checksum: 8f165e8c16ea248dedff9d9e1e2b6bc2 (MD5)   Previous issue date: 1999-05-03"
  ],
  "handle": "27689",
  "identifier_other": "etd-051299-134910",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-051299-134910/",
  "identifier_uri": "http://hdl.handle.net/10919/27689",
  "publisher": "Virginia Tech",
  "relation_haspart": "cmsfd.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "secondary education",
    "vocational education",
    "extension",
    "agricultural education",
    "4-H"
  ],
  "title": "History of Virginia Congressional District Agricultural High Schools",
  "type": "Dissertation"
}