{
  "contributor_author": "Lozano, Brian Edward",
  "contributor_committeechair": "Stephens, Robert S.",
  "contributor_committeemember": [
    "Clum, George A. Jr.",
    "Hauenstein, Neil M. A.",
    "Cooper, Lee D."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:11:59Z",
  "date_adate": "2008-06-04",
  "date_available": "2014-03-14T20:11:59Z",
  "date_issued": "2008-04-29",
  "date_rdate": "2009-06-04",
  "date_sdate": "2008-05-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The effects of setting goals on goal commitment and goal achievement in the context of an alcohol use intervention were examined using an experimental design in which participants were randomly assigned to participatively-set goals, assigned goals, and no goal conditions. The current study provides information regarding the links between degree of participation in goal setting, goal commitment, self-efficacy for oneâ  s goal, subsequent alcohol use, and goal achievement. It was hypothesized that: 1) Goal setting and participation in goal setting would significantly predict alcohol use outcomes: a) having a goal for alcohol consumption would cause lower quantity and frequency of alcohol use relative to not having a goal; b) participation in goal setting, rather than being assigned a goal, would influence goal achievement such that participation in goal setting would cause greater success in achieving oneâ  s goal. 2) Participation in goal setting would influence goal commitment such that participation in goal setting would cause greater goal commitment. 3) Goal commitment would influence goal achievement such that greater goal commitment would be predictive of greater success in achieving oneâ  s goal. 4) The facilitative effect of participation in goal setting on subsequent goal achievement would be mediated by goal commitment. 5) Self-efficacy for oneâ  s goal would influence goal achievement such that greater self-efficacy for oneâ  s goal would be predictive of greater success in achieving oneâ  s goal.  One hundred and twenty-six binge-drinking college students received a single cognitive-behavioral assessment/intervention session and completed measures of goal commitment, self-efficacy for goal achievement, and alcohol use. Results were consistent with, and expanded upon, previous research by demonstrating that having a goal for alcohol consumption was predictive of lower quantity and frequency of alcohol use relative to not having a goal; however, participation in goal setting did not result in significantly better alcohol use outcomes or greater goal achievement relative to when goals were assigned. Participation in goal setting yielded greater goal commitment and self-efficacy for goal achievement than assigned goals. Lastly, goal commitment and self-efficacy contributed unique variance to the prediction of goal achievement across follow-up as well as changes in quantity and frequency of alcohol use at follow-up after controlling for baseline use.",
  "description_provenance": [
    "Author Email: blozano@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:59Z (GMT). No. of bitstreams: 1 LozanoDissertationETD.pdf: 433159 bytes, checksum: eeb157b5e5970345346215942de49d4b (MD5)   Previous issue date: 2008-04-29"
  ],
  "handle": "27694",
  "identifier_other": "etd-05132008-110653",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05132008-110653/",
  "identifier_uri": "http://hdl.handle.net/10919/27694",
  "publisher": "Virginia Tech",
  "relation_haspart": "LozanoDissertationETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "college drinking",
    "alcohol",
    "social cognitive theory",
    "goal setting"
  ],
  "title": "Comparison of Participatively-set and Assigned Goals in the Reduction of Alcohol Use",
  "type": "Dissertation"
}