{
  "contributor_author": "Richmond, Doug",
  "contributor_committeecochair": [
    "Barksdale, Mary Alice",
    "Potter, Kenneth R."
  ],
  "contributor_committeemember": [
    "Falls, Jane Ann",
    "Cross, Lawrence H.",
    "Lockee, Barbara B."
  ],
  "contributor_department": "Instructional Technology",
  "date_accessioned": "2014-03-14T20:11:59Z",
  "date_adate": "2007-05-25",
  "date_available": "2014-03-14T20:11:59Z",
  "date_issued": "2007-05-04",
  "date_rdate": "2008-05-25",
  "date_sdate": "2007-05-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research study focused on learning lessons from the experience of designing a comprehensive case-based reasoning (CBR) tool for support of complex thinking skills. Theorists have historically identified, analyzed, and classified different thinking processes and skills. Thinking skills have been increasingly emphasized in national standards, state testing, curricula, teaching and learning resources, and research agendas. Complex thinking is the core of higher-order thinking. Complex thinking is engaged when different types of thinking and action converge to resolve a real-world, ill-structured issue such as solving a problem, designing an artifact, or making a decision. By integrating reasoning, memory, and learning in a model of cognition for learning from concrete problem-solving experience, CBR can be used to engage complex thinking. In similar and different ways, CBR theory and the related theories of constructivism and constructionism promote learning from concrete, ill-structured problem-solving experience. Seven factors or characteristics, and by extension, design requirements, that should be incorporated in a comprehensive CBR tool were extracted from theory. These requirements were consistent with five theory-, research-based facilitators of learning from concrete experience. Subsequent application of the Dick, Carey, and Carey model to these design requirements generated twenty-nine specifications for design of the tool. This research study was carried out using developmental research methodology and a standard development model. The design process included front-end analysis, creating a prototype of the tool, and evaluating the prototype.",
  "description_provenance": [
    "Author Email: dr@vt.edu",
    "Advisor Email: mab@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: jfalls@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:11:59Z (GMT). No. of bitstreams: 1 DougRichmondETD070523.pdf: 1418901 bytes, checksum: 3454baacae97149b8dde9a622e1b1058 (MD5)   Previous issue date: 2007-05-04"
  ],
  "handle": "27693",
  "identifier_other": "etd-05132007-232159",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05132007-232159/",
  "identifier_uri": "http://hdl.handle.net/10919/27693",
  "publisher": "Virginia Tech",
  "relation_haspart": "DougRichmondETD070523.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "complex thinking skills",
    "developmental research",
    "relational database",
    "case-based reasoning (CBR)",
    "performance support tools",
    "World Wide Web"
  ],
  "title": "Lessons Learned from Designing a Comprehensive Case- Based Reasoning (CBR) Tool for Support of Complex Thinking",
  "type": "Dissertation"
}