{
  "contributor_author": "Brown, Michael Carey",
  "contributor_committeechair": "Weyers, Richard E.",
  "contributor_committeemember": [
    "Corcoran, Sean Gerald",
    "Dillard, John G.",
    "Cousins, Thomas E.",
    "Sprinkel, Michael M.",
    "Sagues, Alberto A."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:11:59Z",
  "date_adate": "2002-05-21",
  "date_available": "2014-03-14T20:11:59Z",
  "date_issued": "2002-05-03",
  "date_rdate": "2003-05-21",
  "date_sdate": "2002-05-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The corrosion protection service life extension provided by epoxy-coated reinforcement (ECR) was determined by comparing ECR and bare bar from 10 bridge decks built between 1981 and 1995.  The objective was to determine the corrosion protection service life time extension provided by ECR field specimens with various degrees of coating adhesion: disbonded, partially disbonded, and wholly bonded coatings. The size and length distributions of cracks in Virginia bridge decks were investigated to assess the frequency and severity of cracks.  Correlation of cracks with chloride penetration was used to characterize the influence of cracking on deck deterioration.  Cracks influence the rate of chloride penetration, but the frequency and width distributions of cracks indicate that cracks are not likely to shorten the overall service life of most bridge decks in Virginia. Altogether, 141 drilled cores, 102 mm (4 inches) in diameter, were employed in this study.  For each of the decks built with ECR, 10 to 12 cores were drilled through a top reinforcing bar adjacent to the previous study core locations.  In addition, approximately 3 cores were drilled through a top reinforcing bar at a surface crack location.  Laboratory testing involved nondestructive monitoring using advanced electrochemical techniques to periodically assess the corrosion state of the steel bars during cyclic exposure to chloride-rich solution over 22 months of treatment.  Time of corrosion initiation and time of cracking (where applicable), as well as chloride content of the concrete before and after treatment, were used in the analysis.  Less than 25 percent of all Virginia bridge decks built under specifications in place since 1981 is projected to corrode sufficiently to require rehabilitation within 100 years, regardless of bar type.  The corrosion service life extension attributable to ECR in bridge decks was found to be approximately 5 years beyond that of bare steel.",
  "description_provenance": [
    "Author Email: mibrown7@vt.edu",
    "Advisor Email: sgc@vt.edu",
    "Advisor Email: rweyers@vt.edu",
    "Advisor Email: john.dillard@vt.edu",
    "Advisor Email: tcousins@vt.edu",
    "Advisor Email: Michael.Sprinkel@VirginiaDOT.org",
    "Advisor Email: sagues@eng.usf.edu",
    "Made available in DSpace on 2014-03-14T20:11:59Z (GMT). No. of bitstreams: 1 MCBrownDissertation.pdf: 2300007 bytes, checksum: bd806e9a4513c37796e71d9192ceaed2 (MD5)   Previous issue date: 2002-05-03"
  ],
  "handle": "27690",
  "identifier_other": "etd-05132002-120642",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05132002-120642/",
  "identifier_uri": "http://hdl.handle.net/10919/27690",
  "publisher": "Virginia Tech",
  "relation_haspart": "MCBrownDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "corrosion",
    "epoxy coating",
    "concrete",
    "reinforcement",
    "impedance",
    "service life"
  ],
  "title": "Corrosion Protection Service Life of Epoxy Coated Reinforcing Steel in Virginia Bridge Decks",
  "type": "Dissertation"
}