{
  "contributor_author": "Apostolakis, Roberta",
  "contributor_committeecochair": [
    "Belli, Gabriella M.",
    "Lalik, Rosary V."
  ],
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Renard, Paul D."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:00Z",
  "date_adate": "2009-06-09",
  "date_available": "2014-03-14T20:12:00Z",
  "date_issued": "2009-05-05",
  "date_rdate": "2009-06-09",
  "date_sdate": "2009-05-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This study is an investigation of teachersâ   perspectives on coaching activities and styles of feedback language used by literacy coaches. Because literacy coaching processes represent a common approach to school-based teacher learning, it is wise to examine their usefulness. The teachers being coached have a key role in shaping and informing the coaching process. Their thoughts on helpful coaching activities and feedback language are important and could enlighten stakeholders in professional development of teachers. The data collection tools for this study included teacher questionnaires and a video-taped session with a focus group of elementary education teachers. The main findings were that teachers perceived literacy coaching activities, especially co-teaching and visiting colleagues, most helpful to construct conceptual and procedural knowledge when they include opportunities for on-going collaboration, teacher autonomy, and active construction of knowledge, and when they occur in classrooms settings with practice and feedback. These findings have implications for why and how educators do professional development in schools.",
  "description_provenance": [
    "Author Email: rapostolak@aol.com",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: rlalik@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: prenard@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:00Z (GMT). No. of bitstreams: 1 apostolakis.pdf: 698125 bytes, checksum: 87aea2c41843b3ab7bd0551cf0ed6bde (MD5)   Previous issue date: 2009-05-05"
  ],
  "handle": "27698",
  "identifier_other": "etd-05132009-202250",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05132009-202250/",
  "identifier_uri": "http://hdl.handle.net/10919/27698",
  "publisher": "Virginia Tech",
  "relation_haspart": "apostolakis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "literacy coaching activities",
    "feedback language"
  ],
  "title": "Literacy Coaching: Approaches, Styles, and Conversations",
  "type": "Dissertation"
}