{
  "contributor_author": "Johnson, Jacqueline Evans",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Mallory, Walter D.",
    "Salmon, Richard G.",
    "Alexander, Patricia S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:11:59Z",
  "date_adate": "2008-07-02",
  "date_available": "2014-03-14T20:11:59Z",
  "date_issued": "2008-04-30",
  "date_rdate": "2008-07-02",
  "date_sdate": "2008-05-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Jackie Johnson Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p align=\"left\">The purpose of this study was to investigate the dynamics of bullying behaviors of parents towards teachers in the workplace-the school. The topic of parent bullying is under-researched, thus, this study seeks to address and examine the gap in the research. The target population of 130 teachers was taken from a Mid-Atlantic State in suburban Excellence High School . Teachers were provided a survey questionnaire to investigate the extent to which confrontational parents try to bully teachers. Teachers (117) served as respondents and used survey methodology to record their responses. An exploratory, descriptive and confirmatory analysis was used to answer the research questions posed. Specifically, this study sought to answer the following five questions: (1) What types of parent bullying behaviors at school do teachers experience? In what form and how often? (2) What consideration has been given to leaving the teaching profession after a parent-bullying episode? (3) What types of parent bullying behaviors are seen as subtle or blatant by teachers? (4) What triggers initiate a parent-bullying incident? (5) Do teachers' experiences of bullying parents vary according to age, gender, ethnicity, grade level and teaching experience? Nine types of parent behaviors and the demographic variables of teachers were compared which included the teacher's age, gender, ethnicity, number of years of teaching experience, and the teachers' current teaching level were compared. Face-to-face survey administration was used to collect the data. Statistical procedures were conducted and included: One Way ANOVA, Cronbach's Alpha Test for Reliability, and Chi Square . Frequency and percentages were calculated to determine the statistical significance of the findings. </p> <p align=\"left\">The findings indicated a statistical significance between physical assault and male teachers. Further, statistical significance was revealed between property vandalism and gender of teacher, ethnicity, and age variables. Teachers are more likely to be verbally abused by parents ho try to confront teachers. Bullying incidents most often occurred on the Internet, classroom, or school office. Triggers that caused confrontation that indicted statistical significance were: (1) student removal of a student from a sports team, (2) had homework issues, (3) showed low grades on a report card, (4) low scores on a test, and (5) low attendance rates. Teachers reported blatant, out in the open, and in your face behaviors to describe the bullying incident committed by parents. However, despite encountering incidents of bullying by parents, teachers did not consider leaving the profession. Almost half of the teachers surveyed reported experiencing some form of abuse directed toward them by a parent. </p> </body> </html>",
  "description_provenance": [
    "Author Email: jajohns6@vt.edu",
    "Advisor Email: twiford@vt.edu",
    "Advisor Email: mmallory@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: palexander@reynolds.ccs.edu",
    "Made available in DSpace on 2014-03-14T20:11:59Z (GMT). No. of bitstreams: 1 JackieJohnsonETD.pdf: 940407 bytes, checksum: ebb12faaf3e56afc726d8785eec1e28e (MD5)   Previous issue date: 2008-04-30"
  ],
  "handle": "27695",
  "identifier_other": "etd-05132008-143141",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05132008-143141/",
  "identifier_uri": "http://hdl.handle.net/10919/27695",
  "publisher": "Virginia Tech",
  "relation_haspart": "JackieJohnsonETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "aggression",
    "bullying",
    "confrontational",
    "and workplace bullying"
  ],
  "title": "DO PARENTS TRY TO BULLY TEACHERS THROUGH CONFRONTATION?",
  "type": "Dissertation"
}