{
  "contributor_author": "Nunley, Robyn Suzanne",
  "contributor_committeechair": "Johnson, Scott W.",
  "contributor_committeemember": [
    "Keeling, Margaret L.",
    "McWey, Lenore M.",
    "Galway, Alison"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:12:00Z",
  "date_adate": "2010-06-07",
  "date_available": "2014-03-14T20:12:00Z",
  "date_issued": "2010-04-30",
  "date_rdate": "2010-06-07",
  "date_sdate": "2010-05-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In the past decade the push for utilization of evidence-based practice (EBP) in mental health has increased dramatically.  Due to managed healthcare, lowered spending on state and federal mental health budgets, and requirements by funding agencies such as Medicaid, it is imperative that mental health clinicians (MHCs) be trained in and utilize EBPs to improve funding and ensure continuity of best practice in clinical interventions with clients.  Minimal research exists on MHCs and their knowledge and use of EBPs.  The present study examined MHCsâ   perceptions, knowledge, training, and utilization of EBPs, with a specific focus on Dialectical Behavior Therapy (DBT).  To date, it is the most prominent and effective EBP for treating Borderline Personality Disorder (BPD) and associated parasuicidal and suicidal behaviors.  Current research supports its effectiveness in treating a myriad of other commonly treated disorders.   The exploratory study provides insight into MHCs level of interest in receiving more EBP awareness and DBT training.  Results indicate that though clinicians have received training in EBP and DBT, most of that training has been encouraged through career settings.  Age of the clinician, years in practice, and type of training background are predictors of level of education, knowledge and training.  Results show the majority of clinicians are interested in EBP, aware of the impact EBP can have on treatment effects, and report desire to have more training in EBPs and DBT specifically.  These results could provide a necessary bridge between disciplines to allow clinicians, irrespective of training, to provide the most clinically effective treatments to clients.",
  "description_provenance": [
    "Author Email: nunleyrs@yahoo.com",
    "Advisor Email: mkeeling@vt.edu",
    "Advisor Email: lmcwey@fsu.edu",
    "Advisor Email: swj@vt.edu",
    "Advisor Email: agalway@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:00Z (GMT). No. of bitstreams: 1 NUNLEY_RS_D_2010.pdf: 654932 bytes, checksum: 9437f47ee1d37ad91f966cc6bda05152 (MD5)   Previous issue date: 2010-04-30"
  ],
  "handle": "27699",
  "identifier_other": "etd-05132010-214845",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05132010-214845/",
  "identifier_uri": "http://hdl.handle.net/10919/27699",
  "publisher": "Virginia Tech",
  "relation_haspart": "NUNLEY_RS_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Dialectical Behavior Therapy",
    "Marriage and Family Therapy",
    "Evidence Based Practice"
  ],
  "title": "Mental Health Cliniciansâ   Perceptions, Knowledge, Level of Training, and Utilization of Evidence Based Practices with a Specific Focus on Dialectical Behavior Therapy",
  "type": "Dissertation"
}