{
  "contributor_author": "Orsburn, Benjamin",
  "contributor_committeechair": "Popham, David L.",
  "contributor_committeemember": [
    "Chen, Jiann-Shin",
    "Melville, Stephen B.",
    "Lazar, Iuliana M."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:12:00Z",
  "date_adate": "2009-06-09",
  "date_available": "2014-03-14T20:12:00Z",
  "date_issued": "2009-05-04",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-05-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The bacterium Clostridium perfringens is a gram-positive anaerobe responsible for many diseases in man and other animals, the most common of which is acute food poisoning (AFP).  It is estimated that nearly 240,000 cases of AFP occur each year in the U.S.  The C. perfringens spore plays an important role in this infection.  The heat resistance of the spore allows the organism to survive the cooking process, grow in the cooling food, and infect the victim.  Despite the occurrence of this disease and the importance of the spore to this process, little work has been performed to determine how heat resistance is obtained and maintained by C. perfringens spores.  <p> \tIn this work we study the spores and sporulation process of C. perfringens to determine what factors are most important in the formation of a heat resistant spore.  We analyzed the spores produced by nine wild-type strains, including five heat-resistant food poisoning isolates and four less heat-resistant environmental isolates.  We determined that threshold core density and a high ratio of cortex peptidoglycan relative to germ cell wall were necessary components of a highly heat-resistant spore.  In order to test these observations, we constructed two mutant strains.  The first could not achieve the necessary level of core dehydration and rapidly lysed in solution.  The second mutant had a reduced amount of cortex relative to germ cell wall, and suffered a corresponding decrease in heat resistance as compared to our wild-type strains.  The mutant strains supported the observations drawn from our wild-type strains.<p> \tDipicolinic acid is a major component of bacterial spores and is necessary for spore heat resistance.  The Cluster I clostridia, including C. perfringens, lack the known DPA synthase operon, spoVF.  We developed an in vitro assay for detecting DPA synthetase activity and purified the active enzyme from sporulating C. perfringens crude extract and identified the proteins with mass spectrometry.  These results identified the electron transfer flavoprotein alpha chain (EtfA) as the DPA synthase of C. perfringens.  Inactivating the etfA gene in C. perfringens resulted in a strain that could begin, but not complete, the sporulation process and produced dramatically lower amounts of DPA than the wild-type.  The purified enzyme was shown to produce DPA in vitro and utilized FAD as a preferred cofactor.  <p> \tThe results of this research may lead to future techniques to decrease the occurrence of the diseases caused by C. perfringens spores and treatments which may carry over to the diseases caused by similar organisms.",
  "description_provenance": [
    "Author Email: orsburn@vt.edu",
    "Advisor Email: chenjs@vt.edu",
    "Advisor Email: dpopham@vt.edu",
    "Advisor Email: melville@vt.edu",
    "Advisor Email: lazar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:00Z (GMT). No. of bitstreams: 1 Orsburn_ETD.pdf: 3204492 bytes, checksum: 2397639e41903106b511bc67c1c0cf95 (MD5)   Previous issue date: 2009-05-04"
  ],
  "handle": "27697",
  "identifier_other": "etd-05132009-140845",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05132009-140845/",
  "identifier_uri": "http://hdl.handle.net/10919/27697",
  "publisher": "Virginia Tech",
  "relation_haspart": "Orsburn_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "heat resistance",
    "Clostridium perfringens",
    "food poisoning",
    "sporulation"
  ],
  "title": "Factors Affecting the Heat Resistance of Clostridium perfringens Spores",
  "type": "Dissertation"
}