{
  "contributor_author": "Grace, Patricia Elizabeth",
  "contributor_committeechair": "Kaufman, Eric K.",
  "contributor_department": "Agricultural and Extension Education",
  "date_accessioned": "2014-03-14T20:12:00Z",
  "date_adate": "2011-05-18",
  "date_available": "2014-03-14T20:12:00Z",
  "date_issued": "2011-04-29",
  "date_rdate": "2011-05-18",
  "date_sdate": "2011-05-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Effects of Storytelling on Worldview and Attitudes toward Sustainable Agriculture Patricia E. Grace ABSTRACT There is evidence that the American agrifood system is a significant contributor to environmental, economic, social, and ethical-animal welfare damage to the earth and to society and is unsustainable, yet the worldview of a substantial percentage of the population conflicts with this assessment.  A significant number of researchers, non-governmental organizations, and government entities assert that the detrimental effects of industrial agriculture must be addressed without delay and sustainable agricultural practices implemented.  The transition from industrial to sustainable agriculture will not be a simple one.  Attempting to change a worldview is not an easy task.  A growing body of research in other disciplinary areas suggests that storytelling can serve as an effective method of fostering change.  This mixed-methods study examines the role of storytelling in effecting positive change in worldview and attitudes toward sustainable agriculture.  A review of the related literature revealed that no instrument was available to measure attitudes toward sustainable agriculture with consideration of economic, environmental, social, and ethical-animal welfare dimensions.  The first objective of the study, therefore, was to design such an instrument.  The instrument is called The Sustainable Agriculture Paradigm Scale and is used as a pre and post-test in the study.  A number of open-ended questions were added to the post-test to solicit qualitative data.  The study explores the effects of Story-based, that is, a told story and a read story, versus Information-based treatments, that is, a lecture and a read factsheet, on effecting positive change in attitudes toward sustainable agriculture.  The   qualitative data provides a secondary, supportive role exploring what characteristics of a story are associated with change.  The hypothesis of the study is that Story-based treatments will be more effective in promoting positive change than will Information-based treatments.  The findings of the study provide evidence supporting this hypothesis.  The story characteristics found to be associated with positive change included: first-hand personal view, vivid description, and identification with the narrator.",
  "description_provenance": [
    "Author Email: pegrace@vt.edu",
    "Advisor Email: ekaufman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:00Z (GMT). No. of bitstreams: 2 Grace_PE_D_2011.pdf: 6040471 bytes, checksum: aaaadc5f91c3171397322191e6a2c5f1 (MD5) Grace_PE_D_2011_Copyright.pdf: 418523 bytes, checksum: 058a38cf9d619830f3c2620d81bc77c9 (MD5)   Previous issue date: 2011-04-29"
  ],
  "handle": "27700",
  "identifier_other": "etd-05132011-144402",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05132011-144402/",
  "identifier_uri": "http://hdl.handle.net/10919/27700",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Grace_PE_D_2011.pdf",
    "Grace_PE_D_2011_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Storytelling",
    "Narrative",
    "Social Change",
    "Sustainable Agriculture",
    "Drama Theory"
  ],
  "title": "The Effects of Storytelling on Worldview and Attitudes toward Sustainable Agriculture",
  "type": "Dissertation"
}