{
  "contributor_author": "Horton, James Edward",
  "contributor_committeechair": "Crawford, Helen J.",
  "contributor_committeemember": [
    "Downs, J. Hunter III",
    "Franchina, Joseph J.",
    "Bell, Martha Ann",
    "Stephens, Robert S.",
    "Prestrude, Albert M."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:12:01Z",
  "date_adate": "1999-05-15",
  "date_available": "2014-03-14T20:12:01Z",
  "date_issued": "1999-04-19",
  "date_rdate": "2000-05-15",
  "date_sdate": "1999-05-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Hypnotizability and Corpus Callosum Morphology By James E. Horton Committee Chair: Helen J. Crawford, Ph.D. Department of Psychology  (Abstract)  In general, highly hypnotizable individuals (\"highs\") have exhibited greater abilities to focus attention and inhibit pain than low hypnotizable individuals (\"lows\").  Furthermore, highs appear to have faster neural processing than lows.  The present study investigated differences between lows and highs in morphological volume of some brain structures associated with inhibitory and excitatory neural processing, particularly the corpus callosum (CC).  Participants were 18 healthy university students, aged 18 to 29, with no history of concussion or medical disorders.  They were in a functional Magnetic Resonance Image (fMRI) study examining the neurophysiology of pain and hypnotic analgesia (Crawford, Horton, Harrington, et al., 1998; Downs et al., 1998).  As assessed by the group version (Crawford & Allen, 1982) of the Stanford Hypnotic Susceptibility Scale, Form C (SHSS:C; Weitzenhoffer & Hilgard, 1962), there were eight highs (four women and four men; SHSS:C M = 11.0) and 10 lows (five men and five women; SHSS:C M = 2.1).  Highs were able to successfully eliminate perception of pain and distress to experimental noxious stimuli.  Their anatomical MRIs were measured to assess relationships between brain structure volume (CC, medial cortex, anterior brain regions) and hypnotizability.  In comparison to lows, highs had a significantly larger CC volume in the rostrum and isthmus, inferred to reflect larger transcallosal axon diameter or greater axon myelination.  For highs, but not lows, there were significant relationships between forebrain volume and the total CC, rostrum, and splenium.  Findings provide support for the neuropsychophysiological model of Crawford and her associates (e.g. Crawford, 1994a, 1994b; Crawford & Gruzelier, 1992) proposing a more effective attentional system of inhibitory processes in highs than lows.  Furthermore, the data suggest that the more effective systems of attentional and inhibitory processes enhanced neural processing speed, and interhemispheric transfer times seen in highs than lows, may be associated with morphological differences in certain anterior and posterior CC regions.  These regions are known to be involved in the allocation of inhibitory and excitatory transfer of information between hemispheres.",
  "description_provenance": [
    "Author Email: j_horton@clinch.edu",
    "Advisor Email: downs@virginia.edu",
    "Advisor Email: jjfranch@vt.edu",
    "Advisor Email: hjc@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Advisor Email: alpres@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:01Z (GMT). No. of bitstreams: 1 NEWCCMORPH.PDF: 310793 bytes, checksum: b75b6b186b96660cd94f839ecbd4d581 (MD5)   Previous issue date: 1999-04-19"
  ],
  "handle": "27703",
  "identifier_other": "etd-051399-164549",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-051399-164549/",
  "identifier_uri": "http://hdl.handle.net/10919/27703",
  "publisher": "Virginia Tech",
  "relation_haspart": "NEWCCMORPH.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Hypnotic Analgesia",
    "Hypnotizability",
    "Attention",
    "Morphology",
    "Corpus Callosum",
    "Pain",
    "Magnetic Resonance Images",
    "Frontal lobe",
    "Anterior Cingulate",
    "Psychology",
    "Functional Magnetic Resonance Imaging"
  ],
  "title": "Hypnotizability and Corpus Callosum Morphology",
  "type": "Dissertation"
}