{
  "contributor_author": "Goodwin, Annabelle Michelle",
  "contributor_committeecochair": [
    "Kaestle, Christine E.",
    "Piercy, Fred P."
  ],
  "contributor_committeemember": [
    "Allen, Katherine R.",
    "Dolbin-MacNab, Megan L."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:12:00Z",
  "date_adate": "2011-08-17",
  "date_available": "2014-03-14T20:12:00Z",
  "date_issued": "2011-05-03",
  "date_rdate": "2011-08-17",
  "date_sdate": "2011-05-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this study, I explore the ways in which feminist family therapists encourage exploration of, resistance to, and collusion with, oppression. I explore qualitatively the critical dialogues, both inner, and with others, that feminist family therapists employ to address oppressive systems. My research questions are: a. How do family therapists who identify as feminist describe how their feminist identities and ideas about feminism have evolved over time? b. How do feminist family therapists report stories of their own resistance to gender-based oppression? c. How do feminist family therapists report stories of their own collusion with the oppression of others? And d. How do feminist family therapists encourage clients to examine oppression and collusion of oppression of others? I use tape-recorded, one-on-one interviews with a theoretical sample of self-identified feminist participants who have demonstrated rigorous attention to feminist inquiry and practice in the field of family therapy. Consistent with a contemporary grounded theory methodology, generation of theory is based on constructivist methods, which recognize that there are multiple coexisting realities and not one objective truth (Charmaz, 2000). By way of constructivist grounded theory analysis the following four categories emerged: (a) Actions and Strategies of a Feminist Family Therapist, (b) Itâ  s a Sensibility: The Development of a Feminist Identity, (c) Recognizing Oppression and Injustice: A Quest for Liberation and (d) Resisting: Exploring Why, How, and at the Risk of Which Consequences.",
  "description_provenance": [
    "Author Email: goodwina@vt.edu",
    "Advisor Email: keaestle@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: mdolbinm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:00Z (GMT). No. of bitstreams: 1 Goodwin_AG_D_2011.pdf: 474403 bytes, checksum: 3e30e5ff1f11cfc74649ac9a725e800d (MD5)   Previous issue date: 2011-05-03"
  ],
  "handle": "27701",
  "identifier_other": "etd-05132011-170157",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05132011-170157/",
  "identifier_uri": "http://hdl.handle.net/10919/27701",
  "publisher": "Virginia Tech",
  "relation_haspart": "Goodwin_AG_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "resistance",
    "oppression",
    "collusion",
    "feminist family therapy"
  ],
  "title": "An Exploration of Feminist Family Therapists' Resistance to and Collusion with Oppression",
  "type": "Dissertation"
}