{
  "contributor_author": "Carter, Michael J.",
  "contributor_committeechair": "Janosik, Steven M.",
  "contributor_committeemember": [
    "Hirt, Joan B.",
    "Creamer, Donald G.",
    "Fortune, Jimmie C.",
    "Parson, Stephen R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:12:01Z",
  "date_adate": "2002-05-21",
  "date_available": "2014-03-14T20:12:01Z",
  "date_issued": "2002-05-02",
  "date_rdate": "2003-05-21",
  "date_sdate": "2002-05-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<body bgcolor=\"#FFFFFF\" text=\"#000000\"> <p>The formula method of allocation was used in the Commonwealth of Virginia to    fund institutions of higher education from 1968 until the recession of 1990.    Prior to the early 1990s recession, operational funding for institutions of    higher education in the Commonwealth was derived from a framework for staffing    guidelines, faculty peer-group benchmarks, and a student tuition policy. Revenue    shortfalls caused by the recession were insufficient to fund the resources demanded    by the guidelines or funding formulas. This led to the discontinuance of the    funding formulas that had guided Virginia's higher education funding for more    than two decades (Report of the Joint Subcommittee on Higher Education Funding    Policies, 1999).</p> <p> The purpose of the study was to find out how and why the decision was made    to discontinue formula funding of institutions of higher education. The decision-making    process at the state level is often complex, uncertain, and difficult. The emphasis    of the study was to examine the rationale for discontinuing formula funding    for resource allocation to institutions of higher education.The study explored    why the Commonwealth of Virginia made this important decision. </p> <p>The subjects of the study are the state-level decision-makers responsible for    funding institutions of higher education in the Commonwealth of Virginia. Information    on how and why the Commonwealth of Virginia reached the decision to discontinue    formula funding could only be obtained by in-depth interviewing of the participants    in the decision-making process. </p> <p>Data were analyzed using the four streams of Cohen and March's decision making    model. Triangulation of the data served as a means of data validation. Conclusions    and recommendations for future study and practice are included. </p> <p>The major findings were that were many complaints regarding the former formula    funding model. The model was a demand driven, rigid input based model that was    not linked directly to state revenues. The model was not mandated by the Code    of Virginia as was K-12 formula. </p> <p>As required with time-sensitive matters, decisions have to be made to address    the issues at hand. The funding formulas were simply discontinued in the face    of adversity. Consensus was basically that the demand driven formulas were the    wrong methodology given the recession and demands for attention in other areas.  </p> </body>",
  "description_provenance": [
    "Author Email: micarte2@vt.edu, mcarter@ph.vccs.edu",
    "Advisor Email: SJanosik@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: fort6278@Bellsouth.net",
    "Advisor Email: parson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:01Z (GMT). No. of bitstreams: 1 carterfinal.pdf: 1035420 bytes, checksum: ef6a61ddd02c15b69f19a91fb1f6997b (MD5)   Previous issue date: 2002-05-02"
  ],
  "handle": "27707",
  "identifier_other": "etd-05142002-114755",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05142002-114755/",
  "identifier_uri": "http://hdl.handle.net/10919/27707",
  "publisher": "Virginia Tech",
  "relation_haspart": "carterfinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Formula Funding",
    "Higher Education Funding",
    "decision making"
  ],
  "title": "A Study of the Discontinuance of Formula Funding of Institutions of Higher Education in the Commonwealth of Virginia",
  "type": "Dissertation"
}