{
  "contributor_author": "Koay, Pei P.",
  "contributor_committeechair": "Burian, Richard M.",
  "contributor_committeemember": [
    "Boler, Megan M.",
    "Luke, Timothy W.",
    "La Berge, Ann F.",
    "Halfon, Saul E."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:12:01Z",
  "date_adate": "2003-05-27",
  "date_available": "2014-03-14T20:12:01Z",
  "date_issued": "2003-04-07",
  "date_rdate": "2006-05-27",
  "date_sdate": "2003-05-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> This dissertation examines the politics of representation in biotechnosciences. Through web representations, I examine three emerging endeavors that propose to create large-scale human population genomic databases to study complex, common diseases and conditions. These projects were initiated in different nations (US, UK, and Iceland), created under different institutional configurations, and are at various stages of development. The websites, which are media technologies do not simply reflect and promote these endeavors. Rather, they help shape these database projects in which the science is uncertain and the technologies not yet built. Thus, they are constitutive technologies that affect the construction of these database projects.  </p><p> More needs to be done to explore how to interpret the 'virtual' realm and how it relates to the 'real' world and specific situations. By bringing hypertextuality into the analysis, I explore how knowledges, practices, and subjectivities are created. By adapting the methods of a number of science and technology (STS) authors, I develop a more dynamic lens in which to investigate web representations and 'emerging' biomedical projects. My concern however, is not only in what represents what, but how representations are constructed. The power of the latter derives from its invisibility.  </p><p> In re-conceptualizing representation and new media technologies, I show that these sites are techno-social spaces for creating knowledge, specific ways of seeing, and practicing biomedicine today. The narrowing time/space between generating data, releasing information, and incorporating publics into their endeavors raises crucial issues as to how biomedicine is represented and how broader audiences are engaged. </p><p>  In the dominant discourses, these projects are all situated within biomedical, (post)genomic, and information revolutions. Here, they hang on the technological object, the database, with the ability to contain what we are coming to understand as life/genetic/bio information. Through the moves of both treating these databases as part of a complex system and investigating them through a lens of representation, I begin to include potential participants and broader audiences into the analysis. Informatic bodies, populations, and subjects are co-created at, by, and through these sites as the developing database projects and information are (re)presented. </p>",
  "description_provenance": [
    "Author Email: pkoay@vt.edu",
    "Advisor Email: rmburian@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:01Z (GMT). No. of bitstreams: 1 KOAYPDISSERTATION.pdf: 3123716 bytes, checksum: 1332b1140bf9346e653a4e5f2395bc4b (MD5)   Previous issue date: 2003-04-07"
  ],
  "handle": "27709",
  "identifier_other": "etd-05142003-233043",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05142003-233043/",
  "identifier_uri": "http://hdl.handle.net/10919/27709",
  "publisher": "Virginia Tech",
  "relation_haspart": "KOAYPDISSERTATION.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "body studies",
    "politics of information",
    "representations of science",
    "cyberspace studies",
    "politics of biomedicine and technoscience",
    "case studies in population genomics and DNA data"
  ],
  "title": "(Re)presenting Human Population Database Projects: virtually designing and siting biomedical informatics ventures",
  "type": "Dissertation"
}