{
  "contributor_author": "Dunton III, James C.",
  "contributor_committeechair": "Heath-Camp, Betty A.",
  "contributor_committeemember": [
    "Finch, Curtis R.",
    "Stewart, Daisy L.",
    "Hutchinson, Susan R.",
    "Connerley, Mary L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:01Z",
  "date_adate": "2001-05-14",
  "date_available": "2014-03-14T20:12:01Z",
  "date_issued": "2001-04-19",
  "date_rdate": "2002-05-14",
  "date_sdate": "2001-05-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to determine what high school principals look for when hiring career and technical teachers, the relative importance of that criteria, and whether certain factors (such as school district size, community size, and years of experience as a principal) affect their opinions toward the selection process. Surveys were mailed to 160 principals and 146 responded, yielding a response rate of 91%. A series of 2-group t-tests and standard regression analyses were used to answer the research questions.  The most desired hiring criteria cited by principals (in order of importance) were enthusiasm, an applicant's ability to communicate effectively, an applicant who is student-centered, an applicant's beliefs on classroom management, and their knowledge of a variety of teaching strategies.",
  "description_provenance": [
    "Author Email: duntonjim@hotmail.com",
    "Advisor Email: heathb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:01Z (GMT). No. of bitstreams: 1 dissertationdunton111.pdf: 179044 bytes, checksum: 203f008f18efb1da851aaba1bf1df41b (MD5)   Previous issue date: 2001-04-19"
  ],
  "handle": "27706",
  "identifier_other": "etd-05142001-144153",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05142001-144153/",
  "identifier_uri": "http://hdl.handle.net/10919/27706",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertationdunton111.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "technical",
    "career",
    "hiring",
    "education"
  ],
  "title": "Selection Criteria Used by High School Principals in Virginia When Hiring First-Year  Career and Technical Education Teachers",
  "type": "Dissertation"
}