{
  "contributor_author": "Seamans, Nancy H.",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Fitzgerald, Mary Ann",
    "Burton, John K.",
    "Nespor, Jan K.",
    "Lockee, Barbara B."
  ],
  "contributor_department": "Instructional Technology",
  "date_accessioned": "2014-03-14T20:12:01Z",
  "date_adate": "2001-05-14",
  "date_available": "2014-03-14T20:12:01Z",
  "date_issued": "2001-04-30",
  "date_rdate": "2002-05-14",
  "date_sdate": "2001-05-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The research problem for this study is focused on the need to know how students acquire and use information. Research indicates a lack of understanding of what students know about information and how they use information and this study used the Information Literacy Competency Standards for Higher Education (Appendix A) as the basis for acquiring a better understanding of what kind of information freshman students at Virginia Tech need and how they acquire it during their first semester at college. Students were asked questions about their information use during fall semester 2000, using both email questioning and in face-to-face interviews. The data collected was used to develop insights into how students acquire and use information and resulted in suggestions that could be used in revising and improving instruction for freshman students that is provided by the University Libraries at Virginia Tech.",
  "description_provenance": [
    "Author Email: nseamans@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:01Z (GMT). No. of bitstreams: 1 Seamans.pdf: 697808 bytes, checksum: c18b2494ab87834f2a69d1042c892c8a (MD5)   Previous issue date: 2001-04-30"
  ],
  "handle": "27705",
  "identifier_other": "etd-05142001-104550",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05142001-104550/",
  "identifier_uri": "http://hdl.handle.net/10919/27705",
  "publisher": "Virginia Tech",
  "relation_haspart": "Seamans.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Information technology - United States",
    "Academic libraries - Aims and objectives",
    "Libraries and education",
    "Information services - United States - User educa",
    "Library orientation for college students",
    "Information retrieval - Study and teaching (Highe",
    "Internet in education"
  ],
  "title": "Information Literacy: A Study of Freshman Students' Perceptions, with Recommendations",
  "type": "Dissertation"
}