{
  "contributor_author": "Barbour Wood, Susan L.",
  "contributor_committeechair": "Kowalewski, Michal",
  "contributor_committeemember": [
    "Read, James Fredrick",
    "Scheckler, Stephen E.",
    "Ward, Lauck W.",
    "Tracy, Robert J."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:12:02Z",
  "date_adate": "2006-06-27",
  "date_available": "2014-03-14T20:12:02Z",
  "date_issued": "2006-04-13",
  "date_rdate": "2009-06-27",
  "date_sdate": "2006-05-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Applications in paleontological research are far from being limited to taxonomic collection and identification.  Nor is such research limited to working solely on fossil data.  Actualistic paleontology is the study of modern or recent organisms and processes to better understand those of the past.  The bulk of this body of research falls under the category of actualistic paleontology, and examines geochronological methods and error biases in dating biological specimens ranging in age from modern to thousands of years old.  Although such methods are arguably not perfect, error rates of ± a few hundred to few thousand years can be extremely important when considering ecological relationships among both Holocene taxa and time-averaged paleocommunities, but quite diminished when considering implications on more traditional dating techniques for ancient strata.  Regardless, understanding implications of time resolution is important in analyses of and comparisons between any biological dataset.  The following chapters are united by quantitative and statistical management of data with varying levels of temporal resolution, and represent four manuscripts that either are in press or soon to be submitted for publication.",
  "description_provenance": [
    "Author Email: sbarbour@vt.edu",
    "Advisor Email: jread@vt.edu",
    "Advisor Email: michalk@vt.edu",
    "Advisor Email: scheckler@vt.edu",
    "Advisor Email: lwward@vmnh.net",
    "Advisor Email: rtracy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:02Z (GMT). No. of bitstreams: 1 ETD60706.pdf: 1716675 bytes, checksum: ec6b6c6eb2ce4b67a7d665802c8b6614 (MD5)   Previous issue date: 2006-04-13"
  ],
  "handle": "27710",
  "identifier_other": "etd-05142006-181015",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05142006-181015/",
  "identifier_uri": "http://hdl.handle.net/10919/27710",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD60706.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "radiocarbon dating",
    "brachiopods",
    "Bouchardia",
    "mollusks",
    "Semele",
    "Holocene",
    "Quaternary",
    "Brazil",
    "Ubatuba Bay",
    "reservoir age",
    "taphonomy",
    "time averaging",
    "Atlantic Coastal Plain",
    "Miocene",
    "Pliocene",
    "Eastover",
    "Cobham Bay",
    "Yorktown",
    "Sunken Meadow",
    "aspartic",
    "Amino acid racemization",
    "paleoecology",
    "gradient",
    "ordination"
  ],
  "title": "Quantitative Ecological and Taphonomic Patterns in Late Cenozoic Mollusk-Dominated Marine Fossil Assemblages",
  "type": "Dissertation"
}