{
  "contributor_author": "Cashion, Matthew Paul",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "Moore, Robert B.",
    "Turner, S. Richard",
    "Davis, Richey M.",
    "Madsen, Louis A."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:12:03Z",
  "date_adate": "2009-06-11",
  "date_available": "2014-03-14T20:12:03Z",
  "date_issued": "2009-04-30",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-05-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "For the first time nonwoven fibrous scaffolds were electrospun from a low molar mass gemini ammonium surfactant, N,Nâ  -didodecyl-N,N,Nâ  ,Nâ  -tetramethyl-N,Nâ  -ethanediyl-di-ammonium dibromide (12-2-12).  Cryogenic transmission electron microscopy (cryo-TEM) and solution rheological experiments revealed micellar morphological transitions of 12-2-12 in water and water:methanol (1:1 vol).  Electrospinning efforts of 12-2-12 from water did not produce fibers at any concentration, however, electrospinning 12-2-12 in water:methanol at concentrations greater than 2C* produced, hydrophilic continuous fibers with diameters between 0.9 and 7 Î¼m.<p> Photo-reactive surfactants were synthesized to electrospin robust surfactant membranes.  Before electrospinning it was important to fundamentally understand the structure-property relationship of gemini surfactants.  The thermal and solution properties were explored for a series of ammonium gemini surfactants using differential scanning calorimetry (DSC), polarized light microscopy (PLM), and conductivity experiments.  The Kraft temperature (Tk) was measured in water and water:methanol (1:1 vol) to investigate the influence of solvent on the surfactant solution properties.<p> Other experiments investigate how associated photo-curable architectures are applicable in macromolecular architectures, to gain a fundamental understanding of how hydrogen bonding associations influence the photo-reactivity of functionalized acrylic copolymers.  Novel hot melt pressure sensitive adhesives (HMPSAs) were developed from acrylic terpolymers of 2-ethylhexyl acrylate (EHA), 2-hydroxyethyl acrylate (HEA), and methyl acrylate (MA) functionalized with hydrogen bonding and photo-reactive functionalities.  The synergy of hydrogen bonding and photo-reactivity resulted in higher peel values and rates of cinnamate photo-reactivity with increasing urethane concentration.  <p> Random copolymers of poly(n-butyl acrylate (nBA)-co-2-hydroxyethyl methacrylate (HEMA)) were functionalized with hydrogen bonding and photo-reactive groups to explore the photo-curing of associated macromolecular architectures.  The influence of urethane hydrogen bonding on the photo-reactivity of cinnamate-functionalized acrylics was investigated with photo-rheology and UV-vis spectroscopy.  Cinnamate-functionalized samples displayed an increase in modulus with exposure time, and the percentage increase in modulus decreased as the urethane content increased.  The synergy of hydrogen bonding and photo-reactive groups resulted in higher rates of cinnamate photo-reactivity with increasing urethane concentration.<p> Electrospun fibers were in situ photo-crosslinked to develop fibrous membranes from cinnamate functionalized low Tg acrylics.  Electrospinning was conducted approximately 55 Â°C above the Tg of the cinnamate acrylate and the electrospun fibers did not retain their fibrous morphology without photo-curing.  However, electrospun fibers were collected that retained their fibrous morphology and resisted flow when in situ photo-cured during electrospinning.  The intermolecular photo-dimerization of cinnamates resulted in a network formation that prevented the low Tg cinnamate acrylate from flowing.",
  "description_provenance": [
    "Author Email: mcashion@vt.edu",
    "Advisor Email: rbmoore3@vt.edu",
    "Advisor Email: srturner@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: lmadsen@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:03Z (GMT). No. of bitstreams: 1 MatthewCashionDissertation.pdf: 6415351 bytes, checksum: 277bb340c370ed1b5c7dc9a5b9735807 (MD5)   Previous issue date: 2009-04-30"
  ],
  "handle": "27714",
  "identifier_other": "etd-05142009-143351",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05142009-143351/",
  "identifier_uri": "http://hdl.handle.net/10919/27714",
  "publisher": "Virginia Tech",
  "relation_haspart": "MatthewCashionDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "photo-curing",
    "gemini surfactants",
    "n-butyl acrylate",
    "2-hydroxyethyl acrylate",
    "cinnamate",
    "hydrogen bonding",
    "adhesives",
    "electrospinning",
    "photo-rheology"
  ],
  "title": "Photo-reactive Surfactant and Macromolecular Supramolecular Structures",
  "type": "Dissertation"
}