{
  "contributor_author": "Williams, Josh Holbrook",
  "contributor_committeechair": "Geller, E. Scott",
  "contributor_committeemember": [
    "Finney, Jack W.",
    "Donovan, John J.",
    "Hauenstein, Neil M. A.",
    "Foti, Roseanne J."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:12:03Z",
  "date_adate": "1999-05-20",
  "date_available": "2014-03-14T20:12:03Z",
  "date_issued": "1999-05-05",
  "date_rdate": "2000-05-20",
  "date_sdate": "1999-05-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Behavior-based safety feedback is increasingly used by organizations to reduce the frequency and severity of work-related injuries. Improvements in safety performance have been demonstrated in numerous settings following behavior-based (BB) safety feedback. The relative impact of global, specific, and social comparison BB feedback on safety behaviors was assessed in the current study. A 2 Feedback Level (Specific, Global) X 2 Feedback Type (Social Comparison, No Social Comparison) analysis of covariance was used to test the hypothesis that specific, social comparison feedback would lead to the greatest improvement in safety percent safe scores. Participants were 97 employees from Shifts 1 and 2 of a soft-drink bottling company in southeastern United States. Results from the study demonstrated a main effect for feedback type. Social comparison feedback led to significantly higher percent safe scores than no social comparison feedback conditions (M=.78 and .68, respectively). Follow-up chi-square analyses and practical considerations suggest global/SCF is optimal for improving safety performance. Limitations of the study and future implications for BB safety feedback research are provided",
  "description_provenance": [
    "Author Email: jowilli7@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: esgeller@vt.edu",
    "Advisor Email: donovan@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:03Z (GMT). No. of bitstreams: 1 JHWILLIAMS.PDF: 815386 bytes, checksum: aec7f25a9966ea7f50f03efd2305f5ff (MD5)   Previous issue date: 1999-05-05"
  ],
  "handle": "27718",
  "identifier_other": "etd-051499-120339",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-051499-120339/",
  "identifier_uri": "http://hdl.handle.net/10919/27718",
  "publisher": "Virginia Tech",
  "relation_haspart": "JHWILLIAMS.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "social comparison information",
    "performance feedback",
    "behavioral safety"
  ],
  "title": "Investigating the Impact of Specific, Global, and Social Comparison Feedback on Safety Behaviors",
  "type": "Dissertation"
}