{
  "contributor_author": "Zhao, Chun-Mei",
  "contributor_committeechair": "Creamer, Donald G.",
  "contributor_committeemember": [
    "Hirt, Joan B.",
    "Janosik, Steven M.",
    "Muffo, John A.",
    "Hyer, Patricia B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:12:04Z",
  "date_adate": "2002-05-30",
  "date_available": "2014-03-14T20:12:04Z",
  "date_issued": "2002-05-01",
  "date_rdate": "2003-05-30",
  "date_sdate": "2002-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This research is a detailed look at intercultural competence, an issue showing escalating importance in todayâ  s higher education and the society at large. In this study, intercultural competence was defined in light of the concept of culture and the contact hypothesis. Person-environment interaction theory and college impact theories were incorporated as theoretical foundations for the operationalization of this research. The development of studentsâ   intercultural competence was examined from two perspectives--intercultural competence is viewed both as a desirable outcome of college education and as an active environment component that exerts important influence on studentsâ   self-reported gains.  <p>Findings of this study evidenced that a variety of college activities, especially those emphasizing cooperative and associated learning, play important role in studentsâ   intercultural competence development. Intercultural competence, in turn, has substantially positive effect in student gains in multiple realms. The intrinsic influences of student characteristics were also examined. In the end, previous research was drawn upon to scrutinize the findings of this study. Implications to future practice and policy as well as the values and limitations of this study were also presented.",
  "description_provenance": [
    "Author Email: chuzhao@indiana.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: muffo@vt.edu",
    "Advisor Email: hyerp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:04Z (GMT). No. of bitstreams: 9 06ZhaoReference.pdf: 55952 bytes, checksum: 0f38b9adddb42c63789d7dbcfbf1b26f (MD5) 02ZhaoAbstract.pdf: 4459 bytes, checksum: 7c72b1cd4deb5e65c66a76f668a19437 (MD5) 03ZhaoDedication&Acknowledgements.pdf: 10645 bytes, checksum: 1f2c083caf899e11e6e515509883ca58 (MD5) 08ZhaoAppendixC.pdf: 229346 bytes, checksum: 2da68b2d2fe6a18d8460482db2b4b8f3 (MD5) 07ZhaoAppendicesA&B.pdf: 22024 bytes, checksum: 1522136b9264153ff4c230f14094989e (MD5) 04ZhaoTableofContents.pdf: 11496 bytes, checksum: 8d7d2c3cc82b15a4f004ae9ca6cfcfa1 (MD5) 05ZhaoChapters.pdf: 402908 bytes, checksum: 39a58246c8a6a0f7eb89127a9fafeba0 (MD5) 01ZhaoCover.pdf: 4726 bytes, checksum: 69d94427e553193a27626da38f729c9e (MD5) 09ZhaoVita.pdf: 4725 bytes, checksum: b0d7325cbdf632b7372122830d8d20ca (MD5)   Previous issue date: 2002-05-01"
  ],
  "handle": "27721",
  "identifier_other": "etd-05152002-135459",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152002-135459/",
  "identifier_uri": "http://hdl.handle.net/10919/27721",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "06ZhaoReference.pdf",
    "02ZhaoAbstract.pdf",
    "03ZhaoDedication&Acknowledgements.pdf",
    "08ZhaoAppendixC.pdf",
    "07ZhaoAppendicesA&B.pdf",
    "04ZhaoTableofContents.pdf",
    "05ZhaoChapters.pdf",
    "01ZhaoCover.pdf",
    "09ZhaoVita.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Contact Theory",
    "Tolerance",
    "Diversity",
    "College Impact Theory",
    "Intercultural Competence",
    "Person-Environment Interaction Theory",
    "Culture"
  ],
  "title": "Intercultural Competence: A Quantitative Study of the Significance of Intercultural Competence and the Influence of College Experiences on Studentsâ Intercultural Competence Development",
  "type": "Dissertation"
}