{
  "contributor_author": "Swander, Carl Joseph",
  "contributor_committeechair": "Harvey, Robert J.",
  "contributor_committeemember": [
    "Carlson, Kevin D.",
    "Axsom, Daniel K.",
    "Mullins, Morell E. Jr.",
    "Donovan, John J."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:12:04Z",
  "date_adate": "2001-05-23",
  "date_available": "2014-03-14T20:12:04Z",
  "date_issued": "2001-05-03",
  "date_rdate": "2002-05-23",
  "date_sdate": "2001-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A new approach was taken to identify a specific construct or dimension being measured by a video-based situational judgment test (VBSJT).  Appropriate exertion of control was specifically explored in relation to a VBSJT test designed for entry-level selection of law enforcement officers.  Ratings from ten law enforcement experts were utilized to identify this construct.  The VBSJT items scored toward overexertion of control were significantly related to performance (r = .23) in a sample of 334 incumbent police officers, capturing a large portion of the effective variance of the test which had an overall validity of r = .34. <p> Situational variables within the items were then compared to ratings of exertion of control within a sample of 5426 applicants.  General provocation toward overexertion of control and ethnicity significantly affected appropriate exertion of control.  Gender and likeability also had significant impact on appropriate exertion, but the practical significance was limited.  Specific character manipulations (i.e., rudeness, aggressiveness, pleasantness, cooperativeness, sympathy, and suspiciousness) also had a significant impact on appropriate exertion of control.  Specific information manipulations (i.e., warrants, complaints, contemptible crimes and laws being broken) also had an impact on appropriate exertion of control.  Some unexpected findings suggest that the character manipulations may actually override the effect of other provocation. <p> The overexertion of control scale was also applied to test hypotheses about the likely behavior of police officers.  It was found that the location of the organization had an affect on overexertion of control.  Contrary to the hypothesis, suburban locations had more overexertion of control than urban locations.  Length of tenure for police officers did not have an effect on overexertion of control.  This difference did not affect validity across organizations.  Implications and further research are discussed.",
  "description_provenance": [
    "Author Email: carl@ergometrics.org",
    "Advisor Email: harveyrj@vt.edu",
    "Advisor Email: kevinc@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Advisor Email: morrie@vt.edu",
    "Advisor Email: donovan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:04Z (GMT). No. of bitstreams: 1 etd.pdf: 388696 bytes, checksum: 0b1ae50e87dc323e5e88a54add045d50 (MD5)   Previous issue date: 2001-05-03"
  ],
  "handle": "27720",
  "identifier_other": "etd-05152001-125408",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152001-125408/",
  "identifier_uri": "http://hdl.handle.net/10919/27720",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "VBSJT",
    "SJT",
    "Situational Characteristics",
    "Video-Based Situational Judgment Tests"
  ],
  "title": "Video-Based Situational Judgment Test Characteristics:  Multidimensionality at the Item Level and Impact of Situational Variables",
  "type": "Dissertation"
}