{
  "contributor_author": "Rutnakornpituk, Metha",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "McGrath, James E.",
    "Shultz, Allan R.",
    "Kingston, David G. I.",
    "Dillard, John G."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:12:04Z",
  "date_adate": "2002-05-23",
  "date_available": "2014-03-14T20:12:04Z",
  "date_issued": "2002-04-23",
  "date_rdate": "2003-05-23",
  "date_sdate": "2002-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Stable suspensions of superparamagnetic cobalt nanoparticles have been prepared in poly(dimethysiloxane) (PDMS) carrier fluids in the presence of poly[dimethylsiloxane-b-(3-cyanopropyl)methylsiloxane-b-dimethylsiloxane] (PDMS-PCPMS-PDMS) triblock copolymers as steric stabilizers.  A series of the polysiloxane triblock copolymers with systematically varied molecular weights were prepared via anionic polymerization using LiOH as an initiator.  These copolymers formed micelles in toluene or poly(dimethylsiloxane) (PDMS) carrier fluids and served as â  nanoreactorsâ   for thermal decomposition of the Co2(CO)8 precursor.  The nitrile groups on the PCPMS central blocks are thought to coordinate onto the particle surface, while the PDMS endblocks protrude into the reaction medium to provide steric stability.   The particle size can be controlled by adjusting the cobalt to copolymer ratio.  Ordered self-assemblies of these cobalt nanoparticles are observed when the dispersions are cast from toluene.  Electron diffraction spectroscopy reveals that the cobalt nanoparticles have fcc crystal structures.  TEM shows non-aggregated cobalt nanoparticles with narrow size distributions, which are evenly surrounded with copolymer sheaths.  However, some degree of surface oxidation was observed over time, resulting in a decrease in magnetic susceptibility. Novel poly[dimethylsiloxane-b-methyltriethoxysilylsiloxane-b-(3-cyanopropyl) methylsiloxane-b-methyltriethoxysilylsiloxane-b-dimethylsiloxane] (PDMS-PMTEOS-PCPMS-PMTEOS-PDMS) pentablock terpolymers were prepared.  These terpolymers could fill the dual role both as steric stabilizers for preparing stable cobalt nanoparticle dispersions and  precursors for the particle coating process.  Silica films coated on the particles surfaces were employed to prevent the surface oxidation of the nanoparticles.  Specific saturation magnetic measurement indicates that coating the nanoparticles with silica thin films can effectively inhibit the oxidation process.",
  "description_provenance": [
    "Author Email: mrutnako@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: ashultz@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: john.dillard@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Made available in DSpace on 2014-03-14T20:12:04Z (GMT). No. of bitstreams: 1 dissertation2.pdf: 2424707 bytes, checksum: 63028bc51b7f102c575c076f464e9075 (MD5)   Previous issue date: 2002-04-23"
  ],
  "handle": "27723",
  "identifier_other": "etd-05152002-212615",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152002-212615/",
  "identifier_uri": "http://hdl.handle.net/10919/27723",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "polysiloxane",
    "sol-gel process",
    "retinal detachment",
    "superparamagnetic",
    "nanoparticles",
    "oxidation"
  ],
  "title": "Synthesis of Silicone Magnetic Fluids for Use in Eye Surgery",
  "type": "Dissertation"
}