{
  "contributor_author": "Assuliman, Abdusslam Wail Y.",
  "contributor_committeechair": "Fuhrman, Ellsworth R.",
  "contributor_committeemember": [
    "Breslau, Daniel",
    "Ryan, John W.",
    "Hughes, Michael D.",
    "Bailey, Carol A."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:12:05Z",
  "date_adate": "2007-05-30",
  "date_available": "2014-03-14T20:12:05Z",
  "date_issued": "2007-05-02",
  "date_rdate": "2007-05-30",
  "date_sdate": "2007-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract  This study is to investigate the problem of connectivity between nationally produced science and national needs. It is a collective case study of two academic departments within Saudi academia, the departments of petroleum engineering at Alpha and Beta Universities. The rationale for using these departments is that Saudi Arabia has an advanced petroleum industry, making petroleum engineering a good case for investigating the connectivity of nationally produced science with national needs. The main tool of the study was in-depth tape-recorded interviews. Twenty-two interviews were conducted, sixteen with current and retired faculty members at the petroleum engineering departments of Alpha and Beta and six with administrators at both universities. In addition, documents and observation were used as tools.  The two departments differ in their levels of connectivity with national industry. One is increasingly connected with national industry, while the other is completely isolated from national industry. Historical and regulatory factors play a role in this difference. Four themes were generated from the data: institutional arrangements, positive attitude and self confidence, social construction of the university, and rentier mentality. The data gathered show that the issue of connectivity is beyond the will and abilities of individual scientists; it is a result of organizational efforts of the scientific institutions reinforced by the willingness of the productive sectors to change their behavior toward national scientists.",
  "description_provenance": [
    "Author Email: aassulim@vt.edu",
    "Advisor Email: dbreslau@vt.edu",
    "Advisor Email: johnryan@vt.edu",
    "Advisor Email: mdh@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:05Z (GMT). No. of bitstreams: 2 title.pdf: 11858 bytes, checksum: 98772cb1c89d95d036c7ea98e62d7054 (MD5) Dissertation.pdf: 707902 bytes, checksum: 430786ff11642a089577c563b8341200 (MD5)   Previous issue date: 2007-05-02"
  ],
  "handle": "27729",
  "identifier_other": "etd-05152007-100757",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152007-100757/",
  "identifier_uri": "http://hdl.handle.net/10919/27729",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "title.pdf",
    "Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "social studies of engineering science.",
    "Sociology of science",
    "science and development",
    "World System theory and the diffusion of science",
    "science in less developed countries",
    "Saudi Arabia"
  ],
  "title": "The problem of connectivity: A sociological study of the problem of connectedness of nationally produced science and national needs in Saudi Arabia",
  "type": "Dissertation"
}