{
  "contributor_author": "Cline, Mark Andrew",
  "contributor_committeechair": "Denbow, Donald Michael",
  "contributor_committeemember": [
    "McNabb, F. M. Anne",
    "Denbow, Cynthia J.",
    "Ashwell, Christopher M.",
    "Siegel, Paul B."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:12:04Z",
  "date_adate": "2005-05-25",
  "date_available": "2014-03-14T20:12:04Z",
  "date_issued": "2005-05-04",
  "date_rdate": "2005-05-25",
  "date_sdate": "2005-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The effect of intracerebroventricular (ICV) injection of corticotrophin releasing hormone (CRH) and related compounds on appetite, behavior, and gastric motility in lines of chickens, one selected for low body weight (LWS) and the other high body weight (HWS), was determined.  Nucleotide sequence and expression patterns of the CRHr2 receptor, involved in appetite regulation, were also determined.  Some individuals of the LWS line are anorexics and many die simply from not eating while some individuals in the HWS line are compulsive eaters and exhibit obesity.  CRH is a 41 residue peptide that initiates an organismâ  s stress response and is a potent inhibitor of appetite.  An ICV injection of CRH dose-dependently decreased feed intake in both lines but did not effect water intake.  When CRH receptor antagonists were ICV injected an increase in feed intake in the LWS line but not in the HWS line was observed, however the appetite reducing effect of CRH was attenuated in the HWS line but not in the LWS line.  The LWS line has higher concentration of corticosterone than does the HWS line.  In both lines at all times treatment with CRH caused an increase in locomotion and no CRH-treated chicks from either line slept post injection.  Chicks from the LWS line that were treated with CRH exhibited other anxiety related behaviors sooner than the HWS line.  The LWS line showed a liner increase in crop emptying time as the dose of ICV CRH increased.  The HWS line responded with a quadratic dose response to CRH treatment.  Polymorphisms in the CRHr2 receptor were found in both lines in the same positions, thus we concluded these differences do not significantly contribute to body weight differences.  However, differences detected in expression patterns between lines for the CRHr2 receptor may contribute to their different body weights.  We conclude that differences in the CRH system, its concentrations and differential receptor action, of these two lines may be partly responsible for their altered body weight phenotype.",
  "description_provenance": [
    "Author Email: mcline@radford.edu",
    "Advisor Email: happy@vt.edu",
    "Advisor Email: cdenbow@vt.edu",
    "Advisor Email: cmashwell@ncsu.edu",
    "Advisor Email: pbsiegel@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:04Z (GMT). No. of bitstreams: 1 MACLINE.pdf: 2492324 bytes, checksum: 210aec6653abff82b9c8141507c56351 (MD5)   Previous issue date: 2005-05-04"
  ],
  "handle": "27725",
  "identifier_other": "etd-05152005-121229",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152005-121229/",
  "identifier_uri": "http://hdl.handle.net/10919/27725",
  "publisher": "Virginia Tech",
  "relation_haspart": "MACLINE.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "CRH",
    "FEEDING BEHAVIOR",
    "BODY WEIGHT"
  ],
  "title": "Corticotrophin Releasing Hormone Modulation of Feed Intake, Gastric Motility, and Behavior in Low and High Body Weight Selected Lines of Chickens",
  "type": "Dissertation"
}