{
  "contributor_author": "Kadzera, Clemence Michael",
  "contributor_committeechair": "Niles, Jerome A.",
  "contributor_committeemember": [
    "Tlou, Josiah S.",
    "Barksdale, Mary Alice",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:05Z",
  "date_adate": "2006-06-21",
  "date_available": "2014-03-14T20:12:05Z",
  "date_issued": "2006-04-03",
  "date_rdate": "2006-06-21",
  "date_sdate": "2006-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The use of instructional technologies has an impact on studentsâ   content acquisition and adds to class performance (Baylor and Ritchie, 2002). However, Beggs (2000) notes that research has shown that it is not only the technology that is important, but also how it is used that improves learning and increases pupilsâ   interest. In view of this, since not much was known about the use of technologies in teacher training colleges in Malawi, this study was designed to establish how instructional technologies were used by tutors in those colleges. The technologies studied were chalkboards, flip charts, overhead projectors, videos, computers, and local resources from the environment. The research questions were (a) How often did tutors use instructional technologies in their teaching? (b)What reasons did tutors have for using and not using instructional technologies in their teaching? (c)How did college tutors perceive their competence levels in using instructional technologies? (d)What attitudes did the college tutors have towards the use of instructional technologies? (e)What did tutors consider important factors in influencing their use of instructional technologies?   The sample consisted of tutors from Karonga, Lilongwe, St. Josephâ  s, Blantyre, and Montfort Teacher Training Colleges, who completed a survey designed to address the research questions. In addition to the tutors, a snapshot study was conducted with faculty at Domasi College of Education to establish how use of computer technology was established and sustained and what lessons could be learned that could assist the teacher training colleges as they encourage computer use among their tutors.   The results of the survey that was conducted with the tutors revealed that there was infrequent use of higher order instructional technologies i.e. overhead projectors, videos, and computers, which was attributed to lack of training, unavailability of the technologies, and lack of maintenance. The failure to use the locally available resources by some of the tutors was attributed to lack of creative thinking as well as lack of initiative to use the local environment in their teaching. Constant training and peer support on how to use the instructional technologies are some of the lessons to be learned from Domasi College of Education. The study concludes with a suggested process for how government and the teacher training institutions can work collaboratively to maximize the use of instructional technologies in the teaching and learning process for prospective teachers. Several possibilities for further research on the use of instructional technologies have been highlighted.",
  "description_provenance": [
    "Author Email: ckadzera@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: tlou@vt.edu",
    "Advisor Email: mbarksda@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:05Z (GMT). No. of bitstreams: 1 Dissertation-Kadzera.pdf: 3323880 bytes, checksum: 32331c8f76aba30b58de3e6415ed4567 (MD5)   Previous issue date: 2006-04-03"
  ],
  "handle": "27728",
  "identifier_other": "etd-05152006-174707",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152006-174707/",
  "identifier_uri": "http://hdl.handle.net/10919/27728",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-Kadzera.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "instructional technologies",
    "local resources",
    "teacher training colleges",
    "perceived competence and attitudes toward using in"
  ],
  "title": "Use of Instructional Technologies in Teacher Training Colleges in Malawi",
  "type": "Dissertation"
}