{
  "contributor_author": "McIlreavy, Megan Elizabeth",
  "contributor_committeechair": "Cooper, Robin K. Panneton",
  "contributor_committeemember": [
    "Cooper, Lee D.",
    "Bell, Martha Ann",
    "Stephens, Robert S.",
    "Dunsmore, Julie C."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:12:05Z",
  "date_adate": "2006-06-27",
  "date_available": "2014-03-14T20:12:05Z",
  "date_issued": "2006-05-01",
  "date_rdate": "2007-06-27",
  "date_sdate": "2006-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The development of perceptual-cognitive processes during infancy has been traditionally studied using visual habituation and paired-comparison techniques. There has been extensive work within the field of infant attention that has focused on the development of visual attention. Within this field, it has been well established that there are two distinct classifications of infants' visual behavior; infants with short visual fixations who perform well in a recognition task following familiarization and infants with long visual fixation with impaired performance. There are two hypotheses for the differences underlying these groups. First, that visual fixation duration is reflective of the speed of information processing such that long-looking infants process information more slowly than short-looking infants. The second hypothesis is that infants who are long-looking have difficulty disengaging and shifting their attention to another location. There has not been any work exploring how these differences manifest themselves in other modalities. Thus, this project has three purposes: (1) to explore whether group differences emerge in an auditory recognition task similar to those found in the visual recognition phase of the paired-comparison task, (2) to better understand how performance differences in the visual task correspond to any observed differences in an auditory task, and (3) to identify any potential mechanisms which may account for the observed differences in group performance on an auditory task.",
  "description_provenance": [
    "Author Email: mmcilrea@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: panneton@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Advisor Email: jdunsmor@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:05Z (GMT). No. of bitstreams: 1 MEMETD2.PDF: 619568 bytes, checksum: cd0d92da4ff0b1869bc8bc047382366b (MD5)   Previous issue date: 2006-05-01"
  ],
  "handle": "27727",
  "identifier_other": "etd-05152006-161027",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152006-161027/",
  "identifier_uri": "http://hdl.handle.net/10919/27727",
  "publisher": "Virginia Tech",
  "relation_haspart": "MEMETD2.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Infant attention",
    "heart rate",
    "visual and auditory perception"
  ],
  "title": "Looking and Listening Patterns in 4- and 8- Month-Old Infants: Correspondence between Measures of Attention",
  "type": "Dissertation"
}