{
  "contributor_author": "Weiss, Charles Tabor",
  "contributor_committeechair": "Sanders, Mark E.",
  "contributor_committeemember": [
    "Sherman, Thomas M.",
    "Wells, John G.",
    "Williams, Thomas O. Jr."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:06Z",
  "date_adate": "2009-06-01",
  "date_available": "2014-03-14T20:12:06Z",
  "date_issued": "2009-05-12",
  "date_rdate": "2009-06-01",
  "date_sdate": "2009-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated the use of digital technologies in secondary and post-secondary graphic communication education. Specifically it investigated: 1) the extent to which graphic communication educators utilized digital technologies in conjunction with instruction; 2) how selected factors affected graphic communication teachersâ   implementation of digital technologies in their instruction; and, 3) how selected factors affected teacher and learner-centered instructional practices.  The Levels of Technology Implementation (LoTi) and â  Technology Use Surveyâ   instruments were administered to secondary and post-secondary graphic communication educators via the Web to assess: 1) the frequency of use of 17 different digital technologies; 2) the nature and level of digital technology implementation; 3) current instructional practices; and 4) demographic characteristics. Graphic communication educators (n = 191) responding to the survey utilized a wide variety of digital technologies as part of their instruction. The data indicated that most students in graphic communication classes use computers, page layout software, and the Internet (for accessing digital content) â  almost daily.â   Most graphic communication students were creating and/or editing vector and raster graphics â  several times a week.â   Most graphic communication teachers reported student use of digital still cameras, digital instructional tutorials and the Internet (to solve technical problems) was limited to â  several times a month,â   while most students were creating digital multimedia projects only â  several times each year.â   Most respondents chose â  neverâ   to describe studentsâ   use of: digital video cameras, digital drawing tablets, creating and/or editing Web pages with a WYSIWYG or HTML editors, digital spreadsheets, digital databases, and digital animations. Findings from this study further indicate graphic communication educators demonstrate high to extremely high skill levels using computers for personal use and implement digital technologies in ways that begin to shift the learning environment from teacher-centered to student-centered, but may not be effectively updating their curriculum to reflect current graphic communication industry workforce needs.",
  "description_provenance": [
    "Author Email: CT-Weiss@wiu.edu",
    "Advisor Email: msanders@vt.edu",
    "Advisor Email: tsherman@vt.edu",
    "Advisor Email: jgwells@vt.edu",
    "Advisor Email: thwilli1@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:06Z (GMT). No. of bitstreams: 1 WeissVTDissertationRevised.pdf: 3647931 bytes, checksum: cafa9e77a1f0830ae485583502dbc25b (MD5)   Previous issue date: 2009-05-12"
  ],
  "handle": "27734",
  "identifier_other": "etd-05152009-081222",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152009-081222/",
  "identifier_uri": "http://hdl.handle.net/10919/27734",
  "publisher": "Virginia Tech",
  "relation_haspart": "WeissVTDissertationRevised.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Digital Technology",
    "Levels of Technology Implementation",
    "Graphic Communication",
    "Learner-Centered",
    "Student-Centered"
  ],
  "title": "Use of Digital Technologies in Graphic Communication Education",
  "type": "Dissertation"
}