{
  "contributor_author": "Ghandi, Hojjatallah",
  "contributor_committeechair": "Haller, Hans H.",
  "contributor_committeemember": [
    "Kats, Amoz",
    "Salehi-Isfahani, Djavad",
    "Tideman, Thorwald Nicolaus"
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:12:06Z",
  "date_adate": "2009-06-22",
  "date_available": "2014-03-14T20:12:06Z",
  "date_issued": "2009-05-01",
  "date_rdate": "2009-06-22",
  "date_sdate": "2009-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The first part of this dissertation investigates the possibility of an output cut by a firm as a result of an increase in demand in industries with constrained capacities. We are specially interested in the crude oil industry, although the paper has implications beyond that market. Two simple closely related models are developed. In both models a firm cuts the output at some point solely because of an increase in demand. We use this fact to explain the sharp decline of the crude oil prices in 1986. There are price and quantity hysteresis in the second model. The price hysteresis has two implications. First, the price path when the demand increases might be different from the price path when the demand decreases. This in turn implies that a temporary shock in the demand for (or supply of) crude oil can cause permanent changes in the price. We claim that the temporary changes in the supply of crude oil in 1973 resulted in the price hysteresis phenomenon described in the second model in such a way that it kept the prices high even after the return of the producers to the market. The second part investigates the relationship between the taste for public expenditure and the size and distribution of social groups in a society. Societies with ethnic heterogeneity spend less on redistribution and welfare programs and impose lower tax rates relative to homogeneous societies. We construct a theoretical model to explain these facts. There are two social groups in the model: a minority group and a majority group. When members of one group feel empathy for each other but not for members of the other group, then taxes, and redistribution depend upon the size and distribution of those groups. At first, the equilibrium tax rate and redistribution decrease as the size of the minority group increases from zero, then eventually, the relationship between them becomes positive.",
  "description_provenance": [
    "Author Email: hghandi@vt.edu",
    "Advisor Email: haller@vt.edu",
    "Advisor Email: amoz@vt.edu",
    "Advisor Email: salehi@vt.edu",
    "Advisor Email: ntideman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:06Z (GMT). No. of bitstreams: 1 dissertation.pdf: 560081 bytes, checksum: cc46bb0a333d05ebe156c0fcae2bd722 (MD5)   Previous issue date: 2009-05-01"
  ],
  "handle": "27736",
  "identifier_other": "etd-05152009-111802",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152009-111802/",
  "identifier_uri": "http://hdl.handle.net/10919/27736",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Redistribution",
    "Social Groups",
    "Price Hysteresis",
    "Constrained Capacity",
    "Oil Market"
  ],
  "title": "Essays on Applied Microeconomic Theory",
  "type": "Dissertation"
}