{
  "contributor_author": "Ravichandar, Ramya",
  "contributor_committeechair": "Arthur, James D.",
  "contributor_committeemember": [
    "Bohner, Shawn A.",
    "Broadwater, Robert P.",
    "Pérez-Quiñones, Manuel A.",
    "Tegarden, David P."
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2014-03-14T20:12:05Z",
  "date_adate": "2008-06-05",
  "date_available": "2014-03-14T20:12:05Z",
  "date_issued": "2008-05-07",
  "date_rdate": "2008-06-05",
  "date_sdate": "2008-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "We propose a Capabilities-based approach for constructing complex emergent systems such that they are change-tolerant, and the development effort promotes change-reduction. The inherent complexity of software systems increases their susceptibility to change when subjected to the vagaries of user needs, technology advances, market demands and other change inducing factors. Despite the inevitability of change, traditional Requirements Engineering strives to develop systems based on a fixed solution. This is a mostly unsuccessful approach as evidenced by the history of system failures. In contrast, we utilize Capabilities â   functional abstractions that are neither as amorphous as user needs nor as rigid as system requirements â   to architect systems to accommodate change with minimum impact. These entities are designed to exhibit desirable characteristics of high cohesion, low coupling and balanced abstraction levels.   Capabilities are generated by a two-phased process called Capabilities Engineering. Phase I mathematically exploits the structural semantics of the Function Decomposition graph â   a representation of user needs â   to formulate change-tolerant Capabilities. Phase II optimizes these Capabilities to conform to schedule and technology constraints. Results from an empirical evaluation of a real-world Course Evaluation System indicate, with statistical significance, that a Capabilities-based design is more change-tolerant than a requirements-based design. In addition, we observe that the use of the CE process inherently reduces change, otherwise generated, during the regular development effort. Empirical analysis on the change-requests of  Sakai, a complex emergent system, supports this claim. Finally, we observe that the process of Capabilities Engineering assists in  pre-requirement specification traceability by bridging the complexity gap between the problem and solution spaces.",
  "description_provenance": [
    "Author Email: ramyar@vt.edu",
    "Advisor Email: arthur@vt.edu",
    "Advisor Email: sbohner@vt.edu",
    "Advisor Email: dew@vt.edu",
    "Advisor Email: perez@cs.vt.edu",
    "Advisor Email: david.tegarden@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:05Z (GMT). No. of bitstreams: 1 ETD-Submission-Dissertation.pdf: 1385225 bytes, checksum: 6c8b53d6d0127ace708eece1a6b52051 (MD5)   Previous issue date: 2008-05-07"
  ],
  "handle": "27732",
  "identifier_other": "etd-05152008-153657",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152008-153657/",
  "identifier_uri": "http://hdl.handle.net/10919/27732",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD-Submission-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Change Tolerance",
    "Requirements Engineering",
    "Complex Emergent Systems",
    "Capabilities Engineering",
    "Capabilities",
    "Software Evolution"
  ],
  "title": "Capabilities Engineering:Promoting Change-Reduction and Constructing Change-Tolerant Systems",
  "type": "Dissertation"
}