{
  "contributor_author": "Perkins, Brian",
  "contributor_committeechair": "Smith, Robert M.",
  "contributor_committeemember": [
    "Bond, Brian H.",
    "Hammett, Alfred L. Tom",
    "Bush, Robert J.",
    "Schuler, Albert T."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:12:06Z",
  "date_adate": "2009-06-10",
  "date_available": "2014-03-14T20:12:06Z",
  "date_issued": "2009-05-04",
  "date_rdate": "2009-06-10",
  "date_sdate": "2009-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research investigated the relationship between several firm-controlled, marketing and management factors and firm performance.  Hypotheses describing the relationship between the strategic, geographic, tactical, technological and organizational factors and firm performance of hardwood lumber manufacturers were tested.  These factors were operationalized, measured in a mail survey and used in statistical analysis to identify relationships among the variables.  An adjusted response rate of 19.8% was obtained from the mail survey.  Non-response bias was not found to be a significant problem in the data.  A twelve measure performance indicator was developed and utilized to evaluate the performance of hardwood lumber manufacturers who were predominantly privately-held companies.  The averages for the profit and costs performance measures were the lowest of all twelve performance measures and this suggested that firms should focus improvement on these measures.  The current marketing tactics, including species mix, product mix, customer mix, and promotion mix was determined. The utilization of advanced production technology has increased in the industry since it was last measured in 1999.  The majority of respondents (60%) had dry kiln operations and 49% had a surfacing mill.  Thirty five percent of respondents  indicated that their company was certified by either forest, chain-of-custody, or both.    Of the five firm-controlled factors investigated in this research, four of them were found to be related to firm performance.  Geographic location was not found to be related to the performance of hardwood sawmills.  Firms who were backward integrated and firms who were both backward integrated and forward integrated performed significantly better than firms who were not vertically integrated or forward integrated.  Higher performance scores were associated with larger firms, firms who had multiple sawmills and firms who were members of the NHLA.    There was no relationship found between diversification of the product mix, species mix, customer mix variables and performance.  The diversification of a firm's promotion expenditures was positively correlated to performance.  Firms that used optimized headrigs, optimized edgers and optimized trimmers performed significantly better than did firms not using all three of these technologies.  Firms that used computer based log tallying, lumber tallying or inventory control performed significantly better than firms utilizing none of these technologies.    An increase in the use of business strategy from previous studies along with a shift towards the use of a differentiation strategy was discovered.  Firms interpreted to be following a hybrid differentiation/cost leadership strategy performed better than firms following a cost leadership, focus, or differentiation strategy.    The implication of these results is that larger, vertically integrated firms are likely to perform better than smaller, non-integrated hardwood lumber manufacturers.  It is recommended that firms diversify their use of promotion media and venues in order to attract new customers.  Adoption of production and information technology will help some hardwood lumber manufacturers improve their performance.  It is recommended that hardwood lumber manufacturers control costs and differentiate their products in order to gain competitive advantage.",
  "description_provenance": [
    "Author Email: perkinsb@vt.edu",
    "Advisor Email: rsmith4@vt.edu",
    "Advisor Email: bbond@vt.edu",
    "Advisor Email: himal@vt.edu",
    "Advisor Email: rbush@vt.edu",
    "Advisor Email: aschuler@fs.fed.us",
    "Made available in DSpace on 2014-03-14T20:12:06Z (GMT). No. of bitstreams: 2 Brian_Perkins_IRB_approval_letter.pdf: 218353 bytes, checksum: da9cb59a8903b606bbcf5d36b295c2ae (MD5) Brian_Perkins_Dissertation.pdf: 1067825 bytes, checksum: e5e2274ed95ef7a4e7dd586ca324ff8f (MD5)   Previous issue date: 2009-05-04"
  ],
  "handle": "27735",
  "identifier_other": "etd-05152009-091433",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152009-091433/",
  "identifier_uri": "http://hdl.handle.net/10919/27735",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Brian_Perkins_IRB_approval_letter.pdf",
    "Brian_Perkins_Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "business strategy",
    "production technology",
    "firm performance",
    "hardwood lumber manufacturing",
    "information technology",
    "marketing tactics"
  ],
  "title": "Modeling Factors that Influence Firm Performance in the Eastern Hardwood Lumber Manufacturing Industry",
  "type": "Dissertation"
}