{
  "contributor_author": "Carroll, Ritchie  Graham",
  "contributor_committeechair": "Creighton, Theodore B.",
  "contributor_committeemember": [
    "Mallory, Walter D.",
    "Byers, Larry",
    "Eller, John F.",
    "McWilliams, Karen P."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:12:05Z",
  "date_adate": "2008-06-05",
  "date_available": "2014-03-14T20:12:05Z",
  "date_issued": "2008-05-01",
  "date_rdate": "2008-06-05",
  "date_sdate": "2008-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Ritchie Graham Carroll Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p align=\"left\">Time, the one educational resource educators desire most, is so often in short supply in America 's schools. The ability of the school administrator to schedule teachers' and students' time so that both groups can maximize opportunities for teaching and learning each day has become an essential skill. Changing the structure of the school day to extend learning opportunities requires that administrators, teachers, and students have a firm commitment and clear understanding of the educational resources and processes of time. Successful practices regarding the use of time include: (a) careful planning and design, (b) adequate staff preparation and training, (c) effective use of extended time, and (d) a focus on equal access for students to multiple learning opportunities. Schools are under enormous pressure to show, through improved test scores, that they are providing every student with a thorough and efficient education. A review of the literature on alternative scheduling practices that use specified and structured blocks of learning time, focuses, overwhelmingly, on high school alternative scheduling models. However, there is a paucity of current research on the effects of alternative scheduling practices on elementary school cultures even though the elements of one particular method, parallel block scheduling, have been employed for over 30 years in elementary schools. This lack of research points to the necessity of exploring the benefits of alternative scheduling practices for delivery of instruction as well as changes in elementary school scheduling since the implementation of the No Child Left Behind mandate. </p> <strong><br> </strong></body> </html>",
  "description_provenance": [
    "Author Email: Ritchie.Carroll@mpark.net",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: lbyers@vt.edu",
    "Advisor Email: jeller@vt.edu",
    "Advisor Email: phd2mcwilliams@msn.com",
    "Made available in DSpace on 2014-03-14T20:12:05Z (GMT). No. of bitstreams: 1 RCarrollETD.pdf: 1513745 bytes, checksum: b3e7f5008c43de07e0848c41b732fcd6 (MD5)   Previous issue date: 2008-05-01"
  ],
  "handle": "27731",
  "identifier_other": "etd-05152008-114322",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152008-114322/",
  "identifier_uri": "http://hdl.handle.net/10919/27731",
  "publisher": "Virginia Tech",
  "relation_haspart": "RCarrollETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    ": Block Scheduling",
    "Alternative Scheduling",
    "Class Size Reduction",
    "Change Process",
    "Time Allocation",
    "Time Factors"
  ],
  "title": "No Child Left Behind: Is it About Time? Elementary Scheduling Practices in the Commonwealth of Virginia Since the Authorization of NCLB",
  "type": "Dissertation"
}