{
  "contributor_author": "Ray, Partha  Pratim",
  "contributor_committeechair": "Knowlton, Katharine F.",
  "contributor_committeemember": [
    "Shang, Chao",
    "Pearson, Ronald E.",
    "Hanigan, Mark D.",
    "James, Robert E."
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:12:06Z",
  "date_adate": "2012-06-05",
  "date_available": "2014-03-14T20:12:06Z",
  "date_issued": "2012-05-02",
  "date_rdate": "2012-06-05",
  "date_sdate": "2012-05-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Successful implementation of dietary P management strategies demand improved understanding of P digestion dynamics in ruminants and this is not possible without a reliable and accurate phytate (Pp) quantification method. The objective of the first study was to develop a robust, accurate, and sensitive method to extract and quantify phytate in feeds, ruminant digesta and feces. Clean-up procedures were developed for acid and alkaline extracts of feed, ruminant digesta and feces and clarified extracts were analyzed for Pp using high performance ion chromatography (HPIC). The quantified Pp in acid and alkaline extracts was comparable for feed but alkaline extraction yielded greater estimates of Pp content for digesta and feces than did acid extraction. Extract clean-up procedures successfully removed sample matrix interferences making alkaline extraction compatible with HPIC. The developed method was applied to investigate the disappearance of Pp from the large intestine of dairy heifers. Eight ruminally- and ileally-cannulated crossbred dairy heifers were used and each heifer was infused ileally with 0, 5, 15, or 25 g/d Pp and total fecal collection was conducted. On average 15% of total Pp entering the large intestine was degraded but the amount of infused Pp did not influence the degradability of Pp. Net absorption of P from the large intestine was observed. A feeding trial was conducted to investigate the effect of dietary Pp supply on ruminal and post-ruminal Pp digestion. Six ruminally-and ileally-cannulated crossbred lactating cows were used and dietary treatments were low (0.10% Pp), medium (0.18% Pp), and high (0.29% Pp) Pp, and a high inorganic P (Pi; 0.11% Pp; same total P content as high Pp). Ruminal Pp digestibility increased linearly with dietary Pp. As in the infusion study, net disappearance of Pp from the large intestine was only 16% of total Pp entering the large intestine and not influenced by dietary Pp. Fecal P excretion increased linearly with increasing dietary Pp but was not affected by form of dietary P. In lactating cows Pp digestibility was not affected by dietary Pp and fecal P excretion was regulated by total dietary P rather than by form of dietary P.",
  "description_provenance": [
    "Author Email: drray@vt.edu",
    "Advisor Email: chshang@vt.edu",
    "Advisor Email: rep@vt.edu",
    "Advisor Email: knowlton@vt.edu",
    "Advisor Email: mhanigan@vt.edu",
    "Advisor Email: jamesre@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:06Z (GMT). No. of bitstreams: 1 Ray_PP_D_2012.pdf: 554313 bytes, checksum: fdd0915e646cd1127e238f1ef089f3a6 (MD5)   Previous issue date: 2012-05-02"
  ],
  "handle": "27737",
  "identifier_other": "etd-05152012-133539",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05152012-133539/",
  "identifier_uri": "http://hdl.handle.net/10919/27737",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ray_PP_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "high performance ion chromatography",
    "phytate",
    "phosphorus",
    "dairy cow"
  ],
  "title": "Digestion of inositol phosphates by dairy cows: Method development and application",
  "type": "Dissertation"
}