{
  "contributor_author": "Chathoth, Prakash K.",
  "contributor_committeechair": "Olsen, Michael D.",
  "contributor_committeemember": [
    "Schneller, Meir I.",
    "Singh, Kusum",
    "Murrmann, Suzanne K.",
    "Mihalik, Brian J."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:12:07Z",
  "date_adate": "2002-05-23",
  "date_available": "2014-03-14T20:12:07Z",
  "date_issued": "2002-05-02",
  "date_rdate": "2003-05-23",
  "date_sdate": "2002-05-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The importance of testing the co-alignment model has been emphasized by several researchers in the past.  The present study is an attempt to test the model using theories in corporate finance and strategic management, which will also prove the commonalties that exist between these domains of business research.  This will help support the arguments of some researchers in the hospitality industry who have stressed the importance of assessing the firm's strategies using concepts in finance.  The overall objective of this study is to test the viability of the co-alignment model using strategic management and corporate finance theory.  \tThe present study identifies the dimensions and variables using prior research within each of the constructs studied under the management and corporate finance domains, vis-a-vis environment risk, corporate strategy, capital structure and firm performance.  The relationship between the constructs and dimensions were tested for the dependencies between them using surrogates used in prior research through a priori hypothesized relationships.  The unit of analysis was the corporate level, and hence, the study included corporate level data of restaurant firms.  The research design included cross-sectional data of restaurant firms that were averaged across an a priori defined time period.  These firms were selected based on certain criteria that helped control for country effects and industry effects.  Therefore, the publicly traded firms selected as part of the sample were based in the U.S. serving markets predominantly within the country.   \tThe statistical analysis was conducted using cross-sectional regression.  Results indicate that a high variance in firm performance is explained by the co-alignment between environment risk, corporate strategy, and capital structure.  Furthermore, the hypothesized relationships between variables that represent the constructs hold good while using accrual and cash flow returns as surrogates of firm performance.  This key finding provides the base for future research efforts, which could focus on developing the model through the use of surrogates that are used in both strategic management and corporate finance research.  Also, the sample could be extended to include privately owned restaurant firms that serve markets within the U.S., which will help improve the generalizability of the co-alignment model.",
  "description_provenance": [
    "Author Email: pchathot@vt.edu",
    "Advisor Email: olsenmd@vt.edu",
    "Advisor Email: mschnell@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: bmihalik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:07Z (GMT). No. of bitstreams: 2 Chathoth2002.pdf: 300066 bytes, checksum: 98cb7bb0d5cede565c503f78dc456266 (MD5) Chathoth-Vita.pdf: 34765 bytes, checksum: 7f5fa9ac68321e9ab0b01b8f926abce1 (MD5)   Previous issue date: 2002-05-02"
  ],
  "handle": "27741",
  "identifier_other": "etd-05162002-160231",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05162002-160231/",
  "identifier_uri": "http://hdl.handle.net/10919/27741",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chathoth2002.pdf",
    "Chathoth-Vita.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Co-alignment model",
    "Firm Performance",
    "Corporate Strategy",
    "Capital Structure",
    "Environment Risk",
    "Hypotheses Tests",
    "Regression Analysis",
    "Restaurant Firms"
  ],
  "title": "Co-alignment between Environment Risk, Corporate Strategy, Capital Structure, and Firm Performance: An Empirical Investigation of Restaurant Firms",
  "type": "Dissertation"
}