{
  "contributor_author": "Allen, Ben",
  "contributor_committeechair": "Friedman, Bruce H.",
  "contributor_committeemember": [
    "Bell, Martha Ann",
    "Harrison, David W.",
    "Ollendick, Thomas H.",
    "Axsom, Daniel K."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:12:08Z",
  "date_adate": "2012-06-04",
  "date_available": "2014-03-14T20:12:08Z",
  "date_issued": "2012-05-07",
  "date_rdate": "2012-06-04",
  "date_sdate": "2012-05-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Research shows that when a gender stereotype is made salient and the target of the stereotype is asked to perform in the stereotyped domain, targets of the stereotype often perform at a lower level compared to situations when the stereotype was not made salient (Spencer, Steele, & Quinn, 1999).  Current models of stereotype threat show that increased physiological arousal and reduced working memory capacity partially explain this decrement in performance (Ben-Zeev, Fein, & Inzlicht, 2005; Schmader, Johns, & Forbes, 2008).  Furthermore, the noticeable absence of female faculty and students in math and science departments at coed universities throughout the United States may increase the belief in gender stereotypes and discourage women from pursuing careers in these fields (Dasgupta & Asgari, 2004).  Contact with counter-stereotypical exemplars, such as female science experts, decreases belief in gender stereotypes and increases womenâ  s motivation to pursue careers in science (Stout, Dasgupta, Hunsinger, & McManus, 2011).  Thus, the present study examined whether imagining an interpersonal interaction with a counter-stereotypic exemplar removes the physiological and performance effects of stereotype threat.   However, the stereotype threat manipulation failed to elicit a strong stereotype threat effect on performance or physiology.  Only reaction time and high frequency heart rate variability were sensitive to the stereotype threat induction.  The imagination manipulation significantly attenuated the physiological effects of stereotype threat, whereas the reaction time effects were only marginally significant.  Limitations and future directions for stereotype threat and imagined contact are discussed.",
  "description_provenance": [
    "Author Email: benallen@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: dwh@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: axsom@vt.edu",
    "Advisor Email: bhfriedm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:08Z (GMT). No. of bitstreams: 1 Allen_Ben_2012.pdf: 600662 bytes, checksum: 816ddc076dd1fac3e5f6e765294610f5 (MD5)   Previous issue date: 2012-05-07"
  ],
  "handle": "27746",
  "identifier_other": "etd-05162012-093537",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05162012-093537/",
  "identifier_uri": "http://hdl.handle.net/10919/27746",
  "publisher": "Virginia Tech",
  "relation_haspart": "Allen_Ben_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "imagined contact",
    "stereotype threat",
    "biopsychosocial",
    "vagal suppression",
    "working memory"
  ],
  "title": "Threatening the Heart and Mind of Gender Stereotypes: Can Imagined Contact Influence the Physiology of Stereotype Threat?",
  "type": "Dissertation"
}