{
  "contributor_author": "McIntosh, Bridgett J.",
  "contributor_committeecochair": [
    "Kronfeld, David S.",
    "Geor, Raymond J."
  ],
  "contributor_committeemember": [
    "Abaye, Azenegashe Ozzie",
    "Splan, Rebecca K.",
    "Staniar, William Burton",
    "Chatterton, Jerry",
    "Longland, Annette"
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:12:07Z",
  "date_adate": "2007-06-14",
  "date_available": "2014-03-14T20:12:07Z",
  "date_issued": "2006-12-14",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-05-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nonstructural carbohydrates (NSC), which includes sugars, starches and fructans in pasture forages, undergo circadian and seasonal variation which has direct effects on metabolism in grazing horses. Increased intake of NSC is implicated in the development of digestive and metabolic disorders, such as laminitis. A series of five studies at Virginia Techâ  s M.A.R.E. Center in April, May, August, and October 2005, and January 2006, examined circadian and seasonal variability in forage NSC content and metabolic and digestive variables in horses over a 36 h sampling period. Fourteen mares were randomly assigned to grazing (housed on a 5-ha predominantly tall fescue pasture; n = 10) or control (stabled within the pasture and fed timothy/alfalfa hay; n = 4) groups. Blood samples were collected hourly from the horses which corresponded to hourly pasture forage samples. In all five studies, plasma glucose and insulin were measured and proxies for insulin resistance were calculated. In the April study, plasma L-lactate and fecal pH, L-lactate, D-lactate and volatile fatty acids (VFAs) were also measured.  Two approaches were used for the determination of carbohydrate profiles in pasture forage samples. For the first (LAB1), sugar was water soluble carbohydrates extracted prior to analysis for starch, and included fructans. The NSC was the sum of starch and sugar. For the second (LAB2), samples were analyzed for specific NSC fractions using hydrolytic enzymes, with the addition of HCL for the determination of fructans including graminans, the type of fructans in cool season grasses. Both the LAB1 and LAB2 analyses revealed circadian and seasonal patterns in forage NSC and its constituents. In general, pasture forage NSC content was lowest in the morning and highest in the late afternoon. April had the highest NSC content which was comprised mostly of simple sugars. Forage NSC content (LAB1) was associated with environmental variables in all months with strongest correlations in April; ambient temperature (r = 0.72, P < 0.001), solar radiation (r = 0.62, P < 0.001), and humidity (r = -0.84, P < 0.001). In the animals, plasma insulin was highest in grazing horses in April (P < 0.001) followed by May (P < 0.001). Plasma insulin was higher in grazing compared to control horses at all sample points in April, and a circadian pattern was evident (P = 0.012). In grazing horses, plasma glucose was higher in April than all months except for May, and plasma glucose was higher in grazing horses compared to controls in April. In grazing horses, plasma insulin was significantly correlated with NSC and sugar in April (r = 0.69 and r = 0.67, respectively); May (r = 0.46 and r = 0.47, respectively); and January (r = 0.44 and r = 0.46, respectively). In April only, individual mean insulin response was proportional to the increase in insulin per increase in unit of NSC (r2 = 0.033, P < 0.001). Sinusoidal circadian patterns in NSC (r2 = 0.51, P < 0.001) and insulin in grazing horses (r2 = 0.12, P < 0.001) had similar frequency (P = 0.36). Plasma L-lactate was higher in grazing horses (0.64 mmol/L) than control horses (0.40 mmol/L) (P < 0.001). Fecal pH was lower in grazing horses (pH 6.9) than control horses (pH 7.2) (P = 0.008). Fecal VFAs, including acetic acid, butyric acid, and D- and L-lactate were higher in grazing horses compared to control horses (P < 0.05). These studies identified a link between forage NSC content and alterations in carbohydrate metabolism and digestion that may increase risk of laminitis via exacerbation of insulin resistance. Strategies for management practices to decrease intakes of pasture NSC by horses at risk of developing metabolic disorders are needed.",
  "description_provenance": [
    "Author Email: brbyrd@vt.edu",
    "Advisor Email: kronfeld@vt.edu",
    "Advisor Email: cotton@vt.edu",
    "Advisor Email: rsplan@vt.edu",
    "Advisor Email: wstaniar@vt.edu",
    "Advisor Email: njchatt@us.edu",
    "Advisor Email: annettelongland@iger.com",
    "Advisor Email: rgeor@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:07Z (GMT). No. of bitstreams: 1 BMrevisedETD61107.pdf: 1216633 bytes, checksum: a4bdc0ea1eca6e401901d17da80cdaa7 (MD5)   Previous issue date: 2006-12-14"
  ],
  "handle": "27742",
  "identifier_other": "etd-05162007-111315",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05162007-111315/",
  "identifier_uri": "http://hdl.handle.net/10919/27742",
  "publisher": "Virginia Tech",
  "relation_haspart": "BMrevisedETD61107.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "PASTURE",
    "CARBOHYDRATES",
    "HORSE",
    "LAMINITIS"
  ],
  "title": "Circadian and Seasonal Variation in Pasture Nonstructural Carbohydrates and the Physiological Response of Grazing Horses",
  "type": "Dissertation"
}