{
  "contributor_author": "Osorio Leyton, Javier Mauricio",
  "contributor_committeechair": "Wolfe, Mary Leigh",
  "contributor_committeemember": [
    "Bosch, Darrell J.",
    "Heatwole, Conrad D.",
    "Zobel, Christopher W."
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2014-03-14T20:12:08Z",
  "date_adate": "2012-06-06",
  "date_available": "2014-03-14T20:12:08Z",
  "date_issued": "2012-05-02",
  "date_rdate": "2012-06-06",
  "date_sdate": "2012-05-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Modeling is an important tool in watershed management. In much of the world, data needed for modeling, both for model inputs and for model evaluation, are very limited or non-existent. The overall objective of this research was to enable development of watershed management plans for agricultural dominated systems under situations where data are scarce. First, uncertainty of the SWAT modelâ  s outputs due to input parameters, specifically soils and high resolution digital elevation models, which are likely to be lacking in data-poor environments, was quantified using Monte Carlo simulation. Two sources of soil parameter values (SSURGO and STATSGO) were investigated, as well as three levels of DEM resolution (10, 30, and 90 m). Uncertainty increased as the input data became coarser for individual soil parameters. The combination of SSURGO and the 30 m DEM proved to adequately balance the level of uncertainty and the quality of input datasets. Second, methods were developed to generate appropriate soils information and DEM resolution for data-poor environments. The soils map was generated based on lithology and slope class, while the soil attributes were generated by linking surface soil texture to soils characterized in the SWAT soils database. A 30 m resolution DEM was generated by resampling a 90 m DEM, the resolution that is readily available around the world, by direct projection using a cubic convolution method. The effect of the generated DEM and soils data on model predictions was evaluated in a data-rich environment. When all soil parameters were varied at the same time, predictions based on the derived soil map were comparable to the predictions based on the SSURGO map. Finally, the methodology was tested in a data-poor watershed in Bolivia. The proposed methodologies for generating input data showed how available knowledge can be employed to generate data for modeling purposes and give the opportunity to incorporate uncertainty in the decision making process in data-poor environments.",
  "description_provenance": [
    "Author Email: josorio@vt.edu",
    "Advisor Email: mlwolfe@vt.edu",
    "Advisor Email: bosch@vt.edu",
    "Advisor Email: heatwole@vt.edu",
    "Advisor Email: czobel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:08Z (GMT). No. of bitstreams: 1 Osorio_JM_D_2012.pdf: 5329685 bytes, checksum: 9848cfc72a34c32e123510dd9f4cfa00 (MD5)   Previous issue date: 2012-05-02"
  ],
  "handle": "27747",
  "identifier_other": "etd-05162012-122037",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05162012-122037/",
  "identifier_uri": "http://hdl.handle.net/10919/27747",
  "publisher": "Virginia Tech",
  "relation_haspart": "Osorio_JM_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Watershed management",
    "Uncertainty analysis",
    "Data-poor environments",
    "Watershed modeling",
    "Digital soil mapping"
  ],
  "title": "Assessment of SWAT to Enable Development of Watershed Management Plans for Agricultural Dominated Systems under Data-Poor Conditions",
  "type": "Dissertation"
}