{
  "contributor_author": "Foster, Allison Bennett",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Stamm, Neil A.",
    "Roberts, James T.",
    "Salmon, Richard G.",
    "Niles, Jerome A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:12:07Z",
  "date_adate": "2007-06-01",
  "date_available": "2014-03-14T20:12:07Z",
  "date_issued": "2007-05-04",
  "date_rdate": "2010-10-12",
  "date_sdate": "2007-05-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> In America urban school systems have encountered difficulties retaining teachers. The ramification of teacher attrition is that the neediest students are often taught by those with the least educational experience.  </p><p> The purpose of this study was to determine the implications of Virginia teacher licensure regulations on teacher retention in Lighthouse City Public Schools. The study addressed four research questions: 1) â  What factors influence the retention of teachers in Lighthouse City Public Schools? 2) Is it possible to predict demographically by race, gender, age, grade level of teaching assignment or licensure preparation program which groups or sub-groups of people are more likely or less likely to leave a school system? 3) Does the licensure preparation program influence retention? 4) Were the Virginia licensure requirements the reasons cited for the departure of teachers in 2004, 2005, and 2006? The research focused an urban school system in southeastern Virginia with approximately 33,000 students. The population was 361 teachers hired for the 2003 school year. A researcher developed survey was electronically mailed to the still employed teachers, and a mailed survey was sent to all the teachers who had left the school system.  </p><p> A multiple regression was performed on the demographic data to try to predict teacher retention or attrition. The results of the multiple regression indicated that statistically (p<.01) only the variable of licensure could be a predictor of retention. All of the survey respondents agreed that a strong principal was the key to retention. </p><p> Urban school systems are challenged by local standards, state standards, and No Child Left Behind mandates, and compounding the difficulties is on-going teacher loss. It is imperative that school system leaders provide new teacher support and time for the inexperienced to learn how to become excellent. Teachers are not expendable; students are at stake.</p>",
  "description_provenance": [
    "Author Email: esol1@vt.edu",
    "Advisor Email: neil.stamm@nn.k12.va.us",
    "Advisor Email: roberji@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:07Z (GMT). No. of bitstreams: 1 FosterDissertation07a.pdf: 1341852 bytes, checksum: d22ddeaa9c34a466bca98a09362552f3 (MD5)   Previous issue date: 2007-05-04"
  ],
  "handle": "27743",
  "identifier_other": "etd-05162007-114953",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05162007-114953/",
  "identifier_uri": "http://hdl.handle.net/10919/27743",
  "publisher": "Virginia Tech",
  "relation_haspart": "FosterDissertation07a.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "teacher retention",
    "teacher supply and demand",
    "requirements for teacher licensure",
    "teacher attrition",
    "licensure"
  ],
  "title": "The Implications of Virginia Licensure Regulations on Teacher Retention in Lighthouse City Public Schools",
  "type": "Dissertation"
}