{
  "contributor_author": "Bridges, Andrew Scott",
  "contributor_committeechair": "Vaughan, Michael R.",
  "contributor_committeemember": [
    "Steffen, David E.",
    "Walters, Jeffrey R.",
    "Stauffer, Dean F."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:12:09Z",
  "date_adate": "2005-05-26",
  "date_available": "2014-03-14T20:12:09Z",
  "date_issued": "2005-04-29",
  "date_rdate": "2008-05-26",
  "date_sdate": "2005-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Cooperative Alleghany Bear Study (CABS) was a 10-year study conducted on 2 areas and designed to investigate the ecology of a hunted population of American black bears (Ursus americanus) in the Alleghany Mountains of western Virginia.  Over the course of our research, we handled 1,041 individual bears >18 months old and gathered reproductive data from females during 424 bear-winters.  My analyses of 183 litters indicate that reproductive rates were high with relatively large litters (mean = 2.49 cubs / litter) and younger (3â  4-year-old) females having smaller litters than older (> 5 years old) females.  Overall cub sex ratios did not differ from 1M:1F; however, female cubs were over-represented in 4-cub litters.  Most cubs were born in January (mean = January 17) and younger females had later parturition dates than older females.  Bears on our study areas had relatively early ages at primiparity (mean = 3.8 years old) and few missed reproductive opportunities.  Hard mast failure apparently resulted in periodic reproductive failures and subsequent reproductive synchrony, which I tracked using 5 indices.  The amplitude of oscillations in reproductive synchrony dampened through time after each synchronizing event.  The population contained substantially more females than males; however, males were more vulnerable to trapping than were females.  Population size was determined using genetic and photographic capture-recapture estimators.  Density estimates were relatively high and approached 1 bear / km2.  Annual survival rates were high for cubs (0.87) and females (0.91).  For males, annual survival rates were lower, particularly for 1â  3-year-olds (0.57).  Excluding hunting mortality, natural survival rates were high (0.98) for all >1-year-old bears on our study areas.  The results of Leslie Matrix and Program RISKMAN models indicated a growing population.  A Leslie Matrix model incorporating the effects of a 5-year-cyle of mast-failure-induced reproductive failure yielded a lambda = 1.13.  To reach the objective of 0 population growth prescribed for some areas of Virginia, increased levels of hunting mortality on adult  (>3-year-old) females would likely be necessary.",
  "description_provenance": [
    "Author Email: abridges@vt.edu",
    "Advisor Email: David.Steffen@dgif.state.va.us",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: mvaughan@vt.edu",
    "Advisor Email: dstauffe@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:09Z (GMT). No. of bitstreams: 1 Bridges_ETD.pdf: 8553875 bytes, checksum: bc39e623addcf7846690d513c3f867a0 (MD5)   Previous issue date: 2005-04-29"
  ],
  "handle": "27754",
  "identifier_other": "etd-05172005-181300",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05172005-181300/",
  "identifier_uri": "http://hdl.handle.net/10919/27754",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bridges_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "survival",
    "American black bear",
    "demographics",
    "population dynamics",
    "reproduction",
    "Ursus americanus"
  ],
  "title": "Population Ecology of Black Bears in the Alleghany Mountains of Virginia",
  "type": "Dissertation"
}