{
  "contributor_author": "Alt, Curt",
  "contributor_committeechair": "Bush, Robert J.",
  "contributor_committeemember": [
    "Smith, Robert M.",
    "Lamb, Fred M.",
    "Hammett, Alfred L. Tom",
    "Smith, Paul"
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:12:09Z",
  "date_adate": "2001-05-23",
  "date_available": "2014-03-14T20:12:09Z",
  "date_issued": "2001-04-06",
  "date_rdate": "2002-05-23",
  "date_sdate": "2001-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Impact of Environmental Certification on U.S. Hardwood Flooring Manufacturers   Curt Alt   (ABSTRACT)   A nation-wide survey of hardwood flooring manufacturers was conducted in the spring of 1998.  The objectives of the study were to determine the differences in beliefs towards certification between certified and non-certified hardwood flooring manufacturers and to explore the decision to certify and the implications of that decision.  Those objectives were chosen because certification is a developing phenomenon of which there are some aspects that remain unknown.  The survey consisted of a mail questionnaire that was sent to more than 250 hardwood flooring manufacturers.  The questionnaire was used to collect demographic and attitudinal information from the respondents about certification.  The second part of the research used the Analytic Hierarchy Process to model the decision process hardwood flooring manufacturers go through when deciding whether or not to certify.  Data were collected as part of the mail questionnaire.  The final goal of the research, to explore the experiences of certified manufacturers, was met through the use of personal interviews with the manufacturers.  The results from the mail survey indicated that certified hardwood flooring manufacturers tended to be smaller than non-certified hardwood flooring manufacturers.  The total amount of certified hardwood flooring produced in the U.S. in 1997 was estimated to be 435,579 bdft, roughly 0.1% of the total reported amount of hardwood flooring produced.  The research also indicated that certified manufacturers felt that there was a need for certification in the U.S. and that it was the environmentally responsible thing to do, while the non-certified manufacturers felt that that was untrue.  The most important factor in the non-certified manufacturers' decision whether to certify is the profit potential of the product, while the certified manufacturers based their decision to certify on the marketing advantages, image benefits, and access to new markets that the certified product provides.  Overall, certified and non-certified hardwood flooring manufacturers hold widely differing views on certification, and those differing beliefs contribute to the choices each group makes.",
  "description_provenance": [
    "Author Email: calt@hpva.org",
    "Advisor Email: fml195@vt.edu",
    "Advisor Email: himal@vt.edu",
    "Advisor Email: pms6@psu.edu",
    "Advisor Email: rbush@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:09Z (GMT). No. of bitstreams: 2 CurtAltETD.pdf: 1473111 bytes, checksum: a9ecb495d6fc0640f5eacabb10482fb7 (MD5) CurtAltabstract.txt: 2302 bytes, checksum: 2842bd799af1911919530effe6685491 (MD5)   Previous issue date: 2001-04-06"
  ],
  "handle": "27751",
  "identifier_other": "etd-05172001-110649",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05172001-110649/",
  "identifier_uri": "http://hdl.handle.net/10919/27751",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CurtAltETD.pdf",
    "CurtAltabstract.txt"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "experiences",
    "decision",
    "analytic heirarchy process",
    "flooring",
    "hardwood",
    "certification",
    "AHP",
    "manufacturers"
  ],
  "title": "The Impact of Environmental Certification on U.S. Hardwood Flooring Manufacturers",
  "type": "Dissertation"
}