{
  "contributor_author": "Burt, Jason Bryan",
  "contributor_committeechair": "Ross, Nancy L.",
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:12:09Z",
  "date_adate": "2006-06-22",
  "date_available": "2014-03-14T20:12:09Z",
  "date_issued": "2006-05-11",
  "date_rdate": "2007-06-23",
  "date_sdate": "2006-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>\tThe Al2SiO5 polymorphs have been examined to provide new insights into their chemical bonding, their crystal chemistry, their equations of state, and the incorporation of water in the form of hydroxyl in their structures.  The Al2SiO5 polymorphs provide a unique structural assemblage for a crystal chemical examination due to the variation in Al coordination in the structures where Al is in 4-fold, 5-fold, and 6-fold in sillimanite, andalusite, and kyanite, respectively.  Consequently, the Al2SiO5 polymorphs have been examined with a combination of experimental (high pressure X-ray diffraction and Polarized FTIR spectroscopy) and theoretical (VASP and Crystal 98) methods.  \t</p><p>An experimental high pressure X-ray diffraction study on andalusite and sillimanite has constrained their equation of state and the pressure derivatives of their bulk modulus with pressure.  Additionally, the effect of pressure on the crystal structures has been examined, where the main structural response is compression of the AlO6 octahedra.  Comparatively, compression of the AlO6 octahedra in andalusite is more anisotropic, while the major direction of axial compressibility in both structures is dependent on the orientation of the AlO6 octahedra. </p><p> \tIn order to better understand the crystal chemistry of the Al-O and Si-O bonds in the polymorphs, ELF isosurfaces were examined.  ELF isosurfaces represent a graphical representation of the localized electron probability density.  Six distinct types of ELF isosurfaces were observed in the Al2SiO5 polymorphs resulting from differences in the geometry, coordination, and coordinated cation atomic number surrounding the oxygens within the crystal structures.  The ELF was also shown to be isostructurally related to electron density difference maps. </p><p> \tIn a combined experimental and theoretical investigation of the Al2SiO5 polymorphs, potential protonation sites within the crystal structures were determined at an atomic level with polarized FTIR spectroscopy and analysis of (3,-3) critical points of the negative Laplacian.  The polarized FTIR spectra indicate the orientation of the OH dipole in the three polymorphs and the (3,-3) critical points indicate regions of locally concentrated electron density.  Potential protonation sites were determined based on the value of the negative Laplacian, the underbonded nature of the oxygens, and the number of surrounding cations.    </p>",
  "description_provenance": [
    "Author Email: jaburt@vt.edu",
    "Advisor Email: nross@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:09Z (GMT). No. of bitstreams: 1 dissertation.pdf: 2746032 bytes, checksum: 05150f4d440a63815ea4c51d83f4334c (MD5)   Previous issue date: 2006-05-11"
  ],
  "handle": "27756",
  "identifier_other": "etd-05172006-190053",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05172006-190053/",
  "identifier_uri": "http://hdl.handle.net/10919/27756",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "electron localization function (ELF)",
    "and (3",
    "Polarized FTIR spectroscopy",
    "high pressure",
    "-3) critical points",
    "Al2SiO5"
  ],
  "title": "A study of the crystal chemistry, electron density distributions, and hydrogen incorporation in the Al₂SiO₅ polymorphs",
  "type": "Dissertation"
}