{
  "contributor_author": "McLaughlin, John",
  "contributor_committeechair": "Glasson, George E.",
  "contributor_committeemember": [
    "Brand, Brenda R.",
    "Hicks, David",
    "Downey, Gary L.",
    "Nespor, Jan K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:09Z",
  "date_adate": "2006-07-24",
  "date_available": "2014-03-14T20:12:09Z",
  "date_issued": "2006-05-04",
  "date_rdate": "2006-07-24",
  "date_sdate": "2006-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "It is impossible to imagine our schools or community without framing such a view around a corporate structure.  Money, capital, and economic stakeholders are all around us, building a corporate landscape that all members of the community must travel through in the course of their everyday lives.  To suggest that education should be void of any type of economic influence would be to deny that a very important thread of our communitiesâ   tapestry exists.   As we look at the way that these education intentions move outside our own communities and connect us to other communities and the world, we see corporate education economics framed in either a global or communal perspective.  A corporate science education perspective tends to treat science with strict positivism, and technology with hard determinism.  Communal theories of science education view science as post-positivistic and technology with a softer determinism; as a result social implications emerge, and the science becomes more socially constructed.  It supports the personal capital of all students, regardless of their view of science or technology.  It allows students to â  border crossâ   more easily so they can â  scaffoldâ   new science information onto previous learning.   This research consists of exploring how biotechnology education emerged within the state, how the resources intersected within a biotechnology conference and how teachers conceptualized biotechnology practices in their own classrooms.  The researcher pieced together a sketch of the history of how biotechnology curriculum arose in high school biology classes.  The researcher also explored the hybrid nature of biotechnology resources such as an educational conference where teachers attend workshops and lectures. The practices of two teachers in a public high school and one in a private school setting were also analyzed.",
  "description_provenance": [
    "Author Email: jomclau1@vt.edu",
    "Advisor Email: bbrand@vt.edu",
    "Advisor Email: hicks@vt.edu",
    "Advisor Email: glassong@vt.edu",
    "Advisor Email: downey@vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:09Z (GMT). No. of bitstreams: 1 Diss3.pdf: 2233322 bytes, checksum: 0564ecdd681c33fbaaf392d28a5fc05e (MD5)   Previous issue date: 2006-05-04"
  ],
  "handle": "27757",
  "identifier_other": "etd-05172006-220554",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05172006-220554/",
  "identifier_uri": "http://hdl.handle.net/10919/27757",
  "publisher": "Virginia Tech",
  "relation_haspart": "Diss3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "biotechnology education as corporate",
    "public secondary school",
    "science education",
    "private secondary school",
    "biotechnology education as communal",
    "economy",
    "rural education"
  ],
  "title": "Biotechnology Education: An Investigation of Corporate and Communal Science in the Classroom",
  "type": "Dissertation"
}