{
  "contributor_author": "Katz, Bryan Jeffrey",
  "contributor_committeechair": "Rakha, Hesham Ahmed",
  "contributor_committeemember": [
    "Dingus, Thomas A.",
    "Robinson, Mark",
    "Hawkins, H. Gene",
    "Tignor, Samuel C."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:12:10Z",
  "date_adate": "2007-07-13",
  "date_available": "2014-03-14T20:12:10Z",
  "date_issued": "2007-04-26",
  "date_rdate": "2007-07-13",
  "date_sdate": "2007-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In the United States, speeding is considered to be a contributing factor in about 30 percent of fatal crashes (US DOT, 2000).  In an attempt to reduce speeds on roadway segments where speed is considered to be a safety concern, various low cost countermeasures have been investigated.  Such countermeasures include pavement markings that give a psychological appearance of narrowing and/or increasing speed have been considered as a relatively low-cost treatment.  Perceptual cues are one potential method of influencing motorists to slow down, and ultimately, to save lives.  These perceptual techniques might be useful at lowering speeds in a variety of driving situations such as work zones, curves, roundabouts, and toll plazas.  Evaluations are required in order to determine the effectiveness of these various treatments at reducing speeds.  This research project explored several possible perceptual countermeasures to try on the approaches to curves for reducing speeds.  It was ultimately decided to evaluate the effects of peripheral transverse lines in reducing speeds.  Although there have been some limited evaluations of peripheral transverse markings in previous studies, no significant field evaluation has been performed and a recommended design for the markings has not been discussed.  The projected results of the research effort is to determine pavement marking treatments with a high probability of success at reducing speeds, develop and design peripheral transverse markings based on site considerations, determine the effectiveness of the markings in the field, determine optimal pavement marking design using a driving simulator, and use a controlled research environment to finalize the design.  This dissertation contributes to the body of knowledge on speed reduction research through the development of low cost speed reduction strategies, the design of peripheral transverse lines for varying geometric conditions, evaluation of these treatments in the field, in the simulator, and on a controlled roadway, and to finally compare the benefits of each of the evaluation approaches.  In the field, peripheral transverse lines spaced at a frequency of 4 bars per second were evaluated in New York, Mississippi, and Texas.  The markings were applied on approaches to curves in both rural and urban environments on both multi-lane and two-lane roadways.  The authors concluded that overall, the pavement markings reduced speeds up to 59% compared to the baseline in the short term and 24% in the long term on overall vehicle speeds.    When evaluating design alternatives of peripheral transverse markings, a follow-up study was performed and compared baseline conditions to markings spaced at a constant interval, exponentially closer, at two bars per second, and at four bars per second.  The peripheral transverse lines were effective in reducing centerline encroachment; however, the results were inconclusive as to which particular marking spacing pattern was most effective.  There was a large amount of variability in driving speeds using the driving simulator which made it ineffective at comparing designs. The third evaluation was performed at the Virginia Tech Smart Road in which reductions in speed were compared to the baseline at two locations.  While one curve had large preview distances and no effect due to the treatments, speed reductions on a freeway ramp type of curve resulted in a speed reduction 42% greater than the reduction in the baseline condition.    There are several advantages and disadvantages to evaluations in the field, simulator, and at a controlled research setting which are summarized in this dissertation.  Overall, all three have potential of looking at different elements, but it was determined that variability when measuring speed in the driving simulator makes it more challenging as a tool for measuring speed reductions.",
  "description_provenance": [
    "Author Email: bkatz@vt.edu",
    "Advisor Email: tdingus@vt.edu",
    "Advisor Email: hrakha@vt.edu",
    "Advisor Email: mark.d.robinson@saic.com",
    "Advisor Email: gene-h@tamu.edu",
    "Advisor Email: stignor@aol.com",
    "Made available in DSpace on 2014-03-14T20:12:10Z (GMT). No. of bitstreams: 1 KatzPhDDissertation.pdf: 944621 bytes, checksum: 415da2afeed58efce5fc1d8ccf67327e (MD5)   Previous issue date: 2007-04-26"
  ],
  "handle": "27759",
  "identifier_other": "etd-05172007-135959",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05172007-135959/",
  "identifier_uri": "http://hdl.handle.net/10919/27759",
  "publisher": "Virginia Tech",
  "relation_haspart": "KatzPhDDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "speed control",
    "peripheral transverse markings",
    "speed management",
    "traffic safety",
    "human factors"
  ],
  "title": "Peripheral Transverse Pavement Markings for Speed Control",
  "type": "Dissertation"
}