{
  "contributor_author": "Tanellari, Eftila",
  "contributor_committeechair": "Bosch, Darrell J.",
  "contributor_committeemember": [
    "Boyle, Kevin J.",
    "Mills, Bradford F.",
    "Parmeter, Christopher F.",
    "Pease, James W."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:12:12Z",
  "date_adate": "2011-06-24",
  "date_available": "2014-03-14T20:12:12Z",
  "date_issued": "2011-04-29",
  "date_rdate": "2012-06-01",
  "date_sdate": "2011-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation consists of three essays that examine consumer behavior with respect to drinking water quality issues. The first essay uses contingent valuation method to explore consumersâ   willingness to pay (WTP) for a hypothetical material in home drinking water infrastructure that will remain leak free. Willingness to pay is investigated using both dichotomous choice and dichotomous choice with follow-up formats using a national telephone survey of consumers. Our results indicate that consumersâ   concerns about future system failures and income positively affect their WTP for an improved material while satisfaction with the water quality, education and the bid amount asked negatively affect their WTP for an improved material. There are no significant differences in the determinants of WTP between respondents who have experienced problems with home water infrastructure and respondents who have not. Furthermore, the estimated mean WTP does not change significantly between the dichotomous choice questioning format and the dichotomous choice with follow-up format The second essay investigates the determinants of consumersâ   willingness to accept improvement programs for three drinking water issues: water quality, pinhole leaks in home plumbing infrastructure and aging public infrastructure. The research is based on a mail survey of consumers in Northern Virginia and the Maryland suburbs of Washington D.C. The analysis focuses on the relationship between information, risk perceptions and willingness to pay. Results indicate that the choice to support any of the programs is negatively affected by the cost of the proposed improvement. Consumersâ   risk perceptions, the external information provided in the survey and whether they read the annual report from their water utility affect their choices for investment in improvement programs. The third essay examines the effect of risk perceptions about tap water, general risk aversion and consumersâ   characteristics on their decision to avert drinking water risks and related expenditures. Results are based on the same survey data from the second study. The risk aversion measure is elicited using the sequence of questions employed in the National Panel Study of Income Dynamics. Results indicate that consumersâ   risk perceptions affect both the decision to avert and the amount spent on averting activities. However, we do not find a significant impact of risk aversion on averting behavior. In addition we find that respondents were more likely to use water treatments if they were unsatisfied with their tap water or had problems or concerns with water odor and particles.",
  "description_provenance": [
    "Author Email: etanella@vt.edu",
    "Advisor Email: bosch@vt.edu",
    "Advisor Email: kjboyle@vt.edu",
    "Advisor Email: bfmills@vt.edu",
    "Advisor Email: cparmeter@miami.edu",
    "Advisor Email: peasej@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:12Z (GMT). No. of bitstreams: 1 Tanellari_E_D_2011.pdf: 401862 bytes, checksum: 55af88b7bf465afbc2b0686ef5aab445 (MD5)   Previous issue date: 2011-04-29"
  ],
  "handle": "27769",
  "identifier_other": "etd-05172011-202204",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05172011-202204/",
  "identifier_uri": "http://hdl.handle.net/10919/27769",
  "publisher": "Virginia Tech",
  "relation_haspart": "Tanellari_E_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Averting Behavior",
    "Drinking Water Infrastructure",
    "Drinking Water Quality",
    "Willingness-To-Pay"
  ],
  "title": "Essays on the Economics of Drinking Water Quality and Infrastructure",
  "type": "Dissertation"
}