{
  "contributor_author": "Jones, Forest Issac",
  "contributor_committeechair": "Tripp, Norman Wayne",
  "contributor_committeemember": [
    "Craig, James R.",
    "Creighton, Theodore B.",
    "McCracken, Robert C."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:12:11Z",
  "date_adate": "2011-05-18",
  "date_available": "2014-03-14T20:12:11Z",
  "date_issued": "2011-05-04",
  "date_rdate": "2011-05-18",
  "date_sdate": "2011-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html xmlns=\"http://www.w3.org/1999/xhtml\"> <head> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" /> <title>Forest I. Jones Abstract</title> </head>  <body> <p>Jackson and Davis  noted in Turning Points 2000, &ldquo;Changes in middle grades practices have least  often occurred where they are needed most: in high poverty urban and rural  communities where unacceptably poor student achievement is rampant&rdquo; (2000,  p.5). Virginia  has many school districts that fall into these categories. Even though they  fall into these categories, middle schools across the state are still expected  to have their students pass assessments at a high rate and meet state  standards.</p> <p>The purpose of the  study was to investigate and describe how one middle school went from being  accredited with warning to making AYP and meeting high standards of academic  achievement with at-risk students. Poor academic achievement is one of the most  consistent predictors of dropout, whether measured through grades, test scores,  or course failure (Alexander, Entwisle, &amp; Kabbani, 2001). Investigating  test scores and the research-based practices that may have influenced scores to  improve in this particular middle school were the primary areas of study. The  researcher utilized qualitative research methods to investigate a middle school  that has been successful in improving the academic success rate for its at-risk  students.</p> <p>The overarching  research question for the study was What practices were used in this middle  school to ensure the academic success of at-risk students? Research-based  practices found in the literature to have influenced at-risk middle school  students&rsquo; achievement are (a) strong principal leadership, (b) focused  curriculum and reading intervention, and (c) positive teacher-student relationships.  The study attempted to determine which, if any of the practices were used by  the school and if factors other than the practices identified for investigation  may have contributed to the success of at-risk students in the school. </p> </body> </html>",
  "description_provenance": [
    "Author Email: fjones@salem.k12.va.us",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: jcraig44@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: rmccracke@radford.edu",
    "Made available in DSpace on 2014-03-14T20:12:11Z (GMT). No. of bitstreams: 1 Jones_FI_D_2011.pdf: 726935 bytes, checksum: 8afbc9bb4e13a04b5f93f7eacea249ee (MD5)   Previous issue date: 2011-05-04"
  ],
  "handle": "27767",
  "identifier_other": "etd-05172011-083405",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05172011-083405/",
  "identifier_uri": "http://hdl.handle.net/10919/27767",
  "publisher": "Virginia Tech",
  "relation_haspart": "Jones_FI_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "intervention",
    "at risk students",
    "middle school",
    "reading achievement"
  ],
  "title": "DOUGLAS MIDDLE SCHOOL: A CASE STUDY OF A MIDDLE SCHOOLâ  S IMPROVEMENT OF THE ACHIEVEMENT OF ITS AT-RISK STUDENTS",
  "type": "Dissertation"
}