{
  "contributor_author": "Abell, Meghann Lynn",
  "contributor_committeechair": "Bhattacharjee, Sudip",
  "contributor_committeemember": [
    "Barkhi, Reza",
    "Salbador, Debra A.",
    "Burge, Penny L.",
    "Jenkins, James Gregory"
  ],
  "contributor_department": "General Business, Accounting",
  "date_accessioned": "2014-03-14T20:12:10Z",
  "date_adate": "2010-06-14",
  "date_available": "2014-03-14T20:12:10Z",
  "date_issued": "2010-05-05",
  "date_rdate": "2012-04-06",
  "date_sdate": "2010-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "To assess fraud risk, auditors collect evidence in a sequential manner by reviewing workpaper documentation, and by collecting corroborating and clarifying information from financial (management) personnel and nonfinancial (operating) personnel. SAS 99 (AICPA, 2002) noted that audit evidence gathered from financial personnel may be susceptible to deception. In addition, prior researchers have found auditors to be poor at detecting deception immediately following deceptive communication. Though the audit process is sequential and iterative, these studies measured auditors창   ability to detect deception at a single point and did not provide corroborating evidence after the deceptive communication for auditors to revise their judgments. In this study, I examined auditors창   fraud risk assessments and truthfulness judgments throughout the audit process when there was an attempt at deception by management (financial) personnel. The belief adjustment model provided a framework to examine auditors창   initial judgments, their judgments directly following a deception attempt by financial personnel, and their judgments after receiving corroborating evidence from nonfinancial personnel.  <p> Sixty-four experienced auditors electronically completed one of four randomly assigned cases and, within each case, assessed the fraud risk, truthfulness, trustworthiness, and reliability of financial personnel at multiple points for a fictitious client. I manipulated the presence (absence) of fraud and the level of experience of the source of corroborating evidence (operating personnel). I hypothesized that auditors would not be able to differentially evaluate fraud risk and truthfulness judgments of financial personnel between the fraud and no fraud conditions when exposed to workpaper documentation and deceptive client inquiry evidence by management (financial personnel). However, I expected to find that auditors창   would update their fraud risk and truthfulness judgments as they reviewed audit evidence from nonfinancial (operating) personnel.  <p> The results indicate that auditors in this study are not able to appropriately assess fraud risk and the truthfulness of financial personnel following the review of workpaper and client inquiry evidence. While the client was deceptive in the fraud condition only, auditors did not differentially assess the fraud risk and truthfulness of financial personnel between the fraud and no fraud conditions. After auditors reviewed evidence from nonfinancial personnel, in the presence of fraud, auditors increased their fraud risk and decreased their truthfulness judgments of financial personnel as inconsistent evidence was presented from a corroborating source. Therefore, in the presence of fraud, auditors improved the effectiveness of the audit process by appropriately increasing their fraud risk assessments in light of inconsistent audit evidence from nonfinancial (operating) personnel. Of equal importance, in the absence of fraud, auditors decreased their fraud risk assessments as consistent evidence was presented from a corroborating source. Therefore, auditors increased the efficiency of the audit process by appropriately decreasing their fraud risk assessments after integrating consistent audit evidence from nonfinancial personnel into their judgments. Further, I observed that these auditors revised their fraud risk assessments to a greater extent when audit evidence was provided by a source with a higher level of experience. <p> Though prior research has found auditors to be poor at detecting deception, the results of this study indicate that auditors will increase or decrease their fraud risk assessments and truthfulness judgments based on the consistency of audit evidence gathered from a corroborating source. Therefore, in practice, auditors may be able to detect deception as the audit progresses.",
  "description_provenance": [
    "Author Email: meabell@vt.edu",
    "Advisor Email: reza@vt.edu",
    "Advisor Email: sudipb@vt.edu",
    "Advisor Email: salbador@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: greg.jenkins@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:10Z (GMT). No. of bitstreams: 1 Abell_ML_D_2010.pdf: 816245 bytes, checksum: 737a751c1c99711c6d052e65afa70ee2 (MD5)   Previous issue date: 2010-05-05"
  ],
  "handle": "27763",
  "identifier_other": "etd-05172010-142409",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05172010-142409/",
  "identifier_uri": "http://hdl.handle.net/10919/27763",
  "publisher": "Virginia Tech",
  "relation_haspart": "Abell_ML_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Belief Adjustment Model",
    "Auditing",
    "Assessing Truthfulness",
    "Fraud Risk",
    "Experience"
  ],
  "title": "Assessing Fraud Risk, Trustworthiness, Reliability, and Truthfulness:  Integrating Audit Evidence from Multiple Sources",
  "type": "Dissertation"
}