{
  "contributor_author": "Kim, Si  Jung",
  "contributor_committeecochair": [
    "Winchester, Woodrow W. III",
    "Smith-Jackson, Tonya L."
  ],
  "contributor_committeemember": [
    "Abbott, A. Lynn",
    "Lockhart, Thurmon E."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:12:11Z",
  "date_adate": "2010-06-14",
  "date_available": "2014-03-14T20:12:11Z",
  "date_issued": "2010-05-03",
  "date_rdate": "2010-06-14",
  "date_sdate": "2010-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The World Health Organization (WHO) estimates 488 million people worldwide suffer from a visual impairment and of these about 327 million have severe visual impairments.  Some individuals with severe visual impairments can navigate and orient independently in well-known surroundings, but even for these people independent navigation and orientation are likely to be a challenge in unfamiliar places.  To overcome these challenges, assistive technologies have been developed to support independent wayfinding tasks; however, those with severe visual impairments often experience frustration when they try to use assistive technologies since these technologies lack address the environmental factors that influence their independent wayfinding.    This research developed and evaluated the efficacy of a framework called an environmental user interface (EUI).  In particular, this research explored whether or not the proposed EUI framework was effective when used with user-centered design (UCD) to design a wayfinding system to capture environmental requirements, thus aiding those with severe visual impairments.  Two studies, the first of which consisted of a requirements elicitation and the second usability testing, were conducted.  The studies revealed that the EUI framework was indeed more effective than the conventional UCD design method alone in identifying environmental factors, and participants with severe visual impairments preferred to use the prototype designed using UCD and the EUI framework.    The proposed EUI framework was found to be an effective way to enhance the design process as it played an important role in eliciting a greater number of environmental factors, and hence produced a device that was preferred by the users with visual impairments.  Both prototypes influenced how well the wayfinding tasks were performed by the five participants with severe visual impairments, but the prototype implemented based on the requirements elicited by UCD and the EUI framework was much preferred by the participants.",
  "description_provenance": [
    "Author Email: hikim@vt.edu",
    "Advisor Email: abbott@vt.edu",
    "Advisor Email: wwwinche@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: lockhart@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:11Z (GMT). No. of bitstreams: 2 ise_sijung_kim_dissertation_v3.pdf: 5844301 bytes, checksum: fdbbdb596260f08a458d930c4caeeef2 (MD5) IRBApprovalLetters.pdf: 405003 bytes, checksum: d9a197703f65095f75ad8eb0029ddde4 (MD5)   Previous issue date: 2010-05-03"
  ],
  "handle": "27764",
  "identifier_other": "etd-05172010-143629",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05172010-143629/",
  "identifier_uri": "http://hdl.handle.net/10919/27764",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ise_sijung_kim_dissertation_v3.pdf",
    "IRBApprovalLetters.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "assistive technology",
    "user interface",
    "framework",
    "wearable computer",
    "participatory design",
    "wayfinding",
    "severe visual impairment",
    "human computer interaction"
  ],
  "title": "An Environmental User Interface (EUI) Framework to Convey Environmental Contexts In Interactive Systems Design",
  "type": "Dissertation"
}