{
  "contributor_author": "Buscher, Jamie Todd",
  "contributor_committeechair": "Spotila, James A.",
  "contributor_committeemember": [
    "Eriksson, Kenneth A.",
    "Law, Richard D.",
    "Hole, John A."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:12:10Z",
  "date_adate": "2007-05-31",
  "date_available": "2014-03-14T20:12:10Z",
  "date_issued": "2007-05-03",
  "date_rdate": "2007-05-31",
  "date_sdate": "2007-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Pacific-North American plate boundary is typified by transpression and convergence, yet the relationship between interplate deformation and long-term crustal shortening is not fully understood. The continuous belt of rugged topography that extends along the entire plate boundary is generally associated with oblique tectonic plate motion, strong interplate coupling, and terrane accretion, but relating plate boundary orogenesis to variations in plate geometry and behavior requires detailed case studies. The northern San Gabriel Mountains along the San Andreas fault and the Chugach-Kenai Mountains above the Aleutian subduction zone are located along highly tectonically active sections of the Pacific-North American plate boundary and have not been studied from the context of long-term landscape development. To determine whether mountain building along these sections of the plate boundary reflects recent, rapid exhumation as observed in bordering mountain belts, low-temperature thermochronometry and topographic analyses were applied to each area. In the northern San Gabriel Mountains, apatite (U-Th)/He ages are >10 Ma along narrow crystalline ridges topped by low-slope erosional surfaces located within ~5 km of the San Andreas fault zone. In the Chugach-Kenai Mountains, the youngest apatite (U-Th)/He ages (~5 Ma) are an order of magnitude older than those from the Yakutat collision zone to the east, despite the presence of a continuous swath of glaciated, rugged topography between the two areas. Exhumation rates inferred from these ages are <1 mm/yr, suggesting that there has been minimal recent denudation in the northern San Gabriel and Chugach-Kenai Mountains. The lack of evidence for recent mountain building in both of these case studies implies that interplate deformation is heterogeneous and that other factors (secondary structures, climate) besides plate kinematics and topographic character must be considered for understanding landscape development.",
  "description_provenance": [
    "Author Email: jbuscher@vt.edu",
    "Advisor Email: kaeson@vt.edu",
    "Advisor Email: rdlaw@vt.edu",
    "Advisor Email: spotila@vt.edu",
    "Advisor Email: hole@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:10Z (GMT). No. of bitstreams: 1 Buscher_Dissertation.pdf: 25419956 bytes, checksum: 328e3063bb4f0e4fdce4340e3ddc9e19 (MD5)   Previous issue date: 2007-05-03"
  ],
  "handle": "27760",
  "identifier_other": "etd-05172007-142319",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05172007-142319/",
  "identifier_uri": "http://hdl.handle.net/10919/27760",
  "publisher": "Virginia Tech",
  "relation_haspart": "Buscher_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ArcGIS",
    "southern San Andreas fault",
    "(U-Th)/He dating",
    "Aleutian subduction zone",
    "exhumation"
  ],
  "title": "Long-term exhumation of landscapes along the Pacific-North American plate boundary as inferred from apatite (U-Th)/He and ArcGIS analyses",
  "type": "Dissertation"
}