{
  "contributor_author": "Ratta, Varun",
  "contributor_committeechair": "Wilkes, Garth L.",
  "contributor_committeemember": [
    "Cox, David F.",
    "Ward, Thomas C.",
    "Davis, Richey M.",
    "Marand, Hervé L.",
    "McGrath, James E."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:12:13Z",
  "date_adate": "1999-05-21",
  "date_available": "2014-03-14T20:12:13Z",
  "date_issued": "1999-04-26",
  "date_rdate": "2000-05-21",
  "date_sdate": "1999-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "It was the objective of this research to develop high temperature and high performance polyimides that also display (a) thermal stability; (b) crystallinity in the initial material and ability to crystallize from the melt; (c) fast crystallization kinetics and (d) melt processability.  This unique combination of properties is presently unavailable in any other polyimide.  In this regard, the present work investigates the crystallization, morphology and thermal stability of two novel semicrystalline polyimides based on the same diamine, 1,3-bis (4-aminophenoxy) benzene (TPER), but two different dianhydrides, 3,3',4',4'-biphenyltetracarboxylic dianhydride (BPDA) and 3,3',4,4'-benzophenonetetracarboxylic dianhydride (BTDA).  Phthalic anhydride was used as an endcapper to improve the thermal stability of the polyimides.  The BPDA based polyimide was also tested extensively as a structural adhesive using Ti-6Al-4V coupons.  Additionally, these polyimides are based on monomers, that are presently commercially available.<p>      The bulk thermal stability of the polyimides was first evaluated using dynamic and isothermal thermogravimetric experiments.  DSC was utilized to test the ability of the polyimides to crystallize from the melt after exposures to varying melt times and temperatures.  Exceptional thermal stability was demonstrated by BPDA based polyimide with no change in the melting behavior after 40 min at 430Â°C or 30 min at 440Â°C.  The semicrystalline morphology of the material was studied using hot stage polarized optical microscopy (OM) and atomic force microscopy.  The spherulitic growth rates were determined as a function of crystallization temperature after quenching from various melt times and temperatures.  The effect of crystallization temperature, previous melt time and melt temperature on the morphology was considered.  The spherulitic growth rates increased with increasing undercooling in the temperature range studied (nucleation controlled), while the growth rate at a specific crystallization temperature decreased on increasing the previous melt time and temperature.  The melting behavior was studied after different crystallization times and temperatures and also as a function of different heating rates.  Crystallization kinetics was followed both isothermally and non-isothermally using DSC and OM.  Avrami analysis was performed for TPER-BPDA and the obtained results were correlated with microscopic observations.  Melt viscosity measurements were carried out as a function of melt temperature, melt time and frequency.  The adhesive investigations for TPER-BTDA utilized lap-shear test, wedge test and double cantilever beam tests.  The durability of the adhesive and the fracture surface was studied after exposure to various solvents and after high aging and testing temperatures.  The polyimide demonstrated very high average room temperature lap-shear strengths (8400 psi or 59 MPa), excellent solvent resistance and durability of strengths at high aging and testing temperatures.",
  "description_provenance": [
    "Author Email: vratta@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:13Z (GMT). No. of bitstreams: 17 6list.pdf: 37596 bytes, checksum: 8aa3266dea94f7564fe99118b650772e (MD5) 5table.pdf: 12830 bytes, checksum: 805cd1b14eba53de8e47826b186f0d0d (MD5) polyimide6.pdf: 1109458 bytes, checksum: 314f451e7319341d873d848864a2ad41 (MD5) polyimide7.pdf: 429536 bytes, checksum: de17af09da8cb595260600648f952f32 (MD5) polyimide2.pdf: 780842 bytes, checksum: 46a258c5acd562fed64a4ca4401a9d64 (MD5) polyimide1.pdf: 131881 bytes, checksum: 123e20af91827677534082c113d6aefb (MD5) 1title.pdf: 4778 bytes, checksum: 84c944429e1494bdb4596411eba39fdc (MD5) polyimide3.pdf: 336615 bytes, checksum: c9bbf05c747dab30ea330c07cdbc6a80 (MD5) 4acknowledgements.pdf: 9384 bytes, checksum: 795b1aeeb35b21aef2d164b91ade8daf (MD5) vita.pdf: 4653 bytes, checksum: 0cc4360ec34281c48959f787c56feb55 (MD5) 3dedication.pdf: 3373 bytes, checksum: 5f74be6032125eba9c8b26edf547af28 (MD5) polyimide9.pdf: 24403 bytes, checksum: 69ced7a4223bdcb2e9d36336b6605690 (MD5) 2abstract.pdf: 8696 bytes, checksum: 09e898b74cbd4e04a5d4164bbb1aeb00 (MD5) introduction.pdf: 10118 bytes, checksum: 12b30fd6318fe41bbbebb35ac4366c6e (MD5) polyimide8.pdf: 516513 bytes, checksum: 20212f16f04ceb047b282261038d74a1 (MD5) polyimide5.pdf: 409516 bytes, checksum: a01d484ecc8a13a2c4f9fdab907a5f0e (MD5) polyimide4.pdf: 622126 bytes, checksum: 364e511a5a8895b4a284f1fa0fad8227 (MD5)   Previous issue date: 1999-04-26"
  ],
  "handle": "27771",
  "identifier_other": "etd-051799-162256",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-051799-162256/",
  "identifier_uri": "http://hdl.handle.net/10919/27771",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "6list.pdf",
    "5table.pdf",
    "polyimide6.pdf",
    "polyimide7.pdf",
    "polyimide2.pdf",
    "polyimide1.pdf",
    "1title.pdf",
    "polyimide3.pdf",
    "4acknowledgements.pdf",
    "vita.pdf",
    "3dedication.pdf",
    "polyimide9.pdf",
    "2abstract.pdf",
    "introduction.pdf",
    "polyimide8.pdf",
    "polyimide5.pdf",
    "polyimide4.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Morphology",
    "Crystallization Kinetics",
    "Thermal Stability",
    "Lap-shear",
    "Crystallization",
    "Adhesive",
    "Polyimides"
  ],
  "title": "Crystallization, Morphology, Thermal Stability and Adhesive Properties of Novel High Performance Semicrystalline Polyimides",
  "type": "Dissertation"
}