{
  "contributor_author": "Su, Yuling Lianna",
  "contributor_committeecochair": [
    "Rogers, Cosby Steele",
    "Burge, Penny L."
  ],
  "contributor_committeemember": [
    "Benson, Mark J.",
    "Stremmel, Andrew J."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:12:14Z",
  "date_adate": "2005-05-25",
  "date_available": "2014-03-14T20:12:14Z",
  "date_issued": "2005-05-05",
  "date_rdate": "2007-05-25",
  "date_sdate": "2005-05-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this phenomenological study was to illuminate the experiences of six teachers in southwestern Virginia who are working with toddlers and preschoolers from diverse cultural and linguistic backgrounds. These young children were those whose first language is not English and their parents were from countries other than the United States. A phenomenological research method was chosen because the main focus of the study was to learn about teachersâ   experiences and that method is a tool to explore the essence of human experiences. The study was guided by the main research question: What are teachersâ   experiences working with these children? Semi-structured interviews were conducted with six toddler and preschool teachers from two day care and development centers. Observations of classroom teaching added vital information to the data collected through interviews. Other tools for data collection included field notes and a researcherâ  s journal. These tools were used to gain a deeper understanding of this phenomenon. Strategies for examining the data for this study were narrative, thematic, and constant comparative analysis. Five major themes emerged from the teachersâ   experiences: (1) Types of teachersâ   experiences, which include learning, challenging, interesting and fulfilling experiences, (2) The interaction among experiences and changes in teaching strategies and self-perception, (3) Teachersâ   relationships with these children, (4) Teachersâ   relationships with these parents, and (5) Common resources for teachers working with these children. The findings suggested recommendations for future research and practice in the field of early childhood education. The study also generated stories and thick, detailed descriptions of teachersâ   experiences. The study was intended to inspire other teachers in similar settings to share stories and encourage colleagues.",
  "description_provenance": [
    "Author Email: yulings@vt.edu",
    "Advisor Email: rogersco@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: mbenson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:14Z (GMT). No. of bitstreams: 1 Final_v3_ETD.pdf: 845608 bytes, checksum: cf54ab4b9a88387139a03ebb4f541f86 (MD5)   Previous issue date: 2005-05-05"
  ],
  "handle": "27778",
  "identifier_other": "etd-05182005-134353",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05182005-134353/",
  "identifier_uri": "http://hdl.handle.net/10919/27778",
  "publisher": "Virginia Tech",
  "relation_haspart": "Final_v3_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "qualitative inquiry",
    "teacher-child relationships",
    "teacher education",
    "multicultural education"
  ],
  "title": "Understanding Teachersâ   Experiences Working with Young Children from Diverse Cultural and Linguistic Backgrounds",
  "type": "Dissertation"
}