{
  "contributor_author": "Jacob, John Bryan",
  "contributor_committeemember": [
    "Christianson, Scott",
    "Kilkelly, Ann G.",
    "Lovingood, Rebecca P.",
    "Allen, Katherine R.",
    "Giddings, Valerie L.",
    "Cerny, Catherine",
    "Christianson, Scott",
    "Kilkelly, Ann G.",
    "Lovingood, Rebecca P.",
    "Allen, Katherine R.",
    "Giddings, Valerie L.",
    "Cerny, Catherine"
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2014-03-14T20:12:12Z",
  "date_adate": "1999-05-17",
  "date_available": "2014-03-14T20:12:12Z",
  "date_issued": "1999-05-07",
  "date_rdate": "2000-05-17",
  "date_sdate": "1999-05-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research considers the connections between appearance and identity apparent in the social experience of five gay male drag queens. Appearing at variance with gender norms that underwrite male appearance in mainstream society and among gay men prompted social consequences that impacted their identities and world views.  One aim is to apprehend the experiences of difference that drag appearance manifest and expressed. Another aim is to gain a new perspective on the social construction of gendered appearances from marginalized persons who seem to look from the \"outside\" in toward mainstream social appearances and relations.  Qualitative analysis relied on interview data and occurred using grounded theory methodology. However, analysis gained focus and intensified by engaging Stone's (1970) theorizing on \"Appearance and the Self,\" Feminist articulations of \"the gaze\" and poststructural conceptions of the discursively constituted person as \"the subject.\" This research especially emphasizes the points of connection between Stone's theorizing and more recent feminist theoretical advancements on the gaze as they each pertain to appearance, identity and social operations of seeing and being seen. Yet there is also consideration of the manners in which gendered appearance norms circulate in discourse and permeate the individual psyche.  The research findings also locate social consequences of transgressing male appearance norms. These drag queens' interviews revealed that they used appearance to visibly portray gendered identities. Manners in which they related their drag appearances to the self were suggestive that gender identities are states of consciousness stemming from one's imagined connections to mass cultural conceptions of male and/or female. Where most people seem to commit themselves exclusively to male or female appearance repertoires and identity sets, these men indicated that they made both male and female identifications. These mixed identifications, which could have remained hidden, materialized when they did drag. In a sense, by doing drag, they performed their gender ambivalence. Their drag appearances were meta-performances that referred both to their own ambivalence with the gender binary, and to how appearance assists in constructing, maintaining and communicating (i.e., performing) status quo gendered identities.",
  "description_provenance": [
    "Author Email: jbjacob@earthlink.net",
    "Advisor Email: akilkell@vt.edu",
    "Advisor Email: rlovingo@vt.edu",
    "Advisor Email: Kallen@vt.edu",
    "Advisor Email: vgidding@vt.edu",
    "Advisor Email: Cerny2000@aol.com",
    "Advisor Email: akilkell@vt.edu",
    "Advisor Email: rlovingo@vt.edu",
    "Advisor Email: Kallen@vt.edu",
    "Advisor Email: vgidding@vt.edu",
    "Advisor Email: Cerny2000@aol.com",
    "Made available in DSpace on 2014-03-14T20:12:12Z (GMT). No. of bitstreams: 1 PDF.pdf: 650960 bytes, checksum: 3b57832dd1902f306d5ecf42c2960450 (MD5)   Previous issue date: 1999-05-07"
  ],
  "handle": "27770",
  "identifier_other": "etd-051799-115007",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-051799-115007/",
  "identifier_uri": "http://hdl.handle.net/10919/27770",
  "publisher": "Virginia Tech",
  "relation_haspart": "PDF.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Gay Studies",
    "Women's Studies",
    "Identity",
    "Gender",
    "Appearance",
    "Gay Studies",
    "Women's Studies",
    "Identity",
    "Gender",
    "Appearance"
  ],
  "title": "The Haus of Frau:  Radical Drag Queens Disrupting the Visual Fiction of Gendered Appearances",
  "type": "Dissertation"
}