{
  "contributor_author": "Jones, Jason William",
  "contributor_committeechair": "Gibson, Harry W.",
  "contributor_committeemember": [
    "Long, Timothy E.",
    "McGrath, James E.",
    "Marand, Hervé L.",
    "Esker, Alan R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:12:13Z",
  "date_adate": "2004-05-28",
  "date_available": "2014-03-14T20:12:13Z",
  "date_issued": "2004-05-13",
  "date_rdate": "2004-05-28",
  "date_sdate": "2004-05-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "We report for the first time a broad equilibrium model describing the complexation of ionic species in non-aqueous media that explicitly includes ion pairing for one of the components and that relies upon activities rather than molar concentrations.  This model directly contradicts existing commonplace equilibrium treatments, which were shown to be incomplete, often invalid, and misleading.  Experimental validation of our model was achieved through studies of pseudorotaxane formation between dibenzylammonium salts (DBAm-X) and dibenzo-24-crown-8 (DB24C8) in CDCl3:CD3CN (3:2).  In that particular case, we showed that fluctuations in the apparent Ka,exp values as usually reported are attributable to ion pairing, with a dissociation constant Kipd, and that the constant Kassoc for pseudorotaxane complexation is independent of the counterion, a result of the complex existing in solution as a free cation.  In accord with this model, we further described a straightforward and simple method to increase the extent of complexation by using either a ditopic cation and anion host, or adding to the charged host/guest solution a molecularly separate host capable of complexing the dissociated counterion.  Also in accord with this model, we investigated the influence of the solventÂ¡Â¯s dielectric constant on Kipd and Kassoc.  On the basis of competing condensation reactions between amines and ketones which were shown to occur within the timescale of host/guest recognition, we also challenged the commonly employed use of acetone in similar complexation studies involving 2o ammonium ions.   Because a major goal of this work was to ultimately increase binding efficiency and selectivity, we explored new methods to drive complexation in related pseudorotaxane systems.  We noted that addition of di- or tri-topic hydrogen bond accepting anions to solutions of bis(5-hydroxymethyl-1,3-phenylene)-32-crown-10 or bis(5-carboxy-1,3-phenylene)-32-crown-10 and paraquat di(hexafluorophosphate) served to significantly enhance host/guest interaction.  The addition of Et4N+TFA- to an acetone solution of diacid crown and paraquat 2PF6 effectively boosted Ka,exp 40-fold, as estimated by 1H NMR studies.  Similar increases in the apparent Ka,exp were observed upon the addition of n-Bu4N+OTs-.  Evidenced by crystal structures, the increase in association resulted from chelation of the OH moieties of the crown by the di- or tri-topic anions, forming supramolecular bicyclic macrocycles (pseudocryptands) and stabilizing the complex in a cooperative manner.  Significantly, Ka,exp of one of the pseudocryptands was shown to equal that determined in the corresponding cryptand complex.",
  "description_provenance": [
    "Author Email: jwjones@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: hmarand@vt.edu",
    "Advisor Email: hwgibson@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:13Z (GMT). No. of bitstreams: 1 JWJ_ETD.pdf: 3375742 bytes, checksum: 896aaa426baa6a9b5917e6958082a80c (MD5)   Previous issue date: 2004-05-13"
  ],
  "handle": "27775",
  "identifier_other": "etd-05182004-133700",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05182004-133700/",
  "identifier_uri": "http://hdl.handle.net/10919/27775",
  "publisher": "Virginia Tech",
  "relation_haspart": "JWJ_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "pseudocryptand",
    "pseudorotaxane",
    "secondary ammonium",
    "supramolecular chemistry",
    "ion pairing",
    "equilibrium constants"
  ],
  "title": "Quantification of Supramolecular Complexes Involving Charged Species in Non-Aqueous Solvents: Theory and Application",
  "type": "Dissertation"
}