{
  "contributor_author": "Sanchez Sierra, Juan Carlos",
  "contributor_committeechair": "Luke, Timothy W.",
  "contributor_committeemember": [
    "Luciak, Ilja A.",
    "Shadle, Brett L.",
    "Panford, Moses E."
  ],
  "contributor_department": "Alliance for Social, Political, Ethical, and Cultural Thought",
  "date_accessioned": "2014-03-14T20:12:15Z",
  "date_adate": "2011-05-31",
  "date_available": "2014-03-14T20:12:15Z",
  "date_issued": "2011-04-28",
  "date_rdate": "2011-05-31",
  "date_sdate": "2011-05-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research explores cult formation and sect-like worship in the Ejército de Liberación Nacional (ELN), around the figures of both the priest and guerrilla fighter Camilo Torres (1929-1966), and Fabio Vásquez, leader and founder of the group in 1963-1978. I examine the relationship between authority and obedience that shaped political leadership in Colombia since the late 19th century. In particular, I consider how collective moral and individual values become ritualized in daily practices and moral discourses fostered by leaders that promoted drastic social change along Colombian history. This analysis of authority and obedience facilitates interpretations into how leaders create allegiances and legitimize violence as a strategy to bring about change in Colombian politics. I argue that the politics of magnicidio demonstrates how the formation of leadership is hampered by the use of selective violence, as a strategy to dismantle or deter political opponents from participation. This happens in both mainstream politics and within insurgent groups. In this vein, I argue that by approaching the figure of Camilo Torres and the reverence to his memory, it is possible to understand the importance of leadership and authority both in a guerrilla group, and in social mobilization, particularly the student movement, intellectual sectors, and the youth. I sustain that reverence to Camilo Torres has been fostered primarily outside the ELN. Although the ceremonies around his figure and the revolutionary project progressively furnished the group with a consistent pattern of belief for individual and group interaction, his leadership in the groups was not substantial. I demonstrate how Camilo Torres surrendered to the leadership of Fabio Vásquez in an attempt to become a suitable guerrillero. I argue that beyond claims for Camilo Torres' political legacy, guerrilla fighters in the ELN used his thought to challenge and undermine Fabio Vásquez' personalistic leadership in 1967-1974. Although the figure of Camilo Torres created internal cohesion, the ELN‘s re-conceptualization of the revolutionary project used his life only as a paradigm of commitment, sacrifice and revolutionary redemption, ignoring the priest's political ideals and assertions on social justice, charity and love. I conclude by exploring Camilo Torres' thought and actions in order to demonstrate how the ELN selectively interprets his legacy, and thereby justify the last months of his life to legitimize radical left leaning fighting.",
  "description_provenance": [
    "Author Email: jcsierra@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Advisor Email: iluciak@vt.edu",
    "Advisor Email: shadle@vt.edu",
    "Advisor Email: mpanford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:15Z (GMT). No. of bitstreams: 1  Sanchez_JC_D_2011.pdf: 1942407 bytes, checksum: f89363ef4cfe368af92d7d10286164d9 (MD5)    Previous issue date: 2011-04-28"
  ],
  "handle": "27786",
  "identifier_other": "etd-05182011-020323",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05182011-020323/",
  "identifier_uri": "http://hdl.handle.net/10919/27786",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sanchez_JC_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Colombia",
    "ideology",
    "leadership",
    "cult formation",
    "guerrilla",
    "insurgence",
    "ELN"
  ],
  "title": "WORSHIPING LEADERSHIP: MORALITY, REVOLUTIONARY VALUES, AND THE POLITICS OF MAGNICIDIO (ASSASSINATION) IN THE CASE OF CAMILO TORRES AND FABIO VÃ SQUEZ WITH THE ELN, COLOMBIA 1963-1978",
  "type": "Dissertation"
}