{
  "contributor_author": "Ewing, Janice A.",
  "contributor_committeechair": "Allen, Katherine R.",
  "contributor_committeemember": [
    "Meszaros, Peggy S.",
    "Sporakowski, Michael J.",
    "Nespor, Jan K.",
    "Stith, Sandra M."
  ],
  "contributor_department": "Family and Child Development",
  "date_accessioned": "2014-03-14T20:12:14Z",
  "date_adate": "2007-05-18",
  "date_available": "2014-03-14T20:12:14Z",
  "date_issued": "1997-04-18",
  "date_rdate": "2007-05-18",
  "date_sdate": "2007-05-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine complexities which constitute womenâ  s narratives in a conservative Christian church context.  Complexities often occur around self-perception, religious beliefs, choices and change, in regard to gender relations. A review of literature indicated that social constructions about gender influence the way individuals construct narratives and meaning about their lives, which inform them how to live.  Taking into account how reality is constructed though social dialogue an emphasis was placed on understanding how individuals conform and reform knowledge.  This is often accomplished through the use of language around cultural and personal narratives.",
  "description_provenance": [
    "Author Email: none@vt.edu",
    "Advisor Email: meszaros@vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: sstith@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:14Z (GMT). No. of bitstreams: 1  LD5655.EWING_1997.pdf: 5836751 bytes, checksum: 3d1358e7abeb63ee1b8ad7ae09b39eeb (MD5)    Previous issue date: 1997-04-18"
  ],
  "handle": "27781",
  "identifier_other": "etd-05182007-143516",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05182007-143516/",
  "identifier_uri": "http://hdl.handle.net/10919/27781",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.EWING_1997.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "religion",
    "personal narrative",
    "Christianity",
    "gender studies",
    "women",
    "attitude"
  ],
  "title": "Narratives about God and Gender: Women's experiences",
  "type": "Dissertation"
}