{
  "contributor_author": "Hardwicke, Shannon Bragg",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Little, Jamie O.",
    "Lepczyk, Billie F.",
    "Aspelmeier, Jeffery"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:14Z",
  "date_adate": "2006-10-16",
  "date_available": "2014-03-14T20:12:14Z",
  "date_issued": "2006-05-05",
  "date_rdate": "2009-10-16",
  "date_sdate": "2006-05-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT The purpose of this study was to examine a sample of students who participated in a student assistance program in Southwest Virginia.  Using existing data from a school system in Southwest Virginia, this sample was observed to measure changes in student academic performance.  The sample was also examined to determine the extent to which they instituted positive behaviors such as school attendance and reduction of disciplinary actions taken.  In addition, this study assessed differences in demographic characteristics among student participants.  Also studied was the extent to which gender differences related to academic performance and behavior. \tSignificant changes in studentsâ   academic performance, attendance and disciplinary measures were established in the present study.  Negative associations were established for those participating in the student assistance program and grade point average.  Positive associations were found for those participating in SAP and attendance and disciplinary measures.  No significant differences were yielded in the comparison of gender to academic performance and behavior. \tSAP coordinators recorded that the majority of participants did improve since referral to program and most completed or currently remained in the student assistance program. However, a small percentage of students actually entered treatment programs following recommendations made to parents from the student assistance program committee. \tThis research assessed only the demographic and individual characteristics: gender, gifted or special education status, ethnicity and age.  Therefore, other demographics such as socio economic status may offer additional explanation into academic and behavior outcomes of students involved in student assistance programs.",
  "description_provenance": [
    "Author Email: shbragg@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: littlej@vt.edu",
    "Advisor Email: blepczyk@vt.edu",
    "Advisor Email: jaspelme@radford.edu",
    "Made available in DSpace on 2014-03-14T20:12:14Z (GMT). No. of bitstreams: 1 An_Analysis_of_Student_Assistance-old.pdf: 683954 bytes, checksum: b8b14c46fc65ad8c99d6bb0d4e016e11 (MD5)   Previous issue date: 2006-05-05"
  ],
  "handle": "27780",
  "identifier_other": "etd-05182006-065659",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05182006-065659/",
  "identifier_uri": "http://hdl.handle.net/10919/27780",
  "publisher": "Virginia Tech",
  "relation_haspart": "An_Analysis_of_Student_Assistance-old.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "school based intervention programs",
    "student assistance programs",
    "SAP"
  ],
  "title": "An Analysis of Student Assistance Programs",
  "type": "Dissertation"
}