{
  "contributor_author": "Voice, Peter James",
  "contributor_committeechair": "MichaÅ  J. Kowalewski,",
  "contributor_committeemember": [
    "Patricia Dove",
    "Kenneth A. Eriksson",
    "Shuhai Xiao",
    "Read, James Fredrick"
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:12:15Z",
  "date_adate": "2010-05-28",
  "date_available": "2014-03-14T20:12:15Z",
  "date_issued": "2010-05-04",
  "date_rdate": "2013-05-21",
  "date_sdate": "2010-05-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Published detrital zircon geochronological data was compiled to form the Global Detrital Zircon Database (GDZDb). This database provides a reference block for provenance analysis by future detrital zircon geochronological studies. This project entailed three subprojects: 1. crustal growth/crustal recycling patterns, 2. a provenance study of the Triassic Dry Fork Formation of the Danville-Dan River Rift basin of Virginia and North Carolina, and 3. sample size issues in detrital zircon studies.<p> The global detrital zircon age frequency distribution exhibits six prominent, statistically significant peaks: 3.2-3.0, 2.7-2.5, 2.0-1.7, 1.2-1.0, 0.7-0.5, and 0.3-0.1 Ga. These peaks are also observed when the data is sorted for continent of origin, the tectonic setting of the host sediment and for modern river sediments. Hf isotope model ages were also incorporated into the database where grains were dated with both U-Pb and Hf isotopes. The Hf isotope model ages suggest that the majority of detrital zircons U-Pb ages reflect crustal recycling events that generated granitic magmatism, as most grains exhibited Hf isotope ages that are much older than the corresponding U-Pb age.<p> The Triassic Dry Fork Formation was sampled from a site in southern Virginia in the Danville-Dan River Basin. The detrital zircon age frequency distribution for this formation was strongly unimodal with a peak at 400-450 Ma and a paucity of Grenville-age zircons. Comparison of the Dry Fork sample to published east coast data and to the North American record (from the GDZDb) illustrate the unusual nature of the Dry Fork Formation sample. It is probable that older Grenville zircons were blocked from the rift valley by the rift shoulder.<p> Using the GDZDb a study of sample size was conducted in order to estimate the best sample size to use when trying to constrain the maximum age of sedimentation of the host sediment. Rift basins and active margins exhibited smaller offsets from the youngest zircon grain age to host sediment maximum age than observed in samples from passive margins. This study recommends that at least 50 grains need to be age dated on average in order to best constrain the age of the host sediment.",
  "description_provenance": [
    "Author Email: voicep@vt.edu",
    "Advisor Email: dove@vt.edu",
    "Advisor Email: michalk@vt.edu",
    "Advisor Email: kaeson@vt.edu",
    "Advisor Email: xiao@vt.edu",
    "Advisor Email: jread@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:15Z (GMT). No. of bitstreams: 1 Voice_dissertation_2010.pdf: 3104131 bytes, checksum: 735fb3239374c4566bde79dc3fe20b15 (MD5)   Previous issue date: 2010-05-04"
  ],
  "handle": "27785",
  "identifier_other": "etd-05182010-151008",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05182010-151008/",
  "identifier_uri": "http://hdl.handle.net/10919/27785",
  "publisher": "Virginia Tech",
  "relation_haspart": "Voice_dissertation_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Dry Fork Formation",
    "detrital zircon",
    "Triassic",
    "U-Pb dating"
  ],
  "title": "The Global Detrital Zircon Database: Quantifying the Timing and Rate of Crustal Growth",
  "type": "Dissertation"
}