{
  "contributor_author": "Appuhamy, Jayasooriya  Arachchige Don Ranga Niroshan",
  "contributor_committeechair": "Hanigan, Mark D.",
  "contributor_committeemember": [
    "Akers, Robert Michael",
    "Pearson, Ronald E.",
    "Knowlton, Katharine F.",
    "Escobar, Jeffery"
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:12:15Z",
  "date_adate": "2010-06-18",
  "date_available": "2014-03-14T20:12:15Z",
  "date_issued": "2010-04-16",
  "date_rdate": "2010-06-18",
  "date_sdate": "2010-05-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Dairy cows inefficiently convert dietary protein to milk protein causing economic and environmental costs. Amino acids (AA), insulin, and glucose significantly enhance muscle protein synthesis efficiencies. The objectives of this research project were 1) to investigate the regulatory effects of essential AA (EAA) and their interactions with insulin, glucose and acetate on mammary protein synthesis rates, 2) to investigate whether branched chain amino acids (BCAA): leucine , isoleucine , and valine , become limiting for milk protein synthesis when Met and Lys supply were not limiting, and 3) to develop a mathematical representation for the EAA and insulin effects on cellular signals for protein synthesis. MAC-T cells were treated with EAA, insulin, glucose, and acetate to observe their individual and interactive effects on phosphorylation of mTOR, rpS6, S6K1, 4EBP1, eEF2, eIF2α, Akt, and AMPK. These signaling effects on protein synthesis rates were examined with mammary tissue slices.  A mathematical representation of the insulin and EAA effects was developed. The effects of supplementing BCAA on milk protein synthesis were investigated using nine Holstein cows, assigned to 7 d continuous jugular infusions of saline, Met and Lys, and Met and Lys plus BCAA.  Multiple essential amino acids, Leu, Ile, Met, and Thr were able to substantially regulate protein synthesis rates in bovine mammary cells by increasing (P < 0.05) phosphorylation of mTOR, S6k1, 4EBP1, and decreasing (P < 0.10) eEF2 phosphorylation. Insulin considerably (P < 0.10) exerted similar signaling effects in MAC-T cells, independent of EAA. Supplementation of only acetate increased (P = 0.09) mammary cell energy status as indicated by reduced AMPK phosphorylation in MAC-T cells. Neither acetate nor glucose had substantial regulatory effects on mammary protein synthesis rates. Although Met and Lys supplementation increased (P < 0.01) milk protein yields and protein efficiencies, there were no apparent benefits of BCAA supplementation under the feeding circumstances of our study. The developed mathematical model adequately represented the regulatory effects of EAA and insulin.  Such mathematical representations of regulatory effects of EAA and their interaction with other nutrients may improve our current AA requirement models to predict AA requirements of dairy cows with increased accuracy.",
  "description_provenance": [
    "Author Email: appuhamy@vt.edu",
    "Advisor Email: mhanigan@vt.edu",
    "Advisor Email: rma@vt.edu",
    "Advisor Email: rep@vt.edu",
    "Advisor Email: knowlton@vt.edu",
    "Advisor Email: escobar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:15Z (GMT). No. of bitstreams: 1 APPUHAMY_JADRN_D_2010.pdf: 1220710 bytes, checksum: 96eb3b9c065f983f2becf85d291bf066 (MD5)   Previous issue date: 2010-04-16"
  ],
  "handle": "27784",
  "identifier_other": "etd-05182010-143307",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05182010-143307/",
  "identifier_uri": "http://hdl.handle.net/10919/27784",
  "publisher": "Virginia Tech",
  "relation_haspart": "APPUHAMY_JADRN_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mammary",
    "protein synthesis",
    "mTOR",
    "essential amino acids"
  ],
  "title": "Regulatory Roles of Essential Amino Acids, Energy, and Insulin in Mammary Cell Protein Synthesis",
  "type": "Dissertation"
}