{
  "contributor_author": "Spielman, Laura Jacobsen",
  "contributor_committeechair": "Lloyd, Gwendolyn M.",
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Nespor, Jan K.",
    "Wilkins, Jesse L. M.",
    "Wilson, Melvin Skip"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:16Z",
  "date_adate": "2006-07-06",
  "date_available": "2014-03-14T20:12:16Z",
  "date_issued": "2006-05-08",
  "date_rdate": "2006-07-06",
  "date_sdate": "2006-05-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation represents a product of research conducted in 2004-2005 examining the curriculum network of an elementary teacher education program at a large public university in the United States. Using ethnographic data (e.g., interviews with preservice teachers and faculty, observations in and outside of coursework, and other artifacts), I address the questions of how preservice teachers characterized relationships between teacher education program components, how those characterizations varied and changed, and how preservice teachers explained the value or relevance of program components to teaching.   I discuss how preservice teachers shaped their understandings of main program emphases. I describe how they tended to experience closer correspondence between program recommendations and the policies and philosophies in certain schools and classrooms in suburban county schools near the university compared to the policies and philosophies in certain schools and classrooms they identified as having, for example, fewer resources (e.g., funds, manipulatives). I make the case that the program-based philosophies developed by and for the preservice teachers helped to coordinate context-specific meanings and relevance for program components and further to construct failures of the kind where either (1) schools interfered with the accomplishment of program objectives or (2) program objectives proved unrealistic for schools. Without intending to, and perhaps even contrary to certain program intentions, program suggestions treating instruction as context-independent tended to favor middle-class White children and to marginalize urban or diverse schools and classrooms, or schools having more limited resources, as viable places to engage in program-recommended practices for good teaching.  These results have potential implications for practice in teacher education and mathematics education and also have relevance to discussions of ongoing standards-based teacher education and mathematics education reforms. I offer that these results help to reveal certain limitations of popular ways of defining and researching preservice teachersâ   learning and teacher education program coursework and fieldwork relationships. I raise the question of whether teacher educators or researchers might benefit from considering how to more substantively integrate curriculum and give greater attention to place and to the broader socio-political goals we aim to accomplish through our work.",
  "description_provenance": [
    "Author Email: lspielman@radford.edu",
    "Advisor Email: lloyd@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: wilkins@vt.edu",
    "Advisor Email: skipw@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:16Z (GMT). No. of bitstreams: 1 Dissertation_LauraJSpielman.pdf: 774811 bytes, checksum: 9de53c4c212312f0fbbb77a381d9a6d3 (MD5)   Previous issue date: 2006-05-08"
  ],
  "handle": "27797",
  "identifier_other": "etd-05192006-102313",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05192006-102313/",
  "identifier_uri": "http://hdl.handle.net/10919/27797",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_LauraJSpielman.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "teacher education",
    "learning to teach",
    "mathematics education",
    "ethnography",
    "spatiality",
    "standards"
  ],
  "title": "Preservice Teachers' Characterizations of the Relationships Between Teacher Education Program Components: Program Meanings and Relevance and Socio-Political School Geographies",
  "type": "Dissertation"
}