{
  "contributor_author": "Koch, Douglas Spencer",
  "contributor_committeechair": "Sanders, Mark E.",
  "contributor_committeemember": [
    "Doolittle, Peter E.",
    "Skaggs, Gary E.",
    "Wells, John G."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:17Z",
  "date_adate": "2006-06-19",
  "date_available": "2014-03-14T20:12:17Z",
  "date_issued": "2006-05-08",
  "date_rdate": "2006-06-19",
  "date_sdate": "2006-05-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research was undertaken to investigate the effects of solid modeling and visualization on technical problem solving. The participants were 47 students enrolled in solid modeling classes at Southeast Missouri State University. The control and experimental groups consisted of 23 and 24 randomly assigned students respectively.   This study was a posttest only design that used logistic regression to analyze the results. Both groups were required to take the Purdue Spatial-Visualization Test/Visualization of Rotations (PSVT/TR). Participants in the control group used only sketching to design their solutions while participants in the experimental group used parametric solid modeling software to design their solutions. All participants then constructed prototypes of their designs. The prototype was evaluated to determine if it successfully met the design specifications.  The findings revealed that visualization was a significant predictor of technical problem solving as defined by successful prototype construction (p=.021). There was no significant difference between the sketching and solid modeling design methods used for technical problem solving (p=.752). The interaction between the method of design, solid modeling or sketching, was analyzed to determine if using solid modeling would offset low visualization scores It was found that the interaction was not significant (p=.393).",
  "description_provenance": [
    "Author Email: dskoch@semo.edu",
    "Advisor Email: msanders@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: jgwells@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:17Z (GMT). No. of bitstreams: 2 KochDissertation.pdf: 5086108 bytes, checksum: 6a0e1c38c0a5349368d9bcf514909776 (MD5) Video1.mpg: 4392464 bytes, checksum: f5899059abdbd310e03c8165e6c3c907 (MD5)   Previous issue date: 2006-05-08"
  ],
  "handle": "27799",
  "identifier_other": "etd-05192006-142531",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05192006-142531/",
  "identifier_uri": "http://hdl.handle.net/10919/27799",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "KochDissertation.pdf",
    "Video1.mpg"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Problem solving",
    "solid modeling",
    "spatial visualization"
  ],
  "title": "The Effects of Solid Modeling and Visualization On Technical Problem Solving",
  "type": "Dissertation"
}