{
  "contributor_author": "Sianez, David M.",
  "contributor_committeechair": "LaPorte, James E.",
  "contributor_committeemember": [
    "Skaggs, Gary E.",
    "Sanders, Mark E.",
    "Brusic, Sharon A.",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:16Z",
  "date_adate": "2003-05-27",
  "date_available": "2014-03-14T20:12:16Z",
  "date_issued": "2003-05-02",
  "date_rdate": "2003-05-27",
  "date_sdate": "2003-05-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated the usefulness of providing successful and unsuccessful example solutions in enhancing students' technological problem-solving efficiency. Prior research exploring worked example solutions indicated improved problem-solving efficiency when solutions were structured in a fashion that decreased the amount of extraneous cognitive load and increased the amount of germane cognitive load as specified by cognitive load theory. Fifty-one 7th and 8th grade students enrolled in technology education courses were selected from one school in the southwest region of Virginia. Participants completed three technological problem-solving tasks that included elevated load, cantilevered weight, and energy absorption using supply kits containing simple modeling materials. Problem-solving efficiency was determined by combining the amount of elapsed time across all three tasks. A 3 x 3 mixed factorial ANOVA was used to analyze the data. Data analysis revealed trends similar to worked example research in mathematics and science, but no significant difference among the three groups was found in this study.",
  "description_provenance": [
    "Author Email: dsianez@vt.edu",
    "Advisor Email: laporte@vt.edu",
    "Advisor Email: skaggs@vt.edu",
    "Advisor Email: sanders@vt.edu",
    "Advisor Email: brusic@vt.edu",
    "Advisor Email: burton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:16Z (GMT). No. of bitstreams: 4 sianezvita.pdf: 7057 bytes, checksum: f1bdca04c544290365127ed0514b9e45 (MD5) Sianezcontentspage.pdf: 22632 bytes, checksum: 1102ae5cca185ef3b27979284ead4761 (MD5) titleandabstract.pdf: 16687 bytes, checksum: f38e04d3fc99c4fa137df923424493f9 (MD5) Sianezchapters1-5.pdf: 973948 bytes, checksum: 3894fe46eca7d7acb11ba378a00d2cba (MD5)   Previous issue date: 2003-05-02"
  ],
  "handle": "27792",
  "identifier_other": "etd-05192003-171007",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05192003-171007/",
  "identifier_uri": "http://hdl.handle.net/10919/27792",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "sianezvita.pdf",
    "Sianezcontentspage.pdf",
    "titleandabstract.pdf",
    "Sianezchapters1-5.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Problem-solving",
    "efficiency",
    "technology education",
    "worked examples"
  ],
  "title": "An Analysis of Successful and Unsuccessful Example Solutions to Enhance Open-Ended Technological Problem-Solving Efficiency Among Middle School Students",
  "type": "Dissertation"
}