{
  "contributor_author": "Chen, Weijia",
  "contributor_committeechair": "Yang, Dennis T.",
  "contributor_committeemember": [
    "Salehi-Isfahani, Djavad",
    "Kats, Amoz",
    "Yau, Jeffrey",
    "Ashley, Richard A."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:12:16Z",
  "date_adate": "2006-06-28",
  "date_available": "2014-03-14T20:12:16Z",
  "date_issued": "2006-05-10",
  "date_rdate": "2009-06-28",
  "date_sdate": "2006-05-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Since the late 1980â  s, China has experienced the worldâ  s largest peacetime out-migration of its rural labor force to urban areas. The temporary nature of the labor migration complicates the control on this mobile population, and its multi-faceted influence on the whole economy makes the migration policy controversial. Based on cross-sectional Chinese rural household survey data, this study analyzes the effects of migration on rural areas and explores the determinants of the participation and duration of the temporary migration.  The first chapter investigates how parental migration affects the decision of enrolling children in high school through migrationâ  s effects on household income and the opportunity cost of schooling in rural China. The opportunity cost of schooling is approximated by the marginal productivity of children imputed from family production estimation, which controls for potential endogeneity in the time allocation decisions of family members. The empirical results show that temporary migration of parents raises their childrenâ  s probability of high school enrollment by 3.2%, resulting primarily from a positive income effect. These findings suggest that reductions in barriers to migration raise rural household earnings, and foster the investment in childrenâ  s education.  The second chapter studies the determinants of participation and duration of temporary rural-urban migration in China highlighting the role of education and migrant networks. The Probit and Logit models are fitted to the dichotomous migration participation estimation. To correct for the sample selection bias, Heckmanâ  s two-step procedure is used to estimate the length of migratory work. Empirical results confirm the existence of a migrant network effect on both migration participation and migration length. Schooling increases migration probability non-linearly and its effect on migration length is insignificant once migration is controlled. Furthermore, the positive effect of migrant networks on migration participation is especially prominent among individuals with junior and senior high school education.",
  "description_provenance": [
    "Author Email: wechen1@vt.edu",
    "Advisor Email: deyang@vt.edu",
    "Advisor Email: salehi@vt.edu",
    "Advisor Email: amoz@vt.edu",
    "Advisor Email: jyau1117@vt.edu",
    "Advisor Email: ashleyr@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:16Z (GMT). No. of bitstreams: 1 WeijiaChenDiss.pdf: 591800 bytes, checksum: f69c72e292ebd96792c436e77638dfd1 (MD5)   Previous issue date: 2006-05-10"
  ],
  "handle": "27798",
  "identifier_other": "etd-05192006-114512",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05192006-114512/",
  "identifier_uri": "http://hdl.handle.net/10919/27798",
  "publisher": "Virginia Tech",
  "relation_haspart": "WeijiaChenDiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Education",
    "Temporary Migration",
    "Rural-Urban Migration",
    "Migrant Networks",
    "China"
  ],
  "title": "Essays on Rural-Urban Migration in China",
  "type": "Dissertation"
}