{
  "contributor_author": "Shojania Feizabadi, Mitra",
  "contributor_committeechair": "Spillman, William B. Jr.",
  "contributor_committeemember": [
    "Mizutani, Tetsuro",
    "Indebetouw, Guy J.",
    "Walker, Richard A.",
    "Ritter, Alfred L."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:12:16Z",
  "date_adate": "2005-06-24",
  "date_available": "2014-03-14T20:12:16Z",
  "date_issued": "2005-04-29",
  "date_rdate": "2008-06-24",
  "date_sdate": "2005-05-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A mathematical approach to the concepts of copolymerization of microtubules in the presence of anti-mitotic drugs is presented in this work. A general feature of the mathematical equations is presented. The possibility of having analytical steady state solutions of dynamic equations is investigated. The structure of equations is narrowed down for the specific brand of anti-mitotic drug, colchicine. The behavior of total T-tubulin concentration in the steady state in a regeneration system is investigated and analyzed through the  numerical calculations.",
  "description_provenance": [
    "Author Email: mfeizaba@vt.edu",
    "Advisor Email: mizutani@vt.edu",
    "Advisor Email: wspillma@vt.edu",
    "Advisor Email: gindebet@vt.edu",
    "Advisor Email: rawalker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:16Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 541250 bytes, checksum: cbad8a38e9bc2c3cabf61c6a5956d966 (MD5)   Previous issue date: 2005-04-29"
  ],
  "handle": "27795",
  "identifier_other": "etd-05192005-104254",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05192005-104254/",
  "identifier_uri": "http://hdl.handle.net/10919/27795",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "antimitotic drugs",
    "dynamic instability",
    "microtubule"
  ],
  "title": "Physical Concepts of Copolymerization of Microtubules in the Presence of Anti-mitotic Agents",
  "type": "Dissertation"
}