{
  "contributor_author": "Atkins, Lois Major",
  "contributor_committeechair": "Driscoll, Lisa G.",
  "contributor_committeemember": [
    "Crockett, Jean B.",
    "Parks, David J.",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:12:16Z",
  "date_adate": "2005-05-27",
  "date_available": "2014-03-14T20:12:16Z",
  "date_issued": "2005-05-11",
  "date_rdate": "2006-05-27",
  "date_sdate": "2005-05-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to determine the odds of school organization features predicting schools meeting district or state performance goals. The school organization features were organizational complexity, shared decision making, and leadership behavior. The dependent variable was school performance, operationally defined as a principalâ  s yes response or no response to the question, â  did your school meet district or state performance goals.â   The independent variables representing organizational complexity were school size, diversity of role, span of control. The independent variables representing shared decision making were curriculum influence, policy influence, and professional development influence. The leadership behavior feature was a composite variable. The percent of school lunch was the covariate, as determined by the percentage of students receiving free lunch and reduced price lunch.   The sample for this study was taken from the 1999-2000 Schools and Staffing Surveys (SASS) Public-Use Data (NCES: 2004-372) collected by the National Center for Education Statistics (NCES). The sample consisted of 5,312 public schools and 5,312 public school principals. Data from the SASS Public School Questionnaire and the SASS Public School Principal Questionnaire were used for the data analysis.   The methods of data analysis consisted of the identification of indicator variables from SASS, the development of scales, and the fitting of a parsimonious logistic regression model. A principal components analysis was used to extract patterns of association among the indicator variables, shared decision making and leadership behavior.  The logistic regression analysis revealed that the best model for predicting the odds of whether schools would meet district or state performance goals consisted of the variables curriculum influence, policy influence, professional development influence, size, diversity of role, span of control, and the covariate, percent of free lunch. The significant variables were curriculum influence, policy influence, professional development influence, and span of control. The odds of school organization features predicting whether schools would meet performance goals was estimated to be .7243, which was less than one or less than chance. There were several limitations of this study that need to be considered when interpreting the results.",
  "description_provenance": [
    "Author Email: loatkins@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:16Z (GMT). No. of bitstreams: 2 AtkinsBody518052.pdf: 368458 bytes, checksum: b2b89d20edf17b0c2ca0da829674bdd9 (MD5) AtkinsFrontMatter51805.pdf: 43453 bytes, checksum: 3a254b90dac63756b8e35363161bf0b9 (MD5)   Previous issue date: 2005-05-11"
  ],
  "handle": "27796",
  "identifier_other": "etd-05192005-173901",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05192005-173901/",
  "identifier_uri": "http://hdl.handle.net/10919/27796",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "AtkinsBody518052.pdf",
    "AtkinsFrontMatter51805.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "decision making",
    "student performance",
    "organization",
    "complexity",
    "achievement",
    "leadership behavior"
  ],
  "title": "Organization Features and School Performance",
  "type": "Dissertation"
}