{
  "contributor_author": "Ricci, Ronald J.",
  "contributor_committeechair": "Johnson, Scott W.",
  "contributor_committeemember": [
    "Galway, Alison",
    "McWey, Lenore M.",
    "Benningfield, Anna Beth",
    "Driscoll, Lisa G."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:12:19Z",
  "date_adate": "2004-06-10",
  "date_available": "2014-03-14T20:12:19Z",
  "date_issued": "2004-05-06",
  "date_rdate": "2007-06-10",
  "date_sdate": "2004-05-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Trauma Resolution Treatment as an Adjunct to Standard Treatment for Sexual Offenders    Ronald J. Ricci      Abstract  This study explored the use of adding trauma resolution therapy to standard cognitive-behavioral relapse prevention therapy for sex offenders. Ten adjudicated sex offenders with sexual abuse histories were treated with eye movement desensitization and reprocessing as an adjunct to standard outpatient sex offender treatment. Data points include self-report, other-report, assessment instruments, session transcripts, research journals, and physiological measures. Systematic treatment research and development methods (Bischoff, McKeel, Moon, & Sprenkle, 1996) resulted in a proposed treatment protocol. Emergent themes from a cross-case, grounded theory data analysis are presented. The data suggests the adjunct treatment provided some benefit both to participants and to the goals of standard sex offender-specific treatment. Implications for treatment providers, marriage and family therapy, and future research are discussed.",
  "description_provenance": [
    "Author Email: rricci@vt.edu",
    "Advisor Email: swj@vt.edu",
    "Advisor Email: agalway@vt.edu",
    "Advisor Email: lmcwey@vt.edu",
    "Advisor Email: abenning@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:19Z (GMT). No. of bitstreams: 1 ETDricci.pdf: 765746 bytes, checksum: a8e92959f790dd2610e3ace94ee9d3e6 (MD5)   Previous issue date: 2004-05-06"
  ],
  "handle": "27808",
  "identifier_other": "etd-05202004-070044",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05202004-070044/",
  "identifier_uri": "http://hdl.handle.net/10919/27808",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETDricci.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "EMDR",
    "trauma",
    "sex offender",
    "treatment"
  ],
  "title": "Trauma resolution treatment as an adjunt to stand treatment for sexual offenders",
  "type": "Dissertation"
}