{
  "contributor_author": "Cerrato, Jose M.",
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:12:18Z",
  "date_adate": "2010-06-02",
  "date_available": "2014-03-14T20:12:18Z",
  "date_issued": "2010-05-18",
  "date_rdate": "2013-04-29",
  "date_sdate": "2010-05-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This work represents an interdisciplinary effort to investigate microbiological and chemical manganese (Mn) cycling in drinking water systems using concepts and tools from civil and environmental engineering, microbiology, chemistry, surface science, geology, and applied physics.   <p> Microorganisms were isolated from four geographically diverse drinking water systems using selective Mn-oxidizing and -reducing culture media. 16S rRNA gene sequencing revealed that most are bacteria of the Bacillus spp. (i.e., Bacillus pumilus and Bacillus cereus).  These bacteria are capable of performing Mn-oxidation and -reduction under controlled laboratory conditions.  Pseudo-first order rate constants obtained for microbiological Mn-oxidation and -reduction (aerobic and anaerobic) of these isolates ranged from 0.02 - 0.66 days^-1.  It is likely that spores formed by Bacillus spp. protect them from chlorine and other disinfectants applied in drinking water systems, explaining their ubiquitous presence. <p> A new method was developed using X-ray photoelectron spectroscopy (XPS) to identify Mn(II), Mn(III), and Mn(IV) on the surfaces of pure oxide standards and filtration media samples from drinking water treatment plants.  A necessary step for the comprehensive analysis of Mn-cycling in drinking water systems is to characterize the chemical properties of filtration media surfaces.  Analyses of filtration media samples show that, while Mn(IV) was predominant in most samples, a mixture of Mn(III) and Mn(IV) was also identified in some of the filtration media samples studied.  The use of both the XPS Mn 3s multiplet splitting and the position and shape of the Mn 3p photo-line provide added confidence for the determination of the oxidation state of Mn in complex heterogeneous environmental samples.   <p> XPS was applied to investigate Mn(II) removal by MnOx(s)-coated media under experimental conditions that closely resemble situations encountered in drinking water treatment plants in the absence and presence of chlorine.  Macroscopic and spectroscopic results suggest that Mn(II) removal in the absence of chlorine was mainly due to adsorption, while in the presence of chlorine was due to oxidation.  Mn(IV) was predominant in all the XPS analyses while Mn(II) was detected only in samples operated without chlorine.  Future research should apply XPS under different experimental conditions to understand the specific mechanisms affecting Mn(II) removal by MnOx(s)-coated media.",
  "description_provenance": [
    "Author Email: jcerrato@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:18Z (GMT). No. of bitstreams: 1 Cerrato_JM_D_2010.pdf: 1955843 bytes, checksum: 93442d3617fc9be1a5af441e843f87e1 (MD5)   Previous issue date: 2010-05-18"
  ],
  "handle": "27804",
  "identifier_other": "etd-05192010-204645",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05192010-204645/",
  "identifier_uri": "http://hdl.handle.net/10919/27804",
  "publisher": "Virginia Tech",
  "relation_haspart": "Cerrato_JM_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "drinking water",
    "biofilm",
    "reduction",
    "oxidation",
    "biogeochemistry",
    "XPS",
    "manganese"
  ],
  "title": "Biogeochemical Cycling of Manganese in Drinking Water Systems",
  "type": "Dissertation"
}