{
  "contributor_author": "Folgar, Carlos Eduardo",
  "contributor_committeechair": "Clark, David E.",
  "contributor_committeemember": [
    "Viehland, Dwight D.",
    "Suchicital, Carlos T. A.",
    "Pickrell, Gary R."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:12:18Z",
  "date_adate": "2010-06-01",
  "date_available": "2014-03-14T20:12:18Z",
  "date_issued": "2010-05-10",
  "date_rdate": "2010-06-01",
  "date_sdate": "2010-05-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Structure evolution of silica aerogel was studied in microwave- and conventionally processed samples over the temperature range from 25 to 1200â °C.  The samples were produced using sol-gel processing and dried under carbon dioxide supercritical conditions.  After drying, the monolithic samples received a thermal treatment at different programmed temperatures in two different ovens, conventional and microwave.  The microwave process was performed using a single mode microwave oven at 2.45GHz.  Dielectric properties were measured using the cavity perturbation method, and structural characterization was carried out using a variety of techniques, including absorption surface analysis, Helium pycnometry, Archimedes principle, Fourier transform infrared spectroscopy, X-ray diffraction, and high resolution microscopy.  The data obtained revealed that structural differences do exist between microwave- and conventionally processed samples. Three different regions were identified from the structural characterization of the samples.  Regions I exhibited a structure densification at temperatures between 25 and 850â °C.  Region II was characterized by a bulk densification in the temperature range from 850 to 1200â °C.  Region III was represented by the onset of crystallization above 1200â °C.  Explanation and possible causes behind the structural differences observed in each region are provided.  In general, the structure evolution observed in microwave- and conventionally processed samples followed the same order, but occurred at lower temperature for the microwave process.",
  "description_provenance": [
    "Author Email: cfolgar@vt.edu",
    "Advisor Email: viehland@mse.vt.edu",
    "Advisor Email: ctas@vt.edu",
    "Advisor Email: pickrell@vt.edu",
    "Advisor Email: dclark@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:18Z (GMT). No. of bitstreams: 1 Folgar_CE_2010.pdf: 4078697 bytes, checksum: 08a1b13a57483929efce77d49ebc53d4 (MD5)   Previous issue date: 2010-05-10"
  ],
  "handle": "27801",
  "identifier_other": "etd-05192010-013744",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05192010-013744/",
  "identifier_uri": "http://hdl.handle.net/10919/27801",
  "publisher": "Virginia Tech",
  "relation_haspart": "Folgar_CE_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "silica gel",
    "single mode microwave oven",
    "dielectric measurements",
    "microwave process"
  ],
  "title": "Structure Evolution of Silica Aerogel under a Microwave Field",
  "type": "Dissertation"
}