{
  "contributor_author": "Blanco, Myra",
  "contributor_committeechair": "Dingus, Thomas A.",
  "contributor_committeemember": [
    "Hankey, Jonathan M.",
    "Kleiner, Brian M.",
    "Neale, Vicki L.",
    "Smith-Jackson, Tonya L."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:12:18Z",
  "date_adate": "2002-05-23",
  "date_available": "2014-03-14T20:12:18Z",
  "date_issued": "2002-04-24",
  "date_rdate": "2003-05-23",
  "date_sdate": "2002-05-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Vehicle crashes remain the leading cause of accidental death and injuries in the United States, claiming tens of thousands of lives and injuring millions of people each year.  Many of these crashes occur during nighttime, where a variety of modifiers affect the risk of a crash, primarily through the reduction of object visibility.  Furthermore, many of these modifiers also affect the nighttime mobility of older drivers, who avoid driving during the nighttime.  Thus, a two-fold need exists for new technologies that enhance night visibility. Two separate studies were completed as part of this research.  Study 1 served as a baseline by evaluating visual performance during nighttime driving under clear weather conditions.  Visual performance was evaluated in terms of the detection and recognition distances obtained when different vision enhancement systems were used at the Smart Road testing facility.   Study 2, also using detection and recognition distances, compared the visual performance of drivers during low visibility conditions (i.e., due to rain) to the risk perception of driving during nighttime under low visibility conditions.  These comparisons were made as a function of various vision enhancement systems.  The age of the driver and the characteristics of the object presented (e.g., contrast, motion) were variables of interest in both studies. The pivotal contribution of this investigation is the generation of a model describing the relationships between driver characteristics, risk perception, and visual performance in nighttime driving in the context of a variety of standard and prototype vision enhancement systems.  Improvement of mobility, especially for older individuals, can be achieved through better understanding of the factors that increase risk perception, identification of systems that improve detection and recognition distances, and consideration of drivers' opinions on possible solutions that improve nighttime driving safety.  In addition, this research effort empirically described the night vision enhancement capabilities of 12 different vision enhancement systems during clear and adverse weather environments.",
  "description_provenance": [
    "Author Email: mblanco@vt.edu",
    "Advisor Email: tomd@vtti.vt.edu",
    "Advisor Email: jon@vtti.vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: vneale@vtti.vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:18Z (GMT). No. of bitstreams: 1 Blanco-Dissertation.pdf: 3579845 bytes, checksum: 9e803fd59d0fadfea1958bf9e6607c3d (MD5)   Previous issue date: 2002-04-24"
  ],
  "handle": "27806",
  "identifier_other": "etd-05202002-171805",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05202002-171805/",
  "identifier_uri": "http://hdl.handle.net/10919/27806",
  "publisher": "Virginia Tech",
  "relation_haspart": "Blanco-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Adverse Weather",
    "Detection",
    "Driving Safety",
    "Headlights",
    "Mobility",
    "Nighttime Driving",
    "Recognition",
    "Risk Perception",
    "Vision Enhancement Systems"
  ],
  "title": "Relationship Between Driver Characteristics, Nighttime Driving Risk Perception, and Visual Performance under Adverse and Clear Weather Conditions and Different Vision Enhancement Systems",
  "type": "Dissertation"
}