{
  "contributor_author": "Al-Enezi, Mutlaq M.",
  "contributor_committeecochair": [
    "Sughrue, Jennifer A.",
    "Earthman, Glen I."
  ],
  "contributor_committeemember": [
    "Lemasters, Linda Kay",
    "Salmon, Richard G.",
    "Twiford, Travis W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:12:18Z",
  "date_adate": "2002-06-05",
  "date_available": "2014-03-14T20:12:18Z",
  "date_issued": "2002-05-07",
  "date_rdate": "2003-06-05",
  "date_sdate": "2002-05-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study explored the relationship between school building conditions and the academic achievement of twelfth students in selected public high schools in Kuwait. The population of the study was 56 high schools (28 boysâ   schools and 28 girlsâ   schools) that offered a Sciences and Arts majors. The major research questions in this study were: (a) is there a relationship between overall, cosmetic, and structural conditions and student achievement; (b) does the relationship between building condition and student achievement differ between boysâ   and the girlsâ   schools; and (c) what aspects of physical building components are related to student achievement. The high school principals were given the revised Commonwealth Assessment of Physical Environment (CAPE) to assess building conditions. Student achievement was measured by final examination scores collected from the Information Center at the Ministry of Education.  Pearson r, was used to determine if there is a relationship between building conditions and student achievement. This analysis revealed that a positive significant relationship exists between student achievement scores and building conditions in the boysâ   schools. The results of two-way ANOVA and the t-test, used sequentially to compare academic achievement in the top and bottom quartiles, found that building conditions affect significantly the achievement of students in the Sciences major. The t-test highlighted significant differences in subjects in the Sciences major among only the boysâ   schools.  Multiple regression, used to explain the variance in student achievement, indicated that building conditions explain at least 77% of the variance of Sciences majorsâ   achievement, but did not account for any Arts majorsâ   achievement. Because the SES index was neither available nor introduced into a formula, this resulted in a heavier weighting given to the remaining variables. The building conditions of the girlsâ   schools did not explain student achievement in either the Sciences or the Arts majors. Step-wise multiple regression, used to determine which physical aspects of a buildingâ  s condition best predict student achievement, indicated that graffiti and roof leaks are the main predictors of achievement.  Six conclusions were drawn from this study: (a) a significant positive relationship was found between the overall, structural, and cosmetic building condition and student achievement in the Sciences major when all 56 school buildings were analyzed; (b) a significant positive relationship was found between the overall and structural building condition and student achievement in the Arts major when all 56 school buildings were analyzed; (c) a significant relationship was found between building conditions and academic achievement in boyâ  s schools in the Sciences major; (d) building conditions had a lesser impact on academic achievement in the boysâ   schools in the Arts major; (e) in the girlsâ   schools, building conditions did not affect academic achievement in either the Sciences major or Arts major; and (f) graffiti and roof leaks were the main predictors of physical aspects of a buildingâ  s condition that accounted for student achievement.  This study then underscores the need for the Kuwaiti Ministry of Education to establish policy supporting a program of improved facilities for all new schools. More research is needed to extend the breath of findings regarding the relationship between building conditions and student academic achievement. This study should be replicated in other non-U.S. countries.",
  "description_provenance": [
    "Author Email: mutlaq@vt.edu",
    "Advisor Email: jsugh@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: lindal@gwu.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:18Z (GMT). No. of bitstreams: 1 ETDMUTLAQ.pdf: 544885 bytes, checksum: 4f20fd1d429ff79f023011c4113098b4 (MD5)   Previous issue date: 2002-05-07"
  ],
  "handle": "27805",
  "identifier_other": "etd-05202002-012215",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05202002-012215/",
  "identifier_uri": "http://hdl.handle.net/10919/27805",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETDMUTLAQ.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Student Achievement",
    "Building Condition",
    "Kuwaiti Public High Schools"
  ],
  "title": "A Study of the Relationship Between School Building Conditions and Academic Achievement of Twelfth Grade Students in Kuwaiti Public High Schools",
  "type": "Dissertation"
}