{
  "contributor_author": "Dean, Geoffrey Sholes",
  "contributor_committeechair": "O'Reilly, Patrick A.",
  "contributor_committeemember": [
    "Eschenmann, Konrad Kurt",
    "Stewart, Daisy L.",
    "Burton, John K.",
    "Taylor, Charles Lewis"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:19Z",
  "date_adate": "2003-06-13",
  "date_available": "2014-03-14T20:12:19Z",
  "date_issued": "2003-04-22",
  "date_rdate": "2003-06-13",
  "date_sdate": "2003-05-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research effort was designed to analyze the current federal career and technical education legislation to determine methods of â  operationalizingâ   the policy at the state and local levels. In performing the policy analysis, organizational and systems viewpoints were consistently used in determining the intent of the legislation and then how to structure a program evaluation system to fulfill the policy goals. The research methodology is a hybrid interdisciplinary method that combined policy and system analyses. Secondary career and technical education legislation served as a test case to develop the program evaluation system strategies and requirements because the researcher was familiar with this segment of education and the policies associated with it. Program evaluation theoretical foundations were presented as means to understand the policy intentions and to develop a conceptual system model. The resulting system model was presented with actual examples of system constructs. Detailed process flowcharts were developed to show the system structure and functions. Organizational responsibilities and requirements were addressed in the system model development. An additional component of the systems analysis was to determine the system implementation sequence. The implementation sequence is based on a longitudinal program evaluation design that spans a five-year interval for each graduation year cohort. The system model resulting from this research is one of many possible variations that could be developed to satisfy the requirements of the federal Carl D. Perkins Vocational and Applied Technology Education Act of 1998. The system analysis and model development strategies can be applied to other education and socioeconomic policies that deliver human services with accountability requirements. No attempt was made to perform a system cost analysis in this research effort.",
  "description_provenance": [
    "Author Email: geoffdean@pocketmail.com",
    "Advisor Email: oreilly@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: clt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:19Z (GMT). No. of bitstreams: 1 gsd_dissertation.pdf: 19265405 bytes, checksum: 32611d9def3925a5a83924abfbda9b11 (MD5)   Previous issue date: 2003-04-22"
  ],
  "handle": "27807",
  "identifier_other": "etd-05202003-175657",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05202003-175657/",
  "identifier_uri": "http://hdl.handle.net/10919/27807",
  "publisher": "Virginia Tech",
  "relation_haspart": "gsd_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "assessment",
    "evaluation",
    "systems analysis",
    "policy"
  ],
  "title": "Strategies for the Development of Integrated Career and Technical Education Program Evaluation Systems",
  "type": "Dissertation"
}