{
  "contributor_author": "Rountree, Steven Derek",
  "contributor_committeechair": "Raghavan, Ramaswamy",
  "contributor_committeemember": [
    "Piilonen, Leo E.",
    "Takeuchi, Tatsu",
    "Pitt, Mark L.",
    "Vogelaar, Robert Bruce"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:12:18Z",
  "date_adate": "2010-06-11",
  "date_available": "2014-03-14T20:12:18Z",
  "date_issued": "2010-05-05",
  "date_rdate": "2010-06-11",
  "date_sdate": "2010-05-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A real time low energy spectral measurement of the neutrinos coming from the Sun will give us a greater understanding of energy production in the Sun, and the mechanisms of neutrino mixing.  We will, for the first time, measure the solar neutrino spectrum for all solar neutrinos <2MeV in particular pp, Be and CNO neutrinos, be able to compare the solar photon derived energy luminosity (Lï §) to the solar neutrino derived energy luminosity (Lï ®) independent of any solar model, explore dark energy with respect to mass varying neutrinos, and explore CNO abundances in the Sun.  These measurements require new technology in Indium loaded scintillators and large scale detector designs, namely increased spatial resolution through a novel scintillation lattice.  I will present the advances we are making to these fields at Virginia Tech as well as neutrino science and the physics of the LENS detector.",
  "description_provenance": [
    "Author Email: rountree@vt.edu",
    "Advisor Email: piilonen@vt.edu",
    "Advisor Email: takeuchi@vt.edu",
    "Advisor Email: pitt@vt.edu",
    "Advisor Email: vogelaar@vt.edu",
    "Advisor Email: raghavan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:18Z (GMT). No. of bitstreams: 4 APSNeutrinoExperiment.pdf: 88337 bytes, checksum: d550700ae154ed6b02082067bc32a1cf (MD5) FileCNOCycle.pdf: 626473 bytes, checksum: c48b23efec839eeeffe16a365fc8f482 (MD5) FileOptical.pdf: 152054 bytes, checksum: bf26cf19ec2f18b2dbd01a83782806f2 (MD5) Rountree_SD_D_2010.pdf: 15584209 bytes, checksum: 4940c357e4287110d9a10dee8f6bf5c1 (MD5)   Previous issue date: 2010-05-05"
  ],
  "handle": "27803",
  "identifier_other": "etd-05192010-144208",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05192010-144208/",
  "identifier_uri": "http://hdl.handle.net/10919/27803",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "APSNeutrinoExperiment.pdf",
    "FileCNOCycle.pdf",
    "FileOptical.pdf",
    "Rountree_SD_D_2010.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "calibration",
    "radiation",
    "Borexino",
    "metal loaded liquid scintillator",
    "neutrino physics",
    "LENS",
    "scintillation lattice"
  ],
  "title": "Science and Technology of a  Low-Energy Solar Neutrino  Spectrometer (LENS)  And  Development of the MiniLENS Underground Prototype",
  "type": "Dissertation"
}