{
  "contributor_author": "Browne, Heidi Frances",
  "contributor_committeechair": "Bailey, Carol A.",
  "contributor_committeemember": [
    "Hawdon, James E.",
    "Harrison, Anthony Kwame",
    "Sewell, Edward H. Jr."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:12:20Z",
  "date_adate": "2009-06-15",
  "date_available": "2014-03-14T20:12:20Z",
  "date_issued": "2009-05-01",
  "date_rdate": "2012-04-30",
  "date_sdate": "2009-05-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The primary purpose of this research was to examine the relationship between individualism and attitudes toward four types of sexual behavior, specifically adolescent sex, premarital sex, extramarital sex, and homosexual sexual behavior. A secondary purpose was to add to the conceptual and methodological discussions of individualism.  <p> In the United States these behaviors are becoming more common and attitudes generally more accepting.  What remains unclear and under theorized is why?  I address this question from the frame of the intersection of sexuality studies with the study of deviance as these behaviors have been considered to fit normative, absolutists, statistical and/or reactive definitions of deviance.  This research was informed by Hawdonâ  s recent general model of deviant behavior.  In brief, one of Hawdonâ  s contributions to the study of deviance is his addition of the cultural value of individualism as an explanatory variable related to cross-cultural rates of drug use. <p> The primary research question that guided this research was: Is individualism related to attitudes toward adolescent sex, premarital sex, extramarital sex, and homosexual sexual behavior? Utilizing data from the General Social Survey, this question was examined using a variety of conceptualizations of individualism to test the relationship between individualism and attitudes toward the various sexual behaviors for five time periods--1998, 2000, 2002, 2004, and 2006.  Three major hypotheses were posed regarding the relationship between individualism and attitudes toward perceived sexual deviance.  The analysis did not support the hypotheses.  Reasons for this lack of support for the theoretical perspective were discussed.",
  "description_provenance": [
    "Author Email: brownehf@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: hawdonj@vt.edu",
    "Advisor Email: anharri5@vt.edu",
    "Advisor Email: esewell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:20Z (GMT). No. of bitstreams: 1 DISSERTATION2.pdf: 1933988 bytes, checksum: 04b71aa2d8fafa7e03a086626d3bfe6e (MD5)   Previous issue date: 2009-05-01"
  ],
  "handle": "27818",
  "identifier_other": "etd-05202009-112551",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05202009-112551/",
  "identifier_uri": "http://hdl.handle.net/10919/27818",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISSERTATION2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Perceived Deviance",
    "Attitudes",
    "Individualism",
    "Sexual Behaviors"
  ],
  "title": "Individualism and Attitudes toward Homosexual, Premarital, Adolescent, and Extramarital Sexual Behaviors",
  "type": "Dissertation"
}