{
  "contributor_author": "Toussaint, Jeffrey Guy",
  "contributor_committeechair": "Kiecolt, K. Jill",
  "contributor_committeemember": [
    "Waggenspack, Beth M.",
    "Hughes, Michael D.",
    "Yuan, Anastasia Sue Vogt",
    "Bailey, Carol A."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:12:20Z",
  "date_adate": "2008-06-27",
  "date_available": "2014-03-14T20:12:20Z",
  "date_issued": "2008-05-02",
  "date_rdate": "2008-06-27",
  "date_sdate": "2008-05-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Adoptive Status, Social Capital, and Academic Achievement    Jeffrey G. Toussaint    ABSTRACT      This dissertation examined the relationships among adoptive status, social capital, and academic achievement. Data from the National Longitudinal Study of Adolescent Health (Add Health) had 609 adopted and 11, 940 non-adopted adolescents. I used OLS regression models to help explain why adopted adolescents have significantly lower grade point averages (GPA) than non-adopted adolescents. Potential mediators were family social capital, closeness to family, mother and father, mothers'  and fathers'   involvement in their children's education, self-esteem, academic expectations, and in-school behavioral difficulties. Only closeness to fathers and in-school behavioral difficulties differed by adoptive status. Compared to non-adopted adolescents, adopted adolescents were closer to their fathers and had more in-school behavioral difficulties. Adopted adolescents also had lower GPA's, even when all other predictors were in the model. However, were it not for greater closeness to their fathers, adopted adolescents' would have had even more in-school behavioral difficulties and consequently, lower academic achievement. The results have implications for social capital theory and theory and research concerning adoptive families.",
  "description_provenance": [
    "Author Email: jtoussai@vt.edu",
    "Advisor Email: bwaggens@vt.edu",
    "Advisor Email: mdh@vt.edu",
    "Advisor Email: avy@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: kiecolt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:20Z (GMT). No. of bitstreams: 1  AdoptStatusSocCapitalAcademAchieve.pdf: 453929 bytes, checksum: d36d66dece3f7e3fcf0c88e1006573ca (MD5)    Previous issue date: 2008-05-02"
  ],
  "handle": "27815",
  "identifier_other": "etd-05202008-144755",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05202008-144755/",
  "identifier_uri": "http://hdl.handle.net/10919/27815",
  "publisher": "Virginia Tech",
  "relation_haspart": "AdoptStatusSocCapitalAcademAchieve.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Family",
    "Academic Achievement",
    "Adoption",
    "Social Capital"
  ],
  "title": "Adoptive Status, Social Capital, and Academic Achievement",
  "type": "Dissertation"
}