{
  "contributor_author": "Wiles, Natasha Shawn",
  "contributor_committeechair": "Rutherford, Charles L.",
  "contributor_committeemember": [
    "Winkel, Brenda S. J.",
    "Cowles, Joseph R.",
    "Sible, Jill C.",
    "Wong, Eric A."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:12:19Z",
  "date_adate": "2005-06-15",
  "date_available": "2014-03-14T20:12:19Z",
  "date_issued": "2005-05-06",
  "date_rdate": "2005-06-15",
  "date_sdate": "2005-05-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Gene regulation is a critical aspect of normal development, energy conservation, metabolic control, and responses to environmental cues, diseases and pathogens in eukaryotic organisms. In order to appropriately respond to environmental changes and advance through the life cycle, an organism must manage the expression levels of a large number of genes by utilizing available gene regulation mechanisms. The developmental control of 5â  -nucleotidase (5nt) expression in the model system Dictyostelium discoideum has provided a focal point for studies of gene regulation at the level of transcription.  In order to identify temporally-regulated control elements within the promoter of the 5nt gene, 5â   and internal promoter deletions were designed and fused to the luciferase and lacZ reporter genes, and reporter enzyme activity was measured in cells from the slug stage of development. The results from these experiments enabled the identification of a 250 bp region of the promoter, which was used as a template for subsequent site-directed mutagenesis experiments. These experiments involved altering 6-12 bp regions of the promoter by substitution. Twelve mutagenized promoters were fused to the luciferase and lacZ reporter genes, and activity was measured at the slug stage of development to more precisely locate cis-acting temporally-regulated control elements. In addition, cAMP induction experiments were performed on amoebae transformed with the mutagenized promoters to identify control elements within the promoter influenced by the presence of cAMP. The regions between -530 and -560 bp and -440 and -460 bp from the ATG translation start site. In order to evaluate the functions of the cis-acting promoter control elements, electromobility gel shift assays were performed to identify specific DNA-protein interactions on the 5nt promoter. These assays enabled the detection of a 0.13 Rf and 0.33 Rf binding activity to specific sites of the promoter. After characterization of these binding activities, both proteins were purified by a series of column chromatography techniques and characterized after mass spectrometry. The proteins purified were identified as formyltetrahydrofolate synthase and hydroxymethylpterin pyrophosphokinase. These enzymes function in the biosynthetic pathway of tetrahydrofolate and the production of folate coenzymes. The specific interactions of these enzymes with the 5nt promoter suggest these proteins may also function in regulating 5nt expression.",
  "description_provenance": [
    "Author Email: nsnyder@vt.edu",
    "Advisor Email: rutherfo@vt.edu",
    "Advisor Email: winkel@vt.edu",
    "Advisor Email: cowlesjr@vt.edu",
    "Advisor Email: siblej@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:19Z (GMT). No. of bitstreams: 1 Natasha_Wiles_Dissertation.pdf.pdf: 1394782 bytes, checksum: 5841ef1320fd91fa61872ca6c6b42d87 (MD5)   Previous issue date: 2005-05-06"
  ],
  "handle": "27810",
  "identifier_other": "etd-05202005-114507",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05202005-114507/",
  "identifier_uri": "http://hdl.handle.net/10919/27810",
  "publisher": "Virginia Tech",
  "relation_haspart": "Natasha_Wiles_Dissertation.pdf.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Dictyostelium",
    "5'-nucleotidase",
    "promoter analysis",
    "protein purification"
  ],
  "title": "Identification of Regulatory Binding Sites and Corresponding Transcription Factors Involved in the Developmental Control of 5'-nucleotidase Expression in Dictyostelium discoideum",
  "type": "Dissertation"
}