{
  "contributor_author": "Casey, Robert James",
  "contributor_committeechair": "Kronenberg, Philip S.",
  "contributor_committeemember": [
    "Badawy, Michael K.",
    "Dickey, John W.",
    "Wamsley, Gary L.",
    "Wolf, James F."
  ],
  "contributor_department": "Center for Public Administration and Policy",
  "date_accessioned": "2014-03-14T20:12:19Z",
  "date_adate": "2005-05-27",
  "date_available": "2014-03-14T20:12:19Z",
  "date_issued": "2005-05-16",
  "date_rdate": "2005-05-27",
  "date_sdate": "2005-05-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This multiple-case-based dissertation contributes to the stream of literature on the organizational innovation process by examining Critical Chain Project Management (CCPM) as an innovation with the potential to address an important schedule planning and execution performance gap in DOD weapon system development programs.  The contextually different Integrated Product Team case studies in DODâ  s F/A-22 fighter aircraft weapons system acquisition program are: manufacturing assembly, manufacturing process, test operations, and supplier product development.   Rich descriptions of the case studies are developed by the author, a senior Lockheed Martin Aeronautics Company systems engineer in a role that merged participant, observer, change agent and champion (POCAC).  Analysis distinguishes between Program and Operational levels of organizational structure and focuses on the innovation process through use of the author-designed Casey Hybrid Innovation Process (CHIP) model based on Rogersâ   stages heuristic.    Substantively, research demonstrates that in key areas of the F/A-22 program, proper application of the innovative Critical Chain Project Management process can generate and achieve development schedules sometimes substantially better than traditional approaches; improper application will lead to mixed results or rejection.      The research contributes to knowledge in the field of organizational innovation by demonstrating use of the CHIP model in the huge, geographically dispersed and extremely complex organization of the largest DOD weapon system acquisition program of the late 20th and early 21st centuries.  The research reflects Program leadershipâ  s important role in the top-down initiation and support of an innovation, even while choosing (by policy) not to force use at the Operational level. At the Operational level, details show that IPT implementations and results of the CCPM innovation vary.",
  "description_provenance": [
    "Author Email: bob.casey@lmco.com, rjcaseys@bellsouth.net",
    "Advisor Email: philkvt@vt.edu",
    "Advisor Email: mbadawy@vt.edu",
    "Advisor Email: jdickey@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:19Z (GMT). No. of bitstreams: 2  01casey-Phd-Dissertation-final.pdf: 4136712 bytes, checksum: 1d43f29bbd6d7137662ae862ababe2fc (MD5)  02-s05-334-IRB-exemption.pdf: 58049 bytes, checksum: e3e0de198daa63b0fea1963f4ce1130e (MD5)    Previous issue date: 2005-05-16"
  ],
  "handle": "27812",
  "identifier_other": "etd-05202005-143545",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05202005-143545/",
  "identifier_uri": "http://hdl.handle.net/10919/27812",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01casey-Phd-Dissertation-final.pdf",
    "02-s05-334-IRB-exemption.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Project Management",
    "Organizational Innovation",
    "Critical Chain Project Management Weapon System Ac",
    "Schedule Management"
  ],
  "title": "An Innovative Approach to Schedule Management on the F/A-22 Major Defense Acquisition Program (MDAP): Demonstration of Critical Chain Project Management",
  "type": "Dissertation"
}