{
  "contributor_author": "Chambers, David L",
  "contributor_committeechair": "Belden, Lisa K.",
  "contributor_committeemember": [
    "Cranford, Jack A.",
    "Hopkins, William A.",
    "Moore, Ignacio T."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:12:20Z",
  "date_adate": "2009-06-11",
  "date_available": "2014-03-14T20:12:20Z",
  "date_issued": "2009-03-31",
  "date_rdate": "2009-06-11",
  "date_sdate": "2009-05-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Anthropogenic disturbances can alter the abiotic composition of freshwater systems. These compositional changes can act as physiological stressors towards system inhabitants. However, little is known about how these altered abiotic factors influence stress hormones (corticosterone) in larval amphibians. Throughout the following chapters, I examined the effects of several abiotic factors on baseline and stress-induced corticosterone levels in the larvae of four amphibian species: Jefferson salamander (Ambystoma jeffersonianum), spotted salamander (A. maculatum), wood frog (Rana sylvatica), and grey treefrog (Hyla versicolor). Chapter II examined corticosterone level differences throughout development in A. jeffersonianum and R. sylvatica larvae under field, mesocosm, and laboratory venues. Baseline corticosterone levels in R. sylvatica increased near metamorphic climax in all venues, but not in A. jeffersonianum. Rather, baseline corticosterone levels differed with respect to venue throughout development in A. jeffersonianum. Chapter III examined corticosterone level differences among free-living A. jeffersonianum populations and possible abiotic factors underlying these hormone differences. Corticosterone levels significantly differed across populations. Increased baseline corticosterone levels significantly correlated to low pH. There was also a trend for increased baseline corticosterone levels to be positively correlated with chloride levels and negatively correlated with conductivity. Chapter IV examined the effects of laboratory manipulated pH on corticosterone levels in A. jeffersonianum, A. maculatum, R. sylvatica, and H. versicolor. There was a significant correlation between increased baseline corticosterone levels to low pH in all four species. Prey consumption (in both Ambystoma species) and survival (in A. jeffersonianum, A. maculatum, and R. sylvatica) were also negatively correlated to low pH. Chapter V examined the effects of increased conductivity on corticosterone levels in A. jeffersonianum, R. sylvatica, and H. versicolor. Increased conductivity exposure significantly correlated to increased baseline corticosterone levels in A. jeffersonianum and R. sylvatica. Prey consumption in A. jeffersonianum was also negatively correlated to increased conductivity. My dissertation shows that abiotic factors, such as pH and conductivity, can influence corticosterone levels in larval amphibians. These results suggest that corticosterone levels in larval amphibians may be a suitable biomarker reflective of altered freshwater habitat quality. However, my results also suggest that one should use a high degree of caution when using corticosterone levels in larval amphibians as a means to infer the health status of a population.",
  "description_provenance": [
    "Author Email: dlchamb@vt.edu",
    "Advisor Email: belden@vt.edu",
    "Advisor Email: cranford@vt.edu",
    "Advisor Email: hopkinsw@vt.edu",
    "Advisor Email: itmoore@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:20Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 719015 bytes, checksum: 2aefe83a80aff0ac5650bdbae7b2de85 (MD5)   Previous issue date: 2009-03-31"
  ],
  "handle": "27817",
  "identifier_other": "etd-05202009-111650",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05202009-111650/",
  "identifier_uri": "http://hdl.handle.net/10919/27817",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "stress",
    "corticosterone",
    "amphibian",
    "Ambystoma",
    "Rana",
    "Hyla",
    "anthropogenic disturbance",
    "pH",
    "conductivity",
    "development",
    "biomarker"
  ],
  "title": "Abiotic Factors Underlying Stress Hormone Level Variation Among Larval Amphibians",
  "type": "Dissertation"
}