{
  "contributor_author": "Chase, Melissa W.",
  "contributor_committeecochair": [
    "Stewart, Daisy L.",
    "Driscoll, Lisa G."
  ],
  "contributor_committeemember": [
    "Price, William T. Jr.",
    "Leech, Irene E.",
    "Hayhoe, Celia Ray"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:21Z",
  "date_adate": "2004-05-28",
  "date_available": "2014-03-14T20:12:21Z",
  "date_issued": "2004-05-11",
  "date_rdate": "2004-05-28",
  "date_sdate": "2004-05-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The foundation for this study is based on prior research (Sproles & Sproles, 1990) that determined that learning styles are significantly related to consumer decision-making styles. Decision making involves a process of cognitive learning. Since the study was published, other studies have investigated these consumer decision-making styles. However, no additional studies have further investigated the relationship between learning styles and consumer decision-making styles for college students, especially first-year, first semester college students.          Numerous studies have documented that students enter college as consumers but may lack basic knowledge and skills to make consumer decisions and avoid potential debt. The focus of the current study was to determine whether a relationship exists between beginning college studentsâ   self-reported mind styles, consumer decision-making styles, and shopping habits.   To investigate this relationship, a purposive sample was targeted consisting of first-year, first semester college students.       Three instruments were administered: the Gregorc Style Delineator, the Consumer Styles Inventory, and a Demographic Survey.  A Chi-Square Test of Independence showed that there is a significant relationship between gender and self-reported shopping habits.  Females tend to self-report purchases of clothing more frequently than males.  Males tend to self-report purchases of food away from home and gas/auto expenses more frequently than females.  No significant relationship was found between studentsâ   perception of family income and self-reported shopping habits, suggesting that these students purchase consumer goods frequently regardless of their perceived family income.   \t     A Chi-Square Test of Independence also revealed a significant relationship between gender and self-reported, dominant, Gregorc mind styles. Females were more likely than males to self-report their dominant mind styles as Abstract Random.  Males were more likely than females to self-report their dominant mind style as Concrete Random.      Although the current studyâ  s results did not support multiple consumer decision-making styles from previous studies using the Consumer Styles Inventory, an exploratory factor analysis revealed one, overall consumer decision-making style, Recreational/Hedonistic.  A Mann-Whitney Rank Sum Test showed that there is a significant relationship between gender and the Recreational/Hedonistic consumer decision-making style.  Females tend to be more recreational shoppers than males.      A summary, discussion of the results, and recommendations for further research, practice, policy, and families are proposed.",
  "description_provenance": [
    "Author Email: mechase@vt.edu",
    "Advisor Email: wprice@vt.edu",
    "Advisor Email: ileech@vt.edu",
    "Advisor Email: chayhoe@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:21Z (GMT). No. of bitstreams: 10 body.7.pdf: 90146 bytes, checksum: 089b85b5a4f31201f0d61d51448529e5 (MD5) body.4.pdf: 441442 bytes, checksum: 88c16f27d48137cd256aaa8fa8662e24 (MD5) body.3.pdf: 1379377 bytes, checksum: 4b0fd7297420d4e52d3af509cafde470 (MD5) body.2.pdf: 50912 bytes, checksum: c4b21d4c5087061f15a56a59c3e9e4f4 (MD5) body.5.pdf: 23956 bytes, checksum: 8f246183176b102e2267a33567b5f763 (MD5) body.6.pdf: 60209 bytes, checksum: 0c6932f01d724518122a21ee48f056c1 (MD5) body.pdf: 290252 bytes, checksum: a7d45c3f958059fe96f30c8d2a63d4ec (MD5) front.pdf: 168961 bytes, checksum: 93a09e43e9a2b42d9a4cce219ae28a8a (MD5) body.8.pdf: 23951 bytes, checksum: 6803e56a75bcbefe6918407b2eafd923 (MD5) body.9.pdf: 126607 bytes, checksum: e5eae06c87fcf1d205c9a22db6af9edb (MD5)   Previous issue date: 2004-05-11"
  ],
  "handle": "27824",
  "identifier_other": "etd-05212004-211255",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05212004-211255/",
  "identifier_uri": "http://hdl.handle.net/10919/27824",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "body.7.pdf",
    "body.4.pdf",
    "body.3.pdf",
    "body.2.pdf",
    "body.5.pdf",
    "body.6.pdf",
    "body.pdf",
    "front.pdf",
    "body.8.pdf",
    "body.9.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ways of knowing",
    "shopping habits",
    "Gregorc Style Delineator",
    "first-year experience",
    "mind styles",
    "Consumer Styles Inventory",
    "cognitive",
    "college students",
    "consumer decision-making styles"
  ],
  "title": "The Relationship of Mind Styles, Consumer Decision-Making Styles, and Shopping Habits of Beginning College Students",
  "type": "Dissertation"
}