{
  "contributor_author": "Rittler, Megan Elizabeth",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Redican, Kerry J.",
    "Gentry, Roy M.",
    "Lepczyk, Billie F."
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:12:21Z",
  "date_adate": "2009-06-12",
  "date_available": "2014-03-14T20:12:21Z",
  "date_issued": "2009-04-21",
  "date_rdate": "2009-06-12",
  "date_sdate": "2009-05-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Methicillin Resistant Staphylococcus Aureus (MRSA) has been receiving significant attention, highlighting an increased risk of infectious transmission associated with athletic participation. As MRSA infections are becoming increasing virulent, athletic trainers are presented with immediate prevention challenges. While recommendations have been offered by the Centers for Disease Control and Prevention outlining basic prevention procedures, adherence to proposed guidelines and actual perception of the threat still pose the greatest hurdles to eradication of MRSA. Success in control and prevention of transmission of MRSA in athletic environments can be furthered by first investigating the perceptions of the problem in one of the first line of defense for athletesâ  their athletic trainers. Of particular importance are the perceptions of trainersâ   adherence to guidelines, perceptions of protocol standards, and relative threat of MRSA in the athletic environment. This study attempts to determine these perceptions and predict how athletic trainers will receive and adhere to standardized guidelines through written policy for MRSA prevention. Results reflect an increase in the awareness of MRSA as a threat to athletics since 2004. Overall positive perception of the development of guidelines and protocols specifically targeted to prevention of MRSA transmission in the athletic environment were also defined through this study. Athletic trainers surveyed expressed strong desire for additional training in procedures specific to reducing transmission of MRSA to prevent outbreaks.",
  "description_provenance": [
    "Author Email: meganr@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: gentrym@vt.edu",
    "Advisor Email: lepczyk@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:21Z (GMT). No. of bitstreams: 1 rittlerdissertation.pdf: 1816874 bytes, checksum: 3dc300c4cf342dcee28e8062bca015d2 (MD5)   Previous issue date: 2009-04-21"
  ],
  "handle": "27821",
  "identifier_other": "etd-05202009-170637",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05202009-170637/",
  "identifier_uri": "http://hdl.handle.net/10919/27821",
  "publisher": "Virginia Tech",
  "relation_haspart": "rittlerdissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "policy development",
    "Infection Control",
    "Methicillin Resistant Staphylococcus Aureus (MRSA)",
    "prevention standards"
  ],
  "title": "Perceptions of Certified Athletic Trainers regarding Methicillin-Resistant Staphylococcus Aureus Prevention Strategies",
  "type": "Dissertation"
}