{
  "contributor_author": "Guan, Xiaojing",
  "contributor_committeechair": "Smith, Edward J.",
  "contributor_committeemember": [
    "Rankin, Janet L. Walberg",
    "Jiang, Honglin",
    "Tu, Zhijian Jake",
    "Samuels, David C."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:12:21Z",
  "date_adate": "2007-05-25",
  "date_available": "2014-03-14T20:12:21Z",
  "date_issued": "2007-05-10",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-05-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The relationship among oxidative stress, mitochondrial DNA integrity, and longevity continues to be without a general consensus. Here, we hypothesize that short- and long-lived birds, including the budgerigar (Melopsittacus undulatus), guineafowl (Numida meleagris), quail (Corturnix japonica), and turkey (Meleagris gallopavo) differ in oxidative stress measured by blood markers and that this difference correlates with mitochondrial genomic integrity both within and among species. In preliminary studies and to establish a reference and standard for the search for single nucleotide polymorphisms (SNPs), we used a combination of experimental and in silico tools for genome analysis to screen selected regions of the chicken (Gallus gallus) mitochondrial genome (mtGenome) for SNPs. A total of 113 SNPs was identified which formed 17 haplotypes. The length of the turkey mtGenome sequence developed was 16,967 bp in length, while that of the budgie was 18,193 bp. Annotation of both sequences revealed a total of 13 genes and 24 RNA (22 tRNA and 2 rRNA). Within the budgie mtGenome sequence, a duplicated control region was observed, and there was an additional nucleotide in the NADH dehydrogenase subunit 3 sequence of both the turkey and budgie. The total number of SNPs within the D-loop and 16S rRNA in each of the four species ranged from zero in the quail to 22 in the budgie. The new mtGenome sequences revealed that the turkey was most closely related to the chicken and quail, and the budgie was closest to kakabo (Strigops habroptilus). Oxidative stress, estimated by biomarkers thiobarbiturate acid reacting substance (TBARS), plasma uric acid (PUA), and glutathione (GSH) and at 10, 30, 55, and 80 wks-of-age within each species, was not consistent. The level of GSH was highest in guineafowl, but lowest in budgie. While PUA, an antioxidant, exhibited a significantly (P<0.05) decrease as birds grew order, TBARS, a lipid peroxidation index, increased with age. In general, oxidant and antioxidant status appeared to vary among species and to be significantly affected by age, unlike mutations in the mtDNA which remained the same in younger and older birds. This primary findings and discoveries of this dissertation research include the large scale SNP discovery in previously described and novel avian mtGenomes including the chicken and turkey, the two main poultry species, and the determination that oxidative stress in birds appears to vary with age but that this does not affect mitochondrial DNA variation. Recent evidence of work in mice appears to support results described in this dissertation that mitochondrial DNA mutations do not increase with age, the central paradigm of the â  Free Radical Theory of Agingâ  . The dissertation also described resources and data that will be a foundation for the use of birds, especially the budgie, as a model for testing this theory that remains of interest to both agricultural and biomedical sciences.",
  "description_provenance": [
    "Author Email: gxjing@vt.edu",
    "Advisor Email: jrankin@vt.edu",
    "Advisor Email: hojiang@vt.edu",
    "Advisor Email: jaketu@vt.edu",
    "Advisor Email: dasamuel@vt.edu",
    "Advisor Email: esmith@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:21Z (GMT). No. of bitstreams: 1 X.Guan_Dissertation.pdf: 1348797 bytes, checksum: c22e6fd7ba03fc044dd43bc35936640e (MD5)   Previous issue date: 2007-05-10"
  ],
  "handle": "27827",
  "identifier_other": "etd-05212007-180551",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05212007-180551/",
  "identifier_uri": "http://hdl.handle.net/10919/27827",
  "publisher": "Virginia Tech",
  "relation_haspart": "X.Guan_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mitochondrial genome",
    "birds",
    "oxidative stress",
    "biomarkers",
    "longevity"
  ],
  "title": "Genomic and biochemical analysis of oxidative stress in birds with diverse longevities",
  "type": "Dissertation"
}