{
  "contributor_author": "Drees, Martin",
  "contributor_committeechair": "Heflin, James R.",
  "contributor_committeemember": [
    "Indebetouw, Guy J.",
    "Zallen, Richard H.",
    "Di Ventra, Massimiliano",
    "Davis, Richey M."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:12:21Z",
  "date_adate": "2003-06-11",
  "date_available": "2014-03-14T20:12:21Z",
  "date_issued": "2003-05-12",
  "date_rdate": "2003-06-11",
  "date_sdate": "2003-05-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this thesis, the interface between the electron donor polymer and the electron acceptor fullerene in organic photovoltaic devices is studied. Starting from a bilayer system of donor and acceptor materials, the proximity of polymer and fullerene throughout the bulk of the devices is improved by inducing an interdiffusion of the two materials by heating the devices in the vicinity of the glass transition temperature of the polymer. In this manner, a concentration gradient of polymer and fullerene throughout the bulk is created. The proximity of a fullerene within 10 nm of any photoexcitation in the polymer ensures that the efficient charge separation occurs. Measurements of the absorption, photoluminescence, and photocurrent spectra as well as I-V characteristics are used to study the interdiffusion and its influence on the efficiency of the photovoltaic devices. In addition, the film morphology is studied on a microscopic level with transmission electron microscopy and with Auger spectroscopy combined with ion beam milling to create a depth profile of the polymer concentration in the film. Initial studies to induce an interdiffusion were done on poly(2-methoxy-5-(2'-ethylhexyloxy)-1,4-phenylenevinylene) (MEH-PPV) as the electron donor polymer and the buckminsterfullerene C60 as the electron acceptor. Interdiffused devices show an order of magnitude photoluminescence quenching with concomitant increase in the photocurrents by an order of magnitude. Variation of the polymer layer thickness shows that the photocurrents increase with decreasing thickness down to 70 nm due to charge transport limitation. The choice of layer thickness in organic photovoltaic devices is critical for optimization of the efficiency. The interdiffusion process is also monitored in situ and a permanent increase in photocurrents is observed during the heat treatment. Transmission electron microscopy (TEM) studies on cross sections of the film reveal that C60 interdiffuses into the MEH-PPV bulk in the form of >10 nm clusters. This clustering of C60 is a result of its tendency to crystallize and the low miscibility of C60 in MEH-PPV, leading to strong phase separation. To improve the interdiffusion process, the donor polymer is replaced by poly(3-octylthiophene-2,5-diyl) (P3OT), which has a better miscibility with C60. Again, the photocurrents of the interdiffused devices are improved significantly. A monochromatic power conversion efficiency of 1.5 % is obtained for illumination of 3.8 mW/cm2 at 470 nm. The polymer concentration in unheated and interdiffused films is studied with Auger spectroscopy in combination with ion beam milling. The concentration profile shows a distinct interface between P3OT and C60 in unheated films and a slow rise of the P3OT concentration throughout a large cross-section of the interdiffused film. TEM studies on P3OT/C60 films show that C60 still has some tendency to form clusters. The results of this thesis demonstrate that thermally-controlled interdiffusion is a viable approach for fabrication of efficient photovoltaic devices through nanoscale control of composition and morphology. These results are also used to draw conclusions about the influence of film morphology on the photovoltaic device efficiency and to identify important issues related to materials choice for the interdiffusion process. Prospective variations in materials choice are suggested to achieve better film morphologies.",
  "description_provenance": [
    "Author Email: mdrees@vt.edu",
    "Advisor Email: gindebet@vt.edu",
    "Advisor Email: rzallen@vt.edu",
    "Advisor Email: diventra@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:21Z (GMT). No. of bitstreams: 1 thesisMD-rev.pdf: 2035995 bytes, checksum: 6e3a5e8089cdc12f39f5ca30ecb0477c (MD5)   Previous issue date: 2003-05-12"
  ],
  "handle": "27823",
  "identifier_other": "etd-05212003-153034",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05212003-153034/",
  "identifier_uri": "http://hdl.handle.net/10919/27823",
  "publisher": "Virginia Tech",
  "relation_haspart": "thesisMD-rev.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Organic Photovoltaics",
    "Conjugated Polymers",
    "Interdiffusion",
    "Gradient Bulk-heterojunction"
  ],
  "title": "Polymer/Fullerene Photovoltaic Devices - Nanoscale Control of the Interface by Thermally-controlled Interdiffusion",
  "type": "Dissertation"
}