{
  "contributor_author": "Jogi, Shasekant",
  "contributor_committeechair": "Knox, Paul L.",
  "contributor_committeemember": [
    "Luke, Timothy W.",
    "Edwards, Patricia K.",
    "Scarpaci, joseph L. Jr.",
    "Rodriguez-Camilloni, Humberto L."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:12:25Z",
  "date_adate": "2008-05-21",
  "date_available": "2014-03-14T20:12:25Z",
  "date_issued": "1992",
  "date_rdate": "2012-03-14",
  "date_sdate": "2008-05-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research is concerned with the social creation of built environments in the Third World. The absence of appropriate theoretical frameworks has hampered the research of Third World cities. Recently, however, the opportunity for applying concepts, that have to date been largely confined to the study of western cities, has increased provided they are organized in a suitable way. Drawing on concepts such as built environment, socio-spatial dialectic, and structure and agency, this research outlines and applies a framework for the study of Third World urbanization. <p> In order to explore the interdependence between space and society this study \"unpacks\" the urban landscape of Harare, Zimbabwe. Working in the context of the culture of capitalism, the study traces the development of the southern African zonal urban system before establishing a typology of landscape ensembles through successive stages of the evolution of Zimbabwe's political economy. Within the current global epoch, the study focuses on a specific type of built environment -- the townhouse. <p> As a repository of contested cultural ideas and practices, the townhouse stands at the center of often conflicting socio-economic groups defined collectively as a \"structure of provision\".",
  "description_provenance": [
    "Author Email: Sasha.Jogi@arup.com",
    "Made available in DSpace on 2014-03-14T20:12:25Z (GMT). No. of bitstreams: 6 LD5655.V856_1992.J645_drw01.pdf: 49692917 bytes, checksum: 47c97485c49892c2cbe6cea796e0e852 (MD5) LD5655.V856_1992.J645.pdf: 34583269 bytes, checksum: f4d11af4cf80e373cf4d0df7a357f66d (MD5) LD5655.V856_1992.J645_drw02.pdf: 49752203 bytes, checksum: 90cbe003ccf8b47f623666cf1b280018 (MD5) LD5655.V856_1992.J645_drw03.pdf: 50192171 bytes, checksum: b78a725212cdd69d92e5eaf57b6d0792 (MD5) LD5655.V856_1992.J645_drw04.pdf: 50172080 bytes, checksum: fd9f723ff377b972669c2f4bf952131d (MD5) LD5655.V856_1992.J645_drw05.pdf: 50073367 bytes, checksum: 697263e2b7f0be3a14bdf61c62859ba0 (MD5)   Previous issue date: 1995-04-01"
  ],
  "handle": "27828",
  "identifier_other": "etd-05212008-115048",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05212008-115048/",
  "identifier_uri": "http://hdl.handle.net/10919/27828",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "LD5655.V856_1992.J645_drw01.pdf",
    "LD5655.V856_1992.J645.pdf",
    "LD5655.V856_1992.J645_drw02.pdf",
    "LD5655.V856_1992.J645_drw03.pdf",
    "LD5655.V856_1992.J645_drw04.pdf",
    "LD5655.V856_1992.J645_drw05.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Third World",
    "city planniing",
    "housing"
  ],
  "subject_lcc": "LD5655.V856 1992.J645",
  "title": "The Social Production of the Built Environment: the Case of the Townhouse in Harare, Zimbabwe",
  "type": "Dissertation"
}