{
  "contributor_author": "Holland, Alissa Kate",
  "contributor_committeechair": "Harrison, David W.",
  "contributor_committeemember": [
    "Pierce, Thomas",
    "Kim-Spoon, Jungmeen",
    "Bell, Martha Ann",
    "Denbow, Donald Michael"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:12:25Z",
  "date_adate": "2008-07-22",
  "date_available": "2014-03-14T20:12:25Z",
  "date_issued": "2008-05-07",
  "date_rdate": "2008-07-22",
  "date_sdate": "2008-05-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Executive functions, potentially including the regulatory control of emotions and expressive fluency (verbal or design), have historically been associated with the frontal lobes.  Moreover, research has demonstrated the importance of cerebral laterality with a prominent role of the right frontal regions in the regulation of negative affect (anger, hostility) and in the generation or fluent production of designs rather than verbal fluency (left frontal).  In the present research, participants identified with high and with low levels of hostility were evaluated on a design fluency test twice in one experimental session.  Before the second administration of the fluency test, each participant underwent the cold pressor stressor.  EEG data collection took place before and after each experimental manipulation.  It was hypothesized that diminished right frontal capacity in high hostiles would be evident through lowered performance on this cognitive stressor.  Convergent validity of the â  capacity modelâ   was partially supported wherein high hostile men evidenced reduced delta magnitude over the right frontal region after exposure to a physiological stressor but failed to maintain consistent levels of right cerebral activation across conditions.  The results suggest an inability for high hostile men to maintain stable levels of cerebral activation with stress after exposure to physiological and cognitive stress.  Moreover, low hostiles showed enhanced cognitive performance on the design task with lower levels of arousal (heightened delta magnitude).  In contrast, reduced arousal (heightened delta magnitude) yielded increased executive deficits in high hostiles as evidenced through increased perseverative errors on the design fluency task.",
  "description_provenance": [
    "Author Email: akhollan@vt.edu",
    "Advisor Email: tpierce@radford.edu",
    "Advisor Email: jungmeen@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Advisor Email: dwh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:25Z (GMT). No. of bitstreams: 1 Kate_Holland_Dissertation.pdf: 1738238 bytes, checksum: 0e0af43b33ac7de18d6d329351aaac6d (MD5)   Previous issue date: 2008-05-07"
  ],
  "handle": "27829",
  "identifier_other": "etd-05212008-161554",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05212008-161554/",
  "identifier_uri": "http://hdl.handle.net/10919/27829",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kate_Holland_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "capacity model",
    "cerebral laterality",
    "QEEG",
    "hostility",
    "emotion",
    "design fluency"
  ],
  "title": "A Functional Cerebral Systems Approach to Hostility: Changes in Frontal Lobe Delta Activation and Fluency Performance as a Function of Stress",
  "type": "Dissertation"
}