{
  "contributor_author": "Bedell, Robert Irving",
  "contributor_committeecochair": [
    "Kelly, Patricia Proudfoot",
    "Carico, Kathleen M."
  ],
  "contributor_committeemember": [
    "Garrison, James W.",
    "Nespor, Jan K.",
    "Magliaro, Susan G."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:12:26Z",
  "date_adate": "2000-05-22",
  "date_available": "2014-03-14T20:12:26Z",
  "date_issued": "2000-05-09",
  "date_rdate": "2006-05-22",
  "date_sdate": "2000-05-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Good student evaluations are not always the measure of a successful class, and in spite of my consistently high student evaluations, I knew something had been lost in my classes.  In an effort to revitalize my teaching, to increase both student participation and instructor satisfaction, I undertook an experiment in which I taught two sections of the same literature survey differently.  One class was taught as I had, of recent years, been teaching: primarily lecture.  The second class was decentralized: circled seating arrangement, all participants (including me) seated, and a required student literary response journal. <p> Change is much easier decided upon than implemented.  Instructor discomfort when climbing out of teaching ruts can be strong enough to impede progress (temporarily) but is a sure sign of growth   Although the decentralized classroom increases a sense of vulnerability, it also increases camaraderie.  Class discussion can and does veer in unexpected directions but also leads to unanticipated insights and increased student involvement with the material.  The instructorâ  s job becomes more complicated because although there must be latitude for a range of responses, the class discussion must not be allowed to drift totally off topic.  Thus, the instructor must have the restraint to allow students to express and defend their ideas, and must not rein in apparent misdirections too quickly.  To do so would risk stifling student involvement and precluding significant new insights.  One casualty of increased student participation in discussion is the amount of material that can be covered.  The physical arrangement of a class in a circle encourages student discussion, but that decentralization is really more a function of attitude than of physical space.  <p> An essential component of the successful discussion class is the student literary response journal.  The journal encourages students to focus on and wrestle with the reading assignment.  In the process they can hone their analytic skills, preview and practice articulating their ideas, generate ideas for formal essays, and receive private, non-threatening encouragement from the instructor.",
  "description_provenance": [
    "Author Email: BEDELLRI@mail.vmi.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: kcarico@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:26Z (GMT). No. of bitstreams: 1 ETD.PDF: 514191 bytes, checksum: 32c5e4187221a902a4b31bec5b5d2cee (MD5)   Previous issue date: 2000-05-09"
  ],
  "handle": "27836",
  "identifier_other": "etd-05222000-15170042",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05222000-15170042/",
  "identifier_uri": "http://hdl.handle.net/10919/27836",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "zone of proximal development",
    "ZPD",
    "literary response journals",
    "burnout"
  ],
  "title": "Journey of Rediscovery: Less Control for More Learning",
  "type": "Dissertation"
}