{
  "contributor_author": "Moeykens, Michael David",
  "contributor_committeechair": "Voshell, J. Reese Jr.",
  "contributor_committeemember": [
    "Fell, Richard D.",
    "Benfield, Ernest Fredrick",
    "Angermeier, Paul L.",
    "Smith, Eric P."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:12:26Z",
  "date_adate": "2002-05-28",
  "date_available": "2014-03-14T20:12:26Z",
  "date_issued": "2002-05-10",
  "date_rdate": "2003-05-28",
  "date_sdate": "2002-05-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Research was conducted in three areas of water quality assessment.  Long term ecological monitoring data from Shenandoah National Park (SNP) were analyzed and a protocol for data analysis was presented.  Streams in SNP were found to be comparable to the best that can be found in the Blue Ridge ecoregion.  Land use in SNP (mostly for recreational purposes) does not appear to be causing impairment to the macroinvertebrate assemblages.  Streams in the SNP were found to recover quickly from disturbance. <p> \tThe Macroinvertebrate Aggregated Index for Streams (MAIS) was found to have an overall classification efficiency (CE) of 86% in the Ridge and Valley ecoregion, and an overall CE of 91% in the Central Appalachians ecoregion.  Refinement of the MAIS for use in the Blue Ridge ecoregion resulted in an increase of the overall CE to 78%.  The CE for reference sites in the Blue Ridge was 75%, and the CE for degraded sites was 87%. <p> \tAn intensive study of a stream (Peak Creek) with suspected heavy metal impairment showed that capping of an industrial waste site has resulted in improvements to the macroinvertebrate assemblages.  The source of the impairment was not linked solely to heavy metals, but was found to be a mixture of pollution sources and environmental stress.",
  "description_provenance": [
    "Author Email: mmoeyken@vt.edu",
    "Advisor Email: rfell@vt.edu",
    "Advisor Email: rvoshell@vt.edu",
    "Advisor Email: benfield@vt.edu",
    "Advisor Email: biota@vt.edu",
    "Advisor Email: EPSMITH@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:26Z (GMT). No. of bitstreams: 1 MoeyDisNew.pdf: 2113722 bytes, checksum: 0cbab5d39fe3eb99d2b46ec935c1cc51 (MD5)   Previous issue date: 2002-05-10"
  ],
  "handle": "27839",
  "identifier_other": "etd-05222002-174758",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05222002-174758/",
  "identifier_uri": "http://hdl.handle.net/10919/27839",
  "publisher": "Virginia Tech",
  "relation_haspart": "MoeyDisNew.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "heavy metals",
    "Shenandoah National Park",
    "multimetric index",
    "biocriteria",
    "biomonitoring",
    "MAIS"
  ],
  "title": "Studies of Benthic Macroinvertebrate Use for Biomonitoring of Mid-Atlantic Highland Streams",
  "type": "Dissertation"
}