{
  "contributor_author": "Gibson, Shanan Gwaltney",
  "contributor_committeechair": "Harvey, Robert J.",
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:12:26Z",
  "date_adate": "2001-05-22",
  "date_available": "2014-03-14T20:12:26Z",
  "date_issued": "2001-05-09",
  "date_rdate": "2002-05-22",
  "date_sdate": "2001-05-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As a process designed to collect information about jobs, job analysis is one of the most fundamental aspects of personnel psychology. It forms the foundation upon which almost every other human resource management component is built, including selection, compensation, performance appraisal, and training program development. Despite the considerable evidence of human fallibility in other judgment processes, many have followed the implicit assumption that job analysis information is accurate without actually examining this proposition.  This study considers two potential sources of job analysis rating inaccuracy â   the source of the ratings and the type of instrument utilized to collect ratings. By utilizing less job-familiar job analysis raters and shorter, more holistic job analysis instruments, industrial-organizational psychologists have attempted to attenuate the time and costs associated with the job analysis process; however, findings regarding the reliability and accuracy of such practices are questionable. Hypotheses tested in the current study indicated that decomposed measures of job behavior converged to a greater degree with an external job analysis than did holistic measures.  Interrater agreements for all types of raters and across all types of instruments are concluded to be inadequate. Potential explanations from the cognitive and social psychological domains for these findings are conjectured and directions for future research are noted.",
  "description_provenance": [
    "Author Email: shanan@vt.edu",
    "Advisor Email: harveyrj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:26Z (GMT). No. of bitstreams: 3 AppendixC.pdf: 239800 bytes, checksum: 2363a5a454351d17caec28ac6bff24cf (MD5) AppendixB.pdf: 115343 bytes, checksum: eb225b062556c4885fcfb99020b646bc (MD5) etd.pdf: 297248 bytes, checksum: 5ef0028eded5e035027116c7eb1236da (MD5)   Previous issue date: 2001-05-09"
  ],
  "handle": "27838",
  "identifier_other": "etd-05222001-104922",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05222001-104922/",
  "identifier_uri": "http://hdl.handle.net/10919/27838",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "AppendixC.pdf",
    "AppendixB.pdf",
    "etd.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "accuracy",
    "interrater agreement",
    "job analysis"
  ],
  "title": "Call Me Old Fashioned - Is My Job Analysis Accurate or Not?",
  "type": "Dissertation"
}