{
  "contributor_author": "Michael, Kurt Y.",
  "contributor_committeechair": "Bame, E. Allen",
  "contributor_committeemember": [
    "Hirsh, Richard F.",
    "LaPorte, James E.",
    "Brusic, Sharon A.",
    "Abraham, Jane L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:26Z",
  "date_adate": "2000-05-23",
  "date_available": "2014-03-14T20:12:26Z",
  "date_issued": "2000-05-10",
  "date_rdate": "2001-05-23",
  "date_sdate": "2000-05-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to compare the effect of a computer simulation activity versus a hands-on activity on students' product creativity, originality, and usefulness. Fifty-eight middle school technology education students from Northern Virginia participated in the study. Subjects were randomly assigned to either a computer simulation or hands-on treatment group. The computer simulation group used a Lego-type brick simulator to construct creative products on the computer; whereas, the hands-on treatment group used real LEGO® bricks to construct their creative products. The hands-on groups' products were collected by the researcher and copied into the computer simulation program. Both groups' products were printed using a color printer. The printed products were evaluated by expert judges using a creative product semantic differential scale.   This study showed that there was no significant difference in product creativity scores among the computer simulation and the hands-on treatment group. The null hypothesis was accepted. Findings suggested that it was possible to use a computer simulation activity in place of a hands-on activity and still maintain product creativity, originality, and usefulness.",
  "description_provenance": [
    "Author Email: kmichael@vt.edu",
    "Advisor Email: richards@vt.edu",
    "Advisor Email: laporte@vt.edu",
    "Advisor Email: brusic@vt.edu",
    "Advisor Email: janea@vt.edu",
    "Advisor Email: abame@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:26Z (GMT). No. of bitstreams: 1 ETD.pdf: 187308 bytes, checksum: 2b3efb0b387d36a6c10c52340419c453 (MD5)   Previous issue date: 2000-05-10"
  ],
  "handle": "27837",
  "identifier_other": "etd-05222000-16210003",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05222000-16210003/",
  "identifier_uri": "http://hdl.handle.net/10919/27837",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "creative product",
    "creativity",
    "technology education",
    "computer simulation"
  ],
  "title": "Comparison of Students' Product Creativity Using a Computer Simulation Activity versus a Hands-on Activity in Technology Education",
  "type": "Dissertation"
}