{
  "contributor_author": "Macri, Richard Vincent",
  "contributor_committeechair": "Gandour, Richard D.",
  "contributor_committeemember": [
    "Tanko, James M.",
    "Long, Timothy E.",
    "Kingston, David G. I.",
    "Carlier, Paul R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:12:25Z",
  "date_adate": "2009-06-15",
  "date_available": "2014-03-14T20:12:25Z",
  "date_issued": "2009-05-06",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-05-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Two new homologous series of amphiphilesâ  five long-chain, three-headed amphiphiles [3CCb14, 3CCb16, 3CCb18, 3CCb20, 3CCb22; CH3(CH2)n-1OCONHC(CH2CH2COOH)3, n = 14, 16, 18, 20, 22], and six branched-chain, three-headed amphiphiles [3CCb1(7,7), 3CCb1(8,8), 3CCb1(9,9), 3CCb1(10,10), 3CCb1(11,11), 3CCb1(12,12); (CH3(CH2)n-1)2CHOCONHC(CH2CH2COOH)3, n = 7, 8, 9, 10, 11, 12]â  were synthesized.  The synthesis of the 3CCbn series was accomplished in two steps from Weisocyanateâ ¢ and the long chain alcohol in good yields of chromatographed products (65â  81%).  The 3CCb1(n,n) series was similarly synthesized from Weisocyanateâ ¢ and the two-tailed symmetric alcohol (produced from a reaction of alkyl magnesium bromide and ethyl formate) in good yields of chromatographed products (71â  84%). CMC data were collected by pendent-drop technique for the 3CAmn, 3CCbn, 3CUrn, and 3CCb1(n,n) series of amphiphiles to establish the concentration required for detergency.  The triethanolammonium salt provided better solubility and higher CMCs of these amphiphiles than the potassium salt.  All amphiphilic series tested lowered the solution surface tension from ~ 72 mN/m to ~ 50â  55 mN/m, indicating that these amphiphiles are less surface active than typical surfactants such as sodium dodecyl sulfate.  The CMCs for the 3CAmn series were found to decrease in value from 2 Ã  10-2 M (3CAm15) to 2 Ã  10-3 M (3CAm21) in a linear fashion.  The CMCs for the 3CCbn series were found to decrease in value from 7 Ã  10-3 M (3CCb16) to 0.4 Ã  10-3 M (3CCb22) in a linear fashion.  The CMCs for the 3CUrn series were found to decrease in value from 2 Ã  10-3 M (3CUr18) to 1 Ã  10-3 M (3CUr22) in a linear fashion.<p> Due to discrepancies in several of the IFT vs. log concentration plots for the previous homologous series of amphiphiles, the CMC data was collected using a pyrene fluorescence measurement technique.  The data from the pyrene fluorescence technique seems likely to be more accurate, indicating that surface tension may not be the most reliable method for determining the CMC of these amphiphiles.  The CMCs (as determined by pyrene fluorescence) for the 3CAmn series were found to decrease in value from 2 Ã  10-2 M (3CAm15) to 2 Ã  10-3 M (3CAm21) in a linear fashion.  The CMCs for the 3CCbn series were found to decrease in value from 7 Ã  10-3 M (3CCb16) to 0.3 Ã  10-3 M (3CCb22) in a linear fashion.  The CMCs for the 3CUrn series were found to decrease in value from 7 Ã  10-3 M (3CUr16) to 0.2 Ã  10-3 M (3CUr22) in a linear fashion.  In both the surface tension and the pyrene fluorescence techniques, the shortest chain length homologues (3CAm13, 3CCb14, and 3CUr14) did not show a break up to the limits of solubility.<p> The CMCs as determined by surface tension for the 3CCb1(n,n) series were found to decrease in value from 0.5 Ã  10-3 M (3CCb1(9,9)) to 0.02 Ã  10-3 M (3CCb1(12,12)) in a linear fashion.  The 3CCb1(8,8) and 3CCb1(7,7) amphiphiles did not show a CMC break up to the limits of solubility.  The 3CCb1(12,12) showed an unusually steep decrease in surface tension over a very narrow range of concentration.  There is considerable doubt as to the accuracy of the 3CCb1(11,11) data, and the CMCs for these two-tailed amphiphiles needs to be measured by a second method as was done for the single-tail series to verify the CMCs of all the two-tail homologues. Activity (minimal inhibitory concentrations, MICs) for the 3CAmn, 3CCbn, 3CUrn, 3CCb1(n,n), 2CAmn, and 2CCbn series was measured against several different bacteria, mycobacteria, yeast, and fungi.  Additionally, anti-HIV and cytotoxicity data was collected for the 3CAmn, 3CCbn, and 3CUrn series.  Greatest inhibition was typically seen from the 18â  20 carbon tail length homologues of each series (3CAm19â  3CAm21, 3CCb18â  3CCb20, 3CUr18â  3CUr20, 2CAm19â  2CAm21, and 2CCb18â  2CCb20).  <p> Inoculum density affected the activity of our earlier studies, and selected organisms were retested to obtain the intrinsic activity.  3CUr18 and 3CAm19 proved most effective against Mycobacterium smegmatis, with MIC99 = 6.3 Î¼M @ 10^5 CFU/mL inoculum density.  3CCb20 was most effective against Mycobacterium marinum with MIC99 = 16 Î¼M @ 10^5 CFU/mL inoculum density.  3CAm19, 3CCb18, and 3CUr18 all showed equivalent activity against Mycobacterium chelonae with MIC99 = 17 Î¼M @ 10^5 CFU/mL inoculum density.  Against Staphylococcus aureus, the 2CAm21 was most effective, with MIC90 = 2.0 Î¼M @ 10^5 CFU/mL inoculum density.  3CCb20 was most effective against MRSA with MIC90 = 2.9 Î¼M @ 10^5 CFU/mL inoculum density.  The two-tailed analogs (3CCb1(n,n), 3CUr(n,n), and 3CUr1(n,n)) typically showed little to no activity against the tested microorganisms.  Comparison of MIC to CMC is a relative measure of safety of a drug candidate.  All single-tail amphiphiles showed ratios of MIC/CMC of 16â  126, with a ratio of 100 or better being optimal.  The ratios for the two-tail amphiphiles ranged from 0.39 to 2.9.",
  "description_provenance": [
    "Author Email: rmacri@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Advisor Email: gandour@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:25Z (GMT). No. of bitstreams: 1 RVMacriDissertation.pdf: 2260132 bytes, checksum: 9da60a64eb4500d6a0d8931b50ab29c6 (MD5)   Previous issue date: 2009-05-06"
  ],
  "handle": "27831",
  "identifier_other": "etd-05212009-150034",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05212009-150034/",
  "identifier_uri": "http://hdl.handle.net/10919/27831",
  "publisher": "Virginia Tech",
  "relation_haspart": "RVMacriDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "CMC",
    "critical micelle concentration",
    "pendent drop",
    "surfactant",
    "amphiphile"
  ],
  "title": "Synthesis, Characterization, and Micellar Properties of Dendritic Amphiphiles",
  "type": "Dissertation"
}