{
  "contributor_author": "Liang, Yan",
  "contributor_committeechair": "Norton, George W.",
  "contributor_committeecochair": "Reaves, Dixie Watts",
  "contributor_committeemember": [
    "Ellerbrock, Michael J.",
    "Mills, Bradford F.",
    "Yang, Dennis T."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:12:26Z",
  "date_adate": "2006-07-13",
  "date_available": "2014-03-14T20:12:26Z",
  "date_issued": "2006-05-15",
  "date_rdate": "2008-07-13",
  "date_sdate": "2006-05-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Despite concerted efforts at agricultural development over many years, millions of people in developing countries still suffer from poverty and under-nutrition. New crop varieties, such as those released during the green revolution in Asia, increased farmersâ   income and reduced the level of under-nutrition. In recent years, while the speed of the development of conventional breeding technology has slowed, biotechnology has developed rapidly. In 2005, about 8.5 million farmers in 21 countries grew transgenic crops. Transgenic rice has not been commercially released on a large scale, but progress has been made in developing varieties with potential to increase yield and reduce input costs. In this context, this research aims to provide empirical evidence on the potential effects of introducing transgenic rice on farm householdsâ   income and nutritional well-being in Bangladeshâ  including the impacts on their current nutritional status and nutritional vulnerability over time. To this end, two econometric models are constructed and estimated.   A farm household model is employed to project farm householdsâ   production and consumption responses to introducing improved rice varieties such as transgenic rice. The model estimates the profit effect of introducing transgenic rice. The influence of the profit effect on farmersâ   consumption decisions is then considered. Due to the ex ante nature of this research and data limitations, the effects of transgenic rice are assumed to be similar to that of previous high yielding varieties (HYVs), and the impact of transgenic rice on farm household profit is assumed to be similar to the effect of the percentage of rice area in HYVs and the yield effect of transgenic rice is the same as HYVs. On the production side, the supply of three outputsâ  rice, all other crops and animal productsâ  and demand of labor and fertilizer were estimated. On the consumption side, both poor and non-poor householdsâ   demand for rice, wheat/other food, pulse, oil, vegetables/fruits, meat/egg/ milk, fish, and spices were estimated. Based on the parameter estimates, the calorie intake and protein intake elasticities with respect to introducing transgenic rice were computed. The results indicate that the total profit elasticity with respect to the percentage of rice area in HYVs is 0.08. The calorie elasticity with respect to the percentage of rice area in HYVs ranges from 0.062 in non-poor to 0.074 in poor households, and the protein elasticity ranges from 0.075 in non-poor to 0.084 in poor households. The results indicate that transgenic rice is likely to play a positive role in improving farm householdsâ   nutritional status in terms of total calorie/protein intake. The magnitude, however, is likely to be moderate, if only the profit effect is considered.  A consumption forecasting model is used to examine farmersâ   nutritional vulnerabilityâ  a probabilistic concept defined as â  having a high probability now of suffering a shortfall in the futureâ  . It is assumed that when exposed to risk, farmersâ   consumption decisions have already considered their risk coping strategies. The effect of transgenic rice is reflected by its impact on farm income. Farm householdsâ   calorie intake in the future (hunger season) was predicted by a multivariate regression function with the logarithmic daily per resident calorie intake as the dependent variable. The independent variables include variables that represent householdsâ   income, flood exposure, assets, and demographic composition. Farm householdsâ   nutritional vulnerability profiles, based on the estimation of ex ante mean and variance, indicate that vulnerability exists among surveyed rice farm households. The model also predicts that the income increase induced by introducing transgenic rice will reduce each individual householdâ  s probability of suffering a future consumption shortfall and subsequently will reduce its vulnerability. The overall vulnerability profile of farm households improves in Bangladesh.",
  "description_provenance": [
    "Author Email: yliang@vt.edu",
    "Advisor Email: gnorton@vt.edu",
    "Advisor Email: dixie@vt.edu",
    "Advisor Email: mebrock@vt.edu",
    "Advisor Email: bfmills@vt.edu",
    "Advisor Email: deyang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:26Z (GMT). No. of bitstreams: 1 YanLiangDissertation.pdf: 1076716 bytes, checksum: eb4cf7edb4d5d934d5ccaa5662aa00fc (MD5)   Previous issue date: 2006-05-15"
  ],
  "handle": "27841",
  "identifier_other": "etd-05222006-155537",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05222006-155537/",
  "identifier_uri": "http://hdl.handle.net/10919/27841",
  "publisher": "Virginia Tech",
  "relation_haspart": "YanLiangDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "nutritional vulnerability",
    "farm household",
    "transgenic rice",
    "Bangladesh"
  ],
  "title": "An Ex Ante Analysis of the Effects of Transgenic Rice on Farm Householdsâ   Nutritional Vulnerability in Bangladesh",
  "type": "Dissertation"
}