{
  "contributor_author": "Nicolay, John",
  "contributor_committeechair": "Goodsell, Charles T.",
  "contributor_committeemember": [
    "Wamsley, Gary L.",
    "Wolf, James F.",
    "Rodriguez-Camilloni, Humberto L.",
    "Miller, Hugh C."
  ],
  "contributor_department": "Public Affairs and Public Policy",
  "date_accessioned": "2014-03-14T20:12:27Z",
  "date_adate": "2007-05-22",
  "date_available": "2014-03-14T20:12:27Z",
  "date_issued": "1991-05-30",
  "date_rdate": "2011-08-16",
  "date_sdate": "2007-05-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Do citizen volunteers, sitting on legislatively created local historic architectural review boards, represent a part of the American governance tradition? This study examines the relationships between public board members, citizen interests, career public administrators and the elected appointing authorities. This research involved a national survey of over 1200 members of boards of historic architectural review. In addition, four town or county case studies are presented in detail. These case studies are Jonesborough, Tennessee; Lynchburg, Virginia; Cobb County, Georgia; and Gettysburg, Pennsylvania. These case studies are examined through an ecological perspective. </p><p>Within the context of this study, boards of historic architectural review are very much a part of the urban/town/county governance model. They are highly professional in their composition, highly egalitarian, and deeply committed to furthering highly individualistic notions of community. Although some national community studies suggest a malaise in communitarian ideals, this research suggests just the contrary. The failure of citizenship falls more upon the legitimacy accorded to citizens as public administrators rather than an apathy toward manifesting that citizenship.</p><p> Historic preservation itself is in a national state of disarray. Its ethos is poorly defined, and the national wellspring for preservation impetus to the local community is strained. Most communities find themselves struggling to fit a nostalgic, sentimental vision of the preserved environment into a well articulated economic model.</p><p> This research suggests that local historic architectural review boards need to draw upon themselves to create better opportunities through self-study and formal certification programs. By enhancing their natural reserves of professionalism and commitment, they will advertise what they already do very well: administer in the public interest. By joining with like-minded community-based public boards this new coalition promises a energy and direction for municipal governments. The key is to foster an open environment of dialogue and debate centered on furthering good, responsive government.</p>",
  "description_provenance": [
    "Author Email: none@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:27Z (GMT). No. of bitstreams: 1 LD5655.V856_1991.N536.pdf: 16644391 bytes, checksum: 5a132e3a7e2887ad6459e7de876ea82b (MD5)   Previous issue date: 1991-05-30"
  ],
  "format_medium": "BTD",
  "handle": "27843",
  "identifier_other": "etd-05222007-091336",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05222007-091336/",
  "identifier_uri": "http://hdl.handle.net/10919/27843",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1991.N536.pdf",
  "subject": [
    "Citizen participation",
    "Government policy",
    "Historic sites -- Conservation and restoration",
    "Historic buildings -- Conservation and restoration"
  ],
  "subject_lcc": "LD5655.V856 1991.N536",
  "title": "Historic preservation : a study in local public administration",
  "type": "Dissertation"
}