{
  "contributor_author": "Ramniceanu, Andrei",
  "contributor_committeechair": "Weyers, Richard E.",
  "contributor_committeemember": [
    "Lesko, John Jack",
    "Riffle, Judy S.",
    "Brown, Michael C.",
    "Roberts-Wollmann, Carin L."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:12:28Z",
  "date_adate": "2007-06-01",
  "date_available": "2014-03-14T20:12:28Z",
  "date_issued": "2007-05-18",
  "date_rdate": "2007-06-01",
  "date_sdate": "2007-05-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The primary cause of corrosion in transportation structures is due to chlorides which are applied to bridge decks as deicing salts.  The direct cost of corrosion damage to the countryâ  s infrastructure is approximately $8.3 billion per year.  One of the most common corrosion abatement methods in the United States is the barrier protection implemented through the application of fusion bonded epoxy coatings.    \tThe purpose of this study was to investigate various coating and exposure parameters to determine their effects on the corrosion of reinforcing steel.  The parameters investigated were: chloride content at the bar depth, coated bar corroded area, corrosion product color under the coating, epoxy coating adhesion, coating color, coating damage (holidays and holes), coating thickness, TGA, DSC and EDS analysis and  SEM coating cracking investigation.  This was accomplished by testing new coated bar specimens as well as specimens extracted from 27 bridge decks located in Virginia.  \tThis study demonstrated the following:  The extracted ECR coating samples presented extensive cracking compared to the new ECR samples in which the coating cracking was limited to only one sample. The DSC results showed that both the extracted samples as well as new samples are not fully cured during the manufacturing process.  The coating degree of curing data also showed that the bars are insufficiently and unevenly heated prior to the application of the powder coating.  Additionally, the samples investigated presented significant permanent adhesion loss with little or no epoxy coating residue present on the bar surface, while the EDS analysis showed that once adhesion is lost, corrosion will proceed unimpeded under the coating even in the absence of chlorides. \t \tThe parameters that presented a direct correlation with the observed corrosion activity were the number of holidays and the number of damaged areas per unit length of bar.  This indicates that the passivation of the bare steel exposed to the concrete pore solution at the breaches in the epoxy coating is not the same as a bare bar under similar exposure conditions allowing it instead to corrode at lower concrete chloride concentration levels than bare bars.    \tThe results also show a distinct loss of quality control in the handling and possibly storage of new coated bars.  The new ECR samples had significantly higher damage density than the samples extracted from concrete even though the coating is damaged during the placement of the concrete, while there was no change in the number of holidays and cure condition.  \tFinally, the data presented further evidence that while limited, the non-destructive corrosion assessment methods available for bare steel reinforced structures may also be used on ECR reinforced structures.  In particular, the corrosion rate measurements correlated reasonably well with the chloride concentrations at bar level.  This indicates that while the chlorides may not influence the corrosion activity under the coating, they do influence the corrosion activity at breaches in the coating.",
  "description_provenance": [
    "Author Email: aramnice@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: Michael.Brown@VDOT.Virginia.gov",
    "Advisor Email: rweyers@vt.edu",
    "Advisor Email: wollmann@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:28Z (GMT). No. of bitstreams: 1 ARamniceanu_Dissertation.pdf: 4642638 bytes, checksum: eee8efee84cbf0b9145fd30820bb3197 (MD5)   Previous issue date: 2007-05-18"
  ],
  "handle": "27848",
  "identifier_other": "etd-05222007-190857",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05222007-190857/",
  "identifier_uri": "http://hdl.handle.net/10919/27848",
  "publisher": "Virginia Tech",
  "relation_haspart": "ARamniceanu_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "corrosion; ECR; concrete durability; epoxy coating",
  "title": "Investigation of parameters governing the corrosion protection efficacy of fusion bonded epoxy coatings",
  "type": "Dissertation"
}