{
  "contributor_author": "Krishnakumar, Sukumarakurup",
  "contributor_committeechair": "Cobb, Anthony Terry",
  "contributor_committeemember": [
    "Hauenstein, Neil M. A.",
    "Lang, James R.",
    "Roberts, Richard D.",
    "Connerley, Mary L."
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:12:28Z",
  "date_adate": "2008-06-17",
  "date_available": "2014-03-14T20:12:28Z",
  "date_issued": "2008-04-18",
  "date_rdate": "2008-06-17",
  "date_sdate": "2008-05-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A recent focus on understanding emotions in organizations has resulted in increased attention to the role of Emotional Intelligence (EI). Emotional Intelligence (EI) is a type of intelligence that helps individuals to perceive, assimilate, understand, and manage emotions (Mayer & Salovey, 1997). The aim of this study is to understand the role of EI on individual attitudinal and performance outcomes. Specifically, this paper argues that EI may be an important determinant of employee job satisfaction, turnover intention, and performance.  Further, these effects are expected to be most pronounced in job functions with higher emotional requirements. Data collected from 278 law enforcement and healthcare employees provide no support for these propositions. These findings, their implications, and potential future studies are discussed.",
  "description_provenance": [
    "Author Email: sukrish1@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: jrlang@vt.edu",
    "Advisor Email: tcobb@vt.edu",
    "Advisor Email: rroberts@ets.org",
    "Advisor Email: maryc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:28Z (GMT). No. of bitstreams: 1 Kumar_Dissertation_June17th.pdf: 500327 bytes, checksum: 9de1354018aa6fd5d6e9258df7e2bb7f (MD5)   Previous issue date: 2008-04-18"
  ],
  "handle": "27849",
  "identifier_other": "etd-05222008-094940",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05222008-094940/",
  "identifier_uri": "http://hdl.handle.net/10919/27849",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kumar_Dissertation_June17th.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Healthcare",
    "Law Enforcement",
    "Emotional Intelligence",
    "Job performance"
  ],
  "title": "The Role of Emotional Intelligence and Job Emotional Requirements in Job Attitudes and Behavior",
  "type": "Dissertation"
}