{
  "contributor_author": "Saenz, Berlinda Luna",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_committeemember": [
    "Moore, David Michael",
    "Potter, Kenneth R.",
    "Magliaro, Susan G.",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:29Z",
  "date_adate": "2002-05-30",
  "date_available": "2014-03-14T20:12:29Z",
  "date_issued": "2002-05-09",
  "date_rdate": "2003-05-30",
  "date_sdate": "2002-05-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examines the theory of social presence and its relevancy to distance learning. Short, William, and Christie (1976) originally designed social presence to evaluate the difference between types of dyads (one-to-one interactions) and the quality of the communication media used for those interactions (Rafaeli, 1988; Rice, 1984; Walther, 1992). However, the theory of social presence was not design to explain mediated communication between multiple individuals. Although studies have investigated the effects of social presence in computer-mediated conferencing, little field research exist on the importance of social presence with multiple individuals communicating together within a Web-based instructional program. Moreover, it is evident from the body of literature that a universal meaning of social presence is lacking. For this reason, social presence in this study referred to the degree to which adult learners perceived that they had established some form of rapport with members of an online community. This includes interactions with other learners and support personnel (i.e., faculty, staff, technical support, graders, etc.).  Social presence has emerged as an important social factor in the field of distance learning (Gunawardena & Zittle, 1997; Rourke, Anderson, Garrison, & Archer, 1999). Recent field studies emphasize the importance of examining social and psychological factors that affect student satisfaction, impact learning, and influences the way people communicate in distance learning environments (Blocher, 1997; Gunawardena, 1995, Gunawardena & Zittle, 1997; Hackman, 1990, 1996; Hiltz, 1997; Rourke, 1999; Walther, 1992). Researchers in the fields of education and human interpersonal communication have identified â  interactivityâ   (i.e., interaction),  â  intimacyâ  , and â  immediacyâ   as attributes that enhance social presence (Christophel, 1990; Gunawardena & Zittle, 1997; McIsaac & Gunawardena, 1996; Mehrabian, 1989; Moore, 1989b; Short et al., 1976).  Although social presence has been characterized as an important construct in distance learning (McIsaac & Gunawardena, 1996), little existing field research describes the value adult learners place on it, and whether it affects their satisfaction within a mediated learning environment. This descriptive study examined the adult distance learnersâ   perceived value of social presence (based on interactions, intimacy, and immediacy), in addition to whether it existed within an asynchronous Web-based instructional program.",
  "description_provenance": [
    "Author Email: bsaenz@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:29Z (GMT). No. of bitstreams: 1 blsETD.pdf: 2563049 bytes, checksum: 58ad84a8971d6df3d3a4f1014ae33bdb (MD5)   Previous issue date: 2002-05-09"
  ],
  "handle": "27854",
  "identifier_other": "etd-05232002-095013",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05232002-095013/",
  "identifier_uri": "http://hdl.handle.net/10919/27854",
  "publisher": "Virginia Tech",
  "relation_haspart": "blsETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "and immediacy",
    "intimacy",
    "interactions",
    "interpersonal communication",
    "social presence",
    "Distance learning"
  ],
  "title": "Student Perceptions of Social Presence and its Value in an Asynchronous Web-based Masterâ  s Instructional Program",
  "type": "Dissertation"
}