{
  "contributor_author": "Kutintara, Benjamas",
  "contributor_committeechair": "Parrott, Kathleen R.",
  "contributor_committeemember": [
    "Boschi, Nadia",
    "Cross, Lawrence H.",
    "Roberto, Karen A.",
    "Beamish, Julia O."
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2014-03-14T20:12:29Z",
  "date_adate": "2002-05-30",
  "date_available": "2014-03-14T20:12:29Z",
  "date_issued": "2002-04-12",
  "date_rdate": "2003-05-30",
  "date_sdate": "2002-05-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Home Environments and Allergen Avoidance Practices in a Hot, Humid Climate  Benjamas Kutintara  (ABSTRACT)  \tThe purpose of the study was to examine home conditions, housing satisfactions, and allergen avoidance practices of people with allergic rhinitis, focusing on female patients who lived in an urban area in a hot, humid climate.  The Morris and Winter theory of housing adjustment provides a theoretical base for this study.  Nine hypotheses were tested to investigate interrelationships among home conditions, housing satisfaction in terms of health issues, allergen avoidance practices, and age.  A sample of 41 female allergy patients aged 20 to 77 years completed a screening questionnaire and an in-depth survey questionnaire.  The researcher visited their dwellings to conduct home observations and to take photos.  \tDust mite allergens were reported as the most common allergy triggers.  Presence of cockroaches, presence of furry pets outdoors, molds in bathrooms, and molds in kitchens were the most common problematic home conditions.  Open shelves, bookcases, drapes, horizontal blinds, and foam rubber pillows were the most common allergy related items found in respondentsâ   bedrooms.  Concerning health issues, the majority of the respondents were satisfied with their homes.  Allergen avoidance practices were not followed regularly, particularly, using allergen-proof pillowcases and sheets, washing bedding in hot water, wearing a particle mask when vacuuming, using an exhaust fan, an air cleaner, a dehumidifier, and cockroach traps.  The respondents who received suggestions from doctors were more likely to follow allergen avoidance practices than those who did not receive suggestions.  \tThe result shows a significant negative relationship between problematic home conditions and housing satisfaction in terms of health issues.  A significant negative relationship between age and allergen avoidance practices was found.  Older sufferers were less likely to use allergen-proof products.  They also lived in older homes that were more likely to have allergy related conditions.  The most common obstacles that prevented respondents from improving their homes in order to avoid allergens were cost of products, emotional attachment to pets, not having time to improve homes, and procrastination.  Based on these findings, design recommendations, home maintenance recommendations, and lifestyle practice recommendations were developed.",
  "description_provenance": [
    "Author Email: benjamas@vt.edu",
    "Advisor Email: nboschi@vt.edu",
    "Advisor Email: homes@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: kroberto@vt.edu",
    "Advisor Email: jbeamish@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:29Z (GMT). No. of bitstreams: 1 homeenvironments.pdf: 3356155 bytes, checksum: a5804fb6230532bd28d5639f9ffd822a (MD5)   Previous issue date: 2002-04-12"
  ],
  "handle": "27856",
  "identifier_other": "etd-05232002-175737",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05232002-175737/",
  "identifier_uri": "http://hdl.handle.net/10919/27856",
  "publisher": "Virginia Tech",
  "relation_haspart": "homeenvironments.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Home design",
    "Bangkok",
    "Indoor Air Quality",
    "Healthy House",
    "Older People",
    "Allergy",
    "Thailand"
  ],
  "title": "Home Environments and Allergen Avoidance Practices in a Hot, Humid Climate",
  "type": "Dissertation"
}