{
  "contributor_author": "Bonsi, Richard",
  "contributor_committeechair": "Hammett, Alfred L. Tom",
  "contributor_committeemember": [
    "Littlefield, James E.",
    "Gnyawali, Devi R.",
    "Alwang, Jeffrey R.",
    "Smith, Robert M."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:12:29Z",
  "date_adate": "2009-06-12",
  "date_available": "2014-03-14T20:12:29Z",
  "date_issued": "2009-04-22",
  "date_rdate": "2012-04-30",
  "date_sdate": "2009-05-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study sought to determine the feasibility of introducing bamboo as a raw material to supplement the dwindling stock of traditional timber species for Ghanaâ  s forest products industry. First, the CEOs of the leading exporters of tertiary and panel products in the industry were canvassed to assess the current situation. Using descriptive statistics, it was discovered that the companies studied consume logs 12% in excess of the annual allowable timber harvest for the whole industry. There has been a drop in raw material availability and a 30% increase in raw material costs in the past five years. Harvest of lesser-used species in place of traditional species has also increased. Smaller companies have lost customers and are more restrained in raw material procurement.  <p> Next, barriers to the adoption of bamboo as a raw material perceived by the CEOs and institutional heads were identified. The major barriers perceived by CEOs include lack of information (e.g., on bamboo plantation management, products, processing, machines and markets) and lack of capital for investment. Institutions lack adequate information about bamboo technology and policy; they have research needs, (e.g., training, funding, laboratory equipment) and collaboration from all stakeholders. Institutions have done little to promote bamboo.  <p> Smaller companies were found to be more innovative in product development than larger companies. Companies located in the Ashanti region show higher propensity to engage in process innovation and product development. Companies appear to be receptive to initiatives that encourage bamboo adoption. In the current situation, few companies are willing to adopt bamboo but most companies are ready to adopt in the future if the existing barriers are mitigated.  <p> In the current situation, it is difficult for the industry to adopt bamboo until the government officially specifies roles for institutions and other stakeholders to make a compelling case for bamboo. Suggestions made for policymaking and change management include strategies for the creation of awareness, desire and knowledge for bamboo. Others include providing resources to enhance the ability of companies and institutions to adopt or promote bamboo, and reinforcing the change from timber to bamboo.",
  "description_provenance": [
    "Author Email: rbonsi@vt.edu",
    "Advisor Email: jalittle@vt.edu",
    "Advisor Email: devi@vt.edu",
    "Advisor Email: alwangj@vt.edu",
    "Advisor Email: rsmith4@vt.edu",
    "Advisor Email: himal@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:29Z (GMT). No. of bitstreams: 1 Richard_Bonsi_ETD_Revised.pdf: 3030024 bytes, checksum: 9e010d84e6fe793a6ab210d60beb8bfc (MD5)   Previous issue date: 2009-04-22"
  ],
  "handle": "27851",
  "identifier_other": "etd-05222009-093832",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05222009-093832/",
  "identifier_uri": "http://hdl.handle.net/10919/27851",
  "publisher": "Virginia Tech",
  "relation_haspart": "Richard_Bonsi_ETD_Revised.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Bamboo",
    "Supplement Timber",
    "Adoption",
    "Innovation and Change Management",
    "Policymaking",
    "Ghanaâ  s Forest Products Industry and Institutio"
  ],
  "title": "Adoption of Bamboo in Ghana's Forest Products Industry: An Investigation of the Principal Exporters and Institutions",
  "type": "Dissertation"
}