{
  "contributor_author": "Soucek, David John",
  "contributor_committeechair": "Cherry, Donald S.",
  "contributor_committeemember": [
    "Rimstidt, james Donald",
    "Daniels, Walter Lee",
    "Voshell, J. Reese Jr.",
    "Zipper, Carl E.",
    "Simmons, George M. Jr."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:12:29Z",
  "date_adate": "2001-05-29",
  "date_available": "2014-03-14T20:12:29Z",
  "date_issued": "2001-05-14",
  "date_rdate": "2002-05-29",
  "date_sdate": "2001-05-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Acid mine drainage (AMD), a result of oxidation of minerals containing reduced forms of sulfur (pyrites, sulfides) upon exposure to water and oxygen, is an environmental problem associated with abandoned mined lands (AML). Numerous studies have documented the impacts of AMD upon aquatic communities within acidified stream reaches; these impacts include reduced taxonomic richness and abundance, and/or a shift from pollution sensitive to pollution tolerant species.  This dissertation comprises a number of integrative assessments and experiments conducted to investigate the nature of AMD ecotoxicity in the upper Powell River watershed.  Emphasis was placed upon bioassessment methodologies and AMD impacts beyond the zone of pH depression.  Major findings and processes developed included: 1) an Ecotoxicological Rating (ETR) system was developed that integrates chemical, toxicological, and ecological data into a single value depicting the relative environmental integrity of a given station within a watershed; 2) water column chemistry rather than sediment toxicity was the major factor causing acute toxicity to aquatic biota in close proximity to AMD discharges; 3) solid ferric hydroxide can cause acute toxicity to standard test organisms in the absence of dissolved iron; 4) Asian clams (Corbicula fluminea) can be used to detect both acutely toxic AMD inputs and nutrient loading in low order streams, and clam responses of survival and growth reflect those of indigenous communities to the two contaminant types; 5) aluminum (Al) in transition from acidic to neutral pH waters can cause acute toxicity to aquatic invertebrates, and may be the cause of impaired benthic macroinvertebrate communities in neutral pH (>7.0) waters downstream of an acidic tributary; 6) in the larger river system (North Fork Powell and Powell mainstem), urban inputs appear to have a greater influence upon aquatic communities than metal loading from AMD impacted tributaries; 7) the use of individual level assessment endpoints, such as Asian clam growth in in situ toxicity tests, eliminates variables that may confound attribution of community level impacts to contaminants; and 8) the near elimination of predatory stoneflies (Plecoptera) downstream of the Stone/Straight Creek tributary to the North Fork Powell River was associated with water column Al concentrations.  This research was funded by the Virginia Department of Mines, Minerals, and Energy, Division of Mined Land Reclamation, and by the Powell River Project.",
  "description_provenance": [
    "Author Email: dsoucek@vt.edu",
    "Advisor Email: dcherry@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: wdaniels@vt.edu",
    "Advisor Email: rvoshell@vt.edu",
    "Advisor Email: czip@vt.edu",
    "Advisor Email: gesimmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:29Z (GMT). No. of bitstreams: 1 dsoucek_diss.pdf: 875309 bytes, checksum: 32644d6867f4d162b9713820debfd983 (MD5)   Previous issue date: 2001-05-14"
  ],
  "handle": "27852",
  "identifier_other": "etd-05232001-133500",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05232001-133500/",
  "identifier_uri": "http://hdl.handle.net/10919/27852",
  "publisher": "Virginia Tech",
  "relation_haspart": "dsoucek_diss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "benthic macroinvertebrates",
    "integrative bioassessment",
    "acid mine drainage"
  ],
  "title": "Integrative Bioassessment of Acid Mine Drainage Impacts on the Upper Powell River Watershed, Southwestern Virginia",
  "type": "Dissertation"
}