{
  "contributor_author": "Tcheslavskaia, Ksenia Sergeyevna",
  "contributor_committeechair": "Brewster, Carlyle C.",
  "contributor_committeecochair": "Sharov, Alexei A.",
  "contributor_committeemember": [
    "Bloomquist, Jeffrey R.",
    "Liebhold, Andrew M.",
    "Roberts, E. Anderson",
    "Salom, Scott M."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:12:29Z",
  "date_adate": "2003-06-27",
  "date_available": "2014-03-14T20:12:29Z",
  "date_issued": "2003-05-06",
  "date_rdate": "2004-06-27",
  "date_sdate": "2003-05-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Field studies were conducted to evaluate the effect of mating disruption on the mating success of the gypsy moth, Lymantria dispar (L), in low-density populations. The gypsy moth is an insect pest of hardwood forests in many regions of the world. The discovery of the sex pheromone disparlure (cis-7,8-epoxy-2-methyloctadecane) produced by females marked the start of a new era in the control and management of gypsy moth populations. Sex pheromones, like disparlure, have been used for detecting new populations, monitoring the spread of populations and for population control based on the disruption of mating communication. Although mating disruption has been used against populations of insect pests in agricultural and forest systems, considerable information about the use of this method for managing gypsy moths is still lacking. Studies, therefore, were designed and carried out specifically to improve current understanding of the mechanism of mating success, to evaluate existing techniques for mating disruption, and to develop methods that would improve the application of pheromone used for mating disruption so as to reduce the costs associated with the use of this management tactic. The first study was conducted to compare the mating success and mortality of gypsy moth females in low-density populations in Virginia and Wisconsin because of differences, which have been observed in the population dynamics and the impact of management strategies between these two states. The results suggested that the higher rate of population spread in Wisconsin might be due to the increased mating success of females compared with Virginia, which may be due in part to increased long-distance dispersal of males and increased longevity of females. The effect of artificial pheromone applied at various doses and formulations on mating success in low-density gypsy moth populations also was studied. Dose-response relationships were obtained for pheromone doses ranging from 0.15 to 75 g a.i./ha. The doses of 37.5 and 15 g a.i./ha of pheromone were shown to effectively disrupt mating and, therefore, have been recommended for operational use. The results also showed that the disruption of mating and attraction of males to pheromone-baited traps as a result of application of pheromone formulated in plastic flakes (Disrupt® II, Hercon Environmental, Emigsville, PA) was stronger and lasted longer than for the pheromone formulated as microcapsule (3M Canada Co., London, Ontario, Canada) and in liquid (Shin-Etsu Chemical Co. Ltd, Tokyo, Japan). Another study was carried out to improve the use and efficacy of the pheromone for mating disruption by reducing the amount of pheromone that was sprayed and the flight distance during aerial application. This study showed that in mountainous landscapes the effect of disparlure along the valley between mountains could be observed at a larger distance (633 ± 63 m) from the treated area than across the valley (104 ± 22m). In a relatively flat area, the effective distance for mating disruption was similar to the effective distance across the valley in a mountainous area (67 ± 17m). These dispersal characteristics of the pheromone provided further evidence that it could be used effectively in mating disruption treatments. Finally, a portable Electroantennogram (EAG) device was evaluated for its ability to detect disparlure sprayed for mating disruption in gypsy moth populations. The study found no relationship between the dose of artificial airborne pheromone and response of gypsy moth antenna as measured by the voltage ratio. The inability to detect differences between airborne pheromone concentrations in the plots treated for mating disruption might have been due to high variability among antennae and also by the inability of the EAG device to detect the low concentration of airborne pheromone used operationally for mating disruption. Further studies are required to improve the sensitivity of the portable EAG device before it can be recommended for use in the field.",
  "description_provenance": [
    "Author Email: ktchesla@vt.edu",
    "Advisor Email: carlyleb@vt.edu",
    "Advisor Email: sharoval@grc.nia.nih.gov",
    "Advisor Email: jbquist@vt.edu",
    "Advisor Email: aliebhold@fs.fed.us",
    "Advisor Email: roberts@vt.edu",
    "Advisor Email: salom@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:29Z (GMT). No. of bitstreams: 1 Ksenia_Tcheslavskaia.pdf: 1122442 bytes, checksum: 5e7f361fd8effa8509d1b6230db13cc7 (MD5)   Previous issue date: 2003-05-06"
  ],
  "handle": "27859",
  "identifier_other": "etd-05232003-131327",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05232003-131327/",
  "identifier_uri": "http://hdl.handle.net/10919/27859",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ksenia_Tcheslavskaia.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "pheromone concentration",
    "electroantennogram",
    "mating disruption",
    "gypsy moth"
  ],
  "title": "Mating Success in Low-Density Gypsy Moth Populations",
  "type": "Dissertation"
}