{
  "contributor_author": "Rodland, David Laurence",
  "contributor_committeechair": "Kowalewski, Michal",
  "contributor_committeemember": [
    "Read, James Fredrick",
    "Bambach, Richard K.",
    "Scheckler, Stephen E.",
    "Eriksson, Kenneth A."
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:12:29Z",
  "date_adate": "2003-06-17",
  "date_available": "2014-03-14T20:12:29Z",
  "date_issued": "2003-05-07",
  "date_rdate": "2004-06-17",
  "date_sdate": "2003-05-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An accurate understanding of global patterns through geologic time depends upon multi-scale analyses of spatial variation within narrow temporal intervals. This work investigates geochemical and paleoecological patterns in modern brachiopod faunas which may serve as analogues for ancient brachiopod assemblages. The paleoclimatic utility of delta18O in the phosphatic phase of lingulid brachiopod shells requires valve secretion in equilibrium with seawater, an assumption tested (and rejected) when analyzed at scales ranging from millimeters to kilometers. By contrast, biological encrustation of the brachiopod fauna of the Southeast Brazilian Bight shows strong sensitivity to microenvironmental conditions such as host identity, shape, and size, and may prove useful for studies of ancient planktonic productivity. Comparison of encrustation patterns on naturally occurring brachiopods and bivalves collected from the same sites, and occupying the same size range, demonstrates that the results of encrustation studies on modern bivalves cannot be directly applied to ancient brachiopods. However, careful comparisons may reveal patterns of epibiont selectivity and the impact of changes in the relative abundance of host shells through geologic time. Finally, neither epibiont abundance nor diversity increase with host age as indicated by dated brachiopod shells from the past 1000 years. These results suggest that the temporal resolution of epibiont assemblages matches their spatial resolution, and strengthen evidence for competition among encrusting taxa. By documenting geochemical and paleoecological variation within shells and across a continental shelf, this work demonstrates the importance of understanding spatial variation across all scales before interpreting trends through time.",
  "description_provenance": [
    "Author Email: drodland@vt.edu",
    "Advisor Email: jread@vt.edu",
    "Advisor Email: rbambach@oeb.harvard.edu",
    "Advisor Email: michalk@vt.edu",
    "Advisor Email: scheckler@vt.edu",
    "Advisor Email: kaeson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:29Z (GMT). No. of bitstreams: 1 RodlandETD.pdf: 1789446 bytes, checksum: aa812eed9a01fb395ccc9ddc4738d0f1 (MD5)   Previous issue date: 2003-05-07"
  ],
  "handle": "27858",
  "identifier_other": "etd-05232003-110659",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05232003-110659/",
  "identifier_uri": "http://hdl.handle.net/10919/27858",
  "publisher": "Virginia Tech",
  "relation_haspart": "RodlandETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "encrustation",
    "paleoecology",
    "brachiopod",
    "stable isotope",
    "Southeast Brazilian Bight",
    "geochemistry"
  ],
  "title": "Spatial variability in modern brachiopod assemblages: paleoecological and geochemical implications",
  "type": "Dissertation"
}