{
  "contributor_author": "Siudzinski, Robert Andrew",
  "contributor_committeecochair": [
    "Hicks, David",
    "Doolittle, Peter E."
  ],
  "contributor_committeemember": [
    "Uysal, Muzaffer S.",
    "Burton, John K."
  ],
  "contributor_department": "Learning Sciences and Technologies",
  "date_accessioned": "2014-03-14T20:12:30Z",
  "date_adate": "2007-06-20",
  "date_available": "2014-03-14T20:12:30Z",
  "date_issued": "2007-05-08",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-05-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This focused ethnography of Appalachian Trail (AT) long-distance hikers explored the situated and informal nature of individual knowledge construction as mediated through a community of practice. Unlike place-based or cyber-bound communities, the ever-changing membership and location dynamics of AT hikers offered a unique and researchable community for study. The complex and understudied sensemaking trajectories of individuals moving through this mobile community were investigated over three years through in-depth interviews and participant observations. Inductive analysis of expert and novice stories illuminated experiential patterns and collective traditions that comprise the AT learning culture. In contrast to traditional approaches to knowledge and skill acquisition, this study found socio-reflective exchanges, nested in hiking pods, to be critical sites for cognitive modeling and informal scaffolding between experts and novices. The situated encounters and developmental support of these nomadic pods were found to facilitate individualsâ   construction of community-based knowledge.",
  "description_provenance": [
    "Author Email: rsiudzin@vt.edu",
    "Advisor Email: hicks@vt.edu",
    "Advisor Email: samil@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:30Z (GMT). No. of bitstreams: 2 ETD.pdf: 2196950 bytes, checksum: 2c8060d2728a221e93a830c718fb4034 (MD5) IRB.pdf: 110427 bytes, checksum: bb8a084ed1e16b41ea683a92878fa2d3 (MD5)   Previous issue date: 2007-05-08"
  ],
  "handle": "27864",
  "identifier_other": "etd-05232007-163221",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05232007-163221/",
  "identifier_uri": "http://hdl.handle.net/10919/27864",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ETD.pdf",
    "IRB.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "situated learning",
    "reflective practices",
    "informal learning",
    "communities of practice",
    "knowledge construction",
    "hikers",
    "Appalachian Trail"
  ],
  "title": "Not All Who Wander are Lost: An Ethnographic Study of Individual Knowledge Construction within a Community of Practice",
  "type": "Dissertation"
}