{
  "contributor_author": "Stich, Bethany Marie",
  "contributor_committeechair": "Wamsley, Gary L.",
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "Morçöl, Göktuğ",
    "Pethtel, Ray D.",
    "Wolf, James F."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:12:30Z",
  "date_adate": "2006-07-11",
  "date_available": "2014-03-14T20:12:30Z",
  "date_issued": "2006-05-05",
  "date_rdate": "2006-07-11",
  "date_sdate": "2006-05-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT  <p>  This research is an evaluation of the addition of a citizen involvement process  that has come to be known as â  visioningâ   or â  community visioningâ   to the traditional  process of developing a stateâ  s transportation plan, a process which has typically  been very much an in-government and esoteric province of professionals in  transportation planning. The research specifically focuses on the Commonwealth of  Virginia and its addition of three citizen participation components the Commonwealth  labeled â  community visioningâ   to the traditional transportation planning process. The  research examines the three components of â  community visioningâ   with regard to:  (1) their impact on the stateâ  s transportation plan (VTrans2025); (2) the degree to  which they met the expectations of the regulations and best practices  requirements of federal oversight; (3) the degree to which they met the expectations  of the advocates of visioning and of more â  democratic participationâ   in pubic  administrative and policy processes; and (4) the degree to which they could affect  the final outcome of transportation policy.<p>  Visioning is a relatively new approach to citizen involvement in the planning  process. It places the citizen involvement at the beginning of the process instead of  the end. Visioning asks citizens key questions about what they envision as a positive  future for their community. The purpose or goal of this new visioning is to have the  final plans reflect the vision drawn from the citizens and public officials and reached  through consensus.<p>  This dissertation determined that Virginia put forth a good faith effort to  involve citizens of the Commonwealth. Collectively, the citizen involvement activities  in VAâ  s visioning process were reasonable and meaningful. Additionally, Virginiaâ  s  vision statement was heavily influenced by the citizen participation activities.  However, there are three aspects of Virginiaâ  s vision that are troubling from an  implementation standpoint. In short, this dissertation found that the vision is what the  people want, but the comprehensive plan does not tell the citizens how the  Commonwealth intends on achieving that vision.",
  "description_provenance": [
    "Author Email: bstich@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: gxm27@psu.edu",
    "Advisor Email: rpethtel@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:30Z (GMT). No. of bitstreams: 1  01dissertation.pdf: 15445119 bytes, checksum: 3a99109b17113f55ffebb5f136cefa86 (MD5)    Previous issue date: 2006-05-05"
  ],
  "handle": "27862",
  "identifier_other": "etd-05232006-130108",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05232006-130108/",
  "identifier_uri": "http://hdl.handle.net/10919/27862",
  "publisher": "Virginia Tech",
  "relation_haspart": "01dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Community Visioning",
    "Transportation Planning",
    "Participatory Democracy"
  ],
  "title": "Community Visioning in Long-Range Transportation Planning: A Case Study of Virginia",
  "type": "Dissertation"
}