{
  "contributor_author": "Rasamoelina, Maminiaina  Solonirina",
  "contributor_committeecochair": [
    "Hull, Robert Bruce IV",
    "Johnson, James E."
  ],
  "contributor_committeemember": [
    "McMullin, Steve L.",
    "Munsell, John F.",
    "Hammett, Alfred L. Tom"
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:12:30Z",
  "date_adate": "2008-07-01",
  "date_available": "2014-03-14T20:12:30Z",
  "date_issued": "2008-05-09",
  "date_rdate": "2008-07-01",
  "date_sdate": "2008-05-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The concept of Sustainable Forest Management (SFM) has been promoted in the past few decades all over the world. Non-industrial private forest (NIPF) owners play an important role in that aspect in the U.S. because of their number (about 16 millions), the size of forest land under their control (about half of all forest land in the continental US), and the dynamism of their population (increasing number of new owners). This study sought to better understand how NIPF owners come to a decision for adoption (or non-adoption) of SFM practices. We developed a theoretical model combining four theories (the Value-Belief-Norm theory, the Theory of Planned Behavior, the Elaboration Likelihood Model, and the Innovation-Diffusion Process) to explain NIPFâ  s decision making. Using multivariate analyses, we determined which elements of the developed theoretical model were significant in explaining adoption of eight groups of practices. Overall, some of the most significant predictors of adoption we identified were technical assistance, motivations for owning land and the use of a written management plan. Particular attention was also directed toward the eventual relationship between education and adoption of SFM practices and it was found that NIPF owners who attended educational programs tended to be likely adopters compared to those who did not attend any educational program. Since SFM was not limited to the US, we also analyzed the concept of SFM with the same goals as in the US, but under a completely different context (socio-cultural, economic and ecologic) in Africa, through the community-based natural resource management (CBNRM) system. We used four case studies and focused on criteria such as participation, equity (both procedural and distributive, power devolution, trust, etc) to analyze how CBNRM works on the field, what lessons to take from the cases to better ensure the goal of sustainability of the resources.",
  "description_provenance": [
    "Author Email: mamiaina@vt.edu",
    "Advisor Email: hullrb@vt.edu",
    "Advisor Email: jim.johnson@oregonstate.edu",
    "Advisor Email: smcmulli@vt.edu",
    "Advisor Email: jfmunsel@vt.edu",
    "Advisor Email: himal@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:30Z (GMT). No. of bitstreams: 3 Mami_dissertation_revised_07_01.pdf: 1448957 bytes, checksum: a6ec62a317c283035f0dc42c2dab5fec (MD5) Mami_Certificate.pdf: 581512 bytes, checksum: 2937ce930940f46bb2f14cb168afe523 (MD5) Mami_IRB_s06-739.pdf: 151685 bytes, checksum: 3d1a3082ef1766d8c9bf45186f337071 (MD5)   Previous issue date: 2008-05-09"
  ],
  "handle": "27865",
  "identifier_other": "etd-05232008-135626",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05232008-135626/",
  "identifier_uri": "http://hdl.handle.net/10919/27865",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Mami_dissertation_revised_07_01.pdf",
    "Mami_Certificate.pdf",
    "Mami_IRB_s06-739.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Community-based natural resources management (CBNR",
    "Educational program",
    "Financial assistance",
    "Decision-making",
    "Technical assistance",
    "Non-Industrial Private Forest (NIPF)",
    "Behavioral change",
    "Sustainable forest management (SFM)",
    "Adoption",
    "Elaboration likelihood model",
    "Value-belief norm theory",
    "Theory of planned behavior",
    "Innovation-diffusion process"
  ],
  "title": "Adoption of sustainable forestry practices by Non-Industrial Private Forest owners in Virginia.",
  "type": "Dissertation"
}