{
  "contributor_author": "Bullard III, Thomas J",
  "contributor_committeechair": "Tauber, Uwe C.",
  "contributor_committeemember": [
    "Schmittmann, Beate",
    "Mizutani, Tetsuro",
    "Ritter, James William",
    "Zallen, Richard H."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:12:30Z",
  "date_adate": "2005-06-15",
  "date_available": "2014-03-14T20:12:30Z",
  "date_issued": "2005-05-11",
  "date_rdate": "2005-06-15",
  "date_sdate": "2005-05-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Vortex motion plays an important role in the transport properties of high Tc superconductors.  In the presence of a sufficiently large applied current vortices will drift creating an ohmic resistance in the material, while defects in the material will tend to inhibit their motion.  Some types of material defects are more effective at pinning then others, and therefore, above the depinning threshold, may effect the motion of vortices differently.  To investigate their motion, voltage noise generated by moving vortices is studied for different material defect types using a nonequilibrium Metropolis Monte Carlo simulation.  The current-voltage (I-V) characteristics obtained from the simulation for various vortex densities and defect types show features similar to those obtained in experiments. The power spectra generated for point and columnar disorder are then compared for increasing vortex density.  Above, but near the depinning threshold, broadband noise associated with plastic vortex flow is observed for columnar defects at low vortex densities, while for higher densities a triangular lattice is obtained along with a washboard signal and higher harmonics.  For point defects a washboard signal with higher harmonics is always observed in the region investigated.  These results suggest that power spectra for both point and columnar defects are qualitatively similar for higher vortex densities (larger magnetic fields). A second comparison is made by observing, on the one hand,  the power spectra for finite linear defects increasing in length and, on the other hand, increasing point defect strength.  Power spectra and structure factor results are very similar for these results as well.  Both show a trend from an ordered to a disordered system with a washboard peak first increasing and then decreasing in power with increasing pinning efficiency.  For both defect types the power spectrum is eventually dominated by broadband noise indicating the approach to the pinned glassy phases.",
  "description_provenance": [
    "Author Email: tbullard@vt.edu",
    "Advisor Email: tauber@vt.edu",
    "Advisor Email: schmittm@vt.edu",
    "Advisor Email: mizutani@vt.edu",
    "Advisor Email: aritter@vt.edu",
    "Advisor Email: rzallen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:30Z (GMT). No. of bitstreams: 1 thesis.pdf: 5086899 bytes, checksum: 8dbdd5781b41f35b9ae9acd93a13507b (MD5)   Previous issue date: 2005-05-11"
  ],
  "handle": "27861",
  "identifier_other": "etd-05232005-122458",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05232005-122458/",
  "identifier_uri": "http://hdl.handle.net/10919/27861",
  "publisher": "Virginia Tech",
  "relation_haspart": "thesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "nonequilibrium Monte Carlo",
    "superconductor",
    "vortex",
    "washboard noise"
  ],
  "title": "A Study of Narrowband Noise Characteristics Associated with Vortex Motion in High Temperature Superconductors",
  "type": "Dissertation"
}