{
  "contributor_author": "Lovern, Matthew B.",
  "contributor_committeechair": "Jenssen, Thomas A.",
  "contributor_committeemember": [
    "McNabb, F. M. Anne",
    "Walters, Jeffrey R.",
    "Andrews, Robin M.",
    "Burghardt, Gordon M."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:12:30Z",
  "date_adate": "2000-05-25",
  "date_available": "2014-03-14T20:12:30Z",
  "date_issued": "2000-04-25",
  "date_rdate": "2001-05-25",
  "date_sdate": "2000-05-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Adult green anoles, Anolis carolinensis, exhibit numerous sex differences resulting from divergent strategies for maximizing reproductive success.  I focused on the ontogeny of sex differences in behavior in juveniles, in relation to adult sex differences, by documenting the behavior of free-ranging juveniles, examining the structure and use of headbobbing displays, and determining the role of the androgen testosterone (T) in producing behavioral sex differences.  Field observations indicated that juvenile males eat and forage actively more often than juvenile females.  This divergent feeding behavior may result from sexual selection, given that body size is a major factor in determining the reproductive success of males.  Analyses of headbobbing displays, used by adults in aggressive and sexual interactions, revealed that juvenile males and females each give the same three A, B, and C display types described for adults.  However, there may be a maturational component to display structure, as juvenile displays differ from those of adults in within-display temporal structure, and are not as stereotyped.  Concerning display use, social context affects neither the types of display interactions observed nor the rates of displays and related behaviors.  However, size affects nearly every aspect of display behavior.  Both juvenile males and females show increased display rates and probabilities of expressing display-related behaviors with increasing body size, although in the largest juveniles, male display rates become higher than those of females.  These results, like those from analyses of display structure, suggest a maturational component to display use, perhaps mediated by changes in the underlying motivational states of juveniles.  Consistent with the divergence in display rates in large juveniles, males of approximately 30 d of age and older have higher plasma T concentrations than females.  Furthermore, juvenile males and females that have been given T implants each respond with increased behavior levels, approaching those of breeding adult males.  These analyses indicate that sexual dimorphisms in behavior in adults likely arise through underlying physiological differences between males and females that mediate the expression of behavior, rather than through fundamental sex differences in the ability to perform these behaviors.",
  "description_provenance": [
    "Author Email: mlovern@vt.edu",
    "Advisor Email: happy@vt.edu",
    "Advisor Email: tjenssen@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: randrews@vt.edu",
    "Advisor Email: gburghar@utk.edu",
    "Made available in DSpace on 2014-03-14T20:12:30Z (GMT). No. of bitstreams: 1 lovediss.pdf: 312412 bytes, checksum: 3cd8b7970776edd90fad62338ae365b0 (MD5)   Previous issue date: 2000-04-25"
  ],
  "handle": "27866",
  "identifier_other": "etd-05242000-18450041",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05242000-18450041/",
  "identifier_uri": "http://hdl.handle.net/10919/27866",
  "publisher": "Virginia Tech",
  "relation_haspart": "lovediss.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "ontogeny",
    "sexual dimorphism",
    "lizard",
    "sex steroids",
    "behavior",
    "sexual selection"
  ],
  "title": "Social and Hormonal Effects on the Ontogeny of Sex Differences in Behavior in the Lizard, Anolis carolinensis",
  "type": "Dissertation"
}