{
  "contributor_author": "Kim, Youngjoo",
  "contributor_committeecochair": [
    "Beamish, Julia O.",
    "Goss, Rosemary Carucci"
  ],
  "contributor_committeemember": [
    "Uttech, Melanie R.",
    "Teaster, Pamela B.",
    "Emmel, JoAnn"
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2014-03-14T20:12:31Z",
  "date_adate": "2002-06-05",
  "date_available": "2014-03-14T20:12:31Z",
  "date_issued": "2002-04-26",
  "date_rdate": "2003-06-05",
  "date_sdate": "2002-05-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Older people are as diverse a group as they were as younger people. Home environments should reflect these diverse individuals' varying interests, preferences, and needs. In spite of efforts to remain independent and at home, some elderly people have to leave conventional housing and move into long-term care facilities because of factors such as mental or physical health problems or the loss of family members. Most elderly people who move into these facilities do not feel \"at home\" in their new living arrangements. Assisted living facilities (ALFs) have been developed as a response to these issues. The major goal of assisted living is to create a supportive social setting that elderly residents can call home. Although assisted living is the fastest growing long-term care alternative, it still needs to continually change in response to the needs of older residents and the desires and interests of family members.  The purpose of this study was to examine the features that make residents feel \"at home\" in ALFs in Southwest Virginia and to suggest further policy and design guidelines for better quality of ALFs as a \"home.\" For this purpose, residents' needs, experiences, and opinions of the physical environment, the social environment, and the organizational environments such as policies and programs of ALFs were identified.   As a multi-site case study, I studied five ALFs in Southwest Virginia and did a cross-case analysis. In addition to face-to-face interviews with 25 residents and five administrators of five ALFs, I also conducted observations and recorded my feelings in a personal journal with document review. To analyze the data gathered in this study, I used the constant comparative method of data analysis. The respondents' age range was between 64 and 95 and the average age was 82. There were 6 males and 19 females among the respondents and most of them were widowed. They came from a wide geographic area, and most of them have lived in single-family homes for a long time. Many had children or family members nearby.     Overall, the five sites selected presented homelike features showing the philosophy of assisted living which combines housing and services. Each facility was designed to be a single-family house or multi-family dwelling in outside appearance. However, the older the structure, the fewer homelike features were provided.      As a whole, residents felt isolation and loneliness and they did not have active interaction with other residents because of diverse background among the residents. During meals, people had active interaction with one or two residents. However, all of them had close relationships with the staff. The staff's attitude and behavior seemed to influence greatly the residents' feeling \"at home.\" Friends and family members also provided an important role for the residents to adjust to their new environment. Despite the provision of diverse activities by the facilities, many residents did not participate in the programs. Among the services provided, there were only a few complaints about food and mealtimes. Most of the residents agreed that the rules and regulations were fair; however, one person disagreed with the smoking rules.   For the meaning of \"home,\" many residents talked about love, fellowship, privilege, stability, and security. The administrators tried to make the residents feel \"at home;\" however, they mentioned the limitation of providing a real \"home\" for the residents due to the residents' diversity. Some categories which could contribute to the perception of ALFs as a \"home\" were classified by the researcher: safety and security, services and care, autonomy/privacy, independence, social life/friendship, family support, daily routine, personalization, physical environment, and management.            Regardless of the type of facilities and the residents' characteristics, most of the respondents were satisfied with their current dwelling. In spite of high satisfaction with the facility, many people did not think of their current dwelling as a real \"home.\" As the biggest difference between living in their own homes and living in the ALF, people pointed out a lack of independence, freedom, and autonomy. Moreover, they talked about the loneliness stemming from living with strangers who are not their family or friends. Residents of ALFs may have reordered their priorities in their current life situation so that safety, security, and care were more important to them than feeling \"at home.\" Among the four factors --personal, physical, social, and organizational-- that affect the residents' perception of ALFs as a \"home,\" many emphasized the importance of social factors such as relationships with the staff and residents, and social support from their family or friends.",
  "description_provenance": [
    "Author Email: youngkim@vt.edu",
    "Advisor Email: muttech@vt.edu",
    "Advisor Email: pteaster@uky.edu",
    "Advisor Email: jemmel@vt.edu",
    "Advisor Email: jbeamish@vt.edu",
    "Advisor Email: rgoss@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:31Z (GMT). No. of bitstreams: 12 Chapter5.pdf: 216638 bytes, checksum: 146f688210c3b7fe0dc3be60e2d0e8f7 (MD5) Chapter1.pdf: 138916 bytes, checksum: 5fedf1e4a4b4aa5d113c32958d952558 (MD5) Abstract.pdf: 81909 bytes, checksum: 6fd9af60dd1f51cc3021c43d025a413f (MD5) Chapter3.pdf: 177964 bytes, checksum: 9fdadd01d7b7cfe0c4bdd7ec6db4e7aa (MD5) Chapter41.pdf: 95354 bytes, checksum: cfadef2c6a8c3415cd27d07c94cb6792 (MD5) Chapter7.pdf: 123397 bytes, checksum: 0e4ed61f1f95e323b6297e5d5f2c2ad9 (MD5) Chapter6.pdf: 166495 bytes, checksum: a21b9fadfc1551c8c2a2e16a1def0fcb (MD5) Chapter4.pdf: 1782277 bytes, checksum: c480bbf380256a7d8525b51820a508f8 (MD5) References.pdf: 452416 bytes, checksum: d7b1c81fe41ac1ce627fbdfa2e540057 (MD5) Contents.pdf: 96041 bytes, checksum: 440f8342971007ed3b30caf3d31ff8dd (MD5) Chapter42.pdf: 120089 bytes, checksum: 26bed242252062a794d695aca9bb7aef (MD5) Chapter2.pdf: 225034 bytes, checksum: e13782a11cedd02687c2631682276862 (MD5)   Previous issue date: 2002-04-26"
  ],
  "handle": "27868",
  "identifier_other": "etd-05242002-000656",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05242002-000656/",
  "identifier_uri": "http://hdl.handle.net/10919/27868",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter5.pdf",
    "Chapter1.pdf",
    "Abstract.pdf",
    "Chapter3.pdf",
    "Chapter41.pdf",
    "Chapter7.pdf",
    "Chapter6.pdf",
    "Chapter4.pdf",
    "References.pdf",
    "Contents.pdf",
    "Chapter42.pdf",
    "Chapter2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Assisted Living Facility (ALF)",
    "Physical Environment",
    "Organizational Environment",
    "Homelike",
    "Home",
    "The Elderly",
    "Social Environment"
  ],
  "title": "Assisted Living Facility as a Home: Cases in Southwest Virginia",
  "type": "Dissertation"
}