{
  "contributor_author": "Tsai, Pei-Fang",
  "contributor_committeechair": "Sarin, Subhash C.",
  "contributor_committeemember": [
    "Sherali, Hanif D.",
    "Bish, Ebru K.",
    "Cook, Deborah F."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:12:30Z",
  "date_adate": "2006-06-15",
  "date_available": "2014-03-14T20:12:30Z",
  "date_issued": "2006-05-09",
  "date_rdate": "2008-06-15",
  "date_sdate": "2006-05-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is devoted to the development of new flow-based formulations for the asymmetric traveling salesman problem (ATSP) and to the demonstration of their applicability in effectively solving some scheduling problems.  The ATSP is commonly encountered in the areas of manufacturing planning and scheduling, and transportation logistics.  The integration of decisions pertaining to production and shipping, in the supply chain context, has given rise to an additional and practical relevance to this problem especially in situations involving sequence-dependent setups and routing of vehicles.  Our objective is to develop new ATSP formulations so that algorithms can be built by taking advantage of their relaxations (of integer variables, thereby, resulting in linear programs) to effectively solve large-size problems. </p> In view of our objective, it is essential to have a formulation that is amenable to the development of an effective solution procedure for the underlying problem.  One characteristic of a formulation that is helpful in this regard is its tightness.  The tightness of a formulation usually refers to the quality of its approximation to the convex hull of integer feasible solutions.  Another characteristic is its compactness.  The compactness of a formulation is measured by the number of variables and constraints that are used to formulate a given problem.  Our formulations for the ATSP and the scheduling problems that we address are both tight and compact. </p> We present a new class of polynomial length formulations for the asymmetric traveling salesman problem (ATSP) by lifting an ordered path-based model using logical restrictions in concert with the Reformulation-Linearization Technique (RLT).  We show that a relaxed version of this formulation is equivalent to a flow-based ATSP model, which, in turn, is tighter than the formulation based on the exponential number of Dantzig-Fulkerson-Johnson (DFJ) subtour elimination constraints.  The proposed lifting idea is applied to derive a variety of new formulations for the ATSP, and a detailed analysis of these formulations is carried out to show that some of these formulations are the tightest among those presented in the literature.  Computational results are presented to exhibit the relative tightness of our formulations and the efficacy of the proposed lifting process. </p> While the computational results demonstrate the efficacy of employing the proposed theoretical RLT and logical lifting ideas, yet it remains of practical interest to take due advantage of the tightest formulations.  The key requirement to accomplish this is the ability to solve the underlying LP relaxations more effectively.  One approach, to that end, is to solve these LP relaxations to (near-) optimality by using deflected subgradient methods on Lagrangian dual formulations.  We solve the LP relaxation of our tightest formulation, ATSP6, to (near-) optimality by using a deflected subgradient algorithm with average direction strategy (SA_ADS) (see Sherali and Ulular [69]).  We also use two nondifferentiable optimization (NDO) methods, namely, the variable target value method (VTVM) presented by Sherali et al. [66] and the trust region target value method (TRTV) presented by Lim and Sherali [46], on the Lagrangian dual formulation of ATSP6.  The preliminary results show that the near-optimal values obtained by the VTVM on solving the problem in the canonical format are the closest to the target optimal values.  Another approach that we use is to derive a set of strong valid inequalities based on our tighter formulations through a suitable surrogation process for inclusion within the more compact manageable formulations.  Our computational results show that, when the dual optimal solution is available, the associated strong valid inequalities generated from our procedure can successfully lift the LP relaxation of a less tight formulation, such as ATSP2R¯, to be as tight as the tightest formulation, such as ATSP6. </p> We extend our new formulations to include precedence constraints in order to enforce a partial order on the sequence of cities to be visited in a tour.  The presence of precedence constraints within the ATSP framework is encountered quite often in practice.  Examples include: disassembly optimization (see Sarin et al. [62]), and scheduling of wafers/ ICs on automated testing equipments in a semiconductor manufacturing facility (see Chen and Hsia [17]); among others.  Our flow-based ATSP formulation can very conveniently capture these precedence constraints.  We also present computational results to depict the tightness of our precedence-constrained asymmetric traveling salesman problem (PCATSP) formulations. </p> We, then, apply our formulations to the hot strip rolling scheduling problem, which involves the processing of hot steel slabs, in a pre-specified precedence order, on one or more rollers.  The single-roller hot strip rolling scheduling problem can be directly formulated as a PCATSP.  We also consider the multiple-roller hot strip rolling scheduling problem.  This gives rise to the multiple-asymmetric traveling salesman problem (mATSP).  Not many formulations have been presented in the literature for the mATSP, and there are none for the mATSP formulations involving a precedence order among the cities to be visited by the salesmen, which is the case for the multiple-roller hot strip rolling scheduling problem.  To begin with, we develop new formulations for the mATSP and show the validity of our formulations, and present computational results to depict their tightness.  Then, we extend these mATSP formulations to include a pre-specified, special type of precedence order in which to process the slabs, and designate the resulting formulations as the restricted precedence-constrained multiple-asymmetric traveling salesman problem (rPCmATSP) formulations.  We directly formulate the multiple-roller hot strip rolling scheduling problem as a rPCmATSP.  Furthermore, we consider the hot strip rolling scheduling problem with slab selection in which not all slabs need to be processed.  We model the single-roller hot strip rolling scheduling problem with slab selection as a multiple-asymmetric traveling salesman problem with exactly two traveling salesmen.  Similarly, the multiple-roller hot strip rolling scheduling problem with slab selection is modeled as a multiple-asymmetric traveling salesman problem with (m+1) traveling salesmen.  </p> A series of computational experiments are conducted to exhibit the effectiveness of our formulations for the solution of hot strip rolling scheduling problems.  Furthermore, we develop two mixed-integer programming algorithms to solve our formulations.  These are based on Benders&#900; decomposition [13] and are designated Benders&#900; decomposition and Modified Benders&#900; methods.  In concert with a special type of precedence order presented in the hot strip rolling scheduling problems, we further introduce an adjustable density ratio of the associated precedence network and we use randomly generated test problems to study the effect of various density ratios in solving these scheduling problems.  Our experimentation shows the efficacy of our methods over CPLEX. </p> Finally, we present a compact formulation for the job shop scheduling problem, designated as JSCD (job shop conjunctive-disjunctive) formulation, which is an extension of our ATSP formulations.  We use two test problems given in Muth and Thompson [53] to demonstrate the optimal schedule and the lower bound values obtained by solving the LP relaxations of our formulations.  However, we observe that the lower bound values obtained by solving the LP relaxations of all variations of our JSCD formulation equal to the maximum total processing time among the jobs in the problem.",
  "description_provenance": [
    "Author Email: p.jennifer.tsai@gmail.com",
    "Advisor Email: sarins@vt.edu",
    "Advisor Email: hanifs@vt.edu",
    "Advisor Email: ebru@vt.edu",
    "Advisor Email: dcook@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:30Z (GMT). No. of bitstreams: 1 dissertation_peifang_tsai.pdf: 2287674 bytes, checksum: 02c9d081e349efceef08ca7e8c29bbc2 (MD5)   Previous issue date: 2006-05-09"
  ],
  "handle": "27863",
  "identifier_other": "etd-05232006-195259",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05232006-195259/",
  "identifier_uri": "http://hdl.handle.net/10919/27863",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation_peifang_tsai.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Reformulation-Linearization Technique",
    "Multiple-Asymmetric Traveling Salesman Problem",
    "Precedence Constraints",
    "Asymmetric Traveling Salesman Problem",
    "Hot Strip Rolling Scheduling Problem"
  ],
  "title": "Tight Flow-Based Formulations for the Asymmetric Traveling Salesman Problem and Their Applications to some Scheduling Problems",
  "type": "Dissertation"
}