{
  "contributor_author": "Chan, Matthew D.",
  "contributor_committeechair": "Orth, Donald J.",
  "contributor_committeemember": [
    "Angermeier, Paul L.",
    "Diplas, Panayiotis",
    "Ney, John J.",
    "Smith, Eric P."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:12:31Z",
  "date_adate": "2001-05-25",
  "date_available": "2014-03-14T20:12:31Z",
  "date_issued": "2001-03-24",
  "date_rdate": "2002-05-25",
  "date_sdate": "2001-05-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research tested the ability of fish morphology to predict membership of fishes in habitat guilds, their swimming performance, and habitat preference.  Further, it considered methods for choosing a surrogate species to identify habitat of target species.  Morphological discriminant functions were developed using morphological traits of fishes from one river to identify membership in two habitat guild systems (mesohabitat and microhabitat).  Functions were then used to test factors influencing classification success of holdout tests and validated using fishes of a second river.  Morphology was only partly successful (50%) at predicting membership in habitat guilds.  Morphology identified species by shape, i.e., classifying test species into guilds with members of their genus, but not habitat use, because morphology and habitat were not strongly linked through function.  By improving guild definition, relationships between morphology and habitat (Froude number) were identified for all fish groups examined (darters, benthic minnows, pelagic minnows, and suckers).  Relationships were not transferable among groups.  Further, morphology of eight minnows was linked to swimming performance, a key task for using habitat, in lab measurements of critical swimming speeds.  In turn, swimming performance was related to habitat (Froude number).   Morphology will be most successful at predicting habitat use of fishes when (1) more, discrete guilds are used, (2) guilds are identified within families, (3) variation in lifestyles (benthic vs. pelagic) is considered, and (4) key tasks related to using habitat are strongly associated with morphology.  Finally, I examined a phylogenetic approach to identifying useable habitat.  Closely related surrogate species were not more accurate in identifying habitat of target species than surrogates chosen by other methods.  When a target species used only one mesohabitat, the highest overlap in habitat use occurred with other fishes of the same family using that mesohabitat (within a physiographic province).  For target species using several mesohabitat types, surrogates from the next highest taxonomic unit, e.g., genus or subgenus, provided the most accurate information.  Ecomorphology offers a mechanistic and defensible method for identifying habitat preferences of fishes and should be more widely considered as a tool for establishing habitat relationships of stream fishes.",
  "description_provenance": [
    "Author Email: machan@vt.edu",
    "Advisor Email: biota@vt.edu",
    "Advisor Email: pdiplas@vt.edu",
    "Advisor Email: jney@vt.edu",
    "Advisor Email: dorth@vt.edu",
    "Advisor Email: epsmith@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:31Z (GMT). No. of bitstreams: 1 mattchan.pdf: 1355509 bytes, checksum: d7ef00fd149d58b83f298ccfb9dce681 (MD5)   Previous issue date: 2001-03-24"
  ],
  "handle": "27867",
  "identifier_other": "etd-05242001-183326",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05242001-183326/",
  "identifier_uri": "http://hdl.handle.net/10919/27867",
  "publisher": "Virginia Tech",
  "relation_haspart": "mattchan.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "swimming performance",
    "phylogenetic",
    "surrogate species",
    "instream flow",
    "morphometrics",
    "habitat use",
    "discriminant analysis",
    "habitat guilds",
    "ecomorphology",
    "stream fishes"
  ],
  "title": "Fish ecomorphology: predicting habitat preferences of stream fishes from their body shape.",
  "type": "Dissertation"
}