{
  "contributor_author": "Xu, Zhaojin",
  "contributor_committeechair": "Singal, Vijay",
  "contributor_committeemember": [
    "Keown, Arthur J.",
    "Ovtchinnikov, Alexei",
    "Cliff, Michael T.",
    "Kadlec, Gregory B."
  ],
  "contributor_department": "Finance, Insurance, and Business Law",
  "date_accessioned": "2014-03-14T20:12:33Z",
  "date_adate": "2007-06-07",
  "date_available": "2014-03-14T20:12:33Z",
  "date_issued": "2007-05-10",
  "date_rdate": "2007-06-07",
  "date_sdate": "2007-05-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this dissertation, we examine whether the disposition effect, the tendency to sell winners and hold losers, exists among U.S. equity mutual funds and how the disposition effect influences fund performance and particularly flows.  We find that a significant fraction (32%) of all funds exhibit some degree of disposition behavior.  These funds underperform funds that are not disposition prone by 4-6% per year.  Moreover, we find that the disposition effect has a significant impact on future fund flows. Without controlling for performance, disposition-prone funds experience 2-3% less flows each quarter than other funds. The difference in flows is probably due to poor performance of such funds. However, even after controlling for performance and other factors that potentially influence flows, funds with a high disposition effect experience 0.7-2% less flows than funds without such behavior.  Past research has found that funds with low tax overhang garner larger inflows.  Though disposition-prone funds are likely to have a lower tax overhang because they sell their winners quickly, we find that fund flows to disposition-prone funds are smaller than flows to non-disposition oriented funds after controlling for tax overhang.  These results suggest that performance and tax efficiency as well as tax overhang are all important to mutual fund investors.",
  "description_provenance": [
    "Author Email: lilyxu@vt.edu",
    "Advisor Email: emily@vt.edu",
    "Advisor Email: ovtchinnikov@vt.edu",
    "Advisor Email: mcliff@vt.edu",
    "Advisor Email: kadlec@vt.edu",
    "Advisor Email: singal@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:33Z (GMT). No. of bitstreams: 1 ETD_XU.pdf: 265080 bytes, checksum: 342c78ec088d09bff63fa1dfdb55e31c (MD5)   Previous issue date: 2007-05-10"
  ],
  "handle": "27878",
  "identifier_other": "etd-05242007-144846",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05242007-144846/",
  "identifier_uri": "http://hdl.handle.net/10919/27878",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD_XU.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Fund Flows",
    "Mutual Funds",
    "Disposition Effect",
    "Capital Gains",
    "Tax Overhang",
    "Fund Performance"
  ],
  "title": "Selling Winners, Holding Losers: Effect on Mutual Fund Performance and Flows",
  "type": "Dissertation"
}