{
  "contributor_author": "Islam, Saiyid S",
  "contributor_committeechair": "Mozumdar, Abon",
  "contributor_committeemember": [
    "Chance, Donald M.",
    "Kumar, Raman",
    "McGuirk, Anya M.",
    "Singal, Vijay"
  ],
  "contributor_department": "Finance, Insurance, and Business Law",
  "date_accessioned": "2014-03-14T20:12:32Z",
  "date_adate": "2002-06-13",
  "date_available": "2014-03-14T20:12:32Z",
  "date_issued": "2002-05-17",
  "date_rdate": "2003-06-13",
  "date_sdate": "2002-05-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Several research studies in finance have investigated the effect of financial factors on investment decisions of firms. More recently, researchers have extended conventional models of firm-investment by incorporating a role for financing constraints in determining the firm's investment decision. Empirical work points to overwhelming evidence that in the presence of market imperfections, firm investments become sensitive to the availability of internal cash flows. However, the evidence regarding the patterns of these observed investment-cash flow sensitivities has been ambiguous.  In this study we examine the impact of financial development on the sensitivity of firm-level investment to internal cash flow. Using international data from 31 countries over the 1987-1997 period, we find that after controlling for growth opportunities (as measured by Tobin's Q), investment is more sensitive to cash flow for firms in less financially developed countries, indicating higher costs of information problems and lower availability of external capital in such countries. The results are robust to six different measures of financial development.   We also find a strong negative relationship between investment cash-flow sensitivity and size (as measured by log of total assets) across countries, though our results are mixed when we investigate this size effect within 6 OECD countries. Overall, these findings are consistent with the notion that smaller firms face greater information costs and are therefore more dependent on internally generated capital for making their investment outlays.  Furthermore, we establish a direct connection between the investment cash flow sensitivity studies and a parallel literature on the allocational efficiency of capital markets. We also document important distortionary impacts of using log specifications in the empirical estimation, and of including negative cash flow observations in the sample, which explain the qualitative difference between our results and those of some earlier studies.   Finally, our results have important policy implications. Firms that are based in countries with poor standards of financial accounting and information disclosure are found to face greater challenges in accessing external capital markets. These firms are likely to experience high under-investment costs that, at a macro level, would translate into slower economic growth for the country.",
  "description_provenance": [
    "Author Email: saislam@vt.edu",
    "Advisor Email: abon@vt.edu",
    "Advisor Email: dmc@vt.edu",
    "Advisor Email: rkumar@vt.edu",
    "Advisor Email: mcguirk@vt.edu",
    "Advisor Email: singal@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:32Z (GMT). No. of bitstreams: 1 Etd_Saiyid_Islam.pdf: 670036 bytes, checksum: 5a1dc0065e066b29811913f1c22b72b4 (MD5)   Previous issue date: 2002-05-17"
  ],
  "handle": "27872",
  "identifier_other": "etd-05242002-143716",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05242002-143716/",
  "identifier_uri": "http://hdl.handle.net/10919/27872",
  "publisher": "Virginia Tech",
  "relation_haspart": "Etd_Saiyid_Islam.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Investment Cash Flow Sensitivity",
    "Financial Development",
    "Imperfect Capital Markets",
    "Internal Finance",
    "Financing Constraints"
  ],
  "title": "Investment Cash Flow Sensitivity: International Evidence",
  "type": "Dissertation"
}