{
  "contributor_author": "Grounard, Daniel J.",
  "contributor_committeechair": "Driscoll, Lisa G.",
  "contributor_committeemember": [
    "Arbogast, Terry E.",
    "Schreck, John F.",
    "Alexander, M. David",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:12:33Z",
  "date_adate": "2006-07-13",
  "date_available": "2014-03-14T20:12:33Z",
  "date_issued": "2006-05-12",
  "date_rdate": "2007-07-13",
  "date_sdate": "2006-05-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>This grounded theory retrospective case study examined whether the development of the Tennessee Value-Added Assessment System (TVAAS) supported Lasswell's (1951) policy process framework and the ecological adaptation of Marshall, Mitchell and Wirt's policy actors model. The study was a retrospective case study employing semi-structured interviews, analysis of documents, and archival records. </p><p>      The following research questions guided the study: Did the policy process evolve linearly as in Lasswell's theoretical model? If it was different, how? With respect to Marshall, Mitchell, and Wirt's ecological model of policy actor behavior, how was this theory consistent with the evidence from this case study? How did the political culture affect the policy process? How did the selected participants interpret their roles in the different policy stages? What issues developed during the stages of the policy process? How has the Tennessee Value-Added Assessment System as a codified policy changed?   </p><p>             The study concluded that the policy process evolved linearly, but took multiple cycles. The Small School Lawsuit precipitated events that suggest features of Punctuated Equilibrium and Multiple Streams theories during the agenda setting stage. The Advocacy Coalition Framework theory underscored many of the events that occurred in later stages. Policy actor behavior changed relative to actor proximity to the inner circle. The traditionalistic policy culture of Tennessee influenced the policy process largely through the elite's inclusion of the TVAAS policy in the omnibus Education Improvement Act (EIA) Bill. The interviewee/participant's roles during the policy process varied at the different policy process stages. </p><p>      Several issues (superintendent elections, teacher evaluation) with the omnibus EIA bill emerged during the policy process that threatened its passage; however, the bill passed due to the initial urgency of fiscal litigation concerns. Since its passage, TVAAS as a codified policy has not experienced any significant changes, except No Child Left Behind has necessitated changes to the types of assessments and indicators.   </p><p>   This study may be very useful to policy analyses and policy-makers interested in state level policymaking. </p>",
  "description_provenance": [
    "Author Email: dgrounard@cucps.k12.va.us",
    "Advisor Email: arbogastt@floyd.k12.va.us",
    "Advisor Email: stev7735@comcast.net",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:33Z (GMT). No. of bitstreams: 1 Dissertation.pdf2.pdf: 521792 bytes, checksum: d3e3fb9d4dcc5da0ea35e7d3b4a609c6 (MD5)   Previous issue date: 2006-05-12"
  ],
  "handle": "27877",
  "identifier_other": "etd-05242006-163331",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05242006-163331/",
  "identifier_uri": "http://hdl.handle.net/10919/27877",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Value-added Assessments",
    "Public policy-making",
    "Assessment"
  ],
  "title": "At the Intersection of Political Culture and the Policy Process: an Evolution of the Tennessee Value-Added Assessment System Through the Tennessee Legislature",
  "type": "Dissertation"
}