{
  "contributor_author": "Grosshans, Kurt",
  "contributor_committeecochair": [
    "Doolittle, Peter E.",
    "Glasson, George E."
  ],
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Brand, Brenda R.",
    "Burge, Penny L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:33Z",
  "date_adate": "2006-08-24",
  "date_available": "2014-03-14T20:12:33Z",
  "date_issued": "2006-05-01",
  "date_rdate": "2006-08-24",
  "date_sdate": "2006-05-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The primary purpose of this research was to investigate how science teachers engaged students under the 4 x 4 block schedule and how the teachersâ   understanding of how they used instructional strategies influenced their lessons. As an inquiry-based approach has been adopted by the National Science Standards, research has suggested that block scheduling provides more time for teachers to incorporate varied teaching strategies such as inquiry-based teaching. This research investigated the questions: What instructional strategies do science teachers use to engage students on the 4 x 4 block schedule?  How do science teachers understand their use of instructional strategies?       The methodology was qualitative in nature and involved a multiple case study of three high school science teachers at a large rural county high school. Data sources included pre-observation interviews, classroom observations, post-observation interviews, and the collection of documents and artifacts such as lesson plans, student hand-outs, worksheets, laboratory exercises, homework and other document(s) the teacher used to prepare for or implement a lesson.       The evidence observed in this study, suggests that the strategies used by these three science teachers remain mostly didactic in nature. Although the teachers reported in the interview phase that they use a wide variety of strategies, what was observed within the 4 x 4 block structure was the use of didactic strategies, not different strategies. Although the teachers were aware of more holistic strategies, such as inquiry-based and cooperative learning, they were not adopted nor adapted within the lesson.        The three teachers used strategies that were consistent with their scientific realist views concerning the nature of science. These scientific realist philosophies are antithetical to a social constructivist approach to teaching and learning, which is what the National Research Council suggests science teachers adopt.",
  "description_provenance": [
    "Author Email: kurtgrosshans@swva.net",
    "Advisor Email: suemags@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: glassong@vt.edu",
    "Advisor Email: bbrand@vt.edu",
    "Advisor Email: pburge@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:33Z (GMT). No. of bitstreams: 2 BlockStrategies2.pdf: 1698559 bytes, checksum: fa578153ad6e69ae1b32caef7999a98b (MD5) Abstract4.pdf: 321035 bytes, checksum: e12f1de6db474879a62146783e2ea0e8 (MD5)   Previous issue date: 2006-05-01"
  ],
  "handle": "27876",
  "identifier_other": "etd-05242006-120918",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05242006-120918/",
  "identifier_uri": "http://hdl.handle.net/10919/27876",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "BlockStrategies2.pdf",
    "Abstract4.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "4 x 4 block schedule",
    "teacher beliefs",
    "strategies",
    "science education"
  ],
  "title": "Science Teachers' Understanding and Use of Instructional Strategies Within the 4 x 4 Block Schedule",
  "type": "Dissertation"
}