{
  "contributor_author": "Rayyan, Saifuddin Ramadan",
  "contributor_committeechair": "Takeuchi, Tatsu",
  "contributor_committeemember": [
    "Minic, Djordje",
    "Chang, Lay Nam",
    "Schmittmann, Beate",
    "Mizutani, Tetsuro",
    "Pitt, Mark L."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:12:33Z",
  "date_adate": "2007-05-30",
  "date_available": "2014-03-14T20:12:33Z",
  "date_issued": "2007-05-10",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-05-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> The discovery of neutrino mixing provides the possibility of a non vanishing CP violating phase in the neutrino mixing matrix. CP violation in the leptonic sector can be large enough to explain the matter-antimatter asymmetry in the universe. An indirect probe of CP violation is the experimental measurement of Electric Dipole Moment (EDM). CP violation has  been discovered in the quark sector,but it contributes to lepton EDM at the 3-loop level. </p> <p>  Neutrino masses can be generated in the standard model via the see-saw mechanism where heavy right-handed neutrinos mix with the weak-basis states. The Majorana nature of the seesaw type neutrinos generates new 2-loop diagrams that lead to a non-vanishing lepton EDM. Only estimates of the resulting EDM have been done in the literature. A full calculation of the 2-loop diagrams and the exact result is presented.</p>",
  "description_provenance": [
    "Author Email: srayyan@vt.edu",
    "Advisor Email: takeuchi@vt.edu",
    "Advisor Email: dminic@vt.edu",
    "Advisor Email: laynam@vt.edu",
    "Advisor Email: schmittm@vt.edu",
    "Advisor Email: mizutani@vt.edu",
    "Advisor Email: pitt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:33Z (GMT). No. of bitstreams: 1 rayyan.pdf: 1024975 bytes, checksum: faa21f636013db8b77a03a10678b7de1 (MD5)   Previous issue date: 2007-05-10"
  ],
  "handle": "27879",
  "identifier_other": "etd-05242007-151447",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05242007-151447/",
  "identifier_uri": "http://hdl.handle.net/10919/27879",
  "publisher": "Virginia Tech",
  "relation_haspart": "rayyan.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Right Handed Neutrinos",
    "CP violation",
    "Electric Dipole Moment"
  ],
  "title": "Phenomenological Consequences of Heavy Right Handed Neutrinos",
  "type": "Dissertation"
}