{
  "contributor_author": "Conrad, Deborah Jacqueline",
  "contributor_committeechair": "Lalik, Rosary V.",
  "contributor_committeemember": [
    "Carico, Kathleen M.",
    "Barber, Elizabeth A.",
    "Uttech, Melanie R.",
    "Magliaro, Susan G."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:31Z",
  "date_adate": "2002-12-13",
  "date_available": "2014-03-14T20:12:31Z",
  "date_issued": "2002-03-29",
  "date_rdate": "2003-12-13",
  "date_sdate": "2002-05-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study describes the planning, teaching, and challenges of one classroom teacher during writing time in two second grade classrooms. The study looks at how this teacher planned for and implemented a writing curriculum in which computers played a role and what this teacher did in an attempt to influence children's development as writers. Data collected included four formal interviews with the teacher and observations over a period of two semesters of the teacher as she worked in the classroom and computer lab during writing time. The constant comparative method as described by Maykut and Morehouse (1994) was used to analyze the data. Analysis revealed that this teacher's approach was influenced by state standards and policy guidelines, as well as her early experiences with literacy.  In the lab, she focused on helping students develop keyboarding skills through keyboarding exercises, a computer game, and occasional word-proceeding of writing pieces done in the classroom. In the classroom she used a routine that consisted of three pre-writing activities. These involved students in reading materials related to the topic, brainstorming ideas they recalled, mapping relationships among brainstormed ideas, and writing group and individual accounts of their reading. Her approach to teaching in the city was quite similar to the approach she used in the county school. It differed insofar as in the county school she introduced the students to using the computer to conduct information searches about topics in the official state curriculum. Among the challenges she identified in her teaching were time and management problems. Based on these findings, the study identified four foci that might contribute to more effective use of computers in writing instruction. These include the teacher conceptions of literacy, effective planning, effective implementation and classroom management.",
  "description_provenance": [
    "Author Email: conraddj@potsdam.edu",
    "Advisor Email: rlalik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:31Z (GMT). No. of bitstreams: 2 Contentpage.pdf: 63445 bytes, checksum: ddb4be58f1e7c4d96394d1b2f21b8d20 (MD5) Dissertation.pdf: 3933133 bytes, checksum: 560e0502ab7d067bf0f6f04974e95efb (MD5)   Previous issue date: 2002-03-29"
  ],
  "handle": "27871",
  "identifier_other": "etd-05242002-142622",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05242002-142622/",
  "identifier_uri": "http://hdl.handle.net/10919/27871",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Contentpage.pdf",
    "Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Computers",
    "Case Study",
    "Literacy",
    "Writing"
  ],
  "title": "The teacher, the writing curriculum and computers: Planning and practice in pedagogy in two second-grade classrooms.",
  "type": "Dissertation"
}