{
  "contributor_author": "Wootten, David F",
  "contributor_committeechair": "Herbert, William G.",
  "contributor_committeemember": [
    "Cross, Lawrence H.",
    "Nickols-Richardson, Sharon M.",
    "Bos, Ronald R.",
    "Ramp, Warren K."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:12:33Z",
  "date_adate": "2001-06-06",
  "date_available": "2014-03-14T20:12:33Z",
  "date_issued": "2001-04-27",
  "date_rdate": "2005-02-20",
  "date_sdate": "2001-05-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this randomized controlled trial was to investigate temporal skeletal responses to short-term high intensity physical activity.  Twenty-eight normal active females [age: 20.7 +/- 2.1 yr (mean +/- SD)] were randomized into exercise (EX, n = 15) or control (CN, n = 13) groups.  The exercise group trained 6 days/wk for 6 wk, which consisted of maximal isokinetic knee flexion/extension 3 days/wk, combined with 3 days/wk running.  The purpose was to expose the tibiae to a period of abruptly increased loading forces.  Tibial bending stiffness (EIMRTA), and serum concentrations of biochemical markers of bone formation [osteocalcin (OC)], and bone resorption [n-telopeptide of type I collagen (NTx)] were measured at baseline, 2 wks, 4 wks, and 6 wks.  Isokinetic concentric knee extension/flexion peak torque, as well as total body and site-specific bone mineral density (BMD) were measured at baseline and 6 wk.  After training, the exercise group significantly increased (p < 0.05) isokinetic concentric peak torque for the dominant (13.6%) and non-dominant (5.7%) quadriceps, as well as dominant (7.7%) and non-dominant (9.5%) hamstrings, compared to the controls.  No differences for total body or site-specific BMD were noted.  A two-way multivariate repeated measures ANOVA revealed no timeâ ¢group interactions for composite tibial bending stiffness [(EIMRTA); p = 0.57] or the biochemical markers of bone turnover [(OC and NTx); p = 0.15] across the four sampling periods.  While there were no main effects for group, a trend for time (p = 0.051) for composite EIMRTA was observed.  The exercise group demonstrated a 20% increase in EIMRTA from baseline (74.8 +/- 22.3 Nm2) to 6 wk (89.8 +/- 24 Nm2), compared to controls who demonstrated a 4% increase (Baseline 86.5 +/- 23.8 Nm2; 6 wk 90 +/- 23.7 Nm2).  Significant group differences (p = 0.05) were noted for OC, but not NTx.  Differences (p < 0.05) for OC were observed at baseline [13.2 +/- 2.4 ng/ml (CN), 15.6 +/- 2.7 ng/ml (EX)], and follow-up ANCOVA revealed no differences for subsequent sampling periods.  Main effects for time were found for OC and NTx (p < 0.001).  Main effects for time in OC were attributable to changes in the exercise group (p < 0.01) and NTx (p < 0.01), but not the control group.",
  "description_provenance": [
    "Author Email: dwootten@vt.edu",
    "Advisor Email: wgherb@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: snrich@vt.edu",
    "Advisor Email: aniwar@aol.com",
    "Made available in DSpace on 2014-03-14T20:12:33Z (GMT). No. of bitstreams: 1 final.PDF: 1347179 bytes, checksum: 23c9ee4bccf4634bc95145d5ce587990 (MD5)   Previous issue date: 2001-04-27"
  ],
  "handle": "27880",
  "identifier_other": "etd-05252001-151500",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05252001-151500/",
  "identifier_uri": "http://hdl.handle.net/10919/27880",
  "publisher": "Virginia Tech",
  "relation_haspart": "final.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "biochemical markers of bone turnover",
    "mechanical response tissue analysis",
    "bone mineral density",
    "exercise"
  ],
  "title": "Short Term Time Course Skeletal Responses to High Intensity Physical Exercise",
  "type": "Dissertation"
}