{
  "contributor_author": "Shollenberger, Matthew Alan",
  "contributor_committeechair": "Madison-Colmore, Octavia D.",
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:12:33Z",
  "date_adate": "2001-06-04",
  "date_available": "2014-03-14T20:12:33Z",
  "date_issued": "2001-04-30",
  "date_rdate": "2002-06-04",
  "date_sdate": "2001-05-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Graduate school for most students can be quite stressful. When combined with the responsibility of being a spouse, parent, and/or employee, the stress is elevated. Research has indicated that the greatest area of discord for married graduate students and their nonstudent spouses is communication. The purpose of this study is to investigate the effects of a relationship enhancement program on the marital adjustment of graduate students and their spouses. The sample consisted of 28 married graduate students and their nonstudent spouses. These couples were randomly assigned to one of two treatment groups or a control group. Some of the treatment group participants received one-on-one training by a therapist certified in Relationship Enhancement (RE while others received the training through an RE self-study manual (Guerney, 1987). Marital adjustment was measured pre and post test to intervention by the Locke-Wallace Marital Adjustment Test (Locke & Wallace, 1959). Analysis of variance (ANOVA) revealed significant differences between treatment group and control group as measured by scores of marital adjustment. This study also provides suggestions for how institutions of higher education can provide support to married students and their spouses on college campuses.",
  "description_provenance": [
    "Author Email: mshollen@aol.com",
    "Advisor Email: omadison@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:33Z (GMT). No. of bitstreams: 1 1PDF.pdf: 1107980 bytes, checksum: 97ff56a493e6b76db3ad56b15ad80958 (MD5)   Previous issue date: 2001-04-30"
  ],
  "handle": "27881",
  "identifier_other": "etd-05252001-163841",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05252001-163841/",
  "identifier_uri": "http://hdl.handle.net/10919/27881",
  "publisher": "Virginia Tech",
  "relation_haspart": "1PDF.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Relationship Enhancement",
    "Marital Adjustment",
    "Married Graduate Students"
  ],
  "title": "Increasing Marital Adjustment in Graduate Students and their Spouses through Relationship Enhancement",
  "type": "Dissertation"
}