{
  "contributor_author": "Al Kandari, Kalthoum Mohammed",
  "contributor_committeechair": "Hicks, David",
  "contributor_committeemember": [
    "Ochsenwald, William L.",
    "Abraham, Jane L.",
    "Uttech, Melanie R.",
    "Tlou, Josiah S."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:35Z",
  "date_adate": "2004-06-15",
  "date_available": "2014-03-14T20:12:35Z",
  "date_issued": "2004-05-05",
  "date_rdate": "2007-06-15",
  "date_sdate": "2004-05-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Kalthoum Al Kandari - Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>This study seeks to explore, and in exploring to describe, and illuminate, <em>Al-Amal </em> a private bilingual school in Kuwait that adapts and implements a curriculum designed by U.S. educators in three main academic subjects (English, science, and mathematics), while at the same time, focuses extensively on an Islamic studies curriculum. The main incentive for selecting this focus was the September 11, 2001 terrorist attacks on the World Trade Center and the Pentagon. Since that date, the mass media have paid much attention to Islam and to Muslim society, particularly to its educational system, which has usually been viewed with skepticism (Charif, 2002; Rugh, 2002). </p> <p>This study focuses on a single school, for the general insight it can offer into a number of related research questions: How do Islamic parents who send their children to this school <em></em>define the spiritual and/or religious needs they want their children to possess, and what role does the school play in fulfilling such needs? How do spiritual/religious and academic needs intersect within the formal curriculum at the school, as a result of daily interactions between teachers and children? Finally, in the midst of increased westernization and globalization, how do the teachers of this school negotiate the influences of western values on their students and curriculum? By exploring the nature, philosophy, and context of one Islamic school, this study seeks to enable readers to understand more fully and accurately how those involved with such an institution cope with the various challenges they meet in the global sphere. </p> <p>To reach its goal, this study utilizes a number of research methods and tools, including direct observation, interviews, a research diary and reflection, and a traditional literature review. Ultimately, this study suggests that <em>Al </em>- <em>Amal </em> possesses unique complexities and contradictions. Those characteristics derive from the institution's transformation of traditional Islamic schooling in order to prepare its students for life in the global arena and from its desire to develop both academically and spiritually a new generation of Muslims better able to cope with the challenges they confront in this arena. </p> <br> </body> </html>",
  "description_provenance": [
    "Author Email: kkandari@vt.edu",
    "Advisor Email: ochsen@vt.edu",
    "Advisor Email: janea@vt.edu",
    "Advisor Email: drmelanie@cox.net",
    "Advisor Email: tlou@vt.edu",
    "Advisor Email: hicks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:35Z (GMT). No. of bitstreams: 1 Kalthoum.pdf: 685737 bytes, checksum: efa5ee38cf2c24bbdc28de78ecaac13b (MD5)   Previous issue date: 2004-05-05"
  ],
  "handle": "27896",
  "identifier_other": "etd-05262004-160620",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05262004-160620/",
  "identifier_uri": "http://hdl.handle.net/10919/27896",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kalthoum.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Modernity",
    "Globalization",
    "Kuwait",
    "Islamic schools"
  ],
  "title": "Islamic School: Challenges and Potentials in the 21st Century a Case Study of Al-Amal, a Private Bilingual School in Kuwait",
  "type": "Dissertation"
}