{
  "contributor_author": "Swoboda, Lois Elizabeth",
  "contributor_committeecochair": [
    "Fell, Richard D.",
    "Miller, Dini M."
  ],
  "contributor_committeemember": [
    "Weaver, Michael J.",
    "Mullins, Donald E.",
    "Schabenberger, Oliver"
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:12:35Z",
  "date_adate": "2004-07-15",
  "date_available": "2014-03-14T20:12:35Z",
  "date_issued": "2004-02-25",
  "date_rdate": "2004-07-15",
  "date_sdate": "2004-05-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Reticulitermids were significantly more likely to discover subterranean baits connected by physical guidelines than freestanding baits under both laboratory and field conditions.  In the laboratory, subterranean termites built significantly longer tunnels adjacent to cellulosic guidelines than plastic guidelines.   In the field, all guideline materials were equally effective at directing tunneling activity.   Reticulitermes spp. workers were tested to determine their preferred substrate temperature.  The preferred range for Reticulitermes spp. workers was found to be 18 to 27 degrees C.   A laboratory bioassay was performed to determine if Reticulitermes spp. aggregates within thermal shadows.  Significantly more Reticulitermes spp. workers aggregated within cool thermal shadows than control areas.   In a multiple choice bioassay, mean consumption was higher for paper baits treated with fructose, galactose, glucose, raffinose, sucrose, trehalose and uric acid than for control baits.  In a multiple choice bioassay, mean consumption was significantly lower for baits treated with arbutin, and most amino acids than for control baits.  In the no-choice bioassay, the amount of paper bait consumed did not differ significantly for any of the treated baits tested and control baits.",
  "description_degree": "PhD",
  "description_provenance": [
    "Author Email: antbetty@excite.com",
    "Advisor Email: rfell@vt.edu",
    "Advisor Email: mweaver@vt.edu",
    "Advisor Email: mullinsd@vt.edu",
    "Advisor Email: dinim@vt.edu",
    "Advisor Email: Oliver.Schabenberger@sas.com",
    "Made available in DSpace on 2014-03-14T20:12:35Z (GMT). No. of bitstreams: 1 Onefilegood.pdf: 1910488 bytes, checksum: 262c25cb90d53188b172156a1cdcdb6b (MD5)   Previous issue date: 2004-02-25"
  ],
  "handle": "27897",
  "identifier_other": "etd-05262004-184108",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05262004-184108/",
  "identifier_uri": "http://hdl.handle.net/10919/27897",
  "publisher": "Virginia Tech",
  "relation_haspart": "Onefilegood.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "wood thermoplastic composites",
    "temperature",
    "subterranean termites",
    "nutrients",
    "physical guidelines",
    "foraging"
  ],
  "title": "Environmental Influences on Subterranean Termite Foraging Behavior and Bait Acceptance",
  "type": "Dissertation"
}