{
  "contributor_author": "Wood, Paula Reese",
  "contributor_committeechair": [
    "Heath-Camp, Betty A.",
    "Heath-Camp, Betty A."
  ],
  "contributor_committeemember": [
    "White, Clarence D.",
    "Sturgis, Ellie T.",
    "Camp, William G.",
    "Eschenmann, Konrad Kurt",
    "White, Clarence D.",
    "Sturgis, Ellie T.",
    "Camp, William G.",
    "Eschenmann, Konrad Kurt"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:37Z",
  "date_adate": "1999-06-16",
  "date_available": "2014-03-14T20:12:37Z",
  "date_issued": "1999-05-05",
  "date_rdate": "2000-06-16",
  "date_sdate": "1999-06-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "THE IMPORTANCE OF TECHNICAL COMPETENCIES FOR BEGINNING                                 SECONDARY BUSINESS TEACHERS IN VIRGINIA by Paula Reese Wood                                 (ABSTRACT) The purpose of this study was to determine the degree of                                 importance of each of the curriculum competencies in the National                                 Standards for Business Education (NBEA, 1995) for the successful                                 performance of beginning secondary business teachers in Virginia as                                 perceived by experienced and inexperienced business teachers. The                                 standards consist of 102 competencies in the 11 subject areas of business                                 education.                                   The questionnaire used in the research study was an original survey                                 instrument developed by the researcher after a review of the literature did                                 not reveal an instrument that could be used with the NBEA document. The                                 survey instrument was mailed to a sample of public high school business                                 teachers in Virginia who were systematically selected from an available                                 population. Results from the demographic question on the survey resulted                                 in the identification of 161 experienced business teachers and 18                                 inexperienced business teachers.                                   Means, standard deviations, and t-tests were used to describe the data. The                                 competencies were rated with a five-point Likert scale. All competencies                                 were rated as having either essential importance, above average importance,                                 or average importance. Of the 102 competencies, experienced business                                 teachers identified 11 as having essential importance, 86 as having more                                 than average importance, and 5 as having average importance.                                 Inexperienced business teachers rated 11 competencies as having essential                                 importance, 87 as having more than average importance, and 4 as having                                 average importance. When comparing the experienced and the                                 inexperienced teachers' lists of rated competencies, 9 competencies rated as                                 essential importance were the same for both groups, and 3 competencies                                 rated as average were the same for both groups. When comparing the overall                                 content areas, no significant differences existed between the perceptions of                                 the experienced business teachers and the inexperienced business teachers.",
  "description_provenance": [
    "Author Email: pwood@juno.com",
    "Advisor Email: cwhite@runet.edu",
    "Advisor Email: sturgis@vt.edu",
    "Advisor Email: heathb@vt.edu",
    "Advisor Email: wgcamp.vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Advisor Email: cwhite@runet.edu",
    "Advisor Email: sturgis@vt.edu",
    "Advisor Email: heathb@vt.edu",
    "Advisor Email: wgcamp@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:37Z (GMT). No. of bitstreams: 5 PaulaWood.pdf: 384465 bytes, checksum: 0b91c59d329c81b33e2a17e22170eeaf (MD5) FRONT.PDF: 81457 bytes, checksum: fd5478192632cea45b79e1b9986d7321 (MD5) PaulaWoodModified.pdf: 399641 bytes, checksum: f4278470e087ecbc3fb272ccd6f3587d (MD5) BODY.PDF: 345933 bytes, checksum: 7d5915a7ae8baae58ec3493b106abef1 (MD5) REAR.PDF: 163792 bytes, checksum: f51880109632137228d2d68d89dc1761 (MD5)   Previous issue date: 1999-05-05"
  ],
  "handle": "27907",
  "identifier_other": "etd-052799-115843",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-052799-115843/",
  "identifier_uri": "http://hdl.handle.net/10919/27907",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "PaulaWood.pdf",
    "FRONT.PDF",
    "PaulaWoodModified.pdf",
    "BODY.PDF",
    "REAR.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "vocational-technical education",
    "curriculum competencies",
    "business education",
    "National Standards for Business Education",
    "technical skills",
    "beginning business teachers",
    "business education",
    "vocational-technical education",
    "curriculum competencies",
    "National Standards for Business Education",
    "technical skills",
    "beginning business teachers"
  ],
  "title": "The Importance of Technical Competencies for Beginning Secondary Business Teachers in Virginia",
  "type": "Dissertation"
}