{
  "contributor_author": "Hess, Jr., Ronald L",
  "contributor_committeecochair": [
    "Klein, Noreen M.",
    "Ganesan, Shankar"
  ],
  "contributor_committeemember": [
    "Brown, James R.",
    "Arora, Neeraj",
    "Foti, Roseanne J."
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:12:37Z",
  "date_adate": "1999-06-02",
  "date_available": "2014-03-14T20:12:37Z",
  "date_issued": "1999-05-06",
  "date_rdate": "2000-06-02",
  "date_sdate": "1999-05-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation investigates how satisfaction with a service employee affects customers' overall satisfaction with a service organization following an employee-initiated service failure.  Specifically, this research examines how the severity of a peripheral service failure (how the service is delivered), quality of past core service performance (basic benefits of service), and existence of past peripheral service failures impact the extent to which customers' satisfaction with an employee transfers to evaluations of the service organization.   Dimensions of attribution theory are explored as a process mediating the effects of these variables on satisfaction with the employee and organization. This dissertation extends attribution theory by differentiating controllability attributions at both the employee and organizational levels, as well as introducing attributions of globality (universal across the organization versus employee or situation-specific) to marketing.  Distinctions between employee and organizational-level attributions may clarify the process by which customer evaluations of employees affect organizations.   The study used an experimental role-playing methodology to test the proposed conceptual model.  Four-hundred forty-five (445) air travelers comprised the sample.  The design for this study varied the severity of the current peripheral service failure (less severe, more severe, and no-failure), existence of past peripheral service failures (existing and not existing), and quality of past core service performance (excellent and average).  Structural equation modeling using Lisrel 8.20 was used to test the proposed hypotheses.   Overall, the results show that the severity of the peripheral service failure and aspects of past service history influence the attributions that customers make following peripheral service failures.  These attributions, in turn, have a significant impact on customers' satisfaction with the employee and the organization.  The findings also indicate that the severity of the current peripheral failure can spill over and negatively affect customers' satisfaction with the core service component.  Furthermore, the results show that both aspects of customers' past service experience with an organization (existence of past peripheral service failures, quality of past core service performance) directly impact customers' overall satisfaction with the organization.",
  "description_provenance": [
    "Author Email: ron.hess@business.wm.edu",
    "Advisor Email: jamesb@vt.edu",
    "Advisor Email: arora@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: nklein@vt.edu",
    "Advisor Email: ganesan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:37Z (GMT). No. of bitstreams: 1 DIS_FINAL.PDF: 404993 bytes, checksum: 49a746c73f7af9c9f35e71966feca5f9 (MD5)   Previous issue date: 1999-05-06"
  ],
  "handle": "27908",
  "identifier_other": "etd-052799-160746",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-052799-160746/",
  "identifier_uri": "http://hdl.handle.net/10919/27908",
  "publisher": "Virginia Tech",
  "relation_haspart": "DIS_FINAL.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "services",
    "satisfaction",
    "employee",
    "peripheral service",
    "core service",
    "service failure"
  ],
  "title": "The Effects of Employee-Initiated Peripheral Service Failures on Customers' Satisfactions with the Service Organization",
  "type": "Dissertation"
}