{
  "contributor_author": "Zeytun, Ahmet",
  "contributor_committeechair": "Nagarkatti, Prakash S.",
  "contributor_committeemember": [
    "Turner, Bruce J.",
    "Eng, Ludeman A.",
    "Esen, Asim",
    "Nagarkatti, Mitzi"
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:12:36Z",
  "date_adate": "1999-05-29",
  "date_available": "2014-03-14T20:12:36Z",
  "date_issued": "1999-05-13",
  "date_rdate": "2000-05-29",
  "date_sdate": "1999-05-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "TUMOR CELLS-IMMUNE CELL INTERACTIONS: A LETHAL TWO WAY STREET By  Ahmet Zeytun Dr. Prakash S. Nagarkatti, Chairman Biology (Abstract) <p>We investigated the role of Fas ligand in the development of anti-tumor immunity. The LSA tumor specific cytotoxic T lymphocyte (CTL) clone, PE-9, expressed both Fas and Fas ligand. This CTL clone upregulated Fas and Fas ligand expression upon activation through the T-cell receptor and induced apoptosis in Fas+, LSA tumor cells using the FasL-based pathway. However, LSA and EL-4 tumor cells constitutively expressed Fas ligand and killed Fas+ PE-9 CTLs and Fas+, but not Fas-negative  (Fas-) activated T cells and thymocytes. These data suggested that T cells and cancer cells can kill each other and that cancer cells may use Fas ligand to evade the action of the immune T cells. <p>In addition to the expression of membrane-bound form, FasL+ LSA and EL-4 tumor cells produced a soluble form of Fas ligand when they grew in vivo and in vitro. Serum from EL-4 or LSA-bearing wild type mice contained significant levels of Fas ligand. The  soluble FasL induced apoptosis in liver and thymus of C57BL/6 wild type (Fas+) mice, but not C57BL/6 lpr/lpr (Fas-) mice.  The detection of apoptosis in the liver of C57BL/6 gld/gld (FasL-defective) mice suggested that the source of Fas ligand found in the sera of EL-4 or LSA-bearing mice was from the tumor cells rather than the host cells.  <p>CTL or NK cells used FasL-based apoptosis to kill the target cells when activated. To this end, we tested whether constitutive expression of Fas on tumor cells generate enhanced anti-tumor immunity. IL-2 or poly-I-C induced/ activated NK/LAK cells displayed higher cytotoxicity against L1210 Fas+, but not L1210 Fas- tumor cells. Furthermore, growth of L1210 Fas+, but not Fas- tumor, in vivo, generated Fas-specific cytotoxic T lymphocytes. Therefore,  mice bearing L1210 Fas+ tumor cells  survived for a longer time than mice bearing  L1210 Fas- tumor cells.   <p>To determine the role of the Fas, FasL, and perforin  in the initiation of tumor, C57BL/6 +/+ (FasL+, Fas+), C57BL/6 lpr/lpr (Fas-), C57BL/6 gld/gld (FasL-),  and perforin knock-out  (PKO) (FasL+, Fas+, but perforin-deficient) mice were injected with methylcholanthrane (MCA). Tumor development in lpr or gld mice was faster and uncontrollable, compared to C57BL/6 (wild-type) and PKO mice. However, wild-type and PKO mice showed delayed tumor appearence and were able to suppress tumor growth. In addition to the deficiency of Fas or FasL, high levels of TGF-b and IL-10 expression detected in lpr and gld mice were also responsible for the early tumor development. <p>Together these data suggested that interactions between Fas and Fas ligand, expressed on immune cells and tumor cells, play an important role in the generation of anti-tumor immunity. Tumor cells use FasL to evade the action of the immune system, and upregulation of FasL makes T cells more cytolytic.  Tumor growth may depend on the number of cancer cells vs. the number of cancer specific T cells.",
  "description_provenance": [
    "Author Email: azeytun@vt.edu",
    "Advisor Email: fishgen@vt.edu",
    "Advisor Email: laeng@vt.edu",
    "Advisor Email: aevatan@vt.edu",
    "Advisor Email: pnagarka@vt.edu",
    "Advisor Email: mnagarka@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:36Z (GMT). No. of bitstreams: 6 FIGURE4.5.TIF: 851712 bytes, checksum: af2308e3187b0248000898bcbd5a991e (MD5) AZEYTUNDISS.PDF: 1772652 bytes, checksum: 6393827ef7c917ffffbee0fef7997e07 (MD5) FIGURE4.7.TIF: 765060 bytes, checksum: 845c16ee788cf03afca1319392ed0443 (MD5) FIGURE4.6.TIF: 765060 bytes, checksum: 3426e48ed8714c3e9c8f7dde20fe002c (MD5) FIGURE4.4.TIF: 847428 bytes, checksum: 156e07013cbb127b6075af70c61bd7fb (MD5) FIGURE4.8.TIF: 711584 bytes, checksum: 7111449cf48f3bd6eecd0203e69434bd (MD5)   Previous issue date: 1999-05-13"
  ],
  "handle": "27905",
  "identifier_other": "etd-052699-174350",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-052699-174350/",
  "identifier_uri": "http://hdl.handle.net/10919/27905",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "FIGURE4.5.TIF",
    "AZEYTUNDISS.PDF",
    "FIGURE4.7.TIF",
    "FIGURE4.6.TIF",
    "FIGURE4.4.TIF",
    "FIGURE4.8.TIF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Fas ligand",
    "cancer",
    "apoptosis"
  ],
  "title": "Tumor cell-immune cell interaction: A lethal two way street",
  "type": "Dissertation"
}