{
  "contributor_author": "O'Boyle, Patrick Daniel",
  "contributor_committeecochair": [
    "Maroof, M. A. Saghai",
    "Griffey, Carl A."
  ],
  "contributor_committeemember": [
    "Stromberg, Erik L.",
    "Tolin, Sue A.",
    "Wilkinson, Carol A."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:12:36Z",
  "date_adate": "2009-06-04",
  "date_available": "2014-03-14T20:12:36Z",
  "date_issued": "2009-05-05",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-05-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Net blotch is one of the most devastating diseases of barley (<i>Hordeum vulgare</i> L.) and occurs in two distinct forms, net-type net blotch (NTNB) and spot-type net blotch (STNB), caused by the fungal pathogens <i>Pyrenophora teres</i> f. sp. <i>teres</i> Smedeg. and <i>P</i>. <i>teres</i> f. sp. <i>maculata</i> Smedeg., respectively.  Several sources of resistance have been previously reported, however, few barley cultivars with high levels of resistance have been developed from these sources.  Efficient utilization of available resistance sources is dependent upon successful characterization of genes governing resistance in each resistant parent.  Five net blotch resistant parents and one susceptible parent were crossed to identify novel resistance genes, postulate gene number and mode of inheritance, and conduct linkage mapping of novel genes for net blotch resistance.  Results indicate that the highly resistant spring barley lines CIho 2291 and CIho 5098, and the winter barley cultivar Nomini each have single dominant genes for NTNB resistance.  Resistance to NTNB in CIho 5098 is controlled by the same dominant gene conferring resistance in Nomini.  Resistance to NTNB in CIho 2291 is controlled by one dominant gene which putatively is the same gene conferring resistance in ND B112, but differs from the resistance genes carried by the other parents in this study.  An F2 population of 238 individuals derived from a cross between Nomini and the susceptible parent â  Hectorâ  , and an F2 population of 193 individuals derived from a cross between CIho 2291 and Hector were used to map the genes governing NTNB resistance in Nomini and CIho 2291.  The dominant gene governing resistance in Nomini, temporarily designated <i>Rpt-Nomini</i>, was mapped to a 9.2 cM region near the centromere of barley chromosome 6H between the flanking microsatellite markers Bmag0344a (r2=0.70)  and Bmag0103a (r2=0.90), which were 6.8 cM and 2.4 cM away from <i>Rpt-Nomini</i>, respectively.  The dominant gene governing resistance in CIho 2291, temporarily designated <i>Rpt-CIho2291</i>, was mapped to the distal region of barley chromosome 6H between the flanking microsatellite markers Bmag0173 (r2=0.65) and Bmag0500 (r2=0.26), which were 9.9 cM and 24.4 cM from <i>Rpt-CIho2291</i>, respectively.  Previous studies have reported genes governing net blotch resistance in this region; however, allelism tests have not been conducted to determine the relationship between these genes.  Identification of the chromosomal location of <i>Rpt-Nomini</i> and <i>Rpt-CIho2291</i> will facilitate future efforts in pyramiding multiple independent genes for net blotch resistance.",
  "description_provenance": [
    "Author Email: oboyle@vt.edu",
    "Advisor Email: elstrom@vt.edu",
    "Advisor Email: stolin@vt.edu",
    "Advisor Email: wilki@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: cgriffey@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:36Z (GMT). No. of bitstreams: 1 Dissertation_ETDversion_Revised.pdf: 589454 bytes, checksum: 380b65fb77c9bc5a2e09d7522f29e308 (MD5)   Previous issue date: 2009-05-05"
  ],
  "handle": "27904",
  "identifier_other": "etd-05262009-113923",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05262009-113923/",
  "identifier_uri": "http://hdl.handle.net/10919/27904",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_ETDversion_Revised.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "<i> Pyrenophora teres </i>",
    "Barley",
    "Net Blotch",
    "<i>Hordeum vulgare </i>",
    "Microsatellite"
  ],
  "title": "Genetic Characterization and Linkage Mapping of Barley Net Blotch Resistance Genes",
  "type": "Dissertation"
}