{
  "contributor_author": "Geng, Tuoyu",
  "contributor_committeechair": "Smith, Edward J.",
  "contributor_committeemember": [
    "Tu, Zhijian Jake",
    "Cassell, Bennet G.",
    "Hallerman, Eric M.",
    "Maroof, M. A. Saghai",
    "Potts, Malcolm"
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:12:38Z",
  "date_adate": "2007-06-01",
  "date_available": "2014-03-14T20:12:38Z",
  "date_issued": "2007-05-18",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-05-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Immune response provides vertebrates an important mechanism to fight pathogens and to reduce the incidence of diseases. Defining the molecular basis of antibody response may facilitate genetic improvement in the immune response of animals to pathogens. For almost 4 decades, antibody titers in response to challenge by sheep red blood cells (anti-SRBC) have provided an investigative tool in the efforts to define molecular mechanisms that underlie vertebrate immune response. The overall objective of this dissertation research was to identify DNA markers associated with anti-SRBC response in chickens. Specific objectives were: to develop a resource population for QTL analysis for anti-SRBC, to identify DNA markers and genes associated with primary anti-SRBC, and to evaluate the allelic frequencies in non-selected chicken populations of candidate markers associated with either high or low anti-SRBC response. These objectives tested the hypothesis that genetic control of a chicken's response to SRBC is polygenic. The resource population developed consisted of F1, backcross, and F2 derived from reciprocal crosses of birds from parental lines in the 28th generation of divergent selection for low (L) and high (H) anti-SRBC. The mean anti-SRBC titers of the parental lines were significantly different, with 11.5 for H and 2.6 for L (P<0.05). That for the 4 groups of F2 progeny ranged from 6.3 to 7.5, while those of the 8 groups of backcross progeny ranged from 3.9 to 13.3. Four of 555 random primers used to screen the parental H and L anti-SRBC lines were informative by amplifying seven line-specific fragments (P<0.0025). Each of the 7 line-specific fragments was converted to a sequence characterized amplified region (SCAR) within which single nucleotide polymorphisms (SNPs) were identified and tested for association with anti-SRBC. Only two of the seven SCARs in the parental lines were associated (P<0.05) with anti-SRBC level in the backcross resource population. Additionally, from analysis of the parental L and H anti-SRBC lines using microarrays, a total of 57 line-specific SNPs were also identified. Twenty of the line-specific SNPs were in and/or near genes previously reported to have immunity-related function. Microarray-based gene expression profiling of pooled RNA samples from L and H anti-SRBC birds identified three differentially expressed genes. In summary, this dissertation describes resources that include candidate SCARs and SNPs as well as differentially expressed genes that may be useful for the identification of genes that underlie antibody response.",
  "description_provenance": [
    "Author Email: tugeng@vt.edu",
    "Advisor Email: jaketu@vt.edu",
    "Advisor Email: esmith@vt.edu",
    "Advisor Email: bcassell@vt.edu",
    "Advisor Email: ehallerm@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: geordie@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:38Z (GMT). No. of bitstreams: 1 Dissertation_TuoyuGeng.pdf: 1461451 bytes, checksum: 80db1119b44535759edd4d734e0d3087 (MD5)   Previous issue date: 2007-05-18"
  ],
  "handle": "27914",
  "identifier_other": "etd-05292007-123730",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05292007-123730/",
  "identifier_uri": "http://hdl.handle.net/10919/27914",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_TuoyuGeng.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Gallus gallus",
    "antibody response to sheep red blood cells",
    "quantitative trait locus"
  ],
  "title": "Genomics-Based Analysis of Antibody Response to Sheep Red Blood Cells in Chickens",
  "type": "Dissertation"
}