{
  "contributor_author": "Gallagher, Thomas V.",
  "contributor_committeechair": "Shaffer, Robert M. Jr.",
  "contributor_committeemember": [
    "Aust, Wallace Michael",
    "Loferski, Joseph R.",
    "Sullivan, Jay",
    "Seiler, John R."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:12:39Z",
  "date_adate": "2003-06-24",
  "date_available": "2014-03-14T20:12:39Z",
  "date_issued": "2003-05-23",
  "date_rdate": "2003-06-24",
  "date_sdate": "2003-05-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Procuring hardwood pulpwood during the winter months for a pulp mill in the Southeast can be difficult.  Saturated soils and low soil strength make logging difficult or impossible on many sites, forcing companies to store large volumes of hardwood pulpwood in woodyards for retrieval during wet weather.  Hardwood fiber readily available in large volumes on ground that is operable during wet periods at a location near the pulp mill could provide a valuable alternative wood source.  Thus, the objectives of this study are to 1) develop a decision model for a manager to use to determine the feasibility of strategically located, intensively-managed, short-rotation hardwood fiber farms as pulp mill furnish, 2) use the model to estimate wood costs for a hypothetical eastern cottonwood plantation, and 3) use the model to determine if a fiber farm grown on drier, upland sites (â  greenâ   inventory) could be used to reduce woodyard winter inventories and economically supply a nearby pulp mill during a wood shortage, thus reducing high cost, emergency â  spot marketâ   wood purchases.  The decision model is incorporated in a spreadsheet and includes all the costs typical for a fiber farm.  The model is tested using current establishment and management costs from the literature and yields from an experimental fiber farm in the southeast.  Under current yields, delivered costs from the fiber farm averages $71/ton.  With potential increased yields that could occur with genetic improvements and operational optimizations, delivered cost for fiber farm wood could be reduced to $56/ton.  In comparison, the highest cost wood purchased by the three cooperating pulp mills during the study period was $50.23/ton.  The net present values of a fiber farm as â  greenâ   inventory were determined using actual wood cost and inventory levels from three cooperating southeastern pulp mills.  For the â  greenâ   inventory analysis, all three pulp mills would have lowered their overall wood cost using a fiber farm (with higher yield) as â  greenâ   inventory, primarily by reducing the amount of wood required as dry inventory on woodyards.  Savings accrued during â  dryâ   years offset the higher cost of hardwood plantation deliveries.  A sensitivity analysis was performed to determine the optimal size fiber farm for one of the cooperating pulp mills and indicated that 800 acres would be the most beneficial.",
  "description_provenance": [
    "Author Email: thgallag@vt.edu",
    "Advisor Email: rshaffer@vt.edu",
    "Advisor Email: waust@vt.edu",
    "Advisor Email: jloferski@vt.edu",
    "Advisor Email: jsulliv@vt.edu",
    "Advisor Email: jseiler@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:39Z (GMT). No. of bitstreams: 1 TVGallagher.pdf: 1212576 bytes, checksum: 94844880b9c39c0c36be47700c5b69bf (MD5)   Previous issue date: 2003-05-23"
  ],
  "handle": "27918",
  "identifier_other": "etd-05302003-163928",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05302003-163928/",
  "identifier_uri": "http://hdl.handle.net/10919/27918",
  "publisher": "Virginia Tech",
  "relation_haspart": "TVGallagher.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fiber farms",
    "wood inventory",
    "hardwood plantations"
  ],
  "title": "ASSESSING THE COST AND OPERATIONAL FEASIBILITY OF â  GREENâ   HARDWOOD WINTER INVENTORY FOR SOUTHEASTERN PULP MILLS",
  "type": "Dissertation"
}