{
  "contributor_author": "Teparkum, Sirasak",
  "contributor_committeechair": "Marini, Richard P.",
  "contributor_committeemember": [
    "Kok, Loke T.",
    "Veilleux, Richard E.",
    "Barden, John A.",
    "Pfeiffer, Douglas G."
  ],
  "contributor_department": "Horticulture",
  "date_accessioned": "2014-03-14T20:12:39Z",
  "date_adate": "2000-06-05",
  "date_available": "2014-03-14T20:12:39Z",
  "date_issued": "2000-05-02",
  "date_rdate": "2001-06-05",
  "date_sdate": "2000-05-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Leaves and fruit of nine apple (Malus x domestica Borkh.) genotypes were evaluated for insect injury in 1998 and 1999. Foliar and fruit injury from 12 insect species was inconsistently affected by genotype. Spraying trees with oil affected neither fruit insect injury nor fruit phytotoxicity.  In choice feeding assays, incidence of Japanese beetle (JB) feeding and leaf area consumed was greater for 'Liberty' than for 'York.' Genotypes did not differ in no-choice feeding assays. Choice and no-choice feeding assays between apple and oak indicated that JB could distinguish host plants in an artificial environment. Trichome density appeared different among three genotypes. 'York', the non-preferred genotype, had highest specific leaf weight and concentration of phloridzin, a feeding repellent. 'Liberty' the preferred genotype, had the lowest specific leaf weight, and had the highest concentration of quercitrin, a feeding stimulant. Olfactory stimuli of JB was evaluated with a Y-tube olfactometer. Beetles preferred the side of the Y-tube containing leaf tissue of apple or Virginia creeper over the side with no leaf.  Beetles did not choose one plant species over the other. Bias test of beetle orientation in the Y-tube olfactometer indicated that in the morning, but not the afternoon, beetles preferentially moved into the left side of the Y-tube. Humidity did not affect beetle orientation. In darkness JB preferred a leaf disc over a paper disc and beetles tended to remain on the leaf.",
  "description_provenance": [
    "Author Email: steparku@vt.edu",
    "Advisor Email: ltkok@vt.edu",
    "Advisor Email: marinirp@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: bardenja@vt.edu",
    "Advisor Email: dgpfeiff@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:39Z (GMT). No. of bitstreams: 1 tony3.pdf: 451079 bytes, checksum: cad2f6d762612dd112cb9fb5b62f850a (MD5)   Previous issue date: 2000-05-02"
  ],
  "handle": "27920",
  "identifier_other": "etd-05312000-23280030",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05312000-23280030/",
  "identifier_uri": "http://hdl.handle.net/10919/27920",
  "publisher": "Virginia Tech",
  "relation_haspart": "tony3.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Malus domestica",
    "Trichome",
    "Refined oil",
    "Japanese beetle",
    "Y-tube olfactometer"
  ],
  "title": "Interaction Between Insects and  Apple (Malus X Domestica Borkh.): Insect Behavior, Genotypic Preference, and Plant Phenolics With Emphasis on Japanese Beetle (Popillia Japonica Newman)",
  "type": "Dissertation"
}