{
  "contributor_author": "Kwon, Hyuksoo",
  "contributor_committeechair": "Wells, John G.",
  "contributor_committeemember": [
    "Sanders, Mark E.",
    "Jones, Brett D.",
    "Chang, Mido"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:40Z",
  "date_adate": "2009-06-26",
  "date_available": "2014-03-14T20:12:40Z",
  "date_issued": "2009-05-21",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-06-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The growing impact of biotechnology globally and nationally over the past few decades has prompted the need for elevating general biotechnological literacy levels in all populations. This need is currently being addressed through the field of technology education (TE). Although included in the Standards for Technological Literacy (ITEA, 2000), the actual delivery of biotechnology instruction in TE classrooms has not realized broad implementation. Previous studies have recognized this issue and called for systematic research to identify key factors affecting the implementation of biotechnology instruction in secondary school level TE classrooms.  The purpose of this study is to identify the key factors affecting the implementation of biotechnology instruction in secondary level TE classrooms and establish predictive values for the identified factors. This study, which employs a research design grounded in both Rogersâ   Diffusion Theory (2003) and Eccles Expectancy-Value Theory (2005), was conducted to address this implementation issue. This study involved the administration of a composite on-line instrument to collect demographic, attitudinal, motivational, and open-ended data related to the phenomena under investigation. Data collected from the on-line composite survey were analyzed through statistical (descriptive, independent t-tests, correlations, hierarchical multiple regressions) and thematic analysis. A total of 395 secondary school TE teachers across the five selected states (Virginia, New York, Connecticut, New Jersey, and Pennsylvania) participated in this study.<p> Analyses of the data led to the following conclusions. Insufficient implementation and preparation toward teaching biotechnology presented in this study are consistent with the low level of implementation of biotechnology instruction in TE classrooms revealed through prior studies. In addition, TE teachersâ   motivation (expectancy, value, and cost), their preparation (pre-service courses and/or in-service PD), and infrastructure are all significant predictors for the implementation of biotechnology instruction. Thus, it is necessary for the TE teachers to have a variety of opportunities and support for developing their self-belief toward teaching biotechnology and experiencing the usefulness and importance of teaching biotechnology. The findings and conclusions drawn from the data analysis provide implications to the TE teachers and pre-service teacher preparation institutes.",
  "description_provenance": [
    "Author Email: kwon06@vt.edu",
    "Advisor Email: msanders@vte.du",
    "Advisor Email: brettjones@vt.edu",
    "Advisor Email: mchang@vt.edu",
    "Advisor Email: jgwells@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:40Z (GMT). No. of bitstreams: 1 Kwon_ETD_Final.pdf: 1232453 bytes, checksum: c537508dfd091beef0fc6c755bda6c52 (MD5)   Previous issue date: 2009-05-21"
  ],
  "handle": "27926",
  "identifier_other": "etd-06012009-160619",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06012009-160619/",
  "identifier_uri": "http://hdl.handle.net/10919/27926",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kwon_ETD_Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Technology Teacher",
    "Biotechnology",
    "Technology Education"
  ],
  "title": "Key Factors Affecting the Implementation of Biotechnology Instruction  in Secondary School Level Technology Education Classrooms",
  "type": "Dissertation"
}