{
  "contributor_author": "Stiess, Timothy Stephen",
  "contributor_committeechair": "Kline, D. Earl",
  "contributor_committeemember": [
    "Prisley, Stephen P.",
    "Brinberg, David L.",
    "Bond, Brian H.",
    "Cook, Deborah F."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:12:39Z",
  "date_adate": "2010-06-16",
  "date_available": "2014-03-14T20:12:39Z",
  "date_issued": "2010-05-24",
  "date_rdate": "2010-06-16",
  "date_sdate": "2010-05-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Hardwood Industry in United States has been challenged by low-cost competition from overseas.  Although cost reduction strategies have had minimal success, the proximity of industry to the domestic market has large implications on a more customer-focused strategy.  The problem arises that individual companies and supply chains evolved based on the principles of economies of size and not on the flexibility to adapt to customer needs and changing resource constraints.  An increased rate at which material and information flows through the hardwood supply chains is the key to the industriesâ   ability to be customer-focused.  Information systems may offer benefits for the industry, but changes in material flow of a company or supply chain cannot necessarily be predicted when implementing information systems. It was hypothesized that by understanding the dynamics between information flow and material flow throughout the supply chain, performance improvement would be possible through more effective release and use of information.  A case study analysis of a hardwood supply chain was utilized to identify the effect of increased information flow on the material flow of the supply chain.  Value Stream Mapping was utilized to benchmark the current state of lead times of information flow and material flow.  System Dynamics was utilized to understand the relationships between the information flow and the material flow.  Finally, simulations were performed to identify the specific effects on material flow as increased information flow is released through different information strategies. The study showed that increased information flow between supply chain members increased material flow through the supply chain.  For a case study supply chain, an increase in information flow, through advanced knowledge of customer demand by a supplier, was found to reduce the inventory buffers throughout the supply chain by up to 38 percent and increase the total material flow through the supply chain by 10 percent.  In addition to the increased information flow caused by the advanced knowledge of demand (18 percent), information flow would increase (by an additional 7 percent) based on the reductions in buffer inventory within each company of the supply chain.",
  "description_provenance": [
    "Author Email: tstiess@vt.edu",
    "Advisor Email: prisley@vt.edu",
    "Advisor Email: kline@vt.edu",
    "Advisor Email: dbrinber@vt.edu",
    "Advisor Email: bbond@vt.edu",
    "Advisor Email: dcook@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:39Z (GMT). No. of bitstreams: 1 Stiess_TS_D_2010.pdf: 1389983 bytes, checksum: 50a138918efd27c162b18f40c21236e6 (MD5)   Previous issue date: 2010-05-24"
  ],
  "handle": "27922",
  "identifier_other": "etd-05312010-070749",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-05312010-070749/",
  "identifier_uri": "http://hdl.handle.net/10919/27922",
  "publisher": "Virginia Tech",
  "relation_haspart": "Stiess_TS_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "system dynamics",
    "hardwood",
    "information",
    "supply chain"
  ],
  "title": "Information Sharing in the Hardwood Supply Chain",
  "type": "Dissertation"
}