{
  "contributor_author": "Crawford, Andre J. D.",
  "contributor_committeechair": "Haller, Hans H.",
  "contributor_committeemember": [
    "Lutz, Nancy A.",
    "Parmeter, Christopher F.",
    "Ashley, Richard A.",
    "Dave, Chetan",
    "Peterson, Everett B."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:12:40Z",
  "date_adate": "2008-12-18",
  "date_available": "2014-03-14T20:12:40Z",
  "date_issued": "2008-05-19",
  "date_rdate": "2008-12-18",
  "date_sdate": "2008-06-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation comprises three essays on theoretical and empirical issues in industrial organization. Chapter 1 outlines the issues explored in the subsequent chapters and briefly describes their conclusions.      Chapter 2 explores how product differentiation impacts the incentive compatibility condition for firms to sustain implicit collusion in games of repeated interaction where, in contrast to previous studies, I focus on a market which is simultaneously vertically and horizontally differentiated. To achieve this objective, vertical differentiation is incorporated into an otherwise standard Hotelling framework. The ensuing mixed model of differentiation shows how the interrelationships between both forms of differentiation impact the incentives to collude, and is more general since it replicates previous findings throughout the literature.     In Chapter 3, a multiproduct oligopoly model admitting product differentiation and a discrete choice demand model are proposed and estimated to determine if patterns of anti-competitiveness exist across distinct segments of the European car market. This chapter focuses on the evolution of price competition at a finer level than has been studied with a view to empirically challenge the notion that the European car market is wholly anti-competitive. Empirical results show that firm conduct varies due to the intensity of within-segment competition among rival firms. There is evidence of softer competition in the larger, mid- to full-sized segments and more aggressive competition in the smaller, entry-level subcompact segment.     Chapter 4 represents a formal extension of the analysis in Chapter 3. In this chapter I examine the competitive structure of the U.S. automobile market using proprietary data comprising actual dealer-level transaction prices of several models of cars and light trucks sold in the domestic U.S. market between 2004 and 2007. The chapter is the first such study to employ consumer end-prices for automobiles in a structural New Empirical Industrial Organization (NEIO) framework. Empirical results reveal that there is more aggressive pricing in the light truck segments comprising minivans/SUVs and pickups, Bertrand pricing in the smaller, entry-level car segments, and softer competition in the full-size car segment. There is also a strong preference for domestically produced light trucks although consumers generally prefer to drive fuel efficient vehicles.",
  "description_provenance": [
    "Author Email: andrec@vt.edu",
    "Advisor Email: nlutz@nsf.gov",
    "Advisor Email: haller@vt.edu",
    "Advisor Email: parms@vt.edu",
    "Advisor Email: ashleyr@vt.edu",
    "Advisor Email: cdave@utdallas.edu",
    "Advisor Email: petrsone@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:40Z (GMT). No. of bitstreams: 1 andre2.pdf: 2286517 bytes, checksum: eb74d8e44507a7d1d98b76685983e688 (MD5)   Previous issue date: 2008-05-19"
  ],
  "handle": "27929",
  "identifier_other": "etd-06022008-193442",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06022008-193442/",
  "identifier_uri": "http://hdl.handle.net/10919/27929",
  "publisher": "Virginia Tech",
  "relation_haspart": "andre2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Collusion",
    "Spatial Duopoly",
    "Product Differentiation"
  ],
  "title": "Product Differentiation, Collusion, and Empirical Analyses of Market Power",
  "type": "Dissertation"
}