{
  "contributor_author": "Mitton, Felicity L.",
  "contributor_committeemember": [
    "Stephens, Robert S.",
    "Clum, George A. Jr.",
    "Sturgis, Ellie T."
  ],
  "contributor_department": "Clinical Psychology",
  "date_accessioned": "2014-03-14T20:12:40Z",
  "date_adate": "1997-02-07",
  "date_available": "2014-03-14T20:12:40Z",
  "date_issued": "1997-07-02",
  "date_rdate": "1998-02-07",
  "date_sdate": "1998-07-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Master of Science",
  "description_abstract": "The present studies attempted to clarify the constructs  of self-efficacy and outcome expectancies in relation  to college student drinking. In study 1, heavy-drinking  college students were asked for efficacy judgments for  limiting their heavy-drinking for increasing periods of  time (e.g. 1 day, 1 week, 1 month, etc.). Students  were also asked for efficacy judgments for throwing a  basketball into a hoop from increasing distances (e.g.  5 feet, 10 feet, 15 feet). Hypothetical incentives were  offered to change efficacy ratings for the first tasks on  each hierarchy (limiting drinking and basketball) to  which the participant had responded with a negative  efficacy judgments. Hypothetical incentives were also  offered for the most difficult task on each hierarchy.  As predicted, students changed efficacy ratings for  limiting drinking much more frequently. Additionally,  heavy-drinking college students indicated that money  persuaded them to alter their efficacy judgments for  limiting drinking, but lack of ability predominated as  the reason for not altering basketball task efficacy. In  study 2, the relationship between ability judgments,  willingness, and outcome expectancies was explored  by manipulating the wording of questionnaires  presented to heavy-drinking college students. Results  indicated that ability judgments were higher than  willingness judgments for limiting drinking. Willingness  appeared to be related to expected positive and  negative effects of consuming alcohol. Principle  components analysis indicated that ability and  willingness were distinct constructs. Results of both  studies are discussed in terms of the ongoing debate  between Albert Bandura and Irving Kirsch and the  need for a more clarity regarding efficacy and its  measurement.",
  "description_provenance": [
    "Author Email: felicity@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:40Z (GMT). No. of bitstreams: 1 THPROP6%20DOC.pdf: 163868 bytes, checksum: 502ac572e697c791a132f54c751717d1 (MD5)   Previous issue date: 1997-07-02"
  ],
  "handle": "27924",
  "identifier_other": "etd-0592073971961",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-0592073971961/",
  "identifier_uri": "http://hdl.handle.net/10919/27924",
  "publisher": "Virginia Tech",
  "relation_haspart": "THPROP6%20DOC.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "college student drinking",
    "self-efficacy",
    "outcome expectancies"
  ],
  "title": "Self-efficacy: Judgments of Ability or Willingness?",
  "type": "Dissertation"
}