{
  "contributor_author": "Sloan, Joel Andrew",
  "contributor_committeechair": "Filz, George M.",
  "contributor_committeemember": [
    "Collin, James G.",
    "Mitchell, James K.",
    "Westman, Erik Christian",
    "Green, Russell A."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:12:41Z",
  "date_adate": "2011-07-11",
  "date_available": "2014-03-14T20:12:41Z",
  "date_issued": "2011-05-26",
  "date_rdate": "2011-07-11",
  "date_sdate": "2011-06-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "When an embankment is to be constructed over ground that is too soft or compressible to adequately support the embankment, columns of strong material can be placed in the soft ground to provide the necessary support by transferring the embankment load to a firm stratum.  This technology is known as column-supported embankments (CSEs).  A geosynthetic-reinforced load transfer platform (LTP) or bridging layer may be constructed immediately above the columns to help transfer the load from the embankment to the columns.  There are two principal reasons to use CSEs: 1) accelerated construction compared to more conventional construction methods such as prefabricated vertical drains (PVDs) or staged construction, and 2) protection of adjacent facilities from distress, such as settlement of existing pavements when a roadway is being widened.  One of the most significant obstacles limiting the use of CSEs is the lack of a standard design procedure which has been properly validated.    This report and the testing described herein were undertaken to help resolve some of the uncertainty regarding CSE design procedures in light of the advantages of the CSE technology and potential for significant contributions to the Strategic Highway Research Program, which include accelerated construction and long-lived facilities.  Twelve design/analysis procedures are described in this report, and ratings are assigned based on information available in the literature.    A test facility was constructed and the facility, instrumentation, materials, equipment, and test procedures are described.  A total of 5 CSE tests were conducted with 2 ft diameter columns in a square array.  The first test had a column center-to-center spacing of 10 ft and the remaining four tests had center-to-center spacings of 6 ft.  The Adapted Terzaghi Method of determining the vertical stress on the geosynthetic reinforcement and the Parabolic Method of determining the tension in the geosynthetic reinforcement provide the best agreement with the test results.  The tests also illustrate the importance of soft soil support in CSE performance and behavior.    A generalized formulation of the Adapted Terzaghi Method for any column/unit cell geometry and two layers of embankment fill is presented, and two new formulations of the Parabolic Method for triangular arrangements is described.  A recommended design procedure is presented which includes use of the GeogridBridge Excel workbook described by Filz and Smith (2006, 2007), which was adapted for both square and triangular column arrangements.  GeogridBridge uses the Adapted Terzaghi Method and the Parabolic Method in a load-displacement compatibility design approach.  For completeness, recommended quality control and quality assurance procedures are also provided, and a new guide specification is presented.",
  "description_provenance": [
    "Author Email: sloanja@vt.edu",
    "Advisor Email: filz@vt.edu",
    "Advisor Email: jim@thecollingroup.com",
    "Advisor Email: jkm@vt.edu",
    "Advisor Email: ewestman@vt.edu",
    "Advisor Email: rugreen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:41Z (GMT). No. of bitstreams: 1 Sloan_JA_D_2011.pdf: 25707427 bytes, checksum: dcc7a357f0a043b9376b74a825a3adad (MD5)   Previous issue date: 2011-05-26"
  ],
  "handle": "27931",
  "identifier_other": "etd-06022011-152506",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06022011-152506/",
  "identifier_uri": "http://hdl.handle.net/10919/27931",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sloan_JA_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "bridging layers",
    "column-supported embankment",
    "geosynthetic reinforcement",
    "load transfer platform",
    "settlement"
  ],
  "title": "Column-Supported Embankments:  Full-Scale Tests and Design Recommendations",
  "type": "Dissertation"
}