{
  "contributor_author": "Byrd, Chad Michael",
  "contributor_committeechair": "Cox, David F.",
  "contributor_committeemember": [
    "Hochella, Michael F. Jr.",
    "Dillard, John G.",
    "Deck, Paul A.",
    "Davis, Richey M."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:12:41Z",
  "date_adate": "2003-06-11",
  "date_available": "2014-03-14T20:12:41Z",
  "date_issued": "2003-06-02",
  "date_rdate": "2004-06-11",
  "date_sdate": "2003-06-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The reactions of iodomethane, diiodomethane, and formaldehyde over stoichiometric, O-terminated, and Cl-terminated รยก-Cr2O3   surfaces, were studied by thermal desorption spectroscopy.  Adsorbed formaldehyde forms dioxymethylene species on the nearly-stoichiometric surface that react primarily above 600 K.  Dioxymethylene decomposes via a Cannizzaro-type process with dehydrogenation to formate, and hydrogenation to methoxide.  Methoxide hydrogenation produces methane and methanol near 670 K.  Formate decomposition occurs at 720 K, producing acetylene, carbon monoxide, carbon dioxide and formic acid.  The site requirements for these reactions are a cation/anion site pair.  When the surface cations are capped with Cl, the reactivity associated with dioxymethylene intermediates above 600 K is not observed.  At higher coverages, polymerization to paraformaldehyde is observed on both surfaces, and decomposition to formaldehyde is observed at 400 K in thermal desorption.  Iodomethane and diiodomethane are used as sources of methyl and methylene surface species, respectively.  Methyl fragments on the stoichiometric surface dehydrogenate to surface methylene and hydrogen as a rate limiting step to produce ethylene and methane at 505 K.  On the oxygen-terminated surface, the methyl fragments undergo dehydrogenation and coupling to ethylene at 425 K, undergo oxygen insertion to formaldehyde at 425 K, and produce carbon dioxide, formic acid, and water above 700 K from the dehydrogenation of formate.  Methylene fragments on the stoichiometric surface undergo diffusion limited coupling to ethylene at 390 to 490 K and produce methane at 520 K from dehydrogenation.  On the oxygen-terminated surface, methylene undergoes oxygen insertion to produce formaldehyde at 450 K, produce carbon monoxide, formaldehyde, and water at 695 K from dioxymethylene dehydrogenation, and produce carbon dioxide, formic acid, and water above 700 K from the dehydrogenation of formate.",
  "description_provenance": [
    "Author Email: chadmbyrd@yahoo.com",
    "Advisor Email: hochella@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: pdeck@chemserver.chem.vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:41Z (GMT). No. of bitstreams: 1 chadmbyrd.pdf: 1951443 bytes, checksum: e7b721f3bfa1db9ac263efc9d621f44d (MD5)   Previous issue date: 2003-06-02"
  ],
  "handle": "27933",
  "identifier_other": "etd-06032003-121242",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06032003-121242/",
  "identifier_uri": "http://hdl.handle.net/10919/27933",
  "publisher": "Virginia Tech",
  "relation_haspart": "chadmbyrd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "methyl",
    "carbene",
    "methylene",
    "formaldehyde",
    "halocarbons"
  ],
  "title": "Reaction chemistry of C1 hydrocarbon fragments and oxygenates on Cr2O3 (1012).",
  "type": "Dissertation"
}