{
  "contributor_author": "Wilson, Natascha Monique",
  "contributor_committeechair": "Bodenhorn, Nancy E.",
  "contributor_committeemember": [
    "Hutchins, Marilyn K.",
    "Piercy, Fred P.",
    "Bird, Gloria W.",
    "Brown, Launcelot",
    "Lawson, Gerard F."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:12:41Z",
  "date_adate": "2004-09-13",
  "date_available": "2014-03-14T20:12:41Z",
  "date_issued": "2004-05-31",
  "date_rdate": "2005-09-13",
  "date_sdate": "2004-06-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examines data from a modified version of the Core Alcohol and Drug Survey to establish the frequency use of alcohol, tobacco, marijuana, and stimulants, which were the four variables used to denote substance use.  This study also investigates the consequences experienced as a result of substance use among female graduate students (n = 266) in mental health majors, including Counseling Education (n=164) and Other Mental Health majors (n=102). Eight universities located in the southeastern region of the United States participated in the study.  In addition to measuring substance use, the survey also provided a general description of the participants. The participants, who averaged 24.85 years in age, were 48.9% (n=130) Caucasian and 51.1% (n=136) African American. In terms of marital status, were 38.7% (n=103) the respondents single, 18.8% (n=50) in a committed relationship but not married, 28.2% (n=75) married, and 13.5% (n=36) married, but with an absentee spouse. A majority of the respondents (n=178) were employed in a full time capacity. An ensuing analysis of the data revealed generalized substance use among female graduate students in mental health majors, with alcohol being the most prevalently used substance among the four. Demographic variables found to be significant in these findings were ethnicity, age, major, marital status and living arrangements. When examining consequences experienced as a result of tobacco, alcohol, marijuana and stimulants use during the past year, the majority of participants did not experience any consequences; frequencies indicated small percentages of consequences experienced by graduate students and are reported herein. Implications for the profession and recommendations for future research are suggested.",
  "description_provenance": [
    "Author Email: natascha@vt.edu",
    "Advisor Email: dhutch@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: birdfcd@vt.edu",
    "Advisor Email: brownli@duq.edu",
    "Advisor Email: glawson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:41Z (GMT). No. of bitstreams: 1 finaldissertation.pdf: 540803 bytes, checksum: 2eee69caeed84528bc128d78b14e98a5 (MD5)   Previous issue date: 2004-05-31"
  ],
  "handle": "27934",
  "identifier_other": "etd-06032004-114840",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06032004-114840/",
  "identifier_uri": "http://hdl.handle.net/10919/27934",
  "publisher": "Virginia Tech",
  "relation_haspart": "finaldissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Helping Profession",
    "Mental Health",
    "Counselor Education"
  ],
  "title": "Substance Use Among Female Graduate Students",
  "type": "Dissertation"
}