{
  "contributor_author": "McFadden, Cara W",
  "contributor_committeemember": [
    "Welfare, Laura E.",
    "Janosik, Steven M.",
    "Bodenhorn, Nancy E.",
    "Skaggs, Gary E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:12:40Z",
  "date_adate": "2010-07-12",
  "date_available": "2014-03-14T20:12:40Z",
  "date_issued": "2010-05-27",
  "date_rdate": "2010-07-12",
  "date_sdate": "2010-06-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract \tThe purpose of this study was to develop an instrument to measure the sense of competence of traditional age college students across the dimensions that define the construct.  The Sense of Competence Scale-Revised (SCS-R) was developed to provide a measure of Chickering창  s (1969) first vector, an important psychosocial construct.  Administrators can use data from the instrument to modify an institution창  s academic and social environment to enhance the development of the intellectual, physical, and interpersonal competencies of college students. During the development and validation, various aspects of the SCS-R were examined in accordance with the validity framework outlined by Messick (1995).  According to Messick (1995), the validity of measures can be examined in terms of six forms of evidence; content, substantive, structural, generalizability, external and consequential.  The six forms of evidence function as general standards for all educational measurement (Messick, 1995).  During the study the content aspect of validity was addressed through the creation of concept maps and test blueprints.  In addition, the content aspect of validity was addressed by creating and selecting items by reviewing the literature and hosting brainstorming sessions, items were then reviewed by student development theory experts, pilot tested, field tested and then items with high technical quality were selected for the final instrument.  The substantive aspect of validity was addressed through an analysis of item rating scale functioning, person fit to the measurement scales, and item difficulty.  The structural aspect of validity was addressed by evidence of the instrument창  s dimensionality.  The generalizability aspect of validity was addressed through an analysis of item/person reliability.   The evidence generated from the study suggested that the chosen items for the SCS-R provide reliable and valid estimates of a student창  s personal assessment of their intellectual, physical and interpersonal abilities.",
  "description_provenance": [
    "Author Email: cmcfadd@vt.edu",
    "Advisor Email: welfare@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:40Z (GMT). No. of bitstreams: 1 McFadden_CM_D_2010.pdf: 1251359 bytes, checksum: 476bd7b90ce2d1d69b3985ea9e471915 (MD5)   Previous issue date: 2010-05-27"
  ],
  "handle": "27930",
  "identifier_other": "etd-06022010-123413",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06022010-123413/",
  "identifier_uri": "http://hdl.handle.net/10919/27930",
  "publisher": "Virginia Tech",
  "relation_haspart": "McFadden_CM_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "instrument validation",
    "student development theory",
    "instrument development"
  ],
  "title": "Development and Validation of the Sense of Competence Scale-Revised (SCS-R)",
  "type": "Dissertation"
}