{
  "contributor_author": "George, Jacob",
  "contributor_committeechair": "Simpson, Roger L.",
  "contributor_committeemember": [
    "Devenport, William J.",
    "Schetz, Joseph A.",
    "Mason, William H.",
    "Neu, Wayne L."
  ],
  "contributor_department": "Aerospace and Ocean Engineering",
  "date_accessioned": "2014-03-14T20:12:41Z",
  "date_adate": "2005-07-15",
  "date_available": "2014-03-14T20:12:41Z",
  "date_issued": "2005-02-14",
  "date_rdate": "2007-07-15",
  "date_sdate": "2005-06-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The present study deals with the effects of sparsely distributed three-dimensional elements on two-dimensional (2-D) and three-dimensional (3-D) turbulent boundary layers (TBL) such as those that occur on submarines, ship hulls, etc.  This study was achieved in three parts: Part 1 dealt with the cylinders when placed individually in the turbulent boundary layers, thereby considering the effect of a single perturbation on the TBL; Part 2 considered the effects when the same individual elements were placed in a sparse and regular distribution, thus studying the response of the flow to a sequence of perturbations; and in Part 3, the distributions were subjected to 3-D turbulent boundary layers, thus examining the effects of streamwise and spanwise pressure gradients on the same perturbed flows as considered in Part 2. The 3-D turbulent boundary layers were generated by an idealized wing-body junction flow. Detailed 3-velocity-component Laser-Doppler Velocimetry (LDV) and other measurements were carried out to understand and describe the rough-wall flow structure.  The measurements include mean velocities, turbulence quantities (Reynolds stresses and triple products), skin friction, surface pressure and oil flow visualizations in 2-D and 3-D rough-wall flows for Reynolds numbers, based on momentum thickness, greater than 7000.  Very uniform circular cylindrical roughness elements of 0.38mm, 0.76mm and 1.52mm height (k) were used in square and diagonal patterns, yielding six different roughness geometries of rough-wall surface.  For the 2-D rough-wall flows, the roughness Reynolds numbers, based on the element height (k) and the friction velocity, range from 26 to 131.  Results for the 2-D rough-wall flows reveal that the velocity-defect law is similar for both smooth and rough surfaces, and the semi-logarithmic velocity-distribution curve is shifted by an amount depending on the height of the roughness element, showing that this amount is a function of roughness Reynolds number and the wall geometry.  For the 3-D flows, the data show that the surface pressure gradient is not strongly influenced by the roughness elements. In general, for both 2-D and 3-D rough-wall TBL, the differences between the two roughness patterns (straight and diagonal), as regards the mean velocities and the Reynolds stresses, are limited to about 3 roughness element heights from the wall. The study on single elements revealed that the separated shear layers emanating from the top of the elements form a pair of counter rotating vortices that dominate the downstream flow structure.  These vortices, termed as the roughness top vortex structure (RTVS), in conjunction with mean flow, forced over and around the elements, are responsible for the production of large Reynolds stresses in the neighborhood of the element height aft of the elements.  When these elements are placed in a distribution, the effects of RTVS are not apparent.  The roughness elements create a large region of back flow behind them which is continuously replenished by faster moving fluid flowing through the gaps in the rough-wall.  The fluid in the back flow region moves upward as low speed ejections where it collides with the inrushing high speed flow, thus, leading to a strong mixing of shear layers.  This is responsible for the generation of large levels of turbulent kinetic energy (TKE) in the vicinity of the element height which is transported, primarily, by turbulent diffusion.  As regards the 3-D rough-wall TBL, the effect of flow three-dimensionality is seen in the large skewing of the distributions of mean velocities, Reynolds stresses and TKE, aft of the elements.  In general, the regions of large TKE production-rates seem to propagate in the direction of the local velocity vector at the element height.  The data-sets also enable the extraction of the turbulent flow structure to better describe the flow physics of these rough-wall turbulent boundary layers.",
  "description_provenance": [
    "Author Email: george@aoe.vt.edu",
    "Advisor Email: simpson@aoe.vt.edu",
    "Advisor Email: devenport@aoe.vt.edu",
    "Advisor Email: ptiger@vt.edu",
    "Advisor Email: whmason@vt.edu",
    "Advisor Email: neu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:41Z (GMT). No. of bitstreams: 1 dissertation-george.pdf: 7088208 bytes, checksum: 8e8ae84e6d07459e79715f3c1196c42d (MD5)   Previous issue date: 2005-02-14"
  ],
  "handle": "27935",
  "identifier_other": "etd-06032005-085301",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06032005-085301/",
  "identifier_uri": "http://hdl.handle.net/10919/27935",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation-george.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Individual Protuberances",
    "2-D Rough-Wall Turbulent Boundary Layers",
    "3-D Roughness",
    "3-D Rough-Wall Turbulent Boundary Layers",
    "LDV"
  ],
  "title": "Structure of 2-D and 3-D Turbulent Boundary Layers with Sparsely Distributed Roughness Elements",
  "type": "Dissertation"
}