{
  "contributor_author": "Henley, William F.",
  "contributor_committeechair": "Neves, Richard J.",
  "contributor_committeemember": [
    "Saacke, Richard G.",
    "Caceci, Thomas",
    "Smith, Stephen A.",
    "Lemly, A. Dennis"
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:12:41Z",
  "date_adate": "2002-06-06",
  "date_available": "2014-03-14T20:12:41Z",
  "date_issued": "2002-05-10",
  "date_rdate": "2003-06-06",
  "date_sdate": "2002-06-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "To determine the effects of different algal diets on freshwater mussels, tissues of Elliptio complanata were sampled for physiological, somatic, and gametogenic condition from August 1999 to May 2000. Treatments included mussels fed Scenedesmus quadricauda (S), Neochloris oleoabundans (N), a no feed treatment (NF), and a reference group of mussels from the Nottoway River (NR), Virginia. The levels of protein and glucose differed among treatments (p<0.0001), but glycogen and percentage tissue moisture did not (p>0.17). Production of ripe and developing gametes differed significantly among treatments (p=0.001), but stage of gamete development did not (p=0.70). Lipid levels and muscle fiber areas of treatment groups differed significantly (p<0.0001). Results of the feeding trial indicate that S. quadricauda is a suitable feed for E. complanata, but future experiments should identify algal species higher in carbohydrates for a mixed algal diet. To determine sex and stage of gametogenesis, tissue histological sections from gonads of Villosa iris and Utterbackia imbecillis were evaluated. Occurrences of oogenic, spermatogenic, and hermaphroditic tissues were summarized in frequency tables. Visceral sites from which similar tissues were collected from conspecific specimens were evaluated for gametogenic stage. Sex was accurately determined in the central, visceral portion V. iris and female regions of U. imbecillis; and spermatogenic tissue was consistent in the dorsal-anterior areas of U. imbecillis. These areas also provided accurate determination of gamete stage in specimens. Reproductive asynchrony was observed among males and females (p<0.02). Male regions of U. imbecillis showed gamete stage characterized by mature and developing spermatogenic tissue, while 2 groups of mussels were showed oogenic development characterized by mature oocytes and resorption of gametes. Male V. iris showed early gamete development without mature spermatozoa, and 2 groups of female V. iris showed mature and developing gametes and resorption of gametes. Protocols for biopsy tissue collection from selected visceral areas were developed for U. imbecillis and V. iris for sex determination and staging of gametogenesis. The application of this biopsy protocol should be considered population specific, and protocols appropriate for other populations and species should be developed with methods of this study.",
  "description_provenance": [
    "Author Email: whenley@vt.edu",
    "Advisor Email: saacke@vt.edu",
    "Advisor Email: elitist@vt.edu",
    "Advisor Email: stsmith7@vt.edu",
    "Advisor Email: dlemly@vt.edu",
    "Advisor Email: mussel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:41Z (GMT). No. of bitstreams: 1 HenleyDissertationPDF.pdf: 4118460 bytes, checksum: 91741212386092f9a935f7136985a103 (MD5)   Previous issue date: 2002-05-10"
  ],
  "handle": "27932",
  "identifier_other": "etd-06032002-224300",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06032002-224300/",
  "identifier_uri": "http://hdl.handle.net/10919/27932",
  "publisher": "Virginia Tech",
  "relation_haspart": "HenleyDissertationPDF.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "freshwater mussels",
    "hermaphroditism",
    "diet",
    "Unionidae",
    "gametogenesis"
  ],
  "title": "Evaluation of Diet, Gametogenesis, and Hermaphroditism in Freshwater Mussels (Bivalvia: Unionidae)",
  "type": "Dissertation"
}