{
  "contributor_author": "Peterson, Tina Marie Loane",
  "contributor_committeechair": "Luckhart, Shirley",
  "contributor_committeemember": [
    "Tu, Zhijian Jake",
    "Larson, Timothy J.",
    "Gillaspy, Glenda E.",
    "Kennelly, Peter J."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:12:43Z",
  "date_adate": "2005-06-27",
  "date_available": "2014-03-14T20:12:43Z",
  "date_issued": "2005-05-23",
  "date_rdate": "2008-06-27",
  "date_sdate": "2005-06-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Both vertebrates and anopheline mosquitoes inhibit <i>Plasmodium</i> spp. (malaria parasite) development via induction of nitric oxide (â ¢NO) synthase. Expression of <i>Anopheles stephensi</i> â ¢NO synthase (<i>AsNOS</i>) is induced in the midgut epithelium beginning at 6 h following a <i>Plasmodium berghei</i>-infected blood meal. â ¢NO reacts readily with other biocompounds forming a variety of reactive nitrogen intermediates (RNIs) that may impose a nitrosative stress. These RNIs are proposed to be responsible for the AsNOS-dependent inhibition of <i>Plasmodium</i> development.   <p>In my studies, I identified several RNIs that are induced in the blood-filled midgut in response to <i>Plasmodium</i> infection. Stable end products of â ¢NO (NO<SUB>3</SUB><SUP>-</SUP> and NO<SUB>2</SUB><SUP>-</SUP>), measured using a modified Griess assay, are elevated in infected midguts at 24 h post-blood meal (pBM). Further studies using chemical reduction-chemiluminescence with Hg displacement showed that infected midguts contained elevated levels of potentially toxic higher oxides of nitrogen (NO<SUB>x</SUB>), but <i>S</i>-nitrosothiol (SNO) and nitrite levels did not differ between infected and uninfected midguts at 12.5 and 24 h pBM. Thus, nitrates contributed to elevated NO<SUB>x</SUB> levels. SNO-biotin switch westerns indicated that <i>S</i>-nitrosated midgut proteins change over the course of blood meal digestion, but not in response to infection. Photolysis-chemiluminescence was used to release and detect bound â ¢NO from compounds in blood-filled midguts dissected from 0-33 h pBM. Results showed increased â ¢NO levels in <i>Plasmodium</i>-infected midgut lysates beginning at 8 h, with significant increases at 12.5-13.5 h and 24-25.5 h pBM and peak levels at 20-24 h. Photolyzed â ¢NO is derived from SNOs and metal nitrosyls. Since SNO concentrations did not change in response to infection, I proposed that metal nitrosyls, specifically Fe nitrosyl hemoglobin (nitrosylHb) based on the concentration of hemoglobin, were elevated in the infected midgut.  <p>At 12-24 h pBM, levels of midgut RNIs in infected mosquitoes were typical of levels measured during mammalian septic inflammation. The inverse relationship between AsNOS activity and parasite abundance indicates that nitrosative stress has a detrimental effect on parasite development. However, nitrosative stress may impact mosquito tissues as well in a manner analogous to mammalian tissue damage during inflammation. Elevated levels of nitrotyrosine (NTYR), a marker for nitrosative stress in many mammalian disease states, were detected in tissues of parasite-infected <i>A. stephensi</i> at 24 h pBM. Greater nitration of tyrosine residues was detected in the blood bolus, midgut epithelium, eggs and fat body.  <p>In the midgut, Hb remained in an oxygenated state for the duration of blood digestion. The reaction between â ¢NO and oxyhemoglobin (oxyHb) can result in the formation of nitrate and methemoglobin (metHb). Although nitrate levels were elevated in response to parasite infection, there was little to no metHb present in the mosquito midgut. The simultaneous presence of nitrates, nitrosylHb, oxyHb, and NTYR, together with a lack of elevated nitrites and metHb, suggested that alternative reaction mechanisms involving â ¢NO had occurred in the reducing environment of the midgut. In addition, I proposed that nitroxyl and peroxynitrite participated in reactions that yielded observed midgut RNIs.   <p>To cope with the parasite-induced nitrosative stress, cellular defenses in the mosquito may be induced to minimize self damage. I proposed that peroxiredoxins (Prx), enzymes that can detoxify peroxides and peroxynitrite, may protect <i>A. stephensi</i> from nitrosative stress. Six Prx genes were identified in the <i>A. gambiae</i> genome based on homology with known <i>D. melanogaster</i> Prxs. I identified one <i>A. stephensi</i> Prx, AsPrx, that shared 78% amino acid identity with a <i>D. melanogaster</i> 2-Cys Prx known to protect fly cells against various oxidative stresses. <i>AsPrx</i> was expressed in the midgut epithelium and is encoded by a single-copy, intronless gene. Quantitative RT-PCR analyses confirmed that induction of <i>AsPrx</i> expression in the midgut was correlated with malaria parasite infection and nitrosative stress. To determine whether AsPrx could protect against RNI- and ROS-mediated cell death, transient transfection protocols were established for AsPrx overexpression in <i>D. melanogaster</i> (S2) and <i>A. stephensi</i> (MSQ43) cells and for <i>AsPrx</i> gene silencing using RNA interference in MSQ43 cells. Viability assays in MSQ43 cells showed that AsPrx conferred protection against hydrogen peroxide, â ¢NO, nitroxyl and peroxynitrite. These data suggested that the â ¢NO-mediated defense response is toxic to both host and parasite. However, AsPrx may shift the balance in favor of the mosquito.",
  "description_provenance": [
    "Author Email: tloane@vt.edu",
    "Advisor Email: jaketu@vt.edu",
    "Advisor Email: tilarson@vt.edu",
    "Advisor Email: sluckhart@ucdavis.edu",
    "Advisor Email: gillaspy@vt.edu",
    "Advisor Email: pjkennel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:43Z (GMT). No. of bitstreams: 2 TLMP_(c)_permissions.pdf: 863231 bytes, checksum: 4ec210903fc141193740ac7f2941842b (MD5) TMLPeterson_ETDv2.pdf: 2494440 bytes, checksum: 2c24763eae822923b1f8da46f5da80d9 (MD5)   Previous issue date: 2005-05-23"
  ],
  "handle": "27943",
  "identifier_other": "etd-06042005-204409",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06042005-204409/",
  "identifier_uri": "http://hdl.handle.net/10919/27943",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "TLMP_(c)_permissions.pdf",
    "TMLPeterson_ETDv2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "malaria",
    "nitric oxide",
    "<i>Anopheles</i>",
    "<i>Plasmodium</i>",
    "biochemistry",
    "peroxiredoxin"
  ],
  "title": "<i>Plasmodium</i>-Induced Nitrosative Stress in <i>Anopheles stephensi</i>: The Cost of Host Defense",
  "type": "Dissertation"
}