{
  "contributor_author": "Ozdemir, Devrim",
  "contributor_committeecochair": [
    "Doolittle, Peter E.",
    "Moore, David Michael"
  ],
  "contributor_committeemember": [
    "Brill, Jennifer M.",
    "Barksdale, Mary Alice"
  ],
  "contributor_department": "Learning Sciences and Technologies",
  "date_accessioned": "2014-03-14T20:12:44Z",
  "date_adate": "2009-06-25",
  "date_available": "2014-03-14T20:12:44Z",
  "date_issued": "2009-05-19",
  "date_rdate": "2009-06-25",
  "date_sdate": "2009-06-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to investigate the effects of context-dependency of seductive details on recall and transfer in multimedia learning environments. Two experiments were conducted. In Experiment 1, the purpose was to identify context-dependent vs. context-independent seductive details in a lightning animation. Seductive details were considered as interesting yet irrelevant sentences in the narration of lightning animation. Sixty-seven undergraduate students participated in Experiment 1 and assigned interestingness scores to the 28 content irrelevant sentences. Participants were assigned to two different groups, context-dependent seductive details group (CDSD) and context-independent seductive details group (CISD). Participants in the CDSD group assigned interestingness scores after watching a lightning animation to be familiarized with the context of lightning formation. Participants in the CISD group watched a historical inquiry animation as a distraction task before assigning interestingness scores. The results of Experiment 1 revealed that 13 of 28 sentences in the lightning formation text were seductive details according to participants of the study. Ultimately, 6 of the 13 seductive details were determined to be context-dependent and 7 were determined to be seductive details were context-independent.  The purpose of Experiment 2 was to investigate the effects of context-dependency of seductive details on recall and transfer in multimedia learning environments. Undergraduate students (n = 184) were randomly assigned into four groups. Participants in all groups watched a lightning animation, and performed a recall and a transfer task. The first group watched an animation that did not include any seductive details. The second group watched the animation with context-dependent seductive details only. The third group watched the animation with context-independent seductive details only. The last group watched the animation with both types of seductive details. A 2x2 ANOVA for both recall and transfer, and contrast analyses were conducted to determine the effects of context-dependency of seductive details on recall and transfer. The results indicated that there was no significant effect of context-dependency of seductive details on recall or transfer. The findings are discussed in the context of the related literature and directions for future research are suggested.",
  "description_provenance": [
    "Author Email: dozdemir@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:44Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 1874702 bytes, checksum: 20971bfc0cda98d5f5983a2fae2b4830 (MD5)   Previous issue date: 2009-05-19"
  ],
  "handle": "27948",
  "identifier_other": "etd-06042009-092618",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06042009-092618/",
  "identifier_uri": "http://hdl.handle.net/10919/27948",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "multimedia learning",
    "situational interest",
    "seductive details",
    "context-dependency",
    "coherence principle"
  ],
  "title": "The Effects of Context-Dependency of Seductive Details on Recall and Transfer in a Multimedia Learning Environment",
  "type": "Dissertation"
}