{
  "contributor_author": "Bashur, Christopher Alan",
  "contributor_committeechair": "Goldstein, Aaron S.",
  "contributor_committeemember": [
    "Freeman, Joseph W.",
    "Baird, Donald G.",
    "Dahlgren, Linda A.",
    "Wilkes, Garth L."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:12:44Z",
  "date_adate": "2009-06-23",
  "date_available": "2014-03-14T20:12:44Z",
  "date_issued": "2009-04-21",
  "date_rdate": "2009-06-23",
  "date_sdate": "2009-06-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The overall goal of this research project is to develop methods for producing a tissue engineered ligament.  The envisioned tissue engineering strategy involves three steps: seeding bone marrow stromal cells (BMSCs) onto electrospun scaffolds, processing them into cords that allow cell infiltration, and conditioning them with uniaxial cyclic stretch.  These steps were addressed in three complimentary studies to establish new methods to engineer a tissue with ligament-like cells depositing organized extracellular matrix (ECM).  In the first study scaffold topographies were systematically varied to determine topographies that induce cells to orient and differentiate into ligament-like cells in static culture.  Scaffolds 창   electrospun from poly (ester-urethane urea) (PEUUR) with different fiber diameters degrees of fiber alignments 창   were biocompatible and supported cell growth.  Topographic cues guided cell alignment, and cell elongation increased with increasing fiber alignment.  Finally, expression of the ligament-like markers collagen type I and decorin were enhanced on the smallest fiber diameters compared to larger diameters.  In the second study BMSCs 창   seeded onto aligned electrospun PEUUR scaffolds 창   were cyclically stretched to determine the effect of dynamic mechanical stimulation on BMSC alignment and differentiation.  BMSCs remained aligned parallel to the direction of fiber alignment and expressed ligament markers (e.g. collagen type I, decorin, scleraxis, and tenomodulin) on electrospun scaffolds after the application of stretch.  However, the cyclic stretch regimen was not able to enhance expression of ECM components.  In the third study techniques were developed to produce more clinically relevant constructs with improved cell infiltration.  Specifically, a co-electrospun scaffold composed of two well integrated components was developed to create larger pores.  The scaffold was also embedding in a photo-crosslinkable hydrogel to prevent the fibers from collapsing.  These results demonstrate the feasibility of making a tissue engineered ligament by seeding BMSCs on an aligned, co-electrospun scaffold with submicron diameter fibers and then applying cyclic mechanical stretch.  Future work will involve combining these three steps to achieve materials suitable for in vivo testing.",
  "description_provenance": [
    "Author Email: bashurc@vt.edu",
    "Advisor Email: jwfreeman@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: lad11@vt.edu",
    "Advisor Email: goldst@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:44Z (GMT). No. of bitstreams: 1 Chris_Bashur_dissertation.pdf: 5789783 bytes, checksum: 723b19d73ae5d1480fe3bb65437d4f5a (MD5)   Previous issue date: 2009-04-21"
  ],
  "handle": "27949",
  "identifier_other": "etd-06042009-105736",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06042009-105736/",
  "identifier_uri": "http://hdl.handle.net/10919/27949",
  "publisher": "Virginia Tech",
  "relation_haspart": "Chris_Bashur_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "contact guidance",
    "morphology",
    "bioreactor",
    "co-electrospinning",
    "tissue engineering",
    "electrospinning"
  ],
  "title": "Effect of Electrospun Mesh Diameter, Mesh Alignment, and Mechanical Stretch on Bone Marrow Stromal Cells for Ligament Tissue Engineering",
  "type": "Dissertation"
}