{
  "contributor_author": "Cuyno, Leah Marquez",
  "contributor_committeemember": [
    "Rajotte, Edwin G.",
    "Taylor, Daniel B.",
    "Rola, Agnes",
    "Reaves, Dixie Watts",
    "Norton, George W."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:12:42Z",
  "date_adate": "1999-06-08",
  "date_available": "2014-03-14T20:12:42Z",
  "date_issued": "1999-04-30",
  "date_rdate": "2000-06-08",
  "date_sdate": "1999-06-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<b><center>AN ECONOMIC EVALUATION OF THE HEALTH AND ENVIRONMENTAL BENEFITS OF THE INTEGRATED PEST MANAGEMENT PROGRAM (IPM CRSP) IN THE PHILIPPINES<p></b></center> <p> <p>  <center>Leah Concepcion Marquez Cuyno<p></center> <p> <p>  <center>(ABSTRACT)<p></center>    Concern about externalities associated with pesticide use in developing countries has motivated the development of integrated pest management (IPM) programs in these areas.  In the Philippines, the IPM Collaborative Research Support Program (IPM CRSP) was established to specifically address the widespread misuse of pesticides in the rice-vegetable systems of Nueva Ecija, one of the major rice and onion producing regions in the country.  IPM CRSP initiatives include research on the optimal use of pesticides, complementary weed control strategies, and alternative cultural and biological controls.  If successful, the program should generate benefits that can be measured in economic terms.  These benefits include improvements in water quality, food safety, pesticide applicator safety, and long run sustainability of pest management systems.<p>  This study was designed to measure the health and environmental benefits of the IPM CRSP in the Philippines.  A survey questionnaire was administered to 176 onion farmers in five villages in Nueva Ecija to identify farm and farmer characteristics, pesticide usage, pest management practices, perceptions about pesticide hazards, awareness of IPM strategies, and willingness to adopt specific technologies being developed under the IPM CRSP.  In addition, a contingent valuation survey was used to elicit farmers' willingness-to-pay to avoid risks posed by pesticides to different environmental categories.<p>  A comprehensive economic measure of the benefits of IPM CRSP was derived by 1) assessing the hazards associated with pesticide usage, 2) providing an ex ante measure of program impacts on pesticide usage, 3) predicting IPM adoption rates, and 4) estimating society's willingness-to-pay to avoid the health and environmental risks from pesticides under Philippine conditions.  A measure of the amount of risks avoided as a result of IPM CRSP adoption was combined with farmers' willingness to pay bids for risk avoidance to derive a monetary value of the program benefits.  The estimated economic benefits of the IPM CRSP to farmer residents in 5 villages in Nueva Ecija amount to 230,912.00 pesos for one onion season.",
  "description_provenance": [
    "Author Email: lcuyno@vt.edu",
    "Advisor Email: ed_rajotte@agcs.cas.psu.edu",
    "Advisor Email: taylord@vt.edu",
    "Advisor Email: arola@laguna.net",
    "Advisor Email: dixie@vt.edu",
    "Advisor Email: gnorton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:42Z (GMT). No. of bitstreams: 8 ch1.pdf: 24686 bytes, checksum: a2eb3c8cb3ba1023408d808c46892f44 (MD5) front.pdf: 21510 bytes, checksum: db4cd586223caa33cc8039deb7d0ebb4 (MD5) instrt.pdf: 22616 bytes, checksum: 246c074c64d56eadda04de5b7153229c (MD5) ch3.pdf: 182316 bytes, checksum: 7a92cd7e61007dfd513e3962cfd57626 (MD5) ch2.pdf: 35112 bytes, checksum: 5d9ec63e30542133687a9db8ffd3f045 (MD5) ch5.pdf: 178503 bytes, checksum: 8ead141b96aefb3aea74addb23e2d4a0 (MD5) vita.pdf: 4369 bytes, checksum: 0a9f0c2aa1169f759bad5f146cab0b18 (MD5) ch4.pdf: 22130 bytes, checksum: 05f55e06b89f572d79ff4e686333645e (MD5)   Previous issue date: 1999-04-30"
  ],
  "handle": "27941",
  "identifier_other": "etd-060399-163114",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-060399-163114/",
  "identifier_uri": "http://hdl.handle.net/10919/27941",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ch1.pdf",
    "front.pdf",
    "instrt.pdf",
    "ch3.pdf",
    "ch2.pdf",
    "ch5.pdf",
    "vita.pdf",
    "ch4.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "IPM",
    "environmental valuation",
    "pesticides",
    "impact assessment"
  ],
  "title": "AN ECONOMIC EVALUATION OF THE HEALTH AND ENVIRONMENTAL BENEFITS OF THE INTEGRATED PEST MANAGEMENT PROGRAM (IPM CRSP) IN THE PHILIPPINES",
  "type": "Dissertation"
}