{
  "contributor_author": "Goodwin, Clarice Evans",
  "contributor_committeechair": "Sawyers, Janet K.",
  "contributor_committeemember": [
    "Rogers, Cosby Steele",
    "McCollum, Eric E.",
    "Benningfield, Anna Beth",
    "Piercy, Fred P.",
    "Skaggs, Gary E."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:12:45Z",
  "date_adate": "2003-08-04",
  "date_available": "2014-03-14T20:12:45Z",
  "date_issued": "2003-04-30",
  "date_rdate": "2003-08-04",
  "date_sdate": "2003-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Using a mixed methodology, the effectiveness of an 8-week modification of Landrethâ  s (1991) 10-week group filial therapy training model was investigated with parents (n = 5) court-ordered for remedial parenting services due to physical abuse and/or neglect of their school-age children.  A comparison group (n = 3) concurrently received an 8-week parent education course.  Three primary questions were explored.  Do filial therapy group participants demonstrate a greater decrease in child physical abuse potential and parenting stress following training when compared to parent education group participants?  In addition, do filial therapy group participants show evidence of stronger parent-child relationships following training when compared to participants in the parent education group?  Pre- and post-measures were utilized, and anecdotal and qualitative data were also collected.  Following the analysis of both the quantitative and qualitative data, it was determined that the group quantitative results detracted from the richness of the qualitative findings, and the former were subsequently dropped.  Instead, individual pre- and posttest quantitative scores, along with the anecdotal data, were compiled to create participant profiles that provided additional descriptive information to the emergent focus group themes.  Due to the size of the sample (N = 8), findings were only preliminary and merit further study.  Participants demonstrated social desirability in their assessment responses; therefore, it is recommended that qualitative or mixed methodology, as well as multiple measures of each construct, be incorporated to combat this phenomenon in future studies with this population.  Results of this study further suggested that there are clinical benefits to utilizing a mixed sample of both court- and self-referred participants.  In addition, the court-mandated population is heterogeneous and requires multiple treatment options coupled with screening protocol for appropriate treatment assignment.  Future filial therapy research with this population should provide greater support to participants in conducting filial therapy sessions, as well as alternative ways of documenting these sessions.  In addition, it is proposed that a combination of individual and group filial therapy models that is longer-term would be more effective with this population than the 8-week model used.",
  "description_provenance": [
    "Author Email: cgoodwin@vt.edu",
    "Advisor Email: rogersco@vt.edu",
    "Advisor Email: emccollu@vt.edu",
    "Advisor Email: sawyers@vt.edu",
    "Advisor Email: abenning@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:45Z (GMT). No. of bitstreams: 2 DissertationIRB.pdf: 117862 bytes, checksum: c56d7cf7348993c4be845b07aad36b80 (MD5) Dissertation2.pdf: 2907005 bytes, checksum: 3d02d4a5055c414326dc1f102c7e15ed (MD5)   Previous issue date: 2003-04-30"
  ],
  "handle": "27958",
  "identifier_other": "etd-06062003-133816",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062003-133816/",
  "identifier_uri": "http://hdl.handle.net/10919/27958",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "DissertationIRB.pdf",
    "Dissertation2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "play therapy",
    "court-ordered parents",
    "filial therapy"
  ],
  "title": "Filial Therapy with Court-Ordered Parents of Maltreated Children",
  "type": "Dissertation"
}