{
  "contributor_author": "Francisco, Jenifer",
  "contributor_committeechair": "Cooper, Lee D.",
  "contributor_committeemember": [
    "Bell, Martha Ann",
    "Ollendick, Thomas M.",
    "Stephens, Robert S.",
    "Finney, Jack W."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:12:44Z",
  "date_adate": "2006-08-25",
  "date_available": "2014-03-14T20:12:44Z",
  "date_issued": "2006-05-09",
  "date_rdate": "2009-08-25",
  "date_sdate": "2006-06-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Attention deficit-hyperactivity disorder (ADHD) consists of symptoms of both inattention and hyperactivity/impulsivity that cause significant functional impairment (APA, 1994).  Approximately 4.7% of adults are diagnosed with ADHD; however, there are few empirically-informed interventions that are specifically designed for adults.  Instead, many of the common interventions for adults are derived from work done with children with ADHD and may not be appropriate for their particular needs (Weiss & Weiss, 2004).  Given that adults with ADHD typically experience more symptoms of inattention rather than hyperactivity, an investigation of the effectiveness of an intervention that specifically targets their inattentive symptoms is warranted (Weiss & Weiss, 2004; Weiss et al., 2002).  Therefore, the goal of this study was to evaluate the efficacy of an attention-specific intervention for adults with ADHD.      The intervention used in this study, Attention Process Training (APT; Sohlberg & Mateer, 1987), has never been applied to adults with ADHD.  The underlying assumption behind this intervention is that attentional functioning can be improved through the use of tasks that are designed to re-train various aspects of attention.  More specifically, this study addressed sustained, alternating, and selective/divided attention during the intervention.  A non-concurrent multiple baseline design was used in order to assess the effectiveness of the APT among a sample of adults with ADHD.  A sample of four adults, aged 21-37 years (M = 27.75) participated in this study and demonstrated minimal changes in their attentional ability after the intervention.  In addition, the findings suggest that the different components of attention addressed in this intervention are not distinct and likely have a reciprocal affect on one another.",
  "description_provenance": [
    "Author Email: jfrancis@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: ldcooper@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:44Z (GMT). No. of bitstreams: 1 dissertationETD.pdf: 693132 bytes, checksum: ac14ce93f4b95b5f63981fc85fc0eaa7 (MD5)   Previous issue date: 2006-05-09"
  ],
  "handle": "27951",
  "identifier_other": "etd-06052006-095320",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06052006-095320/",
  "identifier_uri": "http://hdl.handle.net/10919/27951",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertationETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Attention Training",
    "Intervention",
    "Adult ADHD"
  ],
  "title": "An Attention-Specific Intervention for Adults with ADHD",
  "type": "Dissertation"
}