{
  "contributor_author": "Potter, Michael  Ross",
  "contributor_committeechair": "Hult, Karen M.",
  "contributor_committeemember": [
    "Khademian, Anne Meredith",
    "Wolf, James F.",
    "Roberts, Patrick S."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:12:44Z",
  "date_adate": "2012-07-06",
  "date_available": "2014-03-14T20:12:44Z",
  "date_issued": "2012-05-18",
  "date_rdate": "2012-07-06",
  "date_sdate": "2012-06-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Financial services regulators are tasked with balancing the conflicting roles of empowering and policing their regulated communities. In order to be effective, agencies must be able to accomplish both tasks. This analysis examines several determinants of effectiveness among U.S. bank regulators.   Using statistical and narrative analyses, it examines factors that have contributed to the regulatory effectiveness of the National Credit Union Administration, Office of the Comptroller of the Currency, and Office of Thrift Supervision. The study focused on the relationships between regulatory ability to prevent failures and influences including agency longevity, ability to manage complexity, appointee and staff qualities, mission stability, regulatory style, and resources. Agency longevity and resources had the greatest impact on effectiveness among the cases that were examined. Additionally, this study proposes a typology that suggests that more effective regulators are able to balance information from their regulated communities with a public interest orientation. This allows them to have current information regarding emerging regulatory issues but also to avoid becoming too reliant on their supervised institutions for information.",
  "description_provenance": [
    "Author Email: mpotter3@yahoo.com",
    "Advisor Email: khult@vt.edu",
    "Advisor Email: akhademi@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: patrickroberts@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:44Z (GMT). No. of bitstreams: 1 Potter_MR_D_2012.pdf: 1045077 bytes, checksum: 488f8d57ad9748bd99b09dea6f1ce359 (MD5)   Previous issue date: 2012-05-18"
  ],
  "handle": "27950",
  "identifier_other": "etd-06042012-091411",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06042012-091411/",
  "identifier_uri": "http://hdl.handle.net/10919/27950",
  "publisher": "Virginia Tech",
  "relation_haspart": "Potter_MR_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Agency Longevity",
    "Managing Complexity",
    "Front-line Staff",
    "Mission Stability",
    "Regulatory Style",
    "Resources",
    "Regulatory Effectiveness",
    "Regulatory Resiliency"
  ],
  "title": "Striving for Balance: An Exploration of Regulatory Effectiveness in Financial Services Regulation, 1989 to 2008",
  "type": "Dissertation"
}