{
  "contributor_author": "Haden, Sara Chiara",
  "contributor_committeechair": "Scarpa-Friedman, Angela",
  "contributor_committeemember": [
    "Denbow, Donald Michael",
    "Harrison, David W.",
    "Ollendick, Thomas H.",
    "Friedman, Bruce H."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:12:45Z",
  "date_adate": "2006-08-02",
  "date_available": "2014-03-14T20:12:45Z",
  "date_issued": "2006-05-11",
  "date_rdate": "2009-08-02",
  "date_sdate": "2006-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Recently, models of aggressive behavior have begun to appreciate the influence of both psychological and biological predictors of maladaptive behavior.  The aim of the current project was to clarify the roles that the noradrenergic system (i.e., norepinephrine metabolite, 3-methoxy-4-hydroxyphenyglycol [MHPG]) and characteristics of the rearing environment play in different expressions of aggression (i.e., hostile and instrumental). It was predicted that higher concentrations of MHPG would be related to increased self-reports of aggressive behavior, especially hostile forms, while expressing aggression during an analog aggression task would lead to decreases in MHPG.  It was also predicted that concentrations of MHPG would interact with childhood environment characteristics to predict aggressive behavior in youth. A sample of 68 male youth, aged 7 to 17, were recruited from two agencies in southwest Virginia serving disadvantaged youth. They completed self-report measures on their childhood environment, aggressive and delinquent behaviors, as well as exposure to community violence and negative life events.  In addition, youth played a challenging computer game with an alleged 창  opponent창   and lost.  Half of the participants were able to retaliate after the game against their 창  opponent.창    Salivary MHPG was measured once before and three times after the game.  A series of ANOVAs and hierarchical regressions were conducted in order to test the main and interactive effects of punitive childhood experiences and baseline MHPG on aggressive behavior.  Findings failed to support the primary predictions; however, results of supplemental analyses showed significant associations of aggression with negative mood, negative family atmosphere, and increased baseline MHPG after controlling for negative family atmosphere.  Also, parental punishment and rejection significantly predicted delinquency, and a significant interaction effect indicated that higher recovery concentrations of MHPG placed rejected youth more at risk for engaging in delinquent behavior.  Results of the present study help to enhance understanding of the differences in biological and psychological correlates of aggression and delinquency in at-risk youth, and inform prevention and intervention efforts.",
  "description_provenance": [
    "Author Email: schaden@vt.edu",
    "Advisor Email: ascarpa@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Advisor Email: dwh@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: bhfriedm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:45Z (GMT). No. of bitstreams: 2 Haden_abstract_dissertation.pdf: 43393 bytes, checksum: 417420f188eda2dd293fd78e121e31fe (MD5) Haden_entire_dissertation.pdf: 468107 bytes, checksum: 6fd2b10737cb9f010484811f01c9637e (MD5)   Previous issue date: 2006-05-11"
  ],
  "handle": "27959",
  "identifier_other": "etd-06062006-154304",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062006-154304/",
  "identifier_uri": "http://hdl.handle.net/10919/27959",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Haden_abstract_dissertation.pdf",
    "Haden_entire_dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Rearing Environment",
    "Norepinephrine",
    "Aggression",
    "Hostile",
    "Instrumental"
  ],
  "title": "Psychobiological Mechanisms of Aggression in Youth",
  "type": "Dissertation"
}