{
  "contributor_author": "Carrozzino-Lyon, Amy L",
  "contributor_committeecochair": [
    "Parkhurst, James A.",
    "McMullin, Steve L."
  ],
  "contributor_committeemember": [
    "Munsell, John F.",
    "Stern, Marc J."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:12:45Z",
  "date_adate": "2012-06-20",
  "date_available": "2014-03-14T20:12:45Z",
  "date_issued": "2012-05-01",
  "date_rdate": "2012-06-20",
  "date_sdate": "2012-06-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Virginia Department of Game and Inland Fisheries (VDGIF) manages wildlife management areas (WMAs) to provide wildlife habitat and hunting and fishing opportunities, along with opportunities for compatible wildlife-related recreation.  Despite having responsibility for managing 39 WMAs, comprising more than 200,000 acres, VDGIF had only anecdotal information about who recreated on Virginiaâ  s WMAs, to what extent, and how they felt about management of the WMAs.  My goals were to (1) determine the types and amount of recreational use WMAs receive, (2) describe and compare VDGIF managersâ   and WMA usersâ   current attitudes and perceptions toward land management, and (3) determine if a methods bias existed between surveys administered online and through U.S. mail.   I observed diverse recreational use totaling > 90,000 annual recreational user days on the 10 WMAs included in the study.  Most visitors were satisfied with their visit, agreed with the use of most land management practices presented, and were willing to continue to visit a WMA if an annual fee was imposed.  Co-orientation analysis revealed low agreement and low accuracy, suggesting a need to improve awareness and recognition of managersâ   and stakeholdersâ   attitudes toward land management.  Addressing areas where agreement already exists, but may not be recognized, should be a top priority.  Areas of greater disparity will prove difficult to address, but attention is critical to successfully implement WMA management objectives.  Wildlife value orientations differed between VDGIF managers and WMA users; VDGIF personnel were predominantly Utilitarian (54%, n=35), whereas WMA users were predominantly Pluralist (63%, n=381).  Value orientations did not relate strongly to opinions of land management.   Demographics differed between web and paper respondents, with slightly younger, more urban and more educated respondents electing to complete the web-based survey more often.  Value orientations toward wildlife and attitudes toward land management did not differ between web and paper respondents, suggesting little influence of values and attitudes on the survey mode selected.  Increasingly diverse stakeholders and limited funding sources continue to challenge state wildlife agencies.  Specific engagement techniques should strengthen interpersonal relationships and collaboration between the agency and its stakeholders.",
  "description_provenance": [
    "Author Email: acarroz@vt.edu",
    "Advisor Email: jfmunsel@vt.edu",
    "Advisor Email: jparkhur@vt.edu",
    "Advisor Email: smcmulli@vt.edu",
    "Advisor Email: mjstern@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:45Z (GMT). No. of bitstreams: 1 CarrozzinoLyon_AL_D_2012.pdf: 11818162 bytes, checksum: fe8ed32340d1d66f145396d71f20682e (MD5)   Previous issue date: 2012-05-01"
  ],
  "handle": "27955",
  "identifier_other": "etd-06052012-132041",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06052012-132041/",
  "identifier_uri": "http://hdl.handle.net/10919/27955",
  "publisher": "Virginia Tech",
  "relation_haspart": "CarrozzinoLyon_AL_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "co-orientation",
    "communication",
    "state wildlife agency",
    "stakeholders",
    "land management"
  ],
  "title": "Characterization and communicative analysis of wildlife managers and recreational users of Virginiaâ  s Wildlife Management Areas",
  "type": "Dissertation"
}