{
  "contributor_author": "Xu, Yueying",
  "contributor_committeechair": "McCleary, Ken W.",
  "contributor_committeemember": [
    "Weaver, Pamela A.",
    "Littlefield, James E.",
    "Uysal, Muzaffer S."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:12:44Z",
  "date_adate": "2009-06-19",
  "date_available": "2014-03-14T20:12:44Z",
  "date_issued": "2009-05-28",
  "date_rdate": "2009-06-19",
  "date_sdate": "2009-06-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The offer of vacation packages is a marketing tool called bundling, selling at least two separate products at one single price (Guiltinan, 1987). Sellers adopt bundling strategies in order to sell more at lower costs, to contract consumer surplus, and to create value for consumers. Consumers purchase a package based on the trade-off between the perceived benefits and costs involved in purchasing the package compared to assembling different products/service. In other words, the perceived value of the package is the reason for consumers to purchase a package or not.    The study serves two purposes. One is to examine the dimensionality of perceived value as a construct, in the pre-purchase stage. The other is to investigate the relationships between bundling strategies and perceived value, and perceived value and purchase intention of a vacation package. Bundling strategies taken by sellers include how many items to put in a package and what price discount for the package compared to the sum of all separate products.  The findings of the study show that perceived value in service setting is composed of perceived acquisition value and perceived functional value, instead of perceived acquisition value and perceived transaction value proposed by scholars such as Thaler (1985) and Grewal et al. (1998). This is one of the theoretical contributions by the study.  Another contribution of the study is the exploratory examination of the interaction effect between pricing strategies and product strategies for a bundle. The study provides evidence that bundles without a discount are perceived as having very low value and consumers expect a discount, large or small, from buying a bundle. And the larger the number of products in a package, the larger the discount size consumers expect to get.",
  "description_provenance": [
    "Author Email: yuxu@vt.edu",
    "Advisor Email: weaver@vt.edu",
    "Advisor Email: jalittle@vt.edu",
    "Advisor Email: mccleary@vt.edu",
    "Advisor Email: samil@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:44Z (GMT). No. of bitstreams: 1 Bundling_dissertation.pdf: 522700 bytes, checksum: 6f06ed0025c9b673e0b98b3cb1e80165 (MD5)   Previous issue date: 2009-05-28"
  ],
  "handle": "27953",
  "identifier_other": "etd-06052009-171741",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06052009-171741/",
  "identifier_uri": "http://hdl.handle.net/10919/27953",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bundling_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Perceived Value",
    "Acquisition Value",
    "Transaction Value",
    "Vacation Packages",
    "Functional Value",
    "Bundling Strategies"
  ],
  "title": "Examining the Effects of Bundling Strategies on Travelers' Value Perception and Purchase Intention of a Vacation Package",
  "type": "Dissertation"
}