{
  "contributor_author": "Habben, Christopher M.",
  "contributor_committeechair": "Sporakowski, Michael J.",
  "contributor_committeemember": [
    "Prouty, Anne M.",
    "Protinsky, Howard O. Jr.",
    "Peterson, Rick L.",
    "Johnson, Scott W."
  ],
  "contributor_department": "Marriage and Family Therapy",
  "date_accessioned": "2014-03-14T20:12:45Z",
  "date_adate": "2000-06-19",
  "date_available": "2014-03-14T20:12:45Z",
  "date_issued": "2000-04-28",
  "date_rdate": "2001-06-19",
  "date_sdate": "2000-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of the present study was to examine differentiation of self (Bowen, 1985) as a predictor of involvement in specific extramarital behaviors. Data were collected from 125 graduates of a comprehensive state university in southeastern United States.  The sample was primarily caucasian, college educated, married, politically moderate to slightly conservative, equally divided by gender and ranged in age from 25 to 87 years (M  = age 43).  Differentiation of self was operationalized and measured by the Differentiation of Self Inventory (Skowron & Friedlander, 1998).   Logistical regression analyses regressed involvement in specific extramarital behaviors upon the level of differentiation of self as measured by the Differentiation of Self Inventory.  The level of differentiation did not significantly predict the likelihood of involvement in any specific extramarital behavior.  Among females, however, differentiation was positively but not significantly associated with the likelihood of involvement in most of the specific extramarital behaviors examined by the study.  For females, differentiation did significantly predict the likelihood of having an experience kissing some one other than a spouse while married.",
  "description_provenance": [
    "Author Email: chabben@aol.com",
    "Advisor Email: Aprouty@vt.edu",
    "Advisor Email: Hprotins@vt.edu",
    "Advisor Email: Eagle1@vt.edu",
    "Advisor Email: rpetersn@vt.edu",
    "Advisor Email: Scjohnso@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:45Z (GMT). No. of bitstreams: 1 etd.pdf: 362933 bytes, checksum: 80f3a6f0cae2b2520807518f0e5075cf (MD5)   Previous issue date: 2000-04-28"
  ],
  "handle": "27956",
  "identifier_other": "etd-06062000-00490029",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062000-00490029/",
  "identifier_uri": "http://hdl.handle.net/10919/27956",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Differentiation of Self",
    "Extramarital Involvement"
  ],
  "title": "Differentiation as a Predictor of Extramarital Involvement",
  "type": "Dissertation"
}