{
  "contributor_author": "Houghton, Jeffery D.",
  "contributor_committeechair": "Bonham, Thirwall W.",
  "contributor_committeemember": [
    "Foti, Roseanne J.",
    "Madigan, Robert M.",
    "Neck, Christopher P.",
    "Singh, Kusum"
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:12:45Z",
  "date_adate": "2000-06-07",
  "date_available": "2014-03-14T20:12:45Z",
  "date_issued": "2000-06-01",
  "date_rdate": "2001-06-07",
  "date_sdate": "2000-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examined the relationship between self-leadership and personality through an analysis and comparison of hierarchical factor structures.  More specifically, this study examined the relationships between the self-leadership dimensions of behavior-focused strategies, natural reward strategies, and constructive thought strategies, and the personality dimensions of extraversion, emotional stability, and conscientiousness. The results of the study provide evidence that the self-leadership dimensions are distinct from, yet related to, the specified personality traits.    The hypothesis that self-leadership strategies are distinct from the selected personality traits was supported through structural equations modeling analyses examining competing models combining the hierarchical factor structures of self-leadership and personality.  Model fit increased significantly through a progression of models that showed increasingly greater distinction between self-leadership dimensions and personality traits. The best fitting model in the progression, in harmony with both self-leadership and trait personality theory, consisted of a hierarchical factor structure with three first order self-leadership factors, three first order personality factors, and two correlated second order factors (i.e., self-leadership and personality).  Furthermore, intercorrelations were greater within the self-leadership dimensions than between the self-leadership dimensions and the personality traits, thus providing additional evidence of differentiation.    \tAlthough the evidence indicates that self-leadership skill dimensions are unique with respect to personality traits, these results also suggest that self-leadership and personality factors are nevertheless significantly related.  Specifically, both extraversion and conscientiousness were significantly related to all three self-leadership dimensions, while emotional stability was significantly related only to the natural rewards strategies dimension.  In summation, the results of this study suggest that self-leadership represents a distinct constellation of strategies that are significantly related to certain key personality traits.  The implications of these results for future self-leadership research and practice are discussed.",
  "description_provenance": [
    "Author Email: jehought@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: madigan@vt.edu",
    "Advisor Email: cneck@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: bonham@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:45Z (GMT). No. of bitstreams: 2 vita.pdf: 102108 bytes, checksum: ba0becd323391a23cb5b54108ed96a14 (MD5) etd.pdf: 335767 bytes, checksum: ae1841defa1f1a4a2ab1cc4d400bb075 (MD5)   Previous issue date: 2000-06-01"
  ],
  "handle": "27957",
  "identifier_other": "etd-06062000-12260008",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062000-12260008/",
  "identifier_uri": "http://hdl.handle.net/10919/27957",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "vita.pdf",
    "etd.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "personality",
    "hierarchical factor structure",
    "self-leadership"
  ],
  "title": "The Relationship between Self-Leadership and Personality: A Comparison of Hierarchical Factor Structures",
  "type": "Dissertation"
}