{
  "contributor_author": "Feldman, Steven B.",
  "contributor_committeechair": "Zelazny, Lucian W.",
  "contributor_committeemember": [
    "Baker, James C.",
    "Campbell, James B. Jr.",
    "Daniels, Walter Lee",
    "Pavich, Milan J."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:12:46Z",
  "date_adate": "2008-06-06",
  "date_available": "2014-03-14T20:12:46Z",
  "date_issued": "1995-08-02",
  "date_rdate": "2012-07-10",
  "date_sdate": "2008-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Lack of age control for deposits >40,000 yr makes it impossible to differentiate between the complex effects of climate and geomorphic age on weathering intensity, soil profile development, mineral stability, and elemental flux within the pedoenvironment. <p> Upland soils formed in similar granitic parent materials along a climatic gradient in the nonglaciated Southern Piedmont Province were analyzed in order to investigate whether soil response to variations in the weathering environment follows predictable, systematic patterns related to climate, and to quantify the nature and magnitude of these relationships, particularly with regard to processes of secondary mineral neoformation and transformation. <p> With few exceptions, all measures of weathering intensity increase dramatically from north to south on the Piedmont. The effective depth of pedogenesis in the Georgia and Alabama soils studied is nearly twice that of soils in Virginia and North Carolina, closely corresponding to calculated effective leaching indices developed for each site. <p> Kaolinite and gibbsite are poor indicators of soil age, weathering intensity, or paleoenvironment because of complex mechanisms of formation. Kaolinite genesis is shown to result from i) desilication of 2: 1 phyllosilicates in surficial horizons ii) hydrolysis of K-feldspars, iii) resilication of gibbsite deep in the saprolite, and iv) recrystallization of halloysite in the soil/saprolite transition zone. Gibbsite forms from both desilication of kaolinite and by reprecipitation after N a-feldspar dissolution at depth. Halloysite is common to all soils as the product of both feldspar and biotite weathering, thus illustrating the overriding influence of microenvironment in secondary minerals formation. <p> Clay content is linearly related to Fed in Virginia, North Carolina, and Georgia soils, with regression slopes decreasing from north to south. Clay content levels off at higher Fed values for Alabama soils, indicating that i) steady-state conditions are approached as pedogenic clay formation reaches some intrinsic, self-limiting threshold value, and ii) the limiting factor in clay production over time is leaching intensity, and not the concentration of Fe-bearing primary minerals, in contrast to the soils studied soils in Virginia, North Carolina, and Georgia, appear to have reached a steady-state with regard to clay production. These data suggest that soils farther south on the Piedmont have experienced conditions of greater geomorphic stability and longer weathering. <p> Until we can obtain numetical dates for Piedmont soils, however, one can only speculate as to whether the observed differences in pedogenesis and weathering intensity are due to age effects, climatic effects - or both.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:12:46Z (GMT). No. of bitstreams: 1 LD5655.V856_1995.F453.pdf: 39748212 bytes, checksum: c26a5bbeca0b1f183bc9e6d44a41a8ae (MD5)   Previous issue date: 1995-08-02",
  "format_medium": "BTD",
  "handle": "27965",
  "identifier_other": "etd-06062008-155645",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062008-155645/",
  "identifier_uri": "http://hdl.handle.net/10919/27965",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1995.F453.pdf",
  "subject": "weathering",
  "subject_lcc": "LD5655.V856 1995.F453",
  "title": "Pedogenesis, weathering processes, and elemental distribution along a soil climosequence in the southern Piedmont",
  "type": "Dissertation"
}