{
  "contributor_author": "Goad, Laura Chisom",
  "contributor_committeechair": "McGrady, Harold J.",
  "contributor_committeemember": [
    "Fortune, Jimmie C.",
    "Curcio, Claire Cole Vaught",
    "Worner, Wayne Dempsey",
    "Bradley, Deborah Callan"
  ],
  "contributor_department": "Administration and Supervision of Special Education",
  "date_accessioned": "2014-03-14T20:12:47Z",
  "date_adate": "2008-06-06",
  "date_available": "2014-03-14T20:12:47Z",
  "date_issued": "1996-01-05",
  "date_rdate": "2008-06-06",
  "date_sdate": "2008-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>First year special education administrators in Virginia school systems are assigned experienced special education administrators as mentors. In most instances the mentors are not employed by the same school system as the first year administrators. Case studies of six mentors revealed that each was involved in more than one mentoring relationship. Four mentors had successful assigned relationships. Two mentors had assigned relationships which did not develop. Four of the six mentors were also involved in successful unassigned relationships. Findings indicated that, with appropriate selection of mentors, matching of pairs for similar experiences, and a mechanism for regular contact, assigned relationships can provide benefits to mentors and proteges.</p> <p> Unassigned mentoring relationships among these six cases typically occurred between individuals who were employed by the same school system. The mentor was often the protege's direct supervisor. Pairs in unassigned relationships observed one another performing job duties which enabled the mentor to function as a role model. Unassigned mentors functioned as career enhancers, providing their proteges with challenging opportunities and exposure. Assigned and unassigned relationships provided specific information, general survival skills, and overall support to the proteges.</p> <p> The case studies of the six mentors suggest that the Virginia Department of Education should continue Project SEAM as both mentors and proteges benefit from the networking and pooling of resources between their school systems. Proteges in the assigned relationships were provided with accurate information and general support. However, the process could be improved by offering training to proteges and insuring a commonality of experience in the matching of pairs. A joint meeting of the assigned pairs in the Spring of each academic year should be held. At this meeting, the pairs could share their successes, failures, and ideas for facilitating relationships.</p>",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:12:47Z (GMT). No. of bitstreams: 1 LD5655.V856_1996.G633.pdf: 6012839 bytes, checksum: 5c8ee22a03335bff133f256ea996c79a (MD5)   Previous issue date: 1996-01-05",
  "format_medium": "BTD",
  "handle": "27966",
  "identifier_other": "etd-06062008-160730",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062008-160730/",
  "identifier_uri": "http://hdl.handle.net/10919/27966",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1996.G633.pdf",
  "subject": [
    "special education",
    "mentoring relationships",
    "administrators"
  ],
  "subject_lcc": "LD5655.V856 1996.G633",
  "title": "A descriptive study of assigned and unassigned mentoring relationships of first year special education administrators in Virginia",
  "type": "Dissertation"
}