{
  "contributor_author": "LeBel, Luc",
  "contributor_committeechair": "Stewart, William B.",
  "contributor_committeemember": [
    "Grace, Laura A.",
    "Sullivan, Jay",
    "Oderwald, Richard G.",
    "Triantis, Konstantinos P."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:12:46Z",
  "date_adate": "2008-06-06",
  "date_available": "2014-03-14T20:12:46Z",
  "date_issued": "1996-12-14",
  "date_rdate": "2013-01-10",
  "date_sdate": "2008-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nonparametric data envelopment analysis (DEA) models were coded and used to measure radial and non-radial technical efficiency for a sample of logging contractors. Firms were evaluated in regards to the efficiency with which they converted inputsdollars of capital, consumables, and labor - into output - tons of wood. Overall, for the period between 1988 to 1994, the logging contractors were efficient, but some were considerably less efficient than their peers. Loggers tended to move from period of high efficiency to period of lesser efficiency, although some were considerably more stable than others. <p> Of those contractors who displayed the most stability in regard to technical efficiency, a majority could be considered as enjoying a preferred-suppliers status. Of the least stable loggers, none were identified as operating under a preferred-suppliers agreement. There was strong evidence that low capacity utilization had a negative impact on technical efficiency, quarters when capacity utilization was high were more likely to have a high technical efficiency ratio than quarters with a low capacity utilization. Operating scale also influenced technical efficiency. For the sample, the most productive scale size (mpss) was estimated to be somewhere between 60,000 to 80,000 tons per year. Up to that size, increasing return to scales were observed, afterward decreasing returns to scale settled in. Approximately one quarter of all inefficiencies were scale related. <p> The relationship between overall technical efficiency and unit and total margin was explored using scale efficient loggers (pure technical efficiency). For these observations the mpss corresponded to the point of minimum average cost. Loggers producing at a size below the mpss could increase total and unit margin by increasing production. Once past the mpss, loggers could decrease their unit margin but still increased their total margin up until marginal costs equaled marginal revenue. The rate paid by a procurement organization influence fhe size at which loggers can produce profitably, and determine the level of production elasticity available.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:12:46Z (GMT). No. of bitstreams: 1 LD5655.V856_1996.L429.pdf: 7178348 bytes, checksum: 6b8b6775c32707a3b06b1d8704904888 (MD5)   Previous issue date: 1996-12-14",
  "format_medium": "BTD",
  "handle": "27962",
  "identifier_other": "etd-06062008-152114",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062008-152114/",
  "identifier_uri": "http://hdl.handle.net/10919/27962",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1996.L429.pdf",
  "subject": [
    "DEA",
    "logging",
    "efficiency",
    "forestry"
  ],
  "subject_lcc": "LD5655.V856 1996.L429",
  "title": "Performance and efficiency evaluation of logging contractors using data envelopment analysis",
  "type": "Dissertation"
}