{
  "contributor_author": "Keyes, Robert F.",
  "contributor_committeechair": "Kingston, David G. I.",
  "contributor_committeemember": [
    "Bell, Harold M.",
    "Dorn, Harry C.",
    "Merola, Joseph S.",
    "Tanko, James M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:12:50Z",
  "date_adate": "2008-06-06",
  "date_available": "2014-03-14T20:12:50Z",
  "date_issued": "1992-11-20",
  "date_rdate": "2008-06-06",
  "date_sdate": "2008-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The glycerol enol ether, fecapentaene-12, is a direct acting fecal mutagen that is formed in the lower portion of the gastrointestional tract by anaerobic bacteria. The biological precursor to fecapentaene-12 is a natural product of mammalian origin whose role in the etiology of colon cancer is unknown.</p> <p>Preliminary evidence indicated that the precursor may be a plasmalogen with an intact pentaenol ether moiety. Further structural studies by means of degradative methods and chromatographic techniques enabled the structure of the precursor to be elucidated. Based on the structure of the precursor, the name plasmalopentaene-12 was coined.</p> <p>Synthetic methodology was developed for obtaining synthetic plasmalopentaene12. This was necessary in order to confirm the structure and to determine the precursor's biological role. The synthetic methodology proceeded through a novel \"acyl migration\" which enables the highly labile pentaenol ether to be generated late in the synthesis. Model studies indicated that this was a feasible pathway. It was also determined that this methodology may be highly adaptable to the synthesis of other plasmalogens and may also provide a new synthetic route to fecapentaene-12.</p>",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:12:50Z (GMT). No. of bitstreams: 1 LD5655.V856_1992.K494.pdf: 6066429 bytes, checksum: bea3cd7a48ed466186f807b9911d56d0 (MD5)   Previous issue date: 1992-11-20",
  "format_medium": "BTD",
  "handle": "27979",
  "identifier_other": "etd-06062008-171532",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062008-171532/",
  "identifier_uri": "http://hdl.handle.net/10919/27979",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1992.K494.pdf",
  "subject": "Glycene enol ether",
  "subject_lcc": "LD5655.V856 1992.K494",
  "title": "Structure elucidation and studies relating to the synthesis of plasmalopentaene-12",
  "type": "Dissertation"
}