{
  "contributor_author": "Price, Catherine H.",
  "contributor_committeechair": "Murmann, Suzanne K.",
  "contributor_committeemember": [
    "Minish, Roberta M.",
    "Reece, Barry L.",
    "Tse, Eliza C.",
    "Weaver, Pamela A."
  ],
  "contributor_department": "Hotel, Restaurant, and Institutional Management",
  "date_accessioned": "2014-03-14T20:12:48Z",
  "date_adate": "2008-06-06",
  "date_available": "2014-03-14T20:12:48Z",
  "date_issued": "1993-04-19",
  "date_rdate": "2013-07-31",
  "date_sdate": "2008-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Individuals have personal and occupational needs that are satisfied to some degree by attending professional meetings. The primary purpose of this study was to identify the attributes of professional society meetings that have value for attendees. Three meeting attributes were identified from a review of the literature: education, networking and leadership. The second purpose was to explain why individuals preferred certain meeting attributes. Career theories were used to provide an explanatory schema for interpreting individual differences. </p><p> The findings of this study support four meeting attributes; the three hypothesized-education, networking and leadership, plus a fourth, named professional savvy. Based on the means education was the most frequently recognized attribute, networking the second, professional savvy was third, and leadership the least recognized. Career stages were shown to predict the attribute that would be valued most highly by an individual attendee. The three career stages and respective survey items shown to it be significant were {1) biological or life-span theories represented by the survey item age; (2) social class theories represented by salary, and (3) transition-based theories represented by the number of years a person has been in their profession, the number of years with the current employer and the individuals perception of changes in their job responsibilities. </p><p> The data show that education is the most important attribute to three fourths of the sample and for these individuals career stages are normally distributed. For those who prefer leadership, savvy and networking more descriptive profiles can be drawn from the career stage variables.</p><p>  The results of this study are particularly useful to individuals who pfan meetings. The data show that meeting organizers and planners can identify critical items that link the individuals to a particular career stage, and because meeting attributes are linked to career stages, programs can be designed to provide the selected or range of attributes depending on the particular make-up of the audience.</p>",
  "description_provenance": [
    "Author Email: Catherine.Price@usm.edu",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Made available in DSpace on 2014-03-14T20:12:48Z (GMT). No. of bitstreams: 1 LD5655.V856_1993.P753.pdf: 5745598 bytes, checksum: 1cf45255034df90a0d8d94fac5e3174b (MD5)   Previous issue date: 1993-04-19"
  ],
  "format_medium": "BTD",
  "handle": "27974",
  "identifier_other": "etd-06062008-165939",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062008-165939/",
  "identifier_uri": "http://hdl.handle.net/10919/27974",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1993.P753.pdf",
  "subject": [
    "College teachers",
    "Professional associations -- Congresses."
  ],
  "subject_lcc": "LD5655.V856 1993.P753",
  "title": "An empirical study of the value of professional association meetings from the perspective of attendees",
  "type": "Dissertation"
}