{
  "contributor_author": "Brown, Heather Moore",
  "contributor_committeechair": [
    "Wiswell, Albert K.",
    "McHenrey, Emmit J."
  ],
  "contributor_committeemember": [
    "Cline, Marvin Gerald",
    "McKeen, Ronald L.",
    "Stubblefield, Harold W."
  ],
  "contributor_department": "Adult and Continuing Education",
  "date_accessioned": "2014-03-14T20:12:48Z",
  "date_adate": "2008-06-06",
  "date_available": "2014-03-14T20:12:48Z",
  "date_issued": "1994-12-01",
  "date_rdate": "2010-02-22",
  "date_sdate": "2008-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>The initiative entitled the Federal Government 8(a) Program was developed to serve as a training intervention to assist minority-owned businesses in gaining access to Federal contracting dollars. Minority-owned firms complete a certification process rendering them eligible to compete for up to nine years in a sheltered environment for specific contracting set-aside opportunities. However, of the approximately 4,848 8(a) certified businesses nationally, only a limited number ever secure a contract through the program. This research identified learning and policy performance barriers experienced by 8(a) business owners related to securing a Federal contract.</p><p> Three research questions were addressed:</p><ol><li> What potential barriers does an 8(a) business face when competing for a contract?</li><li> What capabilities are required to compete successfully for Government contracts?</li><li> What do 8(a) business owners perceive their learning needs are related to securing a contract?</li></ol> <p>These research questions were addressed using a multi-method research approach combining the use of secondary qUalitative research and primary qualitative case studies. One hundred eighty-six responses to a letter sent by Small Business Administration (S.B.A.) Administrator, Erskine Bowles, to all 8(a) certified businesses to solicit opinions, suggestions, and comments related to the program were analyzed to inform the three research questions. During the second phase of the research, case study analysis were conducted with a Federal Contracting Officer, a S.B.A. Business Opportunity Specialist, and an 8(a) business owner, three parties critical to the success of the 8(a) business.</p><p> Six barriers were identified: 8(a) Certification Process; Access to Federal Contracting Opportunities; Federal Government Procurement Personnel; Lack of Financing; Use of Wrong Performance Measures; S.B.A. Staff, Processes and Policies. Each performance barrier had both learning and policy implications. Overall, findings indicate that success in the 8(a) program requires an in depth understanding of the 8(a) procurement process, previous Federal Agency contacts, adequate working capital or access to lines of credit, and a sophisticated marketing structure. Additionally, the findings indicate that the S.B.A. 's process of certification, performance evaluation and graduation is bureaucratic, difficult to maneuver and does not provide adequate technical assistance particularly in the area of marketing.</p>",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:12:48Z (GMT). No. of bitstreams: 1 LD5655.V856_1994.B768.pdf: 7891440 bytes, checksum: fa209c843cafc5ce0074134583d8e351 (MD5)   Previous issue date: 1994-12-01",
  "format_medium": "BTD",
  "handle": "27972",
  "identifier_other": "etd-06062008-164639",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062008-164639/",
  "identifier_uri": "http://hdl.handle.net/10919/27972",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1994.B768.pdf",
  "subject": "Minority business enterprises",
  "subject_lcc": "LD5655.V856 1994.B768",
  "title": "Performance barriers to 8(a) small businesses: learning & policy implications",
  "type": "Dissertation"
}