{
  "contributor_author": "Eifert, Joseph D.",
  "contributor_committeechair": "Hackney, Cameron Raj",
  "contributor_committeemember": [
    "Pierson, Merle D.",
    "Carter, Walter Hans Jr.",
    "Duncan, Susan E.",
    "Eigel, William N. III"
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:12:48Z",
  "date_adate": "2008-06-06",
  "date_available": "2014-03-14T20:12:48Z",
  "date_issued": "1994-12-15",
  "date_rdate": "2013-09-22",
  "date_sdate": "2008-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Pathogenic bacteria in foods are affected by several factors which may interact to enhance or inhibit microbial growth. <u>Staphylococcus aureus</u> 196E was inoculated into Brain Heart Infusion broth formulated with either 0.5, 4.5 or 8.5% NaCI, adjusted to pH 5.0, 6.0 or 7.0, and incubated aerobically at 12, 20 or 28°C. Mathematical models to predict the growth of <u>S. aureus</u> 196E were developed using a modified Gompertz function and response surface methodology. Each predictive equation required the estimation of only 23 parameters with a biological meaning. These models determined the significance of time, incubation temperature, sodium chloride (NaCI) concentration, and either pH or the log<sub>e</sub> of the undissociated acid concentration and any interactions on growth kinetics. Separate models were developed for the cases where pH was altered with either acetic acid, acetic acid plus sodium hydroxide, lactic acid and hydrochloric acid.</p> <p> All models adequately predicted the log growth of S. aureus 196E. Several interactive relationships between the independent variables upon population growth were significant. Predicted responses to multiple factor interactions were displayed with three-dimensional and contour plots. One model developed from a smaller subset of the growth data demonstrated that models could be produced with much less data collection. Generally, predictions of growth showed that acetic acid was more inhibitory to growth than lactic and hydrochloric acids. Furthermore, predicted and observed growth was slower or reduced when the undissociated acetic acid concentration was elevated at a specific pH.</p> <p>This methodology can provide important information to food scientists about the growth kinetics of microorganisms and prediction ranges or confidence intervals for growth parameters. Consequently, the effects of food formulations and storage conditions on the growth kinetics of foodborne pathogens or spoilage microorganisms could be predicted.</p>",
  "description_provenance": [
    "Author Email: jeifert@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:48Z (GMT). No. of bitstreams: 1 LD5655.V856_1994.E444.pdf: 6858402 bytes, checksum: 20f07cbd54522acbf451341b526a690c (MD5)   Previous issue date: 1994-12-15"
  ],
  "format_medium": "BTD",
  "handle": "27970",
  "identifier_other": "etd-06062008-164508",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062008-164508/",
  "identifier_uri": "http://hdl.handle.net/10919/27970",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1994.E444.pdf",
  "subject": "Staphylococcus aureus",
  "subject_lcc": "LD5655.V856 1994.E444",
  "title": "Predictive modeling of the aerobic growth of <i>Staphylococcus aureus</i> 196E using a nonlinear model and response surface analysis",
  "type": "Dissertation"
}