{
  "contributor_author": "Peng, Chien-Hsiung",
  "contributor_committeechair": "Desu, Seshu B.",
  "contributor_committeemember": [
    "Zallen, Richard",
    "Reynolds, William T.",
    "Dillard, John G.",
    "Houska, Charles R."
  ],
  "contributor_department": "Materials Engineering Science",
  "date_accessioned": "2014-03-14T20:12:50Z",
  "date_adate": "2008-06-06",
  "date_available": "2014-03-14T20:12:50Z",
  "date_issued": "1992-08-01",
  "date_rdate": "2013-10-03",
  "date_sdate": "2008-06-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Ferroelectric lead zirconate titanate thin films, Pb(ZrxTi 1-x)0 3 or PZT, have aroused considerable interest in recent years for the application in nonvolatile electronic memories because of their excellent ferroelectric properties. In this research, PZT thin films were studied from two aspects: the scientific aspect and the technical aspect. <p> The optical properties of PZT solid solutions and the structure development in PZT films were extensively investigated in the scientific aspect. The PZT films used in this part of study were prepared by metalorganic decomposition (MOD) process. The envelope method, with consideration of light intensity loss from the back surface of the substrate, was demonstrated to be a simple and convenient tool for obtaining the optical properties of the PZT films in the medium and weak absorption regions. In the near optical band gap region, both the transmission and reflection spectra were used to successfully calculate the optical constants of the films. The film thickness derived from the envelope method was cross checked by a computer simulation method and was found to have an accuracy better than 2%. An effective, versatile, and nondestructive optical method was developed for the study of the structure development in MOD PZT films. Also, the models for the structure development were proposed and were verified by this optical method. Using this method, the characteristic temperatures (i.e., the initiation and completion temperatures) of each phase can be easily identified. In addition, the volume fraction of the perovskite phase in the pyrochlore-perovskite phase transformation region was obtained from this optical method.  <p> From the technical point of view, ferroelectric PZT films were successfully and reproducibly deposited for the first time by hot-wall metalorganic chemical vapor deposition (MOCVD). One of the problems associated with the MOCVD technique is the availability of the precursors. After intensive studies searching for the most suitable precursors for MOCVD PZT thin films, the safe and stable precursors, namely lead tetramethylheptadione [Pb(thd)2)], zirconium tetramethylheptadione [Zr(thd)4], and titanium ethoxide [Ti(OEt)4] were chosen. The films were deposited at temperatures as low as 55QOC and had pure perovskite phase in the as-deposited state. Also, the films were smooth, specular, crack-free, uniform, and adhered well on the substrates. The stoichiometry of the films can be easily controlled either by varying the individual precursor temperature and/or the flow rate of the carrier gas. Auger electron spectroscopic (AES) depth profile showed good uniformity through the thickness of the films. The AES spectra also showed no carbon contamination in the bulk of the films. As-deposited films were dense and showed uniform and fine grains. The film (Pb/Zr/Ti = 50/41/9) annealed at 6QQOC showed a spontaneous polarization of23.3 pC/cm2 and a coercive field of 64.5 kV /em.",
  "description_provenance": [
    "Author Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Made available in DSpace on 2014-03-14T20:12:50Z (GMT). No. of bitstreams: 1 LD5655.V856_1992.P384.pdf: 16967638 bytes, checksum: ed98cfa89567de5d7afe58a8a688343a (MD5)   Previous issue date: 1992-08-01"
  ],
  "format_medium": "BTD",
  "handle": "27978",
  "identifier_other": "etd-06062008-170832",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06062008-170832/",
  "identifier_uri": "http://hdl.handle.net/10919/27978",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1992.P384.pdf",
  "subject": "Ferroelectric thin films.",
  "subject_lcc": "LD5655.V856 1992.P384",
  "title": "Optical property studies and metalorganic chemical vapor deposition of ferroelectric thin films",
  "type": "Dissertation"
}