{
  "contributor_author": "Carlson, Kent Richard",
  "contributor_committeecochair": [
    "Jortner, Bernard S.",
    "Ehrich, Marion F."
  ],
  "contributor_committeemember": [
    "Bloomquist, Jeffrey R.",
    "Nagarkatti, Mitzi",
    "Klein, Bradley G."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:12:51Z",
  "date_adate": "2000-06-08",
  "date_available": "2014-03-14T20:12:51Z",
  "date_issued": "2000-05-19",
  "date_rdate": "2001-06-08",
  "date_sdate": "2000-06-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Certain organophosphorus compounds have the ability to induce a delayed neuropathic condition in sensitive species termed organophosphorus compound-induced delayed neurotoxicity (OPIDN). Esteratic changes associated with OPIDN have been successfully modeled in vitro. The physical characteristics of lesion development in OPIDN including the mode of nerve cell death, cytotoxic initiator and effector molecules, and cytoskeletal involvement have received little in vitro investigation. This dissertation evaluated the mode of cell death (apoptosis versus oncotic-necrosis), and cell cycle, cytoskeletal, nuclear, and mitochondrial alterations induced by OP compounds in SH-SY5Y cultures, an in vitro human neuroblastoma model. The distribution of in vivo neural degeneration in white Leghorn hen models was also assessed as a prelude to validating the mode of OP compound-induced in vivo neural cell death. These endpoints were evaluated by utilizing flow cytometry, spectrophotometry, gel electrophoresis, immunohistochemistry, light, and electron microscopy. Initial data gathered on culture parameters revealed that the mitotic status, basal rates of cell death, and total culture density were dependent on the condition of the media and the initial seeding density. Subsequent in vitro investigations used standardized culture conditions with OP compounds (diisopropylphosphorofluoridate (DFP), paraoxon, parathion, phenyl saligenin phosphate (PSP), tri-ortho-tolyl phosphate (TOTP), and triphenyl phosphite (TPPi); 1uM - 1mM). These studies revealed that OP compounds altered the cell cycle phase, decreased the amount of intracellular f-actin, altered the mitochondrial membrane potential, and induced caspase-3 activation and nuclear partitioning characteristic of apoptosis. The amount of change in these parameters was strongly dependent on the OP compound, the length of incubation time, and the presence of modulators of cytotoxicity such as phenylmethylsulfonyl fluoride (PMSF), carbachol, Ac-DEVD-CHO, Ac-IETD-CHO, and cyclosporin A. Preliminary in vivo experiments designed to validate in vitro results revealed neural degeneration involving fibers, terminals, and cell soma in spinal cord and brain tissue of PSP- and TPPi- exposed hens. The distribution and magnitude of these changes were contingent on the OP compound and length of time post-exposure. Subsequent experiments designed to evaluate the mode of cell death in these tissues revealed little evidence of either necrosis or apoptosis. These results, therefore, did not support or refute in vitro observations. Many OP compound-induced subcellular alterations have been demonstrated in our in vitro SH-SY5Y neuroblastoma model. Even though the mode of cell death observed in SH-SY5Y cells was not validated in in vivo experiments, in vitro observations nonetheless provide stimulating areas to further research the mechanisms of OPIDN and OP compound-induced cell death.",
  "description_provenance": [
    "Author Email: kcarlson@vt.edu",
    "Advisor Email: jbquist@vt.edu",
    "Advisor Email: bjortner@vt.edu",
    "Advisor Email: mnagarka@vt.edu",
    "Advisor Email: marion@vt.edu",
    "Advisor Email: bklein@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:51Z (GMT). No. of bitstreams: 1 molmech.pdf: 12043663 bytes, checksum: 65820b0227a9a3ae00af56f84086bf16 (MD5)   Previous issue date: 2000-05-19"
  ],
  "handle": "27983",
  "identifier_other": "etd-06072000-23160034",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06072000-23160034/",
  "identifier_uri": "http://hdl.handle.net/10919/27983",
  "publisher": "Virginia Tech",
  "relation_haspart": "molmech.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "apoptosis",
    "SH-SY5Y",
    "cytotoxicity",
    "organophosphorus"
  ],
  "title": "The Molecular Mechanisms of Organophosphorus Compound-induced Cytotoxicity",
  "type": "Dissertation"
}