{
  "contributor_author": "Dorworth, Vicky E.",
  "contributor_committeechair": "Stubblefield, Harold W.",
  "contributor_committeemember": [
    "Wiswell, Albert K.",
    "Belli, Gabriella M.",
    "McKeen, Ronald L.",
    "Patterson, D. J."
  ],
  "contributor_department": "Adult and Continuing Education",
  "date_accessioned": "2014-03-14T20:12:52Z",
  "date_adate": "2006-06-07",
  "date_available": "2014-03-14T20:12:52Z",
  "date_issued": "1994-05-31",
  "date_rdate": "2011-08-22",
  "date_sdate": "2006-06-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>Various forms of popular culture serve to educate and socialize as well as influence human behavior. In a discipline such as criminal justice, little is known by the general public about the individuals involved with the system: the law enforcer, the victim, and the offender. Therefore, the construction of reality for most is likely to come from media representation.  </p><p>A content analysis was used as a method to systematically evaluate crime films over a period of 20 years to investigate what gender messages were apparent in the genre. A sample of 42 crime films was drawn beginning in 1972 through 1992. The main and supporting characters were analyzed to determine if gender differences existed in regard to occupational representation, victimization, and offending. Focus was on occupational representation. The data was compared to the official data to ascertain whether the gender representations in the films reflected the official data. Trends over the 20 year period were analyzed to determine if the portrayal of women and men over the years reflected the changes experienced in the criminal justice system.  </p><p>The research provided an understanding of the content of this form of popular culture. Males were more likely included in the films than females. This is consistent with the reality of male domination in the field of criminal justice and with past research which indicated that women were often excluded from films. Computed Chi-square tests indicated that significant relationships existed between sex and evidence of the police personality; sex and character appearance in casual, uniform, and seductive attire; sex and use of all types of force; sex and use of expert and coercive power; and sex and aggression as a style of conflict resolution. T Tests revealed that there were sex differences in character appearance in uniform and seductive attire, use of aggression as a style of conflict resolution, commission of crime, and commission of nonviolent crime.  </p><p>The films closely represented the official data in regard to male and female violent offenders with a small overrepresentation of female violence and an equally small underrepresentation of male violence. Women were underrepresented as property offenders and men were overrepresented. In terms of victimization, women were overrepresented as victims of violent crime and property crime.  </p><p>Over the two decades, women were consistently absent when compared to the number of men casted in the films; were consistently underrepresented as law enforcers, with the exception of two, three year intervals; and were most often casted as wives or girlfriends of law enforcers except in one, three year interval. Men were most likely to be seen as law enforcers in every interval, again consistent with the male domination seen in the law enforcement field. Sexism Level I films, indicating extreme sexism, was found to be at least in 67% of all films for each three interval except from 1984 to 1986. </p>",
  "description_provenance": [
    "Author Email: Vicky.Dorworth@montgomerycollege.edu",
    "Made available in DSpace on 2014-03-14T20:12:52Z (GMT). No. of bitstreams: 1 LD5655.V856_1994.D672.pdf: 5363942 bytes, checksum: a84b4c907975c50a9369872b454f42ad (MD5)   Previous issue date: 1994-05-31"
  ],
  "format_medium": "BTD",
  "handle": "27987",
  "identifier_other": "etd-06072006-124211",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06072006-124211/",
  "identifier_uri": "http://hdl.handle.net/10919/27987",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1994.D672.pdf",
  "subject": [
    "Women in motion pictures",
    "Mass media and criminal justice",
    "Police films History and criticism",
    "Sex role in motion pictures"
  ],
  "subject_lcc": "LD5655.V856 1994.D672",
  "title": "Learning about the criminal justice protagonists : a content analysis of gender messages in the crime film genre",
  "type": "Dissertation"
}