{
  "contributor_author": "Miller, Chad Richard",
  "contributor_committeecochair": [
    "Rees, Joseph V.",
    "Dudley, Larkin S."
  ],
  "contributor_committeemember": [
    "Hult, Karen M.",
    "Mayer, Heike",
    "Sirgy, M. Joseph"
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:12:51Z",
  "date_adate": "2006-07-26",
  "date_available": "2014-03-14T20:12:51Z",
  "date_issued": "2006-05-04",
  "date_rdate": "2006-07-26",
  "date_sdate": "2006-06-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This is an exploratory study that applies the dominant theories of the community power structure literature to the trend of regional cluster-based economic development policy in order to develop a conceptual framework of the political/institutional context of this â  newâ   approach. In order to develop a framework that can be utilized by practitioners, field studies were conducted in Austin, Texas; Portland, Oregon; Greenville/Spartanburg, South Carolina; Lynchburg, Virginia; and Roanoke, Virginia. The findings are that the major community power structure theories (i.e., market model, economic forces, civic culture, regime theory, the growth machine, and civic entrepreneurs) all provide important insights for the adoption of cluster-based policies.  Other important factors that need to be considered are the importance of public administrators, performance metrics, state context, institutional arrangements, elected officials, tax structure, and historical path dependency.  The implication for public administration is that the role of public administrators is contingent on the nature of the network governance structure.",
  "description_provenance": [
    "Author Email: chadm@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: heikem@vt.edu",
    "Advisor Email: sirgy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:51Z (GMT). No. of bitstreams: 2 ChadRMillerETDdissertation.pdf: 877958 bytes, checksum: 5e99134fdba576b676ff0a6e016e4256 (MD5) MillerIRBapproval.pdf: 22485 bytes, checksum: 70207a1a6896da2cdff7f54e1ac8de42 (MD5)   Previous issue date: 2006-05-04"
  ],
  "handle": "27984",
  "identifier_other": "etd-06072006-075555",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06072006-075555/",
  "identifier_uri": "http://hdl.handle.net/10919/27984",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ChadRMillerETDdissertation.pdf",
    "MillerIRBapproval.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Community Power Structures",
    "Economic Development",
    "Clusters",
    "Network Governance"
  ],
  "title": "The Tholian Web: The Political/Institutional Context of Regional Cluster-Based Economic Development",
  "type": "Dissertation"
}