{
  "contributor_author": "Hilburn, Daniel J.",
  "contributor_committeecochair": [
    "Pienkowski, Robert L.",
    "Allen, William A."
  ],
  "contributor_committeemember": [
    "Weidhaas, John A. Jr.",
    "Ravlin, Forrest W.",
    "Van Scoyoc, S. W.",
    "Cochran, D. G."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:12:51Z",
  "date_adate": "2006-06-07",
  "date_available": "2014-03-14T20:12:51Z",
  "date_issued": "1985-12-01",
  "date_rdate": "2006-06-07",
  "date_sdate": "2006-06-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Virginia is a natural laboratory for studying overwintering habits of the alfalfa weevi1. At higher elevations, winters are relatively harsh and weevil pressure on the alfalfa crop is usually light. Much heavier pressure is the rule at lower elevations where winters are milder. The goal of this study was to examine the effects of fall and winter temperatures, parasites, and fall regrowth management on population dynamics of overwintering stages of this insect. Sixteen commercial alfalfa fields in Montgomery Co. (elevation 610 m) and Bedford Co. (elevation 300 m) were used in the study. Approximately half the fields each year were either harvested or grazed to remove fall regrowth. In the other fields, fall regrowth was left standing through the winter. Six different pitfall trap designs were compared for collection efficiency, installation and servicing effort, and cost. Barrier traps outperformed the other trap designs and were inexpensive and easy to install and service. Sweepnet samples were used to monitor weevil adults during their fall migration. A newly designed sampling device which removes all plant material, litter, and approximately 2 cm of soil from a 1/20 m2 area, was used to measure absolute densities during fall and winter. Based on these absolute density samples fewer adults overwintered within fields in which fall regrowth was removed.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:12:51Z (GMT). No. of bitstreams: 1 LD5655.V856_1985.H542.pdf: 7111971 bytes, checksum: c9178c18601b77a55951740e350fa259 (MD5)   Previous issue date: 1985-12-01",
  "format_medium": "BTD",
  "handle": "27985",
  "identifier_other": "etd-06072006-124139",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06072006-124139/",
  "identifier_uri": "http://hdl.handle.net/10919/27985",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1985.H542.pdf",
  "subject": [
    "Alfalfa Diseases and pests Virginia",
    "Alfalfa weevil Reproduction Climatic factors",
    "Alfalfa weevil Seasonal distribution"
  ],
  "subject_lcc": "LD5655.V856 1985.H542",
  "title": "Population dynamics of overwintering life stages of the alfalfa weevil, Hypera postica (Gyllenhal)",
  "type": "Dissertation"
}