{
  "contributor_author": "Bowe, Scott Arthur",
  "contributor_committeechair": "Smith, Robert M.",
  "contributor_committeemember": [
    "Lamb, Fred M.",
    "Araman, Philip A.",
    "Smith, Paul",
    "Kline, D. Earl",
    "Van Aken, Eileen M.",
    "Bush, Robert J."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:12:51Z",
  "date_adate": "2000-06-13",
  "date_available": "2014-03-14T20:12:51Z",
  "date_issued": "2000-06-02",
  "date_rdate": "2001-06-13",
  "date_sdate": "2000-06-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A nation-wide survey of hardwood sawmills was conducted in the fall of 1999.  The objectives of the survey were to determine the differences between adopters and non-adopters of scanning and optimizing technology, identify the company expectations of scanning and optimizing technology, and model the adoption decision process for future scanning and optimizing technology.  These objectives were chosen because timely information was not available on the hardwood sawmill industry, and even less was known about the overall state of technology with the industry.  The survey consisted of a mail questionnaire which was sent to over 2000 hardwood sawmills.  The questionnaire was used to collect demographic, equipment, and preference scale information on the hardwood sawmill industry.  The second part of this project used the Analytic Hierarchy Process to model the adoption decision process for future scanning and optimizing technology in hardwood sawmills.  Data was collected through personal interviews with two hardwood sawmill groups including adopters and non-adopters of advanced scanning and optimizing technology.  The interviewee rated the importance of the decision factors in the adoption decision process.  They also rated the influence of four sawmill departments on the adoption decision process.  The results from the mail survey found that the average yearly lumber production was 7.6 million board feet per sawmill.  The most common type of scanning and optimizing technology, headrig optimization, was only in use by 27 percent of the responding mills.  Advanced scanning and optimizing technology such as edger-optimizers and trimmer-optimizers were only in use by 10 percent and 5 percent of the respondents respectively.  Adoption decision factors for scanning and optimizing technology were rated.  Improved raw material recovery and increased lumber revenues were the two most highly rated factors.  Accuracy of grading was the most highly rated factor for automated grading systems.  The adoption decision model found that production related issues were most important in the decision process and that the production department was the most influential of the sawmill departments.  Overall, scanning and optimizing technology adoption within the hardwood sawmill industry is low.  For those that have adopted advanced scanning and optimizing technology, production issues were the driving factors.",
  "description_provenance": [
    "Author Email: sbowe@vt.edu",
    "Advisor Email: rsmith4@vt.edu",
    "Advisor Email: fml195@vt.edu",
    "Advisor Email: paraman@vt.edu",
    "Advisor Email: pms6@psu.edu",
    "Advisor Email: kline@vt.edu",
    "Advisor Email: evanaken@vt.edu",
    "Advisor Email: rbush@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:51Z (GMT). No. of bitstreams: 1 Bowe.pdf: 4522024 bytes, checksum: 4c1e8a3d743b2f44f9ff0f3d30e145ea (MD5)   Previous issue date: 2000-06-02"
  ],
  "handle": "27982",
  "identifier_other": "etd-06072000-09170026",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06072000-09170026/",
  "identifier_uri": "http://hdl.handle.net/10919/27982",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bowe.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Scanning",
    "Optimizing",
    "Adoption",
    "Technology",
    "AHP",
    "Hardwood",
    "Sawmill",
    "Lumber",
    "Decision"
  ],
  "title": "Modeling the Adoption Decision Process of Future Scanning and Optimizing Technology in Hardwood Sawmills",
  "type": "Dissertation"
}