{
  "contributor_author": "Tirawattanawanich, Chanin",
  "contributor_committeechair": "Pierson, Frank William",
  "contributor_committeemember": [
    "Larson, Timothy J.",
    "Thatcher, Craig D.",
    "Knestrick, Corwin",
    "Toth, Thomas E.",
    "Larsen, Calvert T."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:12:53Z",
  "date_adate": "2001-06-12",
  "date_available": "2014-03-14T20:12:53Z",
  "date_issued": "2001-05-17",
  "date_rdate": "2002-06-12",
  "date_sdate": "2001-06-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In a number of mammalian species, susceptibility to enteric coronavirus infection has been shown to be age-related.  This is thought to be associated with enterocyte maturation and receptor protein expression.  One of the factors that can influence differentiation and maturation of enterocytes is the availability of short-chain fatty acids (SCFA) in the intestinal lumen.  These compounds are by-products of the bacterial fermentation of dietary fiber and serve as the primary energy source for enterocyte metabolism. The overall objective of this dissertation was to evaluate the effects of dietary fiber and short-chain fatty acids on enterocyte differentiation, maturation, and susceptibility to coronavirus infection in turkeys. Initial work involved the development of an indirect immunoperoxidase assay (IPA) for the identification and localization of turkey coronavirus (TCV) in paraffin-embedded, acid-ethanol fixed tissue.  IPA was found to be superior to indirect immunofluorescent antibody test (IFA) for this and other diagnostic purposes. To evaluate cellular differentiation and maturation, an SDS-PAGE/immunoblot technique was developed to determine relative levels of villin expression in turkey embryos.  Villin is an actin-bound cytoskeletal protein known to be expressed in increasing quantities at the apical surfaces of maturing enterocytes.  Villin expression level was found to increase linearly as a function of embryo age.  Villin localization was performed by IPA on paraffin-embedded, acid-alcohol fixed tissue.  As enterocytes (embryos) matured, villin was found to concentrate at the apical surfaces and eventually at the basolateral membranes.  Experiments were also conducted to see what effect in ovo butyrate administration would have on developing embryonic enterocytes.  Butyrate has been shown to enhance differentiation of non-neoplastic and neoplastic cells in culture as well as promote healing of damaged intestinal epithelium in human.  Villin expression was significantly enhanced in embryos receiving 0.2 and 0.3 M butyrate 36 hours post-administration.  Butyrate appeared to enhance villin expression and therefore enterocyte maturation in a dose-dependent manner. Susceptibility of turkey embryos to TCV infection as a function of age and butyrate treatment was investigated as well as epithelial localization of TCV infection in poults.  The level of TCV infection of epithelium was found to increase with embryo age between 17 and 23 days.  Poults showed higher levels of infection on the distal 2/3 of villi and no evidence of infection in the intestinal crypts.  Butyrate administration in 21-day-old embryos followed by TCV inoculation caused a significant increase of the number of infected cells per villus.  This data suggested that butyrate might be used as a means to manipulate enterocyte susceptibility to TCV infection. In the final set of experiments, the effects of fiber-fortified poult diets containing 5% cellulose or 5% guar gum on luminal SCFA levels, enterocyte maturation, and TCV infection were investigated.  SCFA levels in cecal contents were determined by gas chromatography.  Enterocyte maturation was assessed by the determination of villin expression on immunoblot and the severity of TCV infection was determined by IPA and lesion score.  Fiber-fortified diets enhanced SCFA production and villin expression, but contrary to embryo studies, TCV infection appeared to be reduced.  In general, poults performed better on the diet containing cellulose. Mechanisms regarding the roles of dietary fiber and SCFA in enterocyte differentiation, maturation, and TCV susceptibility are proposed as well as future directions for research.  The in ovo and poults system used in this research may serve as models for further investigation of the influences of host and dietary factors on enteric viral infection and recovery.",
  "description_provenance": [
    "Author Email: chanint@vt.edu",
    "Advisor Email: tilarson@vt.edu",
    "Advisor Email: cthatche@vt.edu",
    "Advisor Email: ttoth@vt.edu",
    "Advisor Email: clarsen@vt.edu",
    "Advisor Email: pierson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:53Z (GMT). No. of bitstreams: 1 etd1.pdf: 5990139 bytes, checksum: 38c757549ceaf22980d7dfea1bf32021 (MD5)   Previous issue date: 2001-05-17"
  ],
  "handle": "27995",
  "identifier_other": "etd-06082001-115207",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06082001-115207/",
  "identifier_uri": "http://hdl.handle.net/10919/27995",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "turkey coronavirus",
    "short-chain fatty acid",
    "enterocyte",
    "dietary fiber"
  ],
  "title": "The Modulating Effects of Dietary Fiber and Short-Chain Fatty Acids on Enterocyte Differentiation, Maturation and Turkey Coronavirus Infection",
  "type": "Dissertation"
}