{
  "contributor_author": "Lovett, Marilyn Price",
  "contributor_committeechair": "Parson, Stephen R.",
  "contributor_committeecochair": "Richards, Robert R.",
  "contributor_committeemember": [
    "Earthman, Glen I.",
    "Rehnback, Vikki Y.",
    "Parks, David J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:12:54Z",
  "date_adate": "2000-07-07",
  "date_available": "2014-03-14T20:12:54Z",
  "date_issued": "2000-05-03",
  "date_rdate": "2001-07-07",
  "date_sdate": "2000-06-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "(ABSTRACT)   A number of significant changes have occurred in our public schools in recent years. These changes include shifting federal program priorities, adoption of state curriculum standards, and the implementation of site-based decision-making. These changes come at a time when schools are experiencing significant changes in the ethnic and socioeconomic composition of their student body and when many families are struggling to meet challenges arising from poverty or job requirements. Attention has been given to the impact these changes are having on teachers, parents, and students. Little attention has been given, however, to the impact these changes are having on principals. The purpose of this study was to increase understanding of a principal's worklife in an achieving urban elementary school with a large number of at-risk students. The study examined one principal's methods of dealing with everyday problems associated with leading in a school that serves children of color and 98% of the students meet low-income criteria (i.e., they qualify for free or reduced-price lunch). Over the past five years, second grade students showed increases in reading beyond those achieved by minority students in the school division. Attendance rates over the past five years show improvement.  Interviews, observations, and the Multifactor Leadership Questionnaire (Bass & Avolio, 1995) were used to collect data. From these data, a case study was written. The report of case study findings describes the worklife of the principal, school characteristics, and school outcomes. Conclusions drawn from the case study indicate that the worklife of the principal has similarities to the worklife of other elementary principals. However, due to school characteristics and external factors elementary principals serving in urban schools with a large number of at-risk students can expect an escalated level of intensity and demand on a daily basis.  Findings of this study have relevance for urban elementary school principals desiring to increase achievement. Further, findings suggest that urban elementary schools serving a large number of at-risk students can achieve successful outcomes.",
  "description_provenance": [
    "Author Email: marilovett@aol.com",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: robertr@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:54Z (GMT). No. of bitstreams: 3 Backmatter1.pdf: 133435 bytes, checksum: 3b77052a5baf03b39169a390869f4c3d (MD5) FrontMatter.1.pdf: 24457 bytes, checksum: 2a0e3b02b7801447b1d697ea8844a9f2 (MD5) Section1.PDF: 316816 bytes, checksum: 3bda44cda72de8a976e1fd939a918cc4 (MD5)   Previous issue date: 2000-05-03"
  ],
  "handle": "27999",
  "identifier_other": "etd-06092000-14590056",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06092000-14590056/",
  "identifier_uri": "http://hdl.handle.net/10919/27999",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Backmatter1.pdf",
    "FrontMatter.1.pdf",
    "Section1.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Elementary Principal",
    "Principal Leadership Behavior",
    "Principal Worklife",
    "Urban Elementary School"
  ],
  "title": "Understanding the Challenge:The Worklife of a Principal in an Achieving Urban Elementary School with a Large Number of At-risk Students",
  "type": "Dissertation"
}