{
  "contributor_author": "Armstrong, Stephanye Dawn",
  "contributor_committeemember": [
    "Tissue, Brian M.",
    "Glanville, James O.",
    "Bell, Harold M.",
    "Stipes, R. Jay",
    "McNair, Harold M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:12:53Z",
  "date_adate": "1999-06-10",
  "date_available": "2014-03-14T20:12:53Z",
  "date_issued": "1999-06-04",
  "date_rdate": "2000-06-10",
  "date_sdate": "1999-06-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Microwave-Assisted Extraction for the Isolation of Trace Systemic Fungicides from Woody Plant Material    By  Stephanye Armstrong  Department of Chemistry  Virginia Polytechnic Institute and State University  (ABSTRACT)  \tThe extraction and recovery of trace organic material from semi-solid and solid matrices is often the slowest and most error-prone step of an analytical method. The conventional liquid extraction techniques for solids and semi-solids materials (Soxhlet) have two main disadvantages.  The first, large volumes of organic solvent are required, which can lead to sample contamination and \"losses\" due to volatilization during concentration steps. The second, to achieve an exhaustive extraction can require several hours to days. With the development of sophisticated instrumentation with detection limits in the picogram and femtogram levels, pressure is finally felt within the analytical community to develop and validate sample preparation procedures which can be used to rapidly isolate trace level organics from complex matrices. \tBecause of its applicability to solid, semi-solid, and liquid matrices microwave-assisted (MAE) extraction has emerged as a powerful sample preparation technique. The objective of this research was to evaluate directly focused microwave energy for the isolation of systemic fungicide residues from woody plant tissues. \tThe hallmark of microwave extraction (MAE) is accelerated dissolution kinetics as a consequence of the rapid heating processes that occur when a microwave field is applied to a sample.  The current popularity of MAE resides mainly on its applicability to a wide range of sample types because the selectivity can be easily manipulated by altering solvent polarities.   \tPropiconazole is a systemic fungicide, used to combat the fungal pathogen Ophiostoma ulmi, the casual agent of Dutch elm disease (DED).  It was successfully extracted from treated Ulmus americana (elm tree) using MAE with a percent recovery of 395% in 15 minutes. Until now, techniques for rapid and efficient extraction of polar material from wood were non-existent. This work produces results much quicker than Supercritical Fluid Extraction (SFE).  The influence of pH, microwave power, and time on extraction efficiency was also investigated.  The extraction methodology was optimized and statistically validated. \tThis MAE method combined with GC-MS was used to study the diffusion patterns and degradation of propiconazole in tree bark over extended time periods. Because of the complex nature of woody plant systems, it was realized that a more theoretical means must be used to determine the degradation rate of propiconazole in water systems.  As a result, propiconazole was reacted with water under controlled temperature and pH conditions; to measure the degradation rate of propiconazole. \tThe internal pH of elm sap is about 6.0; the slightly acidic environment and natural enzymes within the xylem vessels are known to catalyze the degradation of propiconazole (1). Novartis Inc. has marketed propiconazole as having fungicidal effects in injected elms for nearly two years.  Our degradation studies have indicated much shorter lifetimes. To confirm our fate studies, the activation energy for the degradation reaction of propiconazole was calculated. This information provided valuable insight into revising dosage and treatment frequency for maximum protection of the elm against Dutch elm disease. Anti-fungal activity among metabolites was also explored.  This is the first reported use of MAE to monitor the degradation of systemic pesticides in woody plant material.",
  "description_provenance": [
    "Author Email: starmstr@vt.edu",
    "Advisor Email: hmcnair@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:53Z (GMT). No. of bitstreams: 1 Diss.pdf: 2083883 bytes, checksum: 9198e4a3a3f3ff28c6095561ba161fa6 (MD5)   Previous issue date: 1999-06-04"
  ],
  "handle": "27997",
  "identifier_other": "etd-060899-161452",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-060899-161452/",
  "identifier_uri": "http://hdl.handle.net/10919/27997",
  "publisher": "Virginia Tech",
  "relation_haspart": "Diss.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Fungicides and Wood Tissue",
    "GC-MS",
    "Sample Preparation",
    "MAE"
  ],
  "title": "Microwave-Assisted Extraction for the Isolation of Trace Systemic Fungicides from Woody Plant Material",
  "type": "Dissertation"
}