{
  "contributor_author": "Eraydin, Mert Kerem",
  "contributor_committeechair": "Yoon, Roe-Hoan",
  "contributor_committeecochair": "Adel, Gregory T.",
  "contributor_committeemember": [
    "Luttrell, Gerald H.",
    "Yildirim, Ismail"
  ],
  "contributor_department": "Mining and Minerals Engineering",
  "date_accessioned": "2014-03-14T20:12:52Z",
  "date_adate": "2009-06-23",
  "date_available": "2014-03-14T20:12:52Z",
  "date_issued": "2009-05-06",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-06-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Coal preparation plants use large quantities of water for cleaning processes.  Upon cleaning, the spent water must be removed such that the final product moisture level meets market constraints.  However, removal of free water from the surface of fine particles is difficult and costly, and often the results are less than desirable.  Fine particles inherently have very large surface areas, and hence retain large amounts of water.  Increased amounts of fines also cause denser particle packing, which creates relatively small capillaries in filter cakes and, thus, cause slower dewatering kinetics.  As a result, dewatering costs for fine particles are much higher than for dewatering coarse particles.  Considering the technical and economic issues associated with dewatering coal and mineral fines, an extensive matrix of laboratory- and pilot-scale dewatering tests have been conducted to evaluate the use of novel dewatering aids.  The reagents are designed to lower the surface tension of water, increase the hydrophobicity of the particles to be dewatered, and increase the capillary radius by hydrophobic coagulation.  All of these are designed to lower the moisture of the filter cakes produced in mechanical dewatering processes.  Laboratory-scale dewatering tests confirmed that using the novel dewatering aids can lower the final cake moisture of coal by 20-50%, while increasing the dewatering kinetics.  Several on-site, pilot-scale tests were conducted to demonstrate that the process of using the novel dewatering aids can be scaled.<p> Based on the laboratory- and pilot-scale tests conducted, a scale-up model for the process of using the novel dewatering aids has been developed.  It can predict the final cake moistures as a function of vacuum pressure, filtration time and specific cake weight.  The model can be useful for the scale-up of vacuum disc filters (VDF) and horizontal belt filters (HBF).  Simulation results indicate that dewatering aids can be very effective, especially when used in conjunction with HBF due to its ability to control cake thickness and drying cycle time independently.  <p> In light of the promising laboratory- and pilot-scale test results, an industrial demonstration of the novel dewatering aids has been conducted at the Smith Branch impoundment site, which contains 2.9 million tons of recoverable coal.  When the reagent was used for dewatering flotation products using a VDF, the moisture content was reduced from 26 to 20% at 0.5 lb/ton of reagent addition and to 17.5% at 1 lb/ton.  The use of the dewatering aid also improved the kinetics of dewatering, increased the throughput, and reduced the power consumption of vacuum pumps by 30%.<p> The novel dewatering aids were also tested successfully for dewatering of kaolin clays.  In this case, the mineral was treated with a cationic surfactant before adding the dewatering aids.  This two-step hydrophobization process was able to reduce the cake moisture and also increase the throughput.",
  "description_provenance": [
    "Author Email: meeraydi@vt.edu",
    "Advisor Email: luttrell@exchange.vt.edu",
    "Advisor Email: ismailyildirim@imerys.com",
    "Advisor Email: ryoon@vt.edu",
    "Advisor Email: adel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:52Z (GMT). No. of bitstreams: 1 Eraydin-Dissertation.pdf: 6707959 bytes, checksum: e3283da9c011ead3a91fdc80e9033ab9 (MD5)   Previous issue date: 2009-05-06"
  ],
  "handle": "27990",
  "identifier_other": "etd-06072009-233035",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06072009-233035/",
  "identifier_uri": "http://hdl.handle.net/10919/27990",
  "publisher": "Virginia Tech",
  "relation_haspart": "Eraydin-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Clay",
    "Coal",
    "Flocculation",
    "Copper",
    "Dewatering",
    "Hydrophobicity",
    "Moisture",
    "Flotation",
    "Dewatering Aid",
    "Vacuum",
    "Disc",
    "Horizontal Belt Filter"
  ],
  "title": "Scale-up of Using Novel Dewatering Aids",
  "type": "Dissertation"
}