{
  "contributor_author": "Pert, Heather Anne",
  "contributor_committeecochair": [
    "McMullin, Steve L.",
    "Dolloff, C. Andrew"
  ],
  "contributor_committeemember": [
    "Aust, Wallace Michael",
    "Smith, David William",
    "Stauffer, Dean F."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:12:53Z",
  "date_adate": "2001-06-19",
  "date_available": "2014-03-14T20:12:53Z",
  "date_issued": "2000-12-06",
  "date_rdate": "2002-06-19",
  "date_sdate": "2001-06-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Development of goals (desired future conditions (DFCs)) based on substantial public involvement is critical to the success of ecosystem management on public lands.  I evaluated DFCs of riparian areas on national forests in the southern Appalachian mountains and evaluated a process for involving the public in development of DFCs for riparian areas on the Jefferson National Forest.  First, I identified the major components, structures, and functions that are essential to riparian health through a literature review.  Second, I examined how the key components, structures, and functions identified in the literature review were addressed in the DFCs and standards and guidelines for eight southeastern national forest management plans.  In reviewing forest plans, I found a clear shift from emphasizing water quality in older forest plans to a more comprehensive incorporation of the values and functions of riparian areas in more recent plans.  Riparian attributes included in DFCs varied widely and disparities between DFCs for forest plans and measurable criteria in the standards and guidelines often occurred.  Finally, I designed, tested, and evaluated a public involvement process that identified public values for use in the development of  DFCs for riparian areas on the Jefferson National Forest.  I used a combination of alternative dispute resolution techniques and the Analytic Hierarchy Process (AHP), a participatory decision-making tool.  I used surveys before and after the riparian meetings to evaluate the effectiveness of the public involvement process.  Survey respondents generally were middle-aged, well-educated, high-income males who were long-time residents of the area.  Riparian meeting participants indicated that the DFC for riparian areas on the JNF should strongly emphasize water quality and quantity, protection of riparian-dependent species and their habitats, and maintenance of the integrity of the relationship between riparian areas and the surrounding environment.  Participants indicated recreational and commodity uses of riparian areas could occur as long as they did not negatively affect the other, more highly valued characteristics of riparian areas.  Participants felt that the meetings were fair, that diverse interests were represented, that they had enough information to participate in the process, and that it was a wise use of their time.",
  "description_provenance": [
    "Author Email: hpert@earthlink.net",
    "Advisor Email: waust@vt.edu",
    "Advisor Email: smithdwm@vt.edu",
    "Advisor Email: smcmulli@vt.edu",
    "Advisor Email: adoll@vt.edu",
    "Advisor Email: dstauffer@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:53Z (GMT). No. of bitstreams: 2 Pert02Appendix.pdf: 3580165 bytes, checksum: e31b2c21df575ac90a84e2389e0e5ca0 (MD5) Pert01Dissertation.pdf: 1154191 bytes, checksum: ca93d7872b874fcf0cd11ed7ade0cb27 (MD5)   Previous issue date: 2000-12-06"
  ],
  "handle": "27994",
  "identifier_other": "etd-06082001-021014",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06082001-021014/",
  "identifier_uri": "http://hdl.handle.net/10919/27994",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Pert02Appendix.pdf",
    "Pert01Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "public values",
    "southern Applachians",
    "Analytic Hierarchy Process",
    "ecosystem managment",
    "public involvement",
    "forest planning"
  ],
  "title": "Desired Future Conditions of Riparian Areas on Southeastern National Forests",
  "type": "Dissertation"
}