{
  "contributor_author": "Eschenmann, Travis  Wade",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_committeemember": [
    "Potter, Kenneth R.",
    "Burton, John K.",
    "Moore, David"
  ],
  "contributor_department": "Instructional Design and Technology",
  "date_accessioned": "2014-03-14T20:12:53Z",
  "date_adate": "2012-07-24",
  "date_available": "2014-03-14T20:12:53Z",
  "date_issued": "2012-04-30",
  "date_rdate": "2012-07-24",
  "date_sdate": "2012-06-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Research has identified a relationship between instructional design and learner control, principally in face to face educational settings, where the selection of control types will have an impact on the learner.  However, as Miltiadou and Savenye (2003) note, more research is required that will \"shed light on which motivational constructs can be identified as predictors of success in an online environment.\" (p. 21).  In both the corporate and academic arenas, there is a growing interest in online courses; however, there is a lack of sufficient studies on the effects of design criterion that can potentially heighten learner motivation and reduce attrition rates in online courses. Abdul-Rahman (1994) identified a similar concern with respect to dropout rates and suggested that \"identifying factors that interact to affect students' completion or non-completion of a distance education course\" (p. 9) would go a long way to arming administrators and distance educators with information and tools that will help reduce learner attrition in distance education. <p> This experimental study will test the relationship between learner control and locus of control as measured by scores on an assessment administered to selected employees of the Automobile Associate of America (AAA) Mid-Atlantic.  The independent variables will be learner control and locus of control.  Locus of control will be defined by each learnerâ  s score on the Adult Nowicki-Strickland Locus of Control Scale.  Three dependent variables will be measured including assessment score, number of minutes spent in the learning program and amount of content viewed in an online, asynchronous course.",
  "description_provenance": [
    "Author Email: vpitrav@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: moored@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:53Z (GMT). No. of bitstreams: 2 Eschenmann_TW_D_2012_1.pdf: 1437505 bytes, checksum: 3906263e2435af6500970b2b2280ef44 (MD5) Eschenmann_TW_D_2012_Copyright.pdf: 28359 bytes, checksum: 9431c15b826905d97dbdcb475bfa2e41 (MD5)   Previous issue date: 2012-04-30"
  ],
  "handle": "27996",
  "identifier_other": "etd-06082012-141446",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06082012-141446/",
  "identifier_uri": "http://hdl.handle.net/10919/27996",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Eschenmann_TW_D_2012_1.pdf",
    "Eschenmann_TW_D_2012_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "learner",
    "control",
    "LOC"
  ],
  "title": "An Experimental Study to Test the Relationship Between Learner Control and Locus of Control on e-Learning in a Corporate Context",
  "type": "Dissertation"
}