{
  "contributor_author": "Lewis, NKrumah D'Angelo",
  "contributor_committeechair": "Bailey, Carol A.",
  "contributor_committeemember": [
    "Fuhrman, Ellsworth R.",
    "Graves, Ellington T.",
    "Shoemaker, Donald J.",
    "Kershaw, Terry"
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:12:55Z",
  "date_adate": "2005-07-07",
  "date_available": "2014-03-14T20:12:55Z",
  "date_issued": "2005-05-24",
  "date_rdate": "2006-07-07",
  "date_sdate": "2005-06-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Utilizing qualitative methodology, this study examines how, from their perspective, a sample of lower-class black men ages 20-35 justify their participation in violent confrontations and define the concept of disrespect.  The purpose of this study is to glean whether or not a relationship exists between the rationales offered for participating in violent confrontations and being \"dissed.\"   This study also seeks to examine the interpersonal dynamics that compose a violent confrontation, shifting the level of analysis from macro-level arguments of the past.  The research demonstrates that the rationales for interpersonal violence surround four themes: (1) Self-defense; (2) trespassing on territory; (3) acting in the defense of third parties; and (4) threatening behavior.  It was declared by the respondents that the following actions were found to be disrespectful:  (1) verbal insults/derogatory comments/mockery directed at the individual or a third party, openly or covertly; (2) being yelled at; (3) threats of physical harm or violence directed at the individual or a third party; and finally (4) physical infringements on personal boundaries and/or territories real or perceived.  The findings of the study suggest that the actions identified by the respondents as their rationales for participating in violent confrontations are largely consistent with behaviors, verbalizations and/or gestures that they defined as being disrespectful.  Findings deduced from this study resulted in the construction of a model of how disrespect potentially leads to violent confrontations.  Subsequent to the research this study contrasts its findings with the subculture of violence theory postulated by Wolfgang and Ferracuti (1967), thereby demonstrating the need for an expansion of the initial corollaries.",
  "description_provenance": [
    "Author Email: nlewis@vt.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: egraves@vt.edu",
    "Advisor Email: shoemake@vt.edu",
    "Advisor Email: tkershaw@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:55Z (GMT). No. of bitstreams: 3 Lewis_DissertationBody.pdf: 428739 bytes, checksum: 24976b7e632019ea8c88b1186bbe6a3e (MD5) Lewis_TableofContents.pdf: 34872 bytes, checksum: 84ff0cc55b80be3e06aca721cdf7948d (MD5) Lewis_TitlePage.pdf: 4767 bytes, checksum: 0114d5ee78b6cbf8e72ea87532ee9c32 (MD5)   Previous issue date: 2005-05-24"
  ],
  "handle": "28007",
  "identifier_other": "etd-06102005-091844",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06102005-091844/",
  "identifier_uri": "http://hdl.handle.net/10919/28007",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Lewis_DissertationBody.pdf",
    "Lewis_TableofContents.pdf",
    "Lewis_TitlePage.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "intra-racial violence",
    "interpersonal violence",
    "black-on-black violence",
    "disrespect"
  ],
  "title": "A Study of Intra-Racial Violence Among Black Males: A Matter of \"Diss\"Respect",
  "type": "Dissertation"
}