{
  "contributor_author": "Mil-Homens, Joao",
  "contributor_committeecochair": [
    "Randolph, John",
    "Rees, Joseph V."
  ],
  "contributor_committeemember": [
    "Rich, Richard C.",
    "Ebrahim, Alnoor S."
  ],
  "contributor_department": "Urban Affairs and Planning",
  "date_accessioned": "2014-03-14T20:12:55Z",
  "date_adate": "2011-07-25",
  "date_available": "2014-03-14T20:12:55Z",
  "date_issued": "2011-05-23",
  "date_rdate": "2011-07-25",
  "date_sdate": "2011-06-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Hundreds of thousands of organizations have chosen to boost their competitive position by demonstrating compliance to the ISO 14001 Environmental Management System standard. In order for these standards to become credible policy options, they must ensure the capacity to build an industrial morality and to institutionalize responsibility. Relying on a series of in-depth interviews with environmental auditors, this dissertation contributes to a deeper empirical understanding of these regulatory instruments by, first, exploring how the adoption of an EMS promotes self-regulatory capacity and contributes toward effective environmental protection, and second, discussing the limitations of its accountability structure and the threats to the credibility of the standard. This project highlights several misconceptions associated with the role of ISO 14001, and explains why both public and private sectors hold conflicting and inappropriate expectations regarding the certification process. According to the environmental auditors interviewed, the standard has helped thousands of committed organizations to effectively improve their self-regulatory capacity as well as their environmental performance. Yet, organizations with no intrinsic motivation can take advantage of the flexibility granted by the standard and the limitations of the conformity assessment process, to obtain an empty environmental certificate. ISO 14001 is a process standard that can help both â  environmental leaders and laggardsâ  , but that cannot differentiate organizations based on their level of environmental performance. Because of that, ISO 14001 is increasingly perceived as a socially unacceptable certification system. This project concludes that ISO 14001 is a double edge regulatory instrument that aims both to foster self-regulatory powers, and to act as a market signaling agent. The problem lies in the fact that these two facets of the standard are actually detrimental to each other, perpetuating a cycle that contributes to the discredit of the standard and of the auditing community. In the future, ISO 14001 needs to adjust its non-prescriptive nature and its accountability mechanism, to the character of the organizations seeking certification. In alternative, a new generation of certification programs is emerging, building upon the ISO 14001 standard with an extra layer of requirements, and with a more meaningful role for the environmental auditor.",
  "description_provenance": [
    "Author Email: joaomh@gmail.com",
    "Advisor Email: energy@vt.edu",
    "Advisor Email: ressj@vt.edu",
    "Advisor Email: urban@vt.edu",
    "Advisor Email: aebrahim@hbs.edu",
    "Made available in DSpace on 2014-03-14T20:12:55Z (GMT). No. of bitstreams: 2 MILHOMENS_D_2011.pdf: 1497175 bytes, checksum: 1764a254e59bd12bad8120e78969a4ba (MD5) MILHOMENS_CERTIF.pdf: 96443 bytes, checksum: 98edafdc1082e5f95d505126612aa668 (MD5)   Previous issue date: 2011-05-23"
  ],
  "handle": "28005",
  "identifier_other": "etd-06092011-114149",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06092011-114149/",
  "identifier_uri": "http://hdl.handle.net/10919/28005",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "MILHOMENS_D_2011.pdf",
    "MILHOMENS_CERTIF.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Audit",
    "Certification",
    "ISO 14001",
    "Self-Regulation",
    "Environmental Management Systems"
  ],
  "title": "Labeling Schemes or Labeling Scams?: Auditors' Perspectives on ISO 14001 Certification",
  "type": "Dissertation"
}