{
  "contributor_author": "Mjoni-Mwale, Hasten",
  "contributor_committeechair": "Tlou, Josiah S.",
  "contributor_committeemember": [
    "Barksdale, Mary Alice",
    "Niles, Jerome A.",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:54Z",
  "date_adate": "2006-06-21",
  "date_available": "2014-03-14T20:12:54Z",
  "date_issued": "2006-04-03",
  "date_rdate": "2006-06-21",
  "date_sdate": "2006-06-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examined public primary school teachersâ   perceptions of the factors contributing to safe school learning environments. Teachersâ   perceptions and behaviors were examined to assist task force members to develop and conduct a self-study process for enhancing a safe learning environment for pupils.  Twenty-eight primary school teachers from one public primary school in Malawi participated in the study. Data on teachersâ   perceptions and behaviors were collected through a survey. Frequencies and percentages were used to analyze the survey data on teachersâ   perceptions. The data from the self-study process generated the discussions in the task force meetings where teachers shared their perceptions of classroom practices that contributed to a safe learning environment.   The task force conducted a four-step self-study process. The steps of the process were building awareness and community, developing a group focus, implementing the ideas of the group focus, and reflecting on the practice. The participating teachersâ   experiences suggested that the process discouraged teachers from direct instruction and encouraged them to actively engage students more in their learning. As a result the teachers experienced fewer discipline problems in their classes.   The perceptions of teachers in the survey indicated that the school environment was generally positive for teaching and learning. However, there were some elements that could adversely affect school safety. For example, there were problems in maintaining some of the school facilities such as books and childrenâ  s latrines. The finding of the self-study process indicated that the school could develop elements of school safety. For example, the teachers in the study developed positive attitudes toward their teaching and learning. They reported for school activities on time and involved learners in their learning.   The study had a number of implications for teaching and learning and teacher educators. The self-study process, for example, was able to change teachersâ   attitudes about their learners, thereby enhancing the learner-teacher classroom relationship. Suggestions for further research are also given. For example, further studies could focus on the replication of the study in other schools in order to examine the self-study process in different school contexts. And such replication could assist further understanding and refinement of the self-study process for addressing school safety as well as other identified school problems.",
  "description_provenance": [
    "Author Email: hmjonimw@vt.edu",
    "Advisor Email: tlou@vt.edu",
    "Advisor Email: mbarksda@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:54Z (GMT). No. of bitstreams: 1 Dissertation-Mwale.pdf: 2937762 bytes, checksum: bf33962ac10f93b01457b135bc675e67 (MD5)   Previous issue date: 2006-04-03"
  ],
  "handle": "28001",
  "identifier_other": "etd-06092006-133416",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06092006-133416/",
  "identifier_uri": "http://hdl.handle.net/10919/28001",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-Mwale.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "school improvement",
    "safe learning environment",
    "teachers' behaviors",
    "public primary schools in Malawi",
    "professional development"
  ],
  "title": "Safe Schools for Teaching and Learning: Developing a School-wide, Self-study Process",
  "type": "Dissertation"
}