{
  "contributor_author": "LoMascolo, Anna F.",
  "contributor_committeechair": "Kiecolt, K. Jill",
  "contributor_committeemember": [
    "Rothschild, Joyce",
    "Calasanti, Toni M.",
    "Bailey, Carol A."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:12:54Z",
  "date_adate": "2008-07-10",
  "date_available": "2014-03-14T20:12:54Z",
  "date_issued": "2008-05-29",
  "date_rdate": "2008-07-10",
  "date_sdate": "2008-06-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examines the identity work strategies that men students in nursing, elementary education, and social work programs employ in order to manage and assert their masculinity in the face of negative gender assessment, as well as the identity work involved in verifying their professional identities.  It also examines the perceived benefits and disadvantages that men experience as numerical minorities in their fields of study.  Interviews with 12 men students majoring in these disciplines reveal that while men do perceive disadvantages as men in these educational spheres, they believe that the advantages and benefits they enjoy in the form of special treatment, recognition, and access to opportunity far outweigh them.  A key perceived disadvantage is the ongoing challenges they face to their social identity as men and their role identity as rising professionals.  These men employ identifiable identity work strategies for doing masculinity; some of which have implications for gender equality in the educational setting, as well as in on-site training (i.e., workplace) settings as well.  This study contributes to an understanding of how men verify contradictory identities, and how gender shapes, privileges, and constrains their lives.  In addition, it builds on extant literature focusing on menâ  s experiences in higher education as they prepare for careers in gender-nontraditional occupations.",
  "description_provenance": [
    "Author Email: alomasco@vt.edu",
    "Advisor Email: joycevt@aol.com",
    "Advisor Email: toni@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: kiecolt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:54Z (GMT). No. of bitstreams: 1  LoMascolo_Dissertation.pdf: 842008 bytes, checksum: 23a44c737e40e911bff8204336b249a4 (MD5)    Previous issue date: 2008-05-29"
  ],
  "handle": "28002",
  "identifier_other": "etd-06092008-103049",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06092008-103049/",
  "identifier_uri": "http://hdl.handle.net/10919/28002",
  "publisher": "Virginia Tech",
  "relation_haspart": "LoMascolo_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Social Workers",
    "Tokenism",
    "Nontraditional Occupations",
    "Higher Education",
    "Expectation States Theory",
    "Elementary School Teachers",
    "Nurses",
    "Status Characteristics Theory",
    "Masculinities",
    "Identity Work",
    "Identity Control Theory"
  ],
  "title": "\"Do You Want Excitement?  Don't Join the Army, Be a Nurse!\": Identity Work and Advantage among Men in Training for the Female Professions",
  "type": "Dissertation"
}