{
  "contributor_author": "Talley, Jr., Zebedee",
  "contributor_committeecochair": [
    "Hein, Serge F.",
    "Driscoll, Lisa G."
  ],
  "contributor_committeemember": [
    "Burge, Penny L.",
    "Dixon, Benjamin",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:12:54Z",
  "date_adate": "2009-07-07",
  "date_available": "2014-03-14T20:12:54Z",
  "date_issued": "2009-05-05",
  "date_rdate": "2009-07-07",
  "date_sdate": "2009-06-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Abstact</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>This study involved a qualitative investigation of Black middle school students' experiences of teacher characteristics that they saw as influential in their learning and achievement. The sample consisted of 8 students selected from a public middle school in central Virginia . Data collection involved both in-depth individual interviews and classroom observations. Interviews focused on the participants' early educational experiences, middle school experiences with teachers, and experiences of the role that teachers play in learning and achievement. Classroom observations provided additional insight into the classroom setting, participants' actions, and participants' interactions with teachers and other students and were conducted to minimize their influence on classroom activities. </p> <p>A whole-text analysis of the interview transcripts and field notes generated 5 major categories: elementary school experiences, instructional environment, student motivation, student trust, and racism. For each category, subcategories were also developed. Participants were motivated by teacher trust, encouragement, and expectations. They emphasized the need for equity in the classroom as a prerequisite to academic achievement. They were also motivated to learn by teachers who shared instructional and personal time, spoke positively to them about their future, shared their own educational experiences, and demonstrated a caring attitude toward them. Participants described how they were not motivated to learn by teachers who were viewed as racist, yelled at them, refused to spend time assisting them, or displayed an attitude of apathy. They also expressed how they were sometimes denied bathroom privileges, were separated from White students during class, were treated as if they were â  invisible,â   or were treated like second-class citizens. They also experienced racism as prevalent in teachers' grading practices. </p> <p>Significant findings include the following: (a) the Black middle school student participants' educational experiences influenced their learning and the classroom environment, (b) duration of instructional time influenced students' learning, (c) high teacher expectations of students and teacher encouragement of discussions beyond course subject matter increased students' motivation to learn, (d) development of a trusting teacherâ  student relationship promoted their learning, and (e) various forms of racism decreased students' willingness to learn. Implications of the findings for educational practice and further research are discussed. </p> </body> </html>",
  "description_provenance": [
    "Author Email: ztalley@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: bcdixon@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: shein@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:54Z (GMT). No. of bitstreams: 1 TalleyETD.pdf: 416344 bytes, checksum: 30de5a994e0aeab31c42e3574139ffc0 (MD5)   Previous issue date: 2009-05-05"
  ],
  "handle": "28003",
  "identifier_other": "etd-06092009-074624",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06092009-074624/",
  "identifier_uri": "http://hdl.handle.net/10919/28003",
  "publisher": "Virginia Tech",
  "relation_haspart": "TalleyETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Achievement Gap",
    "Black Middle School Students",
    "Teacher Characteristics",
    "Student Learning",
    "Student Achievement"
  ],
  "title": "A Qualitative Investigation of Black Middle School Students' Experiences of the Role of Teachers in Learning and Achievement",
  "type": "Dissertation"
}