{
  "contributor_author": "Elkins, Casey Lynn",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "McGrath, James E.",
    "Riffle, Judy S.",
    "Armentrout, R. Scott",
    "Ward, Thomas C."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:12:55Z",
  "date_adate": "2005-08-15",
  "date_available": "2014-03-14T20:12:55Z",
  "date_issued": "2005-06-08",
  "date_rdate": "2005-08-15",
  "date_sdate": "2005-06-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In an effort to synthesize macromolecules comprising both covalent and non-covalent bonding to tune ultimate physical properties, a variety of methodologies and functionalization strategies were employed.  First, protected functional initiation, namely 3-[(N-benzyl-N-methyl)amino]-1-propyllithium and 3-(t-butyldimethylsilyloxy)-1-propyllithium, in living anionic polymerization of isoprene was used to yield well-defined chain end functional macromolecules.  Using both initiating systems, polymers with good molar mass control and narrow molar mass distributions were obtained and well-defined chain end functionality was observed.  There was no observed effect on the polymer microstructure from the polar functionality in the initiator, with ~92% 1,4- and 8% 3,4-enchainment observed in each case.  Further investigation of the 3-[(N-benzyl-N-methyl)amino]-1-propyllithium initiated polyisoprenes proved that facile deprotection was not possible and residual catalyst was not removable from the polymer.  However, polymers initiated with 3-(t-butyldimethylsilyloxy)-1-propyllithium were quantitatively hydrogenated and deprotected under relatively mild conditions to yield hydroxyl functional macromolecules in several architectures, including linear and star-shaped.  Excellent conversion from arm polymer to star polymer was observed and well-defined macromolecules were obtained.  Subsequently, a series of non-functional, hydroxyl functional, and 2-ureido-4[1H]-pyrimidone (UPy) chain end functional linear and star-shaped poly(ethylene-co-propylene)s were synthesized and characterized.  The melt phase properties were investigated using melt rheology and the effect of macromolecular topology and multiple hydrogen bond functionality was investigated.  Linear UPy functional poly(ethylene-co-propylene)s exhibited increased viscosity and shear thinning onset at lower frequencies than non-functional polymers of similar molar mass due to interaction of the multiple hydrogen bonding groups.  Star-shaped UPy functional poly(ethylene-co-propylene)s showed inhibition to terminal flow and the absence of a zero shear viscosity in melt rheological characterization, indicative of a network like structure imparted from the multiple hydrogen bonding interactions. \tIn addition, the living anionic polymerization of D3 was controlled using the functionalized initiators\t3-[(N-benzyl-N-methyl)amino]-1-propyllithium and 3-(t-butyldimethylsilyloxy)-1-propyllithium.  Good molar mass control and narrow molar mass distributions were observed.  In contrast to the polyisoprene homopolymers, facile deprotection of the 3-(t-butyldimethylsilyloxy)-1-propyllithium was not possible due to the acid sensitivity of the poly(dimethylsiloxane) backbone.  However, facile deprotection of the protected secondary amine was achieved through hydrogenolysis and well-defined terminal amine functionalized poly(dimethylsiloxane) was synthesized, which are then amenable to further functionalization reactions. \tIn contrast to the well-defined polymers synthesized using living anionic polymerization, free radical polymerizations was used to synthesize free radical copolymers with broader polydispersities and pendant UPy groups.  These copolymers were compared with a simple dimeric hydrogen bonding carboxylic acid containing copolymer.\t  Melt rheological characterization revealed that, at similar concentrations, the effect of the UPy group was much greater than the carboxylic acid, and broadened plateau moduli and increased viscosity for the UPy containing polymers were observed, while the acid containing polymer exhibited similar results to a non-functional control.  The dynamic viscosity was observed to increase systematically with increasing UPyMA incorporation and the quadruple hydrogen bonding interactions were observed to dissociate between ~80-150 °C.",
  "description_provenance": [
    "Author Email: chudelso@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: tward@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:55Z (GMT). No. of bitstreams: 1 ElkinsDissertation2.pdf: 2577784 bytes, checksum: d9aa51a0500fa1da03b8ec18d93940f2 (MD5)   Previous issue date: 2005-06-08"
  ],
  "handle": "28008",
  "identifier_other": "etd-06102005-124923",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06102005-124923/",
  "identifier_uri": "http://hdl.handle.net/10919/28008",
  "publisher": "Virginia Tech",
  "relation_haspart": "ElkinsDissertation2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "anionic polymerization",
    "multiple hydrogen bonding",
    "isoprene",
    "radical polymerization",
    "melt rheology"
  ],
  "title": "Living Polymerization for the Introduction of Tailored Hydrogen Bonding",
  "type": "Dissertation"
}