{
  "contributor_author": "Smith, Sonny",
  "contributor_committeechair": "Khademian, Anne Meredith",
  "contributor_committeemember": [
    "Murch, Randall",
    "Roberts, Patrick S.",
    "Wolfe, James F."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:12:55Z",
  "date_adate": "2009-07-21",
  "date_available": "2014-03-14T20:12:55Z",
  "date_issued": "2009-05-27",
  "date_rdate": "2009-07-21",
  "date_sdate": "2009-06-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The events of 9-11 resulted in a slew of policy, procedural, and organizational changes within many government departments as the U.S. government took many steps to enhance security to prevent future terrorist attacks.  The emphasis on high threat targets by the Department of Homeland Security (DHS) and other government agencies, such as the White House, the Capitol and Congressional office buildings, major infrastructure and facilities within US cities, airline travel, ports and economic supply chains has generated a great deal of debate and attention. There are however, targets that are considered low risk situated in high threat areas that also provide open access to the public for which security professionals are responsible that should not be overlooked during the War on Terror. The question is how low risk targets in high threat areas should be protected?  What resource distribution makes sense?  What practices should be applied to achieve security?  The purpose of this research is to look at one of these targets, the Smithsonian Institution and how the Smithsonian Institutionâ  s Office of Protection Services (SI OPS) responded to the terror attacks of 9-11 and the ongoing threat. Four factors will be examined: (1) the screening process, (2) the budget, (3) the security policy formulation process, and (4) training.   The study focus is based on data derived from semi-structured interviews and a review of SI documents. Examining post 9-11 security changes allows one to see how SI OPS has evolved in its attempt to meet both internal security demands and expectations against an external security concern. The findings reveal SI OPS initially underwent significant changes within the four factors in the three years following the attacks of 9-11. However, limited resources and manpower strains have played major roles in the subsequent decline in some of the factors after their initial increases.  Although a return to the security levels immediately following 9-11 may not be imminent, it is recommended that OPS management make stronger efforts to communicate with non-security managers and return to more stringent visitor screening procedures.",
  "description_provenance": [
    "Author Email: sosmith@vt.edu",
    "Advisor Email: rmurch@vt.edu",
    "Advisor Email: robertsp@vt.edu",
    "Advisor Email: humpty@vt.edu",
    "Advisor Email: akhademi@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:55Z (GMT). No. of bitstreams: 1 SonnySmithDissertation.pdf: 475040 bytes, checksum: 92552eb43385dc4427d873f660ed7e6c (MD5)   Previous issue date: 2009-05-27"
  ],
  "handle": "28004",
  "identifier_other": "etd-06092009-192958",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06092009-192958/",
  "identifier_uri": "http://hdl.handle.net/10919/28004",
  "publisher": "Virginia Tech",
  "relation_haspart": "SonnySmithDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "security screening",
    "public institutions",
    "The Smithsonian Institution",
    "protection services",
    "terrorism",
    "open access",
    "high threat",
    "low risk"
  ],
  "title": "Low Risk, High Threat, Open Access Security in a Post 9-11 World: A study of the Smithsonian Institutionâ  s Office of Protection Services",
  "type": "Dissertation"
}