{
  "contributor_author": "Cole, Elise Marie",
  "contributor_committeechair": "Piercy, Fred P.",
  "contributor_committeemember": [
    "Dolbin-MacNab, Megan L.",
    "Keeling, Margaret L.",
    "Wolfe, Edward W."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:12:55Z",
  "date_adate": "2008-07-14",
  "date_available": "2014-03-14T20:12:55Z",
  "date_issued": "2008-05-29",
  "date_rdate": "2008-07-14",
  "date_sdate": "2008-06-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Family therapists face a dramatic increase in the cultural diversity of their clients. Multicultural competence will help family therapists meet the needs of their increasingly diverse clientele (Kocarek, Talbot, Batka, & Anderson, 2001).  The measurement of multicultural competence is necessary in order to evaluate the outcomes of multicultural competence programs and the services that minority persons receive.  This study reports the development of an instrument to assess clientsâ   perceptions of their therapistsâ   multicultural competence that can be used in individual and family therapy.   This instrument was developed through three phases: item generation and theme development, client feedback and evaluation of interrater reliability, and pilot and validity testing. Winsteps (Linacre, 2001) software was used to scale the measurement data to the Rasch Rating Scale Model, and evaluate the dimensionality, rating scale use, item fit, person fit, reliability and precision, as well as to create norms for interpreting the measures. Preliminary support for the MTCI-CV suggests a fairly reliable and valid measure at this stage. Additionally, logistic ordinal regressions were conducted to determine whether MTCI-CV measures are associated with client satisfaction level and goal attainment level.  We found that positive client perceptions of therapist cultural competence (on the MTCI-CV) significantly contribute to the probability of clients expressing satisfaction and goal attainment in therapy.",
  "description_provenance": [
    "Author Email: emcole@vt.edu",
    "Advisor Email: mdolbinm@vt.edu",
    "Advisor Email: mkeeling@vt.edu",
    "Advisor Email: edwolfe@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:55Z (GMT). No. of bitstreams: 1 DevelopmentoftheMulticulturalTherapyCompetencyInventoryClientVersion.pdf: 3574248 bytes, checksum: 19c2f6a88f98a6b988458675044bce2c (MD5)   Previous issue date: 2008-05-29"
  ],
  "handle": "28011",
  "identifier_other": "etd-06102008-152119",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06102008-152119/",
  "identifier_uri": "http://hdl.handle.net/10919/28011",
  "publisher": "Virginia Tech",
  "relation_haspart": "DevelopmentoftheMulticulturalTherapyCompetencyInventoryClientVersion.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Multicultural Therapy Competence",
    "Instrument Development"
  ],
  "title": "Development of the Multicultural Competency Inventory-Client Version",
  "type": "Dissertation"
}