{
  "contributor_author": "Zelazny, Lucian M.",
  "contributor_committeecochair": [
    "Tegarden, David P.",
    "Belanger, France"
  ],
  "contributor_committeemember": [
    "Arthur, James D.",
    "Sen, Tarun K.",
    "Barkhi, Reza"
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:12:56Z",
  "date_adate": "2011-06-17",
  "date_available": "2014-03-14T20:12:56Z",
  "date_issued": "2011-06-08",
  "date_rdate": "2012-04-06",
  "date_sdate": "2011-06-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation increases our understanding of information system project success by investigating how software development team members define the success of an information system development effort.  The theoretical model of ISD success is developed and tested.  ISD success is measured through the eyes of the software development team membersâ   since they are the most influential stakeholders during the development of the system.  This dissertation was conducted in two phases: 1) theory building and 2) theory testing.  The theory building phase began with a thorough literature review.  Semi-structured interviews were conducted and the data analyzed to add emergent concepts to the model.  The result of the theory building phase is the theoretical model of ISD success.    The theory testing stage began with the development and validation of a survey instrument to measure the constructs and subconstructs found within the theoretical model of ISD success.  Data was collected and the model tested using partial least squares regression.  The findings indicate that software development team members view ISD success as being composed of process quality, functional product quality, non-functional product quality, team member benefits, and team member satisfaction.  Team member satisfaction is highly influenced by team member benefits, moderately influenced by functional product quality and slightly influence by non-functional product quality and process quality.    Software development team members view process quality as being composed of within budget and process maturity; non-functional product as being composed of reliability, usability, testability, and efficiency; team member benefits as being composed of learning and teamwork; and team member satisfaction as being composed of product satisfaction, process satisfaction, and personal satisfaction.  Software development team members do not view on time as a significant contributor to their definition of process quality; they do not view modifiability, portability, or reusability as significant contributors to their definition of non-functional product quality; and they do not view recognition as a significant contributor to team member benefits.",
  "description_provenance": [
    "Author Email: lzelazny@vt.edu",
    "Advisor Email: arthur@vt.edu",
    "Advisor Email: tksen@vt.edu",
    "Advisor Email: reza@vt.edu",
    "Advisor Email: david.tegarden@vt.edu",
    "Advisor Email: belanger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:56Z (GMT). No. of bitstreams: 2 Zelazny_LM_D_2011.pdf: 6271674 bytes, checksum: 067f79e8a20fe36fa77a5dee6870d005 (MD5) Zelazny_LM_D_2011_IRBForms.pdf: 726459 bytes, checksum: cd7751b461d2c3d509843837ede1d39a (MD5)   Previous issue date: 2011-06-08"
  ],
  "handle": "28014",
  "identifier_other": "etd-06102011-111054",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06102011-111054/",
  "identifier_uri": "http://hdl.handle.net/10919/28014",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Zelazny_LM_D_2011.pdf",
    "Zelazny_LM_D_2011_IRBForms.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "team member benefits",
    "team member satisfaction",
    "product quality",
    "process quality",
    "information systems development success",
    "IS success",
    "grounded theory"
  ],
  "title": "Toward a Theory of Information System Development Success: Perceptions of Software Development Team Members",
  "type": "Dissertation"
}