{
  "contributor_author": "Vaughan , Tamisha  Y.",
  "contributor_committeechair": "Liwu Li",
  "contributor_committeemember": [
    "Xiang-Jin Meng",
    "Dongmin Liu",
    "Finkielstein, Carla V."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:12:56Z",
  "date_adate": "2010-06-16",
  "date_available": "2014-03-14T20:12:56Z",
  "date_issued": "2010-05-28",
  "date_rdate": "2013-05-21",
  "date_sdate": "2010-06-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Obesity over the last several has become a major health concern in our country as well as the world.  Obesity is also one of the risk factors which lead to several inflammatory complications such as diabetes, artherosclerosis, etc.  Two leading factors involved in the causes of inflammatory complications include leptin and low dose endotoxin lipopolysaccharide (LPS). However, the mechanism underlying the involvement of these two mediators is not clearly understood.  The purpose of this study is to understand the mechanism underlying inflammatory complications caused by leptin and low dose endotoxin most recently coined metabolic endotoxemia.  Interleukin-Receptor Associated Kinase 1 (IRAK-1) is an intracellular signaling component shown to activate NFÎºB which leads to the induction of proinflammatory mediators.  Deletion of IRAK-1 in mice has beneficial effects in alleviating inflammatory complications and human variations in IRAK-1 gene are correlated with higher risks for inflammatory diseases.  Therefore, we hypothesized that IRAK-1 is critically involved for the induction of proinflammatory mediators induced by leptin and low dose LPS.  IL-6 mRNA levels were measured in THP-1 (human monocytic cells) and wild type and IRAK-deficient bone marrow derived macrophages (BMDM) challenged with different combinations of leptin and LPS.  Data shows that leptin alone will not induce inflammatory mediators.  However, increased induction of IL-6 was observed in a synergistic manner involving both LPS and leptin in an IRAK-1 dependent manner causing a robust inflammatory response.  With regard to the effect of low dose LPS, we observed that human monocytic cells treated with low concentrations of LPS showed a mild yet sustained induction of proinflammatory cytokines, which is contrast to the robust and transient induction of cytokines by a high dose LPS. To further determine the molecular mechanisms, we measured several key signaling molecules that include IRAK-1, IKKepsilon, and C/EBPdelta. Our study revealed a novel mechanism that appears to be distinct from the traditional NFï «B pathway responsible for the effect of low dose LPS.",
  "description_provenance": [
    "Author Email: vaughant@vt.edu",
    "Advisor Email: xjmeng@vt.edu",
    "Advisor Email: doliu@vt.edu",
    "Advisor Email: lwli@vt.edu",
    "Advisor Email: finkielc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:56Z (GMT). No. of bitstreams: 1 VaughanTamishaDissertation2010.pdf: 1649801 bytes, checksum: b75ffb085e547e8dc88f6829650f5dd4 (MD5)   Previous issue date: 2010-05-28"
  ],
  "handle": "28013",
  "identifier_other": "etd-06102010-152211",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06102010-152211/",
  "identifier_uri": "http://hdl.handle.net/10919/28013",
  "publisher": "Virginia Tech",
  "relation_haspart": "VaughanTamishaDissertation2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Toll-like Receptors (TLR)",
    "Cell Signaling",
    "Lipopolysaccharide (LPS)",
    "Metabolic Endotoxemia",
    "Macrophage Activation"
  ],
  "title": "Novel Mechanisms Underlying the Inflammatory Effects of Leptin and Low Dose Endotoxin",
  "type": "Dissertation"
}