{
  "contributor_author": "Chang, Peta-Gaye Suzette",
  "contributor_committeechair": "Tolin, Sue A.",
  "contributor_committeemember": [
    "Stromberg, Erik L.",
    "Maroof, M. A. Saghai",
    "Hansen, Mary Ann",
    "Veilleux, Richard E.",
    "Vinatzer, Boris A."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:12:56Z",
  "date_adate": "2009-07-06",
  "date_available": "2014-03-14T20:12:56Z",
  "date_issued": "2009-05-29",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-06-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Diagnostics is important in the development and implementation of pest management strategies. The virus diagnostic capabilities of several plant pathology collaborators within the Integrated Pest Management Collaborative Research Support Program (IPM CRSP) host countries were evaluated with the aid of a survey. Very few plant disease diagnostic clinics had funds to cover daily operations despite over half of the responding clinics receiving an operational budget. Academically and government affiliated clinics within the developing host countries had little access to molecular tools and equipment, relying mostly on biological and serological methods. Clinics affiliated with private companies and within the USA relied more upon molecular assays. Ten CMV isolates identified by tissue blot immunoassay (TBIA) were collected from a garden at the Historic Smithfield Plantation on the Virginia Tech campus, and from Painter, Virginia on the Eastern Shore. Three CMV isolates from Smithfield were biologically compared to six early CMV isolates stored since the 1970s, while all isolates were compared serologically and molecularly. Sequences obtained after reverse transcription-polymerase chain reaction (RT-PCR) assigned the CMV isolates into subgroups, with eleven to subgroup 1A and three to subgroup 2. The subgroup assignments were confirmed by TBIA using CMV subgroup-specific monoclonal antibodies (Agdia Inc). At Smithfield Plantation, another virus, Turnip mosaic virus (TuMV) was identified from Dameâ  s Rocket (Hesperis matronalis L.). This is the first report of TuMV in Virginia.Â  In TBIA virus-infected plant samples are blotted onto nitrocellulose membranes, dried, and processed. Membranes can be stored for long periods of time and transported safely across borders without risk of introducing viruses into new environments, but virus remains immunologically active for several months. Methods were developed with CMV and three potyviruses, using the same membranes, for detecting viral RNA by RT-PCR and direct sequencing of PCR products.. Amplification by RT-PCRÂ  was possible after membrane storage for up to 15 months. The membranes also performed well with samples sent from IPM CRSP host countries and within the USA. This method should improve molecular diagnostic capabilities in developing countries, as samples can be blotted to membranes and sent to a centralized molecular laboratory for analysis.",
  "description_provenance": [
    "Author Email: sexy66@vt.edu",
    "Advisor Email: elstrom@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: maryannh@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: vinatzer@vt.edu",
    "Advisor Email: stolin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:56Z (GMT). No. of bitstreams: 1 PgsChang_Dissertation_Final.pdf: 3162688 bytes, checksum: a50298dc22586769ab251a1eccd21063 (MD5)   Previous issue date: 2009-05-29"
  ],
  "handle": "28017",
  "identifier_other": "etd-06112009-121920",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06112009-121920/",
  "identifier_uri": "http://hdl.handle.net/10919/28017",
  "publisher": "Virginia Tech",
  "relation_haspart": "PgsChang_Dissertation_Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "antibody",
    "subgroup diversity",
    "Tobacco etch virus",
    "Soybean mosaic virus",
    "Turnip mosaic virus"
  ],
  "title": "Plant Virus Diagnostics: Comparison of classical and membrane-based techniques for immunoassay and coat protein sequence characterization for Cucumber mosaic virus and three potyviruses",
  "type": "Dissertation"
}