{
  "contributor_author": "Burge, Jamika D",
  "contributor_committeechair": "Tatar, Deborah Gail",
  "contributor_committeemember": [
    "Smith-Jackson, Tonya L.",
    "Ehrich, Roger W.",
    "Kavanaugh, Andrea L.",
    "Pérez-Quiñones, Manuel A."
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2014-03-14T20:12:55Z",
  "date_adate": "2007-07-24",
  "date_available": "2014-03-14T20:12:55Z",
  "date_issued": "2007-04-23",
  "date_rdate": "2007-07-24",
  "date_sdate": "2007-06-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation work considers communication between people.  I look at coordinating dyads (couples in relationships) and people in working relationships to develop an understanding of how people engage in high-stakes, or emotional communication via various communicative media.  The approach for this research is to observe and measure peopleâ  s behavior during interaction and subsequent reporting of that behavior and associated internal experiences.  Qualitative and quantitative methods are employed.  Quantitative data are analyzed using a range of statistical analyses, including correlations matrices, ANOVAs, and multivariate statistics.  Two controlled laboratory experiments were conducted for this research.  These experiments involved couples in relationships.  Couples were brought into the lab and argued with each other across one of three technological media: face-to-face, telephone, and instant messaging (IM).  In one set of couplesâ   experiments, the couples argued for twenty minutes; in the subsequent couplesâ   experiment, couples were encouraged to take as much time as they needed for their arguments.  One of the main results from the first experiment is that couples did, indeed, argue when brought into a laboratory setting.  One of the important findings for the second experiment is that time did not affect couplesâ   tendency to reach closure during their arguments.  This research is a contribution in that it examines how people engage in highly emotional communication using various technological media.  In a society with ever-increasing communication needs that require technology, it becomes necessary to study its communicative affordances.  Understanding the context of highly emotional interactions between members of couples gives insight into how technology meets (or fails to meet) these communication needs.",
  "description_provenance": [
    "Author Email: jaburge@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: ehrich@cs.vt.edu",
    "Advisor Email: kavan@vt.edu",
    "Advisor Email: tatar@vt.edu",
    "Advisor Email: perez@cs.vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:55Z (GMT). No. of bitstreams: 1 JB_Final_Dissertation_2007.pdf: 3148516 bytes, checksum: 6ab1753bf06bd2b9e4bcad815e761f97 (MD5)   Previous issue date: 2007-04-23"
  ],
  "handle": "28010",
  "identifier_other": "etd-06102007-180720",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06102007-180720/",
  "identifier_uri": "http://hdl.handle.net/10919/28010",
  "publisher": "Virginia Tech",
  "relation_haspart": "JB_Final_Dissertation_2007.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "high-stakes (affective) interaction",
    "psycholinguistics",
    "human-computer interaction (HCI)",
    "Mediated interpersonal communication",
    "computer-mediated communication (CMC)"
  ],
  "title": "Communication of Emotion in Mediated and Technology-Mediated Contexts: Face-to-Face, Telephone, and Instant Messaging",
  "type": "Dissertation"
}