{
  "contributor_author": "Taylor, Crystal Berry",
  "contributor_committeechair": "Heath-Camp, Betty A.",
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:57Z",
  "date_adate": "2001-06-12",
  "date_available": "2014-03-14T20:12:57Z",
  "date_issued": "2001-05-09",
  "date_rdate": "2002-06-12",
  "date_sdate": "2001-06-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT       The new federal legislation focusing on student achievement, critical reports of the public educational system, and the artificial distinction between academic and career and technical education, have combined to create an urgent need for the integration of academic and career and technical education (Finch & Crunkilton, 1999).  The literature suggests that integration is one alternative to raising student achievement of all students and helps to prepare them for the workplace (Benson, 1989; Lankard, 1994; Brown, 1998; Stasz, Kaganoff, & Eden, 1994).       The purpose of this study was to determine the extent to which teachers and principals in HSTW sites perceive precursors (consisting of integration strategies and conditions) to integrate academic and career and technical education are present in their schools.  In addition, comparisons of perceptions were examined based on school type, school size, and school location.  The sample included 168 academic and career and technical education teachers and 36 principals from 36 HSTW sites in Virginia.         Based on the findings from the factor analysis, precursors to integrate academic and career and technical curricula can be grouped into two relatively coherent latent factors: collaboration and academic skill preparation.  Multivariate analysis of variance (MANOVA) revealed that there were significant differences in the perceptions of teachers and principals.  The multivariate analysis of variance also revealed significant differences based on school type only.        Recommendations were made to assist teachers and principals to devise a plan to identify integration precursors that teachers perceive are not present in their schools.  This information will be useful to principals and educational leaders for evaluating integration activities so they can provide support and guidance to increase integration activities in schools.",
  "description_provenance": [
    "Author Email: crtaylor@vt.edu",
    "Advisor Email: heathb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:57Z (GMT). No. of bitstreams: 1 DissertationVERSION2.PDF: 504815 bytes, checksum: b431db293ef83ee6c4f8ebbb8affc4df (MD5)   Previous issue date: 2001-05-09"
  ],
  "handle": "28020",
  "identifier_other": "etd-06122001-110038",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06122001-110038/",
  "identifier_uri": "http://hdl.handle.net/10919/28020",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationVERSION2.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Career and Technical Education",
    "Precursors",
    "Academic",
    "Integrating"
  ],
  "title": "Teachers' and Principals' Perceptions of Precursors to Integrating Academic and Career and Technical Education",
  "type": "Dissertation"
}