{
  "contributor_author": "Mmela, Edith",
  "contributor_committeechair": "Barksdale, Mary Alice",
  "contributor_committeemember": [
    "Tlou, Josiah S.",
    "Niles, Jerome A.",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:58Z",
  "date_adate": "2006-06-21",
  "date_available": "2014-03-14T20:12:58Z",
  "date_issued": "2006-04-04",
  "date_rdate": "2006-06-21",
  "date_sdate": "2006-06-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of the study was to discover how teachers learn to teach. This was done through the process of answering the question â  How does a teacher acting as a co-researcher come to understand the learner-centered integrated literacy approaches in an English classroom in Malawi?â   The learner-centered integrated literacy approaches is a concept derived from a constructivist philosophy of teaching. English is an important language in Malawi because it is the official language (Kayambazinthu, 1998). For that reason children are motivated to learn it as a second language. However, their achievement in English is critically low (Banda, Mchikoma, Chimombo, & Milner, 2001;Kishindo, Susuwere, Ndalama & Mwale, 2005; Williams, 1993). According to Ministry of Education and UNICEF (1998) and Williams (1993) teachersâ   complete reliance on traditional teacher-centered approaches was believed to be one of the major causes of school childrenâ  s failure to acquire English as a second language for their literacy development in Malawi. The assumption was that improving teacher practice by introducing constructivists-based, learner-centered, integrated literacy approaches, which are believed to be more effective for second language learning, than the former, would illuminate how teachers learn and ultimately improve teacher education practices and consequently teacher English teaching in the classroom. \tData were collected from pre- and post-study interviews, a series of audio taped lesson planning and lesson reflections, lesson observation summaries, and a researcherâ  s journal.  Data analysis and interpretation suggested that teacher learning is a gradual developmental process that depended very much on other interlaced processes of collaboration, inquiry, and reflective practice. It also demonstrated that the learner-centered integrated literacy approaches of the constructivism-based philosophy, which are also included in the Malawi curriculum but implementation is still a challenge in the primary classes, are possible. The results and process of the study could be used to improve teacher learning in Malawi. Finally, the study experience has illuminated the need for more exploration in the new areas of growth in English literacy.",
  "description_provenance": [
    "Author Email: emmela@vt.edu",
    "Advisor Email: tlou@vt.edu",
    "Advisor Email: mbarksda@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:58Z (GMT). No. of bitstreams: 1 Dissertation-Mmela.pdf: 3733189 bytes, checksum: 4c1665fc922b8fa7bc7c036d1870d174 (MD5)   Previous issue date: 2006-04-04"
  ],
  "handle": "28025",
  "identifier_other": "etd-06122006-144104",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06122006-144104/",
  "identifier_uri": "http://hdl.handle.net/10919/28025",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-Mmela.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "reflection",
    "collaborative inquiry",
    "teacher learning",
    "second language learning",
    "professional development"
  ],
  "title": "Implementing Integrated Literacy Approaches in an English Classroom in Malawi",
  "type": "Dissertation"
}