{
  "contributor_author": "Chen, Yu",
  "contributor_committeechair": "McNabb, F. M. Anne",
  "contributor_committeecochair": "Sible, Jill C.",
  "contributor_committeemember": [
    "Klein, Bradley G.",
    "Denbow, Donald Michael",
    "Moore, Ignacio T."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:12:59Z",
  "date_adate": "2008-08-05",
  "date_available": "2014-03-14T20:12:59Z",
  "date_issued": "2008-04-28",
  "date_rdate": "2009-08-05",
  "date_sdate": "2008-06-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Perchlorate ion interferes with thyroid function by competitively inhibiting the sodium-iodide symporter, thus blocking iodide uptake into the thyroid gland.  In this study, the effect of perchlorate exposure on thyroid function and thyroid-responsive gene expression were examined in (1) embryos from eggs laid by perchlorate-treated Japanese quail hens and (2) perchlorate-treated young Japanese quail.  I hypothesized that perchlorate exposure would decrease thyroid function and that the consequent hypothyroidism would alter the expression of thyroid sensitive genes.  Laying Japanese quail hens were treated with 2000 mg/l and 4000 mg/l ammonium perchlorate in drinking water. Eggs from these hens were incubated. Embryos, exposed to perchlorate in the egg, were sacrificed at day 14 of the 16.5 day incubation period.  Japanese quail chicks, 4-5 days old, were treated with 2000 mg/l ammonium perchlorate in drinking water for 2 and 7.5 weeks.  Thyroid status was evaluated by measuring plasma thyroid hormone concentrations, thyroid gland weight and thyroidal thyroid hormone storage.  Expression of thyroid-responsive genes was evaluated by measuring the mRNA levels of Type 2 deiodinase (D2) in the brain and liver, RC3/neurogranin mRNA level in the brain and Spot 14 mRNA level in the liver.  Maternal perchlorate exposure led to embryonic hypothyroidism, demonstrated by thyroid hypertrophy and very low embryonic thyroidal TH storage.  Embryonic hypothyroidism decreased body growth and increased D2 mRNA level in the liver (a presumed compensatory response to hypothyroidism) but did not affect the mRNA levels of D2 and RC3 in the brain.  Spot 14 mRNA was not detected in embryonic liver.   In the second part of the study, quail chicks showed early signs of hypothyroidism after two weeks of 2000 mg/l ammonium perchlorate exposure; plasma concentration and thyroid gland stores of both T4 and T3 were significantly decreased. After 7.5 weeks of perchlorate exposure, all thyroid variables measured indicated that the chicks had become overtly hypothyroid.  D2 mRNA level was increased, a compensatory response to hypothyroidism, and spot 14 mRNA level was decreased, a substrate-driven response in the liver of quail chicks after two weeks of perchlorate exposure.  However, no difference was observed in the mRNA levels of D2 and spot 14 in the liver after 7.5 weeks of perchlorate exposure, suggesting there was some adaptation to the hypothyroid condition.  The mRNA level of D2 and RC3 in the brain was not affected by perchlorate-induced hypothyroidism in quail chicks after either 2 or 7.5 weeks of perchlorate exposure.  As in the embryos, this suggests the brain of chicks was â  protectedâ   from the hypothyroid body conditions.",
  "description_provenance": [
    "Author Email: cyrain@vt.edu",
    "Advisor Email: bklein@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Advisor Email: happy@vt.edu",
    "Advisor Email: siblej@vt.edu",
    "Advisor Email: itmoore@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:59Z (GMT). No. of bitstreams: 1 YuChen.pdf: 1928784 bytes, checksum: 08ee5a993009d26b3f49b75511699d1f (MD5)   Previous issue date: 2008-04-28"
  ],
  "handle": "28027",
  "identifier_other": "etd-06122008-165301",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06122008-165301/",
  "identifier_uri": "http://hdl.handle.net/10919/28027",
  "publisher": "Virginia Tech",
  "relation_haspart": "YuChen.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Type 2 deiodinase",
    "ammonium perchlorate",
    "Japanese quail",
    "Spot 14",
    "RC3/neurogranin",
    "thyroid hormones",
    "thyroid disruption"
  ],
  "title": "Effects of ammonium perchlorate exposure on the thyroid function and the expression of thyroid-responsive genes in Japanese quail embryos and post hatch chicks",
  "type": "Dissertation"
}