{
  "contributor_author": "Metcalf, Sara Catherine",
  "contributor_committeechair": "Harris, Larry A.",
  "contributor_committeemember": [
    "Burton, John K.",
    "Yardley, Dianne R.",
    "Tripp, Norman Wayne",
    "Niles, Jerome A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:12:57Z",
  "date_adate": "2001-06-13",
  "date_available": "2014-03-14T20:12:57Z",
  "date_issued": "2001-05-24",
  "date_rdate": "2002-06-13",
  "date_sdate": "2001-06-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<HTML> <!--This file created 4:08 PM  6/12/01 by Claris Home Page version 3.0--> <HEAD>    <TITLE>abstract</TITLE>    <META NAME=GENERATOR CONTENT=\"Claris Home Page 3.0\">    <X-CLARIS-WINDOW TOP=54 BOTTOM=402 LEFT=8 RIGHT=476>    <X-CLARIS-TAGVIEW MODE=minimal> </HEAD> <BODY BGCOLOR=\"#FFFFFF\"> <CENTER>A Needs Assessment of North Carolina School Psychological Services,  <P>Moving Toward the Ideal</P>  <P>&nbsp;</P>  <P>by</P>  <P>Sara Catherine Metcalf</P>  <P>Chair: Larry Harris</P>  <P>Department of Teaching and Learning</P>  <P>&nbsp;</P>  <P>(ABSTRACT)</P></CENTER>  <P>Basic information has not been available about which psychological services school psychologists view as most important for the children enrolled in North Carolina public schools. This study was conducted to a) present an accurate portrait of the services currently provided by North Carolina school psychologists, b) report what school psychologists say they should be doing, and c) develop recommendations for policy changes that will provide a basis for moving toward improved services in the field.</P>  <P>School psychologists practicing in North Carolina were surveyed in phase I of this study to determine what services they currently provide (actual services) and what services they believe should be provided (ideal services) to benefit children. Services were ranked on level of importance. Respondents were also asked to comment on school psychological services in North Carolina as well as for suggestions to improve services. Demographic information was collected. In phase II of this study, survey findings were presented to a panel of experts in the field of school psychology who followed group process procedures to determine priorities and recommend appropriate next steps.</P>  <P>This study found the largest gaps between actual and ideal functioning in the survey categories of Consultation and Relationships to Other Professionals. Interventions, evaluations for special education services, and consultation, were rated among the most important services. Survey respondents made suggestions for the improvement of services including reducing the testing load and increasing the number of psychologists. The expert panel placed accountability through communication as highest priority for action leading toward improved services.</P>  <P>Recommendations to improve school psychological services in North Carolina were made for the North Carolina School Psychology Association (NCSPA), local education agencies (LEAs), and school psychologists. Recommendations for NCSPA included a.) appointing a task force to organize and lead efforts to increase policymaker and stakeholder knowledge regarding psychological services, b.) recruiting school systems for the purpose of conducting pilot studies to further investigate ways to close gaps between actual and ideal services, c.) providing guidance for increasing effective communication among North Carolina school psychologists. LEAs were encouraged to conduct needs assessments of their own, and recommendations for school psychologists included individual ways to increase consultation and intervention. Further research recommendations were also made.</P>  <P>&nbsp;</P>  <P></P> </BODY> </HTML>",
  "description_provenance": [
    "Author Email: smetcalf@vt.edu, cmetcalf@pinehurst.net",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: dyardley@vt.edu",
    "Advisor Email: ptrivett@wsfcs.k12.nc.us",
    "Advisor Email: lharris@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:57Z (GMT). No. of bitstreams: 1 metcalfsc.pdf: 1072061 bytes, checksum: 5ae2e0348237151137f1888613a82f02 (MD5)   Previous issue date: 2001-05-24"
  ],
  "handle": "28021",
  "identifier_other": "etd-06122001-160933",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06122001-160933/",
  "identifier_uri": "http://hdl.handle.net/10919/28021",
  "publisher": "Virginia Tech",
  "relation_haspart": "metcalfsc.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "North Carolina",
    "needs assessment",
    "school psychology"
  ],
  "title": "A Needs Assessment of North Carolina School Psychological Services, Moving Toward the Ideal",
  "type": "Dissertation"
}