{
  "contributor_author": "Ananieva-Stoyanova, Elitsa Antonova",
  "contributor_committeechair": "Gillaspy, Glenda E.",
  "contributor_committeemember": [
    "Tholl, Dorothea B.",
    "Tu, Zhijian Jake",
    "Sitz, Thomas O."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:12:59Z",
  "date_adate": "2009-06-25",
  "date_available": "2014-03-14T20:12:59Z",
  "date_issued": "2009-06-08",
  "date_rdate": "2012-03-27",
  "date_sdate": "2009-06-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "To survive, an organism must constantly adjust its internal state to changes in the environment from which it receives signals. The signals set off a chain of events referred to signal transduction. Signal transduction systems are especially important in multicellular organisms, such as plants and animals, because of the need to coordinate the activities of hundreds to trillions of cells. Plants, in particular, have a special need for perceiving signals from their environment because of their static nature. As in the animal cell, the first steps in perception of a signal include signal interaction with a receptor, signal amplification through second messenger production, and signal termination through second messenger hydrolysis. Myo-inositol polyphosphate 5-phosphatases (5PTases) (EC 3.1.3.56) have unique signal terminating abilities toward the second messenger inositol trisphosphate (Ins (1,4,5)P3, InsP3). In Arabidopsis thaliana there are 15 members of the 5PTase family, the majority of which contain a single 5PTase catalytic domain.  Four members of the Arabidopsis 5PTase family, however, have a unique protein domain structure, with additional N-terminal WD40 repeats that are implicated in protein-protein interactions.  The research presented here focused on the identification of 5PTase interacting proteins and the characterization of their functional role in Arabidopsis. To accomplish this goal, I examined a 5PTase13-interacting protein, the sucrose (Suc) nonfermenting-1-related kinase, SnRK1.1, an important energy sensor that is highly conserved among eukaryotes.  My identification of a 5PTase13:SnRK1.1 complex points to the novel interaction of this metabolic modulator and inositol signaling/metabolism. 5PTase13 , however, plays a regulatory role in other plant specific processes as well, since I also identified the Arabidopsis homolog (Atp80) of the human WDR48 (HsWDR48, Hsp80) as a novel protein interactor of 5PTase13.  My results indicate that Atp80 is important for leaf emergence, development and senescence likely via a regulatory interaction with 5PTase13 and PINOID â  binding protein (PBP1).",
  "description_provenance": [
    "Author Email: eanani75@vt.edu",
    "Advisor Email: tholl@vt.edu",
    "Advisor Email: jaketu@vt.edu",
    "Advisor Email: tositz@vt.edu",
    "Advisor Email: gillaspy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:59Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 3369966 bytes, checksum: 99dfcc8792dc52611786a486417cf679 (MD5)   Previous issue date: 2009-06-08"
  ],
  "handle": "28028",
  "identifier_other": "etd-06122009-111248",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06122009-111248/",
  "identifier_uri": "http://hdl.handle.net/10919/28028",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "myo-inositol polyphosphate 5-phosphatase",
    "5)P3]",
    "sucrose nonfermenting-1-related kinase",
    "Arabidopsis thaliana",
    "inositol trisphosphate [Ins(1",
    "arabidopsis homolog of p80"
  ],
  "title": "Identification and Functional Role of Myo-Inositol Polyphosphate 5-Phosphatase Protein Complexes",
  "type": "Dissertation"
}