{
  "contributor_author": "Jackson, Bryan Tyler",
  "contributor_committeechair": "Paulson, Sally L.",
  "contributor_committeemember": [
    "Roberts, E. Anderson",
    "Brewster, Carlyle C.",
    "Youngman, Roger R.",
    "Belden, Lisa K."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:12:59Z",
  "date_adate": "2009-06-26",
  "date_available": "2014-03-14T20:12:59Z",
  "date_issued": "2009-05-29",
  "date_rdate": "2013-01-02",
  "date_sdate": "2009-06-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The family Bunyaviridae is the largest of vertebrate diseases and includes the mosquito-borne disease La Crosse (LAC) virus.  Vectors include the major vector Aedes triseriatus and two accessory vectors Aedes albopictus and Aedes japonicus.  In the past several decades there has been an increase in the number of LAC cases, implication of new vectors, and the appearance of new foci of disease in the southeastern U.S.  To better understand the vectors and the relationship between vectors and the virus, laboratory and field studies were conducted to determine oviposition preferences, effect of virus infection on blood-feeding behavior, and compare the efficacy of various methods to determine minimum infection rates of vectors.  <p> In laboratory studies of oviposition preference, only Ae. japonicus demonstrated a preference when presented with preexisting eggs.  They deposited more eggs in cups containing either conspecifics or Ae. albopictus.  The presence of 1st instar larvae Ae. albopictus larvae deterred oviposition by Ae. triseriatus and Ae. japonicus.  Ae. japonicus and Ae. triseriatus preferred cups containing larval rearing water (LRW) of conspecifics and Ae. albopictus.  Aedes albopictus preferred LRW regardless of species compared to control cups.  Field experiments with fresh egg papers and preexisting eggs did not show significant differences, although the unequal population densities of species in the study area confounded the analysis.  More work is needed to elucidate the interaction among these species and its effect on oviposition in the field. <p>  \tBlood-feeding experiments showed that LAC virus-infected Ae. triseriatus and Ae. albopictus imbibed significantly less blood compared to uninfected mosquitoes. Because blood meal size affects the subsequent inhibition of host seeking, experiments were done to ascertain   the effect of virus infection on refeeding.  Significantly more infected Ae. triseriatus mosquitoes refed but there was no effect on the refeeding rate of  Ae. albopictus.  Thus, the detrimental effect of virus infection, i.e., reduction in blood meal size, may lead to increased host exposure by Ae. triseriatus, enhancing horizontal transmission.  <p> \tCollecting adult mosquitoes was more efficient to detect virus in field populations than the collection of eggs.  Maximum likelihood estimation-infection rates (MLE-IR) were calculated using bias-corrected maximum likelihood estimation.  Adult collections yielded significantly more positive pools compared with egg collections.  Virus was isolated from pools from Ae. canadensis, Ae. triseriatus, and Ae. albopictus.  These results are comparable to other studies.",
  "description_provenance": [
    "Author Email: brjacks3@vt.edu",
    "Advisor Email: roberts@vt.edu",
    "Advisor Email: spaulson@vt.edu",
    "Advisor Email: carlyleb@vt.edu",
    "Advisor Email: youngman@vt.edu",
    "Advisor Email: belden@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:59Z (GMT). No. of bitstreams: 1 Jackson_ETD.pdf: 1602453 bytes, checksum: e7fd84800e96561330ed0c4712c741c9 (MD5)   Previous issue date: 2009-05-29"
  ],
  "handle": "28029",
  "identifier_other": "etd-06122009-113622",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06122009-113622/",
  "identifier_uri": "http://hdl.handle.net/10919/28029",
  "publisher": "Virginia Tech",
  "relation_haspart": "Jackson_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Blood-feeding behavior",
    "Infection rates",
    "Oviposition preferences",
    "La Crosse virus"
  ],
  "title": "La Crosse Virus in Southwestern Virginia: Role of Exotic Mosquito Species and Effect of Virus Infection on Feeding",
  "type": "Dissertation"
}