{
  "contributor_author": "Linville, Deanna Christine",
  "contributor_committeechair": "Johnson, Scott W.",
  "contributor_committeemember": [
    "Prouty, Anne M.",
    "Albers, Lisa",
    "Piercy, Fred P.",
    "Sawyers, Janet K."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:12:57Z",
  "date_adate": "2003-06-27",
  "date_available": "2014-03-14T20:12:57Z",
  "date_issued": "2003-05-12",
  "date_rdate": "2004-06-27",
  "date_sdate": "2003-06-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The number of families choosing to adopt a child internationally in the United States has increased exponentially on an annual basis (Johnson, 1997; Miller, 2000). The purpose of this study was to understand the adoption process experiences of families who have adopted a child between the ages of three and five years old from Russia or Romania after 1992. In this clinical sample, all participantsâ   adopted children had been referred for and undergone neuropsychological, medical, speech, and/or language evaluation. Specifically, the research questions were designed to help therapists understand the role mental health care professionals, schools, family members, and friends played in the adoption process and how the participantsâ   experiences compared with their preadoptive expectations. Twenty families were interviewed and several observations were conducted. Data analysis consisted of thematic analysis which elicited codes and themes across the interviews. This studyâ  s findings suggest that: 1) parents would have found more preparation before adoption helpful in the process; 2) health care professionals and schools need to be better educated about problems, concerns, and appropriate treatments specific to post-institutionalized children; 3) raising (a) special needs child(ren) puts significant strain on the caregiver(s) and their significant relationships; and  4)  families with special needs children are extremely resilient. These findings are important for education and healthcare professionals, families who are planning to adopt internationally in the future and current adoptive families.",
  "description_provenance": [
    "Author Email: dlinvill@vt.edu",
    "Advisor Email: swj@vt.edu",
    "Advisor Email: aprouty@attbi.com",
    "Advisor Email: lisa.albers@TCH.Harvard.edu",
    "Advisor Email: Piercy@vt.edu",
    "Advisor Email: sawyers@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:57Z (GMT). No. of bitstreams: 1 thewholething2.pdf: 1328926 bytes, checksum: 517c08cde5038060421c51706926d111 (MD5)   Previous issue date: 2003-05-12"
  ],
  "handle": "28022",
  "identifier_other": "etd-06122003-151315",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06122003-151315/",
  "identifier_uri": "http://hdl.handle.net/10919/28022",
  "publisher": "Virginia Tech",
  "relation_haspart": "thewholething2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Eastern European adoption experiences",
    "international adoption",
    "family therapy",
    "post-institutionalized children"
  ],
  "title": "Family Experiences Concerning Adopting a Previously Institutionalized Child from Russia or Romania",
  "type": "Dissertation"
}