{
  "contributor_author": "Madden, Andrew Stephen",
  "contributor_committeechair": "Hochella, Michael F. Jr.",
  "contributor_committeemember": [
    "Cox, David F.",
    "Tadanier, Christopher J.",
    "Rimstidt, james Donald",
    "Ritter, Alfred L."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:13:02Z",
  "date_adate": "2005-07-05",
  "date_available": "2014-03-14T20:13:02Z",
  "date_issued": "2005-06-02",
  "date_rdate": "2006-07-05",
  "date_sdate": "2005-06-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Recent studies have demonstrated that nanoscale crystalline iron oxide minerals are common in natural systems.  The discipline of nanoscience suggests that these particles in the size range of approximately 1-50 nm will have properties that deviate from the bulk properties of the same material and that these properties will change as a function of particle size.  This study begins to fill the void of corresponding experimental investigations that apply the principles of nanoscience to the geochemical reactivity of nanominerals.  <p> The rate of Mn<sup>2+</sup>(aq) oxidation on hematite with average diameters of 7.3 nm and 37 nm was measured in the presence of O<sub>2</sub>(aq).  In the pH range of 7-8, the surface area normalized rate was one to two orders of magnitude greater on the 7.3 nm average diameter particles.  Based on the application of electron transfer theory, it is hypothesized that the particles with diameters less than approximately 10 nm have surface crystal chemical environments which distort the symmetry of the MnMn<sup>2+</sup> surface complex, reducing the energy required to reorganize the coordinated ligands after oxidation to Mn<sup>3+</sup>. </p><p> Cu<sup>2+</sup>, an analog for Mn<sup>3+</sup>, was used to probe for the presence and nature of the proposed changes in surface structure.  Cu<sup>2+</sup> and Mn<sup>3+</sup> show similar electronic structure changes in response to the surrounding crystal field due to their d-electron configurations and Jahn-Teller coordinative distortions.  Batch sorption experiments on hematite nanoparticles revealed a shift in the pH-dependent adsorption of Cu<sup>2+</sup>(aq).  Specifically, an affinity sequence of 7 nm > 25 nm = 88 nm was determined based on the shift of the 7 nm sorption edge to approximately 0.8 pH units lower than that for the 25 nm and 88 nm samples.  These data support the hypothesis that unique binding sites exist on the 7 nm nanoparticles that are not significantly present on the larger particles.</p><p> The National Nanotechnology Initiative stresses the need to address the broader societal impacts of nanoscale research.  This dissertation embraces this viewpoint through the development and inclusion of \"Nano2Earth: Introducing Nanotechnology Through Investigations of Groundwater,\" a curriculum which combines nanoscience with the Earth sciences for high school students.</p>",
  "description_provenance": [
    "Author Email: amadden@vt.edu",
    "Advisor Email: hochella@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Advisor Email: ctadanie@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: aritter@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:02Z (GMT). No. of bitstreams: 1 ETDcorrected.pdf: 72281935 bytes, checksum: cfc4c99d854c43a24dd79ad6d300694e (MD5)   Previous issue date: 2005-06-02"
  ],
  "handle": "28033",
  "identifier_other": "etd-06132005-125355",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06132005-125355/",
  "identifier_uri": "http://hdl.handle.net/10919/28033",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETDcorrected.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hematite",
    "nanoscience",
    "geochemistry",
    "sorption",
    "oxidation",
    "manganese"
  ],
  "title": "Nanoscience Meets Geochemistry: Size-Dependent Reactivity of Hematite",
  "type": "Dissertation"
}