{
  "contributor_author": "Elwood Madden, Megan Erica",
  "contributor_committeechair": "Bodnar, Robert J.",
  "contributor_committeemember": [
    "Kring, David A.",
    "Rimstidt, james Donald",
    "Hole, John A.",
    "Ross, Nancy L."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:13:02Z",
  "date_adate": "2005-06-30",
  "date_available": "2014-03-14T20:13:02Z",
  "date_issued": "2005-05-17",
  "date_rdate": "2005-06-30",
  "date_sdate": "2005-06-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "From the early stages of planetary accretion and differentiation to the geomorphology of planetary surfaces and the evolution of life, fluids play an integral role in shaping planetary bodies. Fluid properties and processes were investigated under a range of planetary conditions through (1) experimental simulations of impact events and petrographic analysis of terrestrial impactites to determine the effects of shock metamorphism on fluid inclusion properties; and (2) numerical thermodynamic equilibrium modeling of aqueous alteration processes on Mars. Results of impact experiments and analyses of fluid inclusions in rocks from the Ries Crater and Meteor Crater indicate that fluid inclusions reequilibrate systematically with increasing shock pressure: stretching and decrepitating under low shock pressure conditions and collapsing at moderate shock pressures. Above the Hugenoit Elastic Limit, fluid inclusion vesicles are destroyed due to plastic deformation and phase transitions within the host mineral. This suggests that impact processing may result in the destruction of fluid inclusions, leading to shock devolatilization of target rocks. In addition, the absence of fluid inclusions in planetary materials does not preclude the presence of fluids on the meteoriteâ  s parent body. Thermodynamic modeling of aqueous alteration of basalt under Mars-relevant conditions provides constraints on the conditions under which secondary sulfates are likely to have formed. The results of this study indicate that jarosite is likely to form as a result of water-limited chemical weathering of basalts. Magnesium sulfates are only predicted to form as a result of evaporation. This suggests that in order to form the alteration assemblages recently observed by the Mars Exploration Rover Opportunity at Meridiani Planum, water must have been removed from the system after a geologically short period of time, before fluids came into equilibrium with mafic surface materials and became alkaline.",
  "description_provenance": [
    "Author Email: melwood@vt.edu",
    "Advisor Email: kring@lpl.arizona.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: hole@vt.edu",
    "Advisor Email: rjb@vt.edu",
    "Advisor Email: nross@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:02Z (GMT). No. of bitstreams: 1 ETDcorrected.pdf: 59264653 bytes, checksum: 6a64037a6f24f847f9922156f1ca4710 (MD5)   Previous issue date: 2005-05-17"
  ],
  "handle": "28034",
  "identifier_other": "etd-06132005-173846",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06132005-173846/",
  "identifier_uri": "http://hdl.handle.net/10919/28034",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETDcorrected.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "reequilibration",
    "Meteor Crater",
    "Ries Crater",
    "impact processes",
    "shock metamorphism",
    "Mars",
    "geochemistry",
    "fluid inclusions",
    "jarosite"
  ],
  "title": "Fluids in Planetary Systems",
  "type": "Dissertation"
}