{
  "contributor_author": "Vella, Elizabeth Jane",
  "contributor_committeechair": "Friedman, Bruce H.",
  "contributor_committeemember": [
    "Cooper, Robin K. Panneton",
    "Harrison, David W.",
    "Scarpa-Friedman, Angela"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:13:03Z",
  "date_adate": "2005-06-29",
  "date_available": "2014-03-14T20:13:03Z",
  "date_issued": "2005-05-10",
  "date_rdate": "2008-06-29",
  "date_sdate": "2005-06-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Anger and hostility have been attributed as early risk factors of coronary heart disease (CHD). However, many inconsistencies exist in the literature linking both of these constructs to CHD, as well as to cardiovascular reactivity (CVR) to stressors likely to give rise to CHD. A potential moderating influence discussed in the CVR literature concerns the issue of anger provocation, whereas assessment of the ability to evaluate the source of provocation may moderate the recovery process. The current study adopts a multivariate approach to assess the interactive effects of dispositional anger in predicting the CVR and recovery to mental arithmetic (MA) stress with and without harassment in 47 male undergraduate psychology students. Results revealed anger out (AO) to be associated with high vagal and low frequency power suppression in response to the MA task with harassment. Exposure to experimenter evaluation was associated with attenuated diastolic blood pressure recovery and facilitated vagal recovery in high AO subjects, whereas the opposite pattern was apparent for low AO subjects. The general findings suggest that trait anger interacts with situational influences to predict CVR and recovery to stressors.",
  "description_provenance": [
    "Author Email: evella@vt.edu",
    "Advisor Email: panneton@vt.edu",
    "Advisor Email: bhfriedm@vt.edu",
    "Advisor Email: dwh@vt.edu",
    "Advisor Email: ascarpa@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:03Z (GMT). No. of bitstreams: 2 vella_etdbody.pdf: 311137 bytes, checksum: 77e9972a1a7bfb5cb8eea9c96620b16f (MD5) vella_etd.pdf: 42809 bytes, checksum: 30f4794a4f55b91588f67308967d88ef (MD5)   Previous issue date: 2005-05-10"
  ],
  "handle": "28039",
  "identifier_other": "etd-06142005-105320",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06142005-105320/",
  "identifier_uri": "http://hdl.handle.net/10919/28039",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "vella_etdbody.pdf",
    "vella_etd.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "anger out",
    "harassment",
    "Cardiovascular reactivity",
    "evaluation",
    "cardiovascular recovery"
  ],
  "title": "Anger Expression, Harassment, and Evaluation: Cardiovascular Reactivity and Recovery to Mental Stress",
  "type": "Dissertation"
}