{
  "contributor_author": "Worley, Catherine Lynn",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Craig, James E.",
    "Russo, Patrick",
    "Tucker, James"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:13:03Z",
  "date_adate": "2007-06-21",
  "date_available": "2014-03-14T20:13:03Z",
  "date_issued": "2007-05-31",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-06-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This research study examines the relationship between academic achievement and at-risk students.  Many issues today affect the achievement gap and the ability for at-risk students to succeed.  Most data, as revealed in the studies included in this review, conclude the factors identifying at-risk students do have significant impact on the academic achievement of individual students and schools.  Most often, these students are not successful and eventually drop out of school or pursue a GED.  Data indicate that teacher-student relationships, parent or caregiver-student relationships, motivation, SES (socioeconomic status), and peer influence can affect success for at- risk students.  Twelfth grade students from two high schools in an urban school district were given the opportunity to participate in a survey.  This study investigates correlations between the dependent variable grade point average (GPA), and the independent variables teacher-student relationships, parent or caregiver-student relationships, motivation, SES, and peer influence.  Five regressions were run to determine if any of the independent variables predict GPA.  Data from this study indicate that the variance between the dependent variable of GPA and each of the five independent variables is significant; however the practicality of these resultsâ   having a significant influence on the GPA of the study participants is minimal. The strongest variance found was between GPA and motivation and between GPA and peer influence.  Other findings include a relationship between GPA and participation in sports or activities.  As GPA increases, the percentage of students participating in sports and activities increased.  The students in this study do have positive relationships with their teachers; have a parent or caregiver encouraging them to do well in school; and plan to attend college.",
  "description_provenance": [
    "Author Email: clworley@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:03Z (GMT). No. of bitstreams: 2 DissPDFone.pdf: 3454818 bytes, checksum: 63acdf48dc69980dd2cfab997c95de83 (MD5) DissPDFtwo.pdf: 150955 bytes, checksum: bdde97f74fc62bcfccb1399f69dbefc3 (MD5)   Previous issue date: 2007-05-31"
  ],
  "handle": "28037",
  "identifier_other": "etd-06132007-132141",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06132007-132141/",
  "identifier_uri": "http://hdl.handle.net/10919/28037",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "DissPDFone.pdf",
    "DissPDFtwo.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "parent/caregiver-student relationships",
    "teacher-student relationships",
    "peer influence",
    "socioeconomic status",
    "motivation",
    "resiliency",
    "academic achievement",
    "at-risk"
  ],
  "title": "At-Risk Students and Academic Achievement:  The Relationship Between Certain Selected Factors and Academic Success",
  "type": "Dissertation"
}