{
  "contributor_author": "Ozturk, Gozde",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "Moore, Robert B.",
    "Wilkes, Garth L.",
    "Turner, S. Richard",
    "Riffle, Judy S."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:12:59Z",
  "date_adate": "2009-07-15",
  "date_available": "2014-03-14T20:12:59Z",
  "date_issued": "2009-05-29",
  "date_rdate": "2012-03-30",
  "date_sdate": "2009-06-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Research efforts have focused on synthesis of linear, long-chain branched, and novel crosslinked polyesters for applications spanning from pressure sensitive adhesives to biomedical applications.  Altering polymer topology and functionality using different synthetic strategies was enabled tailoring the thermomechanical, rheological, and adhesive properties of polyesters.  The synthesis and characterization of linear, long-chain branched, and crosslinked networks are described focusing on the structure-property relationships.   Aliphatic low-Tg polyesters with linear and long-chain branched topology were synthesized using melt polycondensation for pressure sensitive adhesive applications.  Relationships between molecular weight, polymer composition, and adhesive performance were investigated.  Melt rheological studies and the characterization of adhesive properties indicated that adhesive performance was enhanced with increasing molecular weight.  Moreover, a series of long-chain branched low-Tg polyester were investigated to determine the influence of branching and molecular weight.  Tailoring the degree of branching enabled the control of rheological and adhesive properties.  Characterization of adhesive properties revealed that long-chain branched polymers displayed an enhanced cohesive strength.  In addition, utilization of different comonomer compositions allowed tailoring thermal and adhesive properties of low-Tg polyesters over a wide range. Biodegradable networks were synthesized for the first time using base-catalyzed Michael addition of acetoacetate functionalized polyesters with acrylates.  Linear and star-shaped poly(caprolactone) (PCL) oligomers with different molecular weights were functionalized and crosslinked.  Thermomechanical properties were evaluated as a function of precursor molecular weight and crosslink density.  The glass transition temperature and the extent of crystallinity of the networks were dependent on the molecular weight of the PCL segment.  Moreover, dynamic mechanical analysis (DMA) indicated that molecular weight of the oligomeric precursors influenced the plateau modulus of the networks as a result of the differences in crosslink density of the networks.  In addition, covalently crosslinked networks were synthesized from Michael addition reaction of acetoacetate-functional oligomeric poly(trimethylene succinate)s and poly(trimethylene adipate)s with neopentylglycol diacrylate.  The oligomeric polyesters with telechelic hydroxyl functionality were synthesized from renewable monomers, adipic acid, succinic acid, and 1,3-propanediol using melt polycondensation. The molecular weights of the precursors were varied systematically to probe the influence of molecular weight on thermomechanical properties of the networks. The extent of crystallinity and mechanical properties were dependent on the molecular weight of the oligomeric polyester precursors which also controlled crosslink density.  Moreover, Michael addition chemistry was utilized to crosslink low-Tg polyesters to improve cohesive strength for PSA applications.  In order to determine the influence of temperature and catalyst levels, crosslinking reactions were monitoring using measurement of loss and storage moduli during the reaction.  Networks having different levels of gel fractions were investigated to elucidate the influence of degree of crosslinking on thermomechanical and adhesive properties of low-Tg polyesters.",
  "description_provenance": [
    "Author Email: gozturk@vt.edu",
    "Advisor Email: rbmoore3@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: srturner@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:12:59Z (GMT). No. of bitstreams: 1 Gozde_Ozturk_Dissertation.pdf: 9623455 bytes, checksum: d8e45c53d79194578c8ff952e9558039 (MD5)   Previous issue date: 2009-05-29"
  ],
  "handle": "28030",
  "identifier_other": "etd-06122009-143538",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06122009-143538/",
  "identifier_uri": "http://hdl.handle.net/10919/28030",
  "publisher": "Virginia Tech",
  "relation_haspart": "Gozde_Ozturk_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "polycondensation",
    "polyester",
    "Michael addition",
    "branching",
    "topology",
    "networks",
    "elastomers"
  ],
  "title": "Topology and Telechelic Functionality Control in Polyester Design",
  "type": "Dissertation"
}