{
  "contributor_author": "Kiser, Charlene",
  "contributor_committeecochair": [
    "Bailey, Carol A.",
    "Barksdale, Mary Alice"
  ],
  "contributor_committeemember": [
    "Doolittle, Peter E.",
    "Kelly, Patricia Proudfoot",
    "Metz, Nancy"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:13:02Z",
  "date_adate": "2007-01-24",
  "date_available": "2014-03-14T20:13:02Z",
  "date_issued": "2006-02-17",
  "date_rdate": "2010-10-07",
  "date_sdate": "2006-06-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Although it may not seem possible that a student could graduate from an Ivy League institution without basic writing skills, a 2003 Chronicle of Higher Education article concluded that it is not only possible, but that it does happen. Some students are actually suing colleges and universities because they do not believe they have been taught the skills necessary to succeed in the area of written communication. This deficiency reflects poorly on universities, and even small liberal arts colleges are not exempt from this problem.  </p><p> This dissertation was driven by a desire to learn how professors at one small liberal arts college viewed the use of writing in their courses. The professors were interviewed to determine how they viewed writing, how they viewed their studentsâ   writing, how familiar they were with writing-across-the-curriculum practices, and how much writing was assigned in their courses.  </p><p> The study results indicated that many professors use writing extensively in their courses, and that they considered their assignments appropriate and successful in achieving their goals. The study also revealed that some professors use little or no writing, and their reasons for doing so were varied. The most common explanation was a lack of time to create assignments and to read and assess written assignments. Some professors also concurred that they felt uncomfortable using writing because their own writing skills were lacking. Other professors were discouraged by poor student writing and had given up on using additional writing assignments. </p><p>  The most surprising result from this study was the professorsâ   lack of knowledge concerning the use of writing as a learning and thinking tool. Most were comfortable with the standard research paper, case study type of writing assignments, but few used writing-across-the-curriculum methods or practices. Writing prompts, journals, and non-graded pieces were not part of their teaching repertoire. Even professors in the field of education reported that they have not adopted the newer teaching strategies. The concluding chapter addressed faculty concerns and provided suggestions for overcoming these concerns. </p>",
  "description_provenance": [
    "Author Email: ckiser@milligan.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: mbarksda@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: nmetz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:02Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 461578 bytes, checksum: f36ba54a7d3b3ef6e58c8ebf6b8f7f94 (MD5)   Previous issue date: 2006-02-17"
  ],
  "handle": "28035",
  "identifier_other": "etd-06132006-112606",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06132006-112606/",
  "identifier_uri": "http://hdl.handle.net/10919/28035",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "faculty attitudes",
    "writing across the curriculum",
    "college writing"
  ],
  "title": "To Write or Not to Write: A Look at Faculty Use of Writing at a Small Liberal Arts College",
  "type": "Dissertation"
}