{
  "contributor_author": "Bullock, Elizabeth Raub",
  "contributor_committeechair": "Brewer, Karen J.",
  "contributor_committeemember": [
    "Merola, Joseph S.",
    "Deck, Paul A.",
    "Anderson, Mark R.",
    "Hanson, Brian E."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:13:04Z",
  "date_adate": "2001-07-13",
  "date_available": "2014-03-14T20:13:04Z",
  "date_issued": "2000-09-25",
  "date_rdate": "2002-07-13",
  "date_sdate": "2001-06-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The research detailed herein has been conducted in two different areas. The first research goal was to develop and study a supramolecular system coupling two light absorber units to a central metal site capable of collecting two electrons; this has been accomplished.  <p> The complex {[(bpy)2Ru(dpp)]2RhCl2}(PF6)5 was synthesized and characterized using electrochemistry and electronic absorption spectroscopy. The electrochemical properties of {[(bpy)2Ru(dpp)]2RhCl2}(PF6)5 were probed with cyclic voltammetry and bulk electrolysis studies to investigate the behavior of the system upon two-electron reduction of the rhodium metal center. Bulk electrolysis showed that the rhodium center underwent two-electron reduction. A water modulation of product distribution for the bulk electrolysis studies was found, and the nature of this process was studied. In the presence of water, two-electron reduction of the rhodium metal center afforded a RhI complex that had lost two chloride ligands: {[(bpy)2Ru(dpp)]2RhI}+5. In the absence of sufficient water, two-electron reduction yields a breakdown of the trimetallic resulting in [(bpy)2Ru(dpp)]+2 and {[(bpy)2Ru(dpp)]RhICl2}+.  <p> The second research goal was to develop integrated molecular modeling, synthesis, and characterization laboratory experiments, to incorporate into the undergraduate inorganic laboratory curriculum, and to evaluate and modify this curricular approach. This was accomplished with organometallic [Mo(CO)4(N-N)] complexes, where N-N is a bidentate nitrogen donor ligand. [Mo(CO)4(N-N)] complexes were selected because they were amendable to molecular modeling and could be synthesized via two synthetic routes with reasonable yields, low reaction times, and were air stable. <p> Many of these complexes are new, so a series of [Mo(CO)4(N-N)] complexes were synthesized by either thermal or photochemical substitution reactions. The systems were characterized using cyclic voltammetry, electronic absorption spectroscopy, and 1H NMR spectroscopy.  <p> Molecular modeling was performed on the series of [Mo(CO)4(N-N)] complexes using the CAChe software from Oxford Molecular, Ltd. These calculations typically provided reasonable structures, orbital locations, and relative orbital energies for the [Mo(CO)4(N-N)] systems. <p> Correlations between the computational and experimental data were established. The electronic absorption spectral MLCT frequency versus calculated HOMO-LUMO energy gap, Epa versus calculated HOMO energy, E1/2red versus calculated LUMO energy, and 1H NMR chemical shift for [Mo(CO)4(1,10-phen)] and the substituted [Mo(CO)4(1,10-phen)] complexes versus ZINDO calculated partial charge were compared, where 1,10-phen = 1,10-phenanthroline. From the analyses of physical versus computational data, it was concluded that molecular modeling results are useful in predicting physical data for these complexes. <p> The integrated molecular modeling, synthesis, and characterization experiment was developed and incorporated into the undergraduate inorganic chemistry laboratory. In both 1998 and 1999, a qualitative evaluation of student response was completed. This was done using a recorded interview technique; interviews were subsequently transcribed and rendered to extract themes. This interview style was an effective evaluation technique for this project, providing the detailed comments and student feedback that were desired. These interviews showed that the majority of the students both enjoyed this experiment and felt that the exposure to molecular modeling was worthwhile within this type of integrated lab forum. The students felt this experiment aided in their understanding of the orbital properties of inorganic systems. Student comments and suggestions facilitated modifications for future offerings in 1999 and 2000. Continued evaluation and expansion of this curricular approach are in progress.",
  "description_provenance": [
    "Author Email: ebullock@cas.org",
    "Advisor Email: jmerola@vt.edu",
    "Advisor Email: pdeck@vt.edu",
    "Advisor Email: maander6@vt.edu",
    "Advisor Email: hanson@vt.edu",
    "Advisor Email: kbrewer@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:04Z (GMT). No. of bitstreams: 17 IntroMaterials.pdf: 88299 bytes, checksum: 85fe0c1277e30026e5206ab61f96da79 (MD5) Chapter1.pdf: 192005 bytes, checksum: 6832375a8128685ff939ccbf7aae04ab (MD5) Chapter5.pdf: 78939 bytes, checksum: bbd99f7d08401aed6b76a5c3a713c0cc (MD5) Chapter11.pdf: 444074 bytes, checksum: b13c95c19b4cfd6f613bd696599998d0 (MD5) Chapter7.pdf: 160500 bytes, checksum: 605ac3958805ac1ad6ecd243042cc307 (MD5) Chapter2.pdf: 74991 bytes, checksum: 96f0d71bba26a4cc3f51defab782f4c8 (MD5) Chapter6.pdf: 73167 bytes, checksum: b1a6c80579aa7960644e8ec7148548a1 (MD5) CoverPage.pdf: 51325 bytes, checksum: f0e2952037047d183cae6d2a67c2d7ff (MD5) Chapter8.pdf: 52254 bytes, checksum: 7005e78e11d7d79ae57ca3670cadb56e (MD5) Chapter12.pdf: 58979 bytes, checksum: f228b33f1acd6a0a83b41e095c573966 (MD5) Chapter4.pdf: 58443 bytes, checksum: c5c3bc2297ea3eed841f2294e302819a (MD5) Vitae.pdf: 45061 bytes, checksum: 20599edfd61831a6ee4f5889b3c5f36e (MD5) Chapter10.pdf: 112086 bytes, checksum: 675c7655534bca87136489cf549b011e (MD5) RefsandAppendices.pdf: 1208116 bytes, checksum: 81b421a0e42020b45240badc1eba4ad6 (MD5) Abstract.pdf: 60671 bytes, checksum: 65f8dfaaefb77187c5f4014d25312be8 (MD5) Chapter9.pdf: 99722 bytes, checksum: 4c57f8ff85895290130963d3d7d46b28 (MD5) Chapter3.pdf: 340596 bytes, checksum: c79d902ad9bd536bbabb0c3315aa06e7 (MD5)   Previous issue date: 2000-09-25"
  ],
  "handle": "28043",
  "identifier_other": "etd-06152001-160507",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06152001-160507/",
  "identifier_uri": "http://hdl.handle.net/10919/28043",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "IntroMaterials.pdf",
    "Chapter1.pdf",
    "Chapter5.pdf",
    "Chapter11.pdf",
    "Chapter7.pdf",
    "Chapter2.pdf",
    "Chapter6.pdf",
    "CoverPage.pdf",
    "Chapter8.pdf",
    "Chapter12.pdf",
    "Chapter4.pdf",
    "Vitae.pdf",
    "Chapter10.pdf",
    "RefsandAppendices.pdf",
    "Abstract.pdf",
    "Chapter9.pdf",
    "Chapter3.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "rhodium",
    "molybdenum",
    "synthesis",
    "ruthenium",
    "chemical education",
    "molecular modeling",
    "electrochemistry"
  ],
  "title": "Synthesis and Electrochemical Properties of {[(bpy)₂Ru(dpp)]₂RhCl₂}(PF₆)₅: A Light Absorber - Electron Collector - Light Absorber Triad AND Development and Evaluation of Integrated Molecular Modeling, Synthesis, and Characterization Laboratory Experiments for the Undergraduate Chemistry Curriculum",
  "type": "Dissertation"
}