{
  "contributor_author": "McFeeters, Forrest Ethan",
  "contributor_committeecochair": [
    "Doolittle, Peter E.",
    "Holmes, Glen A."
  ],
  "contributor_committeemember": [
    "Lockee, Barbara B.",
    "Cennamo, Katherine S.",
    "Smith-Jackson, Tonya L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:13:10Z",
  "date_adate": "2003-07-25",
  "date_available": "2014-03-14T20:13:10Z",
  "date_issued": "2003-05-23",
  "date_rdate": "2003-07-25",
  "date_sdate": "2003-06-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examined the differences in achievement between groups exhibiting different cultural dimensions in a particular online instructional environment.  Variables were measured concerning the relationship between instructional environments, cultural dimensions and online learner preference.  The subjects of this study were a representative sample of groups of graduate students from different cultures.  The instrument was composed of a treatment that was represented across two instructional environments.  A web-based tool measured participant?s cultural dimension, recall, transfer of knowledge and learning preference.  A 2 x 2 x 2 ANOVA analysis method was used to examine the effects of individualism and collectivism on learner preference and achievement (recall, transfer).  Significance in transfer measures was found.  This indicated deep understanding of materials for collectivist participants.  Correlational analysis revealed significance between cultural dimension and learner preference for instructional methods. Findings were consistent with the body of literature on cross-cultural psychology.",
  "description_provenance": [
    "Author Email: fmcfeete@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: gholmes@vt.edu",
    "Advisor Email: cennamo@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:10Z (GMT). No. of bitstreams: 1 05FMcFeetersDiss.pdf: 2728949 bytes, checksum: fd204e5abca0d623bf67648bb6030a67 (MD5)   Previous issue date: 2003-05-23"
  ],
  "handle": "28049",
  "identifier_other": "etd-06162003-181857",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06162003-181857/",
  "identifier_uri": "http://hdl.handle.net/10919/28049",
  "publisher": "Virginia Tech",
  "relation_haspart": "05FMcFeetersDiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "transfer of knowledge",
    "socio cultural constructivism",
    "instructional environments",
    "behaviorism",
    "culture",
    "learner preference",
    "recall",
    "collectivism",
    "individualism",
    "online learning"
  ],
  "title": "The Effects of Individualism Vs. Collectivism on Learner's Recall, Transfer and Attitudes Toward Collaboration and Individualized Learning",
  "type": "Dissertation"
}