{
  "contributor_author": "Leary, Patricia Wootten",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Whitney, Deran",
    "Martin, Rosalie Marie",
    "Worner, Wayne Dempsey"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:13:03Z",
  "date_adate": "2007-07-27",
  "date_available": "2014-03-14T20:13:03Z",
  "date_issued": "2007-06-06",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-06-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examines the impact of selected structures of the Virginia Preschool Initiative on reading readiness in at-risk preschool students in the state of Virginia.  The Virginia Preschool Initiative is designed to prepare at-risk four-year-olds for success in kindergarten.  According to the Virginia Department of Education, \"The purpose of the grants is to reduce disparities among young children upon formal school entry and to reduce or eliminate those risk factors that lead to early academic failure.\" (Virginia Department of Education, 2005)  The independent variables are the specific curriculum models used by the school division, length of program day, teacher certification, and program sponsoring agency.  The dependent variables are the pre and post assessment scores on the eight subtests of the PALS-PreK assessment.  A paired sample t-test and one-way ANOVA were conducted using Fall and Spring 2006 PALS-PreK student assessment scores from school divisions that participated in the Virginia Preschool Initiative during the 2005-06 school year to determine the relationship between the curriculum implemented and PALS-PreK Fall and Spring student assessment scores. The findings in this study indicate a statistically significant difference between the Fall and Spring student assessment scores for each of the curriculum models analyzed and at least one curriculum model consistently underperforms the other three curriculum models. There were no differences in three variables (length of school day, teacher certification, and program sponsoring agency) and were therefore, not subject to analysis.",
  "description_provenance": [
    "Author Email: pleary@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: deranwhitney@spsk12.net",
    "Advisor Email: rosemartin@vt.edu",
    "Advisor Email: wworner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:03Z (GMT). No. of bitstreams: 1 LearyDissertation.pdf: 1197167 bytes, checksum: 195f2f8c0166ff1115be1d68e9711931 (MD5)   Previous issue date: 2007-06-06"
  ],
  "handle": "28042",
  "identifier_other": "etd-06142007-213413",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06142007-213413/",
  "identifier_uri": "http://hdl.handle.net/10919/28042",
  "publisher": "Virginia Tech",
  "relation_haspart": "LearyDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "preschool",
    "at-risk",
    "early literacy",
    "curriculum",
    "full day",
    "certification"
  ],
  "title": "An Analysis of the Impact of Selected Structures of the Virginia Preschool Initiative on PALS Pre-K Program Summary Scores for At-Risk Preschool Students in Virginia",
  "type": "Dissertation"
}