{
  "contributor_author": "Thorpe, Chevon N",
  "contributor_committeechair": "Mahan, James Robert",
  "contributor_committeemember": [
    "Bevan, David R.",
    "Sobrado, Pablo",
    "Wyeth, Richard P."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:13:09Z",
  "date_adate": "2012-06-28",
  "date_available": "2014-03-14T20:13:09Z",
  "date_issued": "2012-06-08",
  "date_rdate": "2012-06-28",
  "date_sdate": "2012-06-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Phospholamban (PLN) is an integral membrane protein that regulates the sarco(endo)plasmic Ca2+-ATPase (SERCA2a) within the cardiac sarcoplasmic reticulum (CSR).  SERCA2a regulates intracellular Ca2+- handling and thus plays a critical role in initiating cardiac contraction and relaxation.  It is believed that dysregulation of SERCA2a is a contributing factor in human heart failure patients.  Even though there have been substantial advancements in understanding heart failure pharmacological therapies, patient prognosis remains poor.  Nitroxyl (HNO), a new candidate heart failure drug therapy, has been shown to enhance overall cardiovascular function in both healthy and failing hearts, at least in part, by increasing Ca2+ re-uptake into the CSR.  Previous research has shown that activation of SERCA2a by HNO is PLN-dependent; however, the mechanism of action of HNO remains unknown. We propose that HNO, a thiol oxidant, modifies one or more of the three PLN cysteine residues (C36, C41, C46) affecting the regulatory potency of PLN toward SERCA2a. To test this hypothesis, a series of PLN mutants were constructed containing single, double and triple cysteine substitutions.  Using the baculovirus expression insect cell system, each PLN cysteine mutant was expressed alone and co-expressed with SERCA2a in insect cells and isolated in cellular endoplasmic reticulum (ER) microsomes.  Samples were treated with Angeliâ  s salt (an HNO donor) to determine the role of each PLN cysteine residue in the mechanism of SERCA2a activation by nitroxyl.  Using a standard phosphate activity assay and SDS-PAGE/immunoblot techniques, we determined that the PLN cysteine residues at positions 41 and 46 are important in HNO activation of SERCA2a.  Both SERCA2a + 41C PLN and SERCA2a + 46C PLN microsomal samples showed a Î K0.5 of ~0.33 Î¼M and evidence of reversible HNO induced disulfide bond formation.   These studies provide important new insight into the mechanism of action of HNO on cardiac SR and thereby help evaluate the drug as a candidate therapy for congestive heart failure.",
  "description_provenance": [
    "Author Email: dunnings@vt.edu",
    "Advisor Email: jmahaney@vcom.vt.edu",
    "Advisor Email: drbevan@vt.edu",
    "Advisor Email: psobrado@vt.edu",
    "Advisor Email: rwyeth@vcom.vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:09Z (GMT). No. of bitstreams: 2 Thorpe_CN_D_2012.pdf: 7962219 bytes, checksum: 16c98a9e310635730137f73824cc44a6 (MD5) Thorpe_CN_D_2012_Copyright.pdf: 4051317 bytes, checksum: 3f4fe3cc8062c7f915b36bd748244fab (MD5)   Previous issue date: 2012-06-08"
  ],
  "handle": "28047",
  "identifier_other": "etd-06152012-104735",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06152012-104735/",
  "identifier_uri": "http://hdl.handle.net/10919/28047",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Thorpe_CN_D_2012.pdf",
    "Thorpe_CN_D_2012_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Phospholamban",
    "SERCA",
    "Nitroxyl",
    "Angeli's Salt",
    "Heart failure"
  ],
  "title": "The Role of Phospholamban Cysteines in the Activation of the Cardiac Sarcoplasmic Reticulum Ca2+ Pump by Nitroxyl (HNO)",
  "type": "Dissertation"
}