{
  "contributor_author": "Whitlock, Sharon E.",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Krouscas, James A. Jr.",
    "Gatewood, Thomas E.",
    "Graham, George M."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:13:03Z",
  "date_adate": "2006-08-14",
  "date_available": "2014-03-14T20:13:03Z",
  "date_issued": "2006-05-31",
  "date_rdate": "2007-08-14",
  "date_sdate": "2006-06-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to investigate the effects of class type, coeducational or same-sex, on the self-efficacy of middle school girls in a unit of volleyball.   Four intact certified physical education specialists from two Middle Schools were used in the study.  All of the teachers were female.  In two of the classes, students were split out according to gender with males being taught by one instructor and the females being taught by the other instructor.  For the coeducational classes, the students were randomly assigned to either of the teachers, with boys and girls evenly divided between the two classes.  Essentially two new classes were created at each school.  Quantitative and qualitative methods were used for the study. Two questionnaires were administered to the students.   Analysis of data from the questionnaire showed the student variables that were measured quantitatively for determining girls' self-efficacy for learning volleyball were found to be significant at the 05 level, favoring girls in single-sex environments. Data from the post-intervention questionnaire and student and teacher interviews were analyzed to provide insight into student preferences for these contexts.  It is concluded from the qualitative data that single-sex classes have a more supportive learning environment, and have better conduct than coeducational classes.",
  "description_provenance": [
    "Author Email: sharon.whitlock@wku.edu",
    "Advisor Email: jkrousca@vt.edu",
    "Advisor Email: gatewood42@earthlink.net",
    "Advisor Email: ggraham@psu.edu",
    "Advisor Email: rstratto@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:03Z (GMT). No. of bitstreams: 1 Dissertation3.pdf: 468058 bytes, checksum: 2d5e31f26f633f7736482457a3f8bd57 (MD5)   Previous issue date: 2006-05-31"
  ],
  "handle": "28041",
  "identifier_other": "etd-06142006-164417",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06142006-164417/",
  "identifier_uri": "http://hdl.handle.net/10919/28041",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "MSG",
    "Middle School Girls",
    "SSCE",
    "Single Sex and Coeducational Environments",
    "SSCE and self-efficacy",
    "MSG and self-efficacy"
  ],
  "title": "The Effects of Single-Sex and Coeducational Environments on the Self-Efficacy of Middle School Girls",
  "type": "Dissertation"
}