{
  "contributor_author": "Xu, Yang",
  "contributor_committeechair": "Hatfield, Donald E.",
  "contributor_committeecochair": "Gnyawali, Devi R.",
  "contributor_committeemember": [
    "Fuller, Theodore D.",
    "Lang, James R."
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:13:03Z",
  "date_adate": "2006-07-13",
  "date_available": "2014-03-14T20:13:03Z",
  "date_issued": "2006-06-01",
  "date_rdate": "2007-07-13",
  "date_sdate": "2006-06-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Innovation is the central value of economic behavior. In this dissertation research, I attempt to explore the social and cognitive origins of firm innovation through three interrelated studies, by merging several research streams &#8212; managerial cognitions, social networks, and innovation, and collecting data through multiple methods &#8212; archives and surveys.  </p><p>First, I proposed a social-cognitive view to study the sources of firm innovation. In the context of firm innovation, top management teams' cognitions or an entrepreneur's cognitions shape the way they use the social structure available to them, while the social structures influence the embedded actors' cognitions and ultimately strategic actions. Managers and entrepreneurs form collaborative partnerships aimed at innovation and competitiveness. During this dynamic social learning process, cognitive differences influence the formation of social capital and its realized benefits. The impact of social capital on innovation cannot be evaluated without understanding the individual cognitive characteristic first. </p><p>Next, I tested this theoretical model in two contexts. In the first empirical study, I derived firm-level hypotheses that link the top management team's cognitions, the firm's social capital, and the technological innovations. These hypotheses are tested on a sample of U.S. semiconductor firms in the years 1991-1998. In the second empirical study, I derived similar hypotheses that link entrepreneur's cognitions, social capital and startup's technological innovations. A survey was conducted in both Pennsylvania and Virginia, targeting the entrepreneurial firms in technology industries. The hypotheses were empirically tested on a final sample of 70 U.S. small and medium-sized manufacturers. Two empirical studies supported some of the derived hypotheses and the findings have significant theoretical, empirical, and practical implications. In a diverse social network, actors' knowledge structure tends to be more complex, and more centralized. In addition, these studies indicate that both social capital and cognitive structure play important roles in technological innovation. </p><p>By distinguishing between cognitive structures, as well as social capital characteristics, and by investigating their effects on firm innovations, this dissertation extends the literature on organization theory, innovation research, entrepreneurship, and research methodologies. This dissertation research deepens our understanding of firm innovation, and opens a whole line of further research.</p>",
  "description_provenance": [
    "Author Email: yux4@psu.edu",
    "Advisor Email: fullertd@vt.edu",
    "Advisor Email: jrlang@vt.edu",
    "Advisor Email: devi@vt.edu",
    "Advisor Email: hatfield@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:03Z (GMT). No. of bitstreams: 1 XU2006.pdf: 978504 bytes, checksum: 3005771edb18e0e1a48a066eb68356d7 (MD5)   Previous issue date: 2006-06-01"
  ],
  "handle": "28040",
  "identifier_other": "etd-06142006-132510",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06142006-132510/",
  "identifier_uri": "http://hdl.handle.net/10919/28040",
  "publisher": "Virginia Tech",
  "relation_haspart": "XU2006.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Theoretical model",
    "Empirical studies",
    "Firm innovation",
    "Cognition",
    "Social capital"
  ],
  "title": "Social Capital, Cognitions, and Firm Innovation: Theoretical Model and Empirical Studies",
  "type": "Dissertation"
}