{
  "contributor_author": "Case, Sandra Lynn",
  "contributor_committeechair": "Ward, Thomas C.",
  "contributor_committeemember": [
    "Esker, Alan R.",
    "Saraf, Ravi F.",
    "Dillard, John G.",
    "Ducker, William A."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:13:11Z",
  "date_adate": "2003-07-10",
  "date_available": "2014-03-14T20:13:11Z",
  "date_issued": "2003-06-09",
  "date_rdate": "2004-07-10",
  "date_sdate": "2003-06-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The influence of silane treated amorphous fumed silica fillers on properties of the cured epoxy was examined in the first part of the study. Silica particles were treated with 3- aminopropyldiethoxymethylsilane (APDS) and 3-aminopropyltriethoxysilane (APTS) coupling agents. The filler and coupling agents decreased the mobility of the polymer chains in the vicinity of the filler leading to an increase in the activation energy for the glass transition and an increase in cooperativity.  Fumed silica did not significantly affect moisture diffusion properties.  Next, a linear dilatometer was used to investigate the effects of cure conditions, mold types, and the presence of filler in the model epoxy. These studies revealed that there was substantial shrinkage in the cured epoxy on heating it through its glass transition region. The shrinkage was determined to be the result of stress in the epoxy generated during cure and could be minimized by curing at lower temperatures, followed by a postcuring heat treatment. Additional free volume in the sample increased the magnitude of the shrinkage by allowing increased stress release through increased network mobility.  Decreasing the polymer mobility by adding fillers decreased the observed shrinkage.  The influence of the model epoxy crosslink density was examined by varying the content of 1,4-butanediol in the model system. Addition of 1,4-butanediol led to a decrease in the modulus and glass transition temperature, which resulted in a reduction in residual stress and subsequent shrinkage. Moisture uptake increased with the addition of 1,4-butanediol due to an increase in the free volume of the epoxy. However, even with greater moisture uptake, the addition of 1,4-butanediol to the epoxy increased its adhesion to quartz by promoting lower residual stress and increased energy dissipation. These results indicate that bulk diffusion of water is not the controlling factor in adhesive degradation in this system.",
  "description_provenance": [
    "Author Email: sacase@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: rsaraf@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: wducker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:11Z (GMT). No. of bitstreams: 1 case.pdf: 7144211 bytes, checksum: f67aecbf0b7b6299609044ffd06e5e30 (MD5)   Previous issue date: 2003-06-09"
  ],
  "handle": "28059",
  "identifier_other": "etd-06172003-080912",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06172003-080912/",
  "identifier_uri": "http://hdl.handle.net/10919/28059",
  "publisher": "Virginia Tech",
  "relation_haspart": "case.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "dilatometry",
    "moisture uptake",
    "cooperativity",
    "silane coupling agent",
    "residual stress",
    "epoxy",
    "adhesion",
    "crosslink density",
    "silica filler"
  ],
  "title": "Fundamental Importance of Fillers, Cure Condition, and Crosslink Density on Model Epoxy Properties",
  "type": "Dissertation"
}