{
  "contributor_author": "Ramamoorthy, Sheela",
  "contributor_committeechair": "Sriranganathan, Nammalwar",
  "contributor_committeemember": [
    "Lathogra, Raju",
    "Schurig, Gerhardt G.",
    "Boyle, Stephen M.",
    "Suzuki, Yasuhiro",
    "Lindsay, David S."
  ],
  "contributor_department": "Biomedical and Veterinary Sciences",
  "date_accessioned": "2014-03-14T20:13:10Z",
  "date_adate": "2006-07-31",
  "date_available": "2014-03-14T20:13:10Z",
  "date_issued": "2006-06-05",
  "date_rdate": "2008-07-31",
  "date_sdate": "2006-06-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Neospora caninum is an apicomplexan parasite that causes neuromuscular paralysis in dogs and abortions in cattle. N. caninum is responsible for losses of several million dollars to the dairy and beef industries in several parts of the world. The key players in the host immune response to N. caninum include CD4+ T cells, the Th1 cytokines IL-12, Interferon gamma and IgG2a isotype antibodies. There are currently no chemotherapeutic agents that are effective against adult cattle neosporosis. A commercially available, inactivated vaccine induces the undesirable Th2 type of immunity against N. caninum. Therefore, two approaches towards vaccine development against N. caninum that were designed to induce potent cell mediated immunity have been explored in this dissertation. The first approach consisted of the development of a bivalent recombinant vaccine for both brucellosis and neosporosis, while the second approach involved gamma irradiation of N. caninum tachyzoites for use as an attenuated vaccine against N. caninum.      Since N. caninum research has been conducted with several strains of mice and the different strains of mice vary in their susceptibility to infection with N. caninum, there is a need to develop a standard lab animal model for N. caninum. A gerbil and a C57BL/6 mouse model for N. caninum vaccine testing have been developed. It was found that the LD50 of N. caninum tachyzoites in gerbils was 9.3 x105 tachyzoites per gerbil delivered intra-peritoneally, (i.p) while for C57BL/6 mice the LD50 was 1.5 x107 tachyzoites per mouse delivered i.p. Vertical transmission rates in C57BL/6 mice infected with N. caninum tachyzoites during mid-gestation were determined and found to be in the range of 96-100%.       Putative protective antigens of N. caninum that included MIC1, MIC3, GRA2, GRA6 and SRS2 were expressed in B. abortus strain RB51 to create recombinant vaccine strains. C57BL/6 mice were vaccinated with either the recombinant strains or the irradiated tachyzoites. Antigen specific IgG2a and IgG1 responses and high levels of interferon gamma and IL-10 were induced by vaccination. Mice vaccinated with irradiated tachyzoites, RB51-MIC1 and RB51-GRA6 were completely protected against lethal challenge, while the mice vaccinated with RB51-SRS2, RB51-GRA2 and RB51-MIC3 were partially protected.      To determine the efficacy of the vaccines in preventing vertical transmission of N. caninum, mice were vaccinated and bred after administration of a booster dose four weeks after the primary vaccination. Antigen specific IgG1 and IgG2a and significant levels of IFN-ã and IL-10 were detected in vaccinated, pregnant mice. Pregnant mice were challenged with 5 x 106 N. caninum tachyzoites between days 11-13 of pregnancy. Brain tissue was collected from pups three weeks after birth and examined for the presence of N. caninum by a semi-nested PCR.  Protection against vertical transmission elicited by the RB51-GRA6, RB51-MIC3, irradiated tachyzoite, RB51-GRA2, RB51-MIC1 and RB51-SRS2 vaccinated groups were 43%, 38%, 34%, 34%, 18%, and 7% respectively. Since not all the antigens that were highly protective against acute disease were not very effective in preventing vertical transmission, the role of the selected antigens in preventing acute disease and vertical transmission appear to differ. Only GRA6 was found to be effective in protecting against an acute lethal challenge as well as preventing vertical transmission 43% of the time.      In summary, two animal models for the testing of N. caninum vaccines were developed. N. caninum protective antigens were successfully expressed in B. abortus strain RB51. The irradiated tachyzoite and recombinant RB51-Neospora vaccines were highly effective in protecting against acute neosporosis and partially protective against vertical transmission. Therefore, both these approaches show great promise as practical and effective means to achieve the goal of successful prophylaxis against N. caninum induced abortions and reduce the chances of vertical transmission.",
  "description_provenance": [
    "Author Email: sheelar@vt.edu",
    "Advisor Email: gschurig@vt.edu",
    "Advisor Email: smboyle@vt.edu",
    "Advisor Email: ysuzuki@vt.edu",
    "Advisor Email: lindsayd@vt.edu",
    "Advisor Email: nathans@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:10Z (GMT). No. of bitstreams: 2 Ramamoorthy-S-Thesis.pdf: 1077038 bytes, checksum: e276921288f226283e1475f50ed4c6dd (MD5) Ramamoorthy-S-Cover-pgs.pdf: 155264 bytes, checksum: 12499a00150ca0095dfc16ed5da66e8c (MD5)   Previous issue date: 2006-06-05"
  ],
  "handle": "28054",
  "identifier_other": "etd-06162006-112748",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06162006-112748/",
  "identifier_uri": "http://hdl.handle.net/10919/28054",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Ramamoorthy-S-Thesis.pdf",
    "Ramamoorthy-S-Cover-pgs.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Brucella abortus strain RB51",
    "recombinant vaccine",
    "Neospora caninum"
  ],
  "title": "Approaches towards vaccine development against Neospora caninum",
  "type": "Dissertation"
}