{
  "contributor_author": "Mola, Andrea",
  "contributor_committeechair": "Hajj, Muhammad R.",
  "contributor_committeemember": [
    "Madigan, Michael L.",
    "McCue-Weil, Leigh S.",
    "Ross, Shane D.",
    "Stremler, Mark A."
  ],
  "contributor_department": "Engineering Science and Mechanics",
  "date_accessioned": "2014-03-14T20:13:11Z",
  "date_adate": "2010-07-27",
  "date_available": "2014-03-14T20:13:11Z",
  "date_issued": "2010-06-14",
  "date_rdate": "2010-07-27",
  "date_sdate": "2010-06-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A multidisciplinary approach for the modeling and analysis of the performance of Olympic rowing boats is presented.  The goal is to establish methodologies and tools that would determine the effects of variations in applied forces and rowers motions and weights on mean surge speed and oscillatory boat motions. The coupling between the rowers motions with the hull and water forces is modeled with a system of equations. The water forces are computed using several fluid dynamic models that have different levels of accuracy and computational cost. These models include a solution of the Reynolds Averaged Navier--Stokes equations complemented by a Volume of Fluid method, a linearized 3D potential flow simulation and a 2D potential flow simulation that is based on the strip theory approximation. These results show that due to the elongated shape of the boat, the use of Sommerfeld truncation boundary condition does not yield the correct frequency dependence of the radiative coefficients. Thus, the radiative forces are not computed in the time-domain problem by means of a convolution integral, accounting for flow memory effects, but were computed assuming constant damping and added mass matrices. The results also show that accounting for memory effects significantly improves the agreement between the strip theory and the RANS predictions. Further improvements could be obtained by introducing corrections to account for longitudinal radiative forces, which are completely neglected in the strip theory.  The coupled dynamical system and the multi-fidelity fluid models of the water forces were then used to perform a sensitivity analysis of boat motions to variations in rowers weights, exerted forces and cadence of motion. The sensitivity analysis is based on the  polynomial chaos expansion. The coefficients of each random basis in the polynomial chaos expansion are computed using a non-intrusive strategy. Sampling, quadrature, and linear regression methods have been used to obtain the these coefficients from the outputs generated by the system at each sampling point. The results show that the linear regression method provides a very good approximation of the PCE coefficients. In addition, the number of samples needed for the expansion, does not grow exponentially with the number of varying input parameters. For this reason, this method has been selected for performing the sensitivity analysis.  The sensitivity of output parameters to variations in selected  input parameters of the system are obtained by taking the derivatives of the expansion with respect to each input parameter. Three test cases are considered: a light-weight female single scull, a male quad scull, and a male coxless four. For all of these cases, results that relate the effects of variations in rowers weights, amplitudes of exerted forces and cadence of rowing on mean boat speed and energy ratio, defined as the ratio of kinetic energy of the forward motion to that of the oscillatory motions, are presented. These results should be useful in the design of rowing boats as well as in the training of rowers.",
  "description_provenance": [
    "Author Email: amola@vt.edu",
    "Advisor Email: mhajj@vt.edu",
    "Advisor Email: mimadiga@vt.edu",
    "Advisor Email: mccue@vt.edu",
    "Advisor Email: sdross@vt.edu",
    "Advisor Email: stremler@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:11Z (GMT). No. of bitstreams: 1 Mola_A_D_2010.pdf: 1581631 bytes, checksum: 2e139a0d6b3f22a0dae6fe41fcbb6419 (MD5)   Previous issue date: 2010-06-14"
  ],
  "handle": "28057",
  "identifier_other": "etd-06162010-181719",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06162010-181719/",
  "identifier_uri": "http://hdl.handle.net/10919/28057",
  "publisher": "Virginia Tech",
  "relation_haspart": "Mola_A_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Sensitivity analysis",
    "Rowers biomechanics",
    "Water forces",
    "Rowing",
    "Rigid body motions"
  ],
  "title": "Multi-physics and Multilevel Fidelity Modeling and Analysis of Olympic Rowing Boat Dynamics",
  "type": "Dissertation"
}