{
  "contributor_author": "Qadiri, Mohammad Abdul-Qader",
  "contributor_committeechair": "Moore, David Michael",
  "contributor_committeemember": [
    "Holmes, Glen A.",
    "LaPorte, James E.",
    "Fortune, Jimmie C.",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:13:22Z",
  "date_adate": "1999-06-19",
  "date_available": "2014-03-14T20:13:22Z",
  "date_issued": "1999-06-11",
  "date_rdate": "2000-06-19",
  "date_sdate": "1999-06-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to investigate the assumptions of Hunter, Moore, and Sewell in their 1990 study, in which field dependent learners could use the exaggeration of salient cues that are presented in cartoons to improve their learning. In general, the literature indicated that cartoons could affect the performance of students when they are used as supplemental education devices. Moreover, cartoons can facilitate learning when they are enjoyed and attracted by teachers and students alike. <p>Literature revealed that field dependent learners are affected by their level of cognitive style when they perceive a stimulus. Field dependent learners accept the information as presented, and they need help from outside to analyze this information. The more salient or noticeable cues affect the performance of field dependent learners despite the relevancy of these cues to the subject matter. <p>A review of the literature indicated that only the Hunter, Moore, & Sewell (1990) explored the relationship between cartoons and field-dependence. Their study suggested that field dependent learners would benefit from the exaggeration of salient cues in the cartoons; this suggestion framed the hypothesis of the current study. The present study assumed that exaggeration in the cartoons would maximize the performance of field dependent learners. Moreover, this study examined the suggestion of Hunter, Moore, and Sewell (1990), and if their suggestion was true, then the field dependent students who learned through the exaggeration treatment would outscore field dependents learned with no exaggeration.<p>Participants in this study were 66 freshmen students who attended English classes in the Writing Center at Virginia Polytechnic Institute and State University. The students were randomly distributed into two groups. The teaching group studied English grammar with the exaggeration of cartoons employed as a teaching strategy. The control group studied the same materials, with no cartoon exaggeration. <p>The Group Embedded Figure Test (GEFT) was employed to classify students as having a field dependent, field neutral, or field independent cognitive style. The purpose for the examination of cognitive style's was to assist in determining if the exaggeration of cartoons would positively affect the performance of field dependent students. <p>The dependent variable was a written immediate test of 30 problems. The data were analyzed using two-way Analysis of Variance. All hypotheses of this study were rejected, and no significant differences in the main effects and no interaction between the independent variables were indicated. The study did not support the suggestion of Hunter, Moore, and Sewell (1990), and the results indicated that field dependence did not benefit from exaggeration in the cartoons to be used as salient cues to maximize their learning.",
  "description_provenance": [
    "Author Email: mqadiri@vt.edu",
    "Advisor Email: damoore3@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:22Z (GMT). No. of bitstreams: 8 PRINTER.PDF: 9795 bytes, checksum: b6b76c62ba12c37192d8913b47a8fee4 (MD5) RECDMGMT.PDF: 10152 bytes, checksum: 25cd91c77c4ad07cb60f2c8f6a3d3370 (MD5) ABSTRACT.PDF: 14238 bytes, checksum: e0833abbd055f56d424e6f9d5b961883 (MD5) REFERENCES.PDF: 19440 bytes, checksum: f3b89822f2b4e043d21e90749c712367 (MD5) TEXT.PDF: 61936 bytes, checksum: a514d7866195d18c6607661a4238548c (MD5) VITA.PDF: 81895 bytes, checksum: 4df3c735e3f4cb44437f6f6f24fa6824 (MD5) APPENDIXES.PDF: 913568 bytes, checksum: b816d7444221c74ad4118309572d2007 (MD5) QABSTRACT.PDF: 14374 bytes, checksum: 030e8569471664582f1266cf9d87ded3 (MD5)   Previous issue date: 1999-06-11"
  ],
  "handle": "28067",
  "identifier_other": "etd-061799-155009",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-061799-155009/",
  "identifier_uri": "http://hdl.handle.net/10919/28067",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "PRINTER.PDF",
    "RECDMGMT.PDF",
    "ABSTRACT.PDF",
    "REFERENCES.PDF",
    "TEXT.PDF",
    "VITA.PDF",
    "APPENDIXES.PDF",
    "QABSTRACT.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "title": "The effect of exaggeration of cartoons on the performance of field dependent learners",
  "type": "Dissertation"
}