{
  "contributor_author": "Mitchell, Kimberly J",
  "contributor_committeechair": "Koebel, Charles Theodore",
  "contributor_committeemember": [
    "Dawkins, Casey J.",
    "Stephenson, Max O. Jr.",
    "Goss, Rosemary Carucci"
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:13:20Z",
  "date_adate": "2008-07-16",
  "date_available": "2014-03-14T20:13:20Z",
  "date_issued": "2008-06-03",
  "date_rdate": "2009-07-16",
  "date_sdate": "2008-06-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation addresses the critical role of landlords in implementing the Housing Choice Voucher program.  Housing choice vouchers provide tenant-based rental assistance to low-income families so that they can have greater opportunities to select apartments and locations than under other rental housing assistance programs.  Vouchers provide a renter with more location, quality and housing type options than project-based subsidized housing. The programâ  s ability to increase choice depends heavily on the decisions of private landlords to accept voucher tenants. This research examines the factors influencing housing choice voucher acceptance by owners, or their agents, specifically property profitability, owner strategies, and perceived majority tenant prejudices.  One previous study attempted to identify the factors that affect landlordsâ   acceptance of vouchers, and was restricted to landlords participating in the voucher program.  This dissertation expands our understanding of landlordsâ   decisions to accept voucher tenants in two key ways: empirical modeling of voucher acceptance using a national sample of rental properties; and qualitative studies of landlords within a single market area.  This research has implications for improving the future performance of the voucher program and the housing quality of low-income renters. By understanding the factors influencing voucher acceptance, public policy makers can utilize this information and direct their efforts to successfully market the program, expand voucher knowledge, and increase non-participating ownersâ   acceptance of vouchers. Furthermore, policy makers can determine if additional legislation is needed to enhance the protection of voucher holderâ  s rights and maintain the supply of eligible units.  Such efforts will enhance the effectiveness of housing agencies and thus, help achieve the goal of providing low-income renters with better housing options.",
  "description_provenance": [
    "Author Email: kjmitch@vt.edu",
    "Advisor Email: tkoebel@vt.edu",
    "Advisor Email: dawkins@vt.edu",
    "Advisor Email: mstephen@vt.edu",
    "Advisor Email: rgoss@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:20Z (GMT). No. of bitstreams: 1 KimberlyJMitchell.pdf: 16724822 bytes, checksum: 331a15df0ccf72d6c6d1dbbb15239613 (MD5)   Previous issue date: 2008-06-03"
  ],
  "handle": "28061",
  "identifier_other": "etd-06172008-005437",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06172008-005437/",
  "identifier_uri": "http://hdl.handle.net/10919/28061",
  "publisher": "Virginia Tech",
  "relation_haspart": "KimberlyJMitchell.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Vouchers",
    "Rental Housing",
    "Multifamily",
    "Affordability",
    "Low-Income Housing",
    "Policy"
  ],
  "title": "Whose Choice Is It Really?: The Impact of Property Profitability, Owner Strategies, & Perceived Majority Tenant Prejudices on Housing Choice Voucher Acceptance",
  "type": "Dissertation"
}