{
  "contributor_author": "McAndrew, Alice E.",
  "contributor_committeechair": "Wiswell, Albert W.",
  "contributor_committeemember": [
    "Boucouvalas, Marcie",
    "Glass, Paul W.",
    "Reio, Thomas G. Jr.",
    "Cline, Marvin Gerald"
  ],
  "contributor_department": "Adult Learning and Human Resource Development",
  "date_accessioned": "2014-03-14T20:13:22Z",
  "date_adate": "2004-08-06",
  "date_available": "2014-03-14T20:13:22Z",
  "date_issued": "2004-06-03",
  "date_rdate": "2004-08-06",
  "date_sdate": "2004-06-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Alice McAndrew's Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>Every year in the United States, cancer accounts for one in four deaths. As the pool of those who have received diagnoses increases, more individuals can be encountered who have survived a terminal diagnosis or exceeded expected time limits for survival. Perhaps even more extraordinary, many of these consider it the 창  best thing창   that ever happened to them. These are the modern eras' 창  mythical창   heroes; they return bearing maps for our own eventual journeys. </p> <p>This study used a grounded theory research approach to illuminate the phenomenon of terminal diagnosis survivorship as evidenced in the psycho/social/spiritual learning process. The unit of analysis is the psychosocial and spiritual learning process as discovered and developed from three cases of individuals who described being positively transformed after receiving a terminal diagnosis. Three research questions were examined: (a) What are the components (e.g., coping strategies, problem solving techniques, emotion management) of the learning process employed by three cancer patients who have experienced a terminal diagnosis? (b) In what ways did the phenomenal meaning of their lives change as they coped with the trauma of a terminal diagnosis followed by remission persisting a significant time past doctors' predictions? (c) What changes did they make in their lives, viewed from a holistic perspective, including thought processes, healthcare, emotion, spirituality and changes in their social lives? A comparative analysis of tape recorded interviews yielded the data resulting in a six-phase model of terminal diagnosis survivorship delineating a psycho/social/spiritual transformational learning process. </p> <p>Death acceptance emerged as a central organizing construct facilitating transformational changes in those given a terminal diagnosis resulting in a constellation of attitudinal and behavioral change. This model challenges and extends theory in adult learning and post traumatic survival by challenging the heavily rational and cognitive based theories of these fields, emphasizing the importance of emotions, altered states, extrarational experiences and spirituality. This model also explicates the role of denial that can alternatively hamper, facilitate or place on hold movement toward death acceptance, the ultimate transformative agent. Additionally, this model elucidates the importance of holding environments on both sustaining and eliciting transformational and developmental change. </p> <strong><br> </strong></body> </html>",
  "description_provenance": [
    "Author Email: alimc@erols.com",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: paulwglass@aol.com",
    "Advisor Email: thomas.reio@louisville.edu",
    "Advisor Email: mgcline@aol.com",
    "Advisor Email: wiswell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:22Z (GMT). No. of bitstreams: 1 AliceETD.pdf: 1649069 bytes, checksum: da177ffd1afd06a9bd2b160be4ada64f (MD5)   Previous issue date: 2004-06-03"
  ],
  "handle": "28069",
  "identifier_other": "etd-06182004-130908",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06182004-130908/",
  "identifier_uri": "http://hdl.handle.net/10919/28069",
  "publisher": "Virginia Tech",
  "relation_haspart": "AliceETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "terminal diagnosis",
    "extended survival",
    "adult learning",
    "psychosocial",
    "exceptional survival",
    "cancer"
  ],
  "title": "Surviving a Terminal Diagnosis: the Ultimate Lifelong Learning Experience",
  "type": "Dissertation"
}