{
  "contributor_author": "Pazhianur, Rajesh R",
  "contributor_committeechair": "Yoon, Roe-Hoan",
  "contributor_committeemember": [
    "Ducker, William A.",
    "Luttrell, Gerald H.",
    "Adel, Gregory T.",
    "Ravishankar, S. A."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:13:21Z",
  "date_adate": "1999-06-26",
  "date_available": "2014-03-14T20:13:21Z",
  "date_issued": "1999-06-04",
  "date_rdate": "2000-06-26",
  "date_sdate": "1999-06-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An atomic force microscope (AFM) has been used to conduct force measurements to better understand the role of hydrophobic forces in flotation.  The force measurements were conducted between a flat mineral substrate and a hydrophobic glass sphere in aqueous solutions.  It is assumed that the hydrophobic glass sphere may simulate the behavior of air bubbles during flotation.  The results may provide information relevant to the bubble-particle interactions occurring during flotation.  The glass sphere was hydrophobized by octadecyltrichlorosilane so that its water contact angle was 109 degrees.  The mineral systems studied include covellite (CuS), sphalerite (ZnS) and hornblende (Ca<sub>2</sub>(Mg, Fe)<sub>5</sub>(Si<sub>8</sub>O<sub>22</sub>)(OH,F)<sub>2</sub>).  The collector used for all the mineral systems studied was potassium ethyl xanthate (KEX).  <p> For the covellite-xanthate system, a biopotentiostat was used in conjunction with the AFM to control the potential of the mineral surface during force measurements.  This was necessary since the adsorption of xanthate is strongly dependent on the electrochemical potential (E<sub>h</sub>) across the solid/liquid interface.  The results show the presence of strong hydrophobic forces not accounted for by the DLVO (named after Derjaguin, Landau, Verwey and Overbeek) theory.  Furthermore, the potential at which the strongest hydrophobic force was measured corresponds to the potential where the flotation recovery of covellite reaches a maximum, indicating a close relationship between the two.   <p> Direct force measurements were also conducted to study the mechanism of copper-activation of sphalerite.  The force measurements conducted with unactivated sphalerite in 10<sup>-3</sup> M KEX solutions did not show the presence of hydrophobic force while the results obtained with copper-activated sphalerite at pH 9.2 and 4.6 showed strong hydrophobic forces.  However, at pH 6.8, no hydrophobic forces were observed, which explains why the flotation of sphalerite is depressed in the neutral pH regime.  <p> Direct force measurements were also conducted using hornblende in xanthate solutions to study the mechanism of inadvertent activation and flotation of rock minerals.  The results show the presence of long-range hydrophobic forces when hornblende was activated by heavy metal cations such as Cu<sup>2+</sup> and Ni<sup>2+</sup> ions.  The strong hydrophobic forces were observed at pHs above the precipitation pH of the activating cation.  These results were confirmed by the XPS analysis of the activated hornblende samples. <p> Force measurements were conducted between silanated silica surfaces to explore the relationship between hydrophobicity, advancing contact angle (CA), and the magnitude (K) of hydrophobic force.  In general, K increases as Contact Angle increases and does so abruptly at Contact Angle=90<sup>0</sup>.  At the same time, the acid-base component of the surface free energy decreases with increasing CA and K.  At CA>90<sup>0</sup>, GammaS<sup>AB</sup> approaches zero.   <p> Based on the results obtained in the present work a mathematical model for the origin of the hydrophobic force has been developed.  It is based on the premise that hydrophobic force originates from the attraction between large dipoles on two opposing surfaces.  The model has been used successfully to fit the measured hydrophobic forces using dipole moment as the only adjustable parameter.  However, the hydrophobic forces measured at CA>90<sup>0</sup> cannot be fitted to the model, indicating that there may be an additional mechanism, possibly cavitation, contributing to the appearance of the long-range hydrophobic force.",
  "description_provenance": [
    "Author Email: rpazhian@vt.edu",
    "Advisor Email: wducker@chemserver.chem.vt.edu",
    "Advisor Email: luttrell@vt.edu",
    "Advisor Email: adel@vt.edu",
    "Advisor Email: sa.ravishankar@engelhard.com",
    "Advisor Email: ryoon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:21Z (GMT). No. of bitstreams: 11 abstract.pdf: 107658 bytes, checksum: 28b447154a6a14725818ec967d1d5c62 (MD5) chapter1.pdf: 92458 bytes, checksum: fc8081d2dd26a77d7abbc9d7549b9c62 (MD5) chapter2.pdf: 93482 bytes, checksum: 06fd9baba06f527e7fbcc6e3f113c818 (MD5) chapter3.pdf: 97725 bytes, checksum: 4f6ce945f451cf7e4e8f0bac022689c4 (MD5) chapter4.pdf: 157589 bytes, checksum: f2bb0c849530da97bfb0b87cdd206bfc (MD5) chapter5.pdf: 281177 bytes, checksum: d8cabe98e84977add13fd93eae9f0789 (MD5) chapter6.pdf: 139775 bytes, checksum: d942e9b43c50f0f82b7e1d0141311201 (MD5) chapter7.pdf: 17529 bytes, checksum: 59f76fa9b3e97ce73990c91df8d849d6 (MD5) chapter8.pdf: 8970 bytes, checksum: f87145363f9e4664112ba5f8da0e9df9 (MD5) vita.pdf: 4993 bytes, checksum: 08aafac026b2f6a7dbcb24fc2efe5501 (MD5) RPTITLE.PDF: 5419 bytes, checksum: 30ac462261b7203d3e6b83b98c8515ec (MD5)   Previous issue date: 1999-06-04"
  ],
  "handle": "28066",
  "identifier_other": "etd-061799-145815",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-061799-145815/",
  "identifier_uri": "http://hdl.handle.net/10919/28066",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "abstract.pdf",
    "chapter1.pdf",
    "chapter2.pdf",
    "chapter3.pdf",
    "chapter4.pdf",
    "chapter5.pdf",
    "chapter6.pdf",
    "chapter7.pdf",
    "chapter8.pdf",
    "vita.pdf",
    "RPTITLE.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "xanthate",
    "atomic force microscope",
    "hydrophobic force",
    "hydrophobicity",
    "sphalerite",
    "hornblende",
    "covellite"
  ],
  "title": "Hydrophobic Forces in Flotation",
  "type": "Dissertation"
}