{
  "contributor_author": "Clayton-Prince, Lynn",
  "contributor_committeechair": "Magliaro, Susan G.",
  "contributor_committeemember": [
    "Williams, Thomas O. Jr.",
    "Martin, Rosalie Marie",
    "Whitaker, Carol E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:13:22Z",
  "date_adate": "2007-08-03",
  "date_available": "2014-03-14T20:13:22Z",
  "date_issued": "2007-06-13",
  "date_rdate": "2007-08-03",
  "date_sdate": "2007-06-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In Virginia students with learning disabilities, as well as students in general education, are required to pass the Virginia Standards of Learning test in order to receive a diploma from high school.  Currently there are 20 states that use exit exams with five more states anticipated to start by 2009 (Center on Education Policy, 2005).  The purpose of this study was to identify the perceptions of Virginia Special Education Directors, Principals and Lead Teachers regarding the impact of the state graduation requirements on the educational experiences of and outcomes for students with learning disabilities.  This study was adapted from a similar investigation conducted from Indiana and applied to survey Virginia administrators.  Additionally, the study was used to identify the changes Virginia administrators perceive are needed in order to best support students in meeting those requirements. \tThe target population of participants of this study consisted of three groups of educators: (a) Directors of Special Education; (b) Principals; and (c) Lead Teachers of Special Education in Virginia public high schools.  A survey research design was employed for this study.  The instrument included 70 Likert type items, with one demographic item.  A total of 510 surveys were sent through email to administrators in the state of Virginia; 148 were returned with incorrect addresses.  A response total of 104 emails were received: Directors of Special Education, 26.9%; Principals, 56.7%; and Lead Teachers, 16.3%.  Data were analyzed using descriptive statistics.  A descriptive summary of responses for respondents was developed using mean and frequency percentages.  Inferential statistics was used to answer the research questions presented in this study.  Analysis of Variance (ANOVA) was used to determine if there was a significant difference between the three groups regarding high stakes testing of students with learning disabilities.  Significance (p less than or equal to .05) was not noted in any areas when comparing administrators perspectives of graduation requirements that impact educational experiences and outcomes of students, however the area of changes that administrators perceive are needed in order to best support students in meeting these requirements, significance (p less than or equal to .05) was noted. \tFindings indicate that administrators felt that as a result of the graduation requirement, it is important for special education students to be included in general education classes and exposed to the general education curriculum.  They also agreed that special education and general education teachers need to be exposed to professional development to help students be successful in high stakes testing.  Another finding from this study was administrators felt that including greater use of practice materials and instruction in test taking would also be needed to help students be successful.",
  "description_provenance": [
    "Author Email: lynn.prince@powhatan.k12.va.us",
    "Advisor Email: thwilli1@vt.edu",
    "Advisor Email: rowhite@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: cwhitaker@rcs@rcs.k12.va.us",
    "Made available in DSpace on 2014-03-14T20:13:22Z (GMT). No. of bitstreams: 3 01FinalDissertation.pdf: 658129 bytes, checksum: 6e475d8d72bcae1857e79294c45b8744 (MD5) 03FinalTitlePageDissertation.pdf: 66291 bytes, checksum: 6b6ff47158f10696438a85f41906487e (MD5) 02DISSERTATIONACKNOWLEDGMENTS.pdf: 102471 bytes, checksum: 9565131d266800d716308a6885bcb263 (MD5)   Previous issue date: 2007-06-13"
  ],
  "handle": "28072",
  "identifier_other": "etd-06182007-180322",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06182007-180322/",
  "identifier_uri": "http://hdl.handle.net/10919/28072",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01FinalDissertation.pdf",
    "03FinalTitlePageDissertation.pdf",
    "02DISSERTATIONACKNOWLEDGMENTS.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "high stakes testing",
    "qualifying examination",
    "learning disabilities",
    "administrators"
  ],
  "title": "Administrators' Pespectives of the Impact of Mandatory Qualifying Examinations for Students with Learning Disabilities",
  "type": "Dissertation"
}