{
  "contributor_author": "Klein, Michael Joseph",
  "contributor_committeecochair": [
    "Halfon, Saul E.",
    "Hirsh, Richard F."
  ],
  "contributor_committeemember": [
    "Collier, James H.",
    "Dubinsky, James M.",
    "King, Neal M."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:13:23Z",
  "date_adate": "2007-07-13",
  "date_available": "2014-03-14T20:13:23Z",
  "date_issued": "2007-06-05",
  "date_rdate": "2007-07-13",
  "date_sdate": "2007-06-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An ethical frame grounded in science fiction literature shaped the discourse on cloning following the announcement of Dolly-the-sheepâ  s birth through nuclear transfer. Using methodologies drawn from the social shaping of technology (SST) and rhetoric of science, my analysis demonstrates how individuals and institutions, including the media, ethicists, policymakers, and legislators, appropriated and re-appropriated this ethical frame. In doing so, they employed science-fiction stories as rhetorical tropes, thereby providing the public with a frame for understanding the social issues involved with cloning. However, these institutions used science fiction as a way to simplify and present ethical arguments that silenced dissent rather than encouraged dialog.       While ethics discourse can validly make use of literature in debates about technology, such a simplistic view of the literature misrepresents the themes the authors explored in their works and limits discussion. I conclude by offering a deeper analysis and reading of some of these stories, relying on the texts themselves rather than the myths that have evolved around these texts as my primary source material. Such a reading provides a valuable counter-narrative to the on-going debate, one that more adequately explains the effects of technology in a society.       In short, this dissertation demonstrates that the reductionist interpretation of works from the science fiction genre had real effects on policy formulation. People utilized their literary-derived perceptions of cloning in political discussions about technology. Thus, policy discussions of the perceived effects of the technology developed much of their meaning and significance from fictional depictions of the technology.",
  "description_provenance": [
    "Author Email: mklein@vt.edu",
    "Advisor Email: shalfon@vt.edu",
    "Advisor Email: richards@vt.edu",
    "Advisor Email: jcollie@vt.edu",
    "Advisor Email: dubinsky@vt.edu",
    "Advisor Email: nmking@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:23Z (GMT). No. of bitstreams: 1 klein_diss_final_rev.pdf: 719146 bytes, checksum: d4c6cfc9f596d85d2680286660b35d50 (MD5)   Previous issue date: 2007-06-05"
  ],
  "handle": "28074",
  "identifier_other": "etd-06182007-223727",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06182007-223727/",
  "identifier_uri": "http://hdl.handle.net/10919/28074",
  "publisher": "Virginia Tech",
  "relation_haspart": "klein_diss_final_rev.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cloning",
    "rhetoric",
    "science fiction",
    "science policy"
  ],
  "title": "The Rhetoric of Repugnance: Popular Culture and Unpopular Notions in the Human Cloning Debate",
  "type": "Dissertation"
}