{
  "contributor_author": "Sumner, Emmett Ashworth",
  "contributor_committeechair": "Murray, Thomas M.",
  "contributor_committeemember": [
    "Holzer, Siegfried M.",
    "singh, Mahendra P.",
    "Charney, Finley A.",
    "Easterling, William Samuel"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:13:23Z",
  "date_adate": "2003-06-30",
  "date_available": "2014-03-14T20:13:23Z",
  "date_issued": "2003-06-17",
  "date_rdate": "2003-06-30",
  "date_sdate": "2003-06-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Experimental and analytical research has been conducted to develop unified design procedures for eight extended end-plate moment connection configurations subject to cyclic/seismic loading.  In addition, the suitability of extended end-plate moment connections for use in seismic force resisting moment frames was investigated.  Eleven full-scale cyclic and nine monotonic extended end-plate moment connection tests were conducted.  Design procedures for determining the required bolt diameter and grade, end-plate thickness, and column flange thickness were developed.  The proposed design procedure utilizes a strong column, strong connection, and weak beam design philosophy.  This forces the connecting beam to provide the required inelastic deformations through formation of a plastic hinge adjacent to the connection region.  The proposed design procedure was used to make comparisons with ninety experimental tests conducted over the past twenty-six years.  A limited finite element study was conducted to investigate the behavior of the column flange.   The experimental results demonstrate that extended end-plate moment connections can be detailed and designed to be suitable for use in seismic force resisting moment frames.  The proposed design procedure strength predictions correlated well with the results from ninety experimental tests.  The limited finite element modeling conducted as a part of this study, correlated well with the strength predictions produced by the proposed design procedure.",
  "description_provenance": [
    "Author Email: emmett_sumner@ncsu.edu",
    "Advisor Email: holzer@vt.edu",
    "Advisor Email: mpsingh@vt.edu",
    "Advisor Email: fcharney@vt.edu",
    "Advisor Email: seaster@vt.edu",
    "Advisor Email: thmurray@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:23Z (GMT). No. of bitstreams: 1 etd_Sumner.pdf: 3281033 bytes, checksum: 4cca7046e4bc61d1e1c9271c0a7979a7 (MD5)   Previous issue date: 2003-06-17"
  ],
  "handle": "28078",
  "identifier_other": "etd-06192003-172135",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06192003-172135/",
  "identifier_uri": "http://hdl.handle.net/10919/28078",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd_Sumner.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "bolted",
    "end-plate",
    "steel",
    "cyclic",
    "seismic",
    "connection"
  ],
  "title": "Unified Design of Extended End-Plate Moment Connections Subject to Cyclic Loading",
  "type": "Dissertation"
}