{
  "contributor_author": "Magalhaes, Edward Pereira",
  "contributor_committeechair": "Sutphin, H. Dean",
  "contributor_committeemember": [
    "Stratton, Richard K.",
    "Bolin, Delmas",
    "Redican, Kerry J."
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:13:23Z",
  "date_adate": "2011-09-01",
  "date_available": "2014-03-14T20:13:23Z",
  "date_issued": "2011-06-09",
  "date_rdate": "2011-09-01",
  "date_sdate": "2011-06-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to determine the prevalence of known risk factors associated with diabetes among James Moody Adams (JMA) clinic patients in order to develop and test educational material and clinical interventions to reduce the incidence of pre-diabetes and uncontrolled Type II Diabetes.  The research objectives for this study focused on: 1. prevalence of Type II Diabetic patients at the Clinic; 2. pre- and post-test knowledge level of patients regarding their Type II Diabetes; 3. relationship between dependent variables (body mass index [BMI], blood glucose level, blood pressure, waist circumference, level of tobacco use, and level of depression) and the independent variables (age, gender, family history of diabetes, socio-demographical data [education level, level of income], literacy, and exercise regimen, medication, and diabetes knowledge); 4. effectiveness of a nutritional and lifestyle modification intervention program to control Type II Diabetes.  Two hypotheses tests: 1. decrease blood glucose levels of Type II Diabetes Mellitus patients; 2.  decrease weight by 5 percent among pre-diabetic and Type II Diabetes Mellitus patients. A follow-up survey determined participantâ  s reflection on key dimensions of the study and impact of unforeseen political unrest that occurred during this study. The methodology was a case study with clinical and educational intervention across a 6 months. The population included patients presenting at the JMA clinic at onset of the study; an initial sample of 96 reduced to 48 due in part to political unrest was still within power test specification. Instrumentation include researcher developed, standard of care clinical practice and standardized forms. Analyses utilized descriptive statistics and t-test. Significant gain was determined for diabetic knowledge (p < 0.001); and significant decrease in Type II Diabetic blood glucose with p = 0.031. An important conclusion is that implementing a Type II Diabetic prevention program is feasible and effective in this study. Future recommendations include replication of the study and implementation of protocols and education that were successful in this study.",
  "description_provenance": [
    "Author Email: emagalha@vt.edu",
    "Advisor Email: dsutphin@vcom.vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: dbolin@vcom.vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:23Z (GMT). No. of bitstreams: 2 Magalhaes_EP_D_2011_FairUse.pdf: 167271 bytes, checksum: 0f474b1707852ebbbb49b85e655db49c (MD5) Magalhaes_EP_D_2011_3.pdf: 2239577 bytes, checksum: 5802fca47f83d5bc1c87dfa4628d4836 (MD5)   Previous issue date: 2011-06-09"
  ],
  "handle": "28075",
  "identifier_other": "etd-06182011-014919",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06182011-014919/",
  "identifier_uri": "http://hdl.handle.net/10919/28075",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Magalhaes_EP_D_2011_FairUse.pdf",
    "Magalhaes_EP_D_2011_3.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "diabetes mellitus",
    "type II diabetes",
    "pre-diabetes",
    "Tegucigalpa",
    "Honduras"
  ],
  "title": "Type II Diabetic Control and Prevalence in Tegucigalpa, Honduras: Patients of the James Moody Adams Clinic at the Baxter Institute",
  "type": "Dissertation"
}