{
  "contributor_author": "Montazami, Reza",
  "contributor_committeechair": "Heflin, James R.",
  "contributor_committeemember": [
    "Whittington, Abby R.",
    "Corcoran, Sean Gerald",
    "Leo, Donald"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:13:24Z",
  "date_adate": "2011-08-22",
  "date_available": "2014-03-14T20:13:24Z",
  "date_issued": "2011-06-03",
  "date_rdate": "2011-08-22",
  "date_sdate": "2011-06-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Ionic electroactive polymer (IEAP) actuators are a class of electroactive polymer devices that exhibit electromechanical coupling through ion transport in the device. They consist of an ionomeric membrane coated with conductive network composites (CNCs) and conductive electrodes on both sides. A series of experiments on IEAP actuators with various types of CNCs has demonstrated the existence of a direct correlation between the performance of actuators and physical and structural properties of the CNCs. Nanostructure of CNC is especially important in hosting electrolyte and boosting ion mobility. This dissertation presents a series of systematic experiments and studies on IEAP actuators with two primary focuses: 1) CNC nanostructure, and 2) ionic interactions.  A novel approach for fabrication of CNC thin-films enabled us to control physical and structural properties of the CNC thin-films. We, for the first time, facilitated use of layer-by-layer ionic self-assembly technique in fabrication of porous and conductive CNCs based on polymer and metal nanoparticles. Results were porous-conductive CNCs. We have studied the performance dependence of IEAP actuators on nano-composition and structure of CNCs by systematically varying the thickness, nanoparticle size and nanoparticle concentration of CNCs. We have also studied influence of the waveform frequency, free-ions and counterions of the ionomeric membrane on the performance and behavior of IEAP actuators.  Using the LbL technique, we systematically changed the thickness of CNC layers consisting of gold nanoparticles (AuNPs) and poly(allylamine hydrochloride). It was observed that actuators consisting of thicker CNCs exhibit larger actuation curvature, which is evidently due to uptake of larger volume of electrolyte. Actuation response-time exhibited a direct correlation to the sheet-resistance of CNC, which was controlled by varying the AuNP concentration. It was observed that size and type of free-ions and counterion of ionomeric membrane are also influential on the actuation behavior or IEAP actuators and that the counterion of ionomeric membrane participates in the actuation process.",
  "description_provenance": [
    "Author Email: rezam@vt.edu",
    "Advisor Email: awhit@mse.vt.edu",
    "Advisor Email: sgc@vt.edu",
    "Advisor Email: donleo@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:24Z (GMT). No. of bitstreams: 1 Montazami_R_D_2011.pdf: 6149146 bytes, checksum: aef1e1c959a0f3e44af4d68cc4698c07 (MD5)   Previous issue date: 2011-06-03"
  ],
  "handle": "28084",
  "identifier_other": "etd-06192011-131819",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06192011-131819/",
  "identifier_uri": "http://hdl.handle.net/10919/28084",
  "publisher": "Virginia Tech",
  "relation_haspart": "Montazami_R_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Soft Microrobotics",
    "Smart Materials",
    "Ionic Electroactive Polymer Actuators",
    "Electromechanical Actuator"
  ],
  "title": "Smart Polymer Electromechanical Actuators for Soft Microrobotic Applications",
  "type": "Dissertation"
}