{
  "contributor_author": "Kim, Dong  Won",
  "contributor_committeechair": "Goodsell, Charles T.",
  "contributor_committeemember": [
    "Pethtel, Ray D.",
    "Dickey, John W.",
    "Worrall, Richard D.",
    "Wamsley, Gary L."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:13:25Z",
  "date_adate": "2001-06-21",
  "date_available": "2014-03-14T20:13:25Z",
  "date_issued": "2001-06-14",
  "date_rdate": "2002-06-21",
  "date_sdate": "2001-06-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is a descriptive study of a policy network designed for U.S. government and global cooperation to promote Intelligent Transportation Systems (ITS).  It is aimed at exploring the historical and structural features of the ITS policy network, and evaluating its roles in the policy process.   Until now, the network literature has barely examined the full arrays of networks, catching just part of their full pictures. First, this study draws attention to transnational networks and their organic or systematic relationships with lower levels of networks. Second, it examines the individual properties and synergy of three core elements of the ITS policy network: public-private partnerships, professional networks, and intergovernmental networks. Third, it takes a close look at the pattern of stability change and power relations of the policy network from within the net. Finally, this study discusses what difference networks make, compared to hierarchies and markets.  This dissertation employed multiple sources of evidence: unstandardized elite interviews, government documents, and archival records. Through a networking strategy to find the best experts, face-to-face, telephone, and e-mail interviews were conducted with twenty-two public officials and ITS professionals.  It was found that the U.S. ITS policy network was a well-designed strategic governance structure at the planning level, but an experimental learning-focused one at the implementation level. It was initially designed by a new, timely, cross-sectional coalition, which brought together field leaders from both the public and the private sectors under the slogan of global competitiveness. Yet, day-to-day managers within the net often experience much more complex power relationships and internal dynamics as well as legal obstacles; also, they confront external uncertainty in political support and market.   For better results, policy networks should be designed in flexible ways that will handle their disadvantages such as ambiguous roles, exclusiveness, and increased staff time. In this respect, it is inevitable for the networks to include some components of a wide range of conventional structures, ranging from highly bureaucratic to highly entrepreneurial, on the one hand, and ranging between issue networks (grounded in American pluralism) and policy communities (based on European corporatism), on the other hand.",
  "description_provenance": [
    "Author Email: dokim2@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:25Z (GMT). No. of bitstreams: 1 ITSNET.pdf: 2017318 bytes, checksum: 06378c597551cf46618f40d5a669c0d6 (MD5)   Previous issue date: 2001-06-14"
  ],
  "handle": "28087",
  "identifier_other": "etd-06202001-162624",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06202001-162624/",
  "identifier_uri": "http://hdl.handle.net/10919/28087",
  "publisher": "Virginia Tech",
  "relation_haspart": "ITSNET.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Policy Subsystem",
    "Governance",
    "Transport",
    "Globalization"
  ],
  "title": "Intelligent Transportation Systems: A Multilevel Policy Network",
  "type": "Dissertation"
}