{
  "contributor_author": "O'Neill, Erin Kristine",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Burton, John K.",
    "Peterson, Michael",
    "Hosig, Kathryn Wright",
    "Redican, Kerry J.",
    "Brooks, Timothy"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:13:24Z",
  "date_adate": "2007-09-06",
  "date_available": "2014-03-14T20:13:24Z",
  "date_issued": "2007-05-24",
  "date_rdate": "2007-09-06",
  "date_sdate": "2007-06-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Literature reveals that college freshmen that reside on American campuses partake in many risky health behaviors, but little is known on the effects of housing on these risk behaviors. The purpose of this study was to examine the health risk behaviors of college freshmen that lived in either traditional, non-themed housing or in wellness themed housing (WELL) and if there was a difference between the two. Four research questions guided this study: (1). What are the risk behaviors of freshmen college students? (2). What are the risk behaviors of students in the WELL LC? (3). What are the risk behaviors of freshman residing in traditional housing? (4). What are the differences in risk behaviors between the freshmen living in the WELL LC and traditionally housed freshmen? The health risk behaviors that were determined for testing were injury-related behaviors, substance use behaviors, sexual behaviors, dietary behaviors, physical activity and sleep. The instrument used was a combination of the National College Health Risk Behavior Survey and Epworth Sleep Survey. The Traditional and the WELL completed the surveys in the beginning of the fall semester and again at the end of the spring semester of the same academic year. There were a higher percentage of alcohol-related injury behaviors, substance use and sexual activity in traditional residents. Dietary behaviors, physical activity and sleep behaviors were not significantly different between Traditional and WELL residents. The conclusion of this study indicated that the WELL housing may have had a positive effect on abstaining from alcohol, drugs, and sexual behaviors. Further research is needed to explore the root cause of these behavioral differences.",
  "description_provenance": [
    "Author Email: erin.k.oneill@gmail.com",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: pmpeter@udel.edu",
    "Advisor Email: khosig@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: tbrooks@udel.edu",
    "Made available in DSpace on 2014-03-14T20:13:24Z (GMT). No. of bitstreams: 1 ONeill.Doctoral.Dissertation1.pdf: 1748470 bytes, checksum: 2a96e51ccad962d19ed19c0212e438a3 (MD5)   Previous issue date: 2007-05-24"
  ],
  "handle": "28081",
  "identifier_other": "etd-06192007-113600",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06192007-113600/",
  "identifier_uri": "http://hdl.handle.net/10919/28081",
  "publisher": "Virginia Tech",
  "relation_haspart": "ONeill.Doctoral.Dissertation1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "College Freshmen",
    "Health Risk Behaviors",
    "Residential Housing"
  ],
  "title": "Differences in Health Risk Behaviors between College Freshmen Living in Special Interest Housing and Traditional Housing",
  "type": "Dissertation"
}