{
  "contributor_author": "Hareau, Guy Gaston",
  "contributor_committeechair": "Norton, George W.",
  "contributor_committeecochair": "Mills, Bradford F.",
  "contributor_committeemember": [
    "Salehi-Isfahani, Djavad",
    "Alwang, Jeffrey R.",
    "Peterson, Everett B."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:13:25Z",
  "date_adate": "2006-09-06",
  "date_available": "2014-03-14T20:13:25Z",
  "date_issued": "2006-06-13",
  "date_rdate": "2006-09-06",
  "date_sdate": "2006-06-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The unequal distribution of gains from technology between favorable and unfavorable rice environments in Asia can widen if future transgenic rice varieties cannot be adopted in less favored regions. This study investigates the potential economic impacts of three transgenic rice technologies: stemborer resistance, for favorable irrigated environments; drought resistance, for unfavorable non-irrigated environments; and herbicide resistance, which can potentially benefit any of the environments but can only be adopted in areas under direct seeding. Specifying individual technologies contributes to a better comparative assessment of impacts from transgenic rice. The simulation uses a modified version of the Global Trade Analysis Project (GTAP) model with several innovative features: the database and code represent the distinct rice environments for both paddy and seed sectors; monopoly power is included in the model as a markup tax instrument when private firms sell herbicide resistant rice seed; and private rents can be transferred between regions and change income computation in the model. Equivalent variation measures obtained from simulations are similar at 2.3 billion, 2.5 billion and 2.2 billion dollars for stemborer, drought and herbicide resistance respectively. All technologies increase global rice output and reduce rice prices, while keeping labor wages at stable levels. Private provision of herbicide resistance rice generates benefits of 2.05 billion dollars while creating 122 million dollars in private profits. Although profits increase with higher markups, there are still large social benefits to realize from herbicide resistance technology. However, producersâ   response to reduced profitability is not accounted for and adoption is an exogenous variable in the model. The results suggest that the large expected impact from drought resistant rice supports public research investment on this technology. Joint efforts between public and private research sectors can increase the probability of success, and mechanisms to promote private research for unfavorable environments should be developed. Public policies should also remove obstacles that prevent firms from undertaking joint research with the public sector. Outcomes from public research, such as improved germplasm and spread of direct seeding techniques, also benefit the private sector and should act as an incentive for firms to build strategic alliances.",
  "description_provenance": [
    "Author Email: ghareau@vt.edu",
    "Advisor Email: salehi@vt.edu",
    "Advisor Email: alwangj@vt.edu",
    "Advisor Email: gnorton@vt.edu",
    "Advisor Email: bfmills@vt.edu",
    "Advisor Email: petrsone@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:25Z (GMT). No. of bitstreams: 2 GuyHareauAppendixB(SAMs).pdf: 62127 bytes, checksum: 80d7992b59168f6cc5ed8a0f028e1706 (MD5) GuyHareauDissertation.pdf: 1336790 bytes, checksum: 3a596f06469453fbe49b9c53124d36e2 (MD5)   Previous issue date: 2006-06-13"
  ],
  "handle": "28092",
  "identifier_other": "etd-06212006-141903",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06212006-141903/",
  "identifier_uri": "http://hdl.handle.net/10919/28092",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "GuyHareauAppendixB(SAMs).pdf",
    "GuyHareauDissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "GTAP",
    "monopoly power",
    "biotechnology",
    "technical change",
    "rice environments"
  ],
  "title": "Transgenic Rice in Asia: A General Equilibrium Assessment of Potential Welfare Effects and Regional Distribution",
  "type": "Dissertation"
}