{
  "contributor_author": "Yuan, Yiqing",
  "contributor_committeechair": "Vandsburger, Uri",
  "contributor_committeemember": [
    "Brown, Eugene F.",
    "Dancey, Clinton L.",
    "Mungal, M. Godfrey",
    "Telionis, Demetri P."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:13:26Z",
  "date_adate": "2001-03-22",
  "date_available": "2014-03-14T20:13:26Z",
  "date_issued": "2000-05-31",
  "date_rdate": "2002-03-22",
  "date_sdate": "2000-06-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Rapid mixing is crucial for the efficient and environment-friendly operation of many industrial and propulsion devices involving jet flows. In this dissertation, two methodologies, self-excited nozzles and radially lobed nozzles, are studied and presented in order to enhance mixing in the near field of coflowing, subsonic, turbulent, free jet flows. The characteristics of the concentration field and the mixing performance are examined, mainly in quantitative manner. Two new parameters, mixing index and mixing efficiency index, are defined for free jets, allowing quantitative analysis of the mixing performance and efficiency. The flow fields are studied with hot wire anemometry, and with CFD simulation for some of the radially lobed nozzles. Due to the large vectoring angle of the jet flows from these nozzles, a new definition for the entrainment ratio is also adopted in order to take the large radial velocity component into consideration. Self-excited nozzles, rectangular and square shaped, are examined at Reynolds numbers of 17,000 and 31,000. The self-excited square jet has fastest mixing and highest mixing efficiency, with 400% higher mixing index at 4 diameters downstream than the unexcited square jet. The mixing is improved as the excitation frequency or coflow velocity increases. The study of flow field shows the presence of one pair of periodic, coherent array of large-scale, streamwise, counter-rotating inviscid vortices shedding from each of the two flaps which dominate the mean flow and the mixing process. The coflow is primarily entrained into the jet in the minor plane while the jet fluid vectors in the major plane. Significant increase in turbulent kinetic energy immediately downstream the nozzle exit improves small-scale mixing. Radially lobed nozzles, a cross-shaped and a clover-shaped with four lobes each, are analyzed in comparison to a conical nozzle. In addition, a few modified radially lobe nozzles, including a 6-lobe nozzle and an 8-lobe nozzle, two type of fully penetrating nozzles, and a cross-shaped nozzle with centerbody, are examined in order to achieve better mixing than the cross-shaped nozzle. At 4 diameters downstream, the mixing index of the cross-shaped nozzle is 650% higher than that of the conical nozzle. The cross-shaped nozzle with centerbody, the 6- lobe and 8-lobe nozzles have slower mixing and lower efficiency than the cross-shaped nozzle,but the fully-penetrating nozzles are generally better than the cross-shaped nozzle, especially at low coflow velocities and in the far field. The flow field study shows that parallel lobe walls and deep penetration of the coflow are importance factors responsible for the observed mixing enhancement.",
  "description_provenance": [
    "Author Email: yyuan888@home.com",
    "Advisor Email: efbrown@vt.edu",
    "Advisor Email: uri@shakti.me.vt.edu",
    "Advisor Email: ecd@vtvm1.cc.vt.edu",
    "Advisor Email: mungal@leland.stanford.edu",
    "Advisor Email: telionis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:26Z (GMT). No. of bitstreams: 1 yuan_thesis.pdf: 40309865 bytes, checksum: 85f070a599877410505082b34ca8c772 (MD5)   Previous issue date: 2000-05-31"
  ],
  "handle": "28097",
  "identifier_other": "etd-06222000-22310027",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06222000-22310027/",
  "identifier_uri": "http://hdl.handle.net/10919/28097",
  "publisher": "Virginia Tech",
  "relation_haspart": "yuan_thesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "jet",
    "jet control",
    "flow control",
    "fluid mechanics",
    "mixing control"
  ],
  "title": "Jet Fluid Mixing Control Through Manipulation Jet Fluid Mixing Control Through Manipulation of Inviscid Flow Structures",
  "type": "Dissertation"
}