{
  "contributor_author": "Yang, Kuan",
  "contributor_committeecochair": [
    "Setubal, João C.",
    "Heath, Lenwood S."
  ],
  "contributor_committeemember": [
    "Vinatzer, Boris A.",
    "Dickerman, Allan W.",
    "Tyler, Brett M."
  ],
  "contributor_department": "Genetics, Bioinformatics, and Computational Biology",
  "date_accessioned": "2014-03-14T20:13:25Z",
  "date_adate": "2012-06-25",
  "date_available": "2014-03-14T20:13:25Z",
  "date_issued": "2012-06-06",
  "date_rdate": "2012-06-25",
  "date_sdate": "2012-06-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The rapid accumulation of numerous sequenced genomes has provided a golden opportunity for ancestral state reconstruction studies, especially in the whole genome reconstruction area. However, most ancestral genome reconstruction methods developed so far only focus on gene or replicon sequences instead of whole genomes. They rely largely on either detailed modeling of evolutionary events or edit distance computation, both of which can be computationally prohibitive for large data sets. Hence, most of these methods can only be applied to a small number of features and species. In this dissertation, we describe the design, implementation, and evaluation of an ancestral genome reconstruction system (REGEN) for bacteria. It is the first bacterial genome reconstruction tool that focuses on ancestral state reconstruction at the genome scale instead of the gene scale. It not only reconstructs ancestral gene content and contiguous gene runs using either a maximum parsimony or a maximum likelihood criterion but also replicon structures of each ancestor. Based on the reconstructed genomes, it can infer all major events at both the gene scale, such as insertion, deletion, and translocation, and the replicon scale, such as replicon gain, loss, and merge. REGEN finishes by producing a visual representation of the entire evolutionary history of all genomes in the study. With a model-free reconstruction method at its core, the computational requirement for ancestral genome reconstruction is reduced sufficiently for the tool to be applied to large data sets with dozens of genomes and thousands of features. To achieve as accurate a reconstruction as possible, we also develop a homologous gene family prediction tool for preprocessing. Furthermore, we build our in-house Prokaryote Genome Evolution simulator (PEGsim) for evaluation purposes. The homologous gene family prediction refinement module can refine homologous gene family predictions generated by third party de novo prediction programs by combining phylogeny and local gene synteny. We show that such refinement can be accomplished for up to 80% of homologous gene family predictions with ambiguity (mixed families). The genome evolution simulator, PEGsim, is the first random events based high level bacteria genome evolution simulator with models for all common evolutionary events at the gene, replicon, and genome scales. The concepts of conserved gene runs and horizontal gene transfer (HGT) are also built in. We show the validation of PEGsim itself and the evaluation of the last reconstruction component with simulated data produced by it. REGEN, REconstruction of GENomes, is an ancestral genome reconstruction tool based on the concept of neighboring gene pairs (NGPs). Although it does not cover the reconstruction of actual nucleotide sequences, it is capable of reconstructing gene content, contiguous genes runs, and replicon structure of each ancestor using either a maximum parsimony or a maximum likelihood criterion. Based on the reconstructed genomes, it can infer all major events at both the gene scale, such as insertion, deletion, and translocation, and the replicon scale, such as replicon gain, loss, and merge. REGEN finishes by producing a visual representation of the entire evolutionary history of all genomes in the study.",
  "description_provenance": [
    "Author Email: yangk81@vt.edu",
    "Advisor Email: setubal@vbi.vt.edu",
    "Advisor Email: heath@vt.edu",
    "Advisor Email: vinatzer@vt.edu",
    "Advisor Email: dickerman@vt.edu",
    "Advisor Email: Brett.Tyler@oregonstate.edu",
    "Made available in DSpace on 2014-03-14T20:13:25Z (GMT). No. of bitstreams: 2  supplemental.zip: 4741733 bytes, checksum: fa890db28b4886aacdfe0ed62fbf77eb (MD5)  Yang_K_D_2012.pdf: 4506847 bytes, checksum: 09628a115650e660992baa48c6c3edcc (MD5)    Previous issue date: 2012-06-06"
  ],
  "handle": "28091",
  "identifier_other": "etd-06202012-151739",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06202012-151739/",
  "identifier_uri": "http://hdl.handle.net/10919/28091",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "supplemental.zip",
    "Yang_K_D_2012.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "homology",
    "genomics",
    "NGP",
    "phylogenetics",
    "genome evolution simulation",
    "ancestral genome reconstruction"
  ],
  "title": "Ancestral Genome Reconstruction in Bacteria",
  "type": "Dissertation"
}