{
  "contributor_author": "Kostandini, Gentian",
  "contributor_committeechair": "Mills, Bradford F.",
  "contributor_committeemember": [
    "Alwang, Jeffrey R.",
    "Norton, George W.",
    "Bosch, Darrell J."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:13:25Z",
  "date_adate": "2008-07-21",
  "date_available": "2014-03-14T20:13:25Z",
  "date_issued": "2008-06-06",
  "date_rdate": "2008-07-21",
  "date_sdate": "2008-06-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is comprised of three essays that generate methods to measure the ex-ante economic impacts of agriculture technology innovations. The first essay entitled â  Valuing Intellectual Property Rights in an Imperfectly Competitive Market: A Biopharming Applicationâ   presents a method for valuing the intellectual property rights (IPRs) for an innovation that lowers product production costs below those associated with the patented process of a monopolist. The application to Glucocerebrosidase enzyme from transgenic tobacco suggests an intellectual property rights (IPRs) value of about $1.75 billion. Despite the innovatorâ  s market power, significant surplus gains also accrue to consumers. Further, U.S. antitrust laws that prohibit IPRs acquisition by the current monopolist increase consumer welfare by almost 50 percent.  \tThe second essay entitled â  Ex-Ante Analysis of the Benefits of Transgenic Drought Tolerance Research on Cereal Crops in Low-Income Countriesâ   develops a framework to examine the ex-ante benefits of transgenic research on drought in eight low-income countries, including the benefits to producers and consumers from farm income stabilization and the potential magnitude of private sector profits from IPRs. The framework employs country-specific agroecological-drought risk zones and considers both yield increases and yield variance reductions when estimating producer and consumer benefits from research. Benefits from yield variance reductions are shown to be an important component of aggregate drought research benefits, representing 40 percent of total benefits across the eight countries. Further, estimated annual private sector benefits of $US 178 million suggest that significant incentives exist for private sector participation in transgenic drought tolerance research. \tThe third essay entitled â  Ex-Ante Evaluation of Alternative Strategies to Increase the Stability of Cropping Systems in Eastern and Central Africaâ   examines the ex-ante economic impact of transgenic drought resistance maize breeding and of conventional maize, millet and sorghum drought resistance breeding in Kenya, Uganda, and the Amhara region in Ethiopia. An expected utility framework is combined with a partial equilibrium model and a spatial drought risk zonation scheme to estimate benefits from mean yield increases and yield variance reductions at the market level as well as at the household level for maize, millet and sorghum producers in the administrative regions of each country. Results suggest that annual ex-ante benefits of $87 million, $6.8 million and $4.8 million can be generated from public sector conventional breeding research on maize, sorghum and millet, respectively.  Private sector transgenic drought tolerance research may also generate substantial benefits of $97 million for maize producers and consumers, particularly through the reduction of yield variance arising from drought, and an additional $21 million as profits from intellectual property rights protection.",
  "description_provenance": [
    "Author Email: gkostand@vt.edu",
    "Advisor Email: alwangj@vt.edu",
    "Advisor Email: gnorton@vt.edu",
    "Advisor Email: bosch@vt.edu",
    "Advisor Email: bfmills@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:25Z (GMT). No. of bitstreams: 2 Preface.pdf: 20354 bytes, checksum: 6aa2af69be66b65915d3fc9bc08deb9d (MD5) Dissertation.pdf: 571552 bytes, checksum: acba86f2f9e276d54f1bdc388b06bfee (MD5)   Previous issue date: 2008-06-06"
  ],
  "handle": "28090",
  "identifier_other": "etd-06202008-130445",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06202008-130445/",
  "identifier_uri": "http://hdl.handle.net/10919/28090",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Preface.pdf",
    "Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "drought resistance",
    "imperfect competition",
    "biopharming",
    "developing countries",
    "transgenic"
  ],
  "title": "Three Essays on Measuring the Ex-ante Economic Impacts of Agriculture Technology Innovations",
  "type": "Dissertation"
}