{
  "contributor_author": "Abdull Kareem, Omar",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Giles, Inez",
    "Morris, Linda E.",
    "Carlton, Patrick W.",
    "Fortune, Jimmie C."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:13:26Z",
  "date_adate": "2000-06-26",
  "date_available": "2014-03-14T20:13:26Z",
  "date_issued": "2000-05-10",
  "date_rdate": "2001-06-26",
  "date_sdate": "2000-06-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Collaboration between institutions in distance learning has been practiced for decades at first domestically and now expanding to an international level. Many higher education institutions are also trying to globalize their learning environments through the internationalization process, especially through the curriculum. A review of the extant literature, however, revealed that collaboration efforts are characterized more by infusion of content from one country to another. Collaboration between two different countries, however, is much more meaningful if both parties are equally involved in co-designing, sharing, and implementing such learning experiences. Such a two-way collaboration process is a missing gap in the literature, which the present study has addressed. This study examined the process of developing a two-way collaborative learning experience between one of the universities in the United States of America and a university in a developing Asian country. The global question that guided this research was: What is involved in the process of developing and designing on-line learning between two different countries; and What are the challenges faced during the process?  The research design was a qualitative case study of a process, based on Miles and Huberman's (1994) classification. A micro monitoring process, complemented by interviews with key individuals, was conducted to collect the data. Different sources of data (Yin, 1984) or triangulation (Krathwohl, 1997) was a strategy used to increase the validity of the study. Through the micro monitoring process, all documents such as e-mails, meeting notes, and personal notes were collected and analyzed. Categorization and coding procedures followed Coffey and Artkinson (1996): that is, coding as a \"mixture of data reduction and data complication.\" All the data (from interviews and the micro monitoring process) were reported, analyzed, and interpreted from two different but complementary voices: the voice of reporter and the voice of analyst. The voice of reporter revealed a chronology of events and description whereas the analyst interpreted the meaning of the reporter's descriptive portion. Analysis revealed three major phases that evolved in the process of collaboration: initiation, pre-development, and development. Each phase consisted of several specific activities. The major challenges faced during the process evolved around technical matters.  Cultural differences, technical expertise, institutional procedures, financial, and time differences were also a challenge to the process.  This study besides confirming some practices also broadened and deepened the concept of collaboration and internationalizing the curriculum. Moreover, this study was able to recommend the follow up development of a process framework for developing and co-designing a collaborative on-line learning experience that involves two different countries.",
  "description_provenance": [
    "Author Email: okareem@vt.edu",
    "Advisor Email: igiles@polaris.umuc.edu",
    "Advisor Email: lmorris@kpmg.com",
    "Advisor Email: Carltonp@vt.edu",
    "Advisor Email: Fortunej@vt.edu",
    "Advisor Email: marcie@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:26Z (GMT). No. of bitstreams: 6 refs.pdf: 20023 bytes, checksum: b9ef1422d037148ddadbf8050fb6fbac (MD5) chap45.pdf: 140097 bytes, checksum: f69ce68abb2f5438a7799843cea3741b (MD5) abstract.pdf: 12630 bytes, checksum: a1ca793aad715397d39f28a47906dc6a (MD5) appendix.pdf: 29494 bytes, checksum: 380c7b4ad45ba083e1bfdfa9589427e2 (MD5) chap123.pdf: 78751 bytes, checksum: 3494e6af8c1060bb0f988b7d456b4960 (MD5) coverpage.pdf: 3708 bytes, checksum: 642d719c66cc5a46e1d09308d4e931a5 (MD5)   Previous issue date: 2000-05-10"
  ],
  "handle": "28096",
  "identifier_other": "etd-06222000-15510008",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06222000-15510008/",
  "identifier_uri": "http://hdl.handle.net/10919/28096",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "refs.pdf",
    "chap45.pdf",
    "abstract.pdf",
    "appendix.pdf",
    "chap123.pdf",
    "coverpage.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "collaboration",
    "cross-cultural learning",
    "internationalization",
    "internationalizing the curriculum",
    "higher education",
    "on-line learning"
  ],
  "title": "Collaboration in Developing On-Line Learning Between Two Different Countries: a Case Study",
  "type": "Dissertation"
}