{
  "contributor_author": "Bishop, David Christopher",
  "contributor_committeechair": "Haas, Carola A.",
  "contributor_committeemember": [
    "Walters, Jeffery R.",
    "Fraser, James D.",
    "Parkhurst, James A.",
    "Aust, Wallace Michael"
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:13:27Z",
  "date_adate": "2005-07-07",
  "date_available": "2014-03-14T20:13:27Z",
  "date_issued": "2005-06-09",
  "date_rdate": "2005-07-07",
  "date_sdate": "2005-06-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "I studied the ecology and distribution of the Florida bog frog (Rana okaloosae) and flatwoods salamander (Ambystoma cingulatum) on Eglin Air Force Base in northwest Florida.  I report data on the breeding ecology, population dynamics, home ranges, microhabitat, and distribution of the endemic bog frog and make comparisons to its closest relative, the bronze frog (Rana clamitans clamitans).  Bog and bronze frogs occur in the same habitats and are suspected to hybridize.    I investigated the potential for auditory and visual mate recognition errors between R. okaloosae and R. clamitans.  I also described the vocal repertoire of the bog frog and observed the response of resident males to the playback of unfamiliar conspecific and heterospecific (R. clamitans) calls.  The advertisement calls of bog frogs vary among individuals, and individual voice recognition is possible.    I exposed tadpoles of bog frogs, bronze frogs, and leopard frogs (R. sphenocephala) to chemical cues from 2 predators, the banded water snake (Colubridae: Nerodia fasciata) and the red fin pickerel (Esocidae: Esox americanus) to evaluate whether swimming behavior or habitat selection differed among tadpole species.  The time spent swimming differed among tadpole species and predator treatments, differences which potentially could affect growth rates, survivorship rates, and distribution patterns.    Lastly, I discuss the relationship between fire and the federallyâ  threatened flatwoods salamander (Ambystoma cingulatum).  I compared 13 breeding wetlands with different fire histories in addition to burned and unburned halves of a partiallyâ  burned wetland.  In general, areas that burned more recently had more open canopies, higher dissolved oxygen concentrations, higher water temperatures, more understory vegetation, and were shallower than unburned areas.  Rangewide surveys indicate that prescribed fires typically are applied in winter and early spring in areas inhabited by flatwoods salamanders.  Based on what is known about the natural history of the species, the historical burning regime of the longleaf ecosystem, and the effects of fires on ephemeral wetlands, I suggest that land mangers diversify their fireâ  management strategy to increase the likelihood of burning the breeding wetlands of flatwoods salamanders.",
  "description_provenance": [
    "Author Email: dabishop@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: cahaas@vt.edu",
    "Advisor Email: fraser@vt.edu",
    "Advisor Email: jparkhur@vt.edu",
    "Advisor Email: waust@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:27Z (GMT). No. of bitstreams: 1 Bishop_David.pdf: 2224733 bytes, checksum: 693f5946037daf31c6ade7f1fea94b7d (MD5)   Previous issue date: 2005-06-09"
  ],
  "handle": "28103",
  "identifier_other": "etd-06232005-123418",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06232005-123418/",
  "identifier_uri": "http://hdl.handle.net/10919/28103",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bishop_David.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "tadpole",
    "fire",
    "behavior",
    "call",
    "conservation",
    "amphibian"
  ],
  "title": "Ecology and distribution of the Florida bog frog and flatwoods salamander on Eglin Air Force Base",
  "type": "Dissertation"
}