{
  "contributor_author": "Zheng, Zhiyuan",
  "contributor_committeechair": "Ashley, Richard A.",
  "contributor_committeecochair": "Parmeter, Christopher F.",
  "contributor_committeemember": [
    "Ge, Suqin",
    "Du, Pang",
    "Haller, Hans H."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:13:28Z",
  "date_adate": "2011-07-28",
  "date_available": "2014-03-14T20:13:28Z",
  "date_issued": "2011-05-02",
  "date_rdate": "2011-07-28",
  "date_sdate": "2011-06-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation consists of three essays on econometric analysis including both parametric and nonparametric econometrics. The first chapter outlines three topics involved and briefly discusses the motivations and methods, as well as some conclusions in each of the following chapters.  Both chapter 2 and chapter 3 are in the field of kernel smoothed nonparametric econometrics. Chapter 2 conducts large volumes of simulations to explore the properties of various methods proposed in the literature to detect irrelevant variables in a fully nonparametric regression framework. We focus our attention to two broadly sets of methods, the least square cross-validated bandwidth selection procedure and the conventional nonparametric significance testing frameworks.  In chapter 3, a bootstrap test statistic is proposed to test the validity of imposing some arbitrary restrictions on higher order derivatives of a regression function. We use data sharpening method to enforce the desired constraints on the shape of the conditional means and then measure the distance between the unrestricted and restricted models. The empirical distribution of the test statistic is generated by bootstrapping and the asymptotic distribution for the bootstrap test statistic is also provided.  The last chapter examines the relationship between population health and income inequality in China. We use a multilevel dynamic panel model to test the absolute income hypothesis, various versions of relative income hypothesis, and health selection hypothesis empirically",
  "description_provenance": [
    "Author Email: zheng06@vt.edu",
    "Advisor Email: ges@vt.edu",
    "Advisor Email: pangdu@vt.edu",
    "Advisor Email: ashleyr@vt.edu",
    "Advisor Email: cparmeter@bus.miami.edu",
    "Advisor Email: haller@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:28Z (GMT). No. of bitstreams: 1 ZHENG_Z_D_2011.pdf: 827084 bytes, checksum: 030c133a0a5d99e153e4b55c54d7ef4f (MD5)   Previous issue date: 2011-05-02"
  ],
  "handle": "28106",
  "identifier_other": "etd-06232011-134809",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06232011-134809/",
  "identifier_uri": "http://hdl.handle.net/10919/28106",
  "publisher": "Virginia Tech",
  "relation_haspart": "ZHENG_Z_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Income Inequality",
    "Data Sharpening",
    "Bootstrap Significant Testing",
    "LSCV Bandwidths",
    "Health Dynamics"
  ],
  "title": "Three Essays on Econometric Analysis",
  "type": "Dissertation"
}