{
  "contributor_author": "Uribe-Florez, Lida  Johana",
  "contributor_committeechair": "Wilkins, Jesse L. M.",
  "contributor_committeemember": [
    "Jones, Brett D.",
    "Lloyd, Gwendolyn M.",
    "Bannister, Vanessa R. Pitts"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:13:27Z",
  "date_adate": "2009-07-07",
  "date_available": "2014-03-14T20:13:27Z",
  "date_issued": "2009-06-10",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-06-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "It has been suggested that teachersâ   instructional practices mediate the relationship between teacher background variables and student learning (Fennema & Franke, 1992; Mewborn & Cross, 2007). That is, an indirect relationship between these variables exists in which teacher variables are related to teacher instructional practices; and teacher instructional practice is then related to student learning. One instructional practice that has been supported as a way to help build studentsâ   mathematical understanding is the use of manipulatives (e.g., Hiebert et al., 1997). In this dissertation I investigate the role of manipualtive use as a mediator of the relationship between teacher variables and studentsâ   mathematics learning.  <p> To examine the potential mediating role of manipulative use, I conducted two separate quantitative studies. In the first study, I examined the relationship between teacher variables and the frequency with which teachers use manipulatives in their classroom activities. Using data from 503 in-service elementary teachers, I investigated the relationship between manipulative use and teachersâ   beliefs about manipulatives, the grade level they teach, their age and experience, as well as the interrelationship among these teacher variables. Teachersâ   beliefs and grade level were found to be important predictors of manipulative use. In the second study, I examined the relationship between manipulative use and mathematics learning of elementary- aged students (K-5). Data for this study were drawn from the Early Childhood Longitudinal Study (ECLS), and analyzed using a two-level hierarchical linear model and graphical techniques. I also investigated the moderating effects of student home language on this relationship. A positive relationship between the frequency of manipulative use and student mathematics learning was found. Home language was not found to moderate this relationship.  <p> Results from this manuscript dissertation seem to support the claim of Fennema and Franke (1992) and Mewborn and Cross (2007) about the mediating role of teacher instructional practice on the relationship between teacher variables and student learning. In particular, combining the results from the two studies, teachers holding positive beliefs about manipulatives tend to use these devices more often in their classroom activities, and teachers in lower grades tend to use manipulatives more often than teachers in the upper grades; and when students use manipulatives more often in their mathematics lessons, their mathematical learning tends to increase. Thus, together these findings suggest a tenable indirect relationship between teacher variables and student learning. That is, teacher variables are related to manipulative use which in turn is related to studentsâ   mathematics learning. Together these two studies provide a more complete picture of teacher factors and student outcomes as they relate to manipulative use in elementary mathematics classrooms. Implications and future directions for research on manipulative use in the teaching and learning of mathematics are discussed.",
  "description_provenance": [
    "Author Email: uribe@vt.edu",
    "Advisor Email: brettjones@vt.edu",
    "Advisor Email: wilkins@vt.edu",
    "Advisor Email: lloyd@vt.edu",
    "Advisor Email: vrpitts@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:27Z (GMT). No. of bitstreams: 1 URIBE-FLOREZ_ETD.pdf: 1321853 bytes, checksum: f179ae53ed1abfa98410ccb5d0055963 (MD5)   Previous issue date: 2009-06-10"
  ],
  "handle": "28101",
  "identifier_other": "etd-06222009-153508",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06222009-153508/",
  "identifier_uri": "http://hdl.handle.net/10919/28101",
  "publisher": "Virginia Tech",
  "relation_haspart": "URIBE-FLOREZ_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Teachers Variables",
    "Mathematics Education",
    "Student Learning",
    "Manipulatives"
  ],
  "title": "Teacher Variables and Student Mathematics Learning Related to Manipulative Use",
  "type": "Dissertation"
}