{
  "contributor_author": "Robbins, Jean C.",
  "contributor_committeechair": [
    "Webb, Ryland E.",
    "Mullis, Rebecca M."
  ],
  "contributor_committeemember": [
    "Axelson, Julian M.",
    "Edwards, Patricia K.",
    "Johnson, James E.",
    "Slayton, Aubrey R."
  ],
  "contributor_department": "Human Nutrition and Foods",
  "date_accessioned": "2014-03-14T20:13:28Z",
  "date_adate": "2010-06-23",
  "date_available": "2014-03-14T20:13:28Z",
  "date_issued": "1981-07-04",
  "date_rdate": "2011-10-07",
  "date_sdate": "2010-06-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to design a model to evaluate the influence of selected factors on the performance of a telephone delivery system for nutrition information and use the model to evaluate  the performance of the Roanoke Dietetic Association Dial-A-Dietitian program. The Dial-A-Dietitian program was established to provide nutrition information to the public by Registered Dietitians.    The model entailed a systems approach to evaluate the Roanoke Dietetic Association Dial-A-Dietitian program. The five phases of the model included Enabling Factors (inputs), the Interaction Process,  Effort Factors (outputs), Performance (outcome), and Feedback. Feedback entailed the utilization of the results of the evaluation in the decision-making process for future Dial-A-Dietitian programs and their operation.    The evaluation instruments, the Encounter Form and the Telephone Survey of clients, included reaction statements and attitude assessment of clients and dietitians. The data were analyzed with frequency distributions. Also the Chi Square Tests of Independence were computed to determine the relationship between the independent variables, Enabling Factors (Phase 1) and Effort Factors (Phase 3), and the dependent variable, Performance (Phase 4).     The model was useful in the evaluation of the Dial-A-Dietitian program. The data analysis indicated that the Dial-A-Dietitian program was effective as measured by this model.",
  "description_provenance": [
    "Author Email: jrobbinsj@gmail.com",
    "Made available in DSpace on 2014-03-14T20:13:28Z (GMT). No. of bitstreams: 1  LD5655.V856_1981.R624.pdf: 4876338 bytes, checksum: ec3126323663108d7adacdf4b22e8de4 (MD5)    Previous issue date: 1981-07-04"
  ],
  "format_medium": "BTD",
  "handle": "28105",
  "identifier_other": "etd-06232010-020032",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06232010-020032/",
  "identifier_uri": "http://hdl.handle.net/10919/28105",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1981.R624.pdf",
  "subject": "Telephone in education",
  "subject_lcc": "LD5655.V856 1981.R624",
  "title": "The development of a model to be utilized in the evaluation of the telephone as a vehicle for nutrition information",
  "type": "Dissertation"
}