{
  "contributor_author": "Angle, Susan Pugh",
  "contributor_committeechair": "Curcio, Claire Cole Vaught",
  "contributor_committeemember": [
    "Hutchins, David E.",
    "Keppel-Benson, Jane M.",
    "Hohenshil, Thomas H.",
    "Singh, Kusum",
    "Spencer, Edward F. D."
  ],
  "contributor_department": "Counseling Services",
  "date_accessioned": "2014-03-14T20:13:28Z",
  "date_adate": "1999-07-14",
  "date_available": "2014-03-14T20:13:28Z",
  "date_issued": "1999-06-08",
  "date_rdate": "2000-07-14",
  "date_sdate": "1999-06-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT \tThe number of reported students with psychiatric disabilities who are seeking services and/or accommodations is steadily increasing on college campuses.  Much of the research and documentation that surround the study of college students with psychiatric disorders is extremely broad in focus and tends to group all psychiatric diagnoses together when reporting outcome studies. \tThe research literature that is devoted to the study of the college student diagnoses with Panic Disorder with Agoraphobia is limited in scope and nature.  The majority of the literature is devoted to the physiological and behavioral ramifications of the disorder or treatment modalities.  a review of the extant literature reveals that there is no substantive research available that provides insight into the college experiences of the student diagnoses with Panic Disorder with Agoraphobia. \tIn summary, it is safe to say that there is not enough pertinent information readily available to enlighten college and university faculty and staff about the experiences of college students diagnosed with Panic Disorder with Agoraphobia.  specifically, little is known about:  (1) the academic, psychosocial, and environmental needs of these students  (2) what disability related barriers these student may have experienced  (3) what coping mechanisms are typically employed, and  (4) what services and accommodations these students have found to be the most effective while they were enrolled in college. \tThe purpose of this study was to examine the nature and the scope of the college experiences of students who were diagnosed with Panic Disorder with Agoraphobia.  The subjects for this study consisted of a select group of upperclassmen at Virginia Tech.  Gender or age was not a factor in the selection process.  For purposes of this study, the qualitative in-depth interview method was considered the most appropriate form of data collection. \tAnalysis of the data revealed the following common experiences among the subjects in the study:  (1) All subjects experienced difficulties in the classroom due to their Panic Disorder.  (2) All of the subjects had concerns with the physical setting of the campus (i.e. preferential seating, avoidance of large classrooms and auditoriums, and anxiety-like symptoms as the result of bright or fluorescent lighting).  (3) A lack of social contacts both in and out of the classroom was a common experience.  (4) While all subjects had tried medication to control their Panic Disorder, two of the subjects stopped their medication even though they reported an improvement I their symptoms.  The majority of the subjects stated that they did not want to remain on the medication for fear of addiction or using the medication as a \"crutch.\"  (5) All of the subjects sought out counseling while attending Virginia Tech.  All of the subjects, with the exception of one, did not seek any treatment for their anxiety of Panic Attacks until after they arrived at Virginia Tech.  (6) All of the subjects, with the exception of one suffered with either chronic anxiety, or Panic Attacks for over one year before seeking any medical relief or counseling.  (7) All of the subjects reported that counseling was helpful and for the most part, they all tried to use relaxation techniques when experiencing a Panic Attack.  (8) All of the subjects are still having difficulty with chronic anticipatory anxiety and occasional Panic Attacks.  (9) While the majority of the subjects interviewed were optimistic about their career options, it was evident that all of the subjects have encountered significant anxiety-related barriers that have impacted their choice of major and possible future jobs.  the majority of the subjects reported that it was important to have a job where the workload was not too stressful and the workplace was viewed as a \"safe\" environment.",
  "description_provenance": [
    "Author Email: spangle@vt.edu",
    "Advisor Email: dhutch@vt.edu",
    "Advisor Email: jabenson@vt.edu",
    "Advisor Email: vaughtc@vt.edu",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: spencere@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:28Z (GMT). No. of bitstreams: 1 phdsp.pdf: 519479 bytes, checksum: 8ab7dab81a5b1482ee0c432d14d626c1 (MD5)   Previous issue date: 1999-06-08"
  ],
  "handle": "28107",
  "identifier_other": "etd-062399-172730",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-062399-172730/",
  "identifier_uri": "http://hdl.handle.net/10919/28107",
  "publisher": "Virginia Tech",
  "relation_haspart": "phdsp.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Agoraphobia",
    "Panic Disorder"
  ],
  "title": "Perceptions of College Students Diagnosed with Panic Disorder with Agoraphobia:  Academic, Psychosocial, and Environmental Views of their College Experience",
  "type": "Dissertation"
}