{
  "contributor_author": "Penn-Marshall, Michelle",
  "contributor_committeechair": "Barbeau, William E.",
  "contributor_committeemember": [
    "Alexander, M. David",
    "Holtzman, Golde I.",
    "Conforti, Frank D.",
    "Schlenker, Eleanor D.",
    "Winett, Richard A."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:13:27Z",
  "date_adate": "2006-08-01",
  "date_available": "2014-03-14T20:13:27Z",
  "date_issued": "2006-05-05",
  "date_rdate": "2010-10-15",
  "date_sdate": "2006-06-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Background: African-Americans are a vulnerable population group with disproportionately elevated rates of type 2 Diabetes Mellitus (DM).  Resistant starch is a promising food ingredient that has the potential to reduce the risk factors involved in the development of type 2 DM. To date, there is a dearth of published research studies on the effect of resistant starch on African-Americans who are at increased risk for type 2 DM. <p> Objective: The major objective of this study was to determine if daily consumption of approximately twelve grams of high-maize&#8482; 260 resistant starch (RS) added to bread improved glucose homeostasis by monitoring changes in fasting plasma glucose, fructosamine, hemoglobin A1c, insulin, glucagon-like peptide-1, C-reactive protein, homeostasis model assessment insulin resistant (HOMA- IR) and beta-cell function (HOMA-Beta), serum acetate, propionate, and butyrate levels.   <p> Design: A fourteen-week, randomized, double-blind, within-subject crossover design feeding study was carried out in African-American males (n=8) and females (n=7) at increased risk for type 2 DM who resided in Southwest Virginia.  All participants consumed bread containing added RS or control bread (no added RS) for six-weeks.  RS and control bread feedings were separated by a two-week washout period. <p> Results: Fasting Plasma Glucose (FPG) levels were significantly lower (P = 0.0179) after six-week control bread feedings compared to baseline.  FPG levels were also significantly lower (P < 0.0001) after two-week washout period than at baseline.  FPG levels were significantly higher (P < 0.0001) after six-week resistant starch bread feeding than at washout.  FPG levels due to consumption of resistant starch versus control bread approached significance (P = 0.0574).  Fructosamine levels were significantly lower  (P = 0.0054) after control bread and resistant starch bread (P < 0.0012) consumption compared to baseline.  No significant differences were found in fructosamine levels due to resistant bread intake versus control (P = 0.9692).  Mean baseline HbA1c levels were 6.9% (n=15).  This value was slightly lowered to 6.79% (n=14) at the end of the fourteen-week study, although statistical significance was not found.  Mean &#177; standard errors for HbA1c values were 6.9% &#177; 0.18% and 6.9% &#177; 0.14% at baseline for the sequence groups, resistant starch first (n=7) and control treatment first (n=8) groups, respectively.  Mean &#177; standard error HbA1c values were 6.7% &#177; 0.27% and  6.9% &#177; 0.27% at the conclusion of fourteen-week study for sequence groups, resistant starch first group (n=7) and control treatment first group, respectively.  Baseline mean and standard errors  C-reactive Protein (CRP) levels for male and female combined results were 0.62 &#177; 0.16 mg/dL (n=15).  Mean CRP levels were 0.53 &#177; 0.12 mg/dL for resistant starch bread and 0.64 &#177; 0.21 mg/dL for control bread feeding periods. No significant differences were found for treatment, gender, or sequence effects for C-reactive protein levels during the fourteen-week study (P > 0.05).   Mean HOMA-IR levels following six-week resistant starch and control bread consumption decreased to normal values (> 2.5), although no significant differences were found for treatment (P = 0.5923). <p> Conclusions: Eighty-seven grams of Hi- maize&#8482; 260 Resistant Starch added to baked loaves of bread consumed by a free-living African-American population at increased risk for type 2 diabetes did not consistently show significance in all clinical indicators and biochemical markers assessed.  On the basis of the evidence in this study we do not have evidence that this amount of resistant starch in this population's diet will prevent the onset of diabetes.  However, results are suggestive that higher levels of resistant starch in a more controlled experiment could reduce clinical risk factors for type 2 diabetes.   <p> KEY WORDS     Resistant starch, African-Americans, Type 2 Diabetes, Short Chain Fatty Acids, Fasting Plasma Glucose, Fructosamine, Hemoglobin A1c, C-reactive Protein, Glucagon-Like Peptide-1, Insulin, HOMA-IR, HOMA Beta-Cell",
  "description_provenance": [
    "Author Email: mpennmar@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: barbeau@vt.edu",
    "Advisor Email: holtzman@vt.edu",
    "Advisor Email: fconfort@vt.edu",
    "Advisor Email: schlenkr@vt.edu",
    "Advisor Email: rswinett@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:27Z (GMT). No. of bitstreams: 5 AppendicesETDCORJuly282006.pdf: 649342 bytes, checksum: 1c47997879132cc38ae1c5b2095b1fd4 (MD5) MPMCV.pdf: 202289 bytes, checksum: 1dc5e7d3e8f03506ac1de07b29de90a6 (MD5) ETDBODYCORJULY282006.pdf: 1231689 bytes, checksum: 04d570663665a0ec01f2d4903e67088d (MD5) ETDCOVERSHEETCORJuly282006.pdf: 11885 bytes, checksum: 1b15bd8b5ae57f32f408a86dac901784 (MD5) ETDFrontMatterCORJuly282006.pdf: 105803 bytes, checksum: f29446be09724e670c7527148f9405ec (MD5)   Previous issue date: 2006-05-05"
  ],
  "handle": "28104",
  "identifier_other": "etd-06232006-165249",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06232006-165249/",
  "identifier_uri": "http://hdl.handle.net/10919/28104",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "AppendicesETDCORJuly282006.pdf",
    "MPMCV.pdf",
    "ETDBODYCORJULY282006.pdf",
    "ETDCOVERSHEETCORJuly282006.pdf",
    "ETDFrontMatterCORJuly282006.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Short Chain Fatty Acids",
    "African-Americans",
    "HOMA Beta-Cell Function",
    "HOMA-IR",
    "Fasting Plasma Glucose",
    "Type 2 Diabetes",
    "Resistant Starch",
    "Fructosamine",
    "Insulin",
    "C-reactive Protein",
    "Glucagon-Like Peptide-1",
    "Hemoglobin A1c"
  ],
  "title": "The Effects of Resistant Starch Intake in African-American Americans at Increased Risk for Type 2 Diabetes",
  "type": "Dissertation"
}