{
  "contributor_author": "Wu, Genfa",
  "contributor_committeechair": "Ficenec, John R.",
  "contributor_committeecochair": "Phillips, H. Lawrence",
  "contributor_committeemember": [
    "Jenkins, David A.",
    "Heflin, James R.",
    "Sundelin, Ronald M."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:13:28Z",
  "date_adate": "2002-07-23",
  "date_available": "2014-03-14T20:13:28Z",
  "date_issued": "2002-06-14",
  "date_rdate": "2003-07-23",
  "date_sdate": "2002-06-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Niobium thin films are expected to be free of solid inclusions commonly seen in solid niobium. For particle accelerators, niobium thin film has the potential to replace the solid niobium in the making of the accelerating structures. In order to understand and improve the superconducting performance of niobium thin films at cryogenic temperature, an energetic vacuum deposition system has been developed to study deposition energy effects on the properties of niobium thin films on various substrates. The system directly uses microwave power to create a pure niobium plasma, which can be used to extract niobium ion flux with controllable kinetic energy for direct deposition. The ultra high vacuum avoids the gaseous inclusions in thin films. A retarding field energy analyzer is developed and used to measure the kinetic energy of niobium at the substrate location. A systematic process for thin film characterization is developed and used to analyze the niobium thin films made by this energetic condensation. The properties of niobium thin films at several deposition energies are obtained, and the results show that there exists a preferred deposition energy around 115eV.",
  "description_provenance": [
    "Author Email: jeffwu2002@yahoo.com",
    "Advisor Email: jenkins@vt.edu",
    "Advisor Email: phillips@jlab.org",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: jficenec@vt.edu",
    "Advisor Email: sundelin@cox.net",
    "Made available in DSpace on 2014-03-14T20:13:28Z (GMT). No. of bitstreams: 1 etd.pdf: 3064136 bytes, checksum: 829f9592347b2362cbaa9fd3c26913fc (MD5)   Previous issue date: 2002-06-14"
  ],
  "handle": "28110",
  "identifier_other": "etd-06242002-133736",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06242002-133736/",
  "identifier_uri": "http://hdl.handle.net/10919/28110",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ECR plasma",
    "Energetic Condensation",
    "Thin Film Deposition",
    "Particle Accelerator",
    "RF superconductivity",
    "Niobium"
  ],
  "title": "Energetic Deposition of Niobium Thin Film in Vacuum",
  "type": "Dissertation"
}