{
  "contributor_author": "Galusky, Wyatt",
  "contributor_committeechair": "Luke, Timothy W.",
  "contributor_committeemember": [
    "Fuhrman, Ellsworth R.",
    "Halfon, Saul E.",
    "Pitt, Joseph C.",
    "Barrow, Mark V. Jr."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:13:29Z",
  "date_adate": "2004-07-07",
  "date_available": "2014-03-14T20:13:29Z",
  "date_issued": "2004-06-10",
  "date_rdate": "2007-07-07",
  "date_sdate": "2004-06-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this dissertation, I analyze online environmental anti-toxics activism.   Environmental activist groups have created a presence on the World Wide Web to help empower people to become aware of and struggle against pollution.  The sites that I explore (http://www.epa.gov/tri/, http://www.epa.gov/enviro/wme/, http://www.rtknet.org/, and http://www.scorecard.org/) serve as devices of this empowerment and by extension recruit people to the political goals of anti-toxics activism.    In my analysis, I focus on a series of questions germane to this context.  How can/does this movement go online and utilize that presence to sway others to their cause and ideology?  How then is that cause represented digitally, in the online medium?  What are the reciprocal impacts of that representation on the movement itself?  Most importantly, what form of activist identity is being promoted through the mediation of the online interface?  That is, how are the identity of the self as activist and the related understanding of space and place altered through their translation into a digital environment?  What are the parameters and limitations of digitally mediated, informed empowerment?    I undertake to critique empowerment as found through the digital translation of environmental anti-toxics activism into the virtual space of the Web.  I show that particular uses of this Internet application invent (reinvent/reinforce) versions of environmental anti-toxics activism, digitized versions which must be understood in terms of their wider assumptions and implications. I break the study into three main parts.  The first part lays theoretical groundwork for studying Web-based entities.  The second part deals with more particular foundational elements for digital environmental anti-toxics activism, especially in terms of information.  In the final section, I analyze and critique the forms of digital identity and empowerment that the websites create.  I conclude that digital empowerment, defined primarily through access to expert information, actually represents an impoverished version of empowerment which may do little to aid real-world toxic struggles.",
  "description_degree": "PhD",
  "description_provenance": [
    "Author Email: wgalusky@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Advisor Email: shalfon@vt.edu",
    "Advisor Email: jcpitt@vt.edu",
    "Advisor Email: barrow@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:29Z (GMT). No. of bitstreams: 1  VU_final.pdf: 2225879 bytes, checksum: 4f54f320c72b3eda18e8bdf6ccc7275a (MD5)    Previous issue date: 2004-06-10"
  ],
  "handle": "28117",
  "identifier_other": "etd-06252004-091513",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06252004-091513/",
  "identifier_uri": "http://hdl.handle.net/10919/28117",
  "publisher": "Virginia Tech",
  "relation_haspart": "VU_final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "digital identity",
    "expertise",
    "empowerment",
    "online activism",
    "anti-toxics activism",
    "cyberstudies",
    "Internet",
    "environmentalism",
    "technology",
    "right-to-know",
    "identity",
    "World Wide Web"
  ],
  "title": "Virtually Uninhabitable: A Critical Analysis of Digital Environmental Anti-Toxics Activism",
  "type": "Dissertation"
}