{
  "contributor_author": "Guzman-Aranda, Juan Carlos",
  "contributor_committeecochair": [
    "Parkhurst, James A.",
    "McMullin, Steve L."
  ],
  "contributor_committeemember": [
    "Lafon-Terrazas, Alberto",
    "Browder, John O.",
    "Fraser, James D."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:13:29Z",
  "date_adate": "2004-07-06",
  "date_available": "2014-03-14T20:13:29Z",
  "date_issued": "2004-06-03",
  "date_rdate": "2007-07-06",
  "date_sdate": "2004-06-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>A conservation planning protocol based on components from successful conservation projects in Mexico and other countries was developed to evaluate conservation planning practices and to serve as a template to guide future conservation planning efforts in Mexico.  My research specifically explored stakeholder analysis and performance measurement as currently applied to conservation planning.  Twenty-seven natural protected area (NPA) management plans and 6 plans from modified rural landscape projects (MDRL), all within Mexico, were evaluated.  Additionally, 38 planning team members from 8 selected case studies were interviewed.  I used the Laguna de Babicora Watershed planning process and management plan as the focus of my examination of stakeholder analysis.  Seventy-four individuals who represented 5 major stakeholder categories were identified and interviewed.   Examples of process-, outcome-, output-, and input-related performance measures (PMs) were developed for the Babicora project using information collected from my interviews, the existing management plan, and my conservation planning protocol. </p><p>The approaches used and products generated from NPA and MDRL plans differed substantially.  NPA plans often used pre-established planning guidelines dictated by the overseeing or authorizing agency.  Institutional rigidity was a limiting factor to development of NPA management plans.  NPA plan content suggested that planners focused more attention on inventory and strategic planning than on other planning components, yet recommended operational strategies in NPA management plans still were comprehensive.  MDRL planning processes were more sensitive to local conditions, but less comprehensive than NPA plans.  With MDRL plans, on-the-ground pilot projects often were initiated concurrent with inventory and strategic planning efforts.  As a result, MDRL planning teams often did not complete management plans due to demands imposed by these concurrent projects.  Performance measurement systems for both plan implementation and monitoring of planning processes largely were absent in all NPA and most MDRL projects.  Only one MDRL case study addressed process-related performance measures.   </p><p>NPA and MDRL plans both suffered from poor issue identification and problem definition, offering only generic strategic statements that lacked indicators of spatial scale, geographic location, and causative agents.  Management plans overall, but NPA in particular, also lacked clear links among identified problems, other key stages of the planning process, and desired or stated outcomes.  Unfamiliarity with or failure to use effective diagnostic tools, coupled with a need to comply with existing planning protocols, produced management recommendations that frequently were not justified or related to identified management problems, particularly among NPA plans.  MDRL case studies, which typically targeted smaller geographic areas, were not as comprehensive as NPA plans.  However, MDRL case studies more often incorporated stronger participatory components.  Demands from participatory processes often delayed final development of MDRL management plans.  Although NPAs and MDRLs currently follow different planning processes, ultimate success in conservation management may best be served by blending complementary components from each approach.   </p><p>Stakeholders who participate in conservation planning fundamentally are issue specific.  Current environmental literature on stakeholder methodologies endorses use of general categories.  Although cross-category stakeholder analysis is useful during inventory and strategic planning, within-stakeholder analysis is necessary for successful plan implementation.  My findings suggest that within-stakeholder analysis helps (1) identify problems or needs important to particular stakeholders, (2) identify stakeholders with contrasting behavior within categories, and (3) establish areas for potential collaboration.  Stakeholder involvement, tailored to local conditions, should occur in all planning stages.  Successful conservation planning in Mexico currently should be addressed more as a question of human organization. </p><p>\tSuggested performance measures to help monitor and evaluate both the planning process and plan implementation were developed.  Process-related PMs focused on the 4 major planning stages.  Process-related PMs allow planners to analyze and reassess the direction of the planning process; they are not prescriptive, rather statements that recognize planning as a social exercise likely to face areas where trade-offs are likely to occur (e.g., problem identification, sharing decision-making, public involvement).  Performance measures for plan implementation should be hierarchical, nested, and include input-, output-, and outcome-related assessment attributes.</p>",
  "description_provenance": [
    "Author Email: jguzmana2001@yahoo.com",
    "Advisor Email: alafon@uach.mx",
    "Advisor Email: browder@vt.edu",
    "Advisor Email: fraser@vt.edu",
    "Advisor Email: jparkhur@vt.edu",
    "Advisor Email: smcmulli@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:29Z (GMT). No. of bitstreams: 1 GuzmanArandaFinalJune2004.pdf: 1566148 bytes, checksum: 3ae6bfa324f6d0a5c6a0853ad8abc0b0 (MD5)   Previous issue date: 2004-06-03"
  ],
  "handle": "28119",
  "identifier_other": "etd-06252004-163538",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06252004-163538/",
  "identifier_uri": "http://hdl.handle.net/10919/28119",
  "publisher": "Virginia Tech",
  "relation_haspart": "GuzmanArandaFinalJune2004.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Conservation Planning",
    "Stakeholder Analysis",
    "Modified Rural Landscapes",
    "Natural Protected Areas",
    "Performance Measures",
    "Mexico"
  ],
  "title": "Evaluation of Conservation Planning in Mexico:  A Stakeholder Analysis Approach",
  "type": "Dissertation"
}