{
  "contributor_author": "White, Dave D.",
  "contributor_committeechair": "Hall, Troy E.",
  "contributor_committeecochair": "Hull, Robert Bruce IV",
  "contributor_committeemember": [
    "Buhyoff, Gregory J.",
    "Berkson, James M.",
    "Barrow, Mark V. Jr."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:13:29Z",
  "date_adate": "2002-07-03",
  "date_available": "2014-03-14T20:13:29Z",
  "date_issued": "2002-05-30",
  "date_rdate": "2003-07-03",
  "date_sdate": "2002-06-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purposes of this study were to examine 1) understandings of science expressed in formal salmon recovery policy discourse; 2) rhetorical practices employed to justify or undermine claims about salmon policy 3); and patterns of understandings of science and associated rhetorical practices between social categories of actors. This research contributes to scholarship in public understanding of science, discourse studies, and natural resource policy.   A constructivist discourse analysis was conducted using qualitative methods to analyze transcripts from over one hundred congressional hearing witnesses representing a wide diversity of stakeholder groups. Multiple coders organized discourses into analytic categories, achieving a final proportional agreement of 80% or greater for each category, at the finest scale of analysis.   Stakeholders employed a collection of prototypical understandings of the nature of science, boundaries of science, and roles of science in decision-making. The process of science was described as impartial and ideal, a way to reduce uncertainty through consensus and peer-review, and subject to changing paradigms. Scientific knowledge was sometimes represented as \"truth\" and other times as tentative, and scientists were portrayed as independent and objective as well as captured and interest-driven. Witnesses described science as separate from and superior to politics and management. Testimony included descriptions of science?s role in developing decision alternatives, selecting among alternatives, and evaluating and legitimating alternatives.   Stakeholders used these understandings of science to construct justifications to support their claims about salmon policy and undermine opposing claims. Science-based justifications included externalizing devices, construction of consensus, category entitlement, and extreme case formulations. Other justifications invoked local control, treaty rights, and local knowledge, or relied on interest management.   This study has extended the theory and method of empirical discourse analysis, and produced a taxonomy of understandings that should be transferable to studies of similar policy settings. Additionally, conclusions from this study about differences between social groups in the presence, distribution, and frequency of expression of the discourses might be developed into propositions for further testing. Finally, the study has implications for communication about the role of science in collaborative natural resource decision-making processes.",
  "description_provenance": [
    "Author Email: dave.white@asu.edu",
    "Advisor Email: hullrb@vt.edu",
    "Advisor Email: buhyoff@vt.edu",
    "Advisor Email: jberkson@vt.edu",
    "Advisor Email: barrow@vt.edu",
    "Advisor Email: troyh@uidaho.edu",
    "Made available in DSpace on 2014-03-14T20:13:29Z (GMT). No. of bitstreams: 1 White.pdf: 533015 bytes, checksum: e8c3ba6aae8d6d504977aee4ea22b05c (MD5)   Previous issue date: 2002-05-30"
  ],
  "handle": "28116",
  "identifier_other": "etd-06252002-173958",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06252002-173958/",
  "identifier_uri": "http://hdl.handle.net/10919/28116",
  "publisher": "Virginia Tech",
  "relation_haspart": "White.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Salmon Recovery",
    "Discourse Analysis",
    "Natural Resource Policy",
    "Public Understanding of Science"
  ],
  "title": "A Discourse Analysis of Stakeholders? Understandings of Science in Salmon Recovery Policy",
  "type": "Dissertation"
}