{
  "contributor_author": "Crowson, Douglas A.",
  "contributor_committeechair": "Corcoran, Sean Gerald",
  "contributor_committeecochair": "Farkas, Diana",
  "contributor_committeemember": [
    "Reynolds, William T. Jr.",
    "Batra, Romesh C.",
    "Wang, Yu"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:13:28Z",
  "date_adate": "2006-10-12",
  "date_available": "2014-03-14T20:13:28Z",
  "date_issued": "2006-06-14",
  "date_rdate": "2007-10-12",
  "date_sdate": "2006-06-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A study of the stability of bicontinuous nanoporous metals is presented.  Atomic scale simulations are used to probe the dominant mechanisms of geometric relaxation in these materials.  A method is presented for generating model bicontinuous metal / void structures for use in atomistic simulations of bicontinuous nanoporous solids.  The structures are generated with periodic boundary conditions using a phase-field model to simulate the spinodal decomposition of an ideal system.  One phase in the model is then associated with the pore volume while the other phase is associated with the metal ligaments.  Small angle neutron scattering was used to quantitatively compare experimental samples to those generated by the phase field method.   <p>EAM results using model structures with experimentally accessible length scales are presented which demonstrate the potential of such simulations in understanding the behavior of nanoporous metals.  Simulated relaxations of these structures, as well as the relaxation of model spherical clusters, indicate that the surface relaxation effect dominates the overall dimensional relaxation of np-metals post processing.  Capillary effects play a secondary role in the overall relaxation.  The simulation results presented also identify a maximum surface area to volume ratio necessary to maintain mechanical stability beyond which the pore structure collapses.",
  "description_provenance": [
    "Author Email: dcrowson@vt.edu",
    "Advisor Email: sgc@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: diana@vt.edu",
    "Advisor Email: rbatra@vt.edu",
    "Advisor Email: yu.wang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:28Z (GMT). No. of bitstreams: 4 permission_elsevier.pdf: 88142 bytes, checksum: a00af22bc18b59118b113d7c673059cf (MD5) Crowson_3803.pdf: 97735 bytes, checksum: 19ed6ac9d9b6d7f89d9fd7d79609ca92 (MD5) Crowson_3803online.pdf: 91407 bytes, checksum: 5042969084cecae637139e906f1e5b73 (MD5) DA_Crowson_Stability_of_Nanoporous_Metals.pdf: 2099970 bytes, checksum: 58a17f3a5b012076bf92a5f3b10dba4e (MD5)   Previous issue date: 2006-06-14"
  ],
  "handle": "28111",
  "identifier_other": "etd-06242006-163956",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06242006-163956/",
  "identifier_uri": "http://hdl.handle.net/10919/28111",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "permission_elsevier.pdf",
    "Crowson_3803.pdf",
    "Crowson_3803online.pdf",
    "DA_Crowson_Stability_of_Nanoporous_Metals.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "surface relaxation",
    "EAM",
    "dealloying",
    "porous metals",
    "surface stress"
  ],
  "title": "Stability of Nanoporous Metals",
  "type": "Dissertation"
}