{
  "contributor_author": "Racine, David P",
  "contributor_committeechair": "White, Orion F. Jr.",
  "contributor_committeemember": [
    "Stephenson, Max O. Jr.",
    "Rohr, John A.",
    "Wolf, James F.",
    "Goodsell, Charles T."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:13:29Z",
  "date_adate": "2001-06-28",
  "date_available": "2014-03-14T20:13:29Z",
  "date_issued": "2001-06-15",
  "date_rdate": "2002-06-28",
  "date_sdate": "2001-06-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "What does informal problem solving in neighborhoods -- when people act collectively, but without much formal organizing -- look like? Does or can problem solving at this level contribute to the democratic capabilities of citizens? If so, how, and does public administration, as the part of government most involved in the daily life of citizens, have a role to play in building this informal capacity for self-government? The communitarian agenda in the United States assumes the importance of indigenous action, but on the basis of little evidence. To find out more about the existence and value of this mode of community problem solving, I conducted an ethnographic field study of problem solving in and around mostly black, inner city neighborhoods in Roanoke, Virginia in the mid 1990s. I found that while informal action appeared to have once been the main form taken by problem solving in the African American community, it had fallen on hard times. Three sets of factors seemed most to account for this decline: the aging of the population in these inner city neighborhoods, aided by the influence of both urban renewal and desegregation; the increasing professionalization of community problem solving through formal organizations; and a habitual use of civility in public affairs that reinforced professional dominance and reduced the motivation of inner city residents to act on their interests. I use these findings to set forth a novel conceptualization of both informal and formal community problem solving. This conceptual scheme draws on the psychological theory of self-determination and the pragmatic philosophy of John Dewey to show how the informal and formal play different roles in the formation of individual and group identities and how both are needed in human development. I conclude by suggesting that, although the informal domain has atrophied in places like Roanoke, it might have an opportunity to reassert itself if public administration, as the engine of formal problem solving in communities, were to focus more on its own performance. A more effective public sector, achieved by replicating proven programs and practices, would increase the legitimacy of public administrators, making their example influential in inspiring citizens to undertake complementary efforts in their neighborhoods.",
  "description_provenance": [
    "Author Email: enicar@aol.com",
    "Advisor Email: mstephen@vt.edu",
    "Advisor Email: jrohr@vt.edu",
    "Advisor Email: orionwhite@erols.com",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: goodsell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:29Z (GMT). No. of bitstreams: 1 dissertation.pdf: 4032875 bytes, checksum: be39f365bd88a6053daca3235973ea99 (MD5)   Previous issue date: 2001-06-15"
  ],
  "handle": "28115",
  "identifier_other": "etd-06252001-104434",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06252001-104434/",
  "identifier_uri": "http://hdl.handle.net/10919/28115",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Democracy",
    "Replication",
    "Professional",
    "Informal",
    "Public Administration",
    "Community",
    "Civil Soceity"
  ],
  "title": "People and Their Problems: An Exploratory Study of the Quest for Democratic Citizenship in the Administered Society",
  "type": "Dissertation"
}