{
  "contributor_author": "Williams, Carey Ann",
  "contributor_committeechair": "Kronfeld, David S.",
  "contributor_committeecochair": "Hoffman, Rhonda M.",
  "contributor_committeemember": [
    "Houston, Michael E.",
    "Splan, Rebecca K.",
    "Saker, Korinn E.",
    "Sklan, David S."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:13:31Z",
  "date_adate": "2003-07-29",
  "date_available": "2014-03-14T20:13:31Z",
  "date_issued": "2003-06-12",
  "date_rdate": "2004-07-29",
  "date_sdate": "2003-06-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In these studies antioxidant supplementation and oxidative stress measures were the basis for determining the health and welfare of the equine endurance athlete.  The first study determined that lipoic acid (LA) orally administered to horses is effective in diminishing the levels of lipid peroxidation in the plasma, and is non-toxic at a dose of 10-mg/kg body weight.  The second study showed muscle leakage measured by plasma creatine kinase (CK) and aspartate aminotransferase (AST) positively correlated to oxidative stress (measured by lipid hydroperoxides) during an endurance race (Research Ride 2001; R1).  Also higher plasma ascorbate (ASC) status was found in the vitamin E plus C supplemented group versus the group receiving vitamin E alone.  In the third study, the Research Ride 2002 (R2) determined that horses that did not finish the ride had higher CK and AST before, during and after (P < 0.05) the ride compared to horses that finished.  These results were compared to the finishers of the Old Dominion 2000 (OD) and R1 and found that oxidative stress and muscle enzymes were greater during R2 due to the difficulty of terrain and ambient temperature.  A higher level of horsesâ   fitness in OD also could have explained the diminished oxidative stress.  The fourth study calculated that horses at R2 were receiving 2265 Â± 114 IU/d of vitamin E in the total diet prior to the race.  These levels negatively correlated to plasma CK and AST and positively correlated to plasma a-tocopherol (TOC; r = 0.21; P = 0.005) throughout the 80-km race.  In the final study the LA supplemented group had similar increases in antioxidant status (TOC, ASC, and total glutathione) as the vitamin E supplemented group of horses exercising for 55 km on a treadmill to simulate an endurance race.  Both groups also had lower (P < 0.050) white blood cell apoptosis throughout exercise then the control group.  These studies prove the need for antioxidant supplementation, specifically vitamin E or LA, during heavy endurance exercise to improve the health and welfare of our equine athlete.",
  "description_provenance": [
    "Author Email: cawilli4@vt.edu",
    "Advisor Email: houstonm@vt.edu",
    "Advisor Email: splan@vt.edu",
    "Advisor Email: rhhoffma@vt.edu",
    "Advisor Email: kesaker@vt.edu",
    "Advisor Email: sklan@AGRI.HUJI.AC.IL",
    "Advisor Email: kronfeld@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:31Z (GMT). No. of bitstreams: 13 paper4.pdf: 41144 bytes, checksum: 7815350e9d1bcec48e2a67966b6f02d2 (MD5) paper1.pdf: 37297 bytes, checksum: 814880e7180270eb5424110b650bc16e (MD5) paper2.pdf: 66854 bytes, checksum: 080f23dd4ebd01e43ac19e9778a1f624 (MD5) discusssummary.pdf: 19779 bytes, checksum: a97f2b1a0568f6dbc123f63937ddc96c (MD5) paper3.pdf: 42409 bytes, checksum: e3e682b6caa7d053d5590b0d421259ec (MD5) vita.pdf: 5413 bytes, checksum: 5879e850ace695528853ffa4356726df (MD5) app1.pdf: 20624 bytes, checksum: 1371378598339d35706d614f399d2d04 (MD5) app4.pdf: 28990 bytes, checksum: 447d3c3e037b584046a9fb4f65666462 (MD5) app3.pdf: 17524 bytes, checksum: 146ed268c499c3f72f117c8522cee5fd (MD5) app2.pdf: 19062 bytes, checksum: a8a603c08f5f777af7257567d021febd (MD5) paper5.pdf: 75940 bytes, checksum: c622d3f289bd732520abbc865b09bb48 (MD5) tablecontents.pdf: 137810 bytes, checksum: 92f9b79a800e9ccdbae2cc89533a9986 (MD5) litreview.pdf: 264026 bytes, checksum: 9cf0924e2f33921baa7182f5d371b64c (MD5)   Previous issue date: 2003-06-12"
  ],
  "handle": "28125",
  "identifier_other": "etd-06262003-095741",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06262003-095741/",
  "identifier_uri": "http://hdl.handle.net/10919/28125",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "paper4.pdf",
    "paper1.pdf",
    "paper2.pdf",
    "discusssummary.pdf",
    "paper3.pdf",
    "vita.pdf",
    "app1.pdf",
    "app4.pdf",
    "app3.pdf",
    "app2.pdf",
    "paper5.pdf",
    "tablecontents.pdf",
    "litreview.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Vitamin E",
    "Oxidative stress",
    "Apoptosis",
    "Antioxidants",
    "Equine",
    "Lipoic acid"
  ],
  "title": "Oxidative Stress and Antioxidant Supplementation During Endurance Exercise in the Horse",
  "type": "Dissertation"
}