{
  "contributor_author": "Larroy, Edwin A.",
  "contributor_committeechair": "Nespor, Jan K.",
  "contributor_committeemember": [
    "Driscoll, Lisa G.",
    "Pendergrass, Barbara J.",
    "Abraham, Jane L.",
    "Dixon, Benjamin"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:13:31Z",
  "date_adate": "2005-07-07",
  "date_available": "2014-03-14T20:13:31Z",
  "date_issued": "2005-06-17",
  "date_rdate": "2005-07-07",
  "date_sdate": "2005-06-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The increasing presence of â  Latinosâ   in higher education presents a challenge to the academy, particularly in understanding their adjustment to the college environment (Umana-Taylor, Diversi & Fine, 2002). This study investigates how ethnically diverse â  Latino\\aâ   undergraduates construct and affirm ethnic identity. The findings suggest that a â  Latino\\aâ   pan-ethnicity is problematic because of the diversity of national origins, family histories, linguistic preferences, and cultural traditions that exists among the different nationalities that comprise this ethnic group. Unlike previous generations of immigrants, new diaspora â  Latinosâ   seek integration into American society as bilinguals with linguistic command for both Spanish and English and resist abandonment of national identities and culture. These are suggestive of transnational identities that are multiple and adaptive to a variety of contexts and situations; rather than being fixed and constant.",
  "description_provenance": [
    "Author Email: elarroy@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: janea@vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: bdixon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:31Z (GMT). No. of bitstreams: 3 BodyMatter.pdf: 642236 bytes, checksum: 2736a744ef00b4ebe47301071d3c3f65 (MD5) BackMatter.pdf: 175259 bytes, checksum: 0fd6f9e565840ba5e2c487e7c8ceb26c (MD5) FrontMatter.pdf: 40739 bytes, checksum: c252bd90634b1b6c67883871d392bee9 (MD5)   Previous issue date: 2005-06-17"
  ],
  "handle": "28126",
  "identifier_other": "etd-06262005-133154",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06262005-133154/",
  "identifier_uri": "http://hdl.handle.net/10919/28126",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "BodyMatter.pdf",
    "BackMatter.pdf",
    "FrontMatter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Latino\\a Diaspora",
    "Acculturation and Assimilation",
    "Ethnic Identity",
    "Latinos in Higher Education"
  ],
  "title": "Latino\\a Ethnic Identity in the New Diaspora: Perspectives of a Select Group of Latino\\a Undergraduates at a Predominantly White Land Grant University",
  "type": "Dissertation"
}