{
  "contributor_author": "Lu, Bing",
  "contributor_committeechair": "Lee, Fred C.",
  "contributor_committeemember": [
    "Van Wyk, Daan",
    "Lu, Guo-Quan",
    "Lindner, Douglas K.",
    "Wang, Fei Fred"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:13:31Z",
  "date_adate": "2006-08-28",
  "date_available": "2014-03-14T20:13:31Z",
  "date_issued": "2006-05-05",
  "date_rdate": "2006-08-28",
  "date_sdate": "2006-06-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "With the development of information technology, power management for telecom and computer applications become a large market for power supply industries. To meet the performance and reliability requirement, distributed power system (DPS) is widely adopted for telecom and computer systems, because of its modularity, maintainability and high reliability. Due to limited space and increasing power consumption, power supplies for telecom and server systems are required to deliver more power with smaller volume. As the key component of DPS system, front-end AC/DC converter is under the pressure of continuously increasing power density. For conventional industry practices, some limitations prevents front-end converter meeting the power density requirement. In this dissertation, different techniques have been investigated to improve power density of front-end AC/DC converters. For PFC stage, at low switching frequency, PFC inductor size is large and limits the power density. Although increasing switching frequency can dramatically reduce PFC inductor size, EMI filter size might be larger at higher switching frequency because of the change of noise spectrum. Since the relationship between EMI filter size and PFC switching frequency is unclear for industry, PFC circuits always operate with switching frequency lower than 150 kHz. Based on the EMI filter design method, together with a simple EMI noise prediction model, relationship between EMI filter corner frequency and PFC switching frequency was revealed. The analysis shows that switching frequency of PFC circuit should be higher than 400 kHz, so that both PFC inductor and EMI filter size can be reduced. Although theoretical analysis and experimental results verify the benefits of high switching frequency PFC, it is essential to find a suitable topology that allows high switching frequency operation while maintains high efficiency. Three PFC topologies, single switch PFC, three-level PFC with range switch and dual Boost PFC, were evaluated with analysis and experiments. By using advanced semiconductor devices, together with proposed control methods, these topologies could achieve high efficiency at high switching frequency. Thus, the benefits of high frequency PFC can be realized. In front-end converter, large holdup time capacitor size is another barrier for power density improvement. To meet the holdup time requirement, bulky holdup time capacitor is normally used to provide energy during holdup time. Holdup time capacitor requirement can be reduced by using wider input voltage range DC/DC converte. Because LLC resonant converter can realized with input voltage range without sacrificing its normal operation efficiency, it becomes an attractive solution for DC/DC stage of front-end converters. Moreover, its small switching loss allows it operating at MHz switching frequency and achieves smaller passive component size. However, lack of design methodology makes the topology difficult to be implemented. An optimal design methodology for LLC resonant converter has been developed based on the analysis on the circuit during normal operation condition and holdup time. The design method is verified by a 1 MHz switching frequency LLC resonant converter with 76W/in3 power density. When front-end converter operates at high switching frequency, negative effects of circuit parasitics become more pronounced. By integrating active devices together with their gate drivers, Active Integrated power electronics module (IPEM) can largely reduce circuit parasitics. Therefore, switching loss and voltage stress on switching devices can be reduced. Moreover, IPEM concept can be extended into passive integration and EMI filter integration By using this power integration technology, power density and circuit performance of front-end converter can be improved, which is verified by theoretical analysis and experimental results.",
  "description_provenance": [
    "Author Email: blu@vt.edu",
    "Advisor Email: daan@vt.edu",
    "Advisor Email: fclee@vt.edu",
    "Advisor Email: gqlu@vt.edu",
    "Advisor Email: lindner@vt.edu",
    "Advisor Email: fred.wang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:31Z (GMT). No. of bitstreams: 1 Lubing_dissertation.pdf: 4487100 bytes, checksum: 163ef34202f8d4bbcc849614e0d9ee4f (MD5)   Previous issue date: 2006-05-05"
  ],
  "handle": "28128",
  "identifier_other": "etd-06262006-111218",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06262006-111218/",
  "identifier_uri": "http://hdl.handle.net/10919/28128",
  "publisher": "Virginia Tech",
  "relation_haspart": "Lubing_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Three-level",
    "AC/DC",
    "DC/DC",
    "PFC",
    "Bridgeless PFC",
    "DPS",
    "Front-end",
    "High density",
    "High frequency",
    "Resonant converter",
    "Embedded power",
    "IPEM",
    "LLC",
    "Power integration"
  ],
  "title": "Investigation of High-density Integrated Solution for AC/DC Conversion of a Distributed Power System",
  "type": "Dissertation"
}