{
  "contributor_author": "Priest, Kerry Louise",
  "contributor_committeechair": "Rudd, Rick D.",
  "contributor_committeemember": [
    "Niewolny, Kimberly L.",
    "Wildman, Terry M.",
    "Dahm, Kristine C."
  ],
  "contributor_department": "Agricultural and Extension Education",
  "date_accessioned": "2014-03-14T20:13:32Z",
  "date_adate": "2012-07-23",
  "date_available": "2014-03-14T20:13:32Z",
  "date_issued": "2012-06-19",
  "date_rdate": "2012-07-23",
  "date_sdate": "2012-06-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This case study conceptually illustrated how a leadership living-learning community provided an educational context well suited to enhance development of leaders within changing leadership and educational paradigms.  Specifically, it highlighted how both leadership and learning have come to be viewed as sociocultural processes, and presented  theoretical and applied descriptions of â  communities of practiceâ   and the identity formation process of â  legitimate peripheral participationâ   (Lave & Wenger, 1991).  The unit of analysis for this case study was a first-year, leadership-themed living-learning community at a four-year, land grant university in the Eastern United States.  The purpose of the study was to explore how college students constructed leadership identities as they moved from first year members to second year peer leaders in the living-learning community.   Nine sophomore students serving in peer leader roles and four faculty members serving as program instructors were the primary study participants.  In-depth qualitative interviews with students and faculty, analysis of key program documents and studentsâ   written assignments, and a confirmatory student focus group contributed to the creation of eight primary themes and one overarching theme describing how students constructed leadership identities through community participation.   The eight themes included access to experiences of membership, meanings of the first-year experience, beliefs about leadership, peer leader roles and practices, knowing in practice, meanings of multi-membership, and embodiment of the program mission.  The overarching theme illustrated how peer leaders embody the mission-oriented program design as they move throughâ  and ultimately out ofâ  the community.  Studentsâ   representations of their beliefs and practices enacted through community leadership roles emphasized college success strategies, foundational leadership knowledge and skill development, and preparation for future leadership roles.  The findings of this study provided insight for educators who desire to design programs that foster college student leadership development.  The findings revealed social and cultural implications related to higher education's call to enhance students' leadership capacity.  There is a need to further explore leadership identity formation within other contexts, as well as the long-term impact of learning community experience on studentsâ   representations of leadership identity.",
  "description_provenance": [
    "Author Email: kpriest@vt.edu",
    "Advisor Email: niewolny@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Advisor Email: kdahm@reynolds.edu",
    "Advisor Email: rrudd@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:32Z (GMT). No. of bitstreams: 1 Priest_KL_D_2012.pdf: 2720705 bytes, checksum: 27af363f7911a52932ffc4ed0ed2bbdf (MD5)   Previous issue date: 2012-06-19"
  ],
  "handle": "28135",
  "identifier_other": "etd-06262012-175711",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06262012-175711/",
  "identifier_uri": "http://hdl.handle.net/10919/28135",
  "publisher": "Virginia Tech",
  "relation_haspart": "Priest_KL_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "peer leadership",
    "communities of practice",
    "higher education",
    "leadership",
    "leadership education",
    "leadership identity",
    "living-learning communities"
  ],
  "title": "Constructing Leadership Identities through Participation in a Leadership Living-Learning Community",
  "type": "Dissertation"
}