{
  "contributor_author": "Bowman, Denine Rachelle",
  "contributor_committeecochair": [
    "Maat, Mercedes ter",
    "Madison-Colmore, Octavia D."
  ],
  "contributor_committeemember": [
    "Rosen, Karen H.",
    "Pittel, Stephen",
    "Getz, Hilda M."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:13:32Z",
  "date_adate": "2003-07-03",
  "date_available": "2014-03-14T20:13:32Z",
  "date_issued": "2003-06-18",
  "date_rdate": "2004-07-03",
  "date_sdate": "2003-06-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<body bgcolor=\"#FFFFFF\"> <p align=\"center\">(ABSTRACT) </p> <p>Creative supervision interventions are suggested to be supportive of mental    health supervisees' professional development. Yet, empirical evidence of the    utility of such interventions is limited. The purpose of this study was to explore    whether a creative intervention, specifically visual art, enhances clinical    supervision. Enhancement was operationalized using likert scaled questions to    measure: (1) participants' level of enjoyment of the art task intervention,    (2) participants' perceived level of benefit derived from the art task intervention,    and (3) how often participants used art tasks in counseling their own clients.    Additionally, \"creativity\" was correlated to the dependent variables. Creativity    was operationalized using the Barron-Welsh Art Scale and the Remote Associates    Test. </p> <p>The art task interventions were administered in the clinical supervision of    master's-level counseling internship students at two Universities located in    the Washington D.C. metropolitan area. Supervisees engaged in visual art exercises,    and subsequent discussions, during the spring 2003 semester of their internship    class. </p> <p>Demographic information and likert-scaled responses measuring the dependent    variables were reported using percentages. Dependent variables were correlated    with creativity levels. Qualitative responses on the Exit Questionnaire were    summarized and reported. Results suggested that participants enjoyed and benefited    from supervision involving art tasks, and that a statistically significant relationship    exists between creativity (as measured by the Barron-Welsh Art Scale) and enjoyment    of the art tasks. While more participants overall used art in counseling their    clients after participating in the study, the number of times participants used    art tasks did not increase. </p> </body>",
  "description_provenance": [
    "Author Email: rachellebowman@yahoo.com",
    "Advisor Email: mtermaat@gmu.edu",
    "Advisor Email: krosen@vt.edu",
    "Advisor Email: smpa@csi.com",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: omadison@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:32Z (GMT). No. of bitstreams: 1 rbowman6-27etd.pdf: 428868 bytes, checksum: 3866c2fc51f610e96296db55523eb813 (MD5)   Previous issue date: 2003-06-18"
  ],
  "handle": "28138",
  "identifier_other": "etd-06272003-082400",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06272003-082400/",
  "identifier_uri": "http://hdl.handle.net/10919/28138",
  "publisher": "Virginia Tech",
  "relation_haspart": "rbowman6-27etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Supervision",
    "Art",
    "Creativity",
    "Internship"
  ],
  "title": "Do Art Tasks Enhance the Clinical Supervision of Counselors-in-Training?",
  "type": "Dissertation"
}