{
  "contributor_author": "AL-Saghir, Mohannad Ghazi",
  "contributor_committeechair": "Porter, Duncan M.",
  "contributor_committeemember": [
    "Opell, Brent D.",
    "Maroof, M. A. Saghai",
    "Scheckler, Stephen E."
  ],
  "contributor_department": "Biological Sciences",
  "date_accessioned": "2014-03-14T20:13:31Z",
  "date_adate": "2006-08-16",
  "date_available": "2014-03-14T20:13:31Z",
  "date_issued": "2006-06-15",
  "date_rdate": "2007-08-16",
  "date_sdate": "2006-06-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Pistacia is an economically important genus because it contains the pistachio crop, P. vera, which has edible seeds of considerable commercial importance. The evolutionary history of the genus and the taxonomic relationships among the species are controversial and not well understood. This study that has been conducted on this genus to refine taxonomic and evolutionary relationship utilizing different types of data (including morphology, anatomy and molecular) The studied species were the following: Pistacia aethiopica J. O. Kokwaro, P. atlantica Desf., P. chinensis Bunge, P. eurycarpa Yaltirik, P. falcata Becc. ex Martelli, P. integerrima Stew. ex Brand., P. khinjuk Stocks, P. lentiscus L., P. mexicana HBK,  P. mutica Fisch. & Mey.,  P. palaestina Boiss.,  P. terebinthus L., P. texana Swingle, P. vera L., and P. weinmannifolia Poiss. ex Franch. Phylogenetic analysis based on morphological data strongly supported the monophyly of Pistacia. The genus divided into two monophyletic groups.  One group (Section Pistacia) contains P. atlantica, P. chinensis, P. eurycarpa, P. falcata, P. integerrima, P. khinjuk, P. mutica, P. palaestina, P. terebinthus, and P. vera while the other group (Section Lentiscus) contains P. aethiopica, P. lentiscus, P. mexicana, P.  texana, and  P. weinmannifolia. In anatomical analysis, all species had anomocytic stomata. In most species, the stomata density was higher on the abaxial surface than the adaxial.  The ratio of abaxial to adaxial stomatal density varied from 0.0 to 1.7. Stomatal distribution may provide insights into how Pistacia species evolve in terms of leaf anatomy and respond to different climatic changes. Stomatal distribution changed (losing stomata on either surface) as the genus moved into regions of higher rainfall. This study revealed leaflets of P. vera, which have random orientation, were isobilateral, while leaflets of the other species were dorsiventral and were oriented horizontally.  RAPD analysis showed that P. khinjuk and P. vera are very close species.  This study provides more insights into understanding the evolution, taxonomy and genetics of this economically important genus.",
  "description_provenance": [
    "Author Email: malsaghi@vt.edu",
    "Advisor Email: duporter@vt.edu",
    "Advisor Email: bopell@vt.edu",
    "Advisor Email: smaroof@vt.eu",
    "Advisor Email: scheckler@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:31Z (GMT). No. of bitstreams: 1 ALSaghir_Dissertation_2006.pdf: 2257851 bytes, checksum: 65e1b53462e3df42adb4fd7e657575d4 (MD5)   Previous issue date: 2006-06-15"
  ],
  "handle": "28131",
  "identifier_other": "etd-06262006-201120",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06262006-201120/",
  "identifier_uri": "http://hdl.handle.net/10919/28131",
  "publisher": "Virginia Tech",
  "relation_haspart": "ALSaghir_Dissertation_2006.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "anatomy",
    "morphology",
    "taxonomy",
    "phylogeny",
    "Pistacia",
    "genetics"
  ],
  "title": "Phylogenetic Analysis of the Genus Pistacia (Anacardiaceae)",
  "type": "Dissertation"
}