{
  "contributor_author": "Donnelly, Martin John",
  "contributor_committeechair": "Telionis, Demetri P.",
  "contributor_committeemember": [
    "Ragab, Saad A.",
    "Schetz, Joseph A.",
    "Lesko, John Jack",
    "Hendricks, Scott L."
  ],
  "contributor_department": "Engineering Mechanics",
  "date_accessioned": "2014-03-14T20:13:31Z",
  "date_adate": "2006-09-06",
  "date_available": "2014-03-14T20:13:31Z",
  "date_issued": "2006-06-12",
  "date_rdate": "2006-09-06",
  "date_sdate": "2006-06-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An Experimental Investigation of Spanwise Vortices Interacting with Solid and Free Surfaces   By Martin J. Donnelly \t Coherent vortices are generated in flow fields due to flow interaction with sharp solid surfaces. Such vortices generate significant disturbances in the flow and affect its further development. In this dissertation attention is focused on the interaction of vortices with solid or free liquid/air surfaces. We examine vortices with their axis parallel or normal to the surface. Three main cases were examined: the interaction of a vortex pair propagating towards a solid boundary, the interaction of spanwise vortices in a turbulent boundary layer, and finally the interaction of spanwise vortices with a flat-plate wake and a free liquid surface.   These problems hold significance in several engineering applications, including investigations into trailing wing tip vortices and their interaction with the ground, vortical effects on the development of turbulent boundary layers and free surface signatures and their detection in ship/submarine wakes.  Data are acquired with a laser Doppler velocimetry system (LDV) and with Particle-Image Velocimetry (PIV), using a high-speed digital video camera.  The LDV system measures two components of velocity along appropriately chosen planes. Grids of data were acquired for different pitch rates of a disturbing flap that generates vortices. Phase-averaged vorticity and turbulence level contours are estimated and presented.  It is found that vortices with diameter the order of the boundary layer quickly diffuse and disappear while their turbulent kinetic energy spreads uniformly across the entire boundary layer.  Larger vortices have a considerably longer life span and in turn feed more vorticity into the boundary layer. Trailing edge vortices are generated in a water tunnel by sharp hinged motions of a flap.  These vortices are allowed to reconnect with the free surface and mix with a turbulent free shear layer.  The flow is conditionally sampled via frame grabbing of free surface shadowgraphs.  It is found that the vortex core bends away from the plane of the shear layer.  Moreover, contrary to earlier findings, organized velocity fluctuations decrease as the free surface is approached.",
  "description_provenance": [
    "Author Email: martin.donnelly@navy.mil",
    "Advisor Email: ragab@vt.edu",
    "Advisor Email: ptiger@vt.edu",
    "Advisor Email: telionis@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: hndrxsl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:31Z (GMT). No. of bitstreams: 1 Donnelly_ETD_8-23-06.pdf: 4688881 bytes, checksum: 02e36cf8b13d5a793e51cb2ca385a4b1 (MD5)   Previous issue date: 2006-06-12"
  ],
  "handle": "28130",
  "identifier_other": "etd-06262006-163321",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06262006-163321/",
  "identifier_uri": "http://hdl.handle.net/10919/28130",
  "publisher": "Virginia Tech",
  "relation_haspart": "Donnelly_ETD_8-23-06.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "vortex interaction",
    "turbulent boundary layer",
    "free surface"
  ],
  "title": "An Experimental Investigation of Spanwise Vortices Interacting with Solid and Free Surfaces",
  "type": "Dissertation"
}