{
  "contributor_author": "Bengier, Andrea L.",
  "contributor_committeechair": "Parson, Stephen R.",
  "contributor_committeemember": [
    "Curcio, Claire Cole Vaught",
    "Dawson, Christina M.",
    "Niles, Jerome A.",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:13:35Z",
  "date_adate": "2000-07-13",
  "date_available": "2014-03-14T20:13:35Z",
  "date_issued": "2000-04-17",
  "date_rdate": "2001-07-13",
  "date_sdate": "2000-06-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This study documented the initial planning process of a group of sixth grade teachers on a collaborative team over a six-month period. Using action research, this team of teachers examined their own practices of planning and implementing instruction.  The teachers identified a focus area, planned for instruction, implemented the plan, observed the results of their plan, reflected upon the results and revised the plan (Kemmis and Wilkinson, 1998) to map their instruction. The teachers used archival, conventional and inventive information sources (Calhoun, 1994) to collect their data on the identified focus areas.  The teachers used the concept of curriculum mapping (Jacobs, 1997) to plan instruction for their assigned students. The researcher originally had planned to assume three roles in the study: a coach or facilitator, a participant and a participant-observer. As the study progressed the researcher also assumed the role of a member/learner (Mertens, 1998) in the process.  Classroom observations, transcribed audio-tapes of planning meetings, field notes, teacher lesson plans, the teamâ  s reflection journal, teacher biographical information, interviews and visual curriculum maps designed by the teachers provided data for the study.  \tEmergent themes in teacher planning included instructional design, student personal information and parent communication.  The themes were defined by the supporting actions of the teachers. Instructional design was defined in the study with mapping, curriculum and instructional strategies.  Student personal information encompassed personal learning styles, information regarding student feelings and behaviors, and instructional strategies specifically identified for individual students. Parent communication included school, classroom and student information shared with parents.    \tThe research questions explored were: How does the planning process take place?  How did the planning process change as the team worked through the action research process? The findings show that: (1) a team of teachers can become stronger when they articulate their plan for instruction in writing (or in this case, drawing). (2) The concept of curriculum mapping can be a vehicle to insure a systematic instructional planning process. (3) Teachers detail individual assessment and instruction in planning sessions, lesson plans or curriculum maps. (4) Action research can provide a means for teachers to examine their own practices in a non-threatening format when they identify the focus areas of examination. (5) Teachers can learn from each other and share learned information in team planning if they perceive shared beliefs. (6) Teachers can plan for the success of all students when they consider essential questions to be learned and the individual learning styles of their students. (7) Teachers and administrators can work collaboratively in examining planning and instructional practices. (8) Teachers can identify their own professional growth needs when they examine their own practices. The findings also indicated that these middle school teachers created their own visual description of their planning for instruction, bringing ownership and empowerment to the process.  \tThe implication of these research results is that teacher planning in a team can be a powerful force in the improvement of instruction influencing the design of an instructional plan, the implementation of the plan and teacher reflection on the results of the plan in student learning and success within the classroom.  Recommendations for future research are discussed.",
  "description_provenance": [
    "Author Email: abengier@aol.com",
    "Advisor Email: vaughtc@vt.edu",
    "Advisor Email: dawsont@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:35Z (GMT). No. of bitstreams: 7 ETD_App_B.pdf: 1310571 bytes, checksum: 88f7b23f8198dccbdc4384d936cb4b0e (MD5) ETD_App_D.pdf: 148558 bytes, checksum: 50e5c6034995400ec57fd72f498b9e51 (MD5) ETD_Body.pdf: 379969 bytes, checksum: 41eb09f9d9262bae6d07ccfd10c6a8d5 (MD5) ETD_APP_A.pdf: 13380569 bytes, checksum: bcdd54c6d39a1d7f8429b34df7b63004 (MD5) ETD_Front.pdf: 24887 bytes, checksum: 7eb10e4f9cb3f4edcf1dca6de8a604b8 (MD5) ETD_Vita.pdf: 12021 bytes, checksum: 4224a4defa61ebeb4c11d66728db3a87 (MD5) ETD_App_C.pdf: 2325988 bytes, checksum: e0754da9e51c50a46a767f16c487956c (MD5)   Previous issue date: 2000-04-17"
  ],
  "handle": "28148",
  "identifier_other": "etd-06292000-11080046",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06292000-11080046/",
  "identifier_uri": "http://hdl.handle.net/10919/28148",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ETD_App_B.pdf",
    "ETD_App_D.pdf",
    "ETD_Body.pdf",
    "ETD_APP_A.pdf",
    "ETD_Front.pdf",
    "ETD_Vita.pdf",
    "ETD_App_C.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "teacher planning",
    "curriculum mapping",
    "action research"
  ],
  "title": "How One Middle School Began to Plan for Instruction - an Action Research Journey",
  "type": "Dissertation"
}