{
  "contributor_author": "Pamas, Roberto Andrew",
  "contributor_committeechair": "Alexander, M. David",
  "contributor_committeecochair": "Mallory, Walter D.",
  "contributor_committeemember": [
    "Caldwell, M. Teressa",
    "Byers, Larry"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:13:33Z",
  "date_adate": "2006-09-14",
  "date_available": "2014-03-14T20:13:33Z",
  "date_issued": "2006-04-19",
  "date_rdate": "2007-09-14",
  "date_sdate": "2006-06-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Students in many at-risk middle schools are not achieving at the same academic levels as their counterparts in middle-class schools.  Educators are constantly challenged to ensure academic success to all students despite social and economic obstacles.  Today, this challenge is more critical due to the rigid standards established by both state and federal legislation with the advent of the Standards of Learning tests in the Commonwealth of Virginia and the federal No Child Left Behind legislation.  A review of the literature indicates that the behaviors and practices of the principal influence and contribute to the success of students; consequently, this study demonstrated that effective leadership contributes to school success.  \"What are the leadership behaviors and practices of principals in highly successful middle schools with high concentrations of at-risk students?\" and \"How do principals in these schools influence the learning outcomes to close the achievement gap?\" are the two main questions asked in this study. This study answered these questions by examining the behaviors and practices of principals in successful at-risk middle schools, with a study of one successful at-risk middle school supported by a survey of the teachers in that school and two other successful at-risk middle schools.  The findings led to some of the following conclusions: the vision of the principal for school success is important and embraced by the school staff; the principal supports instructional programs and resources that address the individual needs of students; the principal promotes collaboration and shared leadership with teachers; the principal values and promotes family and community involvement; the principal is an instructional leader.  Some of the recommendations propose that principals in at-risk middle schools must keep the academic success of all students as the main mission of the school; must be an instructional leader; and must effectively manage the budget, resources, staff, and time for instruction.",
  "description_provenance": [
    "Author Email: Roberto.Pamas@fcps.edu",
    "Advisor Email: Teressa.Caldwell@fcps.edu",
    "Advisor Email: lbyers@vt.edu",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:33Z (GMT). No. of bitstreams: 1 PamasdissertationinPDF.pdf: 296174 bytes, checksum: 4a05257d6fe3cbb2beb46ff82d85f8e2 (MD5)   Previous issue date: 2006-04-19"
  ],
  "handle": "28140",
  "identifier_other": "etd-06272006-173236",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06272006-173236/",
  "identifier_uri": "http://hdl.handle.net/10919/28140",
  "publisher": "Virginia Tech",
  "relation_haspart": "PamasdissertationinPDF.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Principals",
    "Practices",
    "Susan Powell",
    "Successful",
    "Behaviors",
    "At-risk middle schools"
  ],
  "title": "The Behaviors and Practices of Principals in Successful At-Risk Middle Schools",
  "type": "Dissertation"
}