{
  "contributor_author": "Trader, Brian Wayne",
  "contributor_committeechair": "Scoggins, Holly L.",
  "contributor_committeemember": [
    "Latimer, Joyce G.",
    "Porter, Duncan M.",
    "Scheckler, Stephen E.",
    "Veilleux, Richard E."
  ],
  "contributor_department": "Horticulture",
  "date_accessioned": "2014-03-14T20:13:33Z",
  "date_adate": "2006-09-05",
  "date_available": "2014-03-14T20:13:33Z",
  "date_issued": "2006-06-19",
  "date_rdate": "2006-09-05",
  "date_sdate": "2006-06-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Astilbe (Saxifragaceae) is a genus of herbaceous perennials widely cultivated for their ornamental value. The genus is considered taxonomically complex because of its geographic distribution, variation within species, and the lack of adequate morphological characters to delineate taxa. To date, an inclusive investigation of the genus has not been conducted. This study was undertaken to (a) develop a well-resolved phylogeny of the genus Astilbe using an expanded morphological data set and sequences from the plastid gene matK, (b) use single nucleotide polymorphisms to determine the lineages of cultivated varieties, and (c) successfully culture Astilbe in vitro and evaluate potential somaclonal variation of resulting Astilbe microshoots.  Phylogenetic trees generated from a morphological character matrix of 28 character states divided Astilbe into three distinct clades. Relationships were well resolved among the taxa, though only a few branches had greater than 50% bootstrap support. There is evidence from the phylogeny that some described species may actually represent variation within populations of species. From our analysis I propose an Astilbe genus with 13 to 15 species and offer a key for distinguishing species and varieties. There was little matK sequence variation among taxa of Astilbe. Phylogeny of Astilbe generated from the maximum parsimony and maximum likelihood analysis of matK sequences resulted in a polytomy of seven Astilbe species, with relationships within the genus poorly resolved. A second phylogeny of 21 taxa of Astilbe was more informative, aligning cultivated varieties near species from which they were derived. The matK sequence variation for Astilbe taxa was aligned to reveal DNA polymorphisms. Closely related taxa retained polymorphisms at the same sites within the gene sequence. These polymorphic sites could potentially be utilized to confirm the lineage of popular cultivated Astilbe varieties.  Propagation of Astilbe seedlings in tissue culture gave rise to various numbers of microshoots from each of 15 seedlings. Multivariate and cluster analysis of morphological characters from 138 plants derived from 15 seedlings revealed potential somaclonal variants. These variants were characterized by one or more of the following traits: dwarf habit, dark green leaves (high chlorophyll content), increased flowering, or larger plant size. Somaclonal variants with desirable phenotypes may be valuable for cultivar development.",
  "description_provenance": [
    "Author Email: btrader@vt.edu",
    "Advisor Email: jlatime@vt.edu",
    "Advisor Email: duporter@vt.edu",
    "Advisor Email: stephen@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: hollysco@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:33Z (GMT). No. of bitstreams: 1 LastTraderDissertation.pdf: 1772465 bytes, checksum: 2cb1b697a49520a311a76804710045f6 (MD5)   Previous issue date: 2006-06-19"
  ],
  "handle": "28145",
  "identifier_other": "etd-06282006-151157",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06282006-151157/",
  "identifier_uri": "http://hdl.handle.net/10919/28145",
  "publisher": "Virginia Tech",
  "relation_haspart": "LastTraderDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "phylogenetics",
    "matK",
    "somaclonal variation",
    "Saxifragaceae",
    "taxonomy"
  ],
  "title": "Molecular and Morphological Investigation of Astilbe",
  "type": "Dissertation"
}