{
  "contributor_author": "Liu, Dongmin",
  "contributor_committeechair": "Denbow, Donald Michael",
  "contributor_committeemember": [
    "Veit, Hugo P.",
    "Wilson, James H.",
    "Herbein, Joseph H. Jr.",
    "Denbow, Cynthia J."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:13:35Z",
  "date_adate": "2000-07-12",
  "date_available": "2014-03-14T20:13:35Z",
  "date_issued": "2000-06-26",
  "date_rdate": "2001-07-12",
  "date_sdate": "2000-06-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Japanese quail were used as animal models in four experiments to evaluate the effects of supplementing diets with different lipids on bone chemical, mechanical, and histological properties.    In Exp. 1, laying hens were fed a basal diet containing either 5% soybean oil (SBO), hydrogenated soybean oil (HSBO), chicken fat (CF), or menhaden fish oil (FO).   The addition of SBO in the maternal diet increased the levels of total n-6 fatty acids and arachidonic acid (AA, 20:4n-6) in yolk and tibial bones of newly hatched progeny (P<0.01), whereas the maternal FO diet elevated the concentrations of total n-3 fatty acids, eicosapentaenoic acid (EPA, 22:5n-3), docosahexaenoic acid (DHA, 22:6n-3) and total saturated acid, but greatly decreased the amount of AA in both egg and progeny tibiae (P<0.01).   The maternal HSBO diet resulted in the accumulation of trans-18:1 fatty acid in egg yolks and tibiae at hatch.  The addition of FO or HSBO to the maternal diet significantly lowered the ex vivo PGE2  production of tibiae in newly hatched quail compared to those from hens given the SBO or CF diets (P<0.01).  In Exp. 2, the addition of different lipids in the maternal diets did not affect growth, tibial length, diameter or collagen content of the progeny.  However, supplementing the maternal diet with 5 % FO or HSBO increased the percent bone ash , increased bone pyridinium crosslinks of collagen, enlarged the cartilaginous proliferative and hypertrophied zones, increased diaphyseal cortical thickness of the tibiae in embryos (P<0.05), and subsequently increased tibial shear force, stiffness (P<0.05) and improved cortical thickness, density and trabecular density in early growth and development of progeny compared to those from hens consuming the SBO or CF diets (P<0.05).  In Exp. 3, male quail at one month of age were fed a basal diet containing either 5% SBO, HSBO, CF or FO for seven months.  Long-term supplementation in the diets of different lipids did not affect body weight, food intake, tibial length or diameter, but the FO group had the highest tibial percent ash, and both FO and HSBO increased tibial mineral content in aged quail compared to those fed the SBO or CF diets (P<0.05).  At 8 months of age, quail fed FO had the highest concentrations of (n-3) fatty acids (20:5n-3, 22:5n-3, 22:6n-3) but the lowest amounts of 20:4n-6 in lipids from tibial cortical bone, whereas the SBO and CF diets greatly elevated (n-6) fatty acids and 20:4n-6 levels.  The HSBO diet which contains t18:1 fatty acid resulted in t18:1 accumulation in bone.  Long-term supplementation with FO or HSBO increased tibial shear force, stiffness and shear stress, as well as improved cortical thickness and density compared with the SBO or CF diets  ( P<.05).  In Exp. 4, the addition of SBO or CF to the diet for seven months decreased tibial mineral content compared to the FO diet (P<0.05).  Quail fed SBO increased collagen concentration in the tibiae (P<0.05), but the level of collagen crosslinks was higher in quail fed FO or HSBO compared to those given the SBO or CF diets (P<0.05).  The PGE2 production in bone organ culture and marrow was greatly increased in quail maintained on the SBO or CF diets (P<0.05).  PGE2 production in the bone microenvironment was negatively correlated with the tibial percent ash and collagen crosslinks but had a positive correlation with tibial collagen concentration.  The results of these studies demonstrate that either supplementing the maternal diets with or long-term exposure to different lipids alters the chemical composition and metabolism of skeletal tissue in both embryos and aged quail.  Maternal dietary SBO or CF had an adverse effect on bone growth and development in embryos.  Likewise, long-term exposure to SBO or CF diet impaired bone metabolism and remodeling.   In contrast, the FO or HSBO diet had beneficial effects on bone modeling in embryos and remodeling in adult quail.",
  "description_provenance": [
    "Author Email: doliu@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Advisor Email: hpveit9@vt.edu",
    "Advisor Email: jawilson@vt.edu",
    "Advisor Email: herbein@vt.edu",
    "Advisor Email: cdenbow@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:35Z (GMT). No. of bitstreams: 1 1etd.pdf: 514577 bytes, checksum: 5a2aaacef80707621db29d2327ff3703 (MD5)   Previous issue date: 2000-06-26"
  ],
  "handle": "28149",
  "identifier_other": "etd-06292000-18580054",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06292000-18580054/",
  "identifier_uri": "http://hdl.handle.net/10919/28149",
  "publisher": "Virginia Tech",
  "relation_haspart": "1etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "histology",
    "crosslinks",
    "collagen",
    "PGE2",
    "fatty acids",
    "Lipids",
    "quail",
    "mechanical properties"
  ],
  "title": "THE EFFECTS OF DIETARY LIPIDS ON BONE CHEMICAL, MECHANICAL AND HISTOLOGICAL PROPERTIES IN JAPANESE QUAIL (COTURNIX C. JAPONICA)",
  "type": "Dissertation"
}