{
  "contributor_author": "Milkevitch, Matthew",
  "contributor_committeechair": "Brewer, Karen J.",
  "contributor_committeecochair": "Winkel, Brenda S. J.",
  "contributor_committeemember": [
    "Hanson, Brian E.",
    "Anderson, Mark R.",
    "Long, Gary L."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:13:33Z",
  "date_adate": "2001-07-09",
  "date_available": "2014-03-14T20:13:33Z",
  "date_issued": "2000-07-14",
  "date_rdate": "2002-07-09",
  "date_sdate": "2001-06-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The goal of this research was to design, prepare and study a new class of supermolecules coupling ruthenium and platinum, which would display covalent binding to DNA.  Drawing upon the well-established efficacy of cis-diamminedichloroplatinum(II) (cisplatin) and the DNA-binding properties of select ruthenium polyazine complexes, the approach was to bind the cis-PtIICl2 active site of cisplatin to ruthenium light absorbers using the dpq and dpb bridging ligands (where dpq = 2,3-bis(2-pyridyl)quinoxaline, dpb = 2,3-bis(2-pyridyl) benzoquinoxaline).  These complexes are potentially bifunctional, capable of DNA intercalation through the bridging ligand and covalent binding to DNA through the cis-PtCl2 site. Synthetic methods were developed to prepare the mixed-metal, bimetallic complexes [(bpy)2Ru(BL)PtCl2](CF3SO3)2 and [(phen)2Ru(BL)PtCl2](CF3SO3)2 (where bpy = 2,2¢-bipyridine, phen = 1,10-phenanthroline) in high purity and good overall yields. The DNA-binding ability of these complexes was probed by reaction with linearized plasmid DNA and subsequent analysis by native and denaturing gel electrophoresis.  The known DNA binders, cisplatin and trans-{[PtCl(NH3)2]2(m-H2N(CH2)6NH2)}(NO3)2 (1,1/t,t), were examined under equivalent conditions and used as positive controls. Native gel electrophoresis was used to show that these complexes strongly bind DNA, retarding the migration of DNA through the gel in a fashion inversely proportional to the ratio of DNA base pairs (bp) to metal complex (mc). Analysis by denaturing gel electrophoresis determined that the Ru-Pt complexes bind to DNA in a fashion similar to cisplatin, forming primarily intrastrand adducts.  However, these systems also appear to form interstrand adducts at a 10-fold lower metal  concentration than cisplatin.    In addition to affecting the migration rate, the bimetallic complexes also significantly reduced the fluorescence of DNA-intercalated ethidium bromide for the Ru-Pt reacted samples at low-DNA bp: mc ratios. This was not observed for the cisplatin and 1,1/t,t treated samples.  This observation was quantitated by gel densitometry.  Precipitation of the DNA by cisplatin, 1,1/t,t and all four Ru-Pt complexes was determined not to be the cause of reduced ethidium bromide fluorescence intensity. Homogenous solution fluorescence quenching studies have revealed that the Ru-Pt complexes quench the emission of ethidium bromide even in the absence of DNA, whereas cisplatin and 1,1/t,t do not.    In order to compare the effects on DNA migration produced by cisplatin, 1,1/t,t and the Ru-Pt complexes, Rf values were calculated.  This analysis has revealed that all four Ru-Pt complexes retard DNA migration to approximately the same degree.  Calculation of theoretical DNA migration distances, based upon the molecular weight change of DNA caused by metal-complex binding, have revealed that the observed affect on DNA migration cannot be accounted for by an increase in  molecular weight alone.  This indicates that changes in charge and three-dimensional shape of the DNA upon binding of the Ru-Pt complexes may also contribute.",
  "description_provenance": [
    "Author Email: mmilkevitch@yahoo.com",
    "Advisor Email: winkel@vt.edu",
    "Advisor Email: bhanson@vt.edu",
    "Advisor Email: kbrewer@chemserver.chem.vt.edu",
    "Advisor Email: mark.anderson@vt.edu",
    "Advisor Email: glong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:33Z (GMT). No. of bitstreams: 4 Vitae.pdf: 44018 bytes, checksum: 5212abd9ab00e5a9ab2b7a5117da5018 (MD5) Appendices.pdf: 1312432 bytes, checksum: 8051be6f0ae56ab9ed1b979113e615ea (MD5) Dissertch1-4.pdf: 4103649 bytes, checksum: 442a75c752beca371be16efe3d6fc9cd (MD5) Frontmatter.pdf: 173541 bytes, checksum: fb5cdf3a05db7aba1aa3ef3ed55e9dee (MD5)   Previous issue date: 2000-07-14"
  ],
  "handle": "28142",
  "identifier_other": "etd-06282001-064000",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06282001-064000/",
  "identifier_uri": "http://hdl.handle.net/10919/28142",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Vitae.pdf",
    "Appendices.pdf",
    "Dissertch1-4.pdf",
    "Frontmatter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Cisplatin",
    "Gel Densitometry",
    "Electrochemistry",
    "Supermolecules",
    "Gel Electrophoresis",
    "Spectroscopy",
    "DNA Binding"
  ],
  "title": "Mixed-Metal Ruthenium-Platinum Polyazine Supermolecules:  Synthesis, Characterization and Exploration of DNA Binding",
  "type": "Dissertation"
}