{
  "contributor_author": "Gray, James Katon",
  "contributor_committeechair": "Norton, George W.",
  "contributor_committeemember": [
    "Alwang, Jeffrey R.",
    "Bertelsen, Michael K.",
    "McGuirk, Anya M.",
    "Mills, Bradford F."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:13:33Z",
  "date_adate": "2002-07-15",
  "date_available": "2014-03-14T20:13:33Z",
  "date_issued": "2002-06-10",
  "date_rdate": "2003-07-15",
  "date_sdate": "2002-06-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Government of Senegal is attempting to liberalize the groundnut market. In the past, this market was highly regulated with government-set producer prices, groundnut oil processing mills owned by parastatals, and requirements that all groundnuts be sold to these quasi-governmental organizations. In recent years, these rules are being relaxed, and farmers are allowed to sell groundnuts on the open market. However, farmers continue to sell most of their groundnuts, as before, to the mills.  This study attempts to shed light on the effects of this market liberalization. First, an attempt is made to provide estimates of the farmers' short-run output supply and input demand responses to price changes. A quadratic profit function model is estimated using data collected for the current study and a similar dataset collected by Akobundu [1997]. Second, a quadratic programming model is used to examine the effects of eliminating pan-territorial prices. Results indicate that the elimination of the pan-territorial price system will have an overall benefit to Senegalese society. However, as expected, groundnut producers in areas remote from the groundnut oil processing mills would face lower prices. The effects on producers and consumers in the major producing regions, however, were found to be minimal.  Finally, the dissertation provides an extensive description of the economic activities of small-scale farm households in Senegalâ  s Groundnut Basin. Differences between males and females and between household heads and other males in the household are also examined. Although females are not as involved in groundnut production, they do not seem to face discrimination in either the official or the open market.  The description of the situation facing small-scale farmers provided in this dissertation is not encouraging. The quantity and timing of the rains in the Groundnut Basin add an unwelcome uncertainty to farming. Increases in population are adding pressure to the environment and are placing heavy demands on wood and grazing lands. Only eight percent of the farmers had groundnut seed multiplication ratios less than one, and sixty-seven percent had ratios less than five.  The dissertation also indicates that farmers are not producing enough to feed their families. Fewer than twelve percent of the households produce a caloric surplus. Sixty percent produced less than fifty percent of their caloric needs. The study indicates that farmers are not earning enough from agricultural production to take care of normal expenses throughout the year. Thus, when combined with uncertain rains and a worsening environment, the farmers have little margin of safety. Therefore, any government policies affecting groundnut production in particular or agricultural production in general should take into account the situation already facing the farmers.",
  "description_provenance": [
    "Author Email: grayjk@vt.edu",
    "Advisor Email: alwangj@vt.edu",
    "Advisor Email: bertel@vt.edu",
    "Advisor Email: mcguirk@vt.edu",
    "Advisor Email: gnorton@vt.edu",
    "Advisor Email: bfmills@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:33Z (GMT). No. of bitstreams: 1 JKGray_PhD.pdf: 8774545 bytes, checksum: d22ec0fc226347a58f11c49ac316407e (MD5)   Previous issue date: 2002-06-10"
  ],
  "handle": "28143",
  "identifier_other": "etd-06282002-165514",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06282002-165514/",
  "identifier_uri": "http://hdl.handle.net/10919/28143",
  "publisher": "Virginia Tech",
  "relation_haspart": "JKGray_PhD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "economic surplus",
    "groundnuts",
    "Senegal",
    "agricultural supply response",
    "peanuts"
  ],
  "title": "The Groundnut Market in Senegal: Examination of Price and Policy Changes",
  "type": "Dissertation"
}