{
  "contributor_author": "Niezrecki, Christopher",
  "contributor_committeechair": "Cudney, Harley H.",
  "contributor_committeemember": [
    "Das, Alok",
    "Saunders, William R.",
    "Wicks, Alfred L.",
    "Batra, Romesh C.",
    "Burdisso, Ricardo A."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:13:34Z",
  "date_adate": "1999-06-30",
  "date_available": "2014-03-14T20:13:34Z",
  "date_issued": "1999-06-04",
  "date_rdate": "2000-06-30",
  "date_sdate": "1999-06-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Future launch vehicle payload fairings will be manufactured from advanced lightweight composite materials.  The loss of distributed mass causes a significant increase in the internal acoustic environment, causing a severe threat to the payload.  Using piezoelectric actuators to control the fairing vibration and the internal acoustic environment has been proposed.  The control authority of these actuators for this problem has not yet been determined.  To help determine the acoustic control authority of piezoelectric actuators mounted on a rocket fairing, the internal acoustic response created by the actuators needs to be determined.  In this work the internal acoustic response of a closed simply-supported (SS) cylinder actuated by piezoelectric (PZT) actuators is presented.  A research-grade SS cylinder is created and the modal properties are analyzed experimentally.  The experimental modal properties are compared to finite element analysis (FEA) and to results predicted by Love shell theory.  The experimental results indicate that the created cylinder has dynamic properties that are similar to the analytical and FEA results.  The formulation for the structural response uses an impedance model to predict transverse vibration of the cylinder excited by PZT actuators.  The model is also shown to be valid. To obtain the internal acoustic response of the cylinder a boundary element analysis using the Kirchoff-Helmholtz integral is used.  The motion of the structure is assumed to be uncoupled with the internal acoustics, and so the structural-acoustic interaction is not considered in this analysis.  An analytical solution to the internal acoustic response within the cylinder is derived for a single mode structural vibration.  The numerical and analytical models are shown to be in agreement.  The numerical model is also verified experimentally by measuring the acoustic field within the cylinder.  The experimental results and the results predicted by the acoustic model are in agreement.  A measure of the acoustic loss factor for the aluminum cylinder is also determined experimentally.   <p> The validated model is used to extrapolate results for a SS cylinder that emulates a Minotaur payload fairing.  The internal cylinder acoustic levels are investigated for PZT actuation between 35 and 400 Hz.  It is found that changes in cylinder parameters (stiffness and material density) do not have a large effect on the magnitude of the structural response.  Likewise the interior acoustic response is not greatly affected by changes to the cylinder parameters.  As the applied voltage increases linearly, the internal sound pressure level (SPL) varies logarithmically.  This behavior is a limiting factor in using a PZT actuator to generate high internal SPLs.  Significant reductions in the structural response due to increased damping do not equate to similar reductions in the acoustic SPLs for the cylinder.  The sound levels at the acoustic resonant frequencies are essentially unaffected by the significant increase in structural damping while the acoustic levels at the structural resonant frequencies are mildly reduced.  The interior acoustic response of the cylinder is dominated by the acoustic modes and therefore significant reductions in the overall interior acoustic levels will not be achieved if only the structural resonances are controlled. <p> The model indicates that the maximum acoustic levels generated by the baseline PZT actuator are sufficient at the higher frequency range but are not commensurate with the levels found in a typical fairing in the lower frequency range (below ~200 Hz).  Since the baseline actuator's applied voltage can not be increased, additional actuators are required in order to increase the response of the cylinder at some of the lower frequencies.  The baseline actuator is clearly better at generating sound within the cylinder as the frequency increases.  This implies that more actuators will be required to control the lower frequency modes than the higher frequency modes.  As the actuation frequency is reduced, the number of actuators required to generate acoustic levels commensurate to that found in the fairing increases to impractical values.  Below approximately 100 Hz, the current demands reach levels that are extremely difficult to achieve with a practical system.  The results of this work imply that PZT actuators do not have the authority to control the payload fairing internal acoustics below ~100 Hz.",
  "description_provenance": [
    "Author Email: cniezrec@vt.edu",
    "Advisor Email: dasa@plk.af.mil",
    "Advisor Email: saunders@stnick.me.vt.edu",
    "Advisor Email: awicks@vt.edu",
    "Advisor Email: rbatra@vt.edu",
    "Advisor Email: rburdiss@vt.edu",
    "Advisor Email: cudney@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:34Z (GMT). No. of bitstreams: 22 CHAPTER1.pdf: 247133 bytes, checksum: f97aaf59b43a59a45ad277103ca88617 (MD5) TABLEOFCONTENTS.pdf: 24307 bytes, checksum: 3faaf4f943484521ef272654b347dc96 (MD5) COVERPAG.pdf: 11010 bytes, checksum: d424d05782b5019c0afb0c3d0d4eb661 (MD5) CHAPTER2.pdf: 680461 bytes, checksum: 9188746d981aeb5b18bf39c1098c0420 (MD5) CHAPTER3.pdf: 187771 bytes, checksum: 3e2dbe2ae94e77c80eb6d2ea348e3d29 (MD5) CHAPTER4.pdf: 1196826 bytes, checksum: 090a01d8bf16536fb36783641acefe5e (MD5) CHAPTER5.pdf: 185838 bytes, checksum: 1b2eb5ad8688cdd0bd33aa912984ca87 (MD5) CHAPTER6.pdf: 21613 bytes, checksum: e911efa3ff40ed1585984cb29e2dc69d (MD5) CHAPTER7.pdf: 17701 bytes, checksum: 3699227ad571ab47bc0ba7e529d83c48 (MD5) REFERENC.pdf: 27632 bytes, checksum: 6f23dac82fe3fe01427c00c014f62890 (MD5) APPENDIXA.pdf: 16256 bytes, checksum: a1eb6987024d9017ab93ed792975e669 (MD5) APPENDIXB.pdf: 11997 bytes, checksum: ba81a3ac81332496a2da6574d3c11d90 (MD5) APPENDIXC.pdf: 436822 bytes, checksum: 6f90acd179c7132feb7925fd6bdad112 (MD5) APPENDIXD.pdf: 81186 bytes, checksum: f9f303582890c94e1a476e4626841b3b (MD5) APPENDIXE.pdf: 2084536 bytes, checksum: 8da6eb62c77d3f5f5fa01ab3c3ab7c83 (MD5) APPENDIXEb.pdf: 2116214 bytes, checksum: 74331d26443050075e1a53bd445dcb7d (MD5) APPENDIXEc.pdf: 1774330 bytes, checksum: 0491108200d23e4cdcaa5643b77a9f14 (MD5) APPENDIXF.pdf: 17704 bytes, checksum: af1f977a9ee2d28a2389056b8564e4cb (MD5) APPENDIXG.pdf: 6103 bytes, checksum: b0da4138ab9a7449e003afcf0f80263e (MD5) APPENDIXH.pdf: 30487 bytes, checksum: 407a9645b6cc1e82a7c286be871e28b7 (MD5) APPENDIXI.pdf: 22625 bytes, checksum: 7d3d540e3213818c40a730b0cdad1da8 (MD5) VITA.pdf: 3160 bytes, checksum: b447251c9147c5b0aaf90e40b166357b (MD5)   Previous issue date: 1999-06-04"
  ],
  "handle": "28147",
  "identifier_other": "etd-062899-223748",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-062899-223748/",
  "identifier_uri": "http://hdl.handle.net/10919/28147",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAPTER1.pdf",
    "TABLEOFCONTENTS.pdf",
    "COVERPAG.pdf",
    "CHAPTER2.pdf",
    "CHAPTER3.pdf",
    "CHAPTER4.pdf",
    "CHAPTER5.pdf",
    "CHAPTER6.pdf",
    "CHAPTER7.pdf",
    "REFERENC.pdf",
    "APPENDIXA.pdf",
    "APPENDIXB.pdf",
    "APPENDIXC.pdf",
    "APPENDIXD.pdf",
    "APPENDIXE.pdf",
    "APPENDIXEb.pdf",
    "APPENDIXEc.pdf",
    "APPENDIXF.pdf",
    "APPENDIXG.pdf",
    "APPENDIXH.pdf",
    "APPENDIXI.pdf",
    "VITA.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Fairing",
    "Actuator",
    "Acoustic",
    "Cylinder",
    "Simply-Supported"
  ],
  "title": "Structural & Internal Acoustic Response of Cylinders with Applications to Rocket Payload Fairings",
  "type": "Dissertation"
}