{
  "contributor_author": "Park, Eun-Soo",
  "contributor_committeechair": "Barksdale, Mary Alice",
  "contributor_committeemember": [
    "Potts, Ann",
    "Tilley-Lubbs, Gresilda A.",
    "Tlou, Josiah S.",
    "Nichols, William D."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:13:35Z",
  "date_adate": "2005-07-21",
  "date_available": "2014-03-14T20:13:35Z",
  "date_issued": "2005-06-15",
  "date_rdate": "2005-07-21",
  "date_sdate": "2005-06-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The present study examined five Korean elementary studentsâ   English learning experiences in the United States. By examining Korean studentsâ   experiences while they were living in the United States, the study aimed to explore what the students themselves thought about regarding what they had learned while living in an English-speaking community and the studentsâ   perceptions of how these experiences influenced their English learning. Specifically, the study investigated the linguistic, cultural, and attitudinal impact of living temporarily in the United States on Korean elementary students. Interviewing was the primary means of collecting data for the study. These data was supplemented by a short survey, classroom observation, and relevant documentation about the childrenâ  s learning, such as samples of the childrenâ  s schoolwork. The analysis of data for this study began with organizing a description of each case, then, analyses were constructed to construct themes that cut across the data, and these themes have been utilized to generalize about what significant experiences constituted the development of English as a second language. This document reports the findings concerning the nature of the processes of learning and development that five Korean children experienced in learning English in the United States; teacher and student interaction; student and student interaction; meaningful learning experience; and classroom activities.",
  "description_provenance": [
    "Author Email: eupark@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:35Z (GMT). No. of bitstreams: 2 EDT.pdf: 5042561 bytes, checksum: 884f694c117059963bee7387091a2d6b (MD5) intropages.pdf: 28487 bytes, checksum: 7508a04e7d6118dbe463970012842572 (MD5)   Previous issue date: 2005-06-15"
  ],
  "handle": "28155",
  "identifier_other": "etd-06292005-222143",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06292005-222143/",
  "identifier_uri": "http://hdl.handle.net/10919/28155",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "EDT.pdf",
    "intropages.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "study abroad context",
    "English language learners",
    "second language learning",
    "sociocultural perspective"
  ],
  "title": "A case study of young Korean children's English learning experiences in the United states",
  "type": "Dissertation"
}