{
  "contributor_author": "Kelly II, Richard Thomas",
  "contributor_committeechair": "Love, Nancy G.",
  "contributor_committeemember": [
    "Daigger, Glen T.",
    "Novak, John T.",
    "Vikesland, Peter J.",
    "Stevens, Ann M."
  ],
  "contributor_department": "Environmental Engineering",
  "date_accessioned": "2014-03-14T20:13:35Z",
  "date_adate": "2005-07-21",
  "date_available": "2014-03-14T20:13:35Z",
  "date_issued": "2005-06-21",
  "date_rdate": "2007-07-21",
  "date_sdate": "2005-06-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research first examined nitrification inhibition caused by different classes of industrially relevant chemicals on activated sludge and found that conventional aerobic nitrification was inhibited by single pulse inputs of every chemical tested, with 1-chloro-2,4-dinitrobenzene (oxidant) having the most severe impact, followed by alkaline pH 11, cadmium (heavy metal), cyanide, octanol (hydrophobic) and 2,4-dinitrophenol (respiratory uncoupler).  Of the different chemicals tested, the oxidative and hydrophobic chemicals showed severe nitrification inhibition relative to other treatment processes and therefore deserved further investigation.  For oxidative chemicals, we hypothesized that the more severe inhibition was because nitrifying bacteria lack one or more of the microbial stress response mechanisms used to mediate the toxic effect of oxidative chemicals.  During these experiments, we showed that a rapid (minutes) antioxidant potassium efflux mechanism does not exist in two nitrifying bacteria, Nitrosomonas europaea and Nitrospira moscoviensis.  Furthermore, we showed that another important antioxidant molecule, glutathione, was not oxidized as readily as in a non-nitrifying bacterium.  Furthermore, we hypothesized that hydrophobic chemical-induced nitrification inhibition recovered more quickly because of the presence of membrane modification stress response mechanisms.  While testing this hypothesis, we showed that N. europaea modified its cell membrane in response to hydrophobic chemicals using a long-term (hours) membrane modification mechanism that required the synthesis of new fatty acids, but it did not contain a short-term (minutes) response mechanism involving a cis/trans isomerase.  Therefore, investigating these nitrifier stress responses showed that nitrifiers lack short-term stress responses that may be used to rapidly detect inhibition, indicating that conventional methods of detecting nitrification inhibition, like differential respirometry and nitrate generation rate (NGR), are still the fastest and easiest methods to use.  Because several conventional methods exist, we also investigated differences between differential respirometry and a UV method we developed to measure NGR.  During these tests, we showed that the UV NGR method provided a more reliable measure of nitrification inhibition than differential respirometry, and that the time to maximum nitrification inhibition depended on the properties of the chemical toxin, which implies that longer exposure times may be needed to accurately predict nitrification inhibition.",
  "description_provenance": [
    "Author Email: rkellyii@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Advisor Email: nlove@vt.edu",
    "Advisor Email: pvikes@vt.edu",
    "Advisor Email: ams@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:35Z (GMT). No. of bitstreams: 1 KellyIIETDnew.pdf: 1540476 bytes, checksum: b244b8920c491f8b2afd4fc55598c855 (MD5)   Previous issue date: 2005-06-21"
  ],
  "handle": "28151",
  "identifier_other": "etd-06292005-113813",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06292005-113813/",
  "identifier_uri": "http://hdl.handle.net/10919/28151",
  "publisher": "Virginia Tech",
  "relation_haspart": "KellyIIETDnew.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "chemical inhibition",
    "fatty acid",
    "cell membrane",
    "potassium efflux",
    "glutathione",
    "stress response",
    "detection",
    "activated sludge",
    "nitrification"
  ],
  "title": "Chemical Inhibition of Nitrification:  Evaluating Methods to Detect and Characterize Inhibition and the Role of Selected Stress Responses Upon Exposure to Oxidative and Hydrophobic Toxins",
  "type": "Dissertation"
}