{
  "contributor_author": "Xu, Dingying",
  "contributor_committeechair": "Dillard, John G.",
  "contributor_committeemember": [
    "Ward, Thomas C.",
    "McGrath, James E.",
    "Esker, Alan R.",
    "Dillard, David A."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:13:37Z",
  "date_adate": "2004-07-07",
  "date_available": "2014-03-14T20:13:37Z",
  "date_issued": "2004-06-10",
  "date_rdate": "2005-07-07",
  "date_sdate": "2004-06-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The adhesion and durability of model epoxy/silane/SiO2/Si bonded systems were investigated under various conditions, including the type of surface preparation, pH of the environmental media, temperature, cyclic thermal stress, and external applied stress. The fundamental debond mechanism was studied for bonded systems exposed to selected environments. The bond failure mode was characterized by examining the failed bond surfaces using X-ray photoelectron spectroscopy.  The effectiveness of combining the oxygen plasma treatment and silane coupling agent (SCA) derivatization in adhesion promotion for an epoxy bonded to a silicon surface was evaluated in this research. SCAs with different amine functionalities were studied. The oxygen plasma treatment time was varied systematically to achieve a different extent of oxidation on the Si wafer. The surface chemistry/composition of various silane derivatized Si surfaces was investigated. The studies revealed that SCA interaction with the Si surface was enhanced by the oxygen plasma pre-treatment of the Si substrates. XPS surface analysis results showed that the SCA/SiO2 ratio did not correlate strongly with the increase in oxygen plasma pretreatment time. However, for Si surfaces treated for longer oxygen plasma pretreatment times, more silanol groups may be available to interact with the hydrolyzed silanol groups on silane, resulting in a stronger SCA-Si attachment.   Three different tests were employed to determine adhesion and durability of the model epoxy/SCA/SiO2/Si bonded specimens. The immersion test qualitatively evaluates the bond durability for various systems exposed to different chemical and thermal conditions. Second, a novel probe test was used to quantitatively determine adhesion under critical debonding conditions for bonded specimens with different SCA preparations. A general trend of bond durability varied in the manner SCA-2 > SCA-3 > SCA-1 > no silane. Bond durability also increased for samples: model epoxy/SCA modified/O2 plasma treated/Si as the oxygen plasma pre-treatment time increased. Third, bond durability was studied using the wedge DCB (double cantilever beam) test under subcritical debonding conditions with environment-assisted crack growth as a function of applied strain energy release rate. Higher crack velocity and the absence of a Gthreshold value were noted in tests at 70 oC. The Gthreshold value increased as the strength of the interface increased and as the chemical aggressiveness of the environment decreased. For tests involving 25 oC -70 oC thermal cycling, only limited crack growth was found.",
  "description_provenance": [
    "Author Email: dixu@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: Jmcgrath@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: dillard@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:37Z (GMT). No. of bitstreams: 1 FinalDissertationDXu.pdf: 2247549 bytes, checksum: 27bffc757f9344f6f6770a90bd84df00 (MD5)   Previous issue date: 2004-06-10"
  ],
  "handle": "28166",
  "identifier_other": "etd-06302004-004628",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06302004-004628/",
  "identifier_uri": "http://hdl.handle.net/10919/28166",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalDissertationDXu.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "probe test",
    "silane coupling agent",
    "durability",
    "failure analysis",
    "silicon surface modification",
    "plasma treatment",
    "adhesion",
    "epoxy",
    "X-ray photoelectron spectroscopy"
  ],
  "title": "Durability and Adhesion of a Model Epoxy Adhesive Bonded to Modified Silicon Substrates",
  "type": "Dissertation"
}