{
  "contributor_author": "Ramanath, Ramya",
  "contributor_committeechair": "Ebrahim, Alnoor S.",
  "contributor_committeemember": [
    "Dyck, Robert G.",
    "Koebel, Charles Theodore",
    "Scarpaci, joseph L. Jr.",
    "Carmin, Joann S.",
    "Stephenson, Max O. Jr."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:13:37Z",
  "date_adate": "2005-07-20",
  "date_available": "2014-03-14T20:13:37Z",
  "date_issued": "2005-06-13",
  "date_rdate": "2007-07-20",
  "date_sdate": "2005-06-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Interorganizational arrangements, such as partnerships between non-governmental organizations (NGOs) and governmental organizations (GOs), are increasingly regarded by policymakers as critical to effective social sector development.  This is particularly true in the arena of housing provision for residents of slums and squatter settlements.   The recent pursuit of collaboration between NGOs and government housing agencies in large urban agglomerations such as Mumbai, India marks a significant shift from the adversarial climate that previously characterized NGO-GO interactions. In other words, NGOs engaged in housing issues appear to be evolving from ''housing rights advocates'' to ''housing developers''. However, very little research has examined the struggles and pressures facing organizations as they travel from confrontational to collaborative relationships. This dissertation provides an empirical and theoretical basis for examining the evolution of NGO-GO relationships over time and, in doing so, links research on urban political economy of housing to research on organizational life cycles and strategic institutional change.</p><p>  Two questions are central to the dissertation: 1) How do shifts in state housing policies influence the strategies pursued by advocacy NGOs in housing the poor? 2) What are the factors that influence the emergence and sustenance of NGO-government housing partnerships? To address these, I use a multiple-case study analysis of critical incidents in the history (from 1981 to 2003) of three NGOs in Mumbai: Nivara Hakk Suraksha Samiti, Youth for Unity and Voluntary Action, and Society for the Promotion of Area Resource Centres. In addition, I examine five state and city level housing authorities. The dissertation's findings address three broad themes of literature: i) NGO-GO Interaction Styles; ii) Institutional Isomorphism; and, iii) NGO Development Continuum.  Findings related to these broad streams of literature suggest that NGO behavior is shaped both by public policy orientation and by internal strategies and decisions. In efforts to gain and retain legitimacy, NGOs will likely use multiple interaction styles both simultaneously and sequentially. Analysis of internal institutional processes in NGOs suggests that organizational responses to isomorphic demands are circumscribed by path-dependent factors and the variability in NGO resource environments.  NGO development strategies have evolved towards greater complexity and sophistication.</p>",
  "description_provenance": [
    "Author Email: ramya@vt.edu",
    "Advisor Email: bobdyck@vt.edu",
    "Advisor Email: aebrahim@vt.edu",
    "Advisor Email: tkoebel@vt.edu",
    "Advisor Email: scarp@vt.edu",
    "Advisor Email: jcarmin@mit.edu",
    "Advisor Email: mstephen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:37Z (GMT). No. of bitstreams: 1 RamyaRamanathDissertation.pdf: 4406383 bytes, checksum: fa8313b0f2d83e3ce3ab70fd8f106148 (MD5)   Previous issue date: 2005-06-13"
  ],
  "handle": "28167",
  "identifier_other": "etd-06302005-000157",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06302005-000157/",
  "identifier_uri": "http://hdl.handle.net/10919/28167",
  "publisher": "Virginia Tech",
  "relation_haspart": "RamyaRamanathDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Slum and Squatter Housing",
    "Strategies and Tactics",
    "Government",
    "Collaboration",
    "India",
    "Nongovernmental Organizations"
  ],
  "title": "From Conflict to Collaboration: Nongovernmental Organizations and their Negotiations for Local Control of Slum and Squatter Housing in Mumbai, India",
  "type": "Dissertation"
}