{
  "contributor_author": "Chu, Kay Hei-Lin",
  "contributor_committeechair": "Murrmann, Suzanne K.",
  "contributor_committeemember": [
    "Williams, John A.",
    "Weaver, Pamela A.",
    "Singh, Kusum",
    "Murrmann, Kent F."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:13:37Z",
  "date_adate": "2002-07-01",
  "date_available": "2014-03-14T20:13:37Z",
  "date_issued": "2002-05-23",
  "date_rdate": "2003-07-01",
  "date_sdate": "2002-06-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Emotional labor can be defined as the degree of manipulation of one¡¯s inner feelings or outward behavior to display the appropriate emotion in response to display rules or occupational norms.  This study concerns the development of an emotional labor model for the hospitality industry that aims at identifying the antecedents and consequences of emotional labor.  The study investigates the impact of individual characteristics on the way emotional labor is performed; it investigates the relationships among the different ways of enacting emotional labor and their consequences, and addresses the question of whether organizational characteristics and job characteristics have buffering effects on the perceived consequences of emotional labor, which are emotional exhaustion and job satisfaction.   This study involves the rigorous development of a 10 item scale, the Hospitality Emotional Labor Scale, to measure the emotional labor that employees perform.  the results of the study conformed to a two-factor structure of emotional labor: emotive dissonance and emotive effort.  these two dimensions tap three types of service-acting that employees perform: surface acting, deep acting, and genuine acting. The scale was used to survey 285 hotel employees. Structural equation modeling (SEM) and moderated multiple regression (MMR) were employed to examine the proposed model, as well as to test the hypotheses.  It was found that both surface acting (high emotive dissonance) and deep acting (emotive effort) associate positively with job satisfaction and negatively with emotional exhaustion.  Genuine acting (low emotive dissonance) was found to associate positively with emotional exhaustion and negatively with job satisfaction.  This study did not find strong relationships among the antecedents (affectivity and empathy) and emotional labor factors.  Similarly, the proposed moderators (job autonomy and social support) were not found to moderate the relations between emotional labor and its consequences. In sum, this study found that both deep acting and surface acting lead to positive work outcomes, but genuine acting leads to negative work outcomes. The results provide support for prior qualitative studies.  Further, deep acting plays an important role in determining employees¡¯ work outcomes.  Based on these significant research findings, detailed theoretical and practical implications were discussed.",
  "description_provenance": [
    "Author Email: hchu@vt.edu",
    "Advisor Email: jawillo6@vt.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: weaver@vt.edu",
    "Advisor Email: kusingh@vt.edu",
    "Advisor Email: murrmann@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:37Z (GMT). No. of bitstreams: 1 Chuetd.pdf: 442683 bytes, checksum: e45fde8780b1175af7178bb9cfa97897 (MD5)   Previous issue date: 2002-05-23"
  ],
  "handle": "28164",
  "identifier_other": "etd-06302002-164031",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06302002-164031/",
  "identifier_uri": "http://hdl.handle.net/10919/28164",
  "publisher": "Virginia Tech",
  "relation_haspart": "Chuetd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Service Acting",
    "Work Outcomes",
    "Emotional Labor"
  ],
  "title": "The Effects of Emotional Labor on Employee Work Outcomes",
  "type": "Dissertation"
}