{
  "contributor_author": "Lowery, Lillian Margretta",
  "contributor_committeechair": "Crockett, Jean B.",
  "contributor_committeemember": [
    "Farling, Alice",
    "Sughrue, Jennifer A.",
    "Parson, Stephen R.",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:13:37Z",
  "date_adate": "2003-07-22",
  "date_available": "2014-03-14T20:13:37Z",
  "date_issued": "2003-06-03",
  "date_rdate": "2003-07-22",
  "date_sdate": "2003-06-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Instructional Strategies and Practices Used to Enhance Student Success in the High School Algebra I Inclusive Classroom   Lillian M. Lowery  Dr. Jean B. Crockett, Chair (ABSTRACT) The purpose of this qualitative study was to examine the instructional conditions and practices described as successful for teachers in the Algebra I inclusive classroom. In the southeastern suburban school district used for this study, students who began their freshman year of high school in fiscal year 2000 faced new mathematics requirements for high school graduation, including taking Algebra I and passing an Algebra I end-of-course standards-based test. The new mathematics requirements presented a daunting challenge to general and special educators as increasing numbers of students with disabilities began to receive their instruction in the general education classroom. This school district targeted schools based on student performance on standards-based end-of-course tests and provided extra support and resources to enhance teaching and learning; however, other schools in the district had to reach the same goal -- improved student achievement -- without the extra resources.  Based on a comparative case study of three separate inclusive classrooms from three separate schools, findings were presented through a discussion of the theoretical framework. The theoretical framework for this study included theories from Skinner (1953) and Gagné (1985). Data were collected through interviews with teachers and their students with and without disabilities, through observations in classrooms, and by review of student data. Four major domains were addressed in this study. Those domains included instructional conditions, climate and planning, and instructional interventions, the use of time and teacher adaptations and accommodations. This study supported the notion that an affective classroom climate coupled with collaborative planning among team teachers, general educators and special educators who co-teach in the inclusive classroom, promotes an instructional environment conducive to learning. The effective use of time along with teacher adaptations and accommodations appeared to keep students engaged in the learning process. However, other influences, including insufficient teacher training, negative student behaviors, and inappropriate student placement, were found to affect student achievement in the inclusive classroom.",
  "description_provenance": [
    "Author Email: lillian.lowery@fwcs.k12.in.us",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: alice.farling@fcps.edu",
    "Advisor Email: jsugh@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:37Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 783299 bytes, checksum: 49dd8f9e575dc4ba7a3aed11ab7aae01 (MD5)   Previous issue date: 2003-06-03"
  ],
  "handle": "28165",
  "identifier_other": "etd-06302003-161219",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06302003-161219/",
  "identifier_uri": "http://hdl.handle.net/10919/28165",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Inclusion",
    "Instructional Strategies",
    "Disabilities",
    "Algebra I"
  ],
  "title": "Instructional Strategies and Practices Used to Enhance Student Success in the High School Algebra I Inclusive Classroom",
  "type": "Dissertation"
}