{
  "contributor_author": "Agnich, Laura Elizabeth",
  "contributor_committeecochair": [
    "Hawdon, James E.",
    "Miyazaki, Yasuo"
  ],
  "contributor_committeemember": [
    "Ryan, John W.",
    "Fuller, Theodore D.",
    "Zhu, Haiyan"
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:13:36Z",
  "date_adate": "2011-07-21",
  "date_available": "2014-03-14T20:13:36Z",
  "date_issued": "2011-05-11",
  "date_rdate": "2011-07-21",
  "date_sdate": "2011-06-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examines the predictors of school violence cross-nationally, testing the applicability of criminological theories of adult violence to violence in the school setting.  Using hierarchical linear modeling (HLM), a method of multi-level linear analysis, of the 2007 Trends in International Math and Science Studies (TIMSS) data augmented with data from UN Human Development Reports, UN Demographic Yearbook, CIA World Factbook and the World Health Organization Mortality Database, I determine the predictors of school violence at the school and national levels to determine what variables account for cross-national variation in the level of school violence.  Hierarchical linear modeling (HLM) takes into account the structure of nested data, and this study examines schools nested within nations.  The relationships between school and national level inequalities, social disorganization, institutional anomie, social support, resource deprivation theories and school violence are tested.  Violence is operationally defined as a continuum of aggression ranging from non-physical to physical (see Yu 2003), incorporating low-level as well as more serious forms of interpersonal violence.  I find that measures of social disorganization, institutional anomie and resource deprivation at both the school and national levels predict higher levels of violence within schools.  Surprisingly, homogeneity rather than heterogeneity is a significant predictor of physical bullying. In addition, math achievement and achievement score variation significantly predict the level of school violence cross-nationally.  At the national level, placing too much emphasis on studentsâ   achievement on standardized tests may inadvertently create a culture conducive to school violence.  Emphasizing a diverse range of ways to measure studentsâ   achievement other than standardized testing may reduce the likelihood that students experience strain and engage in violent behavior at school.  This research is the first to use multi-level linear analysis to discern the school and national level predictors of school violence.",
  "description_provenance": [
    "Author Email: lagnich@gmail.com",
    "Advisor Email: hawdonj@vt.edu",
    "Advisor Email: yasuom@vt.edu",
    "Advisor Email: johnryan@vt.edu",
    "Advisor Email: fullertd@vt.edu",
    "Advisor Email: zhu09@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:36Z (GMT). No. of bitstreams: 1 Agnich_LE_D_2011.pdf: 2807140 bytes, checksum: 30eb83a02669979e45db0c86483727eb (MD5)   Previous issue date: 2011-05-11"
  ],
  "handle": "28160",
  "identifier_other": "etd-06292011-114002",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06292011-114002/",
  "identifier_uri": "http://hdl.handle.net/10919/28160",
  "publisher": "Virginia Tech",
  "relation_haspart": "Agnich_LE_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "School Violence; Student Victimization; Student Ac",
  "title": "A Cross-National Study of School Violence",
  "type": "Dissertation"
}