{
  "contributor_author": "Leartsakulpanich, Ubolsree",
  "contributor_committeechair": "Ferry, James G.",
  "contributor_committeemember": [
    "White, Robert H.",
    "Dean, Dennis R.",
    "Larson, Timothy J.",
    "Gregory, Eugene M.",
    "Hess, John L."
  ],
  "contributor_department": "Biochemistry and Anaerobic Microbiology",
  "date_accessioned": "2014-03-14T20:13:36Z",
  "date_adate": "1999-06-30",
  "date_available": "2014-03-14T20:13:36Z",
  "date_issued": "1999-06-11",
  "date_rdate": "2000-06-30",
  "date_sdate": "1999-06-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT  The iron-sulfur flavoprotein (Isf) from the acetate utilizing methanoarchaeon Methanosarcina thermophila was heterologously produced in Escherichia coli, purified to homogeneity, and characterized to determine the properties of the iron-sulfur cluster  and FMN.  Chemical and spectroscopic analyses indicated that Isf contained one 4Fe-4S cluster and one FMN per monomer.  The midpoint potentials of the [4Fe-4S]2+/1+ center and FMN/FMNH2 redox couple were -394 and -277 mV respectively.  The deduced amino acid sequence of Isf revealed high identity with Isf homologues from the CO2 reducing methanoarchaea Methanococcus jannaschii and Methanobacterium thermoautotrophicum.  Extracts of H2-CO2-grown M. thermoautotrophicum cells were able to reduce Isf from M. thermophila using either H2 or CO as the reductant.  Addition of ferredoxin A to the reaction further stimulated the rate of Isf reduction.  These results suggest that Isf homologues are coupled to ferredoxin in electron transfer chains in methanoarchaea with diverse metabolic pathways.  Reconstituted systems containing carbon monoxide dehydrogenase/acetyl-CoA synthase complex (CODH/ACS), ferredoxin A, Isf, and the designated electron carriers (NAD, NADP, F420, and 2-hydroxyphenazine) were used in an attempt to determine the electron acceptor for Isf.  Isf was unable to reduce any of these compounds.  Furthermore, 2-hydroxyphenazine competed with Isf to accept electrons from ferredoxin A indicating that ferredoxin A is a more favorable electron partner for 2-hydroxyphenazine.  Thus, the physiological electron acceptor for Isf is unknown.  Amino acid sequence alignment of Isf sequences revealed a conserved atypical cysteine motif with the potential to ligate the 4Fe-4S cluster.  Site-directed mutagenesis of the cysteine residues in this motif, and the two additional cysteines in the sequence, was used to investigate these cysteine residue as ligands for coordinating the 4Fe-4S center of Isf.  Spectroscopic and biochemical analyses were consistent with the conserved cysteine motif functioning as ligating the 4Fe-4S center.  Redox properties of the 4Fe-4S and FMN centers revealed a role for the 4Fe-4S center in the transfer of electrons from ferredoxin A to FMN.",
  "description_provenance": [
    "Author Email: uxl3@psu.edu",
    "Advisor Email: rhwhite@vt.edu",
    "Advisor Email: deandr@vt.edu",
    "Advisor Email: tilarson@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Advisor Email: jlhess@vt.edu",
    "Advisor Email: jgf3@psu.edu",
    "Made available in DSpace on 2014-03-14T20:13:36Z (GMT). No. of bitstreams: 1 ulthesis.pdf: 1833375 bytes, checksum: e4547a75f60d510154e59ffa7719d550 (MD5)   Previous issue date: 1999-06-11"
  ],
  "handle": "28161",
  "identifier_other": "etd-062999-160810",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-062999-160810/",
  "identifier_uri": "http://hdl.handle.net/10919/28161",
  "publisher": "Virginia Tech",
  "relation_haspart": "ulthesis.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Iron-sulfur flavoprotein",
    "Methanosarcina thermophila"
  ],
  "title": "Biochemical characterization of a novel iron-sulfur flavoprotein from Methanosarcina thermophila strain TM-1",
  "type": "Dissertation"
}