{
  "contributor_author": "Scrittore, Joseph",
  "contributor_committeechair": "Thole, Karen A.",
  "contributor_committeemember": [
    "Diller, Thomas E.",
    "Ng, Fai",
    "Vlachos, Pavlos P.",
    "Burd, Steven W."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:13:38Z",
  "date_adate": "2008-07-24",
  "date_available": "2014-03-14T20:13:38Z",
  "date_issued": "2008-06-27",
  "date_rdate": "2009-07-24",
  "date_sdate": "2008-06-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Cooling combustor chambers for gas turbine engines is challenging because of the complex flow fields inherent to this engine component.  This complexity, in part, arises from the interaction of high momentum dilution jets required to mix the fuel with effusion film cooling jets that are intended to cool the combustor walls.  The dilution and film cooling flow have different performance criteria, often resulting in conflicting flow mechanisms.   The purpose of this study is to evaluate the influence that the dilution jets have on the film cooling effectiveness and how the flow and thermal patterns in the cooling layer are affected by both the dilution flow and the closely spaced film cooling holes.  This study also intends to characterize the development of the flow field created by effusion cooling injection without dilution injection.  This work is unique because it allows insight into how the full-coverage discrete film cooling layer is interrupted by high momentum dilution jets and how the surface cooling is affected. The film cooling flow was disrupted along the combustor walls in the vicinity of the high momentum dilution jets and the surface cooling effectiveness was reduced with increased dilution jet momentum.  This was due to the secondary flows that were intensified by the increased jet momentum.  High turbulence levels were generated at the dilution jet shear layer resulting in efficient mixing.  The film cooling flow field was affected by the freestream turbulence and complex flow fields created by the combined dilution and effusion cooling flows both in the near dilution jet region as well as downstream of the jets.  Effusion cooling holes inclined at 20Ë  created lower coolant layer turbulence levels and higher surface cooling effectiveness than 30Ë  cooling holes.  Results showed an insensitivity of the coolant penetration height to the diameter and angle of the cooling hole in the region downstream of the dilution mixing jets.  When high momentum dilution jets were injected into crossflow, a localized region in the flow of high vorticity and high streamwise velocity was created.  When film cooling air was injected the inlet flow field and the dilution jet wake were fundamentally changed and the vortex diminished significantly.  The temperature field downstream of the dilution jet showed evidence of a hot region which was moderated appreciably by film cooling flow.  Differences in the temperature fields were nominal compared to the large mass flow increase of the coolant. A study of streamwise oriented effusion film cooling flow without dilution injection revealed unique and scaleable velocity profiles created by the closely spaced effusion holes.  The effusion cooling considered in these tests resulted in streamwise velocity and turbulence level profiles that scaled well with blowing ratio which is a finding that allows the profile shape and magnitude to be readily determined at these test conditions.  Results from a study of compound angle effusion cooling injection showed significant differences between the flow field created with and without crossflow.  It was found from the angle of the flow field velocity vectors that the cooling film layer grew nearly linearly in the streamwise direction.  The absence of crossflow resulted in higher turbulence levels because there was a larger shear stress due to a larger velocity difference between the coolant and crossflow.  The penetration height of the coolant was relatively independent of the film cooling momentum flux ratio for both streamwise oriented and compound angle cooling jets.",
  "description_provenance": [
    "Author Email: jscritto@vt.edu",
    "Advisor Email: kthole@engr.psu.edu",
    "Advisor Email: tdiller@vt.edu",
    "Advisor Email: wng@vt.edu",
    "Advisor Email: pvlachos@vt.edu",
    "Advisor Email: steven.burd@pw.utc.com",
    "Made available in DSpace on 2014-03-14T20:13:38Z (GMT). No. of bitstreams: 1 Dissertation-Scrittore.pdf: 4757296 bytes, checksum: 3887685ffab3d71e007deb912dbcb884 (MD5)   Previous issue date: 2008-06-27"
  ],
  "handle": "28171",
  "identifier_other": "etd-06302008-152132",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06302008-152132/",
  "identifier_uri": "http://hdl.handle.net/10919/28171",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-Scrittore.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Gas turbine",
    "combustor",
    "film cooling"
  ],
  "title": "Experimental Study of the Effect of Dilution Jets on Film Cooling Flow in a Gas Turbine Combustor",
  "type": "Dissertation"
}