{
  "contributor_author": "Hardebeck, Mary Ann",
  "contributor_committeechair": "Curcio, Joan L.",
  "contributor_committeemember": [
    "Lichtman, Marilyn V.",
    "McGrady, Harold J.",
    "Houston, Paul D.",
    "Alexander, M. David"
  ],
  "contributor_department": "Educational Administration",
  "date_accessioned": "2014-03-14T20:13:38Z",
  "date_adate": "1998-01-07",
  "date_available": "2014-03-14T20:13:38Z",
  "date_issued": "1997-12-10",
  "date_rdate": "1998-01-07",
  "date_sdate": "1997-12-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to explore through qualitative inquiry the views of selected superintendents about administrative issues involving school-linked service integration.  Research questions for the study included (1) What views emerge when superintendents discuss school-linked service integration? (2) What aspects of school-linked service integration do superintendents identify as most beneficial? (3) What administrative issues of school-linked service integration do superintendents identify as most challenging?  (4) What aspects of background, experience, or educational philosophy emerge when superintendents describe their views about administrative issues of school-linked service integration?   \tThe study was exploratory and followed an iterative or self-correcting design.  Nine superintendents were selected through expert nomination.  Superintendents represented small, medium, and large school districts to allow exploration of possible differences and similarities within divergent settings.  The superintendents were interviewed using standardized open-ended interviews.  Categorical coding and examination of emerging patterns were employed as primary modes of data analysis.  \tThe findings suggest that the superintendents in this study viewed school-linked service integration as schools and community agencies working in partnerships to provide a variety of services for the community and its children.  According to the superintendents, these partnerships were beneficial when they lent support to the school창  s academic mission and enhanced the school district창  s financial capacity to meet the needs of its students.  Participation in such partnerships was seen as labor-intensive.  The amount of time required to alter operational procedures, to negotiate resource sharing, and to build trust among the participants was identified as the most challenging aspect of school-linked service integration.  Consequently, these superintendents characterized their role in school-linked service integration as being either one of a developer or a facilitator.  The superintendents viewed their primary role as one of implementing the policy of the school board.  Incorporated into each one of the superintendents창   educational philosophies was a belief about the superintendent창  s accountability to promote improved student achievement.",
  "description_provenance": [
    "Author Email: mhardebe@pen.k12.va.us",
    "Advisor Email: jcurcio@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:38Z (GMT). No. of bitstreams: 2 hardebeck_front_20matter.pdf: 8781 bytes, checksum: 35333c1d112f461f3178f26465c22649 (MD5) hardebeck_1-_205.pdf: 211614 bytes, checksum: 2b058874cabc14cc08eca232fb1ed76f (MD5)   Previous issue date: 1997-12-10"
  ],
  "handle": "28174",
  "identifier_other": "etd-0698-1946",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-0698-1946/",
  "identifier_uri": "http://hdl.handle.net/10919/28174",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "hardebeck_front_20matter.pdf",
    "hardebeck_1-_205.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "administration",
    "leadership",
    "school-linked services",
    "superintendents"
  ],
  "title": "School-Linked Service Integration and School District Superintendents",
  "type": "Dissertation"
}