{
  "contributor_author": "Swab, A. Geoffrey",
  "contributor_committeechair": "Sanders, Mark E.",
  "contributor_committeemember": [
    "Burton, John K.",
    "Goff, Richard M.",
    "Wells, John G."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:13:38Z",
  "date_adate": "2012-07-19",
  "date_available": "2014-03-14T20:13:38Z",
  "date_issued": "2012-06-26",
  "date_rdate": "2012-07-19",
  "date_sdate": "2012-06-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This study of cooperative learning in post-secondary engineering education investigated achievement of engineering students enrolled in two intact sections of a computer-aided drafting (CAD) course. Quasi-experimental and qualitative methods were employed in comparing student achievement resulting from out-of-class cooperative and individualistic learning structures. The research design was a counterbalanced, repeated measures, nonequivalent control group design. During the first half of the semester, one course section served as the experimental group (cooperative learning) and the other section served as the control group (individualistic learning). During the second half of the semester, the treatment and control conditions were switched to the other section. Data collection involved a pretest, a mid-term exam, a final exam, weekly homework drawing grades, an introductory demographic survey, weekly peer reviews, and interviews.</p>  <p>The data analyses showed that the differences between the treatment and control group means on the mid-term and final exams were not significant. However, the treatment group means on the weekly homework drawings were significantly higher than those for the control group in each half of the semester. The data revealed main effects of race, prior experience, time of achievement test administration, and prerequisite grade. A post-hoc analysis did not show significant differences among the various levels of prerequisite grade. Also, there were first-order interactions for gender-by-time, experience-by-time, method-by-time for the year as engineering major demographic variable, and method-by-academic year. Qualitative data revealed that most participants had positive group experiences, more participants preferred working in cooperative groups during more difficult activities than introductory material, academically stronger participants might have â  carriedâ   weaker participants in the cooperative groups, and there were times identified for cooperative group work during which groups did not work cooperatively.</p>  <p>Based upon the findings in this study, one might reasonably conclude that cooperative and individualistic learning structures result in approximately equal student achievement. Thus, when deciding on the use of one learning structure over the other, instructors might focus on which approach seems more appropriate/practical for a particular instructional activity.</p>",
  "description_provenance": [
    "Author Email: swab@vt.edu",
    "Advisor Email: msanders@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: richgoff@vt.edu",
    "Advisor Email: jgwells@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:38Z (GMT). No. of bitstreams: 1 Swab_AG_D_2012.pdf: 5981270 bytes, checksum: 416905a86b85511b2958b732fedfff23 (MD5)   Previous issue date: 2012-06-26"
  ],
  "handle": "28172",
  "identifier_other": "etd-06302012-162750",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-06302012-162750/",
  "identifier_uri": "http://hdl.handle.net/10919/28172",
  "publisher": "Virginia Tech",
  "relation_haspart": "Swab_AG_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "CAD",
    "Cooperative Learning",
    "Engineering Education",
    "Achievement"
  ],
  "title": "The Effects of Cooperative and Individualistic Learning Structures on Achievement in a College-level Computer-aided Drafting Course",
  "type": "Dissertation"
}