{
  "contributor_author": "Passek, Kelly Marie",
  "contributor_committeechair": "Jenssen, Thomas A.",
  "contributor_committeemember": [
    "Walters, Jeffrey R.",
    "Siegel, Paul B.",
    "Saacke, Richard G.",
    "Turner, Bruce J."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:13:39Z",
  "date_adate": "2002-07-15",
  "date_available": "2014-03-14T20:13:39Z",
  "date_issued": "2002-05-07",
  "date_rdate": "2003-07-15",
  "date_sdate": "2002-07-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Mate competition is a prominent component of sexual selection theory. Typically, males attempt to mate with the most females possible and females attempt to mate with the highest quality males possible. In the polygynous female-defense mating system of Anolis carolinensis, males compete directly for females through territorial behavior. Inter-male competition is intense due to an average polygyny ratio of 1 male to 3 females despite a 1:1 adult sex ratio. Through high levels of territorial behavior (e.g., 100 displays/h, 27 m patrol distances/h, 70% of day in defense-related activities), males attempt to exclude other males from resident females who, in turn, both store sperm and ovulate a single-egg clutch at weekly intervals over a 4-month breeding season. Paternity of hatchlings in 16 naturally occurring breeding groups was analyzed to determine the extent to which the territorial resident male was able to prevent other males from fathering offspring of his resident females. Lizards residing in or neighboring a resident maleâ  s territory were collected and RAPD-PCR was used to determine the paternity of hatchlings. Of the 48 hatchlings from 26 females, resident territorial males fathered 52% of hatchlings; 15% were fathered by a male whose territory bordered that of the resident male and 21% were fathered by a smaller male living covertly within the resident maleâ  s territory. Paternity for the remaining 12% of hatchlings belonged to an unsampled male. Given that females mated with multiple males, laboratory-based controlled matings were conducted where females were sequentially paired with two males and RAPD-PCR was used to analyze which of the two males fathered the subsequent hatchlings to determine the mechanism of sperm precedence. Regardless of mating order, only one male of the pair fertilized the eggs. Male A. carolinensis have reproductive strategies present in addition to defending resident females and female A. carolinensis have options in addition to simply mating with the resident male. While sperm precedence is present in this species, it is not based on mating order, but may involve both the number of sperm deposited in the femaleâ  s tract as well as the quality of those sperm.",
  "description_provenance": [
    "Author Email: kpassek@vt.edu",
    "Advisor Email: tjenssen@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: pbsiegel@vt.edu",
    "Advisor Email: saacke@vt.edu",
    "Advisor Email: fishgen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:39Z (GMT). No. of bitstreams: 1 PassekETD.pdf: 17792224 bytes, checksum: 9f96623359e12f50b35c6152a7ac2256 (MD5)   Previous issue date: 2002-05-07"
  ],
  "handle": "28177",
  "identifier_other": "etd-07012002-124648",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07012002-124648/",
  "identifier_uri": "http://hdl.handle.net/10919/28177",
  "publisher": "Virginia Tech",
  "relation_haspart": "PassekETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "lizard",
    "sperm precedence",
    "RAPD-PCR",
    "paternity",
    "sexual selection"
  ],
  "title": "Extra-pair paternity within the female-defense polygyny of the lizard, Anolis carolinensis: Evidence of alternative mating strategies",
  "type": "Dissertation"
}