{
  "contributor_author": "Ward, Robert  C. Jr.",
  "contributor_committeechair": "Wamsley, Gary L.",
  "contributor_committeemember": [
    "White, Orion F. Jr.",
    "Neves, Carole",
    "Colvard, James E.",
    "Rees, Joseph V."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:13:38Z",
  "date_adate": "1998-01-06",
  "date_available": "2014-03-14T20:13:38Z",
  "date_issued": "1997-10-27",
  "date_rdate": "1999-01-06",
  "date_sdate": "1997-10-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Chaos of Convergence: A Study of Decay, Change, and Transformation Within the Telephone Policy Subsystem of the United States  <p>  Robert C. Ward  <p>  This dissertation was developed as two distinct themes within one final study. The first theme is located within Chapter 2 and Chapter 3. These two chapters examine the nature of both policy analysis and organizational theory in terms of their development within the American versions of Public Administration and Political Science. I conclude that the distinctions that have been created between the two areas of research are false, and that within the basic structure of American political theory both policy development and administrative implementation are a single unified endeavor. I then propose that Anthony Giddens Theory of Structuration offers both policy analysis and organizational theory  a meta-theory that would allow for both areas of research to be reconnected. Various policy and organizational analysis models are examined, and alterations in these models are suggested to comply with the basic concepts of Giddens Theory of Structuration. A final model of analysis is presented which incorporates elements from these various models, and allows for the examination of the overall operation of a policy subsystem in terms of both policy analysis and organizational theory.  <p>  The second theme is located within Chapters 4 through 10. The analytical model that was created in the first theme is applied it to a specific policy subsystem, namely the wire-based telecommunications industry of the United States. The relationship between the industry and government is examined from its original inception to the implementation of the Telecommunications Deregulation Act of 1996. Seven distinct periods of development are analyzed. Each period of analysis seeks to locate the basic underlying structural principles forming the foundations for decisions in both the private and public sectors, and the processes for adaptation and adjustment. The examination of the processes engaged in the various periods supports the conclusion reached in the original analytical model, namely that political and administrative interaction are in fact linked, forming a unified process. A single underlying structural principle is located that has formed the basis for the policy subsystems existence, namely the concept of Compound Federalism as originally envisioned by the Republic's Founding Fathers.",
  "description_provenance": [
    "Author Email: rcward@unix1.lsu.edu",
    "Advisor Email: wamsley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:38Z (GMT). No. of bitstreams: 15 etd.pdf: 18595 bytes, checksum: 2534d5e0c2a221360d7207eb181b7b18 (MD5) Intro.pdf: 13492 bytes, checksum: 27cd432c9de78524bd089530e67dba3d (MD5) ch1.pdf: 248022 bytes, checksum: 1ad05e6ee8a32cf9a784518bd46c7fbf (MD5) ch2.pdf: 96143 bytes, checksum: 1109ffe11adfabeca3fc1499e8a8f05d (MD5) ch3.pdf: 80675 bytes, checksum: d41c3eea83c4f189832e630f25ccb81e (MD5) ch4.pdf: 134937 bytes, checksum: bce81fb63909c42cea099709f48859d7 (MD5) ch5.pdf: 84766 bytes, checksum: f86bdc581e49567ea9784518e893b91a (MD5) ch6.pdf: 157891 bytes, checksum: cad726b1bcd52693fe27e28fb80a8543 (MD5) ch7.pdf: 116145 bytes, checksum: 61c8280b3efe88fcbe99bd79a0f742b2 (MD5) ch8.pdf: 269258 bytes, checksum: af1ccad39d82bcbbebab05a82e52fbbc (MD5) ch9.pdf: 552476 bytes, checksum: 5b605fc917bc97fbd5c8f26f711179e5 (MD5) ch10.pdf: 100471 bytes, checksum: ec7d98334b4afe2ccfbb6ae1e7a79b52 (MD5) ch11.pdf: 37244 bytes, checksum: dd35f4e2c5adfb57ad52296891dd6af9 (MD5) bib.pdf: 306788 bytes, checksum: 9a4435543f4790683589dda1e46ce268 (MD5) vita.pdf: 12849 bytes, checksum: 47dd709df7f4f1c8ad022d12414cfacc (MD5)   Previous issue date: 1997-10-27"
  ],
  "handle": "28175",
  "identifier_other": "etd-0698-91234",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-0698-91234/",
  "identifier_uri": "http://hdl.handle.net/10919/28175",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etd.pdf",
    "Intro.pdf",
    "ch1.pdf",
    "ch2.pdf",
    "ch3.pdf",
    "ch4.pdf",
    "ch5.pdf",
    "ch6.pdf",
    "ch7.pdf",
    "ch8.pdf",
    "ch9.pdf",
    "ch10.pdf",
    "ch11.pdf",
    "bib.pdf",
    "vita.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "structuration theory",
    "neo-institutionalism",
    "telecommunications",
    "policy analysis",
    "policy subsystem"
  ],
  "title": "The Chaos of Covergence: A Study of the Process of Decay, Change, and Transformation within the Telephone Policy Subsystem of the United States",
  "type": "Dissertation"
}