{
  "contributor_author": "Cyterski, Michael John",
  "contributor_committeechair": "Ney, John J.",
  "contributor_committeemember": [
    "Berkson, James M.",
    "Coakley, Clint W.",
    "Orth, Donald J.",
    "Murphy, Brian R."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:13:41Z",
  "date_adate": "1999-07-08",
  "date_available": "2014-03-14T20:13:41Z",
  "date_issued": "1999-06-08",
  "date_rdate": "2000-07-08",
  "date_sdate": "1999-07-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This investigation examined the adequacy of the forage base to meet current demand of piscivores in Smith Mountain Lake, Virginia.  Surplus production, or the maximum sustainable supply, of alewife (Alosa pseudoharengus) and gizzard shad (Dorosoma cepedianum) were determined using data on the biomass, growth, and mortality of each species.  Mean hydroacoustic alewife biomass from 1993-1998 was 37 kg/ha and mean gizzard shad cove rotenone biomass from 1990-1997 was 112 kg/ha.  Mean annual alewife surplus production was determined to be 73 kg/ha and mean annual gizzard shad surplus production totaled 146 kg/ha.  <P>Bioenergetics modeling and population density estimates were utilized to derive the annual food consumption (realized demand) of the two most popular sport fish in the system, striped bass (Morone saxatilis) and largemouth bass (Micropterus salmoides).  The striped bass population consumed 46 kg/ha of alewife and 27 kg/ha of gizzard shad annually.  Largemouth bass ate 9 kg/ha of alewife and 15 kg/ha of gizzard shad annually.  Annual consumption by ancillary predators was estimated to be 13 kg/ha of alewife and 35 kg/ha of gizzard shad.  <P>Prey supply to predators is limited by morphology, behavior, and distribution.  The cumulative effect on prey availability of these three factors, in addition to consumption by other predators, was quantified.  For largemouth bass, available supply of alewife and gizzard shad exceeded demand by 20% and 53% respectively.  For striped bass, available supply of gizzard shad surpassed demand by 30% but available alewife supply was only 4% greater than demand.  Annual demand of all predators was 94% of total available clupeid supply.  <P>Striped bass stockings were increased by 50% in 1998 and will remain at this level in the near future.  A predator-prey simulation model of alewife and striped bass populations was developed to explore the consequences of increased predator demand.  This model incorporated dependencies between alewife abundance and mortality and the mortality, abundance, and growth of striped bass.  Model output showed that a 50% stocking increase has a near-zero probability of increasing the mean annual number of legal and citation striped bass in Smith Mountain Lake.",
  "description_provenance": [
    "Author Email: mikecy@vt.edu",
    "Advisor Email: jberkson@vt.edu",
    "Advisor Email: coakley@vt.edu",
    "Advisor Email: dorth@vt.edu",
    "Advisor Email: murphybr@vt.edu",
    "Advisor Email: jney@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:41Z (GMT). No. of bitstreams: 1 etd.pdf: 786253 bytes, checksum: 2223856d9c6dc40c5e406b38c54543ad (MD5)   Previous issue date: 1999-06-08"
  ],
  "handle": "28185",
  "identifier_other": "etd-070199-124017",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-070199-124017/",
  "identifier_uri": "http://hdl.handle.net/10919/28185",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Production",
    "Striped Bass",
    "Clupeids",
    "Bioenergetics",
    "Hydroacoustics"
  ],
  "title": "Analysis of the Trophic Support Capacity of Smith Mountain Lake, Virginia, for Piscivorous Fish",
  "type": "Dissertation"
}