{
  "contributor_author": "King, Marquea D.",
  "contributor_committeecochair": [
    "Lindsay, David S.",
    "Ehrich, Marion F."
  ],
  "contributor_committeemember": [
    "Helmy, Fatma",
    "Holladay, Steven D.",
    "Moore, David"
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:13:41Z",
  "date_adate": "2002-10-14",
  "date_available": "2014-03-14T20:13:41Z",
  "date_issued": "2002-06-21",
  "date_rdate": "2003-10-14",
  "date_sdate": "2002-07-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Toxoplasma gondii is a protozoan parasite that causes life-threatening disease in congenitally infected infants and immunocompromised patients, such as those inflicted with AIDS. Toxoplasmic encephalitis (TE) is a common presenting condition in an AIDS infection.  People become infected with T. gondii by ingesting tissue cysts in undercooked meats or by ingesting oocysts excreted by cats.  Methylmercury (MeHg) is a well-documented neurotoxicant that accumulates in the brain and causes severe mental and visual dysfunction, including chronic encephalopathy.  Consumption of contaminated fish, grains, and seeds are common sources of human exposure to methylmercury.       Studies from our laboratory suggest that oral exposure to a single high dose of 20 mg/kg MeHg does not increase the susceptibility to acute toxoplasmosis in CBA/J mice. Therefore, we further investigated endpoints associated with immunotoxicity and neurotoxicity in 6-week old, female CBA/J mice exposed to both MeHg and T. gondii during a chronic T. gondii infection. We examined both single and multiple doses of MeHg exposure in a chronic parasitic infection model. In the single high dose study, four groups of six-week-old, female CBA/J mice were either fed 25 T. gondii tissue cysts of the ME-49 strain or given vehicle. Six weeks later, two out of the four groups (T. gondii and vehicle control) were orally gavaged with a single dose of 20 mg/kg body weight of MeHg and sacrificed seven days post exposure. Experiments from the multiple MeHg dose study were performed under similar conditions with the same number of groups and dosed by oral gavage with 8 mg/kg body weight of MeHg on days 0, 2,4,7,10,13. These mice were sacrificed on day 17 or 18 after initiating MeHg exposure. Flow cytometry following exposure to a single dose of MeHg in mice with a chronic T. gondii infection revealed significant changes (P < 0.05) within the T cell subpopulation percentages caused by exposure to MeHg.  For example, the thymic CD4+CD8+ T cell subpopulations were increased (P <0.05). However, MeHg had no significant effect on the CD4+CD8-, CD4-CD8+, or non-T cell subpopulations in the spleen. Furthermore, MeHg increased splenic cellularity and spleen-to-body-weight ratios with or without a concurrent T. gondii infection.  MeHg also caused a significant decrease in mouse body weight. There was a significant (P <0.05) increase in brain tissue cyst counts within the group exposed to both MeHg and T. gondii (16 ± 4, mean ± SE, n=7) versus T. gondii alone (4 ± 1, n=8). Histopathological examination demonstrated that the brain was affected, as lesions, gliosis, and meningitis were notable in mice given T. gondii. Exposure of mice to multiple doses of MeHg also resulted in effects on the immune system of CBA/J mice with and without chronic toxoplasmosis. Total cellularity and numbers of CD4+CD8+, CD4+CD8-, CD4-CD8+, and CD4-CD8- T-cell subpopulations show a marked decrease in number in the thymus, while total cellularity was also decreased in the spleen following concurrent exposure to T. gondii and MeHg.  Flow cytometric examination of lymphocyte populations (CD4+ and CD8+ lymphocytes) in the spleen and thymus demonstrated differences from control in the groups exposed to T. gondii and MeHg.    Histopathological examination did not reveal any significant lesions.  The data from experiments in which single or multiple doses of MeHg were given to mice with a chronic T. gondii infection indicate that concurrent exposure, to both MeHg and T. gondii, dependent on dose and time of exposure had notable effects, especially on the immune system (Supported by NIH Grant F36GM20301).",
  "description_provenance": [
    "Author Email: making2@vt.edu, King.Marquea@epamail.epa.gov",
    "Advisor Email: fhelmy@dsc.edu",
    "Advisor Email: holladay@vt.edu",
    "Advisor Email: moored@vt.edu",
    "Advisor Email: lindsayd@vt.edu",
    "Advisor Email: marion@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:41Z (GMT). No. of bitstreams: 1 mdk1.pdf: 911528 bytes, checksum: 4f641a943105d9fcece2db2f408beafb (MD5)   Previous issue date: 2002-06-21"
  ],
  "handle": "28188",
  "identifier_other": "etd-07022002-152038",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07022002-152038/",
  "identifier_uri": "http://hdl.handle.net/10919/28188",
  "publisher": "Virginia Tech",
  "relation_haspart": "mdk1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Methylmercury",
    "Toxoplasma gondii",
    "apoptosis",
    "chronic infection"
  ],
  "title": "Effects of Methylmercury Exposure on the Immune and Neurological Responses of Mice to Toxoplasma gondii Infection",
  "type": "Dissertation"
}