{
  "contributor_author": "Cyriac, Joby",
  "contributor_committeechair": "Hanigan, Mark D.",
  "contributor_committeemember": [
    "Corl, Benjamin A.",
    "Pearson, Ronald E.",
    "Herbein, Joseph H. Jr.",
    "Firkins, Jeffrey L."
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:13:40Z",
  "date_adate": "2010-08-19",
  "date_available": "2014-03-14T20:13:40Z",
  "date_issued": "2009-09-16",
  "date_rdate": "2010-08-19",
  "date_sdate": "2010-07-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Lactating dairy cows convert 25 to 35% of intake N to milk N, and a part of the remaining N ends up in the environment, causing pollution. Dairy cows absorb amino acids available in the small intestine supplied mainly by digestion of microbial protein and ruminally undegraded feed protein (RUP). Ruminally degradable feed protein (RDP) is the major supplier of N for microbial protein synthesis. Most of the excess RDP will be degraded to ammonia and eliminated as urea in urine. Thus, avoiding excess RDP in dairy cattle diets is important in reducing environmental N pollution. The objectives of the work in this dissertation were to test the hypothesis that lactating dairy cows, when fed varying dietary RDP, can maintain feed intake, milk and milk protein yield, ruminal metabolism, passage of nutrients out of the rumen, and N excretion. \t<p>The first study investigated the effects of decreasing RDP in lactating dairy cow diets on feed intake, milk production and apparent N efficiency. Forty mid-lactation cows (36 Holstein and 4 Jersey Ã  Holstein cross-breds) were fed a diet containing 11.3% of diet dry matter (DM) as RDP for the first 28 d (covariate period). From d 29 to 47 (treatment period) cows were randomly assigned to 1 of 4 diets containing constant RUP (7.1% of DM) but 11.3, 10.1, 8.8, or 7.6% of DM as RDP. Reducing RDP in diets linearly decreased DM intake and tended to decrease milk yield. Milk protein, fat and lactose contents, milk protein yield, body weight, and plasma essential amino acids were unaffected by reduced dietary RDP. However, milk urea-N concentration and milk fat yield decreased linearly with reduced dietary RDP. The apparent efficiency of N utilization for milk N production increased linearly as dietary RDP was reduced. As RDP declined in diets, linear reductions in DM intake and milk production suggested that these cannot be maintained below NRC recommendations of RDP for cows in this study. <p> The aim of the second study was to test the hypothesis that decreasing dietary RDP in lactating dairy cow diets can maintain ruminal metabolism and flow of nutrients out of the rumen and reduce nitrogen excretion. This study was designed as a replicated Latin square with 4 periods of 21 d each. Four treatment diets containing decreasing RDP and constant RUP similar to the first study were used. Three ruminally and duodenally cannulated and 4 ruminally cannulated lactating Holstein cows were randomly assigned to one of the four dietary treatments. A double marker system with Co-EDTA and Yb-labeled forage as markers was used to determine ruminal outflows of nutrients from omasal samples and nutrients reaching the intestine from duodenal samples. Ruminal microbial protein flow was observed using <sup>15</sup>N as an external microbial marker. Feed intake, milk yield, milk composition, and urine and feces output were determined in the last week of each period. Ruminal fluid samples were taken 2 and 4 h after feeding to determine ruminal NH<sub>3</sub>-N and volatile fatty acid concentrations. Outflows of nutrients from the rumen were determined by analyzing omasal samples collected over a 24 h feeding cycle in the last week of each period. Reducing dietary RDP decreased protein intakes while DM and fiber intakes were unaffected. Ruminal NH<sub>3</sub>-N concentrations linearly declined and peptides and amino acids were unaffected with reduced dietary RDP. A trend for a linear decline in ruminal outflows of microbial N and total N was observed with decreasing dietary RDP. Ruminal volatile fatty acids concentrations were unaltered by feeding treatment diets. Ruminal outflows of DM and acid detergent and neutral detergent fibers were unaffected by treatments. Treatment diets did not have any effect on milk yield and milk composition. However, milk urea-N and milk fat yield decreased linearly with decreasing dietary RDP. Reducing dietary RDP did not affect milk and milk protein yields but did result in greater body protein mobilization. Fecal N output was unaffected however, urine volume and urine N output decreased linearly suggesting reduced environmental N pollution. There was a trend for a linear decrease in total body N balance, but no significant effects on calculated ruminal N balance as dietary RDP decreased. Linear reductions in microbial N leaving the rumen were due to decreased ruminal NH<sub>3</sub>-N as peptides plus amino acids and energy supply were unaffected. The linear reduction in milk production and microbial N flow in the first and second studies, respectively, did not support our hypothesis that lactating dairy cows can be fed dietary RDP below current NRC (2001) recommendations without affecting animal performance. The need to raise 15% more cows to alleviate the loss in production may nullify the advantage in reduced N output into the environment by cows fed lower dietary RDP.",
  "description_provenance": [
    "Author Email: jobyjct@hotmail.com",
    "Advisor Email: mhanigan@vt.edu",
    "Advisor Email: bcorl@vt.edu",
    "Advisor Email: rep@vt.edu",
    "Advisor Email: herbeinj@vt.edu",
    "Advisor Email: firkins.1@osu.edu",
    "Made available in DSpace on 2014-03-14T20:13:40Z (GMT). No. of bitstreams: 1 Cyriac_J_D_2009.pdf: 589590 bytes, checksum: ed2e1484cd3120a2f87d224b41b0dd3b (MD5)   Previous issue date: 2009-09-16"
  ],
  "handle": "28182",
  "identifier_other": "etd-07012010-173532",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07012010-173532/",
  "identifier_uri": "http://hdl.handle.net/10919/28182",
  "publisher": "Virginia Tech",
  "relation_haspart": "Cyriac_J_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ruminally degradable protein",
    "dairy cow",
    "nutrient flow"
  ],
  "title": "Lowering ruminally degradable protein in lacatating dairy cow diets",
  "type": "Dissertation"
}