{
  "contributor_author": "Chanchao, Chanpen",
  "contributor_committeechair": "Rutherford, Charles L.",
  "contributor_committeemember": [
    "Lederman, Muriel L.",
    "Esen, Asim",
    "Claus, G. William",
    "Stevens, Ann M."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:13:40Z",
  "date_adate": "1999-07-03",
  "date_available": "2014-03-14T20:13:40Z",
  "date_issued": "1999-06-28",
  "date_rdate": "2000-07-03",
  "date_sdate": "1999-07-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Role of 5<sup>â  </sup> Nucleotidase in the Regulation of  Morphogenesis in <i>Dictyostelium</i> Chanpen Chanchao (ABSTRACT) \t \t5<sup>â  </sup> Nucleotidase (5NU) in <i>Dictyostelium discoideum</i> is an enzyme that shows high substrate specificity to 5<sup>â  </sup>AMP. The enzyme has received considerable attention in the past because of the critical role played by cyclic AMP in cell differentiation in this organism.  Degradation of cAMP by cAMP phosphodiesterase (PDE) produces 5<sup>â  </sup>AMP, the substrate of 5NU. Dictyostelium switches its genetic program from growth to cellular differentiation when nutrients become limited.  During the time course of development,  the activity of 5NU is high and becomes restricted to a narrow band of cells that form the interface between the prestalk/prespore zones.  Understanding how this gene is regulated will provide knowledge underlying the process of cell differentiation.  In order to understand the functional significance of the 5NU,  I first purified of the 5NU protein using an artificial substrate p-nitrophenol phosphate (pNPP).  An activity stain on non-denaturing gels with Nitro Blue Tetrazolium (NBT) and 5-Bromo-4-Chloro-3-Indolyl Phosphate (BCIP) as the substrate was also used.  A polypeptide of approximately 90 kDa was associated with 5NU enzyme activity after gel filtration chromatography and denaturing gel electrophoreses.  Protein sequence of this peptide was obtained from Mass Spectrometry and Edmund Degradation.  Various databanks were searched for similar sequences, but no matches with high identity were obtained.  However, a search of the sequences of an ongoing cDNA project at the University of Tsukuba in Japan revealed a clone that corresponded to the peptide sequence of 5NU.  In addition, a clone was found that corresponded to the classical <sup>\"alkaline phosphatase\"</sup> found in several organisms. Analysis of the expression of the 5NU and AP during Dictyostelium development by Northern blotting determined that the 5NU is developmentally regulated while the AP is expressed at all stages of the life cycle.  Southern blot analysis showed a single form of the gene for both 5NU and AP.  Targeted gene disruption and knockout mutagenesis using the 5NU sequences flanking a blasticidin-resistant cassette was attempted.  Analysis of the transformants showed the 5NU gene was not disrupted, and that the blasticidin-resistant cassette was randomly inserted into the genome",
  "description_provenance": [
    "Author Email: chanchao@vt.edu",
    "Advisor Email: rutherfo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:40Z (GMT). No. of bitstreams: 14 09pic6.pdf: 749577 bytes, checksum: 673bfdae408d04a608bc9c511db001af (MD5) 08pic5.pdf: 35376 bytes, checksum: d29dbb1c4aa32cb0510d13205b147bd9 (MD5) 07pic4.pdf: 416708 bytes, checksum: c896c388f8e5d1770b08e71c622506bf (MD5) 06pic3.pdf: 590656 bytes, checksum: 48a514bd42e45b1f6cd71d93072010d2 (MD5) 10pic7.pdf: 850443 bytes, checksum: 3632f6975b6187c7f4b4ea121f5e92b5 (MD5) 01title.pdf: 76664 bytes, checksum: da7336e4cb41aa30acd14dbc23906806 (MD5) 02ack.pdf: 75641 bytes, checksum: 682bf07be2519461e5e12cd9715c862f (MD5) 03int.pdf: 190959 bytes, checksum: 4361c8f9d16505bddf2c44c4b97740d3 (MD5) 04pic1.pdf: 1915510 bytes, checksum: 8776ea1ce580fd421ee421a707006f48 (MD5) 05pic2.pdf: 1982266 bytes, checksum: cd89b5acb65cf34e52d1db3fe9f8f946 (MD5) 11pic8.pdf: 1084987 bytes, checksum: 70b32919693a08e1616a3d1e17fd645f (MD5) 12pic9.pdf: 720969 bytes, checksum: 871c0287d88fb59f3737174f5e3bb8f9 (MD5) 13pic10.pdf: 25474 bytes, checksum: 73d4f1045462f86637b64843dc7404d1 (MD5) 14dis.pdf: 110871 bytes, checksum: 224f3e4cf661ecb8475660e14d943b9a (MD5)   Previous issue date: 1999-06-28"
  ],
  "handle": "28184",
  "identifier_other": "etd-070199-115953",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-070199-115953/",
  "identifier_uri": "http://hdl.handle.net/10919/28184",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "09pic6.pdf",
    "08pic5.pdf",
    "07pic4.pdf",
    "06pic3.pdf",
    "10pic7.pdf",
    "01title.pdf",
    "02ack.pdf",
    "03int.pdf",
    "04pic1.pdf",
    "05pic2.pdf",
    "11pic8.pdf",
    "12pic9.pdf",
    "13pic10.pdf",
    "14dis.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "gene disruption",
    "5â   nucleotidase",
    "alkaline phosphatase",
    "AX3K transformants",
    "purification",
    "expression"
  ],
  "title": "The Role of 5' Nucleotidase in  the Regulation of Morphogenesis in  Dictyostelium Discoideum",
  "type": "Dissertation"
}