{
  "contributor_author": "Shenoy, Uma Ajit",
  "contributor_committeechair": "Jones, Russell T.",
  "contributor_committeemember": [
    "Ollendick, Thomas H.",
    "Fu, Victoria R.",
    "Schulman, Robert S.",
    "Eisler, Richard M."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:13:41Z",
  "date_adate": "2001-09-02",
  "date_available": "2014-03-14T20:13:41Z",
  "date_issued": "2000-07-05",
  "date_rdate": "2002-09-02",
  "date_sdate": "2001-07-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The primary purpose of the investigation was to examine differences in symptom-expression between Caucasians and Asians in response to college-stress. College-stress was defined as adjustment problems that students experience as a function of exposure to a college environment. The propensity of each group to express symptoms in response to stress in somatic (i.e., bodily) versus psychological (i.e., anxiety and depression) modes was investigated. Previous reports have postulated a somatization hypothesis for Asians, as opposed to a psychologization tendency in Caucasians. Intra-Asian differences with respect to symptom-expression were also examined. Data were collected electronically. 115 graduate students participated in the study. Using Fisher's transformations to compare correlations, it was found that neither the somatization nor the psychologization hypotheses were supported. However, within Asians depression demonstrated a stronger association with stress than somatic symptoms.  A subsidiary purpose of this investigation was to determine whether attribution-style was an aspect of culture that could lead to differences in symptom-expression. It was hypothesized that Asians would have a more external attribution-style, while Caucasian-Americans would have a more internal style. External style was hypothesized to be related to a somatic tendency, while internal style was hypothesized to be related to a psychological tendency. None of these hypotheses were supported. Finally, some exploratory analyses were carried out to assess the effect of demographic variables on symptom-expression. Sex was related to anxiety symptoms, while level of education was related to somatic symptom-reports. Overall, these findings highlight the need for cross-cultural research in psychology to adopt a more systemic approach in studying variables, as opposed to using merely country/culture as an independent variable.",
  "description_provenance": [
    "Author Email: ajit.shenoy@juno.com",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: vfu@vt.edu",
    "Advisor Email: bs1@vt.edu",
    "Advisor Email: eisler@vt.edu",
    "Advisor Email: rtjones@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:41Z (GMT). No. of bitstreams: 1 dissertation.pdf: 321457 bytes, checksum: 36eba25542e408d47ad73f5b901a4377 (MD5)   Previous issue date: 2000-07-05"
  ],
  "handle": "28186",
  "identifier_other": "etd-07022001-115853",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07022001-115853/",
  "identifier_uri": "http://hdl.handle.net/10919/28186",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "College stress",
    "symptomatology",
    "Cross-cultural"
  ],
  "title": "College-Stress and Symptom-expression in International Students: A comparative study",
  "type": "Dissertation"
}