{
  "contributor_author": "Stroter, Antionette Denise",
  "contributor_committeecochair": [
    "Redican, Kerry J.",
    "Tatar, Deborah Gail"
  ],
  "contributor_committeemember": [
    "Gallagher, Lawrence",
    "Kershaw, Terry",
    "Magliaro, Susan G."
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:13:39Z",
  "date_adate": "2008-07-25",
  "date_available": "2014-03-14T20:13:39Z",
  "date_issued": "2008-05-19",
  "date_rdate": "2009-07-25",
  "date_sdate": "2008-07-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Antionette Denise Stroter's Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>The Supreme Court of the United States has recently determined that assigning students to schools and classrooms based on racial identity is unconstitutional. However, it also left the door open for further and different rulings. If researchers are able to show that lack of consideration of race has deleterious effects on federally mandated programs and initiatives, the ruling may be modified or opened up to specific circumstances. Among its many consequences, this ruling brings a focus onto the question of student-teacher matching in classrooms. Over the years, there has been a great deal of discussion in the literature about matching teacher and student by race, ethnicity, gender, and language. Some people claim that matching is crucial for student success while others dispute this claim. The current study examines the question of racial and ethnic matching empirically in the context of a large-scale randomized controlled study of an innovation for middle school mathematics learners. It extends the literature by (1) focusing on the relationship between student-teacher match and a specific, heavily documented situation with targeted learning goals, (2) adding information about Hispanic students to the discussion, and (3) helping evaluate factors that may be important in determining the validity of large-scale experiments. Alone and in conjunction with other similar empirical evidence, it will also have a significant effect on federal and state educational policy. The sample consists of the 92 teachers and 1576 7 th grade students on 76 school campuses throughout 8 Texas regions who participated in the Scaling-Up SimCalc project. Teachers and students either used SimCalc Mathworlds â ¢ curriculum and technology or a control for a two-week replacement unit. The crux of the current analysis was a match between aggregated and individual teacher and student characteristics and an inquiry into how these matches influence student math performance in the classroom within and between our experimental and control group. Hierarchical Linear Modeling (HLM) analysis was used to investigate the differences in student mathematics performance, modeled as students nested in classrooms nested in schools. </p> </body> </html>",
  "description_provenance": [
    "Author Email: astroter@exchange.vt.edu, astroter@vt.edu",
    "Advisor Email: lawrence.gallagher@sri.com",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: tatar@vt.edu",
    "Advisor Email: tkershaw@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:39Z (GMT). No. of bitstreams: 1 StroterETD-Toni7_21_08.pdf: 861050 bytes, checksum: 20e69f2c47f18742341cd88183f5248b (MD5)   Previous issue date: 2008-05-19"
  ],
  "handle": "28180",
  "identifier_other": "etd-07012008-185907",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07012008-185907/",
  "identifier_uri": "http://hdl.handle.net/10919/28180",
  "publisher": "Virginia Tech",
  "relation_haspart": "StroterETD-Toni7_21_08.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Middle-school Mathematics",
    "Technology",
    "Randomized Controlled Experimentation",
    "Teacher-Student Racial and Ethnic Congruence",
    "Classroom and School Effects",
    "Hierarchical Linear Models (HLM)"
  ],
  "title": "The Effects of Teacher-Student Racial and Ethnic Congruence on Student Math Learning",
  "type": "Dissertation"
}