{
  "contributor_author": "Murray, Anthony Gregory",
  "contributor_committeechair": "Mills, Bradford F.",
  "contributor_committeemember": [
    "Alwang, Jeffrey R.",
    "Davis, George C.",
    "Schleich, Joachim"
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:13:42Z",
  "date_adate": "2012-07-23",
  "date_available": "2014-03-14T20:13:42Z",
  "date_issued": "2012-06-19",
  "date_rdate": "2012-07-23",
  "date_sdate": "2012-07-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation consists of three essays examining household energy decisions and behavior.  The first essay examines the adoption of energy efficient Energy Star home appliances by U.S. households.  Program effectiveness requires that consumers be aware of the labeling scheme and also change their purchase decisions based on label information.  The first essay examines the factors associated with consumer awareness of the Energy Star label of recently purchased major appliances and the factors associated with the choice of Energy Star labeled appliances.  The findings suggest that eliminating identified gaps in Energy Star appliance adoption would result in house electricity cost savings of \\$164 million per year and associated carbon emission reductions of about 1.1 million metric tons per year.  The second essay evaluates household energy security and the effectiveness of the Low-Income Home Energy Assistance Program (LIHEAP), the single largest energy assistance program available to poor households within the United States.  Energy security is conceptually akin to the well-known concept of food security.  Rasch models and household responses to energy security questions in the 2005 Residential Energy Consumption Survey are used to generate an energy insecurity index that is consistent with those found in the food insecurity literature.  Participating in LIHEAP is found to significantly reduce household energy insecurity score in the index.  Further, simulations show that the elimination of the energy assistance safety net currently available to households increases the number of energy insecure households by over 16 percent.  The third essay develops a five equation demand system to estimate household own-price, cross-price and income elasticities between electricity, natural gas, food at home, food away from home, and non-durable commodity groups.  Household cross-price elasticities between energy and food commodities are of particular importance.  Energy price shocks reduce food expenditures for low-income households, as indicated by negative cross-price elasticity estimates for food and energy commodities.  Additionally, low-income households reduce energy expenditures more than other households, further indicating  ``heat or eat'' behavior.  Results from all three essays provide policy makers with helpful information to shape future federal energy programs.",
  "description_provenance": [
    "Author Email: amurray@vt.edu",
    "Advisor Email: bfmills@vt.edu",
    "Advisor Email: alwangj@vt.edu",
    "Advisor Email: georgedavis@vt.edu",
    "Advisor Email: Joachim.Schleich@isi.fraunhofer.de",
    "Made available in DSpace on 2014-03-14T20:13:42Z (GMT). No. of bitstreams: 1 Murray_AG_D_2012.pdf: 915698 bytes, checksum: f11ddb2adf69055aa0803977a34439fe (MD5)   Previous issue date: 2012-06-19"
  ],
  "handle": "28193",
  "identifier_other": "etd-07022012-190922",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07022012-190922/",
  "identifier_uri": "http://hdl.handle.net/10919/28193",
  "publisher": "Virginia Tech",
  "relation_haspart": "Murray_AG_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Heat or Eat",
    "Energy Insecurity",
    "Household Energy Behavior"
  ],
  "title": "Three Essays Examining Household Energy Demand and Behavior",
  "type": "Dissertation"
}