{
  "contributor_author": "Crane, Cynthia Elizabeth",
  "contributor_committeechair": "Novak, John T.",
  "contributor_committeemember": [
    "Dietrich, Andrea M.",
    "Benoit, Robert E.",
    "Hagedorn, Charles  III",
    "Berry, Duane F."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:13:42Z",
  "date_adate": "1999-07-09",
  "date_available": "2014-03-14T20:13:42Z",
  "date_issued": "1999-07-01",
  "date_rdate": "2000-07-09",
  "date_sdate": "1999-07-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Studies were conducted to explore the interactions among rye grass, chlorophenols and microorganisms.  The objectives were to examine some of the processes by which plants affect the fate of subsurface organic contaminants.  The research was divided into three studies: interactions between live grasses and 2,4-dichlorophenol (DCP), 2,4,6-trichlorophenol (TCP), and pentachlorophenol (PCP); physico-chemical interactions between the three chlorophenols and root tissue; and effect of root exudates on biodegradation of TCP. \tTo study the interactions between plants and organic contaminants, rye grass plants were grown in solutions containing DCP, TCP or PCP for one to three weeks.  The grass removed substantial amounts of the chlorophenols throughout the incubation time.  The majority of each chlorophenol removed from solution could not be recovered by non-destructive solvent extraction.  The removal of the chlorophenols from solution and the unrecoverability of the removed compound followed different kinetics, indicating that the two are different processes.  Both contaminant removal and unrecoverability were closely related to root surface area but not to transpiration.  A qualitative model was developed to describe the uptake of organic contaminants by plants.  The data demonstrate the importance of physico-chemical interactions between contaminants and roots and suggest that maximization of root surface area should be one consideration when selecting a plant species for phytoremediation. \tTo study the physico-chemical interactions between plant roots and organic contaminants, the distribution of DCP, TCP and PCP within a three phase system was examined.  The three phases were severed grass roots, water and an organic solvent, either hexane or ethyl acetate.  The chlorophenol mass that partitioned into the solvent phase was inversely correlated with root mass and root surface area index.  Partition coefficients calculated with respect to the organic liquid phase were inversely correlated with root mass and root surface area index.  A similar partitioning experiment was conducted using PCP placed in a solution containing only the dissolved organic material released by roots.  These resulting partition coefficients decreased with increasing organic carbon concentration.  It appeared that the organic compounds released into solution by the roots affected the movement of the chlorophenol into the organic liquid phase.   It is proposed that the presence of roots simultaneously promoted retention of the chlorphenols in the aqueous phase and provided a sorption site. \tThe effect of grass root exudates and glucose on the lag time associated with 2,4,6-trichlorophenol (TCP) degradation by an unacclimated microbial inoculant and an acclimated microbial inoculant was investigated.  The presence of an alternate organic carbon source reduced lag time for both the acclimated microbial inoculant and the inoculant that had not been previously exposed to chlorinated phenols.  The lag time for acclimation of microbes to TCP mineralization was affected by the ratio of the alternate organic carbon source concentration to the biomass concentration.  It is proposed that the presence of a readily available, alternate organic carbon source affected lag time through promotion of microbial population growth and provision of a preferred source of carbon and energy. \tThe results indicate that rye grass may directly, through partitioning and uptake, and indirectly, through soil microbes, affect the fate of chlorophenols in the subsurface environment.",
  "description_provenance": [
    "Author Email: ccrane@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Advisor Email: rbenoit@vt.edu",
    "Advisor Email: chagedor@vt.edu",
    "Advisor Email: duberry@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:42Z (GMT). No. of bitstreams: 1 cecdiss2.pdf: 386122 bytes, checksum: 57b15864130f143d5f89ff38342dbccd (MD5)   Previous issue date: 1999-07-01"
  ],
  "handle": "28194",
  "identifier_other": "etd-070299-182043",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-070299-182043/",
  "identifier_uri": "http://hdl.handle.net/10919/28194",
  "publisher": "Virginia Tech",
  "relation_haspart": "cecdiss2.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "phytoremediation",
    "exudates",
    "biodegradation",
    "chlorophenols",
    "roots",
    "bioremediation",
    "rye grass"
  ],
  "title": "Investigation of the Interactions Among Grass, Chlorophenols and Microbes",
  "type": "Dissertation"
}