{
  "contributor_author": "Feret, Alice J.",
  "contributor_committeechair": "Harris, Larry A.",
  "contributor_committeemember": [
    "Talbot, Patricia A.",
    "Parks, David J.",
    "Niles, Jerome A.",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:13:43Z",
  "date_adate": "2001-07-09",
  "date_available": "2014-03-14T20:13:43Z",
  "date_issued": "2001-06-22",
  "date_rdate": "2002-07-09",
  "date_sdate": "2001-07-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This study describes the long-term reading achievement of a group of children identified by teachers in 1994 as low-achieving students in reading.  Four research questions guided the study, and the 165 participants came from 12 elementary schools in Montgomery County, Virginia.  They were selected, because they had participated in Reading Recovery in first grade and had taken the reading portion of the Stanford 9 Achievement Test in the spring of third grade.<p> \tThe literature review covers the history of reading instruction, outlines the Chapter I model, compares and contrasts the New Zealand and American Reading Recovery models, and profiles the impact of Reading Recovery on the research community.<p> \tMeans and standard deviations were analyzed to compare the relative performance of four major populations:  Reading Recovery, Reading Recovery/Chapter I, Chapter I, and Waitlisted.<p> \tThe results of the analyses suggest that Reading Recovery students successfully discontinued in any number of lessons had means in the top half of the distribution of  means for all populations in the study.  With the addition of one to two years of Chapter I instruction after Reading Recovery, some students achieved the highest mean.<p> \tThe scores of Chapter I students with one year of instruction nearly matched the Reading Recovery mean.  Two to three years of Chapter I produced lower means.<p> \tThe waitlisted students scored slightly lower than the other three populations.<p> \tThe results of the study confirm the efficacy of Reading Recovery as an early intervention, but indicate that using Chapter I as a transitional step between Reading Recovery and successful independent reading sustains long-term reading achievement.",
  "description_provenance": [
    "Author Email: aferet@vt.edu",
    "Advisor Email: lharris@vt.edu",
    "Advisor Email: ptalbot@mail.mcps.org",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:43Z (GMT). No. of bitstreams: 1 Improving_the_Reading_Achievement.pdf: 437637 bytes, checksum: a9c1f3f76dc8c6266afd2abbb0215a79 (MD5)   Previous issue date: 2001-06-22"
  ],
  "handle": "28197",
  "identifier_other": "etd-07032001-191905",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07032001-191905/",
  "identifier_uri": "http://hdl.handle.net/10919/28197",
  "publisher": "Virginia Tech",
  "relation_haspart": "Improving_the_Reading_Achievement.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Remedial Programs",
    "Early Intervention",
    "Reading",
    "At-Risk Students"
  ],
  "title": "IMPROVING THE READING ACHIEVEMENT OF SELECTED AT-RISK READERS: ONE SCHOOL DIVISIONâ  S APPROACH",
  "type": "Dissertation"
}