{
  "contributor_author": "Pedro, Joan Yvonne",
  "contributor_committeechair": "Lalik, Rosary V.",
  "contributor_committeemember": [
    "Singh, Kusum",
    "Niles, Jerome A.",
    "Billingsley, Bonnie S.",
    "Creamer, Donald G."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:13:43Z",
  "date_adate": "2001-09-24",
  "date_available": "2014-03-14T20:13:43Z",
  "date_issued": "2001-07-02",
  "date_rdate": "2002-09-24",
  "date_sdate": "2001-07-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This qualitative interpretive study explored how five pre-service teachers constructed meaning of reflection, and how these meanings informed their practice. The purpose of this research was to better understand reflective practice in teacher preparation. The theories on reflective practice by Dewey (1933), Schon (1983, 1987), and van Manen (1977) guided this study. This research incorporated the historical and institutional contexts of the study, and applied a symbolic interaction theoretical and analytical framework (Denzin, 1978, Prus, 1996). The interpretations of the pre-service teachers' conceptions and understandings of reflective practice were captured through the transcriptions and analysis of interviews, and through the examination of the pre-service teachers' reflection journals. Participant-observations were recorded in field notes and serve to inform the social context of the study, as well as to provide portraits of the pre-service teachers, and to verify their responses. Themes were derived from the data and categorized within the symbolic interaction social processes of acquiring perspectives, achieving individuality, experiencing relationships, situating the act, and the act of reflection (Prus, 1996). The research questions were answered as I interpreted the meanings that these pre-service teachers attached to reflection, as well as the process, context and content of their reflective practice (Calderhead, 1989). I derived thirteen themes from the data that highlighted how the pre-service teachers interpreted and practiced reflection in this teacher preparation program. The themes were: (1) defining reflection; (2) questioning as reflection; (3) gaining opportunities for reflection; (4) Defining reflection from self and significant others; (5) looking back on action; (6) reflection is based on personal beliefs, and educational theory; (7) encountering professors; (8) encountering mentors; (9) encountering cooperating teachers; (10) self-reflections; (11) verbal reflections; (12) written reflections; and (13) content of reflection. The study resulted in an interpretation of the pre-service teachers' views of reflective practice as they experienced it in the teacher preparation program that they felt gave them many opportunities for reflection. The findings indicated that the pre-service teachers had a general understanding of reflection. They practiced technical and interpretive levels of reflection in different contexts. The findings of the study implied that pre-service teachers understood and learned to reflect through courses and field activities. The findings also raised questions about the necessity of extensive writing requirements in reflection. This study has implications for the ways in which pre-service teachers learn about reflection, and may be useful for teacher educators who prepare reflective practitioners.",
  "description_provenance": [
    "Author Email: jpedro@vt.edu",
    "Advisor Email: rlalik@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: bbilling@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:43Z (GMT). No. of bitstreams: 1 disseration.pdf: 792610 bytes, checksum: 1aceeb17b0eed530578dba62e14fdea6 (MD5)   Previous issue date: 2001-07-02"
  ],
  "handle": "28196",
  "identifier_other": "etd-07032001-182401",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07032001-182401/",
  "identifier_uri": "http://hdl.handle.net/10919/28196",
  "publisher": "Virginia Tech",
  "relation_haspart": "disseration.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "teacher education",
    "teacher preparation",
    "reflective practice"
  ],
  "title": "Reflection in Teacher Education: Exploring Pre-Service Teachers' Meanings of Reflective Practice",
  "type": "Dissertation"
}