{
  "contributor_author": "Greene, H. Carol",
  "contributor_committeechair": "Magliaro, Susan G.",
  "contributor_committeemember": [
    "Burton, John K.",
    "Niles, Jerome A.",
    "Stallings, Martha Ann",
    "Doolittle, Peter E."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:13:44Z",
  "date_adate": "2003-07-15",
  "date_available": "2014-03-14T20:13:44Z",
  "date_issued": "2003-07-02",
  "date_rdate": "2004-07-15",
  "date_sdate": "2003-07-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research investigated the uses of computer-mediated communication in providing an online field experience in an educational psychology course for pre-service teachers at a large research university in the southeastern United States.  Twenty-seven pre-service teachers in one section of a Psychological Foundations of Educational Psychology course for pre-service teachers, eight practicing teachers, and eight university professors participated in this study.  The participants viewed CD-ROM based video case studies as part of an online field experience component and communicated electronically through chat rooms and threaded discussion lists.  Data sources included transcripts of all chat room and threaded communication, surveys, field notes, observations, and student tasks and reflections, as well as interviews with the pre-service teachers, practicing teachers, university professors, and one technical support person.  The methodology involved a mixed method approach.  A template organizing approach with the constant comparative method was used in order to develop patterns and themes.  Content analysis was applied to the content of the chat transcriptions.  Finally, a quantitative component was included in the analysis of the thread transcripts with a measurement of the development of the pre-service teachers' reflective comments over time using an analysis of variance test of within subjects effects.  This document reports the findings concerning the nature of the conversations among the participants as they developed across time; the learning outcomes of the students, teachers, and professors; how a computer-mediated learning environment supports reflection; the benefits and challenges of using computer-mediated communication to study and learn about educational psychology and teaching; and the benefits and challenges of creating and maintaining such a learning environment.",
  "description_provenance": [
    "Author Email: hcgreene@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: mastallings@mail.mcps.org",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:44Z (GMT). No. of bitstreams: 2 TheoryMeetsPracticeETD.pdf: 1147103 bytes, checksum: 977e7af7a2c6a643272df64afbda0e5c (MD5) IntroPages.ETD.pdf.pdf: 26870 bytes, checksum: bda965091d744d71b4d13383a95af148 (MD5)   Previous issue date: 2003-07-02"
  ],
  "handle": "28209",
  "identifier_other": "etd-07052003-130207",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07052003-130207/",
  "identifier_uri": "http://hdl.handle.net/10919/28209",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "TheoryMeetsPracticeETD.pdf",
    "IntroPages.ETD.pdf.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "situated cognition",
    "pre-service teachers",
    "teacher education",
    "computer-mediated communication",
    "educational psychology"
  ],
  "title": "Theory Meets Practice in Teacher Education: A Case Study of a Computer-Mediated Community of Learners",
  "type": "Dissertation"
}