{
  "contributor_author": "Hall, Katherine Lelia",
  "contributor_committeechair": "Kelly, Patricia Proudfoot",
  "contributor_committeemember": [
    "Carico, Kathleen M.",
    "Eschenmann, Konrad Kurt",
    "Hicks, David",
    "Magliaro, Susan G."
  ],
  "contributor_department": "Instructional Technology",
  "date_accessioned": "2014-03-14T20:13:44Z",
  "date_adate": "2001-07-06",
  "date_available": "2014-03-14T20:13:44Z",
  "date_issued": "2001-06-13",
  "date_rdate": "2002-07-06",
  "date_sdate": "2001-07-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Due to the large number of garment factory closings in the Appalachian region of Virginia, many workers have become unemployed. Mittelhauser (1997) reported, \"textile and apparel workers are expected to lose jobs at an even faster rate.  Employment in these industries has been projected to decline by about 300,000 jobs over the 1994-2005 period, compared to a net loss of about 250,000 jobs over the previous 11-year period\" (p. 28).  In order to provide governmental assistance for these workers, the Trade Readjustment Act (TRA) gives money to these displaced workers so they can be retrained. TRA includes training, trade readjustment allowance, relocation allowance, subsistence allowance (while in training), transportation allowance, and reemployment services (ETA, 2000). The majority of retraining occurs at regional community colleges.  Further, most of the displaced garment workers are women since the majority of the jobs involved sewing.  In fact, Mittelhauser (1997) found that \"nearly three-quarters of the employees working in the apparel industry in 1996 were women, compared to about a third of the workers in the entire manufacturing sector\" (p. 25). When the displaced workers apply for community college classes, most of them test into developmental classes, including developmental writing. According to Doyle and Fueger (1995), developmental writing meets \"the need to write effectively and coherently and the need to use standard grammar, usage, and punctuation\" (p. 22).  Further, Sweigart (1996) identified the most important purpose and outcome of developmental writing as \"the development of the writing abilities of individual students\" (p. 13). This descriptive study followed four women in Developmental Writing 03 class at Creekview Community College.  The four TRA women in the study were nontraditional students, as well as displaced garment workers from the Appalachian region.  The purpose of the study was to see if the women's writing improved over the course of the semester, based on employers' expectations and rubrics specially designed for looking at the traits of good writing.  Specifically, the study looked at the women's in-class and out-of-class writing.  The writing was analyzed in depth by the researcher and was presented in case studies, one for each woman in the study.  Because of employers' concerns about workers' poor writing skills, the writing was further analyzed in terms of workplace expectations so as to determine if the women acquired writing skills that would assist them in their future workplaces.  Ascher (1988) said that writing skills in the workplace meant \"writing legibly and completing forms accurately; writing Standard English; selecting, organizing, and relating ideas; and proofreading one's own writing\" (p. 1). Upon close analysis of the women's writing, it was decided that their writing did show at least some improvement based on the participation in a developmental writing class.  Additionally, based on interviews, participant observation of the women in Developmental Writing 03, and the analysis of the women's writing, it was determined that the women's confidence in themselves as writers also increased as a result of their participation in the semester long developmental writing class.",
  "description_provenance": [
    "Author Email: kahall2@vt.edu",
    "Advisor Email: kcarico@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: hicks@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:44Z (GMT). No. of bitstreams: 1 klhdissertation.pdf: 10028722 bytes, checksum: 94b2d2fe5a09539fccb949605ae4d437 (MD5)   Previous issue date: 2001-06-13"
  ],
  "handle": "28207",
  "identifier_other": "etd-07052001-181955",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07052001-181955/",
  "identifier_uri": "http://hdl.handle.net/10919/28207",
  "publisher": "Virginia Tech",
  "relation_haspart": "klhdissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Appalachian women",
    "community college",
    "trade readjustment act",
    "developmental writing"
  ],
  "title": "Trade Readjustment Act Women in Developmental Writing:  Preparing for Education and Retraining",
  "type": "Dissertation"
}