{
  "contributor_author": "Plummer, Ellen Wright",
  "contributor_committeechair": "Creamer, Elizabeth G.",
  "contributor_committeemember": [
    "Hyer, Patricia B.",
    "O'Barr, Jean",
    "Hirt, Joan B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:13:44Z",
  "date_adate": "2006-09-27",
  "date_available": "2014-03-14T20:13:44Z",
  "date_issued": "2006-06-26",
  "date_rdate": "2006-09-27",
  "date_sdate": "2006-07-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine how institutional culture promoted or impeded the implementation of round one and two NSF ADVANCE initiatives designed to improve academic climates for women in science and engineering. This study was conducted in two phases. In phase one, 35 participants from 18 institutions were interviewed to answer three research questions. Participants identified a policy, process, or program designed to improve academic cultures for women in science and engineering fields. Participants also identified strategies that promoted the implementation of these efforts, and discussed factors that impeded these efforts. In phase two, site visits were conducted at two institutions to answer a fourth research question. How did institutional culture shape the design and implementation of faculty search processes? \tPolicies, processes, and programs were implemented by participants at the institutional, departmental, and individual levels and included family friendly and dual career policies at the institutional level, improved departmental faculty search and climate improvement processes, and mentoring programs and training for department heads at the individual level. Communication and leadership strategies were key to the successful implementation of policies, processes, and programs designed to achieve institutional transformation. Communication strategies involved shaping change messages to reach varied audiences often with the argument that change efforts would improve the climate for everyone not just women faculty members. Administrative and faculty leaders from multiple levels proved important to change efforts.  \tInstitutional culture shaped initiatives to improve faculty search processes. Faculty leaders in both settings used data to persuade faculty members of the need for change. At one site, data that included national availability information was critical to advancing the change agenda. At the other site, social science data that illustrated gender bias was persuasive. Faculty members who were effective as change agents were those who were credible with their peers in that setting.",
  "description_provenance": [
    "Author Email: eplummer@vt.edu",
    "Advisor Email: hyerp@vt.edu",
    "Advisor Email: jean.obarr@duke.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: creamere@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:44Z (GMT). No. of bitstreams: 2 IRBApproval.pdf: 64162 bytes, checksum: 0458149b4c485f0810414af86a755582 (MD5) PlummerDissertation.pdf: 593428 bytes, checksum: c2ee765acf0b734788f4d84eb70ba2c2 (MD5)   Previous issue date: 2006-06-26"
  ],
  "handle": "28204",
  "identifier_other": "etd-07042006-153209",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07042006-153209/",
  "identifier_uri": "http://hdl.handle.net/10919/28204",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "IRBApproval.pdf",
    "PlummerDissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Higher Education",
    "Women in Science and Engineering",
    "ADVANCE",
    "Institutional Transformation"
  ],
  "title": "Institutional Transformation: An Analysis of Change Initiatives at NSF ADVANCE Institutions",
  "type": "Dissertation"
}