{
  "contributor_author": "Quinn, Avis Courtney",
  "contributor_committeecochair": [
    "Hohenshil, Thomas H.",
    "Fortune, Jimmie C."
  ],
  "contributor_committeemember": [
    "Wilkinson, Thomas W.",
    "Moore, James",
    "Getz, Hilda M."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:13:45Z",
  "date_adate": "2001-07-06",
  "date_available": "2014-03-14T20:13:45Z",
  "date_issued": "2001-06-18",
  "date_rdate": "2012-04-12",
  "date_sdate": "2001-07-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study focused on the use of technology within CACREP approved counselor education programs throughout the United States. The procedure for this project was handled totally online. An initial e-mail was sent to 146 possible participants to request corrected addresses or names, if necessary, and to alert them to the coming introduction and invitation to participate in this survey. There were 44 respondents who agreed to take part in this project. They were given a password to the survey instrument and directed to the researcher's web page. From there, they clicked on a button visible on the first page that took them to the password page of the survey instrument. They then completed the survey consisting of fill in the blank; yes, no; open-ended questions; and multiple choice questions and hit the \"submit\" button to indicate that they were finished.  Literature pertaining to the use of technology in general as well as in counselor education programs was extensively reviewed. This demonstrated the current movement in education toward alternative delivery methods for course instruction. The results indicated that counselor educators are aware of the increase in the use of technology in programs, but were not as convinced of the effectiveness of this method of course delivery. Though most were comfortable with PowerPoint presentations by faculty and students, participants were not widely accepting of classes online, or broadcast via satellite.",
  "description_provenance": [
    "Author Email: aviscqui@earthlink.net",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: Tom.Wilkinson@vt.edu",
    "Advisor Email: jmoore@gwm.sc.edu",
    "Advisor Email: hgetz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:45Z (GMT). No. of bitstreams: 1 etd.pdf.pdf: 481265 bytes, checksum: 65b95c18ba90afce0126c16592c5fe35 (MD5)   Previous issue date: 2001-06-18"
  ],
  "handle": "28218",
  "identifier_other": "etd-07062001-102836",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07062001-102836/",
  "identifier_uri": "http://hdl.handle.net/10919/28218",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "higher education",
    "technology in counseling",
    "counselor education and technology"
  ],
  "title": "Utilization of Technology in CACREP Approved Counselor Education Programs",
  "type": "Dissertation"
}