{
  "contributor_author": "Molina, Gustavo Jose",
  "contributor_committeechair": "Furey, Michael J.",
  "contributor_committeemember": [
    "Ritter, Alfred L.",
    "Vick, Brian L.",
    "Kajdas, C.",
    "Eiss, Norman S. Jr."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:13:45Z",
  "date_adate": "2000-07-06",
  "date_available": "2014-03-14T20:13:45Z",
  "date_issued": "2000-07-03",
  "date_rdate": "2001-07-06",
  "date_sdate": "2000-07-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Lubrication of ceramics is a difficult and not completely solved problem. Ceramics do not respond to conventional lubricants which are designed to function by a chemical reaction with the surface. There is, accordingly, increased interest in the development of lubrication alternatives for ceramics, and in understanding the tribochemical fundamentals by which new lubrication processes can be designed and controlled. In particular, the mechanism of tribopolymerization for some addition-type monomers is thought to be initiated and controlled by triboemitted low-energy electrons.   This Ph.D. dissertation presents the experimental work carried out at the Virginia Polytechnic Institute and State University for the characterization of charge intensity and energy distribution of charged-particles triboemitted from sliding contacts of ceramics.   A review is presented of research work on tribochemistry and, in particular, on tribopolymerization as a lubrication mechanism. Relevant literature is also reviewed on the phenomena of exoemission, triboemission and fractoemission of charged-particles. The design, construction and development of a new instrument and data acquisition system to carry out triboemission measurements under high vacuum and for controlled load, sliding speed and retarding grid-voltage is described.   The charge intensity is characterized of the particles triboemitted from two related ceramics, alumina and sapphire, and from one metallic material, i.e., aluminum, when scratched by a diamond pin.  In the case of alumina, triboemitted-charge intensity also is studied by sliding contact of an alumina ball. Burst-type negatively-charged particle triboemission was observed from diamond-on-alumina, diamond-on-sapphire, and alumina-on-alumina sliding contacts. The different crystalline structure, i.e., of alumina and sapphire, does not appear to be a factor in electron triboemission. In general, large bursts of electron triboemission may appear superimposed on a constant lower level of small-burst emission. This constant level, being higher than background-noise, does not vary between different ceramic specimens, while maximum levels of triboemission-bursts differ by two orders of magnitude between different specimens. The characteristic decay-time of the triboemission bursts is found of about 100ms. Lower-level decaying post-contact emission of negatively-charged particles from ceramics is observed.   Low negatively-charged triboemission was observed from diamond-on-aluminum sliding contacts. The positively-charged triboemission from these sliding material systems was also measured. Low positive-ion emission, barely above background level, was observed for the diamond-on-ceramics and alumina-on-alumina systems.  The retarded-energy spectra of the negatively-charged particle triboemissions from ceramics were also obtained. Such spectra show decaying rates of triboemission for increasing minimum energy of the triboemitted particles: an important fraction of the total electron triboemission is produced in the zero to 5eVolts energy-range, with a decaying tail extending beyond the test maximum level of 48 Volts.  These experimental measurements are discussed  with a focus on the possible role of triboemitted charged-particles in tribopolymerization as a mechanism of ceramic lubrication. It is concluded that low-energy electrons are emitted in bursts from ceramics under sliding contact, the essential first step in the hypotheses of tribopolymerization of certain addition-type monomers, while positively-charged emission is negligible. These findings strongly support tribopolymerization results from previous research.   A frequency domain analysis of the triboemission data is carried out. For the electron-triboemission outputs, a characteristic pattern is found for the experimentally estimated frequencies of occurrence of the triboemitted particles. A new probability distribution, called \"Convoluted Poisson\" is developed to describe this triboemission data. Good agreement is found between the probabilities of triboemitted-particle occurrence, as predicted by such distribution, and the experimental probabilities estimated from triboemission outputs. The significance of the two parameters defining this \"Convoluted Poisson\" distribution is explored and discussed with a focus on basic surface-change phenomena.",
  "description_provenance": [
    "Author Email: gmolina@vt.edu",
    "Advisor Email: aritter@vt.edu",
    "Advisor Email: bvick@vt.edu",
    "Advisor Email: mfurey@vt.edu",
    "Advisor Email: ckajdas@zto.pw.plock.pl",
    "Advisor Email: neiss@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:45Z (GMT). No. of bitstreams: 1 gmolina_ETD3.pdf: 958949 bytes, checksum: 90c9f935353cef034dea61505c4246ed (MD5)   Previous issue date: 2000-07-03"
  ],
  "handle": "28217",
  "identifier_other": "etd-07062000-13590032",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07062000-13590032/",
  "identifier_uri": "http://hdl.handle.net/10919/28217",
  "publisher": "Virginia Tech",
  "relation_haspart": "gmolina_ETD3.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Tribochemistry",
    "Triboemission",
    "Convoluted Poisson Distribution",
    "Tribopolymerization",
    "Exoemission"
  ],
  "title": "Triboemission From Ceramics: Charge Intensity and Energy Distribution Characterizations",
  "type": "Dissertation"
}