{
  "contributor_author": "Klage, Karsten",
  "contributor_committeechair": "Potts, Malcolm",
  "contributor_committeemember": [
    "Eisenback, Jonathan D.",
    "Banerjee, Diya",
    "Helm, Richard Frederick",
    "Tu, Zhijian Jake"
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:13:45Z",
  "date_adate": "2008-08-05",
  "date_available": "2014-03-14T20:13:45Z",
  "date_issued": "2008-06-24",
  "date_rdate": "2009-08-05",
  "date_sdate": "2008-07-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This work provides a comparative and genetic analysis of the responses to water stress in desiccation-tolerant and desiccation-sensitive nematodes. Caenorhabditis elegans, a model organism for the study of development, aging, and cell biology was shown to be a desiccation-sensitive organism that survives relative humidities above 40\\%  for periods of up to seven days. Transcripts from the desiccation-tolerant species Panagrolaimus rigidus AF36 and sp. PS1579, which were expressed uniquely during separate desiccation and osmotic stresses, as well as during recovery from exposure to the dual stresses, were cloned. These sequences were used to search for similarities in the genome sequence data of C. elegans.  Putative anhydrobiotic-related transcripts were identified that potentially encode heat shock protein 70, late embryogenic abundant protein, and trehalose-phosphate synthase. Other putative genes that were identified within eight separate libraries encode proteins involved in transcription (histones), protein biosynthesis (ribosomal proteins, elongation factors), protein degradation (ubiquitin, proteases), and transport and cell structure (actin, collagen). Gene ontology analysis of the cloned transcripts revealed that developmental processes are activated during exposure to the stresses as well as during recovery, which may suggest a â  rejuvenationâ   process as a key to survival in Panagrolaimus nematodes.  Genes that were up-regulated during desiccation stress in C. elegans were classified as belonging either to an early response (until 12 hours of stress), or to a late response (after 12 hours of stress). The early response was characterized by the up-regulation of a large number of genes encoding mono-oxygenases, which may suggest onset of oxidation stress during desiccation of C. elegans. The late response was characterized by the appearance of transcripts encoding proteins of the immune system, heat shock proteins (protein denaturation), and superoxide dismutases (oxidation damage). Genes in C. elegans that were down-regulated in response to desiccation stress include those encoding proteases and lysozymes (metabolic shutdown). Genes that encode channel proteins (water homeostasis) were found among the transcripts up-regulated during recovery of C. elegans. The up-regulation of gpdh-1 and hmit-1.1, two transcripts linked to hyperosmotic stress, suggest that osmotic stress is experienced by C. elegans. Comparison of these data with those obtained from exposure of C. elegans to a range of other stresses showing that the nematode C. elegans uses specific transcripts for the desiccation response;  transcripts that are not induced in other stresses such as heat, anoxia or starvation. In addition, transcripts regulated during desiccation stress of C. elegans were also regulated during dauer formation, which may indicate common stress tolerant mechanisms. Recent studies in mammalian cells and C. elegans have shown that microRNAs are able to degrade and to sequester mRNA especially during stress in so called stress bodies. In this study, C. elegans microRNA knock-outs showed a significant decrease in desiccation stress survival compared to wild type C. elegans which may suggest the importance of microRNAs for stress survival in C. elegans and other organisms.",
  "description_provenance": [
    "Author Email: kklage@vt.edu",
    "Advisor Email: jon@vt.edu",
    "Advisor Email: dbanerjee@vt.edu",
    "Advisor Email: geordie@vt.edu",
    "Advisor Email: helmrf@vt.edu",
    "Advisor Email: jaketu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:45Z (GMT). No. of bitstreams: 1 ETS_Klage_2008.pdf: 2191243 bytes, checksum: 37c22486feb17d0a71d993a103b4afab (MD5)   Previous issue date: 2008-06-24"
  ],
  "handle": "28215",
  "identifier_other": "etd-07052008-204825",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07052008-204825/",
  "identifier_uri": "http://hdl.handle.net/10919/28215",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETS_Klage_2008.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "osmosis",
    "RNAi",
    "microRNA",
    "desiccation",
    "cryptobiosis",
    "Anhydrobiosis"
  ],
  "title": "Molecular analysis of the responses of Caenorhabditis elegans (Bristol N2), Panagrolaimus rigidus (AF36) and Panagrolaimus sp. (PS 1579) (Nematoda) to water stress",
  "type": "Dissertation"
}