{
  "contributor_author": "Huh, Jin",
  "contributor_committeecochair": [
    "McGehee, Nancy G.",
    "Uysal, Muzaffer S."
  ],
  "contributor_committeemember": [
    "Littlefield, James E.",
    "Mihalik, Brian J.",
    "McCleary, Ken W."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:13:45Z",
  "date_adate": "2006-08-15",
  "date_available": "2014-03-14T20:13:45Z",
  "date_issued": "2006-06-28",
  "date_rdate": "2007-08-15",
  "date_sdate": "2006-07-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study provides an integrated approach to understanding the relationship between destination branding and tourist behavior, and attempts to extend the theoretical and empirical evidence about the structural relationships among the following constructs: destination image, perceived quality, destination awareness (elements of destination branding), tourist satisfaction, and tourist loyalty (elements of tourist behavior) in the leisure tourism market. This study develops and empirically tests a destination branding model and its relevant components from the perspectives of tourists, so that it will help destination marketers to build more competitive tourism destinations.<p>  The destination brand model is based on relationship marketing theory, signaling theory, and brand equity theory. The model proposed four major hypotheses: 1) destination branding has a direct positive influence on tourist loyalty; 2) destination branding has an indirect positive influence on tourist loyalty through tourist satisfaction; 3) tourist satisfaction has a positive influence on tourist loyalty; and 4) the relationship between destination branding and tourist satisfaction is moderated by trip types.<p>  A sample population consisting of residents of Virginia was surveyed. A stratified sampling method and a random sampling method were used to select the sample. A total of 304 usable questionnaires out of 2,000 questionnaires were collected. Structural equation modeling (SEM) was used to test hypotheses in this study.<p>  The results revealed that: 1) cognitive destination image and destination familiarity had a direct influence on tourist loyalty as well as an indirect influence on tourist loyalty through tourist satisfaction; 2) affective destination image had only an indirect impact on tourist loyalty through tourist satisfaction; 3) tourist satisfaction had a significant relationship with tourist loyalty; and 4) cognitive destination image, affective destination image, and destination recognition were moderated by trip types.<p>  This study can initiate the development of theoretical foundations for destination branding. Also, the implications of these findings can help destination managers and marketers build competitive strategies for destination branding in order to ensure long-term relationships between tourists and their destinations.",
  "description_provenance": [
    "Author Email: jhuh@vt.edu",
    "Advisor Email: jalittle@vt.edu",
    "Advisor Email: bmihalik@vt.edu",
    "Advisor Email: nmcgehee@vt.edu",
    "Advisor Email: samil@vt.edu",
    "Advisor Email: mccleary@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:45Z (GMT). No. of bitstreams: 1 Jin_Huh.pdf: 656768 bytes, checksum: 2614757564dd80777deb20cb7c8dc84d (MD5)   Previous issue date: 2006-06-28"
  ],
  "handle": "28212",
  "identifier_other": "etd-07052006-205649",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07052006-205649/",
  "identifier_uri": "http://hdl.handle.net/10919/28212",
  "publisher": "Virginia Tech",
  "relation_haspart": "Jin_Huh.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Satisfaction",
    "Perceived Quality",
    "Destination image",
    "Destination Awareness",
    "Structural Equation Modeling",
    "Leisure Tourism Market",
    "Loyalty",
    "Destination Branding"
  ],
  "title": "Destination Branding as an Informational Signal and its Influence on Satisfaction and Loyalty in the Leisure Tourism Market",
  "type": "Dissertation"
}