{
  "contributor_author": "Olsen, Amanda Albright",
  "contributor_committeechair": "Rimstidt, james Donald",
  "contributor_committeemember": [
    "Schreiber, Madeline E.",
    "Dove, Patricia M.",
    "Bodnar, Robert J."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:13:45Z",
  "date_adate": "2007-08-02",
  "date_available": "2014-03-14T20:13:45Z",
  "date_issued": "2007-06-21",
  "date_rdate": "2007-08-02",
  "date_sdate": "2007-07-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Silicate minerals are the most common mineral group in the earth's crust so it is not surprising that their weathering reactions dominate the chemistry of many earth surface processes.  This project used forsterite as a model system to identify the important factors that affect silicate mineral dissolution rates and grain lifetimes in the weathering environment.  </p><p> I determined an empirical rate law for forsterite dissolution of forsterite in oxalic acid solutions:   based on a series of 124 semi-batch reactor experiments over a pH range of 0 to 7 and total oxalate concentrations between 0 and 0.35 m at 25&#176;C.  These experiments show that oxalate-promoted dissolution rates depend upon both oxalate concentration and pH.  I propose a reaction mechanism in which a hydrogen ion and an oxalate ion are simultaneously present in the activated complex for the reaction that releases H4SiO4 into solution.  By analogy, I propose that water acts as a ligand in the absence of oxalate. </p><p>I also ran 82 batch reactor experiments in magnesium and sodium sulfate and magnesium and potassium nitrate solutions.  These experiments show that ionic strength up to 12 m, log mMg up to 4 m, and log mSO4 up to 3 m have no effect on forsterite dissolution rates.  However, decreasing aH2O slows forsterite dissolution rates.  The effect of decreasing dissolution rates with decreasing aH2O is consistent with the idea that water acts as a ligand that participates in the dissolution process. Forsterite dissolution rate data from previously published studies were combined with results from my experiments and regressed to produce rate laws at low and high pH.  For pH < 5.05  \t    or\t  and for pH > 5.05  \tor\t  I then developed a diagram that shows the effect rate-determining variables on the lifetime of olivine grains in weathering environments using these rate laws.</p>",
  "description_provenance": [
    "Author Email: amalbrig@vt.edu",
    "Advisor Email: mschreib@vt.edu",
    "Advisor Email: dove@vt.edu",
    "Advisor Email: rjb@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:45Z (GMT). No. of bitstreams: 1 olsen.pdf: 769475 bytes, checksum: 5a952e214f70d5f5ba4f7bd37bd282a9 (MD5)   Previous issue date: 2007-06-21"
  ],
  "handle": "28213",
  "identifier_other": "etd-07052007-135551",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07052007-135551/",
  "identifier_uri": "http://hdl.handle.net/10919/28213",
  "publisher": "Virginia Tech",
  "relation_haspart": "olsen.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mineral dissolution kinetics",
    "chemical weathering",
    "ionic strength",
    "ligand-promoted dissolution",
    "olivine",
    "forsterite dissolution"
  ],
  "title": "Forsterite Dissolution Kinetics:  Applications and Implications for Chemical Weathering",
  "type": "Dissertation"
}