{
  "contributor_author": "Helems, Darryl D.",
  "contributor_committeecochair": [
    "Hohenshil, Thomas H.",
    "Fortune, Jimmie C."
  ],
  "contributor_committeemember": [
    "Bradley, Worth",
    "Curcio, Claire Cole Vaught",
    "Hutchins, David E."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:13:46Z",
  "date_adate": "2001-07-09",
  "date_available": "2014-03-14T20:13:46Z",
  "date_issued": "2001-06-19",
  "date_rdate": "2012-08-07",
  "date_sdate": "2001-07-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study was developed to answer the research questions 1) What services do school counselors provide in alternative education programs in Virginia? and 2) What are the reasons that students are participating in alternative education programs in Virginia?  Alternative programs throughout Virginia were identified and data were randomly collected from a random sample of administrators and school counselors working in 15 of these programs.  The data collected were then transcribed and analyzed in an effort to determine if any significant categories or themes related to the research questions.    <p>The data indicated that most counselors identified that they were involved in both direct counseling and administrative duties at their schools.  Direct counseling duties consisted primarily of individual counseling, group counseling, and career counseling while the two primary administrative duties reported were test coordination and scheduling.  <p>The data indicated some consistent reasons for placement in alternative education programs.  Seven schools reported that they served students for behavioral, academic, and other various reasons while only three reported that they served students specifically for behavioral or academic reasons.  The areas of discipline/expulsion, failing grades, lack of credits to gain diploma, truancy, and teen pregnancy were identified as reasons for which placement in the alternative programs interviewed.  <p>The results of this study suggested a need for further studies relating to community involvement and direct counseling activities of school counselors working in alternative education.  Recommendations were also made with regards to the future training of school counselors and the development of alternative education programs.",
  "description_provenance": [
    "Author Email: watever22@hotmail.com",
    "Advisor Email: vaughtc@vt.edu",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: dhutch@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:46Z (GMT). No. of bitstreams: 2 HelemsDDAbstract.pdf: 3831 bytes, checksum: 13fcae1dd6ddc7aae6eac3585f2e0d13 (MD5) HelemsDD.PDF: 250510 bytes, checksum: 338ca80ba304160fc0cd74dc8625a483 (MD5)   Previous issue date: 2001-06-19"
  ],
  "handle": "28219",
  "identifier_other": "etd-07062001-214213",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07062001-214213/",
  "identifier_uri": "http://hdl.handle.net/10919/28219",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "HelemsDDAbstract.pdf",
    "HelemsDD.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "alternative education",
    "school counselor"
  ],
  "title": "The School Counselor's Role in Alternative Education Programs in Virginia",
  "type": "Dissertation"
}