{
  "contributor_author": "Lambert-Shute, Jennifer Jane",
  "contributor_committeechair": "Piercy, Fred P.",
  "contributor_committeemember": [
    "Johnson, Scott W.",
    "Skaggs, Gary E.",
    "Walsh, Stephanie",
    "McWey, Lenore M."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:13:46Z",
  "date_adate": "2004-08-05",
  "date_available": "2014-03-14T20:13:46Z",
  "date_issued": "2004-06-04",
  "date_rdate": "2007-08-05",
  "date_sdate": "2004-07-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Dual relationships in the family therapy field are currently under debate. Within this debate extreme viewpoints and opinions, on what is the best way to navigate dual relationships, are being voiced. These views range from avoiding non-sexual dual relationships at all costs to glorifying the possibilities of such a relationship. To obtain a snap shot of faculty and student experiences a web survey was sent to fifteen masters and ten doctoral COAMFTE-accredited programs. Participants were 76 students and 30 faculty members, a total of 106 respondents. The web survey revealed that the majority of respondents had positive and successful dual relationships. Faculty and students indicated several strategies to keep relationships positive and to prevent unsuccessful dual relationships. These strategies included: boundaries, respect, communication, and awareness. Additionally, the web survey revealed that students and faculty did have training on dual relationships but the majority was limited to a general exposure in an ethics class. Furthermore, the faculty and students seemed to reflect diverse opinions on how to handle dual relationships, which is also present in the MFT field. The participants' perception of how dual relationships are viewed in the MFT field ranged from avoiding dual relationships to extolling the benefits of being in a dual relationship. To further explore how to create a successful dual relationship between faculty and students, in-depth telephone interviews with a sub-sample from the web survey were conducted. Five dyads, consisting of faculty and their respective students, were used. These interviews explored contextual issues related to positive non-sexual relationships between faculty and student dyads. An overarching theme revealed in the interviews was the amount of activity present for both students and faculty to create the successful dual relationships. Additionally, two major themes emerged, characteristics of success and strategies for success. Characteristics which seemed to facilitate the relationship were: student characteristics, faculty characteristics, nurturance, trust, awareness, being a person, decreased hierarchy/equality, and mutual respect. Strategies revealed in these relationships included: checking, open communication, viable boundaries, navigating boundaries, assessing risk, decreasing hierarchy, and advice. Also, implications for family therapy programs are presented, as are implications for future research.",
  "description_degree": "PhD",
  "description_provenance": [
    "Author Email: jlambert@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:46Z (GMT). No. of bitstreams: 1 jensdis1.pdf: 565902 bytes, checksum: c761214a779bc1d0f980a1085b847f7b (MD5)   Previous issue date: 2004-06-04"
  ],
  "handle": "28221",
  "identifier_other": "etd-07062004-174758",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07062004-174758/",
  "identifier_uri": "http://hdl.handle.net/10919/28221",
  "publisher": "Virginia Tech",
  "relation_haspart": "jensdis1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "dual relationships",
  "title": "Students and Faculty Members in Marriage and Family Therapy Programs: Navigating Successful Non-Sexual Dual Relationships",
  "type": "Dissertation"
}