{
  "contributor_author": "Whitney, Deran Richard",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Salmon, Richard G.",
    "Morgan, Linda T.",
    "Twiford, Travis W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:13:46Z",
  "date_adate": "2005-07-20",
  "date_available": "2014-03-14T20:13:46Z",
  "date_issued": "2005-04-19",
  "date_rdate": "2005-07-20",
  "date_sdate": "2005-07-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "In the new federal legislation, No Child Left Behind, two of the main themes direct attention to accountability and achievement gaps within subgroup populations. Early intervention may address both of these issues.  Specifically, this means quality preschool education. While many agree that preschool education offers much to young children, school leaders have a responsibility to present data to support the effectiveness of preschool programs.  This is a report of an evaluation of the effects of a state-funded preschool program on students' language acquisition measured with the Phonological Awareness Literacy Screening-Kindergarten at the end of the program; total English, word analysis, understanding elements of literature, and understanding a variety of resource materials measured with Virginia's Standards of Learning test in grade three; and instructional reading level measured with the STAR Reading Assessment in grade four. The performance of students who attended the Early Start Preschool Program in Suffolk Public Schools was compared with the performance of students who were eligible to attend but did not attend the program.  Two-way ANOVAs with analyses of simple main effects following significant interactions were applied to the data from ten samples of preschool children (five samples that attended the Suffolk, Virginia, preschool program and five samples that did not attend) for each year between1998 and 2002. There were few significant findings in this evaluation, and they were scattered across cohorts and dependent measures in no systematic order. Attending Early Start may have an effect on the literacy learning of children; however, this study did not provide the evidence that one would like to see in support of those effects. There are some findings, however, that point to some effects of attendance, particularly on rhyme awareness, concept of word, grade three total English, and grade three understanding elements of literature. These are tentative findings, at best, because they were not found consistently across cohorts.",
  "description_provenance": [
    "Author Email: deranwhitney@spsk12.va",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: rsalmon@vt.edu",
    "Advisor Email: ltmeducationconsulting@yahoo.com",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:46Z (GMT). No. of bitstreams: 1 Whitney_Dissertation_II.pdf: 241654 bytes, checksum: f88677bddffca8f73e1885c66e6f36d2 (MD5)   Previous issue date: 2005-04-19"
  ],
  "handle": "28226",
  "identifier_other": "etd-07082005-001811",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07082005-001811/",
  "identifier_uri": "http://hdl.handle.net/10919/28226",
  "publisher": "Virginia Tech",
  "relation_haspart": "Whitney_Dissertation_II.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "At-Risk",
    "Student Literacy Achievement",
    "Reading Performance",
    "Early Intervention",
    "Preschool"
  ],
  "title": "An Evaluation of a Preschool Program for At-Risk Four-Year-Olds in Suffolk, Virginia, Public Schools",
  "type": "Dissertation"
}