{
  "contributor_author": "Thigpen, James Ryan",
  "contributor_committeechair": "Law, Richard D.",
  "contributor_committeemember": [
    "Tracy, Robert J.",
    "Spotila, James A.",
    "Lloyd, Geoffrey E."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:13:47Z",
  "date_adate": "2009-07-16",
  "date_available": "2014-03-14T20:13:47Z",
  "date_issued": "2009-06-30",
  "date_rdate": "2009-07-16",
  "date_sdate": "2009-07-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Examination of deformation temperature, flow vorticity, and strain symmetry in the Loch Eriboll, Loch More, and Assynt regions of the Moine thrust zone (MTZ) in northwest Scotland allows quantitative kinematic and thermal characterization of a crustal-scale shear zone at the base of the Scandian (435-425 Ma) orogenic wedge. Quartz crystal fabrics, kinematic vorticity (Wm), and strain estimates from the ductile thrust sheets in this region are used to determine how pure and simple shear components of deformation are partitioned, and indicate that these processes may be thermally, structurally, and lithologically dependent. Vorticity analysis of samples collected along strike in the MTZ and overlying Moine nappe indicate that Scandian thrusting and deformation involved a considerable pure shear component. Integrated strain and vorticity estimates indicate that significant sub-vertical foliation normal shortening has occurred as nappe stacking progressed. Along strike Wm variation could not be directly correlated with changes in footwall structural architecture, lithology, deformation temperatures, or structural depth and are thus interpreted to reflect local variability driven by a complex interplay of these and possibly other factors. Quartz c- and a-axis fabrics indicate that deformation in the footwall of the Moine thrust involved plane strain to general flattening strain with only a minor rotational (non-coaxial) component. In contrast, deformation in the Moine nappe was strongly non-coaxial, as indicated by asymmetric single girdle c-axis fabrics. Quartz c-axis opening angles and microstructures suggest that deformation temperatures increase from north to south and from structurally lower to structurally higher levels in the footwall to the Moine thrust. Vertical ductile thinning must be accommodated by either volume loss or extrusion of material towards the synorogenic topographic surface. Extrusion towards the synorogenic topographic surface implies a causal link between upper and lower crustal processes, with significant implications for the kinematic, geometric, and kinetic (deformation rates) evolution of the Scandian orogenic wedge. New thermobarometric and deformation temperature estimates are combined with structural and kinematic investigations to characterize the thermal structure of the Moine, Ben Hope, and related nappes. At the leading edge of the Moine thrust, subhedral garnets with prograde compositional growth zoning yield peak temperatures (grt-bio) of 440-492 °C at 4.5-6.0 kbars from Creagan Meall Horn to northern Assynt. Three samples collected at similar structural positions along the leading edge of the Moine nappe yield deformation temperatures of 420-460 °C, as determined from quartz c-axis opening angles. At the structurally highest position in the Moine nappe, garnet prograde compositional zoning profiles are preserved and samples yields P-T estimates of 565-571 °C (grt-bio) and 4.5-5.1 kbar (GRAIL barometer, minimum pressure due to absence of Al2SiO5 phase). Quartz c-axis fabrics of samples collected at similar structural positions yield deformation temperature estimates of 490-565 °C. In the structurally higher Ben Hope nappe, two phases of prograde compositional growth zoning are preserved in garnet bearing amphibolite near Portvasgo. The later outer garnet rim records P-T conditions of 655-672 °C at 3.9-5.1 kbars. The inverted metamorphic sequence from the Moine to the Naver thrust is mostly intact and is interpreted to be Scandian (435-420 Ma) in age. It is likely that the formation of this inverted sequence is due to a combination of progressive accretion of successively lower grade thrust sheets onto the base of the Scandian wedge and heating of the Moine and Ben Hope nappes from above by the relatively higher temperature migmatites of the Naver thrust. Vertical ductile thinning, in conjunction with erosion and normal faulting, likely led to rapid exhumation of the Scandian nappe pile and in turn preserved the inverted metamorphic sequence.",
  "description_provenance": [
    "Author Email: thigpe05@vt.edu",
    "Advisor Email: rdlaw@vt.edu",
    "Advisor Email: rtracy@vt.edu",
    "Advisor Email: spotila@vt.edu",
    "Advisor Email: G.E.Lloyd@leeds.ac.uk",
    "Made available in DSpace on 2014-03-14T20:13:47Z (GMT). No. of bitstreams: 1 Thigpen.dissertation.v4.pdf: 40734377 bytes, checksum: d06bc076376bf800fc53b0d9d9cc91a6 (MD5)   Previous issue date: 2009-06-30"
  ],
  "handle": "28228",
  "identifier_other": "etd-07082009-110239",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07082009-110239/",
  "identifier_uri": "http://hdl.handle.net/10919/28228",
  "publisher": "Virginia Tech",
  "relation_haspart": "Thigpen.dissertation.v4.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "structural geology",
    "Moine thrust",
    "vorticity",
    "strain",
    "metamorphism"
  ],
  "title": "Vorticity of Flow, Deformation Temperatures, and Strain Symmetry of the Moine Thrust Zone, NW Scotland: Constraining the Kinematic and Thermal Evolution of a Collisional Orogenic System",
  "type": "Dissertation"
}