{
  "contributor_author": "Bowland, Adam Gregory",
  "contributor_committeechair": "Charney, Finley A.",
  "contributor_committeemember": [
    "Dowling, Norman E.",
    "Murray, Thomas M.",
    "Weyers, Richard E."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:13:47Z",
  "date_adate": "2011-08-01",
  "date_available": "2014-03-14T20:13:47Z",
  "date_issued": "2011-06-27",
  "date_rdate": "2011-08-01",
  "date_sdate": "2011-07-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation presents the results of a study performed to investigate methods for increasing the damping capacity of concrete.  A variety of additives, both particle and latex based, were added to standard concrete mixtures by replacing up to 20% of the fine aggregate to measure their effects on strength, stiffness, damping, and air content.  The additives included rubber particles from recycled tires, calcium carbonate particles, styrene butadiene rubber (SBR) latex, and a commercially available product named ConcreDamp which contains vegetable gum suspended in styrene butadiene latex. An initial investigation resulted in the observation that all of the additives with the exception of the SBR latex would both increase air content and decrease compressive strength.  As a result, combinations of additives were investigated to see if both the mechanical and dynamic properties could be improved.  The addition of steel fibers to mixtures with ground rubber were found to significantly increase air content which offset any gains in compressive strength.  The combination of ground rubber and latex was shown to improve both increase compressive strength and reduce air content. The study advanced to investigate the effects of rubber size on air content, strength, and damping.  It was found that for the same volume of rubber, a larger rubber particle would decrease air content, decrease compressive strength, and improve damping. The results of this study show that the best performing additive was the vegetable gum latex which improved the concrete damping by a factor of 2 when added as 15% of the fine aggregate.  Additionally, an equation is presented for calculating a strength reduction factor for concrete containing rubber particles of different sizes. Finally, two full scale footbridge laboratory specimens were tested to investigate the effect of increased material damping at the structural level.  One footbridge was constructed using a base concrete mixture without damping admixtures.  The second was constructed with a concrete mixture that contained a replacement of 15% of the fine aggregate with ground rubber. The results were used to create a finite element model in SAP2000 that was used to predict the effects that high damping concretes would have on the footbridge specimen.",
  "description_provenance": [
    "Author Email: abowland@vt.edu",
    "Advisor Email: fcharney@vt.edu",
    "Advisor Email: ndowling@vt.edu",
    "Advisor Email: thmurray@vt.edu",
    "Advisor Email: rweyers@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:47Z (GMT). No. of bitstreams: 2 Bowland_AG_D_2011_Permissions.pdf: 360979 bytes, checksum: 22695c891b4754dc7da1bd002a67ecf9 (MD5) Bowland_AG_D_2011.pdf: 10753925 bytes, checksum: 7e7bc994095dd6af78d637c3d591f54b (MD5)   Previous issue date: 2011-06-27"
  ],
  "handle": "28229",
  "identifier_other": "etd-07082011-114623",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07082011-114623/",
  "identifier_uri": "http://hdl.handle.net/10919/28229",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Bowland_AG_D_2011_Permissions.pdf",
    "Bowland_AG_D_2011.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Damping",
    "Concrete Admixtures",
    "Rubber",
    "Latex",
    "Calcium Carbonate"
  ],
  "title": "Comparison and Analysis of the Strength, Stiffness, and Damping Characteristics of Concrete with Rubber, Latex, and Carbonate Additives",
  "type": "Dissertation"
}