{
  "contributor_author": "Jensen, Robert Eric",
  "contributor_committeechair": "Ward, Thomas C.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Dillard, John G.",
    "Riffle, Judy S.",
    "Wightman, James P."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:13:46Z",
  "date_adate": "1999-07-09",
  "date_available": "2014-03-14T20:13:46Z",
  "date_issued": "1999-06-09",
  "date_rdate": "2000-07-09",
  "date_sdate": "1999-07-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Research is presented which encompasses a study of epoxies based on diglycidyl ether of bisphenol A (DGEBA) cured with 2-ethyl-4-methylimidazole (EMI-24) in the presence of the nonionic surfactant Triton X-100.  Interest in this epoxy system is due partially to the potential application as a waterborne replacement for solvent cast epoxies in E-glass laminated printed circuit boards.  This research has revealed that the viscoelastic behavior of the cured epoxy is altered when serving as the matrix in a glass composite.  The additional constraining and coupling of the E-glass fibers to the segmental motion of the epoxy matrix results in an increased level of viscoelastic cooperativity.  Current research has determined that the cooperativity of an epoxy/E-glass composite is also sensitive to the surface chemistry of the glass fibers.  Model single-ply epoxy/E-glass laminates were constructed in which the glass was pretreated with either 3-aminopropyltriethoxysilane (APS) or 3-glycidoxypropyltrimethoxysilane (GPS) coupling agents.  Dynamic mechanical analysis (DMA) was then used to create master curves of the storage modulus (E') in the frequency domain.  The frequency range of the master curves and resulting cooperativity plots clearly varied depending on the surface treatment of the glass fibers. It was determined that the surfactant has surprisingly little effect in the observed trends in cooperativity of the composites.  However, the changes in cooperativity due to the surface pretreatment of the glass were lessened by the aqueous phase of the waterborne resin. Moisture uptake experiments were also performed on epoxy samples that were filled with spherical glass beads as well as multi-ply laminated composites.  No increases in the diffusion constant  could be attributed to the surfactant. However, the surfactant did enhance the final equilibrium moisture uptake levels.  These equilibrium moisture uptake levels were also sensitive to the surface pretreatment of the E-glass.",
  "description_provenance": [
    "Author Email: rjensen@vt.edu",
    "Advisor Email: tward@chemserver.chem.vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: dillardj@mail.vt.edu",
    "Advisor Email: jriffle@chemserver.chem.vt.edu",
    "Advisor Email: wightman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:46Z (GMT). No. of bitstreams: 1 ROBJENSEN.PDF: 2514864 bytes, checksum: ba85ced511fd733dfcb64c6dd9dbebc0 (MD5)   Previous issue date: 1999-06-09"
  ],
  "handle": "28225",
  "identifier_other": "etd-070799-133604",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-070799-133604/",
  "identifier_uri": "http://hdl.handle.net/10919/28225",
  "publisher": "Virginia Tech",
  "relation_haspart": "ROBJENSEN.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "waterborne epoxy",
    "cooperativity",
    "moisture uptake",
    "interphase",
    "interfacial shear strength"
  ],
  "title": "Investigation of Waterborne Epoxies for E-Glass Composites",
  "type": "Dissertation"
}