{
  "contributor_author": "McKee, Clayton T",
  "contributor_committeechair": "Ducker, William A.",
  "contributor_committeemember": [
    "Yoon, Roe-Hoan",
    "Tanko, James M.",
    "Davis, Richey M.",
    "Anderson, Mark R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:13:48Z",
  "date_adate": "2006-12-29",
  "date_available": "2014-03-14T20:13:48Z",
  "date_issued": "2006-07-26",
  "date_rdate": "2006-12-29",
  "date_sdate": "2006-07-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation describes new methods for measuring surface forces using evanescent waves, and applications to non-DLVO forces.  An evanescent wave, generated at a solid-liquid interface, is scattered by AFM tips or particles attached to AFM cantilevers.  The scattering of this wave is used to determine absolute separation between surfaces and/or the refractive index as a function of separation in AFM measurements.  This technique is known as evanescent wave atomic force microscopy (EW-AFM).   The scattering of an evanescent wave by Si3N4 AFM tips is large and decays exponentially with separation from a refractive index boundary.  Thus, scattering is a useful method for measuring the separation between a Si3N4 tip and sample.  This method has been used to measure the absolute separation between a tip and sample in the presence of an irreversibly adsorbed polymer film.  Measurement of the film thickness and time response of the polymer to applied loads has also been studied.  These measurements are not possible using current AFM techniques.  In addition to measurements in polymer systems, the simple scattering profile from Si3N4 tips was used to re-examine short range hydration forces between hydrophilic surfaces.  Results presented in this thesis suggest this force does not depend on the hydrated radius of the ion between glass and silicon nitride.  The scattering generated by a Si3N4 tip has also been used to measure the refractive index of bulk fluids and thin films between hydrophobic surfaces.  Based on these results, I have shown that a long-range attraction between hydrophobic surfaces is accompanied by an increase in the refractive index between the tip and surface.  From this I have concluded that the attractive force, measured in this study, is the result of an increase in the concentration of organic material between surfaces.  Finally, I have shown that the scattering profile depends on the material and size of the scattering object.  Scattering from silicon nitride tips is exponential with separation.  In contrast, the scattering profile from silicon tips, which are similar in size and geometry, is not a simple exponential.  The scattering profile of larger spherical particles attached to cantilevers is also not exponential.  It is approximately the sum of two exponentials.  The functional form of the scattering profile with separation is consistent with the transmission of evanescent light through flat planar films.  This result would suggest that a re-examination of the separation-dependence of scattering in TIRM measurements is necessary.",
  "description_provenance": [
    "Author Email: cmckee@vt.edu",
    "Advisor Email: ryoon@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: maander6@vt.edu",
    "Advisor Email: wducker@unimelb.edu.au",
    "Made available in DSpace on 2014-03-14T20:13:48Z (GMT). No. of bitstreams: 1 Clayton_McKee_PhD_Dissertation.pdf: 1784264 bytes, checksum: 7f522d31a1afd46afb9f01bd70479b99 (MD5)   Previous issue date: 2006-07-26"
  ],
  "handle": "28233",
  "identifier_other": "etd-07092006-234028",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07092006-234028/",
  "identifier_uri": "http://hdl.handle.net/10919/28233",
  "publisher": "Virginia Tech",
  "relation_haspart": "Clayton_McKee_PhD_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "EW-AFM",
    "thin film refractive index",
    "evanescent wave scattering",
    "AFM",
    "steric force",
    "hydration force",
    "hydrophobic force"
  ],
  "title": "Investigation of Non-DLVO Forces using an Evanescent Wave Atomic Force Microscope",
  "type": "Dissertation"
}