{
  "contributor_author": "Liu, Zihong",
  "contributor_committeechair": "Cousins, Thomas E.",
  "contributor_committeecochair": "Lesko, John J.",
  "contributor_committeemember": [
    "Roberts-Wollmann, Carin L.",
    "Plaut, Raymond H.",
    "Sotelino, Elisa D."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:13:48Z",
  "date_adate": "2007-07-27",
  "date_available": "2014-03-14T20:13:48Z",
  "date_issued": "2007-06-27",
  "date_rdate": "2007-07-27",
  "date_sdate": "2007-07-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A fiber reinforced polymer (FRP) composite cellular deck system was used to rehabilitate a historical cast iron thru-truss structure (Hawthorne St. Bridge in Covington, Virginia). This research seeks to address following technical needs and questions to advance FRP deck application.  The critical panel-to-panel connections were developed and evolved through a four-stage study and finally realized using full width, adhesively bonded tongue and groove splices with scarfed edges. Extensive experimental study under service, strength and fatigue loads in a full-scale two-bay mock-up test and a field test was performed. Test results showed that no crack initiated in the joints under service load and no significant change in stiffness or strength of the joint occurred after 3,000,000 cycles of fatigue loading. Various issues related to constructability of FRP deck systems were investigated and construction guidelines and installation procedures for the deck system were established. The structural performance of the FRP-on-steel-superstructure system was examined in the laboratory and field under service load. Tests results confirmed the following findings: (1) the clip-type of panel-to-stringer connection provides little composite action as expected, which fulfilled the design intention; (2) local effects play an important role in the performance of FRP deck; (3) the FRP deck design is stiffness driven rather than strength driven like traditional concrete deck. Finally, an FEM parametric study was conducted to examine two important design issues concerning the FRP decks, namely deck relative deflection and LDF of supporting steel girders. Results from both FEM and experiments show that the strip method specified in AASHTO LRFD specification (AASHTO 2004) as an approximate method of analysis can also be applied to unconventional FRP decks as a practical method. However, different strip width equations have to be determined by either FEM or experimental methods for different types of FRP decks. In this study, one such an equation has been derived for the Strongwell deck. In addition, the AASHTO LDF equations for glued laminated timber decks on steel stringers provide good estimations of LDFs for FRP-deck-on-steel-girder bridges. The lever rule can be used as an appropriately conservative design method to predict the LDFs of FRP-deck-on-steel-girder bridges.",
  "description_provenance": [
    "Author Email: lzh@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: wollmann@vt.edu",
    "Advisor Email: rplaut@vt.edu",
    "Advisor Email: tcousins@vt.edu",
    "Advisor Email: sotelino@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:48Z (GMT). No. of bitstreams: 1 Dissertation(ZLiu).pdf: 5325540 bytes, checksum: 14ca3c92ea0cea0497b1b8545987b136 (MD5)   Previous issue date: 2007-06-27"
  ],
  "handle": "28234",
  "identifier_other": "etd-07092007-141919",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07092007-141919/",
  "identifier_uri": "http://hdl.handle.net/10919/28234",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation(ZLiu).pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "finite element",
    "rehabilitation",
    "bridge deck",
    "structure",
    "pultrusion",
    "Fiber-reinforced polymer (FRP)",
    "composite"
  ],
  "title": "Testing and Analysis of a Fiber-Reinforced Polymer (FRP) Bridge Deck",
  "type": "Dissertation"
}