{
  "contributor_author": "Vitullo, Justin Matthew",
  "contributor_committeechair": "Bergh, J. Christopher",
  "contributor_committeecochair": "Zhang, Aijun",
  "contributor_committeemember": [
    "Mannion, Catharine",
    "Fell, Richard D.",
    "Pfeiffer, Douglas G."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:13:49Z",
  "date_adate": "2009-07-21",
  "date_available": "2014-03-14T20:13:49Z",
  "date_issued": "2009-06-25",
  "date_rdate": "2009-07-21",
  "date_sdate": "2009-07-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The pink hibiscus mealybug (PHM), Maconellicoccus hirsutus (Green) (Hemiptera: Pseudococcidae) was investigated with regard to damage caused to hibiscus by feeding, dispersal of nymphs, evaluation of management tactics, and the use of sex pheromone based monitoring in southern Florida from 2005 to 2008. Understanding the ability of PHM to locate and colonize new hosts, and the response of hosts is essential to optimized monitoring and management strategies.  Investigation of the onset and severity of PHM feeding symptoms by Hibiscus rosa-sinensis L. showed that severity of symptoms differed among cultivars and that PHM were found on plants that did not exhibit feeding symptoms. Aerially dispersing PHM were predominantly first instars. Dispersal occurred with a diel periodicity that peaked between 14:00 and 18:00 h and was significantly influenced by mean wind speed. Initial infestation with 5, 10, or 20 PHM adult females had no significant affect on the number of dispersing individuals captured from hibiscus plants and PHM were captured at 50 m from infested source plants. The effects of mating disruption, the insecticide (dinotefuran), the parasitoid, Anagyrus kamali (Moursi), and the predator, Cryptolaemus montrouzieri (Mulsant) on PHM on hibiscus plants in screened field cages were evaluated. The total number of mealybugs captured in sticky band and pheromone traps during the study was reduced by dinotefuran and the predator. At the end of the study, the number of nymphs recovered from hibiscus terminals was reduced by the dinotefuran, predator and parasitoid treatments. Field experiments showed that the time of day during which male PHM were captured in pheromone traps in May and September was crepuscular, with most captures occurring from 18:00 to 21:00 h. Significantly more males were captured in traps placed in non-host trees at an elevation of 2 m above the ground than 6 m, and more males were captured in traps placed within host plants than in those 3 m upwind. Pheromone traps placed in hibiscus treated with soil applied dinotefuran or left untreated captured equal numbers of males during the 3 wk prior to treatment and during the 12 wk after treatment. Release of parasitoids at residential sites did not have a significant effect on the total number of males captured in sex pheromone traps over 18 mo. The number of mealybugs found at both parasitoid release and untreated sites were highly variable and corresponded with males captured in sex pheromone traps, as high and low levels of mealybugs corresponded with high and low levels of males captured. The number of males captured in pheromone traps during a two week survey at residential sites in May were a strong predictor of subsequent captures in 2006 (r2 = 0. 712), but not 2007 (r2 = 0.019). The relationship between PHM populations and males captured in sex pheromone traps was influenced by a multitude of factors that can impact the ability of traps to accurately reflect populations at a given location. Pheromone traps have the potential to provide meaningful information towards monitoring and mitigating risk from PHM. The contributions of this dissertation towards optimizing PHM sex pheromone monitoring, as well as facets of PHM monitoring that have yet to be resolved are discussed.",
  "description_provenance": [
    "Author Email: jvitullo@vt.edu, justin.vitullo@gmail.com",
    "Advisor Email: cbergh@vt.edu",
    "Advisor Email: Aijun.Zhang@ars.usda.gov",
    "Advisor Email: cmannion@ifas.ufl.edu",
    "Advisor Email: rfell@vt.edu",
    "Advisor Email: dgpfeiff@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:49Z (GMT). No. of bitstreams: 1 VitulloJdissertation09.pdf: 1640340 bytes, checksum: 3c64e8ef1df9770127a74668f452a81f (MD5)   Previous issue date: 2009-06-25"
  ],
  "handle": "28238",
  "identifier_other": "etd-07092009-200128",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07092009-200128/",
  "identifier_uri": "http://hdl.handle.net/10919/28238",
  "publisher": "Virginia Tech",
  "relation_haspart": "VitulloJdissertation09.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mating disruption",
    "sex pheromone",
    "monitoring",
    "Hibiscus rosa-sinensis",
    "Maconellicoccus hirsutus"
  ],
  "title": "Ecological and behavioral factors associated with monitoring and managing pink hibiscus mealybug (Hemiptera: Pseudococcidae) in the southern US",
  "type": "Dissertation"
}