{
  "contributor_author": "Grimes, Therese  Ehrgott",
  "contributor_committeecochair": [
    "Houck, Cherry K.",
    "Cross, Lawrence H."
  ],
  "contributor_committeemember": [
    "Weber, Larry J.",
    "Sabaroff, Rose",
    "Fu, Victoria R."
  ],
  "contributor_department": "Educational Supervision",
  "date_accessioned": "2014-03-14T20:13:49Z",
  "date_adate": "2010-07-09",
  "date_available": "2014-03-14T20:13:49Z",
  "date_issued": "1981-03-05",
  "date_rdate": "2010-07-09",
  "date_sdate": "2010-07-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>This study investigated the relevance of a Neo-Piagetian theory of cognitive development in examining the competence/performance discrepancy associated with children who have specific learning disabilities. According to Neo-Piagetian theory (Pascual-Leone, 1970), a cognitive device called the M-operator is responsible for the integration of schemes necessary to solve developmental tasks. The M-capacity available to children increases in an all or none fashion according to a linear scale which corresponds to the Piagetian substages of cognitive development. A moderator variable which is conceptualized as the cognitive style field-independence-dependence may determine whether a child demonstrates his modal M-capacity on a task which demands the application of maximum M-space.</p> <p> A matched pairs design was applied in order to compare the performance of 25 learning disabled and 25 normally achieving boys ages 8.5 to 10.0 years on measures of M-capacity, field-independence, and level of operative thinking. It was hypothesized that the learning  disabled boys would demonstrate M-capacities comparable to the normally achieving boys, but would be more field dependent, thereby manifesting a discrepancy between their structural and functional M-capacities on Piagetian tasks.</p> <p> Comparisons of group differences on two criterion measures of M-capacity, two measures of field independence (the Children's Embedded Figures Test and WISC-R Block Design Subtest), and seven classical Piagetian tasks which included measures of conservation, seriation, and classification abilities, yielded the following results:</p> <p> 1. The learning disabled group obtained significantly lower M-space estimates than the normally achieving group;</p> <p> 2. The learning disabled group obtained significantly lower scores on the instruments used to assess level of field independence;</p> <p> 3. The learning disabled group failed more Piagetian tasks than the normally achieving group, therefore manifesting a delay in operative thinking.</p> <p> 4. The relationships between the two measures of M-space and the two measures of field-independence were markedly different for the two samples. The results indicated a lack of independence between M-capacity and a field dependent cognitive style in the LD group; no comparable relationship was found within the NA group.</p> <p> Further research applying Neo-Piagetian theory in order to investigate the disabled boys would demonstrate M-capacities comparable to the normally achieving boys, but would be more field dependent, thereby manifesting a discrepancy between their structural and functional M-capacities on Piagetian tasks.</p> <p> Comparisons of group differences on two criterion measures of M-capacity, two measures of field independence (the Children's Embedded Figures Test and WISC-R Block Design Subtest), and seven classical Piagetian tasks which included measures of conservation, seriation, and classification abilities, yielded the following results:</p> <p> 1. The learning disabled group obtained significantly lower M-space estimates than the normally achieving group;</p> <p> 2. The learning disabled group obtained significantly lower scores on the instruments used to assess level of field independence;</p> <p> 3. The learning disabled group failed more Piagetian tasks than the normally achieving group, therefore manifesting a delay in operative thinking.</p> <p> 4. The relationships between the two measures of M-space and the two measures of field-independence were markedly different for the two samples. The results indicated a lack of independence between M-capacity and a field dependent cognitive style in the LD group; no comparable relationship was found within the NA group.</p> <p> Further research applying Neo-Piagetian theory in order to investigate the inefficient processing strategies used by children with learning disabilities appears warranted. Testing interventions which restructure cognitive tasks by reducing memory load demands and/or allow LD children to develop and apply efficient task strategies is needed.</p>",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:13:49Z (GMT). No. of bitstreams: 1 LD5655.V856_1981.G756.pdf: 4356933 bytes, checksum: 474c7a08e8acf6e1cf4460d9010dc074 (MD5)   Previous issue date: 1981-03-05",
  "format_medium": "BTD",
  "handle": "28239",
  "identifier_other": "etd-07092010-020023",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07092010-020023/",
  "identifier_uri": "http://hdl.handle.net/10919/28239",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1981.G756.pdf",
  "subject": [
    "a cognitive device called the M-operator is respon",
    "1970)",
    "and level of operative thinking. It was hypothesiz",
    "field-independence",
    "a cognitive device called the M-operator is respon",
    "1970)",
    "Learning disabilitiesThis study investigated the r",
    "field-independence",
    "and level of operative thinking. It was hypothesiz"
  ],
  "subject_lcc": "LD5655.V856 1981.G756",
  "title": "A comparative study of information processing capacity and cognitive style in learning disabled and normally achieving boys :a Neo- Piagetian approach",
  "type": "Dissertation"
}