{
  "contributor_author": "Byrd, Trevor G.",
  "contributor_committeechair": "Foti, Roseanne J.",
  "contributor_committeecochair": "Donovan, John J.",
  "contributor_committeemember": [
    "Hauenstein, Neil M. A.",
    "Carlson, Kevin D."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:13:48Z",
  "date_adate": "2009-08-03",
  "date_available": "2014-03-14T20:13:48Z",
  "date_issued": "2009-06-26",
  "date_rdate": "2012-05-08",
  "date_sdate": "2009-07-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study replicated and extended existing research concerning task prioritization in multiple-goal scenarios. The theoretical perspectives on which hypotheses were based was a combination of Banduraâ  s self-efficacy theory (1986) and rational models of control theory (Klein, 1989; Lord & Levy, 1994). Participants were 216 college students who received extra-credit points for their involvement. They performed six repeated trials on a computerized task consisting of two simultaneous sub-tasks. Participants pursued an assigned long-term goal on each task, and goal achievement was rewarded with additional extra-credit points as an incentive. Task prioritization was assessed with four separate measures of effort allocation, including the time spent on each task, the number of computer mouse-clicks made within each task, scores on a self-report assessment of exerted effort, and responses to a self-report task prioritization assessment. Results indicated that participants prioritized tasks on which they were closer to goal attainment, tasks on which they were more efficacious, tasks on which they were experiencing a faster rate of progress, and tasks on which they reported greater goal commitment. Results also indicated that the effect of goal-performance discrepancies (GPDs) on task prioritization was mediated by self-efficacy. Further the amount of time remaining before a deadline moderated the relationship between GPD and task prioritization, although the form of this relationship was not in the proposed direction. Achievement goals were examined as moderators of the relationship between GPDs and task prioritization, but results were non-significant. Overall, these findings provide additional evidence that expectancies are often central to understanding self-regulation in multiple-goal scenarios, as first asserted by Kernan and Lord (1990). The current study also provides additional evidence concerning the importance of temporal factors in determining resource allocation in multiple-goal scenarios. Results from the current study point toward multiple issues for exploration in future research, such as an integrated model focusing in part on the pivotal role of self-efficacy or other expectancy-related constructs. Results also demonstrate implications for applied work, including clear evidence that employees should be expected to allocate their finite resources toward goals on which they believe success is most likely.",
  "description_provenance": [
    "Author Email: trbyrd@vt.edu",
    "Advisor Email: jdonovan@rider.edu",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: kevinc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:48Z (GMT). No. of bitstreams: 1 ByrdDissertationFinal.pdf: 797577 bytes, checksum: 0d84036a31ac12c7191032951ec61d98 (MD5)   Previous issue date: 2009-06-26"
  ],
  "handle": "28237",
  "identifier_other": "etd-07092009-122101",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07092009-122101/",
  "identifier_uri": "http://hdl.handle.net/10919/28237",
  "publisher": "Virginia Tech",
  "relation_haspart": "ByrdDissertationFinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "self-regulation",
    "task prioritization",
    "multiple goal"
  ],
  "title": "Prioritizing Effort Allocation in a Multiple-Goal Environment",
  "type": "Dissertation"
}