{
  "contributor_author": "Boyle, Jon",
  "contributor_committeechair": "Wiswell, Albert K.",
  "contributor_committeemember": [
    "Hoffman, Edward J.",
    "Piercy, Fred P.",
    "Combs, Letitia A.",
    "Cline, Marvin Gerald"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:13:48Z",
  "date_adate": "2002-07-18",
  "date_available": "2014-03-14T20:13:48Z",
  "date_issued": "2002-06-25",
  "date_rdate": "2003-07-18",
  "date_sdate": "2002-07-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research study explored the theoretical underpinnings of implementing government reform in the National Aeronautics and Space Administration (NASA), specifically focusing on a management philosophy called Faster, Better, Cheaper (FBC).  It is situated within the broader context of Government reform efforts that attempt to increase the efficiency and effectiveness of government organizations in their delivery of products and services to the public.    <p>This study employed the Grounded Theory qualitative research methodology that concentrates on a central phenomenon and generates a theory from a category or construct-oriented approach.  The objective is to generate a substantive-level theory that describes the practice of FBC within NASA and is grounded in the data collected from the organization.  The following research questions guided this study:  <p>1.\tWhat is the meaning of Faster, Better, Cheaper for Public Professionals in the NASA organizational environment?  <p>2.\tWhat are the interrelationships between concepts of faster, better, and cheaper?  <p>3.\tHow does the technical and cultural structure of NASA influence the implementation of Faster, Better, Cheaper?  <p>4.\tWhat are the required workforce capabilities to perform Faster, Better, Cheaper in NASA?  <p>The theoretical sample for this study consisted of interviews scheduled with NASA personnel involved in Faster, Better, Cheaper projects.  NASA documents and reports were analyzed to saturate the initial 29 provisional categories.  A representation of the phenomenon of FBC was developed following the data analysis, including causal conditions, strategies, environmental conditions and context, and consequences.  Several findings addressed the meaning of FBC, the interrelationships between the concepts, the impact of organizational infrastructure, and required workforce capabilities.  Topics for future research are the nature of risk in public organizations, tools for aligning and measuring public policy alignment and implementation, leadership of public sector teams, and generalizing the findings to other organizations.",
  "description_provenance": [
    "Author Email: hillhog@msn.com",
    "Advisor Email: edward.hoffman@hq.nasa.gov",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: combsl@vt.edu",
    "Advisor Email: awiswell@vt.edu",
    "Advisor Email: mcline@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:48Z (GMT). No. of bitstreams: 3 BoyleETD1.pdf: 394606 bytes, checksum: 7bd43ac98855b3615f56c8a9565cef5c (MD5) BoyleETD3.pdf: 1067436 bytes, checksum: 49ccf9e5ab62c81ddac0d8363b573c13 (MD5) BoyleETD2.pdf: 470410 bytes, checksum: 5ff3a145381a1a0f4fe04b16d546d1e1 (MD5)   Previous issue date: 2002-06-25"
  ],
  "handle": "28231",
  "identifier_other": "etd-07092002-182312",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07092002-182312/",
  "identifier_uri": "http://hdl.handle.net/10919/28231",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "BoyleETD1.pdf",
    "BoyleETD3.pdf",
    "BoyleETD2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Workforce Development",
    "Government Reform",
    "NASA",
    "Grounded Theory"
  ],
  "title": "Working \"Faster, Better, Cheaper\": A Federal Research Agency in Transition",
  "type": "Dissertation"
}