{
  "contributor_author": "Pokharel, Mohan Prasad",
  "contributor_committeecochair": [
    "Dudley, Larkin S.",
    "Rees, Joseph V."
  ],
  "contributor_committeemember": [
    "Hult, Karen M.",
    "Murray, William L."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:13:50Z",
  "date_adate": "2007-08-06",
  "date_available": "2014-03-14T20:13:50Z",
  "date_issued": "2007-06-28",
  "date_rdate": "2007-08-06",
  "date_sdate": "2007-07-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Many public administration scholars and administrators look to the concept of organizational learning as a means of coping with shrinking resources and increasing responsibilities and accountability. At the theoretical level, the notion of organizational learning is appealing, since it emphasizes achieving organizational goals through optimization of internal resources, i.e., assimilation of staff members' fullest potential and organizational visions through the synergistic effects of knowledge creation and continuous learning. There has been a fascination without foundation about organizational learning among scholars of public sector organizations because the validity and utility of organizational learning theory has not been tested in public sector organizations.  <p> From the perspective of organizational learning, this dissertation evaluates an intervention program&#8211;the penetration rate enhancement project (PREP)&#8211;to determine whether and to what extent organization learning has taken place in selected localities. The penetration rate is a foster care funding ratio of federal to state and local dollars. The Commonwealth of Virginia's Department of Social Services through collaborative relationships sought to impart policy knowledge (cooptation) in the local departments of social services (LDSS). </p><p> This study measured the presence (or absence) of a learning environment that was hypothesized  to  influence the degree of organizational learning and tested whether it correlates with learning variations as approximated by the penetration rate in LDSSs over a period of more than four years. The main research focus is whether an effective learning environment was related to the extent of learning and thereby may help explain learning variation in public sector organizations. This study uses mixed methods to examine the research questions.  </p><p> The study found evidence of some differential, dispersed, and intermittent learning in various localities. The localities are classified as exhibiting conscious learning, facade learning, unaware learning, and absent learning. Those localities that learned and exhibited evidence of a learning environment are referred to as conscious learners; those localities that  saw the presence of learning environment but had not been able to learn are referred to as having experienced facade learning; those localities that have learned but did not see a presence of a leaning environment are referred as to being marked by  unaware learning; and those localities that did not learn and did not have a presence of a learning environment are referred to as exhibiting absent learning. </p>  The anecdotes of special difficulties experienced by public sector organizations to learn have been reaffirmed by the differential perceptions about learning environments held by the senior and junior level staffers in LDSSs. It is also apparent that problematic organizational structures, an economic (dis)incentive system, and the omission of financial component all contributed to the constraints on organizational learning in LDSSs. Despite the constraints, however, the PREP was largely successful in cultivating organizational learning at the LDSSs, and the organizational learning lens for evaluating intervention programs in public sector organizations at the local level was valid.",
  "description_provenance": [
    "Author Email: mpokhare@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Advisor Email: William.L.Murray@dom.com",
    "Made available in DSpace on 2014-03-14T20:13:50Z (GMT). No. of bitstreams: 2 MPP_Dissertation.pdf: 1013154 bytes, checksum: aaa4b4678e97ad78b417f94cd9048186 (MD5) IRB_Approval_06-183Amend2.pdf: 240590 bytes, checksum: 828d39da276d35770531db4c2cff79b3 (MD5)   Previous issue date: 2007-06-28"
  ],
  "handle": "28249",
  "identifier_other": "etd-07102007-103411",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07102007-103411/",
  "identifier_uri": "http://hdl.handle.net/10919/28249",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "MPP_Dissertation.pdf",
    "IRB_Approval_06-183Amend2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Public Sector",
    "Organizational Learning",
    "Program Evaluation"
  ],
  "title": "Gauging Learning in Public Sector Organizations: A Case Study of the Penetration Rate Enhancement Program (PREP) of the Virginia Department of Social Services",
  "type": "Dissertation"
}