{
  "contributor_author": "Silkworth, William Thomas",
  "contributor_committeechair": "Cimini, Daniela",
  "contributor_committeemember": [
    "Ju, Young H.",
    "Kuhn, Jeffrey R.",
    "Walker, Richard A."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:13:49Z",
  "date_adate": "2012-07-27",
  "date_available": "2014-03-14T20:13:49Z",
  "date_issued": "2012-06-26",
  "date_rdate": "2012-07-27",
  "date_sdate": "2012-07-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "At any given time there are on the order of one hundred million cells undergoing mitosis in the human body. To accurately segregate chromosomes, the cell forms the bipolar mitotic spindle, a molecular machine that distributes chromosomes equally to the daughter cells. To this end, microtubules of the mitotic spindle must appropriately attach the kinetochores: protein structures that form on each chromatid of each mitotic chromosome. The majority of the time correct kinetochore microtubule attachments are formed. However, mis-attachments can and do form. Mis-attachments that are not corrected before chromosome segregation can give rise to aneuploidy, an incorrect number of chromosomes. Aneuploidy occurring in the germ line can cause both miscarriage and genetic diseases. Furthermore, aneuploidy is a major characteristic of cancer cells, and aneuploid cancer cells frequently mis-segregate chromosomes at high rates, a phenotype termed chromosomal instability (CIN). CIN has been correlated with both advanced tumorigenesis and poor patient prognosis and over the years there have been many hypotheses for what causes CIN. In this study, we identified two distinct mechanisms that are responsible for CIN. Both of these mechanisms cause a transient, abnormal geometric arrangement of the mitotic spindle. Specifically, cancer cells possess supernumerary centrosomes, which lead to the assembly of multipolar spindles during early mitosis when attachments between kinetochores and microtubules are forming. Supernumerary centrosomes facilitate the formation of merotelic attachments, in which a single kinetochore binds microtubules from more than one centrosome. As mitosis progresses the supernumerary centrosomes cluster, giving rise to a bipolar spindle by the time of chromosome segregation. However, the high rates of merotelic attachments formed during the transient multipolar stage result in high rates of chromosome mis-segregation. The second geometric defect characterized is caused by failure of centrosomes to separate before kinetochore-microtubule attachments begin to form. This mechanism, too, leads to high rates of kinetochore mis-attachment formation and high rates of chromosome mis-segregation. Finally, this study shows that the mechanisms characterized here are prevalent in human cancer cells from multiple organ sites, thus revealing that both mechanisms are a common cause of CIN.",
  "description_provenance": [
    "Author Email: wtsilk1@vt.edu",
    "Advisor Email: cimini@vt.edu",
    "Advisor Email: yhju@vt.edu",
    "Advisor Email: jrkuhn@vt.edu",
    "Advisor Email: rawalker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:49Z (GMT). No. of bitstreams: 2 Silkworth_WT_D_2012.pdf: 4326750 bytes, checksum: a0c71382b5b2b00abfbc14038de9e661 (MD5) Silkworth_WT_D_2012_Copyright.pdf: 91012 bytes, checksum: 790fa938a50e4bea9242662059b86d3f (MD5)   Previous issue date: 2012-06-26"
  ],
  "handle": "28241",
  "identifier_other": "etd-07092012-140818",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07092012-140818/",
  "identifier_uri": "http://hdl.handle.net/10919/28241",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Silkworth_WT_D_2012.pdf",
    "Silkworth_WT_D_2012_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "merotelic kinetochore attachment",
    "mitotic spindle geometry",
    "chromosome mis-segregation",
    "aneuploidy",
    "mitosis"
  ],
  "title": "The effect of spindle geometry on the establishment of merotelic kinetochore attachment and chromosome mis-segregation",
  "type": "Dissertation"
}