{
  "contributor_author": "McNeill, Laurie S.",
  "contributor_committeechair": "Edwards, Marc A.",
  "contributor_committeemember": [
    "Novak, John T.",
    "Knocke, William R.",
    "Dietrich, Andrea M.",
    "Long, Gary L."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:13:49Z",
  "date_adate": "2000-07-12",
  "date_available": "2014-03-14T20:13:49Z",
  "date_issued": "2000-06-27",
  "date_rdate": "2001-07-12",
  "date_sdate": "2000-07-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Corrosion is one of the most complicated and costly problems facing drinking water utilities.  Corrosion of iron pipes can lead to economic losses and customer complaints, while lead corrosion poses a serious health risk.  This work first synthesizes nearly 100 years of iron corrosion research to provide the water industry with an updated understanding of factors that influence iron pipe corrosion including water quality and composition, flow conditions, biological activity, and corrosion inhibitors.  Potential impacts of upcoming regulations on iron corrosion are also considered.  Next, a four-year study is presented that evaluated the effect of water quality and phosphate inhibitors on the corrosion of iron pipes under extended stagnant water conditions.  Surprisingly, many of the water quality parameters traditionally thought to influence iron corrosion were not controlling under these \"worst case\" stagnant conditions.  Moreover, addition of phosphate inhibitors often had either no statistically significant effect or actually increased iron concentration, scale build-up and overall weight loss. \tTemperature is often overlooked when corrosion of distribution systems pipes is considered.  Temperature impacts many parameters that are critical to pipe corrosion including physical properties of the solution, thermodynamic and physical properties of corrosion scale, chemical rates, and biological activity.  Moreover, variations in temperature and temperature gradients may give rise to new corrosion phenomena worthy of consideration by water treatment personnel.  In laboratory experiments, cast iron samples at 5° C had 23% more weight loss, ten times higher iron release to water, and twice as much tuberculation compared to samples at 25°C. \tFor lead corrosion, hexametaphosphate inhibitors were proven to increase release of both particulate and soluble lead to drinking water by 200 - 3500% over a wide range of water qualities when compared to orthophosphate, effectively ending a long term debate as to their impacts.  Utilities should consider these adverse effects whenever polyphosphate is used to prevent scaling or iron precipitation.",
  "description_provenance": [
    "Author Email: lmcneill@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Advisor Email: edwardsm@vt.edu",
    "Advisor Email: knocke@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Advisor Email: glong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:49Z (GMT). No. of bitstreams: 8 ch2.pdf: 109445 bytes, checksum: 3ecd8204dc21f54f34aa2a1b80de12d8 (MD5) McNeillvita.pdf: 18852 bytes, checksum: b29a3b48593ef55b15235b3c8cab6bab (MD5) appA.pdf: 10016 bytes, checksum: 981871bee6ffa5d36be9f0a33085e166 (MD5) ch1.pdf: 126559 bytes, checksum: 6859da2342104287b900a2784a2ee558 (MD5) frontmatter.pdf: 24140 bytes, checksum: dbbdad18848f66fbe06d6b313ba1460e (MD5) ch5.pdf: 149174 bytes, checksum: 41f9bdf82d5e35d63fcdbbfbb89df55f (MD5) ch4.pdf: 266297 bytes, checksum: 6b5000b86b9da85c599499b32b2139e7 (MD5) ch3.pdf: 71349 bytes, checksum: d1dcb8e778f3cdbdf4bf6ff530d3ee2c (MD5)   Previous issue date: 2000-06-27"
  ],
  "handle": "28242",
  "identifier_other": "etd-07102000-12010045",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07102000-12010045/",
  "identifier_uri": "http://hdl.handle.net/10919/28242",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ch2.pdf",
    "McNeillvita.pdf",
    "appA.pdf",
    "ch1.pdf",
    "frontmatter.pdf",
    "ch5.pdf",
    "ch4.pdf",
    "ch3.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "phosphate inhibitors",
    "temperature",
    "corrosion"
  ],
  "title": "Water Quality Factors Influencing Iron and Lead Corrosion in Drinking Water",
  "type": "Dissertation"
}