{
  "contributor_author": "Jha, Akhilesh Kumar",
  "contributor_committeechair": "Inman, Daniel J.",
  "contributor_committeemember": [
    "Singh, Mahendra P.",
    "Robertshaw, Harry H.",
    "Plaut, Raymond H.",
    "Park, Gyuhae",
    "Leo, Donald J."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:13:50Z",
  "date_adate": "2002-08-06",
  "date_available": "2014-03-14T20:13:50Z",
  "date_issued": "2002-07-02",
  "date_rdate": "2003-08-06",
  "date_sdate": "2002-07-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Inflatable structures have been a subject of renewed interest in recent years for space applications such as communication antennas, solar thermal propulsion, and entry/landing systems. This is because inflatable structures are very lightweight and on-orbit deployable. In addition, they have high strength-to-mass ratio and require minimal stowage volume, which makes them especially suitable for cost-effective large space structures. An inflated toroidal structure (torus) is often used there in order to provide structural support. For these structures to be effective, their vibration must be controlled while keeping the weight low. Piezoelectric materials have become strong candidates for actuator and sensor applications in the active vibration control of such structures due to their lightweight, conformability to the host structure, and distributed nature. In this study, our main focus is to understand the dynamic characteristics of an inflatable torus and to control its vibration using piezoelectric actuators and sensors.  The first part of this study is concerned with theoretical formulations. We use Sanders' shell theory to derive the governing equations of motion for a shell subjected to pressure. To take into account the prestress effects of internal pressure, we use geometric nonlinearity, and to model the follower action of pressure force, we consider the work done by internal pressure during the vibration of the shell. These equations are then specialized to obtain approximate equations presented by previous researchers. We extend this analytical formulation to derive the equivalent forces due to piezoelectric actuators in unimorph and bimorph configurations and include their mass and stiffness effects in the governing equations. A sensor equation is also developed for the shell. The actuator and sensor equations are then written in terms of modal displacements and velocities so as to evaluate their interactions with different vibratory modes.   In the second part, we focus on numerical studies related to an inflated torus. At first, we perform a free vibration analysis of the inflated torus using Galerkin's method. We study how different parameters (aspect ratio, internal pressure, and wall-thickness) of the inflated torus affect the natural frequencies and mode shapes of the inflated torus. We compare the results obtained from the theory used in this research with the results from different approximate theories and commercial finite element codes. The results suggest that the use of an accurate shell theory and pressure effect is very important for the vibration analysis of an inflated torus. Next, the modal behaviors of piezoelectric actuator and sensor are analyzed. A detailed study is done in order to understand how the size and location of actuator and sensor affect the modal forces, the modal sensing constants, and the overall performance for all the considered modes. In order to determine the optimal locations and sizes of actuators and sensors, we use a genetic algorithm. Natural frequencies and mode shapes are calculated considering the passive effects of actuators and sensors.  Finally, we attempt the vibration control of the inflated torus using the optimally designed actuators and sensors and sliding mode controller/observer. The numerical simulations show that piezoelectric actuators and sensors can be used in the vibration control of an inflatable torus. The robustness properties of the controller and observer against the parameter uncertainty and disturbances are verified.",
  "description_provenance": [
    "Author Email: ajha@vt.edu",
    "Advisor Email: mpsingh@vt.edu",
    "Advisor Email: harobert@vt.edu",
    "Advisor Email: dinman@vt.edu",
    "Advisor Email: rplaut@vt.edu",
    "Advisor Email: gpark@vt.edu",
    "Advisor Email: donleo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:50Z (GMT). No. of bitstreams: 11 Chapter-5.pdf: 459628 bytes, checksum: 1dd69d76ade3aa79adf27c265a91c9bd (MD5) References.pdf: 109777 bytes, checksum: 6e32c1df4268b3eea1f341866cf74931 (MD5) Vita.pdf: 45567 bytes, checksum: 8701c7d3e045eca9b8cfc7d2b53f8b75 (MD5) Chapter-7.pdf: 78891 bytes, checksum: 4127dedd2227f321f9c24a660a140c5f (MD5) Chapter-6.pdf: 552551 bytes, checksum: a63a4b45cb614fa81d707aed59d7afbc (MD5) Chapter-4.pdf: 2583089 bytes, checksum: b409fce1dfc3ca67d37256b6a32cc6da (MD5) Chapter-3.pdf: 235194 bytes, checksum: bf6a15cf6ed38efda182eedbb2315936 (MD5) Chapter-2.pdf: 344450 bytes, checksum: 87f1525718c2c4c55e870efe11b329a3 (MD5) Chapter-1.pdf: 180399 bytes, checksum: 258dd3262db45c4bb2ebcbbbac344d9c (MD5) Chapter-0-Cover-Pages.pdf: 58896 bytes, checksum: b72a222a0e797902af57dd7245a4b619 (MD5) Chapter-0-Index-Pages.pdf: 100933 bytes, checksum: ce5d32c956b8d492fd3c332c04712c22 (MD5)   Previous issue date: 2002-07-02"
  ],
  "handle": "28243",
  "identifier_other": "etd-07102002-020043",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07102002-020043/",
  "identifier_uri": "http://hdl.handle.net/10919/28243",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter-5.pdf",
    "References.pdf",
    "Vita.pdf",
    "Chapter-7.pdf",
    "Chapter-6.pdf",
    "Chapter-4.pdf",
    "Chapter-3.pdf",
    "Chapter-2.pdf",
    "Chapter-1.pdf",
    "Chapter-0-Cover-Pages.pdf",
    "Chapter-0-Index-Pages.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "torus",
    "Sanders' shell theory",
    "sensor",
    "optimal size",
    "piezoelectric material",
    "actuator",
    "sliding mode control",
    "vibration",
    "Inflated space structure",
    "placement"
  ],
  "title": "Vibration Analysis and Control of an Inflatable Toroidal Satellite Component Using Piezoelectric Actuators and Sensors",
  "type": "Dissertation"
}