{
  "contributor_author": "Henderson, Ronda Baskerville",
  "contributor_committeechair": "Stewart, Daisy L.",
  "contributor_committeemember": [
    "Ragsdale, Cliff T.",
    "Cachaper, Cecile D.",
    "Turner, Sherri Guilliams",
    "Heath-Camp, Betty A."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:13:50Z",
  "date_adate": "2005-08-05",
  "date_available": "2014-03-14T20:13:50Z",
  "date_issued": "2005-06-20",
  "date_rdate": "2005-08-05",
  "date_sdate": "2005-07-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study was based on previous research that investigated the disparity or gap between those who have access to computers and the Internet and those who do not (Hoffman and Novak, 1998; NTIA, 1999b; Carey, Chisholm and Irwin, 2002; Vail, 2003 Zeliff, 2004; Glenn, 2005). The Technology Acceptance Model developed by Davis, Bagozzi, and Warshaw (1989) was used to investigate whether computer and Internet access influenced the acceptance of e-learning technology tools such as Blackboard and the Internet. Of the studies conducted concerning adoption of these technologies, a limited number have addressed the extent to which college students accept these tools. The majority of these studies failed to consider computer access as a factor regarding computer technology acceptance.  <p> The E-Learning Technology Acceptance (ETA) survey instrument was administered to business students at two universities in North Carolina. Hierarchical regression was performed to test whether or not computer and Internet access explained variance above and beyond race and socioeconomic status. Regression analysis revealed that computer and Internet access affected the degree to which students expect Blackboard and the Internet to be easy to use. As a result, creating a technology assessment to be utilized by e-learning educators and students to measure the level of computer and Internet access was recommended. The analyses also revealed that computer and Internet access significantly impacted students' attitude toward using Blackboard and the Internet. Improving the level of technology access should be addressed to promote positive attitudes regarding e-learning tools. <p> Additional findings revealed that socioeconomic status and race did influence computer ownership. A suggestion for educators is to explore initiatives that assist low income and minority students with obtaining home computers. Finally, the findings suggested that closing the digital divide is not enough to ensure technology acceptance of students. The researcher proposed that digital inclusion should be the goal of our society. Recommendations for further research suggested by the researcher included investigating other variables that may influence technology acceptance and computer and Internet access.",
  "description_provenance": [
    "Author Email: rondah@vt.edu",
    "Advisor Email: crags@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: ccachape@vt.edu",
    "Advisor Email: turner@vt.edu",
    "Advisor Email: bh76@cornell.edu",
    "Made available in DSpace on 2014-03-14T20:13:50Z (GMT). No. of bitstreams: 2 DissertationFrontRondaHenderson.pdf: 81798 bytes, checksum: 275fa40fa28040c4669ce9271085cf1b (MD5) DissertationRondaHenderson.pdf: 614159 bytes, checksum: 96336810733e44478327321ea8abaaa3 (MD5)   Previous issue date: 2005-06-20"
  ],
  "handle": "28247",
  "identifier_other": "etd-07102005-214659",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07102005-214659/",
  "identifier_uri": "http://hdl.handle.net/10919/28247",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "DissertationFrontRondaHenderson.pdf",
    "DissertationRondaHenderson.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "digital divide",
    "e-learning",
    "technology acceptance",
    "Internet access",
    "computer access"
  ],
  "title": "THE ROLE OF COMPUTER AND INTERNET ACCESS IN BUSINESS STUDENTS' ACCEPTANCE OF E-LEARNING TECHNOLOGY",
  "type": "Dissertation"
}