{
  "contributor_author": "Griffin, Robert K.",
  "contributor_committeecochair": [
    "Olsen, Michael D.",
    "Sumichrast, Robert T."
  ],
  "contributor_committeemember": [
    "Baker, Joanna R.",
    "Murrmann, Suzanne K.",
    "Weaver, Pamela A."
  ],
  "contributor_department": "Hotel, Restaurant, and Institutional Management",
  "date_accessioned": "2014-03-14T20:13:51Z",
  "date_adate": "2007-07-10",
  "date_available": "2014-03-14T20:13:51Z",
  "date_issued": "1994-08-01",
  "date_rdate": "2007-07-10",
  "date_sdate": "2007-07-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The primary objective of this research effort was to examine the relationships between successful lodging yield management systems and controllable independent variables in the form of critical success factors (CSFs). The identification of variables consequential to system success is considered to be an important step towards improving system design, implementation, and operation. </p><p> Twenty-three system success constructs, 27 potential CSFs, and three confounding variables were identified through an extensive literature review, discussions with system vendors, developers, and users, and through data analysis. Eleven different lodging yield management systems (LYMSs) were identified, and three of them were sampled. </p><p> The dependent variables were converted into a single weighted regression factor score using a principal conlponents model. The respondent's position, size of property, and type of property were found to be confounding variables. The dependent and independent variables were correlated to identifY the CSFs. </p><p> Every independent variable was identified as a CSF for at least one of the three systems, and the strength of the correlations were generally high. System, user, and task factors were found to be highly correlated to system success. Support and environmental factors were found to be moderately to weakly correlated to system success. </p>",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:13:51Z (GMT). No. of bitstreams: 1 LD5655.V856_1994.G754.pdf: 12399903 bytes, checksum: a3c92340660781a002db687f9fae2ed3 (MD5)   Previous issue date: 1994-08-01",
  "format_medium": "BTD",
  "handle": "28251",
  "identifier_other": "etd-07102007-142522",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07102007-142522/",
  "identifier_uri": "http://hdl.handle.net/10919/28251",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1994.G754.pdf",
  "subject": [
    "Hotel management.",
    "Hospitality industry Management."
  ],
  "subject_lcc": "LD5655.V856 1994.G754",
  "title": "Critical success factors of lodging yield management systems : an empirical study",
  "type": "Dissertation"
}