{
  "contributor_author": "Beiseigel, Jeannemarie Mary",
  "contributor_committeechair": "Nickols-Richardson, Sharon M.",
  "contributor_committeemember": [
    "Gwazdauskas, Francis C.",
    "Poole, Kathleen P.",
    "Ramp, Warren K.",
    "Herbert, William G."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:13:52Z",
  "date_adate": "2003-07-15",
  "date_available": "2014-03-14T20:13:52Z",
  "date_issued": "2003-07-07",
  "date_rdate": "2004-07-15",
  "date_sdate": "2003-07-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The early adult years are critical as they provide the final window of opportunity to maximize peak bone mass and help prevent osteoporosis later in life.  Dietary habits of young women are often molded by social pressures to be thin.  Negative implications for cognitive eating restraint (CER) on bone health have been shown, but direct evidence to support such contentions is limited.  Therefore, this study was conducted to further investigate the relationships between CER and bone health in young women.  Women aged 18 to 25 years with normal body mass index and limited physical activity participated in this study.  Body composition and anthropometric variables, dietary intake, endocrine factors, biomarkers of bone turnover, and measurements of bone mineral content (BMC) and bone mineral density (BMD) were examined cross-sectionally in women with high (n = 31) and low (n = 34) CER scores.  High CER participants possessed more fat mass (FM) (p < 0.05) and percent body fat (BF%) (p = 0.01) and consumed a greater number of servings of fruits and vegetables (p < 0.05) per day than the CER participants.  No differences in biochemical measurements, BMC or BMD were found between groups.  Using similar methods, a study was conducted to compare high (n = 27) and low (n = 26) CER groups at baseline and after 6-months.  At baseline, the high CER group possessed significantly higher FM (p < 0.05) and BF% (p = 0.01) and lower biochemical markers of bone formation (p < 0.05) than the low CER group; no other group differences were apparent at baseline.  Using repeated measures ANOVA, a significant Group x Time interaction was identified for salivary cortisol concentrations (p < 0.05).  Mean salivary cortisol concentrations were significantly lower at 6-months versus baseline in the high CER group (p < 0.05) but did not differ between time points in the low CER group.  No other significant Group x Time interactions were found. Overall, despite finding a lower serum osteocalcin concentration in the  high CER group at baseline, evidence of compromised BMC or BMD between women with high versus low CER scores over 6 months was not found.",
  "description_provenance": [
    "Author Email: jbeiseig@vt.edu",
    "Advisor Email: guaz@vt.edu",
    "Advisor Email: katpoole@vt.edu",
    "Advisor Email: wgherb@vt.edu",
    "Advisor Email: snrichar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:52Z (GMT). No. of bitstreams: 1 Beiseigelpdf.pdf: 4577935 bytes, checksum: 5c49995427cb762d7267653e313461fb (MD5)   Previous issue date: 2003-07-07"
  ],
  "handle": "28259",
  "identifier_other": "etd-07112003-150959",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07112003-150959/",
  "identifier_uri": "http://hdl.handle.net/10919/28259",
  "publisher": "Virginia Tech",
  "relation_haspart": "Beiseigelpdf.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Young women",
    "Chronic dieting",
    "Cortisol",
    "Cognitive eating restraint",
    "Bone turnover",
    "Bone mineral density"
  ],
  "title": "Bone Mineral Density and Biomarkers of Bone Turnover in Young-Adult Females with and without Cognitive Eating Restraint",
  "type": "Dissertation"
}