{
  "contributor_author": "Johnson, Lawrence",
  "contributor_committeechair": "Harrison, Anthony Kwame",
  "contributor_committeemember": [
    "Graves, Ellington T.",
    "Hawdon, James E.",
    "Farrar, Hayward",
    "Kershaw, Terry"
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:13:51Z",
  "date_adate": "2012-07-25",
  "date_available": "2014-03-14T20:13:51Z",
  "date_issued": "2012-06-27",
  "date_rdate": "2012-07-25",
  "date_sdate": "2012-07-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examines the deracialization concept through a case study of Governor Deval Patrickâ  s first administration and reelection campaign. The study use critical discourse analysis to explore how race as a discursive social construct was present in the speeches made by Governor Deval Patrick from June 2007 through June 2010. The discursive presence of race is also explored during Governor Patrickâ  s reelection campaign in the reporting of the Boston Globe and the Bay State Banner newspapers, a mainstream newspaper and an African American newspaper, respectively, that both endorsed Patrickâ  s campaign for the unprecedented reelection of a black governor. This study finds that Governor Patrick used strategic faming and racial signifiers in his public discourse; Patrick symbolically affirmed his blackness and politically advocated issues, especially in education, sensitive to black and underprivileged communities.This case study proves problematic for the deracialization concept. Important to Patrickâ  s discourse is his framing of issues through explicit appeals to the American dream and a message of inclusivity for all Massachusetts residents that includes racially marginalized groups. There were differences in representation of Patrick in both newspapers, but in regards to race the Bay State Banner emphasized specific issues of importance to the black community whereas the Boston Globe portrayed Deval Patrick as the more likable candidate amongst his political opponents without any emphasis to Patrickâ  s race.",
  "description_provenance": [
    "Author Email: lrjohnso@vt.edu",
    "Advisor Email: kwame@vt.edu",
    "Advisor Email: egraves@vt.edu",
    "Advisor Email: hawdonj@vt.edu",
    "Advisor Email: hfarrar@vt.edu",
    "Advisor Email: Kershaty@uc.edu",
    "Made available in DSpace on 2014-03-14T20:13:51Z (GMT). No. of bitstreams: 1 Johnson_LR_D_2012.pdf: 1129924 bytes, checksum: 3694f51be559b98022f9556264e02572 (MD5)   Previous issue date: 2012-06-27"
  ],
  "handle": "28255",
  "identifier_other": "etd-07102012-162653",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07102012-162653/",
  "identifier_uri": "http://hdl.handle.net/10919/28255",
  "publisher": "Virginia Tech",
  "relation_haspart": "Johnson_LR_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "deracialization",
    "race",
    "black politics",
    "Deval Patrick"
  ],
  "title": "The Permanence of Race: Governor Deval Patrick and the Deracialization Concept",
  "type": "Dissertation"
}