{
  "contributor_author": "Konukman, Ferman",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Krouscas, James A. Jr.",
    "Graham, George M.",
    "Potter, Kenneth R.",
    "Weber, Larry J."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:13:52Z",
  "date_adate": "2003-07-24",
  "date_available": "2014-03-14T20:13:52Z",
  "date_issued": "2003-06-12",
  "date_rdate": "2004-07-24",
  "date_sdate": "2003-07-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this investigation was to determine the effects of multimedia CAI on undergraduate PETE majors' teaching of the serve in tennis. The data were obtained from 18 undergraduate students enrolled in a PETE evaluation and assessment course at Virginia Tech.  Subjects were stratified by gender and randomly assigned to three groups as Computer-Assisted Instruction (CAI) group (n=6), Teacher Instruction (TI) group (n=6), and Control (CG) group (n=6).  The results of this study were gathered from three tests: Tennis Serve Content Knowledge Test, Tennis Serve Skill Analysis Test, Tennis Task Sequence Test. In addition, two six minutes micro teaching sessions were conducted and data was collected via Tennis Serve Pedagogical Content Knowledge (PCK) Assessment Sheet, and finally, an open ended survey was completed to understand students' attitudes toward CAI.  There are two independent variables in this study. These are Computer-Assisted Instruction (CAI) and Teacher Instruction (TI). A pre-test and post-test experimental design was applied. The Kruskal-Wallis test was used to determine the differences among the three groups, and pairwise ranking with the Mann Whitney U test was conducted between all comparisons as a post hoc analysis. Moreover, the Wilcoxon Signed Rank test was used to determine pre-to post-test changes within the groups. Alpha set at p< 0.5. \tOverall, teacher instruction (TI) intervention was very dominant in the results. Teacher instruction (TI) group performed significantly in the tennis serve content knowledge test, tennis serve task analysis test, PCK-Appropriate cues, and PCK-Appropriate demonstration. However, CAI group was also successful in the tennis serve content knowledge test and PCK-Appropriate demonstration. Interestingly, none of the groups were successful in the tennis serve skill analysis test and PCK-Appropriate feedback. Finally, students' perception toward CAI was positive in general and students indicated that they would like to use CAI in other PETE method courses. However, some of the students reported that CAI was very repetitive, and also technical problems were reported.  \tThe results of this study indicated that CAI can be an effective way of instruction in certain conditions: CAI had significant effect on content knowledge and PCK-Appropriate demonstration. In conclusion, the 21st century will be an information age and computers will be an essential part of the education system in all grades and ages. Physical education teacher education programs and physical education lessons in K-12 education are no exceptions. Computers and instructional technology should be an integral part of PETE and K-12 physical education without sacrificing the physical activity.",
  "description_provenance": [
    "Author Email: fkonukma@vt.edu",
    "Advisor Email: krouscas@vt.edu",
    "Advisor Email: gmg17@psu.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: lweber@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:52Z (GMT). No. of bitstreams: 1 Ferman_Konukman_Dissertation.pdf: 239032 bytes, checksum: 91ff734d7577a7839a1a0d5cbf445ce5 (MD5)   Previous issue date: 2003-06-12"
  ],
  "handle": "28258",
  "identifier_other": "etd-07112003-135418",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07112003-135418/",
  "identifier_uri": "http://hdl.handle.net/10919/28258",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ferman_Konukman_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Computer Assisted Instruction (CAI)",
    "Physical Education Teacher Education (PETE)",
    "Tennis"
  ],
  "title": "The Effects of Multimedia Computer Assisted Instruction (CAI) on Teaching Tennis in Physical Education Teacher Education",
  "type": "Dissertation"
}