{
  "contributor_author": "Eisenback, Brian Matthew",
  "contributor_committeecochair": [
    "Salom, Scott M.",
    "Kok, Loke T."
  ],
  "contributor_committeemember": [
    "Lagalante, Anthony F.",
    "Mullins, Donald E.",
    "Bloomquist, Jeffrey R."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:13:51Z",
  "date_adate": "2008-07-31",
  "date_available": "2014-03-14T20:13:51Z",
  "date_issued": "2008-06-27",
  "date_rdate": "2009-08-05",
  "date_sdate": "2008-07-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Prey-mediated effects of imidacloprid were evaluated for Laricobius nigrinus Fender and Sasajiscymnus tsugae Sasaji and McClure after feeding on hemlock woolly adelgid (HWA), Adelges tsugae Annand (Hemiptera: Adelgidae). Two methods were evaluated for detecting imidacloprid in hemlock tissues: a commercially available enzyme linked immunoassay (ELISA) kit and a high performance thin-layer chromatography technique for detecting and quantifying imidacloprid residues in hemlock wood and needle tissues.  ELISA is advantageous because of its cost, sensitivity, and ease of use.  However, matrix effects in the form of false positives and overestimated imidacloprid concentrations were evident in hemlock wood and needle tissue extracts.  Matrix effects could be reduced by dilution with water, effectively raising the lower detection range of the kit from 0.2 to 200 ppb.  High performance thin-layer chromatography was accurate, quick, easy to use, and matrix effects were not evident.  However, the technique is sensitive in the lower ppm range and tissue samples from field-treated hemlocks are often in the ppb range, making this technique less desirable than more sensitive analytical methods.    Lethal and sublethal effects on both predators were evident after eastern hemlock branches infested with HWA were spiked with imidacloprid in the laboratory.  HWA mortality increased with dosage and time, and its 30 d LC50 was determined to be 242 ppb.  Both predator species exhibited reduced survivorship and fitness parameters after feeding on HWA from the treated branches.  In a topical application bio-assay, 6 d imidacloprid LD50 values for L. nigrinus and S. tsugae were 2.43 and 1.82 Âµg/g, respectively. Imidacloprid and its major metabolites in hemlock tissues were analyzed by liquid chromatography-tandem mass spectrometry.  Imidacloprid recovery from beetle cadavers was correlated with beetle mortality from feeding on treated hemlock branches.  Olefin was the primary imidacloprid metabolite recovered from hemlock wood tissues. When predators fed on HWA from field-treated trees, impacts on survivorship and fitness were variable.  In 2005, significantly higher proportions of both species of beetles were affected by feeding on control branches compared with treated branches.  In 2006, beetles feeding on HWA from some of the trees treated in the field exhibited longer fliptimes compared with beetles feeding on controls, although beetle mortality was not significant among treatements.  In the field, imidacloprid controlled HWA populations 1-3 years post-treatment.  Hemlock health improved in the highest dosage group, with significantly greater lengths of new shoots compared with shoots from control trees. Eastern hemlock trees primarily metabolized imidacloprid into the olefin metabolite, which can have increased insecticidal toxicity compared with imidacloprid.  Imidacloprid was detected in beetle cadavers after feeding on HWA from treated branches, suggesting that prey-mediated impacts of systemic imidacloprid are possible on nontarget predators.  However, because of HWAâ  s sensitivity to imidacloprid, in field situations predators are more likely to be affected by reduced adelgid density and quality.",
  "description_provenance": [
    "Author Email: beisenba@vt.edu",
    "Advisor Email: anthony.lagalante@villanova.edu",
    "Advisor Email: mullinsd@vt.edu",
    "Advisor Email: salom@vt.edu",
    "Advisor Email: ltkok@vt.edu",
    "Advisor Email: jbquist@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:51Z (GMT). No. of bitstreams: 1 Eisenback_ETD.pdf: 15047826 bytes, checksum: 0e087f61e5e077e5a8da3b08dcb04378 (MD5)   Previous issue date: 2008-06-27"
  ],
  "handle": "28253",
  "identifier_other": "etd-07102008-125307",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07102008-125307/",
  "identifier_uri": "http://hdl.handle.net/10919/28253",
  "publisher": "Virginia Tech",
  "relation_haspart": "Eisenback_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "biological control",
    "ELISA",
    "Adelges tsugae",
    "Tsuga canadensis",
    "non-target effects"
  ],
  "title": "Prey-mediated effects of imidacloprid on Laricobius nigrinus (Coleoptera: Derodontidae) and Sasajiscymnus tsugae (Coleoptera: Coccinellidae), two predators of hemlock woolly adelgid",
  "type": "Dissertation"
}