{
  "contributor_author": "Lim, Mikyung",
  "contributor_committeecochair": [
    "Gaskill, LuAnn R.",
    "Suh, Moon Won"
  ],
  "contributor_committeemember": [
    "Beamish, Julia O.",
    "Schofield-Tomschin, Sherry",
    "Giddings, Valerie L."
  ],
  "contributor_department": "Apparel, Housing, and Resource Management",
  "date_accessioned": "2014-03-14T20:13:52Z",
  "date_adate": "2006-10-03",
  "date_available": "2014-03-14T20:13:52Z",
  "date_issued": "2006-06-20",
  "date_rdate": "2006-10-03",
  "date_sdate": "2006-07-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The implementation of the North American Free Trade Agreement (NAFTA) between the United States, Canada, and Mexico created a barrier-free production and trade zone in North America. Surrounding the implementation of NAFTA, a great volume of public, political, and academic attention was given to the impact of the agreement on the aging U.S. textile industry with high labor costs. The major NAFTA provisions, the elimination of tariffs and quotas and rules of origin, were predicted to create and divert U.S. trade in textile goods and expand domestic textile production activities. Since its implementation, however, volatile macroeconomic and political environmental changes have severely interfered with the role of NAFTA.  <p>  Over ten years have passed since the implementation of NAFTA. The objectives of this research are to investigate the pattern of the U.S. textile industry's production activities under NAFTA and to determine the impact of the agreement on the industry's production activities. This research consists of two parts. Part I is a qualitative analysis that investigates changes in the industry's trade and production activities under NAFTA based on the review of literature and trade and industry data. Part II of this research, a quantitative analysis, applies a normalized restricted translog profit model to the textile industry's production activities under the influence of NAFTA in order to identify the pattern of the industry's output supply and input demand and to determine the impact of NAFTA on the industry. The outcomes of these analyses are used to make an overall assessment of the impact of NAFTA on the U.S. textile industry and draw policy implications.  <p>  The outcome of the qualitative analysis suggests NAFTA as an effective policy in expanding and regionalizing U.S. trades in textile goods and promoting domestic textile production activities in the early years of implementation. Since the late 1990s, however, macroeconomic and political changes have dominated over the role of NAFTA, partially undoing the changes in U.S. textile trade and production activities made in the early years of the agreement. The outcome of quantitative analysis identifies the significant, but negative effect, of NAFTA on the U.S. textile industry's profit performance in the early years of NAFTA, probably due to intensified import competition, fall of real output prices, and numerous mill closings. Overall, NAFTA is recognized as a short-term, transitional policy measure for the U.S. textile industry because of the limited importance of Mexico in U.S. textile trade, the short period of NAFTA implementation, and several dynamic environmental factors including exchange rate changes, U.S. signings of multiple regional trade agreements, and the emerging dominance of China in world textile trade under the phase-out of the Multi-fiber Arrangement that have changed international and domestic textile market competition. Ultimately, this study concludes that a trade policy is not likely to provide a long-term solution for the survival of U.S. textile industry.",
  "description_provenance": [
    "Author Email: mlim@vt.edu",
    "Advisor Email: jbeamish@vt.edu",
    "Advisor Email: sherryst@vt.edu",
    "Advisor Email: giddingsv@wssu.edu",
    "Advisor Email: lagaskil@vt.edu",
    "Advisor Email: moon_suh@ncsu.edu",
    "Made available in DSpace on 2014-03-14T20:13:52Z (GMT). No. of bitstreams: 1 dissertation-lim.pdf: 1411441 bytes, checksum: 32b98508928c5725b3a81dbf9f4e5687 (MD5)   Previous issue date: 2006-06-20"
  ],
  "handle": "28262",
  "identifier_other": "etd-07112006-164703",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07112006-164703/",
  "identifier_uri": "http://hdl.handle.net/10919/28262",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation-lim.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Textile Production",
    "Textile Trade",
    "Economic Analysis",
    "Textile Industry",
    "NAFTA"
  ],
  "title": "An Assessment of the Impact of the North American Free Trade Agreement (NAFTA) on the U.S. Textile Industry's Production Activities: Qualitative and Quantitative Approaches",
  "type": "Dissertation"
}