{
  "contributor_author": "Endert, Alex",
  "contributor_committeechair": "North, Christopher L.",
  "contributor_committeemember": [
    "Bowman, Douglas A.",
    "Leman, Scotland C.",
    "May, Richard",
    "Quek, Francis K. H."
  ],
  "contributor_department": "Computer Science and Applications",
  "date_accessioned": "2014-03-14T20:13:54Z",
  "date_adate": "2012-07-18",
  "date_available": "2014-03-14T20:13:54Z",
  "date_issued": "2012-07-10",
  "date_rdate": "2012-07-18",
  "date_sdate": "2012-07-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "User interaction in visual analytic systems is critical to enabling visual data exploration. Through interacting with visualizations, users engage in sensemaking, a process of developing and understanding relationships within datasets through foraging and synthesis. For example, two-dimensional layouts of high-dimensional data can be generated by dimension reduction models, and provide users with an overview of the relationships between information. However, exploring such spatializations can require expertise with the internal mechanisms and parameters of these models.<p> The core contribution of this work is semantic interaction, capable of steering such models without requiring expertise in dimension reduction models, but instead leveraging the domain expertise of the user. Semantic interaction infers the analytical reasoning of the user with model updates, steering the dimension reduction model for visual data exploration. As such, it is an approach to user interaction that leverages interactions designed for synthesis, and couples them with the underlying mathematical model to provide computational support for foraging. As a result, semantic interaction performs incremental model learning to enable synergy between the userâ  s insights and the mathematical model. The contributions of this work are organized by providing a description of the principles of semantic interaction, providing design guidelines through the development of a visual analytic prototype, ForceSPIRE, and the evaluation of the impact of semantic interaction on the analytic process. The positive results of semantic interaction open a fundamentally new design space for designing user interactions in visual analytic systems.<p> This research was funded in part by the National Science Foundation, CCF-0937071 and CCF-0937133, the Institute for Critical Technology and Applied Science at Virginia Tech, and the National Geospatial-Intelligence Agency contract #HMI1582-05-1-2001.",
  "description_provenance": [
    "Author Email: aendert@vt.edu",
    "Advisor Email: north@vt.edu",
    "Advisor Email: dbowman@vt.edu",
    "Advisor Email: leman@vt.edu",
    "Advisor Email: richard.may@pnl.gov",
    "Advisor Email: quek@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:54Z (GMT). No. of bitstreams: 1 Endert_A_D_2012.pdf: 26081042 bytes, checksum: cf0a9df04fd80b130232623121a95588 (MD5)   Previous issue date: 2012-07-10"
  ],
  "handle": "28265",
  "identifier_other": "etd-07112012-123927",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07112012-123927/",
  "identifier_uri": "http://hdl.handle.net/10919/28265",
  "publisher": "Virginia Tech",
  "relation_haspart": "Endert_A_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "user interaction",
    "visual analytics",
    "model steering",
    "visualization"
  ],
  "title": "Semantic Interaction for Visual Analytics: Inferring Analytical Reasoning for Model Steering",
  "type": "Dissertation"
}