{
  "contributor_author": "Knausenberger, Walter  Ingolf",
  "contributor_committeechair": "Turner, E. Craig Jr.",
  "contributor_committeemember": [
    "Benfield, Ernest Fredrick",
    "Hoffman, Richard L.",
    "Kosztarab, Michael",
    "Voshell, J. Reese Jr."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:13:53Z",
  "date_adate": "2009-07-11",
  "date_available": "2014-03-14T20:13:53Z",
  "date_issued": "1986-12-05",
  "date_rdate": "2009-07-11",
  "date_sdate": "2009-07-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Biological and systematic study of the immature stages of the biting midges (Diptera: Ceratopogonidae) has been infrequent, although the family is one of the largest in the order, with over 4,000 species worldwide, and is ubiquitous among aquatic/semiaquatic environments. An ecosystematic analysis is presented here of the Ceratopogonidae in Virginia and contiguous states based mainly on a diversified biological field survey, with particular attention to associating immature stages with adults, and acquisition of ecological data. I emphasized (a) extraction of larvae and pupae; (b) two methods of rearing, developed for this study: individual rearing(IR) with an agar-nematode technique, and collective rearing from the habitat substrate in rearing cartons(RC); and (c) field trapping of adults at the habitats.</p> <p> In Section I, a faunistic assessment - the first of its sort - is provided of the total Virginia-region ceratopogonid fauna, in all developmental stages, with a focus on <i>Culicoides</i>, including a comparative evaluation of the relative abundance of the ceratopogonid genera with respect to methods of collecting and extracting.</p> <p> High taxonomic richness of the ceratopogonid fauna in the Middle Atlantic states is reflected in the 150 described and 42 undescribed (new) species recovered. A detailed geographic checklist for the 222 species of Virginia and the five contiguous states is presented and interpreted. At least 54 Culicoides species are present in the Middle Atlantic u.s. About half of the larval species can be determined in Virginia. With the results of this study, 93% of breeding sites for the genus are known in Virginia, more than for any other state.</p> <p> Section II assembles and synopsizes data on the autecology, life history, habitat, morphology, systematics, as well as geographic and seasonal occurrence of 28 species (3 new) and 10 genera in two related tribes of predaceous biting midges, Heteromyiini and Sphaeromiini (subfamily Ceratopogoninae). Shorelines are the \"archetypical arena\" in which these larvae thrive, typically above and below the water line. Their habitats and substrates are characterized in detail. The greatest diversity of larvae in these tribes consistently occurs in and along mid-reach streams{Order: 3 to 5).</p> <p> Mechanisms of ecological partitioning by sympatric species, and the differential adaptive significance of larval, pupal and adult morphological characters are evaluated. Taxonomic and ecological diversity in these groups are clearly related.</p>",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:13:53Z (GMT). No. of bitstreams: 1 LD5655.V856_1986.K53.pdf: 34525917 bytes, checksum: b546139c55b3e41b2273ae105bd1b158 (MD5)   Previous issue date: 1986-12-05",
  "format_medium": "BTD",
  "handle": "28263",
  "identifier_other": "etd-07112009-040603",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07112009-040603/",
  "identifier_uri": "http://hdl.handle.net/10919/28263",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1986.K53.pdf",
  "subject": "Diptera",
  "subject_lcc": "LD5655.V856 1986.K53",
  "title": "Contributions to the autecology and ecosystematics of immature ceratopogonidae (Diptera), with emphasis on the tribes heteromyiini and sphaeromiini in the middle atlantic United States",
  "type": "Dissertation"
}