{
  "contributor_author": "Haro, Elizabet",
  "contributor_committeechair": "Kleiner, Brian M.",
  "contributor_committeemember": [
    "Smith-Jackson, Tonya L.",
    "Shewchuk, John P.",
    "Nussbaum, Maury A.",
    "Vorster, Michael C."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:13:56Z",
  "date_adate": "2010-08-03",
  "date_available": "2014-03-14T20:13:56Z",
  "date_issued": "2010-06-28",
  "date_rdate": "2011-08-03",
  "date_sdate": "2010-07-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The construction industry leads the private sector with the most fatalities of any industry in the United States.  With an expected growth of the industry in the next century, safe work environments are imperative. They will impact the bottom line of the industry through the reduction of fatal and non-fatal injuries.  Although the causes of injuries and illnesses in construction have long been tracked, reported and researched, the industry continues to lead in occupational related fatal and non-fatal injuries. It is critical to understand if a tradeoff exists between safety and productivity to avoid shortcut behaviors in the field. This is specifically important due to the number of contractors, subcontractors and laborers that participate in the different projects.   The overall objective of this research was to increase the understanding of the relationship between perceived and observed safety and productivity and to understand the variability in perception and behavior between crews working for the same general contractor in the homebuilding construction industry.  For this research, questionnaires and behavioral observations were employed.   The results demonstrated a significant moderate positive relationship between safety climate and perceived risk behavior at the crew level. A model was developed that suggests that safety climate and work ownership are predictors of perceived risk behaviors. This relationship is important to understand since employee attitudes, safety commitment and organizational factors may affect acceptability of safety processes and procedures.  The differences among construction crews were evaluated at two levels, individual crews and critical path groups.  All tests were significant for differences among crews. To further understand these differences, crews were grouped in accordance with the critical path of a homebuilding schedule. A significant difference existed for risk behavior, productivity loss and work ownership.    Behavioral observations were used to evaluate crew performance. Top contributing behaviors of productivity, safety and waste were identified. The top behaviors provide improvement areas for productivity, safety and waste.  Overall, learning from this research provided insight into the relationships between safety climate, risk behavior, productivity and work ownership. Understanding this relationship can contribute to the design of safety interventions, and consequently, the reduction of injuries and fatalities.",
  "description_provenance": [
    "Author Email: eharo@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: shewchuk@vt.edu",
    "Advisor Email: nussbaum@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: mikev@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:56Z (GMT). No. of bitstreams: 1 Haro_E_D_2010.pdf: 4407602 bytes, checksum: 5ec091114180a5af8577b5d7a576d950 (MD5)   Previous issue date: 2010-06-28"
  ],
  "handle": "28275",
  "identifier_other": "etd-07122010-122950",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07122010-122950/",
  "identifier_uri": "http://hdl.handle.net/10919/28275",
  "publisher": "Virginia Tech",
  "relation_haspart": "Haro_E_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "risk",
    "safety climate",
    "construction productivity",
    "macroergonomics",
    "construction safety"
  ],
  "title": "An Evaluation of Perceived and Observed Safety and Productivity in Residential Construction",
  "type": "Dissertation"
}