{
  "contributor_author": "Offenbacker, Beth S",
  "contributor_committeechair": "Khademian, Anne Meredith",
  "contributor_committeemember": [
    "Wolf, James F.",
    "Dudley, Larkin S.",
    "Sanchez, Thomas W."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:13:56Z",
  "date_adate": "2010-07-26",
  "date_available": "2014-03-14T20:13:56Z",
  "date_issued": "2010-06-29",
  "date_rdate": "2010-07-26",
  "date_sdate": "2010-07-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study is to define and apply an engagement framework built upon Inclusive Management theory to examine the practice of participation as understood by administrators, elected officials, NGO leaders and public participation practitioners across multiple countries and to illustrate the framework through three case studies. Specifically, it asks how does Inclusive Management guide us in understanding participation as practiced by managers/leaders with responsibility for this work? It also considers the potential connections between management and participation as demonstrated in the data, and further, it seeks to identify how IM as a theory may be enriched or empirically elaborated as a result of this examination. This research examines the observation of phenomena identified by study participants ordinarily not considered a consequence of efforts that engage the public. Using inclusive management theory, the resulting engagement framework includes clusters of outcomes, continuous events and capacity-building as its core elements. The framework shows inclusive management in action and offers a different way of knowing (Feldman, Khademian, Ingram, & Schneider, 2006; Gomez, Bouty, & Drucker-Godard, 2003; Nicolini, Gherardi, & Yanow, 2003) participation in government decision making than generally is depicted in the public participation literature or characterized anecdotally. The engagement framework also corresponds in several ways to the techniques of dialogue, deliberation and appreciative inquiry. As the data will demonstrate in this dissertation, the engagement framework may draw upon these techniques, and moreover, that the relational, informational and stewardship dimensions of engagement reinforce one another. This dissertation also addresses a longstanding gap in the participation literature, in that it provides strategies that connect management theory and practice with participatory principles.",
  "description_provenance": [
    "Author Email: boffen@vt.edu",
    "Advisor Email: akhademi@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: tom.sanchez@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:56Z (GMT). No. of bitstreams: 3 Offenbacker_Beth_S_D_2010_IRB.pdf: 225531 bytes, checksum: de1d502629009148c65ad2387c67640a (MD5) Offenbacker_Beth_S_D_2010.pdf: 1347178 bytes, checksum: fa0d4031c1d397170510be1758d3ca13 (MD5) Offenbacker_Beth_S_D_2010_Copyright.pdf: 169649 bytes, checksum: c7fa8cee718fbc288684e931e3acf538 (MD5)   Previous issue date: 2010-06-29"
  ],
  "handle": "28276",
  "identifier_other": "etd-07122010-144253",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07122010-144253/",
  "identifier_uri": "http://hdl.handle.net/10919/28276",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Offenbacker_Beth_S_D_2010_IRB.pdf",
    "Offenbacker_Beth_S_D_2010.pdf",
    "Offenbacker_Beth_S_D_2010_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Inclusive Management",
    "Public Participation",
    "Engagement"
  ],
  "title": "Inclusive Management in Action: An International Study of Public Engagement",
  "type": "Dissertation"
}