{
  "contributor_author": "Moreschi, Luis M.",
  "contributor_committeechair": "Singh, Mahendra P.",
  "contributor_committeemember": [
    "Batra, Romesh C.",
    "Hajj, Muhammad R.",
    "Hendricks, Scott L.",
    "Gao, David Y."
  ],
  "contributor_department": "Engineering Mechanics",
  "date_accessioned": "2014-03-14T20:13:57Z",
  "date_adate": "2000-07-14",
  "date_available": "2014-03-14T20:13:57Z",
  "date_issued": "2000-07-10",
  "date_rdate": "2001-07-14",
  "date_sdate": "2000-07-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The usefulness of supplementary energy dissipation devices is now quite well-known in the earthquake structural engineering community for reducing the earthquake-induced response of structural systems.  However, systematic design procedures for optimal sizing and placement of these protective systems in structural systems are needed and are not yet available.  The main objective of this study is, therefore, to formulate a general framework for the optimal design of passive energy dissipation systems for seismic structural applications.  The following four types passive energy dissipation systems have been examined in the study: (1) viscous fluid dampers, (2) viscoelastic dampers, (3) yielding metallic dampers and, (4) friction dampers.  For each type of energy dissipation system, the study presents the (a) formulation of the optimal design problem, (b) consideration of several meaningful performance indices, (c) analytical and numerical procedures for seismic response and performance indices calculations, (d) procedures for obtaining the optimal design by an appropriate optimization scheme and, (e) numerical results demonstrating the effectiveness of the procedures and the optimization-based design approach. For building structures incorporating linear damping devices, such as fluid and solid viscoelastic dampers, the seismic response and performance evaluations are done by a random vibration approach for a stochastic characterization of the earthquake induced ground motion.  Both the gradient projection technique and genetic algorithm approach can be conveniently employed to determine the required amount of damping material and its optimal distribution within a building structure to achieve a desired performance criterion.  An approach to evaluate the sensitivity of the optimum solution and the performance function with respect to the problem parameters is also described.  Several sets of numerical results for different structural configurations and for different performance indices are presented to demonstrate the effectiveness and applicability of the approach. For buildings installed with nonlinear hysteretic devices, such as yielding metallic elements or friction dampers, the computation of the seismic structural response and performance must be performed by time history analysis.  For such energy dissipation devices, the genetic algorithm is more convenient to solve the optimal design problem.  It avoids the convergence to a local optimal solution.  To formulate the optimization problem within the framework of the genetic algorithm, the study presents the discretization procedures for various parameters of these nonlinear energy dissipation devices.  To include the uncertainty about the seismic input motion in the search for optimal design, an ensemble of artificially generated earthquake excitations are considered.  The similarities of the optimal design procedure with yielding metallic devices and friction devices are clearly established.  Numerical results are presented to illustrate the applicability of the proposed optimization-based approach for different forms of performance indices and types of building structures.",
  "description_degree": "PhD",
  "description_provenance": [
    "Author Email: lmoresch@vt.edu",
    "Advisor Email: mpsingh@vt.edu",
    "Advisor Email: rbatra@vt.edu",
    "Advisor Email: mhajj@vt.edu",
    "Advisor Email: hndrxsl@vt.edu",
    "Advisor Email: gao@math.vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:57Z (GMT). No. of bitstreams: 1 etd.pdf: 1115301 bytes, checksum: 89af0d4fce59a647ccf744313d2a19c9 (MD5)   Previous issue date: 2000-07-10"
  ],
  "handle": "28279",
  "identifier_other": "etd-07132000-16010022",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07132000-16010022/",
  "identifier_uri": "http://hdl.handle.net/10919/28279",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "passive control",
    "genetic algorithms",
    "structural optimization",
    "seismic design"
  ],
  "title": "Seismic design of energy dissipation systems for optimal structural perfromance",
  "type": "Dissertation"
}