{
  "contributor_author": "Gibson, James Edward",
  "contributor_committeechair": "Hult, Karen M.",
  "contributor_committeemember": [
    "Khademian, Anne Meredith",
    "Dudley, Larkin S.",
    "Wolf, James F."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:13:55Z",
  "date_adate": "2007-07-26",
  "date_available": "2014-03-14T20:13:55Z",
  "date_issued": "2007-07-05",
  "date_rdate": "2007-07-26",
  "date_sdate": "2007-07-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation traces Social Security policymaking through most of its post-enactment history in search of ideational processes and schema in path-dependent, path-shaping, and path-breaking modes of institutional persistence and change. The study is grounded in the historical institutionalist literature, specifically the recent debate about the utility of path dependence frameworks in incorporating institutional change, with a particular focus on ideas as stimuli. <p> As a case for tracing path-dependent policy processes, Social Security is overbroad. This breadth requires focusing more narrowly on the interaction between the major coalitions, business/conservative and liberal/labor, on retirement and disability pension (but not health care) issues through the venue of Social Security Advisory Councils. Council is used as a catch-all label for the six-decade succession of (mostly) citizen groups appointed by the secretary of HEW, Senate Finance Committee, and, in one case, the president to deliberate questions of Social Security policy and recommend changes, often enacted into law. <p> A pattern-matching analysis points to a moderate level of path dependence, indicating that the exchange of ideas between coalitions fits the larger consensual pattern of give and take around an existing arrangement. An ideational narrative reveals early negotiations over the emphasis placed on equity versus adequacy, with manifestly ideational exchanges in the 1996 Council's deliberations marking a turning point in the coalitional interaction. <p> A key implication of this research for the application of path dependence frameworks to U.S. political institutions like Social Security is to buttress moderate path dependence arguments, for instance, those advanced by Hacker and Pierson (2002), and to discount the relevance of path-shaping narratives that have been fashioned from European examples (Cox 2004).   Yet the research also modifies understanding of path dependence as a self-perpetuating function of increasing returns by identifying an ideational strand that bound both coalitions to social insurance principles.  Path-breaking developments apparent in the 1996 Council further implicated new ideas as institutional factors contributing to the loss of historical consensus on Social Security, bolstering the notion of ideational processes as an element of institutional persistence and pressing the argument for further research into ideas as dynamic elements fostering institutional change.",
  "description_provenance": [
    "Author Email: egibson@ubalt.edu",
    "Advisor Email: akhademi@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:55Z (GMT). No. of bitstreams: 2 Appendix072207.pdf: 22908749 bytes, checksum: 9e3ad9262621a8bb535ea29b83fa14fd (MD5) Last_Council072207.pdf: 880621 bytes, checksum: f8d65997e4ccb3f487b18887f3109078 (MD5)   Previous issue date: 2007-07-05"
  ],
  "handle": "28273",
  "identifier_other": "etd-07122007-224609",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07122007-224609/",
  "identifier_uri": "http://hdl.handle.net/10919/28273",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Appendix072207.pdf",
    "Last_Council072207.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Path Dependence",
    "Policymaking",
    "Institutionalism",
    "Social Security",
    "Ideational"
  ],
  "title": "The Last Council: Social Security Policymaking as Coalitional Consensus and the 1994-1996 Advisory Council as Institutional Turning Point",
  "type": "Dissertation"
}