{
  "contributor_author": "Clement, Ella Chow",
  "contributor_committeechair": "Carlier, Paul R.",
  "contributor_committeemember": [
    "Kingston, David G. I.",
    "Tanko, James M.",
    "Bloomquist, Jeffrey R.",
    "Gandour, Richard D."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:13:55Z",
  "date_adate": "2005-08-11",
  "date_available": "2014-03-14T20:13:55Z",
  "date_issued": "2005-06-28",
  "date_rdate": "2005-08-11",
  "date_sdate": "2005-07-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Design and Syntheses of Potential Drugs Based on  GABAA Receptor Pharmocophores  Ella Chow Clement  ABSTRACT   Numerous previous studies of GABAAR ligands have suggested that GABAAR agonists must be zwitterionic and feature an intercharge separation similar to that of GABA (approx. 4.7-6.0 Ã ).  We have demonstrated that monomeric, homodimeric and heterodimeric non-zwitterionic GABA amides are partial, full, or superagonists at the murine GABAA receptor (GABAAR).  The agonism of these GABA amides is comparable to that of THIP, as shown by in vitro assay results.  The assay data indicate that the agonism of GABA amides is tether length-dependent.  Optimum agonism is achieved with a tether length of four methylenes in GABA amide dimers and in GABA amides bearing pendant amide or amino groups.  We have further investigated the structure-activity relationship for GABA amides on the GABAAR by performing structural modifications to both the superagonist 2c and the agonist 6c.  Synergism and [3H]muscimol binding experiments show that 2c binds to the same sites as GABA.  Structural modification of 2c demonstrated that partial rigidification of the tether eliminated agonism and caused ligands to behave as weak competitive antagonists.  We have also investigated the agonism of four ZAPA derivatives in 36Cl- uptake functional assay.  Two of them are found to be as potent as GABA.  \tIn our studies of 1,4-benzodiazepines, our goal was to synthesize three different subtypes of quaternary 1,4-benzodiazepines by use of the memory of chirality (MOC) strategy.  Disappointingly, most of the deprotonation/alkylations failed, due to various reasons.  The failure of the reactions of (S)-alanine-derived tetrahydro-1,4-benzodiazepin-3-ones was probably due to either the unexpected side reactions or the steric hindrance of enolate alkylation.  In the case of tetrahydro-1,4-benzodiazepin-2-ones, computational studies suggested that steric hindrance by both the benzo ring and N4-allyl group might retard deprotonation at C3 by bulky bases like KHMDS or LDA.  Finally, (S)-serine-derived 1,4-benzodiazepin-2-ones and their elimination products (ï ¡-methylene benzodiazepines) were prepared.  These proved unreactive towards deprotonation/alkylations and conjugate additions, respectively.  The low reactivity of the ï ¡-methylene benzodiazepines towards nucleophiles was attributed to highly delocalized LUMOs that failed to direct nucleophiles to the ï ¢-carbons.",
  "description_provenance": [
    "Author Email: elchow@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: jbquist@vt.edu",
    "Advisor Email: gandour@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:55Z (GMT). No. of bitstreams: 1 ClementDissertation.pdf: 2109036 bytes, checksum: 419e986fc7a3744bc94d25d65d6f7981 (MD5)   Previous issue date: 2005-06-28"
  ],
  "handle": "28271",
  "identifier_other": "etd-07122005-141723",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07122005-141723/",
  "identifier_uri": "http://hdl.handle.net/10919/28271",
  "publisher": "Virginia Tech",
  "relation_haspart": "ClementDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Memory of Chirality",
    "ZAPA",
    "PEG",
    "[3H]Muscimol binding",
    "36Cl- Flux assay",
    "Antagonists",
    "Non-zwitterionic GABA amide homodimers and heterod",
    "Superagonist",
    "Partial/full agonists",
    "GABA(A) receptor"
  ],
  "title": "Design and Syntheses of Potential Drugs Based on GABA(A) Receptor Pharmacophores",
  "type": "Dissertation"
}