{
  "contributor_author": "Mashhadi, Zahra",
  "contributor_committeechair": "White, Robert H.",
  "contributor_committeemember": [
    "Hernick, Marcy",
    "Sobrado, Pablo",
    "Dean, Dennis R.",
    "Schubot, Florian D."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:13:58Z",
  "date_adate": "2010-09-09",
  "date_available": "2014-03-14T20:13:58Z",
  "date_issued": "2010-06-30",
  "date_rdate": "2010-09-09",
  "date_sdate": "2010-07-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Methanogens belong to the archaeal domain, are anaerobes and produce methane from CO2 or other simple carbon compounds. Methanogenesis is a key process of the global carbon cycle and methanogens produce about 75-85% of all methane emissions.  Besides the universally occurring coenzymes that are needed in normal metabolic pathways, such as biotin, coenzyme A, thiamine, FAD, PLP, etc.; methanogens need six additional coenzymes that are involved in the methane production pathway: methanofuran, tetrahydromethanopterin, coenzyme F420, coenzyme M, coenzyme B, and coenzyme F430. Although now it is known that some non-methanogenic archaea and bacteria have several of these coenzymes, they are named methanogenic coenzymes since these six coenzymes were first isolated and identified from methanogens.  We are using Methanocaldococcus jannaschii as a model organism of methanogens to understand and investigate pathways of coenzymes biosynthesis. Our laboratory is involved in establishing the chemical functions of hypothetical proteins that function in targeted biochemical pathways leading to coenzyme production within the euryarchaeon M. jannaschii and identifying their corresponding genes. While there are many coenzymes present in this organism, my focus is on the biosynthetic pathways of tetrahydromethanopterin and FAD. 7,8-Dihydro-D-neopterin 2창  ,3창  -cyclic phosphate (H2N-cP) is the first intermediate in the biosynthesis of the pterin portion of tetrahydromethanopterin (H4MPT), a C1 carrier coenzyme. This intermediate is produced from GTP by MptA (MJ0775 gene product), a new class of GTP cyclohydrolase I. An Fe(II)-dependent cyclic phosphodiesterase (MptB, MJ0837 gene product) hydrolyzes the cyclic phosphate of H2N-cP to a mixture of 7,8-dihydro-D-neopterin 2창  -monophosphate and 7,8-dihydro-D-neopterin 3창  -monophosphate. MptB requires Fe2+ for activity, the same as observed for MptA. Thus the first two enzymes involved in H4MPT biosynthesis in the Archaea are Fe2+ dependent.   In the FAD biosynthetic pathway, the conversion of riboflavin first into FMN and then to FAD is catalyzed by a bifunctional enzyme (RibF) that first acts as a kinase converting riboflavin to FMN in the presence of ATP and then acts as a nucleotidyl transferase using a second ATP to convert the FMN to FAD. Identification of the archaeal CTP-dependent riboflavin kinase, RibK (MJ0056 gene product) led us to identify a archaeal monofunctional FAD synthetase, RibL (MJ1179 gene product). RibL is the only air-sensitive FAD synthetase identified.",
  "description_provenance": [
    "Author Email: mashhadi@vt.edu",
    "Advisor Email: hernickm@vt.edu",
    "Advisor Email: psobrado@vt.edu",
    "Advisor Email: deandr@vt.edu",
    "Advisor Email: rhwhite@vt.edu",
    "Advisor Email: fschubot@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:58Z (GMT). No. of bitstreams: 2 Mashhadi_Z_D_2010.pdf: 12457982 bytes, checksum: b45c2585f85442cab705e2335c5d642a (MD5) Mashhadi_Z_D_2010_copyright.pdf: 635614 bytes, checksum: 4c20479ef503eb47e1c4cb0d267733a6 (MD5)   Previous issue date: 2010-06-30"
  ],
  "handle": "28286",
  "identifier_other": "etd-07132010-215709",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07132010-215709/",
  "identifier_uri": "http://hdl.handle.net/10919/28286",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Mashhadi_Z_D_2010.pdf",
    "Mashhadi_Z_D_2010_copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Methanocaldococcus jannaschii",
    "tetrahydromethanopterin",
    "riboflavin kinase",
    "FAD synthetase"
  ],
  "title": "Identification and Characterization of the Enzymes Involved in Biosynthesis of FAD and Tetrahydromethanopterin in Methanocaldococcus jannaschii",
  "type": "Dissertation"
}