{
  "contributor_author": "Sugarman, Nathan",
  "contributor_committeechair": "Watson, J. W.",
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:13:57Z",
  "date_adate": "2007-07-13",
  "date_available": "2014-03-14T20:13:57Z",
  "date_issued": "1942-05-01",
  "date_rdate": "2007-07-13",
  "date_sdate": "2007-07-13",
  "degree_grantor": "Virginia Agricultural and Mechanical College and Polytechnic Institute",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Crease-resistance is a very greatly desirable property in textile fibers. Of the natural fibers, wool exhibits this property to the greatest degree, followed by silk, cotton, and flax, which has a very low crease-resistance. The artificial cellulose fibers fall considerably below wool and silk in this respect. The improvement of the crease-resistance of rayon and other fibers has been sought in various after-treatment processes, in which substances are either deposited within the fiber, or react with it. There are numerous patents (22) for such methods of imparting crease-resistance. It would be highly desirable if the crease-resisting powers could be achieved \"by a modification of the intrinsic properties of a fiber, that is, by producing a fiber which already is crease-resistant. The purpose of the work reported here was to attempt to produce a viscose rayon fiber with better crease-resisting properties, and to study the effect of a variation in the cellulose chain length distribution in the rayon upon this property. This work was done under a Pellowship of the Behr- Manning Corporation, Troy, New York.",
  "description_provenance": [
    "Author Email: none@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:57Z (GMT). No. of bitstreams: 1 LD5655.V856_1942.S842.pdf: 29917330 bytes, checksum: c00f437c2c99abe21444ba5d51d56619 (MD5)   Previous issue date: 1942-05-01"
  ],
  "format_medium": "BTD",
  "handle": "28282",
  "identifier_other": "etd-07132007-104908",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07132007-104908/",
  "identifier_uri": "http://hdl.handle.net/10919/28282",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1942.S842.pdf",
  "subject": [
    "Creasing of textiles.",
    "Rayon."
  ],
  "subject_lcc": "LD5655.V856 1942.S842",
  "title": "A study of the crease-resistance of viscose rayon",
  "type": "Dissertation"
}