{
  "contributor_author": "Brown, Jeffrey A.",
  "contributor_committeechair": "Potter, Kenneth R.",
  "contributor_committeemember": [
    "Falls, Jane Ann",
    "Lockee, Barbara B.",
    "Whitt, Gary L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:13:57Z",
  "date_adate": "2008-07-22",
  "date_available": "2014-03-14T20:13:57Z",
  "date_issued": "2008-07-02",
  "date_rdate": "2009-07-22",
  "date_sdate": "2008-07-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Implementation is a phase included in nearly all instructional development models, yet literature on instructional design and technology reveals little about implementation창  s nature and the special conditions that must be considered as users go beyond adoption (Ely, 1999).  Ely (1990b; 1999) contends these conditions include dissatisfaction with the status quo, leadership, commitment, participation, resources, time, incentives and rewards, and knowledge and skills. When employing Ely창  s conditions as a framework for investigation, attention is shifted away from the innovation to the environment where the innovation has actually been adopted and utilized as a facilitating factor in implementation. The move to online and software-based environments in recent years is accompanied by a need for additional research to further validate Ely창  s conditions within this new context.  This exploratory study identified and analyzed user pre and post-implementation perceptions regarding the relative importance of Ely창  s conditions for the successful mplementation of an actual innovation, a product management system.  An online survey, the Implementation Profile Instrument created by the founders of iphase.org, was adapted and utilized to capture user perceptions.  Descriptive statistics and factor analyses revealed important differences with past innovations and contexts, and between pre and post implementer groups and pre and post-implementation stages.",
  "description_provenance": [
    "Author Email: jebrown4@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: jfalls@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: whitt@roanoke.edu",
    "Made available in DSpace on 2014-03-14T20:13:57Z (GMT). No. of bitstreams: 1 Brown.pdf: 571346 bytes, checksum: 0c2b0461aa8f3042d7042d4c91301ef1 (MD5)   Previous issue date: 2008-07-02"
  ],
  "handle": "28283",
  "identifier_other": "etd-07132008-130422",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07132008-130422/",
  "identifier_uri": "http://hdl.handle.net/10919/28283",
  "publisher": "Virginia Tech",
  "relation_haspart": "Brown.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Diffusion of Innovations Theory",
    "Systems Theory",
    "Change Theory",
    "Adoption",
    "Implementation",
    "Instructional Design"
  ],
  "title": "Perceptions of the Relative Importance of Conditions that Facilitate Implementation",
  "type": "Dissertation"
}