{
  "contributor_author": "Esposito, Rosario",
  "contributor_committeechair": "Bodnar, Robert J.",
  "contributor_committeemember": [
    "Lima, Annamaria",
    "De Vivo, Benedetto",
    "Tracy, Robert J.",
    "Rimstidt, james Donald"
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:13:58Z",
  "date_adate": "2012-08-15",
  "date_available": "2014-03-14T20:13:58Z",
  "date_issued": "2012-07-02",
  "date_rdate": "2012-08-15",
  "date_sdate": "2012-07-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Understanding volatile evolution associated with active volcanic magmatic systems is of paramount importance because volatiles control and determine the magnitude of an eruption owing to the large change in molar volume that volatile species show depending on their physical state (volatiles dissolved in silicate melts vs. volatiles exsolved as vapor). For active volcanic systems studying the volatile evolution can help to assess the potential hazard associated to a certain locality. Also, volatile evolution in magmatic system controls the formation of certain ore deposits. <p> Despite the importance of understanding volatile evolution of magmatic systems, concentrations of volatiles of evolving magmas are not easily available especially for magmas originated in the deep crust. Fortunately, sample of melts can be entrapped as melt inclusion (MI) into growing igneous minerals in crystalizing magma chamber. After the entrapment, the crystal works as an insulating capsule from the external magmatic environment. <p> Researchers have started to use MI because they provide some advantages in respect to the classical whole rock approach to petrological studies. One of the most important advantages is that MI often represent sample of a deep and non-degassed melt (glass) available at Earthâ  s surface. In fact, with the exception of deep ocean basalts, igneous whole rocks found at the Earthâ  s surface are degassed magmas. <p> This dissertation is a compilation of four publications produced during six years of research and is addressed to give a contribution in understanding the volatile evolution in magmatic systems and also to improve the present understanding of information that can be obtained using the melt inclusions technique.<p> In the first chapter, I present an alternative interpretation of H<sub>2</sub>O-CO<sub>2</sub> trends obtained from MI. In this study, we demonstrate that these trends can be due to post entrapment crystallization on the wall of the MI and not to magma ascent. This alternative view is more realistic especially for cases where in the same phenocrysts MI show strongly different CO<sub>2</sub> concentrations. <p> In the second chapter, I present a study to test for the MI reliability in recording volatile concentrations. We used the approach of the melt inclusion assemblage (MIA) that consists of analyzing groups of MI presumably entrapped at the same time and, thus, at same chemical and physical conditions. The results show that most of the MIA studied show consistent volatile concentrations corroborating the reliability of the MI technique. CO<sub>2</sub> shows the highest degrees of variability and we have assessed this behavior mostly to C-contamination in the surface of the sample. <p> The third chapter is a study case (the Solchiaro eruption in Southern Italy) that shows the potential uses of MI to understanding the volatile evolution. I present a model showing the dynamic of the magma based on MI. This study also discusses the origin of anomalous MI and which MI provide the best information. <p> The final chapter is dedicated to test the applicability of the new Linkam TS1400XY heating stage. I was able to show how this new microthermometric tool is capable of homogenizing MI at high temperature and to quench MI to a homogeneous glass state.",
  "description_provenance": [
    "Author Email: rosario@vt.edu",
    "Advisor Email: anlima@unina.it",
    "Advisor Email: bdevivo@unina.it",
    "Advisor Email: rtracy@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: rjb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:58Z (GMT). No. of bitstreams: 1 Esposito_R_D_2012.pdf: 13530102 bytes, checksum: dc1d3e045394f32004d9532c69324828 (MD5)   Previous issue date: 2012-07-02"
  ],
  "handle": "28287",
  "identifier_other": "etd-07132012-102229",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07132012-102229/",
  "identifier_uri": "http://hdl.handle.net/10919/28287",
  "publisher": "Virginia Tech",
  "relation_haspart": "Esposito_R_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Melt Inclusion Assemblage",
    "Post Entrapment Crystallization",
    "Melt Inclusion",
    "Volatile Evolution",
    "Microscope Heating Stage",
    "Magma Degassing"
  ],
  "title": "Studies of volatile evolution in magmatic systems using melt inclusions",
  "type": "Dissertation"
}