{
  "contributor_author": "Berrien, La Shaun Josette",
  "contributor_committeechair": "furey, Michael J.",
  "contributor_committeemember": [
    "Eiss, Norman S. Jr.",
    "Veit, Hugo P.",
    "Scott, Elaine P.",
    "Gregory, Eugene M."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:13:59Z",
  "date_adate": "1999-07-17",
  "date_available": "2014-03-14T20:13:59Z",
  "date_issued": "1999-06-28",
  "date_rdate": "2012-05-08",
  "date_sdate": "1999-07-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Tribology is the science of interacting surfaces in relative motion.  It is specifically concerned with the friction, wear and lubrication of these surfaces. Although tribology has conventionally been associated with the surface interaction of mechanical systems, concepts of tribology have also been important in the study of biological systems. Biotribology is one of the newest fields to emerge in the discipline of tribology. It can be described as the study of friction, wear and lubrication of biological systems, mainly synovial joints such as the human hip and knee. <p> Osteoarthritis (OA) is partially characterized by the loss of articular cartilage from the contacting surface of the articulating bones in synovial joints. Although it has been studied extensively, the exact pathways and pathogenesis of OA have yet to be determined.  Several factors have been cited as possible contributors to the condition.  These factors can primarily be grouped into two categories of mechanical or biochemical abnormalities. Research in biotribology enables the examination of both the mechanical and biochemical factors involved in joint lubrication and OA.  This research has focussed on the mechanisms of normal joint lubrication, as well as the possible connections between biotribology and osteoarthritis.  Particular emphasis is placed on the effects of biochemical changes and environment on cartilage wear and damage. <p> Studies were carried out using a test device developed to study the tribological properties of articular cartilage, in vitro. A cartilage-on-cartilage test configuration was used with bovine articular cartilage and a cartilage-on-stainless steel configuration used with lapine articular cartilage. Articulating surfaces were put in sliding contact under a normal load. Natural and biochemically modified environments were created to simulate possible normal and pathologic in vivo conditions. Wear and friction of the articular cartilage were measured and related to biochemical environments which are suspected in clinical cases of OA.  Quantitative measurement of cartilage wear was achieved through hydroxyproline assay of the post-test lubricants. Surface and subsurface damage were also examined through the use of scanning electron microscopy and histological staining techniques.  <p> The results of four separate studies demonstrated that: (1) exposure of bovine cartilage to collagenase-3, an enzyme suspected in the cartilage degeneration seen in OA, significantly increased cartilage wear (p = 0.001); (2) lapine cartilage with surgically induced OA exhibited higher coefficients of friction, but no significant increase in wear over normal cartilage from the same animal; (3) the addition of white blood cell lysate, comparable to what would be seen in mild joint inflammation, to synovial fluid significantly increased cartilage wear over normal synovial fluid (p = 0.002); (4) the removal of \"boundary lubricating\" surface-active phospholipids (SAPLs) from normal synovial fluid had no significant effect on cartilage wear.  <p> These results demonstrate that biochemical changes in the cartilage, as well as the synovial fluid, can lead to increased wear of and damage to the articular cartilage surface. How these changes may occur in living systems remains to be determined. The use of the tribological test device developed and various analytical techniques has made it possible to quantitatively evaluate the effects of biochemical changes and environment on the wear and damage of articular cartilage. These studies have demonstrated that research in biotribology has the potential to make significant contributions to the current knowledge not only of normal joint lubrication but of joint pathology as well.",
  "description_provenance": [
    "Author Email: lberrien@vt.edu",
    "Advisor Email: neiss@vt.edu",
    "Advisor Email: hpveit9@vt.edu",
    "Advisor Email: mfurey@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:59Z (GMT). No. of bitstreams: 1 ljbetd.pdf: 2259500 bytes, checksum: 61a48a024ccec30bc42f921319867b89 (MD5)   Previous issue date: 1999-06-28"
  ],
  "handle": "28289",
  "identifier_other": "etd-071399-125450",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-071399-125450/",
  "identifier_uri": "http://hdl.handle.net/10919/28289",
  "publisher": "Virginia Tech",
  "relation_haspart": "ljbetd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "SEM",
    "Cartilage Wear",
    "Histology",
    "Osteoarthritis",
    "Tribology"
  ],
  "title": "Biotribology: Studies of the Effects of Biochemical Environments on the Wear and Damage of Articular Cartilage",
  "type": "Dissertation"
}