{
  "contributor_author": "Wimpey, Jeremy Felton",
  "contributor_committeechair": "Marion, Jeffrey L.",
  "contributor_committeemember": [
    "Carstensen, Laurence William Jr.",
    "Lawson, Steven R.",
    "Resler, Lynn M.",
    "Heatwole, Conrad D."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:13:58Z",
  "date_adate": "2009-07-21",
  "date_available": "2014-03-14T20:13:58Z",
  "date_issued": "2009-07-01",
  "date_rdate": "2013-11-13",
  "date_sdate": "2009-07-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> This dissertation contains two journal articles; the first article (Chapter 2) evaluates the relative influences of use, managerial and environmental factors on trail width, from a survey of all formal trails in Acadia National Park, Maine, USA.  Regression analyses of trail width data focus on increasing our understanding of the relationships among visitor use, environmental and managerial factors and trail width. In particular, regression modeling was used to evaluate the relative importance of factors that influence trail width along hiking trails. ANOVA analyses demonstrate differences in trail width based on trail surface type, and the presence or absence of trail borders.  A novel approach of comparing intended widths to actual widths enabled us to look specifically at the avoidable and undesirable impacts associated with having a trail that is wider than intended. Informal trails (visitor created) represent a threat to the natural resources of protected natural areas around the globe. These trails can remove vegetation, displace wildlife, alter hydrology, alter habitat, spread invasive species, and fragment landscapes.  <p>The second article (Chapter 3) examines informal and formal trails within Great Falls Park, VA, a sub-unit of the George Washington Memorial Parkway, managed by the U.S. National Park Service. This study sought to answer three specific questions: 1) Are the physical characteristics and topographic alignments of informal trails significantly different from formal trails, 2) Can landscape fragmentation metrics be used to summarize the relative impacts of formal and informal trail networks on a protected natural area?, and 3) What can we learn from examining the spatial distribution of the informal trails within protected natural areas? Statistical comparisons between formal and informal trails in this park indicate that informal trails have less sustainable topographic alignments than their formal counterparts. Spatial summaries of the lineal and areal extent and fragmentation associated with the trail networks by park management zones compare park management goals to the assessed attributes. Hotspot analyses highlight areas of high trail density within the park and findings provide insights regarding potential causes for development of dense informal trail networks.",
  "description_provenance": [
    "Author Email: wimpeyjf@vt.edu",
    "Advisor Email: jmarion@vt.edu",
    "Advisor Email: carstens@vt.edu",
    "Advisor Email: slawson@rsginc.com",
    "Advisor Email: resler@vt.edu",
    "Advisor Email: heatwole@exchange.vt.edu",
    "Made available in DSpace on 2014-03-14T20:13:58Z (GMT). No. of bitstreams: 1 Dissertation_Master_JW_7_16.pdf: 3435371 bytes, checksum: af5890732b7c18c16eb7784196abb2e9 (MD5)   Previous issue date: 2009-07-01"
  ],
  "handle": "28284",
  "identifier_other": "etd-07132009-134629",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07132009-134629/",
  "identifier_uri": "http://hdl.handle.net/10919/28284",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Master_JW_7_16.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "trails",
    "spatial analysis",
    "Acadia National Park",
    "George Washington Memorial Parkway",
    "recreation ecology",
    "impact assessment"
  ],
  "title": "Assessing and Evaluating Recreational Trails on Public Lands",
  "type": "Dissertation"
}