{
  "contributor_author": "Tredick, Catherine Anne",
  "contributor_committeecochair": [
    "Vaughan, Michael R.",
    "Kelly, Marcella J."
  ],
  "contributor_committeemember": [
    "Stauffer, Dean F.",
    "Stern, Marc J."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:14:02Z",
  "date_adate": "2011-08-18",
  "date_available": "2014-03-14T20:14:02Z",
  "date_issued": "2011-06-23",
  "date_rdate": "2011-08-18",
  "date_sdate": "2011-07-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Understanding how wildlife utilize habitat at varying scales is important for understanding and predicting potential impacts of landscape changes (e.g., habitat loss and fragmentation, restoration efforts, climate change, etc.) and in determining effective strategies for conservation and management. This research examines fine-scale and landscape-level habitat use of black bears in Canyon de Chelly National Monument (CACH), Arizona, USA in the context of large-scale landscape change. Currently, CACH is undergoing a large-scale restoration effort to remove all of the non-native Russian olive (Elaeagnus angustifolia) and tamarisk (Tamarix ramosissima and T. chinensis) within the monument. As black bears rely on the Russian olive as a primary food source, a major goal of this research was to evaluate how bears currently use this resource and how its removal might affect bear habitat use and bear-human interactions within the monument. I developed a model of 3rd order (fine-scale) black bear habitat use in CACH using an occupancy modeling approach. Model results indicated that fine-scale habitat selection by bears in CACH is being driven by the presence of non-native Russian olive as well as native food sources. Thus availability of native foods may be sufficient to maintain the bear population in CACH, and bears may quickly adapt to the loss of the non-native food source. Similarly, results showed that bears avoid human areas and farmsteads and prefer higher elevations, suggesting that once olive is removed in the lower canyons near human areas, bear-human interactions may become less of a problem over the long term. I also developed a model of 2nd order (landscape-level) habitat use and evaluated movement patterns of black bears in CACH using location data collected from GPS collars. Model results showed that bears selected areas with higher tree canopy cover and terrain ruggedness, indicating that forest cover and escape cover are primary factors driving black bear habitat selection at the landscape scale in this region. Movement patterns revealed large mean daily movements and low average turning angles, indicating long, linear movements designed to take advantage of the mosaic of available habitats and food resources available over larger areas. I extracted DNA from hair samples collected throughout the study area to examine genetic variability and population structure of black bears in the region. Analyses revealed a relatively healthy, panmictic population across the wider landscape. No substantial genetic structuring was observed in multiple analyses, though I did find evidence of a slight isolation-by-distance pattern within the population. Measures of both current (Nb = 24) and long-term (Ne = 579) effective population size indicated a relatively high number of breeders in the current population and a sufficient amount of gene flow within the larger â  superpopulationâ   to maintain long-term genetic viability. I focused the final portion of my dissertation research on understanding the factors that influence stakeholder acceptance capacity for black bears, which plays a central role in contemporary wildlife management issues, including human-wildlife conflict. I used data from telephone interviews of 1,546 residents in Virginia to develop conceptual models of black bear acceptance capacity at both county and state levels. Model results suggested that more deep-seated and less easily influenced factors (e.g., values and risk perceptions) are at the heart of stakeholder attitudes and perceptions of wildlife, making influencing these perceptions more difficult. Agencies can indirectly affect these attitudes and perceptions, however, by targeting more potentially pliable factors related to wildlife acceptance capacity such as knowledge, personal experience with wildlife, and trust in management agencies.",
  "description_provenance": [
    "Author Email: ctredick@vt.edu",
    "Advisor Email: mvaughan@vt.edu",
    "Advisor Email: makelly2@vt.edu",
    "Advisor Email: dstauffe@vt.edu",
    "Advisor Email: mjstern@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:02Z (GMT). No. of bitstreams: 1 Tredick_CA_D_2011.pdf: 2412594 bytes, checksum: 2dd98fa9a8c497d88612470fe511616a (MD5)   Previous issue date: 2011-06-23"
  ],
  "handle": "28299",
  "identifier_other": "etd-07142011-153834",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07142011-153834/",
  "identifier_uri": "http://hdl.handle.net/10919/28299",
  "publisher": "Virginia Tech",
  "relation_haspart": "Tredick_CA_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Canyon de Chelly National Monument",
    "black bear",
    "habitat use",
    "genetic structure",
    "human dimensions",
    "wildlife stakeholder acceptance capacity"
  ],
  "title": "Black bears in Canyon de Chelly National Monument: Life in a changing environment",
  "type": "Dissertation"
}