{
  "contributor_author": "Miller, Larry Edwin",
  "contributor_committeechair": "Herbert, William G.",
  "contributor_committeemember": [
    "Cross, Lawrence H.",
    "Nickols-Richardson, Sharon M.",
    "Gwazdauskas, Francis C.",
    "Ramp, Warren K."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:14:01Z",
  "date_adate": "2003-07-22",
  "date_available": "2014-03-14T20:14:01Z",
  "date_issued": "2003-07-08",
  "date_rdate": "2004-07-22",
  "date_sdate": "2003-07-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to assess the validity, as well as to test novel approaches to improving the reliability, of mechanical response tissue analysis (MRTA).  Twenty composite tibiae underwent MRTA testing on three separate days to determine intra- and inter-day reliability of bending stiffness.  The bones were then subjected to three-point bending tests to directly determine elastic modulus.  Within- and between-day reliability of tibial bending stiffness with MRTA was moderate (CV = 24%) and poor (CV = 74%), respectively.  No relationship was observed between the two testing methods due to the wide variation in tibial bending stiffness values with MRTA.  The second part of the study sought to determine within- and between-day reliability of MRTA in young women with the current testing protocol and compare the results with those from newly-designed protocols.  Twelve women (23 ± 2 yr, 162 ± 7 cm, 57 ± 7kg, 19 ± 4 % fat) were tested for tibial bending stiffness with MRTA over 5 days.  The current protocol was compared to protocols where day-to-day subject positioning was quantified, subjects were tested in a supine position, and various bending stiffness prediction models were used.  Within- (CV = 20%) and between-day (CV = 19%) reliability of tibial bending stiffness with MRTA was moderate using the original methodology.  Modifications to this protocol either resulted in similar or worse reliability.",
  "description_provenance": [
    "Author Email: millerle@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: snrichar@vt.edi",
    "Advisor Email: guaz@vt.edu",
    "Advisor Email: wgherb@vt.edu",
    "Advisor Email: awramp@rockbridge.net",
    "Made available in DSpace on 2014-03-14T20:14:01Z (GMT). No. of bitstreams: 1 MillerLE_Diss_FinalEdits_7.15.03.pdf: 1133941 bytes, checksum: f5d40db30b9a224c46d2d0f62e89d9b7 (MD5)   Previous issue date: 2003-07-08"
  ],
  "handle": "28293",
  "identifier_other": "etd-07142003-172355",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07142003-172355/",
  "identifier_uri": "http://hdl.handle.net/10919/28293",
  "publisher": "Virginia Tech",
  "relation_haspart": "MillerLE_Diss_FinalEdits_7.15.03.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "tibia",
    "reliability",
    "stiffness",
    "validity",
    "mechanical response tissue analysis"
  ],
  "title": "Reliability and Validity of Mechanical Response Tissue Analysis in Composite and Human Tibiae",
  "type": "Dissertation"
}