{
  "contributor_author": "Wu, Jinpei",
  "contributor_committeechair": "Carlson, Kevin D.",
  "contributor_committeemember": [
    "Hatfield, Donald E.",
    "Gove, Steve",
    "Lang, James R.",
    "Murrmann, Kent F."
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:14:02Z",
  "date_adate": "2009-07-21",
  "date_available": "2014-03-14T20:14:02Z",
  "date_issued": "2009-07-09",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-07-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The empirical evidence is rather weak and sometimes inconsistent as to what predicts an individualâ  s decision to start a business.  Among many possible causes, this study attempts to disentangle the effects of individual differences and context.  I propose to use a framework involving an individualâ  s entrepreneurial intent, entrepreneurial orientation and four individual difference factors as a means to isolate individual difference determinants of entrepreneurial intent.  These are captured in new construct called entrepreneurial orientation. Samples of entrepreneurs and college students from the United States and China were used to test the relationships. The empirical results show that entrepreneurial orientation is positively related to individual differences factors and entrepreneurial intent. Even more, it fully or partially mediates the relationships between the individual differences and entrepreneurial intent. Among the four individual differences listed, opportunity recognition seems to be the best predictor of an individualâ  s entrepreneurial orientation and entrepreneurial intent.  Future research should further examine opportunity recognition and entrepreneurial orientation. It appears that attempting to isolate effects of individual differences from context can be a viable strategy for studying determinants of new venture creation.",
  "description_provenance": [
    "Author Email: jwu05@vt.edu",
    "Advisor Email: kevinc@vt.edu",
    "Advisor Email: hatfield@vt.edu",
    "Advisor Email: steve.gove@vt.edu",
    "Advisor Email: jrlang@vt.edu",
    "Advisor Email: murrmann@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:02Z (GMT). No. of bitstreams: 1  JinpeiWu.pdf: 2326040 bytes, checksum: 6bc166426ca3c017bd0624315ec95851 (MD5)    Previous issue date: 2009-07-09"
  ],
  "handle": "28298",
  "identifier_other": "etd-07142009-160704",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07142009-160704/",
  "identifier_uri": "http://hdl.handle.net/10919/28298",
  "publisher": "Virginia Tech",
  "relation_haspart": "JinpeiWu.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Entrepreneurial intent",
    "China.",
    "Entrepreneurial orientation",
    "Context",
    "Opportunity recognition"
  ],
  "title": "Entrepreneurial Orientation, Entrepreneurial Intent and New Venture Creation: Test of a Framework in a Chinese Context",
  "type": "Dissertation"
}