{
  "contributor_author": "Sallee, David Norval",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Wildman, Terry M.",
    "Baffi, Charles R.",
    "Krouscas, James A. Jr.",
    "Zeakes, Beverly"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:14:03Z",
  "date_adate": "2002-07-26",
  "date_available": "2014-03-14T20:14:03Z",
  "date_issued": "2002-07-02",
  "date_rdate": "2005-07-26",
  "date_sdate": "2002-07-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<body bgcolor=\"#FFFFFF\" text=\"#000000\"> <p>The identification of key health risks among the adolescent population allows    Roanoke County to develop and implement a youth risk behavior prevention program    that is tailored to the needs of the students. This study provides Roanoke County    Schools with a large sample of student survey data regarding youth risk behavior.    The final sample includes 6504 student surveys. </p> <p><br>   The research tool that was used for the study is titled the Youth Risk Behavior    Survey. The instrument is designed to gather data in six categories: behaviors    that contribute to unintentional and intentional injuries; tobacco use; alcohol    and other drugs; sexual behavior; dietary behavior; and physical activity.</p> <p><br>   Roanoke County students reported participating in at risk behavior more than    their national counterparts in all six categories. Injuries, violence, drugs,    and behaviors related to dieting, had the highest number of responses above    percents reported in national YRBS data. Additional research is needed to determine    the impact of prevention programs designed to deal with these problem behaviors.<br>   <br> </p> </body>",
  "description_provenance": [
    "Author Email: dsallee@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Advisor Email: baffic@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: jkrousca@vt.edu",
    "Advisor Email: bzeakes@radford.edu",
    "Made available in DSpace on 2014-03-14T20:14:03Z (GMT). No. of bitstreams: 1 David1.pdf: 4091289 bytes, checksum: ca8e9ed1e30dbea60de13289cd222efd (MD5)   Previous issue date: 2002-07-02"
  ],
  "handle": "28307",
  "identifier_other": "etd-07162002-093513",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07162002-093513/",
  "identifier_uri": "http://hdl.handle.net/10919/28307",
  "publisher": "Virginia Tech",
  "relation_haspart": "David1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "Youth Risk Behavior",
  "title": "Youth at Risk:  An Analysis of the Health Behaviors of Roanoke County Students",
  "type": "Dissertation"
}