{
  "contributor_author": "Burdette, Paula Jeanne",
  "contributor_committeechair": "Crockett, Jean B.",
  "contributor_committeemember": [
    "Gillespie, Diane Newkirk",
    "Dawson, Christina M.",
    "Mason, Christine",
    "Fortune, Jimmie C."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:14:03Z",
  "date_adate": "1999-07-20",
  "date_available": "2014-03-14T20:14:03Z",
  "date_issued": "1999-07-07",
  "date_rdate": "2000-07-20",
  "date_sdate": "1999-07-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As educators are held accountable for student outcomes more frequently, more stringently, and more fully throughout the school organization, service delivery systems have become a focus. Not only are teachers being held accountable for students' learning, but also principals and other administrators are beginning to feel the pressure from public concerns regarding the education of children in the United States. The quality of student instruction can be addressed through practical service delivery models, while administrators' support of the model chosen for their schools is a pivotal variable for effectiveness and efficiency. Students with identified disabilities are being served more frequently in general education classrooms for all or most of their school day. The percentage of students with disabilities served in heterogeneous classes has increased from 32.8% in 1990-1991 to 44.5% in 1994-1995 (U. S. Department of Education, 1997). The more service delivery options available, the more likely an appropriate education will be delivered to these students with disabilities who are placed in heterogeneous classrooms. Cooperative services between general and special educators such as consultation and co-teaching, which include both direct services to students and indirect services through the classroom teacher, offer unique and malleable options for service delivery. To fully understand the process of administrative support for this innovative model, it is imperative to study the interactions between the innovation, the context in which it is being implemented, and the individuals involved with the innovation (Corbett, Dawson, & Firestone, 1984). The study of a process is difficult because it involves investigating the factors that affect the likelihood that there will be change in the individuals who are involved. It necessitates the need to identify what they do, think, and believe in relation to the demands outlined by an innovation (Fullan, 1982). Researchers suggest the necessity of on-site case studies to gain insight and to investigate processes (Fullan; Hall & Hord, 1987; Huberman & Miles, 1984; Patton, 1990). The intent of this qualitative study is to explore how principals view their ability to support the cooperation between general and special educators for the benefit of students with disabilities. Specifically, the goal is to gain a deeper understanding of the facilitators and inhibitors that principals face when attempting to support this cooperation and to describe methods that principals have used, successfully and unsuccessfully, to avoid barriers to cooperation. Interviews will be conducted with principals who have previously been the special or general educator in a collaborative consultation process, as well as with both general and special educators currently working with this principal. This unusual perspective is designed to give rich descriptive information to educators who choose to use this promising practice of service delivery for at-risk students and students with disabilities at the K-12 level.",
  "description_provenance": [
    "Author Email: pburdett@vt.edu",
    "Advisor Email: dgilles@vt.edu",
    "Advisor Email: tdawson@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: chrism@cec.sped.org",
    "Advisor Email: fortunjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:03Z (GMT). No. of bitstreams: 1 DISSERTATION1.PDF: 504472 bytes, checksum: 9f05e43cb6a1e433ea9b5ef9fd306360 (MD5)   Previous issue date: 1999-07-07"
  ],
  "handle": "28306",
  "identifier_other": "etd-071599-212736",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-071599-212736/",
  "identifier_uri": "http://hdl.handle.net/10919/28306",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISSERTATION1.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "collaboration",
    "special education",
    "consultation",
    "teaching partnerships",
    "cooperation"
  ],
  "title": "Administrative Supports of Teachng Partnerships Between General and Special Educators",
  "type": "Dissertation"
}