{
  "contributor_author": "Smith, Charles Michael",
  "contributor_committeechair": "Leech, Irene E.",
  "contributor_committeemember": [
    "White, W. Alex",
    "Baker, W. Kevin",
    "Beamish, Julia O."
  ],
  "contributor_department": "Apparel, Housing, and Resource Management",
  "date_accessioned": "2014-03-14T20:14:03Z",
  "date_adate": "2007-07-25",
  "date_available": "2014-03-14T20:14:03Z",
  "date_issued": "2007-07-02",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-07-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "</p><p> Whether or not Americans feel they have sufficient information or knowledge to make mutual fund investing decisions, more and more investors are forced to make these choices if they wish to invest for future goals like retirement.  The problem for policymakers is deciding how to provide information on mutual funds that is both useful and used by potential investors.    </p><p> The purpose of this study was to test the relationship between an investor's personality and the effort exhibited by a potential investor in seeking information about a mutual fund investment, as well as the type of information the potential investor considers important.    </p><p> For this research, \"personality\" was the independent variable that was hypothesized to influence the dependent variable, investor \"information-seeking effort\" before an investment decision is made.  Personality is composed of the four dichotomous Myers-Briggs' functions, including 1) Extraversion versus Introversion, 2) Sensing versus Intuition, 3) Thinking versus Feeling, and 4) Judging versus Perceiving.  A survey was created to identify the mutual fund information considered important by potential investors, and their stated likelihood of seeking out said information before making a purchase decision.  </p><p> The Myers-Briggs' preference indicator and the information-seeking effort survey were administered to 101 college and university students.  Eighty-one students met the selected criteria.    </p><p>Upon analysis, results indicated statistically significant differences in the basic-level information-seeking effort of participants based on the potential investor's attitude toward dealing with the outside world (judging vs. perceiving preference) with judgers labeling basic-level information as more important than did perceivers.  In addition, results indicated that judger's initial satisfaction with their mutual fund choice was significantly higher, statistically.  Lastly, based on a comparison of qualitative information items vs. quantitative information items provided, quantitative information was labeled as significantly more important (statistically) than qualitative information.  Based on the findings, recommendations for educators, regulators, and policy-makers are provided, and include simplification of the terminology used in point-of-sale mutual fund information and increased financial literacy education for consumers.   </p>",
  "description_provenance": [
    "Author Email: smithcm@vt.edu",
    "Advisor Email: ileech@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:03Z (GMT). No. of bitstreams: 2 SmithETD.pdf: 747306 bytes, checksum: 00501986ab0413caa2712c0d1a16e3ef (MD5) IRBapproval.pdf: 149975 bytes, checksum: b787a3bbd1de164ec1011ab12f90f889 (MD5)   Previous issue date: 2007-07-02"
  ],
  "handle": "28304",
  "identifier_other": "etd-07152007-200033",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07152007-200033/",
  "identifier_uri": "http://hdl.handle.net/10919/28304",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "SmithETD.pdf",
    "IRBapproval.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "information-seeking",
    "myers-briggs",
    "investment",
    "personality",
    "mutual funds"
  ],
  "title": "Personality and the information seeking efforts of potential investors",
  "type": "Dissertation"
}