{
  "contributor_author": "Saleem, Jason Jamil",
  "contributor_committeechair": "Kleiner, Brian M.",
  "contributor_committeemember": [
    "Casali, John G.",
    "Smith-Jackson, Tonya L.",
    "Trani, Antonio A.",
    "Babski-Reeves, Kari L."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:14:04Z",
  "date_adate": "2003-07-17",
  "date_available": "2014-03-14T20:14:04Z",
  "date_issued": "2003-06-17",
  "date_rdate": "2004-07-17",
  "date_sdate": "2003-07-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research examined human-machine performance in a General Aviation (GA) environment under dynamic conditions using a combination of field study and laboratory experimentation.  Using this combination of methods, the functional system of pilots performing a landing approach (both instrument and visual) with a Cessna 172 to the Roanoke Regional Airport (ROA) was described and analyzed.  In the field study, data collection was guided by an integrative method based on macroergonomics (ME) and distributed cognition (DC), allowing the cognitive aspects of a sociotechnical system to be treated as equally important as the organizational components.  Also of interest was how pilot performance was affected by the introduction of nighttime and deteriorating weather conditions to this GA environment.  Few statistically significant differences were found between pilots who flew by visual flight rules (VFR) and those who flew by instrument flight rules (IFR) or within each of these pilot groups in terms of objective flight performance.  However, there were several significant differences between VFR and IFR pilots and within each pilot group in terms of workload and especially situation awareness across conditions; situation awareness for VFR pilots was found to be significantly reduced compared to situation awareness for IFR pilots in nighttime and deteriorating weather conditions (p < 0.05).  <p>  In addition to these statistical findings and the methodological contribution of a joint systems/cognitive method, contributions of this dissertation include a greater understanding of the GA pilot/cockpit system and a systems-oriented cognitive model of this aviation environment as described by the ME/DC method for both VFR and IFR pilots.  Further, procedural comparisons were performed between the flight simulator and the actual Cessna 172 used in the field study to increase our understanding of how to improve the validity associated with using simulators in research.  Findings from both the laboratory and field studies in this research support new designs and technologies envisioned for future aviation systems that would assist the pilot during a landing approach such as weather information systems, head-up displays, synthetic vision, three-dimensional auditory displays, increased automation, and communications filters.  Potential future applications of this research are also explored.",
  "description_provenance": [
    "Author Email: jsaleem@vt.edu",
    "Advisor Email: jcasali@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: vuela@vt.edu",
    "Advisor Email: kbabski@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:04Z (GMT). No. of bitstreams: 1 Saleem_ETD.pdf: 1623013 bytes, checksum: 7f543670f2eefa33372cc1a93fb0cf93 (MD5)   Previous issue date: 2003-06-17"
  ],
  "handle": "28309",
  "identifier_other": "etd-07162003-215850",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07162003-215850/",
  "identifier_uri": "http://hdl.handle.net/10919/28309",
  "publisher": "Virginia Tech",
  "relation_haspart": "Saleem_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "General Aviation",
    "VFR",
    "Distributed Cognition",
    "Macroergonomics",
    "Landing Approach",
    "IFR"
  ],
  "title": "Multi-Method Approach to Understand Pilot Performance in a Sociotechnical Aviation System",
  "type": "Dissertation"
}