{
  "contributor_author": "Gross, Tiffany  Lauren",
  "contributor_committeechair": "Adelman, Zachary N.",
  "contributor_committeemember": [
    "Sharakhov, Igor V.",
    "Dolan, Erin L.",
    "Zhu, Jinsong",
    "Myles, Kevin M."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:14:03Z",
  "date_adate": "2011-07-21",
  "date_available": "2014-03-14T20:14:03Z",
  "date_issued": "2011-07-11",
  "date_rdate": "2011-07-21",
  "date_sdate": "2011-07-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Aedes aegypti is an important vector of the viruses that cause dengue fever, dengue hemorrhagic fever, and yellow fever.  In depth genetic studies of vector species have been made possible due to the availability of genome sequences and techniques for producing stably transformed mosquitoes.  These resources have also contributed to the establishment of new genetics-based approaches to the control of vector borne disease. \tGenetic studies of Ae. aegypti have benefited from the ability to drive targeted transgene expression, however a ubiquitous inducible promoter has not been identified in this mosquito.  The Drosophila melanogaster heat shock 70 promoter has been shown to drive inducible expression in heterologous systems; however, DmHsp70 possesses significant basal activity in Aedes aegypti.   \tThis study characterized the sequence and expression of the heat shock 70 genes of Aedes aegypti. AaHsp70 genes were found to be organized in two clusters, each comprised of three divergent pairs.  AaHsp70 genes exhibited robust expression upon heat shock in larvae, pupae, and adults as well as in heads, salivary glands, midguts and ovaries.  \tGenomic regions upstream of AaHsp70 genes were found to drive heat-inducible expression of a reporter in both cell and embryo assays.  Deletion analysis of AaHsp70-derived promoters yielded two ~1.5 kb genomic fragments that maintained  robust heat inducibility in these systems.  \tAedes aegypti were transformed with AaHsp70-luciferase gene cassettes using the transposable element Mos1.  AaHsp70-luciferase transcripts accumulated specifically after heat shock, and displayed a pattern of rapid induction and decay similar to endogenous AaHsp70 genes.  Heat-induced expression of luciferase was observed in transgenic larvae, pupae and adults as well as heads, midguts and ovaries but not salivary glands, with levels varying between transgenic strains.   \tThe effect of heat shock on the endogenous RNAi pathway as well as the effect of blood feeding on the expression of AaHsp70 genes was investigated, though reproducible results could not be obtained using the assays employed. \tIn conclusion, the heat shock 70 gene family of Aedes aegypti was identified and characterized.  The AaHsp70 promoters described could be valuable for gene function studies as well as for the precise timing of the expression of anti-pathogen molecules.",
  "description_provenance": [
    "Author Email: tgross@vt.edu",
    "Advisor Email: igor@vt.edu",
    "Advisor Email: edolan@vt.edu",
    "Advisor Email: zhujin@vt.edu",
    "Advisor Email: zachadel@vt.edu",
    "Advisor Email: mylesk@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:03Z (GMT). No. of bitstreams: 1 Gross_TL_D_2011.pdf: 11500223 bytes, checksum: 04f952267860c7490537484a1633722c (MD5)   Previous issue date: 2011-07-11"
  ],
  "handle": "28305",
  "identifier_other": "etd-07152011-214236",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07152011-214236/",
  "identifier_uri": "http://hdl.handle.net/10919/28305",
  "publisher": "Virginia Tech",
  "relation_haspart": "Gross_TL_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Aedes aegypti",
    "heat shock",
    "hsp70",
    "inducible promoter"
  ],
  "title": "Aedes aegypti Heat Shock 70 Genes and their Inducible Promoters",
  "type": "Dissertation"
}