{
  "contributor_author": "Becker, Stephen Paul",
  "contributor_committeechair": "Bodnar, Robert J.",
  "contributor_committeemember": [
    "Rimstidt, james Donald",
    "Tracy, Robert J.",
    "Student, James J."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:14:05Z",
  "date_adate": "2007-07-26",
  "date_available": "2014-03-14T20:14:05Z",
  "date_issued": "2007-07-05",
  "date_rdate": "2007-07-26",
  "date_sdate": "2007-07-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Magmatic-hydrothermal ore deposits are formed in association with aqueous fluids that exsolve from hydrous silicate melts during ascent and crystallization.  These fluids are invariably trapped as inclusions in vein-filling minerals associated with hydrothermal fluid flow, and their composition may be modeled based on the H2O-NaCl system.  Thus, if we know the pressure-volume-temperature-composition (PVTX) properties of H2O-NaCl solutions, it is possible to interpret the PTX trapping conditions, which is important for understanding the processes leading to the generation of the hydrothermal system and ore mineralization.<p> High salinity (> 26 wt. % NaCl) fluid inclusions contain liquid, vapor, and halite at room temperature, and are common in magmatic-hydrothermal ore deposits.  These inclusions homogenize in one of three ways: A) halite disappearance (Tmhalite) followed by liquid-vapor homogenization (ThL-V), B) simultaneous ThL-V and Tmhalite, or C) ThL-V followed by Tmhalite.  The PVTX properties of H2O-NaCl solutions three phase (L+V+H) and liquid-vapor (L+V) phase boundaries are well constrained, allowing researchers to interpret the minimum trapping pressure of inclusion types A and B.  However, data that describe the pressure at Tmhalite for inclusion type C are limited to a composition of 40 wt. % NaCl.  To resolve this problem, the synthetic fluid inclusion technique was used to determine the relationship between homogenization temperature and minimum trapping pressure for inclusions that homogenize by mode C.  These results allow researchers to interpret the minimum trapping pressure of these inclusions, and by extension the depth at which the inclusions formed.<p> The temporal and spatial distribution of fluid inclusions formed in associated with porphyry copper mineralization has been predicted using a computer model.  A simple geologic model of an epizonal intrusion was developed based on a Burnham-style model for porphyry systems and thermal models of the evolution of epizonal intrusions.  The phase stability fields and fluid inclusion characteristics at any location and time were predicted based on PVTX properties of H2O-NaCl solutions.  These results provide vectors towards the center of a magmatic-hydrothermal system that allow explorationists to use fluid inclusion petrography to predict position with the overall porphyry environment when other indicators of position are absent.<p>",
  "description_provenance": [
    "Author Email: spbecker@vt.edu",
    "Advisor Email: rjb@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: rtracy@vt.edu",
    "Advisor Email: stude1jj@cmich.edu",
    "Made available in DSpace on 2014-03-14T20:14:05Z (GMT). No. of bitstreams: 1 dissertation_final.pdf: 13753768 bytes, checksum: 472b51d07c4344fcbadaf4972c51751c (MD5)   Previous issue date: 2007-07-05"
  ],
  "handle": "28318",
  "identifier_other": "etd-07172007-131552",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07172007-131552/",
  "identifier_uri": "http://hdl.handle.net/10919/28318",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation_final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fluid inclusions",
    "ore deposits",
    "phase equilibria",
    "magmatic-hydrothermal",
    "experimental",
    "PVTX properties"
  ],
  "title": "Fluid Inclusion Characteristics in Magmatic-Hydrothermal Ore Deposits",
  "type": "Dissertation"
}