{
  "contributor_author": "Xu, Jintao",
  "contributor_committeechair": "Hyde, William F.",
  "contributor_committeemember": [
    "Sedjo, Roger",
    "McGuirk, Anya M.",
    "Sullivan, Jay",
    "Amacher, Gregory S."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:14:04Z",
  "date_adate": "1999-07-20",
  "date_available": "2014-03-14T20:14:04Z",
  "date_issued": "1999-07-07",
  "date_rdate": "2000-07-20",
  "date_sdate": "1999-07-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "China's Paper Industry: Growth and Environmental Policy  During Economic Reform  Jintao Xu  (ABSTRACT)  This dissertation examines the performance of China's pulp and paper industry under environmental regulations, and reflects on the implementation of the regulations, and especially on market-based instruments. The dissertation includes two empirical chapters: one uses a frontier production function model to examine the impact of China's environmental policy on paper mills' environmental as well as efficiency performance; the other derives shadow prices for pollutants for the same group of mills, based on a distance function model, to examine the efficiency performance of current pollution control policy and the degree of regional variation in the policy enforcement.  The basic conclusion from the first empirical chapter is that the economic instrument-pollution levy system-can be an effective tool in inducing polluting mills to abate their pollution, and there is no strong evidence that the instrument adversely affected the mills' efficiency performance.  The reason that the pollution problem is not lessening over time can be largely attributed to allocative inefficiency and regional disparity in policy enforcement, as is demonstrated by the second empirical chapter.  These results should point future policy in the direction of better enforcement and/or the trial of a tradable permit system.",
  "description_provenance": [
    "Author Email: jxu@vt.edu",
    "Advisor Email: mcguirk@vt.edu",
    "Advisor Email: jsulliv@vt.edu",
    "Advisor Email: gamacher@vt.edu",
    "Advisor Email: whyde@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:04Z (GMT). No. of bitstreams: 1 diss.pdf: 318482 bytes, checksum: 4b894d00e0965729d43fa034bbfe3246 (MD5)   Previous issue date: 1999-07-07"
  ],
  "handle": "28314",
  "identifier_other": "etd-071699-131820",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-071699-131820/",
  "identifier_uri": "http://hdl.handle.net/10919/28314",
  "publisher": "Virginia Tech",
  "relation_haspart": "diss.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "China",
    "Efficiency",
    "Pollution Levy",
    "Paper Industry",
    "Shadow Prices"
  ],
  "title": "China's Paper Industry: Growth and Environmental Policy during Economic Reform",
  "type": "Dissertation"
}