{
  "contributor_author": "Murphy, Kevin",
  "contributor_committeechair": "Olsen, Michael D.",
  "contributor_committeemember": [
    "West, Joseph",
    "Schmelzer, Claire D.",
    "Murrmann, Suzanne K.",
    "Williams, John A."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:14:05Z",
  "date_adate": "2006-11-06",
  "date_available": "2014-03-14T20:14:05Z",
  "date_issued": "2006-04-24",
  "date_rdate": "2006-11-06",
  "date_sdate": "2006-07-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The previous chapters described in detail the literature, theory and research on Co-alignment, RBV and SHRM that was the basis for the development of a construct for the conceptualization of HPWP in the casual theme restaurant sector of the US hospitality industry for management.  Firms able to implement such HPWP systems possessing universality, i.e. complementary internal fit, have been shown to increase the intangible value of their human capital (employees) and create greater economic value (Delery, 1998).  This study used the co-alignment principle in conjunction with concepts in SHRM and RBV to develop a theory for a HPWP system for casual theme restaurants in the US, which is named a High Performance People System (HPPS). The co-alignment model for hospitality organizations which is the foundation of the theoretical model for this research (Olsen, West, and Tse;1998) describes the relationship between four key constructs, i.e. the environment, strategy choice, firm structure, and firm performance. Briefly, the four constructs in the model must be in alignment with each other in order for the firm to produce the greatest value for its stakeholders. Co-alignment theory purports that, \"if the firm is able to identify the opportunities that exist in the forces driving change, invest in competitive methods that take advantage of these opportunities, and allocate resources to those that create the greatest value, the financial results desired by owners and investors have a much better chance of being achieved\" (Olsen et al. 1998, p.2).  SHRM researchers have been advocates of the theory that supports the causal relationship between HRM practices, sustainable competitive advantage (SCA) and firm performance. Several strategic human resource management researchers such as, Cappelli & Singh (1992),Wright & McMahan (1992), Pfeffer (1994), Lado & Wison (1995), Huselid (1995), Jackson & Schuler (1995),Becker & Gerhart (1996), Delany & Huselid (1996), Boxall (1998),  Pfeffer (1998), Schuler & Jackson (2000), Ulrich & Beatty (2001), Lepak & Snell (2002), Hartog (2004) and others have directly or indirectly made attempts to theorize the effects of single or multiple human resource management variables on firm performance. These efforts have led to the incremental development of the strategic human resource management literature that stresses the relationships between the HRM practices, SCA and firm performance. There is an emergent body of evidence demonstrating that \"the methods used by an organization to manage its human resources can have a substantial impact on many organizationally relevant outcomes\" (Delery, 1998, p. 1).  Convoluting the research on HPWP is incongruity among researchers on the micro HRM practices which are included in the SHRM system; there is little concurrence among scholars with respect to specifically which human resource practices should be incorporated (Becker & Gerhart, 1996; Rogers & Wright, 1998; Chadwick & Cappelli, 1999).  RBV is one of the ten schools of thought in the field of management theory (Mintzberg, 2000) and is predicated on the concept that in order to create a sustainable competitive advantage and produce value for the firm, individual policies or practices produce the greatest results when they operate in a complex system that is not easily imitated (Barney, 1995). Resources are the \"physical things a firm buys, leases or produces for its own use or the people hired on terms that make them effectively part of the firm\" (Penrose, 1959: 67). Wernerfelt (1984) defines a firm's resources as \"tangible or intangible assets which are tied semi-permanently to the firm\" (p. 172). Barney (1991) further suggested that resources which can be used to create a SCA must have value, rareness, inimitability and substitutability The research focused on the discovery of the components of a HPWP system construct in the US casual theme restaurant segment for operating managers and the performance metrics used to judge their effectiveness. An exploratory study, in part using the Delphi method, serves as the overall research approach. A cross section of restaurant industry experts including company executives, consultants, academics and investors/owners contributed to the study. The outcome is a list of HRM work practices that are common to the casual theme restaurant industry and performance metrics.  Based on prior empirical work the study started with 14 HRM work practice dimensions (See Table 3.1) and 3 performance measurements of productivity, turnover and financial performance (Huselid, 1995; Huselid & Becker, 1995; Delery & Doty, 1996; Becker & Huselid, 1996; Huselid & Becker, 1997; Hartog, 2004). These dimensions and performance metrics were presented to the panel of expert's making up the pilot study group as a starting point in the development of the HPWP system construct for the casual themed restaurant industry. After compiling the results of the pilot study and pretesting the survey instrument, the first Delphi survey (see Appendix 3) and a subsequent reminder were sent out electronically to the preselected Delphi participants for the study. A consensus on the research questions was not reached from the first-round survey according to the protocol Therefore, the second round was administered which provide opportunity for participants to change their position to help the group reach a consensus. Since consensus was reached according to the protocol (see tables 4.9, 4.12 & 4.13), the Delphi was concluded at this point. In summary, figure 1.1 put forth a conceptual model to clarify the relationships between the above mentioned schools of thought and firm performance. Figure 1.2 presented a working theoretical model which expounds on the relationships between the key concepts in the conceptual model and firm performance. Finally, figure 5.1 displays the results and the relationships of the study which methodically confirms the components of a HPPS for unit level managers, and identifies appropriate evaluation criteria for determining the performance of HPPS in the US casual restaurant market.",
  "description_provenance": [
    "Author Email: ksmurphy@mail.ucf.edu",
    "Made available in DSpace on 2014-03-14T20:14:05Z (GMT). No. of bitstreams: 2 ETDDissertation.pdf: 1370716 bytes, checksum: 293d108a60974030a1aab623b8fb327a (MD5) Tableofcontents.pdf: 82868 bytes, checksum: 771ec1220d0be3817849ff39768dd824 (MD5)   Previous issue date: 2006-04-24"
  ],
  "handle": "28317",
  "identifier_other": "etd-07172006-173102",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07172006-173102/",
  "identifier_uri": "http://hdl.handle.net/10919/28317",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ETDDissertation.pdf",
    "Tableofcontents.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Casual Restaurant",
    "Firm Performance",
    "Resource Based View",
    "Co-alignment model",
    "Work Practices",
    "Strategic Human Resource Management (SHRM)",
    "Sustainable Competitive Advantage"
  ],
  "title": "An Exploratory Study of Strategic Human Resource Management High Performance Work Practices for Unit Level Managers, in the Casual Segment of the Us Restaurant",
  "type": "Dissertation"
}