{
  "contributor_author": "Farquhar, MaryBeth Anne",
  "contributor_committeechair": "Rees, Joseph V.",
  "contributor_committeemember": [
    "Khademian, Anne Meredith",
    "Murray, William L.",
    "Phillips, Sally J.",
    "Wolf, James F.",
    "Hult, Karen M."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:14:04Z",
  "date_adate": "2008-08-06",
  "date_available": "2014-03-14T20:14:04Z",
  "date_issued": "2008-06-30",
  "date_rdate": "2008-08-06",
  "date_sdate": "2008-07-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The health care system within the United States is in a state of transition.  The industry, confronted with a variety of new technologies, new ways of organizing, spiraling costs, diminishing service quality and new actors, is changing, almost on a daily basis.  Reports issued by the Institute of Medicine raise quality issues such as avoidable errors and underuse/overuse of services; other studies document regional variation in care.  Improvement in the quality of care, according to health care experts is accomplished through measuring and comparing performance, but there are a number of disparate actors involved in this endeavor.  Through a network of both public and private actors, collaboration on the development of a set of national performance measures is underway.  Organizations such as the National Quality Forum (NQF), the Agency for Healthcare Research and Quality (AHRQ), the Centers for Medicare & Medicaid Services (CMS) and other have formed networks to develop and standardize performance measurement systems that can distinguish between quality services and substandard ones.  While there is some available research about the processes involved in performance measurement system design, there is little known about the factors that influence the development and work of the network, particularly the selection of hospital performance measures.  This dissertation explored the development of a national performance measurement system for hospitals, using an institutional rational choice perspective and actor-network theory as frameworks for discussion.  Through qualitative research methods such as direct observation, interviews, participant observations and document review, a theoretically informed case study of the NQFâ  s Hospital Steering Committee was performed, to address the following questions:  How is a national performance measurement system developed and what is the role of federal agencies (e.g., AHRQ and CMS) in the process?",
  "description_provenance": [
    "Author Email: mafarquh@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: akhademi@vt.edu",
    "Advisor Email: william.l.murray@dom.com",
    "Advisor Email: sally.phillips@ahrq.hhs.gov",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:04Z (GMT). No. of bitstreams: 2 Farquhar_Dissertation_80508.pdf: 2336289 bytes, checksum: 3106ddda51bddc294f33fd511abacdee (MD5) SED_Certificate.pdf: 339789 bytes, checksum: 2aa4317f78498ed0007716f93c16a331 (MD5)   Previous issue date: 2008-06-30"
  ],
  "handle": "28312",
  "identifier_other": "etd-07162008-221106",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07162008-221106/",
  "identifier_uri": "http://hdl.handle.net/10919/28312",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Farquhar_Dissertation_80508.pdf",
    "SED_Certificate.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "the National Quality Forum",
    "hospitals",
    "governance",
    "performance measurement",
    "public policy",
    "networks",
    "actor-network theory",
    "health care policy"
  ],
  "title": "Actor Networks in Health Care: Translating Values into Measures of Hospital Performance",
  "type": "Dissertation"
}