{
  "contributor_author": "Richardson-Calfee, Lisa E.",
  "contributor_committeechair": "Harris, James Roger",
  "contributor_committeemember": [
    "Appleton, Bonnie L.",
    "Parrish, David J.",
    "Jones, Robert H.",
    "Niemiera, Alexander X."
  ],
  "contributor_department": "Horticulture",
  "date_accessioned": "2014-03-14T20:14:04Z",
  "date_adate": "2003-08-06",
  "date_available": "2014-03-14T20:14:04Z",
  "date_issued": "2004-07-09",
  "date_rdate": "2005-08-06",
  "date_sdate": "2003-07-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A more thorough knowledge of rooting behavior of transplanted trees is needed to better understand plant establishment. The objectives of this research were to: 1) determine if transplant timing affected root system regeneration of northern red oak (Quercus rubra L.) and willow oak (Q. phellos L.), 2) determine the effect of transplant timing and nursery production system on root, shoot, and trunk growth periodicity of balled-and-burlapped (B&B) and pot-in-pot (PIP) sugar maple (Acer saccharum Marsh.), and 3) characterize seasonal patterns of root production and mortality of transplanted sugar maple. No new root growth occurred outside or within the root balls of red or willow oak between November transplanting and January excavation. However, new root growth was observed when November- and March-transplanted oaks were excavated in April, indicating that new root growth occurs primarily in late winter and/or early. Transplanted and non-transplanted sugar maples exhibited a pattern of maximum rates of shoot extension in early May, root length accumulation in late May, and trunk expansion in mid June. Rate of root length accumulation was less in summer and fall. Transplanting did not appear to disrupt the normal growth periodicity of sugar maple, except when transplanted in July. Abundant root length accumulation occurred in the July transplants at a time when root length accumulation had slowed in all other treatments, resulting in the July transplants having similar standing root lengths as the other transplants by fall. Standing root length of non-transplanted PIP sugar maple declined dramatically in spring. While root production in sugar maple was limited to the growing season, root mortality occurred at a steadier rate throughout the year. Most root mortality occurred in winter in transplanted trees and spring and summer in non-transplanted trees. Non-transplanted PIP trees had greater standing root length, production, and mortality than the other treatments. Indices of root activity (analogous to turnover rates) and production:mortality ratios illustrated the dominant role that root production plays relative to mortality in recently transplanted trees. These data indicate that transplanting and the PIP production system disrupt typical patterns of root production and mortality in sugar maple.",
  "description_provenance": [
    "Author Email: lirichar@vt.edu",
    "Advisor Email: bapple@vt.edu",
    "Advisor Email: parrish@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: rharris@vt.edu",
    "Advisor Email: niemiera@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:04Z (GMT). No. of bitstreams: 2 Dissertation.pdf: 4485576 bytes, checksum: 2b5ebc30f14b2dd23f5df6d015420e74 (MD5) Seminar.pdf: 8389919 bytes, checksum: 4031087fd8cc2acb14dc22451572fed9 (MD5)   Previous issue date: 2004-07-09"
  ],
  "handle": "28315",
  "identifier_other": "etd-07172003-110919",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07172003-110919/",
  "identifier_uri": "http://hdl.handle.net/10919/28315",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation.pdf",
    "Seminar.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "rhizotron",
    "regeneration",
    "sugar maple",
    "PIP",
    "pot-in-pot",
    "season"
  ],
  "title": "Post-Transplant Root Production, Mortality, and Periodicity of Landscape-Sized Shade Trees",
  "type": "Dissertation"
}