{
  "contributor_author": "Bass II, Roger Thompson",
  "contributor_committeechair": "Swecker, William S. Jr.",
  "contributor_committeemember": [
    "Stallings, Charles C.",
    "Thatcher, Craig D.",
    "Blodgett, Dennis J.",
    "Eversole, Dan E."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:14:04Z",
  "date_adate": "1999-07-24",
  "date_available": "2014-03-14T20:14:04Z",
  "date_issued": "1999-04-21",
  "date_rdate": "2000-07-24",
  "date_sdate": "1999-07-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The effects of vitamin E supplementation during late gestation were evaluated in dairy or beef cattle in three experiments.  Dairy cows were injected with vitamin E and selenium (Se) in one study; beef cows were offered oral vitamin E supplementation via a free-choice vitamin-mineral mix in two studies.  Breed-related effects were also evaluated.  Jerseys had higher blood Se and lower serum vitamin E concentrations than Holsteins at dry-off and higher blood Se concentrations than Holsteins 3-4 weeks pre-calving and at calving.  Selenium supplementation increased blood Se concentrations at calving.  Treatment did not affect serum vitamin E concentrations at calving or post-calving, nor blood Se concentrations post-calving.  Beef cattle consuming supplemental vitamin E (treatment) had greater responses to treatment when calving in late winter than when calving in late summer.  Treated multiparous cows calving in winter had increased serum and colostral vitamin E concentrations but treatment did not affect colostral or serum immunoglobulin G (IgG) concentrations of their calves.  Calves from treated, multiparous cows calving in winter had increased 205-day adjusted weaning weights (AWWs).  Treatment did not affect colostral vitamin E or IgG concentrations of nulliparous heifers calving in winter, nor serum vitamin E or IgG concentrations, or AWWs of their calves.  Six hundred IU supplemental vitamin E/head/day did not affect serum vitamin E concentrations of dams, colostral vitamin E or IgG concentrations, serum vitamin E or IgG concentrations, or growth of calves in the summer-calving herd.  Breed-related differences in vitamin E concentrations and AWW occurred in both herds.  Consumption of 600-1000 IU vitamin E/cow/day (treatment) during late gestation via a free-choice vitamin-mineral mix increased vitamin E concentrations in serum and the lipoprotein fraction containing no apolipoprotein B (non-ApoB) from 1-2 weeks pre-calving to calving.  Treatment group calves had higher vitamin E concentrations in serum and non-ApoB than control group calves.  Treatment did not affect cholesterol or phospholipid concentrations in serum or the lipoprotein fractions of either cows or calves.  Treatment increased vitamin E cholesterol (VEC) and vitamin E phospholipid (VEPL) ratios in the serum and non-ApoB of cows and calves.  Various breed-related differences also occurred.",
  "description_provenance": [
    "Author Email: rtbass@vt.edu",
    "Advisor Email: cvmwss@vt.edu",
    "Advisor Email: cstallin@vt.edu",
    "Advisor Email: cthatche@vt.edu",
    "Advisor Email: dblodg@vt.edu",
    "Advisor Email: deversol@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:04Z (GMT). No. of bitstreams: 1 Rtbetd2.pdf: 524040 bytes, checksum: 75646c2e3f0f6b9cac59023dbb39a80b (MD5)   Previous issue date: 1999-04-21"
  ],
  "handle": "28313",
  "identifier_other": "etd-071699-113207",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-071699-113207/",
  "identifier_uri": "http://hdl.handle.net/10919/28313",
  "publisher": "Virginia Tech",
  "relation_haspart": "Rtbetd2.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Lipoprotein",
    "Supplementation",
    "Vitamin E",
    "Cattle"
  ],
  "title": "Effects of Vitamin E Supplementation in Late Gestation Cattle and Evaluation of Vitamin E, Cholesterol, and Phospholipid Relationships in Bovine Serum and Serum Lipoproteins",
  "type": "Dissertation"
}