{
  "contributor_author": "Liu, Dan",
  "contributor_committeechair": "Case, Scott W.",
  "contributor_committeemember": [
    "Wilkes, Garth L.",
    "Lesko, John J.",
    "Ellis, Michael W.",
    "McGrath, James E."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:14:07Z",
  "date_adate": "2006-09-14",
  "date_available": "2014-03-14T20:14:07Z",
  "date_issued": "2006-07-11",
  "date_rdate": "2006-09-14",
  "date_sdate": "2006-07-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this dissertation, novel approaches to PEMFC durability research are summarized. These efforts are significantly different from most other studies on durability in that rather than focusing on chemical degradation, more attention is given to the mechanical aspects of the PEMFC system. The tensile stress-strain behavior of Nafion&reg; 117 (N117) and sulfonated poly(arylene ether sulfone) random copolymer (BPSH35) membranes is explored under ambient conditions, with respect to the effects of initial strain rate, counterion type, molecular weight and the presence of inorganic fillers. A three-dimensional \"bundle-cluster\" model is proposed to interpret the tensile observations, combining the concepts of elongated polymer aggregates, proton conduction channels as well as states of water. The rationale focuses on the polymer bundle rotation/interphase chain readjustment before yielding and polymer aggregates disentanglement/ reorientation after yielding.     <p>     In addition, the influence of uniaxial loading on proton conductivity of N117 and BPSH35 membranes is investigated. When the membranes are stretched, their proton conductivities in the straining direction increase compared to the unstretched films, and then relax exponentially with time. The behavior is explained on the basis of the morphological variations of hydrophilic channels, accompanied by the rotation, orientation and disentanglement of the copolymer chains in the hydrophobic domains, as illustrated with the help of our bundle-cluster model.      </p><p>    Finally, the long-term aging of hydrogen-air PEMFCs is examined with a cyclic current profile and under constant current conditions. The end-of-period diagnosis is performed for both MEAs at 100h aging intervals, including a series of cell polarization, impedance and electrochemical experiments. The results demonstrate that hydrogen crossover is the most significant result of degradation for the MEA under cyclic aging mode due to the formation of pinholes at approximately 500-600h, and mass transport limitations are the major degradation sources for constant current mode. A phenomenological mathematical model is set up to describe the PEMFC aging process under both cyclic and constant conditions. </p>",
  "description_provenance": [
    "Author Email: danl@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: jlesko@exchange.vt.edu",
    "Advisor Email: mwellis@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: scase@exchange.vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:07Z (GMT). No. of bitstreams: 1 DissertationDanLiuMACR1.pdf: 2460222 bytes, checksum: 25b181034f34f68e1b8ce71e62022caa (MD5)   Previous issue date: 2006-07-11"
  ],
  "handle": "28327",
  "identifier_other": "etd-07182006-090606",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07182006-090606/",
  "identifier_uri": "http://hdl.handle.net/10919/28327",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationDanLiuMACR1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Durability",
    "Mechanical Properties",
    "Proton Conductivity",
    "Aging",
    "Cyclic Profile",
    "Proton Exchange Membrane Fuel Cell"
  ],
  "title": "Durability study of proton exchange membrane fuel cells via experimental investigations and mathematical modeling",
  "type": "Dissertation"
}