{
  "contributor_author": "Behm, Stephanie Lee",
  "contributor_committeecochair": [
    "Wilkins, Jesse L. M.",
    "Lloyd, Gwendolyn M."
  ],
  "contributor_committeemember": [
    "Norton, Anderson H. III",
    "Bannister, Vanessa R. Pitts"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:14:07Z",
  "date_adate": "2008-09-09",
  "date_available": "2014-03-14T20:14:07Z",
  "date_issued": "2008-05-27",
  "date_rdate": "2008-09-09",
  "date_sdate": "2008-07-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Following the release of the Curriculum and Evaluation Standards for School Mathematics, (NCTM, 1989) substantial federal funding in the 1990s supported the development of curriculum materials intended to help teachers enact new visions of mathematics teaching and learning. Although a great deal of research about the â  Standards-basedâ   curriculum materials has focused on student achievement, an equally important body of research has investigated teachersâ   experiences with these materials. While this research about teacher-curriculum interactions continues to mature and offer insights into teachersâ   curriculum use, we face a critical shortage of information about preservice teachersâ   use of mathematics curriculum materials.   To address this gap, I conducted two separate but related qualitative studies focused on preservice teachersâ   interactions with mathematics curriculum materials. The first study examined a teacher education activity in which 23 preservice elementary teachers analyzed sections of different mathematics curriculum materials and textbooks. The second study focused on three student teachersâ   uses of mathematics curriculum materials and textbooks during their student-teaching internships. The overall purpose of these studies was to examine the views and experiences that appear to influence preservice teachersâ   initial interpretations of Standards-based curriculum materials and to document preservice teachersâ   experiences using Standards-based and other instructional resources during student teaching. I also aimed to explore how mathematics curriculum materials might be more carefully positioned to play a more critical role in preservice teacher learning throughout typical teacher education opportunities and also in teachersâ   future use and learning with Standards-based curriculum materials and other instructional resources.  Results of this manuscript dissertation indicated that preservice teachers found themselves immersed in professional development with mathematics curriculum materials, textbooks, and state curriculum guides during coursework and fieldwork experiences. They had the opportunity to develop an understanding of the variety of mathematics instructional resources available to them that were different from what they were used to, and also had opportunities to consider the unexpectedly complex nature of many of the materials. The preservice teachers found themselves negotiating balance between university coursework and fieldwork expectations as they evaluated, adapted and supplemented materials during coursework and fieldwork. The results from these chapters not only illustrate teacher learning with and about curriculum materials, but also point out opportunities within teacher education for preservice teachers to question well-established beliefs and practices regarding mathematics teaching and mathematics instructional resources as they encountered disequilibrium in multiple contexts. Overall results also highlight possible missed opportunities for learning and the importance of human resources within teacher education as it relates to preservice teachersâ   encounters with mathematics curriculum materials and instructional resources.",
  "description_provenance": [
    "Author Email: sbehm@vt.edu",
    "Advisor Email: norton3@vt.edu",
    "Advisor Email: vrpitts@vt.edu",
    "Advisor Email: wilkins@vt.edu",
    "Advisor Email: lloyd@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:07Z (GMT). No. of bitstreams: 2 Dissertation_SBehm_2008.pdf: 2525595 bytes, checksum: fcad2f3c09f84133cca3d748860983c9 (MD5) ATE_article_permission.pdf: 49821 bytes, checksum: 99658b76728c38cc6195539a86cd7f9b (MD5)   Previous issue date: 2008-05-27"
  ],
  "handle": "28328",
  "identifier_other": "etd-07182008-180734",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07182008-180734/",
  "identifier_uri": "http://hdl.handle.net/10919/28328",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation_SBehm_2008.pdf",
    "ATE_article_permission.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "student teaching",
    "elementary teachers",
    "mathematics education",
    "teacher education",
    "curriculum materials"
  ],
  "title": "Preservice Elementary Teachers' Learning with Mathematics Curriculum Materials During Preservice Teacher Education",
  "type": "Dissertation"
}