{
  "contributor_author": "Miller, Jean Anne",
  "contributor_committeechair": "Mayo, Deborah G.",
  "contributor_committeemember": [
    "Burian, Richard M.",
    "Fuhrman, Ellsworth R.",
    "Spanos, Aris"
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:14:07Z",
  "date_adate": "2011-08-19",
  "date_available": "2014-03-14T20:14:07Z",
  "date_issued": "2008-08-20",
  "date_rdate": "2011-08-19",
  "date_sdate": "2011-07-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The error statistical account provides a basic account of evidence and inference. Formally, the approach is a re-interpretation of standard frequentist (Fisherian, Neyman-Pearson) statistics. Informally, it gives an account of inductive inference based on arguing from error, an analog of frequentist statistics, which keeps the concept of error probabilities central to the evaluation of inferences and evidence. Error statistical work at present tends to remain distinct from other approaches of naturalism and social epistemology in philosophy of science and, more generally, Science and Technology Studies (STS). My goal is to employ the error statistical program in order to address a number of problems to approaches in philosophy of science, which fall under two broad headings: (1) naturalistic philosophy of science and (2) social epistemology. The naturalistic approaches that I am interested in looking at seek to provide us with an account of scientific and meta-scientific methodologies that will avoid extreme skepticism, relativism and subjectivity and claim to teach us something about scientific inferences and evidence produced by experiments (broadly construed). I argue that these accounts fail to identify a satisfactory program for achieving those goals and; moreover, to the extent that they succeed it is by latching on to the more general principles and arguments from error statistics. In sum, I will apply the basic ideas from error statistics and use them to examine (and improve upon) an area to which they have not yet been applied, namely in assessing and pushing forward these interdisciplinary pursuits involving naturalistic philosophies of science that appeal to cognitive science, psychology, the scientific record and a variety of social epistemologies.",
  "description_provenance": [
    "Author Email: jemille6@vt.edu",
    "Advisor Email: mayod@vt.edu",
    "Advisor Email: rmburian@vt.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Advisor Email: aris@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:07Z (GMT). No. of bitstreams: 1 Miller_JA_D_2008.pdf: 1333612 bytes, checksum: f02a61fbeb6e66a4ca182c7749ef6450 (MD5)   Previous issue date: 2008-08-20"
  ],
  "handle": "28329",
  "identifier_other": "etd-07182011-091205",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07182011-091205/",
  "identifier_uri": "http://hdl.handle.net/10919/28329",
  "publisher": "Virginia Tech",
  "relation_haspart": "Miller_JA_D_2008.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "epistemology",
    "error statistics",
    "Giere",
    "Hurlbert",
    "micro-sociology of science",
    "minimal a priorism",
    "meta-methods",
    "methods",
    "Mayo",
    "Kitcher",
    "Latour",
    "Longino",
    "Collins",
    "BACI (Before-After-Control-Intervention) experimen",
    "relativism",
    "reflexivity",
    "replication",
    "social epistemologies",
    "relativism",
    "pseudo-replication",
    "philosophy of statistics",
    "misspecification testing",
    "naturalism",
    "new experimentalism",
    "normative naturalism",
    "objectivity",
    "philosophy of experiment",
    "philosophy of science"
  ],
  "title": "Naturalism & Objectivity: Methods and Meta-methods",
  "type": "Dissertation"
}