{
  "contributor_author": "Miller, Raymond Russell",
  "contributor_committeechair": "Tu, Zhijian Jake",
  "contributor_committeemember": [
    "Sharakhov, Igor V.",
    "Zhang, Liqing",
    "Larson, Timothy J.",
    "Gillaspy, Glenda E."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:14:06Z",
  "date_adate": "2008-08-08",
  "date_available": "2014-03-14T20:14:06Z",
  "date_issued": "2008-07-09",
  "date_rdate": "2009-08-12",
  "date_sdate": "2008-07-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Many insects rely on olfaction as their primary method of interaction with their environment.  One of the best examples of this is the olfactory driven host-seeking behavior displayed by female mosquitoes.  Although mosquitoes are capable of extracting blood from a variety of hosts many mosquito species show marked preferences for particular host species.  Mosquitoes displaying preference for humans above bovines are more likely to be disease vectors.  Therefore understanding the molecular basis of this preference is important for public health.  These differences may be the result of genetic variations in olfactory signaling components such as mosquito odorant receptors.  This hypothesis is supported by several lines of evidence including the highly divergent and lineage-specific nature of this receptor family.  Likely these differences are subtle and will be identified in highly focused studies.  Even closely related sibling species of mosquitoes can display large behavioral differences.  In our current study I have studied several aspects of both Anopheles and Aedes genus odorant receptors with emphasis on comparing receptors in species that are part of the Anopheles genus.<p> \tThe first goal of this project was to study the insect odorant receptor family for potential sites of heterodimer formation.  Numerous studies have shown that insect odorant receptors are involved in detection of odorants.  More recent studies have demonstrated that odorant receptors are also involved in protein trafficking and in forming cation channels.  Both of these activities involve heterodimer formation between odorant receptors that bind odorants and those that are part of the Or83b subfamily.  There is little informaiton on how heterodimers are formed and where within the protein heterodimer sites exist.  The C-terminal region has been implicated as sites for such heterodimer formation.  A hidden markov model based program, Multiple em for motif elicitation (MEME), was used to uncover three motifs in the C-terminus of the odorant receptor peptides from Anopheles gambiae, D. melanogaster, and Apis mellifera.  Previous studies have shown that insect odorant receptors are highly divergent between different insect lineages suggesting conservation of these motifs is functionally important.  I propose that these motifs are involved in receptor-receptor protein interactions, contributing to the heterodimer formation between Or83b subfamily members and other odorant receptors. \tThe next goal was to identify odorant receptors in closely related mosquito species and compare and contrast them.  This was accomplished by using public sequence data of An. gambiae and BAC library screening to identify orthologous gene clusters in An. stephensi and An. quadriannulatus.  Although I have identified many different odorant receptor genes the chapter in this dissertation discusses my work with the Or2 gene cluster.  Multi-species comparison of these orthologous regions in An. gambiae, An. quadriannulatus, and An. stephensi revealed highly conserved gene structure among the OR genes and the discovery of the An. stephensi Or10x gene (AsOr10x), which is present only in An. stephensi.  AsOr10x showed a different expression pattern than AsOr2 and AsOr10, the other members of this gene subfamily in An. stephensi.  Therefore AsOr10x might be adapting or has adapted a new function.  Analysis of the phylogeny and physical location of all known members of the Or2/Or10 gene subfamily in Anopheles, Aedes, and Culex mosquitoes suggest that a few events of gene duplication and loss resulted in the current gene distribution.<p> \tThe final focus of this project was to develop a method to study the function of mosquito odorant receptors.  There is currently no in vivo system to study mosquito odorant receptors, and experimental systems pioneered in D. melanogaster are not transferable to mosquitoes.  I decided to employ a reverse genetics strategy involving the silencing of three Aedes aegypti odorant and gustatory receptors of known or suspected function.  These gustatory receptors are members of a small subfamily that encode olfactory and not taste receptors.  As a preliminary step the expression profiles of these three genes and an additional gustatory receptor were determined using non-quantitative and quantitative RT-PCR.  We found that the putative CO2-detecting gustatory receptors are expressed in Ae. aegypti larvae, and hence these larvae may respond to CO2, an observation that has not been reported previously. \t<p>The purpose of silencing these receptors is to generate a loss-of-function behavior phenotype that will allow for inference of receptor function.  Recombinant Sindbis viruses were used to knockdown mRNA levels of these receptors.  GFP-expressing recombinant Sindbis viruses were shown to infect chemosensory tissue.  Additional viruses containing fragments of receptor genes were found capable of lowering odorant and gustatory receptor mRNA levels.  Infected mosquitoes displayed varying levels of gene knockdown with one virus generating supression of mRNA levels to 15.0% of normal.  These mRNA levels may not be low enough to generate an unambiguous phenotype.  Future experimentation is focused on developing more effective recombinant viruses and identifying characteristics of viruses more effective in receptor gene knockdown.  A safe and effective behavior assay setup is needed to test the behavioral responses of these infected mosquitoes.  In this study I outline a preliminary behavior assay that is being developed and optimized.   When established it will provide a powerful tool in the study of both basic mosquito behavior and phenotype screening of recombinant Sindbis virus-infected mosquitoes.",
  "description_provenance": [
    "Author Email: ramiller@vt.edu",
    "Advisor Email: igor@vt.edu",
    "Advisor Email: lqzhang@vt.edu",
    "Advisor Email: tilarson@vt.edu",
    "Advisor Email: jaketu@vt.edu",
    "Advisor Email: gillaspy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:06Z (GMT). No. of bitstreams: 1 Theis-RaymondMiller.pdf: 25775371 bytes, checksum: 15d258049ab6974d03c92f36ad7490a5 (MD5)   Previous issue date: 2008-07-09"
  ],
  "handle": "28323",
  "identifier_other": "etd-07172008-151710",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07172008-151710/",
  "identifier_uri": "http://hdl.handle.net/10919/28323",
  "publisher": "Virginia Tech",
  "relation_haspart": "Theis-RaymondMiller.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mosquito",
    "odorant receptor",
    "chemosensory",
    "Anopheles",
    "Aedes",
    "Or83b",
    "olfaction"
  ],
  "title": "Mosquito Odorant Receptors:  C-terminal Motifs, Subfamily Expansion, and Function",
  "type": "Dissertation"
}