{
  "contributor_author": "Mohd Kamalludeen, Rosemaliza",
  "contributor_committeechair": "Price, William T. Jr.",
  "contributor_committeecochair": "Miyazaki, Yasuo",
  "contributor_committeemember": [
    "Stewart, Daisy L.",
    "Lichtenberger, Eric J."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:14:06Z",
  "date_adate": "2012-08-08",
  "date_available": "2014-03-14T20:14:06Z",
  "date_issued": "2012-07-06",
  "date_rdate": "2012-08-08",
  "date_sdate": "2012-07-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Dropping out of school is a major concern as high school graduation credentials have been used as an important measurement tool to define post-secondary success. Numerous researchers presented a multitude of factors that predict dropouts at individual and school levels. Curriculum track choice, or high school course-taking sequence, defines studentsâ   schooling career and ultimately the post-secondary path that they choose (Plank, DeLuca, & Estacion, 2008). Scholars have debated on various outcomes related to dropouts influenced by various curriculum choices, namely academic, career and technical education (CTE), dual enrollment, and general curriculum. Several argued students following academic tracks are more likely to graduate. Others claim that CTE benefits students who are at-risk and suppresses dropout likelihood (Rumberger & Sun, 2008). New vocationalism or dual enrollment has proven successful at reducing dropout rates.  This study attempted to investigate the influence of curriculum track and CTE program areas on dropout likelihood while controlling for possible individual differences. Analysis was conducted via Hierarchical Generalized Linear Modeling (HGLM) due to the nested data structure of Education Longitudinal Study of 2002 (ELS). Variables included were academic background, academic and career aspiration, school-sponsored activity participation, school minority composition, school average student socio-economic status (SES), school type (private or public), school urbanicity, CTE courses offered at the school, and demographic indicators (gender, race, and SES). Findings reflect higher dropout likelihood among general curriculum participants than academic and occupational concentrators after controlling for all possible individual differences. Dual concentrators had 0% dropout rate, and therefore comparison with other curriculum tracks was not possible via HGLM analysis. Results suggest substantial importance of academic background, post-secondary education plans, and school-sponsored activity participation in predicting dropout likelihood.  Comparing CTE program areas, Family and Consumer Sciences, Human Services, Public Services, Health and Education (Human Services area) participants were more likely to drop out than other program areas while Technology Education participants were less likely to drop out than Human Services and 2 or more CTE program area participants. Results suggest 9th grade overall GPA and school-sponsored activity participation as substantial predictors of dropout likelihood among occupational concentrators. Variability across schools was insignificant.",
  "description_provenance": [
    "Author Email: rosemaliza@vt.edu",
    "Advisor Email: wprice@vt.edu",
    "Advisor Email: yasuom@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: eric.lichtenberger@gmail.com",
    "Made available in DSpace on 2014-03-14T20:14:06Z (GMT). No. of bitstreams: 2 MohdKamalludeen_R_D_2012.pdf: 6711424 bytes, checksum: 74b71c65175325f433f09116a10fde5a (MD5) MohdKamalludeen_R_D_2012_IRB.pdf: 245279 bytes, checksum: 2066dac298b041dd23457ef98000a7c8 (MD5)   Previous issue date: 2012-07-06"
  ],
  "handle": "28324",
  "identifier_other": "etd-07172012-221045",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07172012-221045/",
  "identifier_uri": "http://hdl.handle.net/10919/28324",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "MohdKamalludeen_R_D_2012.pdf",
    "MohdKamalludeen_R_D_2012_IRB.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "high school",
    "curriculum track",
    "Dropout",
    "career and technical education",
    "hierarchical generalized linear modeling"
  ],
  "title": "Curriculum Track And Its Influences On Predicting High School Dropout Likelihood",
  "type": "Dissertation"
}