{
  "contributor_author": "Snead II, Cecil Clark",
  "contributor_committeecochair": [
    "Crockett, Jean B.",
    "Driscoll, Lisa G."
  ],
  "contributor_committeemember": [
    "Parks, David J.",
    "Salmon, Richard G.",
    "Flanagan, Barbara G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:14:07Z",
  "date_adate": "2005-08-11",
  "date_available": "2014-03-14T20:14:07Z",
  "date_issued": "2005-05-11",
  "date_rdate": "2005-08-11",
  "date_sdate": "2005-07-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "To continue to meet the benchmarks for success across all subgroup populations as defined by the No Child Left Behind Act (NCLB), educators need to look continuously upon the latest research regarding best educational practice.  Attention deficit hyperactivity disorder (ADHD) affects 3% - 7% of the school-age population.  NCLB mandates that educators demonstrate student success across all subgroups.  This includes children identified with ADHD who may be receiving services under the Individuals with Disabilities Education Act (IDEA) or Section 504 of the 1973 Rehabilitation Act.   Given these charges, this meta-analysis examined 18 studies to determine how three intervening variables such as behavior intervention, medication, and a combination of behavior intervention and medication, effected the functioning of students diagnosed with ADHD under the DSM III or DSM IV definition.  Effect sizes were calculated for each qualified, independent sample.  Effect sizes were calculated for combinations of the 9 outcome variables with each of the 3 interventions of behavior intervention, medication, or a combination of behavior intervention and medication.  The outcome variables were: (a) academics, (b) aggression, (c) attention, (d) externalizing behaviors, (e) hyperactivity/impulsivity, (f) inattention, (g) internalizing behaviors, (h) social skills, and (i) social problems.  Twenty-four effect sizes were calculated where data were available and homogeneity tests indicated.  Although sample homogeneity presented technical issues for some outcome and intervening variable combinations, effect size calculations were appropriate.  Behavior interventions had a range of effects on social skills (ES = .81), academics (ES = .22), and aggression (ES = .37) outcomes.  The combination of behavior interventions and medication had a range of effects on inattention (ES = 1.67) and social skills (ES = .90) outcomes.  The findings in this meta-analysis are intended to be used as a guide for educational discussions that link research to policy at the local educational agency level or that link research to individualized education programs at the student level.",
  "description_provenance": [
    "Author Email: Cecil.Snead@nrvunwired.net",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: bflanagan@pcva.us",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:07Z (GMT). No. of bitstreams: 1 SneadADHDDissertation.pdf: 614141 bytes, checksum: 1a6948991e5ac384a0671b84dbcabd20 (MD5)   Previous issue date: 2005-05-11"
  ],
  "handle": "28332",
  "identifier_other": "etd-07192005-182505",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07192005-182505/",
  "identifier_uri": "http://hdl.handle.net/10919/28332",
  "publisher": "Virginia Tech",
  "relation_haspart": "SneadADHDDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ADHD interventions",
    "ADHD"
  ],
  "title": "A Meta-Analysis of Attention Deficit/Hyperactivity Disorder Interventions: An Empirical Road to Pragmatic Solutions",
  "type": "Dissertation"
}