{
  "contributor_author": "Grissom, Dustin Leonard",
  "contributor_committeechair": "Devenport, William J.",
  "contributor_committeemember": [
    "Glegg, Stewart A. L.",
    "Johnson, Martin E.",
    "Burdisso, Ricardo A.",
    "Simpson, Roger L."
  ],
  "contributor_department": "Aerospace and Ocean Engineering",
  "date_accessioned": "2014-03-14T20:14:08Z",
  "date_adate": "2007-08-03",
  "date_available": "2014-03-14T20:14:08Z",
  "date_issued": "2007-07-10",
  "date_rdate": "2007-08-03",
  "date_sdate": "2007-07-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The far field acoustics generated by turbulent flow over rough surfaces has been experimentally investigated in an acoustically treated wall jet facility.  The facility allows direct measurement of the far field sound from small patches of surface roughness, without contamination from edge or other aerodynamic noise sources.  The facility is capable of generating turbulent boundary layer flows with momentum thickness Reynolds numbers between 450 and 1160.  The variation of surface conditions tested cover the range from hydrodynamically smooth surfaces through most of the transitional range, with h+ variations from 3 to 85.  Single microphone narrow band acoustic spectra, measured in the far field, show sound levels as much as 15 dB above the background from 0.186 m2 roughness patches.  The measurements revealed the spectral shape and level variations with flow velocity, boundary layer thickness, and roughness size; providing the first data set large enough to assess the affects of many aerodynamic properties on the acoustic spectra.  Increases in the size of grit type roughness produced significant increases in acoustic levels.  Patches of hydrodynamically smooth roughness generated measurable acoustic levels, confirming that acoustic scattering is at least one of the physical mechanisms responsible for roughness noise.  The shapes of the measured spectra show a strong dependence on the form of the surface roughness.  The acoustic spectra generated by periodic two-dimensional surfaces have a much narrower louder peak than that generated by three-dimensional grit type roughness.  Measurements also show the orientation of the two-dimensional surface significantly affects the acoustic levels and directivity. The variation of sound levels with flow velocity and roughness size suggests the acoustic field is significantly affected by changes in the near wall flow due to the presence of the roughness.  Current models of noise generated by rough surfaces predict the general trends seen in measurements for flows over grit and two-dimensional roughness in the range of 20<h+<50.  However, in cases with a low Reynolds number or large grit size, where the roughness is likely to significantly affect the hydrodynamic pressure field, the scattering models did not perform as well.",
  "description_provenance": [
    "Author Email: dgrissom@vt.edu",
    "Advisor Email: glegg@oe.fau.edu",
    "Advisor Email: martyj@vt.edu",
    "Advisor Email: rburdiss@vt.edu",
    "Advisor Email: simpson@aoe.vt.edu",
    "Advisor Email: devenport@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:08Z (GMT). No. of bitstreams: 1 GrissomFinalETDC.pdf: 3520069 bytes, checksum: b21a99ca294edaa0468395656dc28a87 (MD5)   Previous issue date: 2007-07-10"
  ],
  "handle": "28336",
  "identifier_other": "etd-07192007-123339",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07192007-123339/",
  "identifier_uri": "http://hdl.handle.net/10919/28336",
  "publisher": "Virginia Tech",
  "relation_haspart": "GrissomFinalETDC.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "turbulent flow noise",
    "wall jet",
    "rough wall boundary layer noise",
    "acoustic scattering"
  ],
  "title": "A Study of Sound Generated by a Turbulent Wall Jet Flow Over Rough Surfaces",
  "type": "Dissertation"
}