{
  "contributor_author": "Patcha, Animesh",
  "contributor_committeechair": "Park, Jung-Min Jerry",
  "contributor_committeemember": [
    "Hou, Yiwei Thomas",
    "DaSilva, Luiz A.",
    "Shukla, Sandeep K.",
    "North, Christopher L."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:14:07Z",
  "date_adate": "2006-10-04",
  "date_available": "2014-03-14T20:14:07Z",
  "date_issued": "2006-07-06",
  "date_rdate": "2009-10-04",
  "date_sdate": "2006-07-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "With the ever increasing deployment and usage of gigabit networks, traditional network anomaly detection based intrusion detection systems have not scaled accordingly. Most, if not all, systems deployed assume the availability of complete and clean data for the purpose of intrusion detection. We contend that this assumption is not valid. Factors like noise in the audit data, mobility of the nodes, and the large amount of data generated by the network make it difficult to build a normal traffic profile of the network for the purpose of anomaly detection.  From this perspective, the leitmotif of the research effort described in this dissertation is the design of a novel intrusion detection system that has the capability to detect intrusions with high accuracy even when complete audit data is not available. In this dissertation, we take a holistic approach to anomaly detection to address the threats posed by network based  denial-of-service attacks by proposing improvements in every step of the intrusion detection process. At the data collection phase, we have implemented an  adaptive sampling scheme that intelligently samples incoming network data to reduce the volume of traffic sampled, while maintaining the intrinsic characteristics of the network traffic. A Bloom filters based fast flow aggregation scheme is employed at the data pre-processing stage to further reduce the response time of the anomaly detection scheme. Lastly, this dissertation also proposes an expectation-maximization algorithm based anomaly detection scheme that uses the sampled audit data to detect intrusions in the incoming network traffic.",
  "description_provenance": [
    "Author Email: apatcha@vt.edu",
    "Advisor Email: thou@vt.edu",
    "Advisor Email: ldasilva@vt.edu",
    "Advisor Email: jungmin@vt.edu",
    "Advisor Email: shukla@vt.edu",
    "Advisor Email: north@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:07Z (GMT). No. of bitstreams: 1 animesh_final_dissertation.pdf: 642691 bytes, checksum: 9d3c01fd777c694c4cb792df4efcaeef (MD5)   Previous issue date: 2006-07-06"
  ],
  "handle": "28334",
  "identifier_other": "etd-07192006-152001",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07192006-152001/",
  "identifier_uri": "http://hdl.handle.net/10919/28334",
  "publisher": "Virginia Tech",
  "relation_haspart": "animesh_final_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "high speed networks",
    "Anomaly detection",
    "weighted sampling",
    "denial-of-service",
    "expectation-maximization"
  ],
  "title": "Network Anomaly Detection with Incomplete Audit Data",
  "type": "Dissertation"
}