{
  "contributor_author": "Anderson, Marilyn Joan Whinnerah",
  "contributor_committeecochair": [
    "Belli, Gabriella M.",
    "Madison-Colmore, Octavia D."
  ],
  "contributor_committeemember": [
    "Stith, Sandra M.",
    "Paritzky, Richard S.",
    "Hoffman, Libby R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:14:08Z",
  "date_adate": "2000-07-25",
  "date_available": "2014-03-14T20:14:08Z",
  "date_issued": "2000-06-01",
  "date_rdate": "2001-07-25",
  "date_sdate": "2000-07-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A descriptive case study examined the gender differences concerning computer technology (IT) by a convenience sample (N = 180, 76%) of 11 th and 12 th graders at an elite public high school, recently named the \"second best high school in America\" (Newsweek, 2000), in suburban Northern Virginia. The purpose of the study was to examine the apparent discrepancy in male and female differences in computer use, interests, and attitudes. <p> The research design included a student questionnaire combining the Computer Attitude Rating Scale (CARS, Heinssen, Glass, & Knight, 1987) and the Attitudes toward Computer Technology (ACT, Delcourt & Kinzie, 1993) with demographic and academic data (GPA, PSAT, and SAT I), and the Strong Interest Inventory (Strong, 1994). Chi-square tests of association for categorical data and t tests for independence of means for metric data were used to analyze the data, which resulted in several statistically significant relationships (p = < .05) and meaningful effect sizes (> .70). <p> The results were higher mean scores for the Strong Realistic General Occupational Theme (males) and Artistic Theme (females); the Athletic and Mechanical Basic Interest Scales (males) and Music/Drama, Art, Culinary Arts, and Social Service Scales (females), and Risk-Taking Personal Style Scales (males) and Working Style with People (females). Females also had higher GPAs, levels of computer anxiety, resistance to technology, and avoidance of careers and study in computer fields. Females chose Pre-Medicine majors to help others and males chose Computer Science majors to gain financial rewards. <p> The implications for practice and research included: female technology internships, 9th grade mechanical and technical training, computer anxiety group counseling, cooperative learning and hands on instruction, female-friendly computer and computer science classes, equal access to computers at all grade levels, student-parent information programs concerning the many opportunities and high paying jobs available in computer technology, female orientated computer games, and more non-linear computer programs and activities that encourage females to \"have fun\" with computers and not view them as machines.  A longitudinal study of the current sample and research at other grade levels and locations were recommended.",
  "description_provenance": [
    "Author Email: mjand12@hotmail.com",
    "Advisor Email: sstith@vt.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: omadison@vt.edu",
    "Advisor Email: @vt.edu",
    "Advisor Email: lhoffman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:08Z (GMT). No. of bitstreams: 5 references.pdf: 82615 bytes, checksum: 8f93f93b3871133dd902487eecbd1153 (MD5) MJWAfront.pdf: 25432 bytes, checksum: 56233b04bb85b746ef1df69b49fc215f (MD5) abstract.pdf: 5995 bytes, checksum: 59c2d7f4fd58cc350a487ad652f2840f (MD5) MJWAbody.pdf: 363479 bytes, checksum: e90b8c07d3a3c5f315bac019d18f33df (MD5) MJWAback.pdf: 338482 bytes, checksum: deb1754053607667bd096aff97f187cc (MD5)   Previous issue date: 2000-06-01"
  ],
  "handle": "28338",
  "identifier_other": "etd-07202000-17500018",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07202000-17500018/",
  "identifier_uri": "http://hdl.handle.net/10919/28338",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "references.pdf",
    "MJWAfront.pdf",
    "abstract.pdf",
    "MJWAbody.pdf",
    "MJWAback.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Counseling",
    "Gender",
    "Strong Interest Inventory",
    "International Baccalaureate",
    "Computer Anxiety"
  ],
  "title": "Gender Differences in Computer Attitudes, Interests, and Usage in an Elite High School",
  "type": "Dissertation"
}