{
  "contributor_author": "Lehr, Jane L",
  "contributor_committeecochair": [
    "Boler, Megan M.",
    "Halfon, Saul E."
  ],
  "contributor_committeemember": [
    "Fowler, Shelli B.",
    "Downey, Gary L."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:14:07Z",
  "date_adate": "2007-02-06",
  "date_available": "2014-03-14T20:14:07Z",
  "date_issued": "2006-07-05",
  "date_rdate": "2007-02-06",
  "date_sdate": "2006-07-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation contributes to efforts to rethink the meanings of democracy, scientific literacy, and non-scientist citizenship in the United States. Beginning with questions that emerged from action research and exploring the socio-political forces that shape education practices, it shows why non-science educators who teach for social justice must first recognize formal science education as a primary site of training for (future) non-scientist citizens and then prepare to intervene in the dominant model of scientifically literate citizenship offered by formal science education. This model of citizenship defines (and limits) appropriate behavior for non-scientist citizens as acquiescing to the authority of science and the state by actively demarcating science from non-science, experts from non-experts, and the rational from the irrational. To question scientific authority is to be scientifically illiterate. This vision of 'acquiescent democracy' seeks to end challenges to the authority of science and the state by ensuring that scientific knowledge is privileged in all personal and public decision-making practices, producing a situation in which it becomes natural for non-scientist citizens to enroll scientific knowledge to naturalize oppression within our schools and society. It suggests that feminist and equity-oriented science educators, by themselves, are unable or unwilling to challenge certain assumptions in the dominant model of scientifically literate citizenship. Therefore, it is the responsibility of non-science educators who teach for social justice to articulate oppositional models of non-scientist citizenship and democracy in their classrooms and to challenge the naturalized authority of scientific knowledge in all aspects of our lives. It demonstrates how research in the field of Science & Technology Studies can serve as one resource in our efforts to intervene in the dominant model of scientifically literate citizenship and to support a model of democracy that encourages the critical engagement of and opposition to scientific knowledge and the state.",
  "description_provenance": [
    "Author Email: jlehr@vt.edu",
    "Advisor Email: mboler@oise.utoronto.ca",
    "Advisor Email: shalfon@vt.edu",
    "Advisor Email: sbfowler@vt.edu",
    "Advisor Email: downeyg@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:07Z (GMT). No. of bitstreams: 2 Lehr_PhD-final2006.pdf: 3777540 bytes, checksum: 542a5c50814589cf764f971f9821b0b8 (MD5) Lehr_PhD-final2006.2.pdf: 226431 bytes, checksum: a92b2560dabab8e90f87eabe77f9b752 (MD5)   Previous issue date: 2006-07-05"
  ],
  "handle": "28335",
  "identifier_other": "etd-07192006-200408",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07192006-200408/",
  "identifier_uri": "http://hdl.handle.net/10919/28335",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Lehr_PhD-final2006.pdf",
    "Lehr_PhD-final2006.2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "acquiescent democracy",
    "social justice",
    "education",
    "citizenship",
    "scientific literacy"
  ],
  "title": "Social Justice Pedagogies and Scientific Knowledge: Remaking Citizenship in the Non-Science Classroom",
  "type": "Dissertation"
}