{
  "contributor_author": "Navarro, Fernando",
  "contributor_committeechair": "Roman, Maren",
  "contributor_committeemember": [
    "Esker, Alan R.",
    "Davis, Richey M.",
    "Renneckar, Scott H.",
    "Rojas, Orlando J."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:14:08Z",
  "date_adate": "2010-08-19",
  "date_available": "2014-03-14T20:14:08Z",
  "date_issued": "2010-06-29",
  "date_rdate": "2013-08-22",
  "date_sdate": "2010-07-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Inkjet printing has generated considerable interest as a technique for the patterning of functional materials in the liquid phase onto a substrate. Despite its high promise, the phenomena associated with inkjet printing remain incompletely understood. This research project investigates inkjet printing of cellulose nanocrystals (CNCs) as a possible method for the fabrication of cellulose micropatterns. CNCs were prepared from wood pulp by H2SO4 hydrolysis and characterized in terms of length, width, and thickness distributions by atomic force microscopy (AFM) and dynamic light scattering. Aqueous CNC suspensions were characterized in terms of shear viscosity with a rheometer. Glass substrates were cleaned with a detergent solution, aqua regia, or a solvent mixture, and characterized in terms of surface chemical composition, surface free energy, polarity, roughness, ï º-potential, and surface charge distribution in air by X-ray photoelectron spectroscopy, contact angle measurements, AFM, streaming potential, and scanning Kelvin probe microscopy (SKPM). Additionally, poly(ethylene glycol)-grafted glass substrates were prepared and characterized in terms of surface free energy, polarity, and roughness. Aqueous CNC suspensions were printed in different patterns onto the different glass substrates with a commercial, piezoelectric drop-on-demand inkjet printer. Inkjet deposited droplet residues and micropatterns were analyzed by AFM, scanning electron microscopy, and polarized-light microscopy. At low CNC concentrations (0.05 wt %), inkjet-deposited droplets formed ring-like residues due to the â  coffee drop effectâ  . The â  coffee drop effectâ   could be suppressed by the use of higher CNC concentrations. The resulting dot-like droplet residues exhibited Maltese cross interference patterns between crossed polarizers, indicating a radial orientation of the birefringent, elongated CNCs in these residues. The observed Maltese cross interference patterns represent unprecedented indirect evidence for a center-to-edge radial flow in drying droplets. The degree of definition of the micropatterns depended strongly on the surface properties of the glass substrates. Well-defined micropatterns were obtained on aqua   regia-cleaned substrates. In addition to the surface free energy and polarity, other factors seemed to play a role in the formation of the inkjet-printed micropatterns. If these factors can be identified and controlled, inkjet deposition of CNCs could become an attractive method for the fabrication of cellulose micropatterns.",
  "description_provenance": [
    "Author Email: fernav72@vt.edu",
    "Advisor Email: mgrunert@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: srenneck@vt.edu",
    "Advisor Email: ojrojas@ncsu.edu",
    "Made available in DSpace on 2014-03-14T20:14:08Z (GMT). No. of bitstreams: 2 Navarro_F_D_2010.pdf: 19998935 bytes, checksum: c9fc129fec8182abf5aed77813284b5d (MD5) Navarro_F_2010_Copyright.pdf: 2026277 bytes, checksum: d89626eabcd2454d06326810745456d7 (MD5)   Previous issue date: 2010-06-29"
  ],
  "handle": "28337",
  "identifier_other": "etd-07192010-130550",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07192010-130550/",
  "identifier_uri": "http://hdl.handle.net/10919/28337",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Navarro_F_D_2010.pdf",
    "Navarro_F_2010_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Micropatterning",
    "Streaming potential",
    "XPS",
    "Size distribution",
    "AFM",
    "Cellulose nanocrystals",
    "Inkjet printing",
    "Particle alignment"
  ],
  "title": "Cellulose Nanocrystals:  Size Characterization and Controlled Deposition by Inkjet Printing",
  "type": "Dissertation"
}