{
  "contributor_author": "Ballard, Tameshia Shaunt'a",
  "contributor_committeechair": "Mallikarjunan, Parameswarakumar",
  "contributor_committeecochair": "O'Keefe, Sean F.",
  "contributor_committeemember": [
    "Thatcher, Craig",
    "Zhang, Chenming Mike"
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2014-03-14T20:14:10Z",
  "date_adate": "2008-07-29",
  "date_available": "2014-03-14T20:14:10Z",
  "date_issued": "2008-07-08",
  "date_rdate": "2009-07-29",
  "date_sdate": "2008-07-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Peanut skins are a low-value byproduct of peanut blanching operations.  They have been shown to contain significant levels of phenolic compounds with demonstrated antioxidant properties.  The effects of two types of extraction methods: solid-liquid extraction (SLE) and microwave-assisted extraction (MAE) on the recovery of phenolic compounds from peanut skins were investigated.  Response surface methodology was used to optimize extraction conditions based on total phenolic content (TPC), ORAC (oxygen radical absorbance capacity) activity and resveratrol content.  The protective effect of peanut skin extracts (PSE) against hydrogen peroxide (H2O2)-induced oxidative stress in human brain microvascular endothelial cells (HBMEC) and the effect of PSE on lipid oxidation in commercial peanut butter were also evaluated. <p> In the SLE method, EtOH was found to be the most efficient extraction solvent followed by MeOH, water and EA.  Despite EtOH extracts having a higher TPC, samples extracted with MeOH demonstrated slightly higher ORAC activity.  Resveratrol was identified in MeOH extracts but was not found in EtOH, water or EA extracts.   <p>  In the MAE procedure, the maximum predicted TPC under the optimized conditions was 144 mg phenols/g skins compared to 118 mg/g with SLE.  The maximum predicted ORAC activity was 2789 umol TE/g as opposed to 2149 umol TE/g with the SLE method.  MAE was able to extract more phenolic compounds (with higher antioxidant activity) in a faster time than the SLE procedure.  In addition, resveratrol was identified in PSE derived from MAE although at relatively low levels. <p>  PSE were found to have some protective effects against oxidative stress in HBMEC.  Higher doses of PSE appeared to have a slightly cytotoxic effect.  However, the data were highly variable which made it difficult to arrive at any definitive conclusions regarding the potential benefits of PSE in preventing oxidative damage to cells.   In the PB experiment, hexanal levels over the storage period were not high enough for the samples to be considered oxidized.  However, hexanal values of PB samples treated with PSE were lower than the control throughout storage, which suggests that PSE may provide some protection against oxidation of PB.",
  "description_provenance": [
    "Author Email: tballard@vt.edu",
    "Advisor Email: craig.thatcher@asu.edu",
    "Advisor Email: chzhang2@vt.edu",
    "Advisor Email: okeefes@vt.edu",
    "Advisor Email: kumar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:10Z (GMT). No. of bitstreams: 1 Ballard_Dissertation-2_Final.pdf: 1416728 bytes, checksum: 2c0732265993e58d80d5863ea599dfca (MD5)   Previous issue date: 2008-07-08"
  ],
  "handle": "28349",
  "identifier_other": "etd-07212008-161854",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07212008-161854/",
  "identifier_uri": "http://hdl.handle.net/10919/28349",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ballard_Dissertation-2_Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "microwave-assisted extraction",
    "response surface methodology",
    "peanut skins",
    "antioxidants",
    "polyphenols",
    "resveratrol",
    "solid-liquid extraction",
    "human brain microvascular endothelial cells",
    "peanut butter"
  ],
  "title": "Optimizing the Extraction of Phenolic Antioxidant Compounds from Peanut Skins",
  "type": "Dissertation"
}