{
  "contributor_author": "Cavuoto, Lora Anne",
  "contributor_committeechair": "Nussbaum, Maury A.",
  "contributor_committeemember": [
    "Lockhart, Thurmon E.",
    "Agnew, Michael J.",
    "Madigan, Michael L."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:14:09Z",
  "date_adate": "2012-08-13",
  "date_available": "2014-03-14T20:14:09Z",
  "date_issued": "2012-07-20",
  "date_rdate": "2012-08-13",
  "date_sdate": "2012-07-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Work-related musculoskeletal disorders (WMSDs), particularly overexertion injuries, represent a significant economic burden and involve substantial adverse personal outcomes.  Two important contemporary changes in workforce demographics may be associated with an increase in the future incidence and cost of WMSDs.  First, more than two-thirds of the US adult population is now either overweight or obese, a doubling of the prevalence of obesity over the past 30 years.  Second, there has been a shift toward an older worker population, whose injuries often require more time away from work.  Obesity and aging can modify job demands and affect worker capacity in terms of muscular and psychomotor function.  However, there is a lack of empirical studies quantifying the work-relevant (or ergonomic) impacts related to task demands, capacities, and their potential imbalance.  This research assessed obesity- and age-related differences in physical capacity by measuring localized muscle fatigue, endurance, and the effects of fatigue on psychomotor function.  Three experiments were completed, progressing from controlled static to more complex intermittent and functional tasks.  The work also examined whether obesity and age effects are modified by workplace/workstation configuration, specifically the extent to which body segment masses need to be supported.  With obesity, strength was higher, but endurance time was lower, particularly for the more complex tasks.  Interaction effects between obesity and age were seen in only a few measures across the studies and did not indicate a consistent effect.  Outcomes of this research can facilitate the development of more effective (i.e., inclusive) guidelines to control WMSD risk and contribute to both proactive and reactive interventions to reduce excessive exposures to physical risk factors.  Overall, the research goal is to help ensure that ergonomic guidelines and practice are appropriate (or are adapted) to accommodate the diverse and changing workforce.",
  "description_provenance": [
    "Author Email: lcavuoto@vt.edu",
    "Advisor Email: lockhart@vt.edu",
    "Advisor Email: mjagnew@vt.edu",
    "Advisor Email: nussbaum@vt.edu",
    "Advisor Email: mimadiga@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:09Z (GMT). No. of bitstreams: 1 Cavuoto_LA_D_2012_v2.pdf: 1104495 bytes, checksum: aa3133c906a1e6ee6618865000ac2254 (MD5)   Previous issue date: 2012-07-20"
  ],
  "handle": "28345",
  "identifier_other": "etd-07202012-142914",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07202012-142914/",
  "identifier_uri": "http://hdl.handle.net/10919/28345",
  "publisher": "Virginia Tech",
  "relation_haspart": "Cavuoto_LA_D_2012_v2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "functional performance",
    "fatigue",
    "endurance",
    "aging"
  ],
  "title": "Evaluating obesity-related differences in upper extremity and trunk muscular capacity",
  "type": "Dissertation"
}