{
  "contributor_author": "Chowdhury, Jaideep",
  "contributor_committeecochair": [
    "Kumar, Raman",
    "Shome, Dilip K."
  ],
  "contributor_committeemember": [
    "Keown, Arthur J.",
    "Ince, Ozgur S."
  ],
  "contributor_department": "Business (Finance)",
  "date_accessioned": "2014-03-14T20:14:09Z",
  "date_adate": "2011-07-28",
  "date_available": "2014-03-14T20:14:09Z",
  "date_issued": "2011-07-12",
  "date_rdate": "2012-07-28",
  "date_sdate": "2011-07-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Most studies of the investment-cash flow sensitivity hypothesis in the literature compare estimates of the sensitivity coefficients from cross sectional regressions across groups of firms classified into more or less financially constrained groups based on some measure of perceived financial constraint. These studies report conflicting results depending on the classification scheme used to stratify the sample. They have been criticized on conceptual and methodological grounds. In this study we mitigate some of these problems reported in the literature by using the insights from Cleary, Povel and Raith (2007) in a new research design. We test for the significances of the changes in the investment-cash flow sensitivity, in a time-series rather than cross sectional framework, for the same set of firms surrounding an exogenous shock to the firmsâ   information asymmetry. The CPR (2007) model predicts an unambiguous increase (decrease) in investment-cash flow sensitivity when information asymmetry of the firm increases (decreases). Further, by examining the differences in the sensitivity coefficients we expect some of the biases in the coefficient from measurement errors in Q to cancel out. The two events we study are (i) the implementation of SOX which is expected to decrease information asymmetry from improved and increased disclosure and (ii) the deregulation of industries which is expected to increase information asymmetry largely from the lifting of price controls and entry barriers. We report that information asymmetry decreases following SOX and that there is a commensurate decrease in the investment-cash flow sensitivity, pre- to post SOX. The hypothesis that a greater change in investment cash flow sensitivity is associated with a greater change in information asymmetry is only weakly supported by the data. We also report that information asymmetry increases following deregulation with a commensurate increase in investment cash flow sensitivity, pre to post deregulation. The hypothesis of a greater increase in the sensitivity for subsamples with a greater increase in information asymmetry is not supported by the data. Overall, however, the study supports the investment-cash flow sensitivity hypothesis using a research design that corrects for some of the problems identified in the existing literature on the hypothesis.",
  "description_provenance": [
    "Author Email: jaideepc@vt.edu",
    "Advisor Email: rkumar@vt.edu",
    "Advisor Email: dilip@vt.edu",
    "Advisor Email: emily@vt.edu",
    "Advisor Email: oince@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:09Z (GMT). No. of bitstreams: 1 Chowdhury_Jaideep_D_2011.pdf: 1142703 bytes, checksum: 93951a55ff044af1bb4ec32d16d851cd (MD5)   Previous issue date: 2011-07-12"
  ],
  "handle": "28344",
  "identifier_other": "etd-07202011-115332",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07202011-115332/",
  "identifier_uri": "http://hdl.handle.net/10919/28344",
  "publisher": "Virginia Tech",
  "relation_haspart": "Chowdhury_Jaideep_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Information Asymmetry",
    "Investment Cash Flow Sensitivity"
  ],
  "title": "Investment-Cash Flow Sensitivity Under Changing Information Asymmetry",
  "type": "Dissertation"
}