{
  "contributor_author": "Kim, Sook-Hyun",
  "contributor_committeechair": "Kincade, Doris H.",
  "contributor_committeemember": [
    "Gaskill, LuAnn R.",
    "Singh, Kusum",
    "Klein, Noreen M.",
    "Keith, Janet E."
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2014-03-14T20:14:09Z",
  "date_adate": "2003-07-31",
  "date_available": "2014-03-14T20:14:09Z",
  "date_issued": "2003-07-21",
  "date_rdate": "2005-07-31",
  "date_sdate": "2003-07-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A new retail institution type has emerged in South Korea that is unique in comparison to any previous retail institution type. The study of this emergence and its growth has implications for the future structure of retail both in South Korea and in other parts of the world. To proceed with a study of this new retail institution type, appropriate theory base and research findings about past retailing in South Korea were needed; however, a search of literature indicated that South Korean retailing has been the subject of limited and mostly fragmented research. Historically, many researchers have endeavored to study retail evolution in Western countries. Although extensively studied, used in conceptual work, and applied as foundation in empirical work, some limitations exist with previous retail evolution theories: inability to cover all types of retail institutions, lack of geographic universality, and limited quantification. In conjunction with these limitations, the historic evolution and current structures of retail institution types in South Korea, on the surface, appear to be very different from the evolution and structure of retailing in the Western hemisphere. Several reasons for this difference appear to involve the unique features of South Korea and its culture: retailing types were imported to South Korea within a very compressed time period, unique geography includes small land size and high population concentration in South Korea, the government control and the political insulation of South Korea are different from Western cultures. \t\tThe purpose of this study was to examine the evolution of retail institution types in South Korea with a proposed model. To examine the evolution of retail institution types in South Korea and to develop a more universal research model to explain this evolution, a qualitative research design was used. Specifically, a modified grounded theory type of design, with a historical/ comparative analysis method, was used in this study. First, the grounded theory process was used to develop a graphical representation or model using information from previous research. Second, the researcher collected publicly available data in South Korea from government offices, trade and industry associations, public libraries, and websites on the Internet. Through comparative analysis, data from the South Korean retail industry were examined and compared to the working model.  According to the data analysis, the CREM was partially supported. Regarding the spiral evolution, all types of indicators (e.g., sales, profit, market share, operating cost) did not continuously increase as retail institutions mature, which was in contrast to the CREM, but fluctuated whenever environmental influences interrupted the growth. Four spiral endings were found: (1) upgrade, (2) stay and eventually go out of business, (3) downgrade, and (4) change types of retail institution. In the conflict part, a new retail institution type started competing with its own type, other traditional retail institution types, and a new retail institution type; therefore, the conflict portion in the CREM was also supported. Environmental influences affected not only the emergence of a new retail institution type but also the conflict among retail institution types and the evolution process. In addition, a new reciprocal relationship was found between environmental influences and a new retail institution type and between consumer preference of store/product attributes and a new retail institution type. The environmental influence part was therefore partially supported. The consumer influence variables in the CREM were also supported.   For future research, the final CREM could be the base of research in many types of retail institution and in any countries that have unique retail environments. Using the CREM from this study of retail evolution in South Korea, current and future retail institutions could predict both consumers' changes depending on environmental influences and what competitive advantages they must achieve to provide benefits to these consumers. In addition, researchers, both academic and retail, could use the final CREM to study the emergence and characteristics of a new retail institution type by analyzing current retail institution types",
  "description_provenance": [
    "Author Email: sokim3@vt.edu",
    "Advisor Email: lagaskil@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: nklein@vt.edu",
    "Advisor Email: jkeith@vt.edu",
    "Advisor Email: kincade@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:09Z (GMT). No. of bitstreams: 4 cover.table.abstract.pdf: 135533 bytes, checksum: 7d758aade6a3e8a90b10dab80eedfd2e (MD5) Reference.Vita.pdf: 235911 bytes, checksum: 45e46b2cd5a86f5d22cf2873f72eba61 (MD5) ChapterIV.V.VI.pdf: 1089287 bytes, checksum: d000f3dd9d73971a3add6421f7fc557e (MD5) ChapterI.II.III.pdf: 392841 bytes, checksum: 9d7522dea05ce54ff78d571ec435f83e (MD5)   Previous issue date: 2003-07-21"
  ],
  "handle": "28347",
  "identifier_other": "etd-07212003-153024",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07212003-153024/",
  "identifier_uri": "http://hdl.handle.net/10919/28347",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "cover.table.abstract.pdf",
    "Reference.Vita.pdf",
    "ChapterIV.V.VI.pdf",
    "ChapterI.II.III.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Retail Evolution",
    "Discount Stores",
    "Department Stores",
    "South Korea"
  ],
  "title": "The Model for the Evolution of Retail Institution Types in South Korea",
  "type": "Dissertation"
}