{
  "contributor_author": "Allevato, Anthony James",
  "contributor_committeechair": "Edwards, Stephen H.",
  "contributor_committeemember": [
    "Tatar, Deborah Gail",
    "Ramakrishnan, Naren",
    "Pérez-Quiñones, Manuel A.",
    "Evia, Carlos"
  ],
  "contributor_department": "Computer Science and Applications",
  "date_accessioned": "2014-03-14T20:14:10Z",
  "date_adate": "2012-08-13",
  "date_available": "2014-03-14T20:14:10Z",
  "date_issued": "2012-07-16",
  "date_rdate": "2012-08-13",
  "date_sdate": "2012-07-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Educators in many disciplines are too often forced to rely on intuition about how students learn and the effectiveness of teaching to guide changes and improvements to their curric- ula. In computer science, systems that perform automated collection and assessment of programming assignments are seeing increased adoption, and these systems generate a great deal of meaningful intermediate data and statistics during the grading process. Continuous collection of these data and long-term retention of collected data present educators with a new resource to assess both learning (how well students understand a topic or how they behave on assignments) and teaching (how effective a response, intervention, or assessment instrument was in evaluating knowledge or changing behavior), by basing their decisions on evidence rather than intuition. It is only possible to achieve these goals, however, if such data are easily accessible. </p><p> I present an infrastructure that has been added to one such automated grading system, Web-CAT, in order to facilitate routine data collection and access while requiring very little added effort by instructors. Using this infrastructure, I present three case studies that serve as representative examples of educational questions that can be explored thoroughly using pre-existing data from required student work. The first case study examines student time management habits and finds that students perform better when they start earlier but that offering extra credit for finishing earlier did not encourage them to do so. The second case study evaluates a tool used to improve student understanding of manual memory management and finds that students made fewer errors when using the tool. The third case study evaluates the reference tests used to grade student code on a selected assignment and confirms that the tests are a suitable instrument for assessing student ability. In each case study, I use a data-driven, evidence-based approach spanning multiple semesters and students, allowing me to answer each question in greater detail than was possible using previous methods and giving me significantly increased confidence in my conclusions. </p>",
  "description_provenance": [
    "Author Email: allevato@vt.edu",
    "Advisor Email: dtatar@cs.vt.edu",
    "Advisor Email: naren@cs.vt.edu",
    "Advisor Email: perez@cs.vt.edu",
    "Advisor Email: edwards@cs.vt.edu",
    "Advisor Email: cevia@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:10Z (GMT). No. of bitstreams: 1 Allevato_AJ_D_2012.pdf: 5010278 bytes, checksum: fb469b9406187b251c81198c0a50bd7a (MD5)   Previous issue date: 2012-07-16"
  ],
  "handle": "28352",
  "identifier_other": "etd-07212012-094523",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07212012-094523/",
  "identifier_uri": "http://hdl.handle.net/10919/28352",
  "publisher": "Virginia Tech",
  "relation_haspart": "Allevato_AJ_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "intuition",
    "evaluation",
    "assessment",
    "Web-CAT",
    "evidence",
    "Dereferee",
    "C++",
    "extra credit",
    "student performance",
    "procrastination",
    "time management",
    "student behavior",
    "data collection",
    "memory management",
    "pointers",
    "item response theory",
    "reference tests",
    "JUnit",
    "difficulty",
    "discriminating ability",
    "automated grading",
    "Eclipse",
    "BIRT",
    "reporting",
    "Computer science education"
  ],
  "title": "From Intuition to Evidence: A Data-Driven Approach to Transforming CS Education",
  "type": "Dissertation"
}