{
  "contributor_author": "Pechar, Todd W.",
  "contributor_committeechair": "Marand, Eva",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Ducker, William A.",
    "Oyama, Shigeo Ted",
    "Riffle, Judy S."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:14:11Z",
  "date_adate": "2004-07-30",
  "date_available": "2014-03-14T20:14:11Z",
  "date_issued": "2004-07-14",
  "date_rdate": "2010-10-15",
  "date_sdate": "2004-07-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> A series of mixed matrix membranes based on zeolites incorporated into fluorinated polyimides were fabricated and characterized in this study.  The first system consisted of a polyimide (6FDA-6FpDA-DABA) with carboxylic acid groups incorporated into its backbone and amine-functionalized zeolite particles (ZSM-2).  FTIR indicated that these functional groups interacted with each other through hydrogen bonding.  Both SEM and TEM images revealed good contact between the polyimide and the zeolite.  Permeability studies showed a drop in He permeability suggesting there were no voids between the two components.  While simple gases such as O2 and N2 followed effective permeabilities predicted by mixing theories, polar gases such as CO2 did not. </p><p>\tThe second system fabricated used the same polyimide with amine-functionalized zeolite L. This zeolite differs from ZSM-2 in that zeolite L's pores are not clogged with an organic template, and it possesses 1-D pores as opposed to ZSM-2's 3-D pore structure.  XPS and zeta potential experiments were performed to verify the presence of amine groups on the zeolite surfaces.  FTIR data showed that after a heat treatment, amide linkages were created between the amine group on the zeolite and the carboxylic acid group of the polyimide.  SEM images showed a good distribution of zeolite L throughout the polymer matrix, and no indication of voids between the two components.  Permeability experiments were performed to determine if the addition of zeolite L to the polyimide improved its separation performance.  The permeability was unchanged between the pure polyimide membrane and the mixed matrix membrane, suggesting there were no voids present within the matrix.  Permeability results of larger gases followed a Maxwell Model.   </p><p>\tA third system was prepared using a poly(imide siloxane) (6FDA-6FpDA-PDMS) and untreated zeolite L.  The primary focus of this investigation was to determine if the addition of the flexible segment would promote direct contact with the zeolite surface and remove the need to amine-functionalize the zeolite.  Poly(imide siloxane)s were synthesized at 0, 22, and 41 wt % PDMS as verified using 1H-NMR.  FTIR was employed to qualitatively verify the successful imidization of the polymers.  SAXS patterns and TEM images did not reveal distinct phases indicative of phase separation, however, AFM images did show the presence of phase separation of the surfaces of the poly(imide siloxane)s.  Permeability results showed a decrease in selectivity and an increase in permeability as the wt % of PDMS was increased.  Permeabilities and selectivities dropped as the zeolite loading was increased from 0 to 20 wt %.  Upon increasing the zeolite loading from 20 to 30 wt %, increases in permeability were observed, but both the permeability and selectivity were still below that of the pure polymer. </p><p>\tThe final system studied employed the 41 wt % PDMS poly(imide siloxane) as the polymer matrix and either closed-ended or open-ended carbon nanotubes as the filler.  SEM images showed regions of agglomeration for both types of nanotubes.  Helium permeability dropped in both types MMMs, but more so in closed-ended carbon nanotubes MMM.  Nitrogen permeability was unchanged for the closed-ended carbon nanotubes MMM, and dropped slightly in the open-ended carbon-nanotube MMM.</p>",
  "description_provenance": [
    "Author Email: tpechar@vt.edu",
    "Advisor Email: emarand@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:11Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 12346881 bytes, checksum: 049c370421a4cce4dcb0ab6bffd02cd8 (MD5)   Previous issue date: 2004-07-14"
  ],
  "handle": "28355",
  "identifier_other": "etd-07222004-111602",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07222004-111602/",
  "identifier_uri": "http://hdl.handle.net/10919/28355",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "permeability",
    "polyimide",
    "carbon nanotubes",
    "poly(imide siloxane)",
    "mixed matrix membrane"
  ],
  "title": "Fabrication and Characterization of Polyimide-based Mixed Matrix Membranes for Gas Separations",
  "type": "Dissertation"
}