{
  "contributor_author": "Gentry, Roy Michael",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Burton, John K.",
    "Hohenshil, Thomas H.",
    "Poole, Jon R.",
    "Caterisano, Anthony"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:14:10Z",
  "date_adate": "1999-07-30",
  "date_available": "2014-03-14T20:14:10Z",
  "date_issued": "1999-07-09",
  "date_rdate": "2000-07-30",
  "date_sdate": "1999-07-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "There is conflict between recognized Strength and Conditioning professionals and organizations regarding the most effective methods of teaching the power clean weight training exercise.  The area of greatest conflict is related to the effectiveness of whether to specifically introduce and segmentally practice the Double Knee Bend technique or not.  \tSixty collegiate football players with novice power clean experience were randomly assigned to one of three groups:  (1) a group in which the double knee bend technique was taught and practiced segmentally (DKB); (2) a group which was instructed in the same way as the DKB group except that the double knee bend was not specifically taught or practiced segmentally(NDKB), and (3) a control group (CG) which was exposed to an orientation session similar to the first two groups, but was not specifically instructed in the power clean technique.  \tSubjects in all three groups were video taped performing the power clean with a standardized weight both prior to and following a seven week training session.  Each video taped trial was randomly assigned to an expert reviewer for qualitative analysis in a blind review.  Reviewers rated the three upward movement phases as well as the total upward movement phase of the lift using a published check list and rated the performance from one to five with five being the best technique.     \tThe result of the ANOVA and a Scheefe test showed that the two treatment groups both demonstrated significant improvement pre to post test in the power clean technique  p<0.01.  The control group did not significantly improve over the course of the same training period.   In comparing the two treatment groups, the between groups analysis (DKB) and (NDKB) were not significantly different.  \tThese results suggest that the double knee technique does not need to be specifically taught or segmentally practiced in order to improve power clean technique among college football players with novice power clean experience.",
  "description_provenance": [
    "Author Email: gentrym@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: rstrato@vt.edu",
    "Advisor Email: poole@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:10Z (GMT). No. of bitstreams: 1 gentrydiss.PDF: 110281 bytes, checksum: dc317ac5c541c51931e0d7f498c754aa (MD5)   Previous issue date: 1999-07-09"
  ],
  "handle": "28353",
  "identifier_other": "etd-072199-082503",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-072199-082503/",
  "identifier_uri": "http://hdl.handle.net/10919/28353",
  "publisher": "Virginia Tech",
  "relation_haspart": "gentrydiss.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "strength training",
    "weight training",
    "power clean"
  ],
  "title": "A comparison of two instructional methods of teaching the power clean weight training exercise to intercollegiate football players with novice power clean experience.",
  "type": "Dissertation"
}