{
  "contributor_author": "Hyun, Sunghyup",
  "contributor_committeecochair": [
    "Perdue, Richard R.",
    "Murrmann, Suzanne K."
  ],
  "contributor_committeemember": [
    "Sirgy, M. Joseph",
    "McCleary, Ken W."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:14:10Z",
  "date_adate": "2009-08-17",
  "date_available": "2014-03-14T20:14:10Z",
  "date_issued": "2009-07-16",
  "date_rdate": "2009-08-17",
  "date_sdate": "2009-07-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Understanding the contribution of marketing to the shareholder value of a company has been a major challenge for marketing research. The purpose of this dissertation was creating and validating an attitudinal measure of customer equity in hospitality businesses, thus providing a link between return on marketing and the shareholder value of a company. The theoretical background of the customer equity construct was examined, and then systematic scale development processes were initiated. The results produced two concise scales: (1) 17 items that represent the six dimensions of customer equity in the restaurant industry and (2) 19 items that represent the six dimensions of customer equity in the hotel industry. Six dimensions of customer equity achieved strong convergent validity, discriminant validity, and internal consistency, indicating unidimensionality of the constructs. To further validate the newly developed scale, criterion validity was checked in correlation with six criterion measures using data collected from 590 hospitality industry consumers. The results demonstrate that customer equity closely reflects the shareholder value of a company. Also, it was found that value equity, brand equity, relationship equity, and service quality are significantly and positively correlated with overall customer equity of a company. In conclusion, customer equity represents the long-term value of a company, and reflects shareholder value of the company, thus providing a link with return on marketing investments. Theoretical and managerial implications are discussed.",
  "description_provenance": [
    "Author Email: blessyou@vt.edu",
    "Advisor Email: perduerr@vt.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: sirgy@vt.edu",
    "Advisor Email: mccleary@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:10Z (GMT). No. of bitstreams: 3 SurveyOfEarnedDoctorates.bmp: 817390 bytes, checksum: fe2f2f8c2ea5a1868f774efba1ff6e50 (MD5) DissertationSunghyupHyun0817.pdf: 1008243 bytes, checksum: 9eb3adc352e24e3a4f0dd135a157fc6c (MD5) IRBapprovalletter.pdf: 217240 bytes, checksum: 5503b62f5bba77001610b6e3ac47cf22 (MD5)   Previous issue date: 2009-07-16"
  ],
  "handle": "28350",
  "identifier_other": "etd-07212009-100535",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07212009-100535/",
  "identifier_uri": "http://hdl.handle.net/10919/28350",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "SurveyOfEarnedDoctorates.bmp",
    "DissertationSunghyupHyun0817.pdf",
    "IRBapprovalletter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "relationship equity",
    "brand equity",
    "value equity",
    "SERVPERF",
    "firm valuation",
    "customer lifetime value",
    "shareholder value",
    "Customer equity"
  ],
  "title": "Creating and Validating a Measure of Customer Equity in Hospitality Businesses: Linking Shareholder Value With Return on Marketing",
  "type": "Dissertation"
}