{
  "contributor_author": "Dana, Christopher David",
  "contributor_committeechair": "Winkel, Brenda S. J.",
  "contributor_committeemember": [
    "Richard A. Walker",
    "David R. Bevan",
    "John M. McDowell",
    "Jill C. Sible"
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:14:11Z",
  "date_adate": "2004-09-15",
  "date_available": "2014-03-14T20:14:11Z",
  "date_issued": "2004-07-08",
  "date_rdate": "2013-05-07",
  "date_sdate": "2004-07-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Flavonoid biosynthesis is an important secondary metabolic pathway in higher plants with a range of vital functions in plants and animals.  This pathway has been developed as a model system for the study of multi-enzyme complexes.  The goal of the work presented here was to structurally characterize a series of loss-of-function chalcone synthase (CHS) alleles and to define the molecular basis of the interaction between CHS and the second enzyme of flavonoid biosynthesis, chalcone isomerase (CHI).  <p> \tCHS proteins encoded by five previously characterized alleles were characterized by homology modeling in an effort to explain the alterations in function, stability, and dimerization exhibited by these variants.  Four of the encoded proteins have a single amino acid substitution and the fifth is a truncated protein resulting from a frameshift.  Models for each of these proteins were generated in silico and analyzed after molecular dynamics simulations.  This analysis suggested reasons for changes in catalytic ability and stability for three of the five CHS variants. <p> \tTo characterize the molecular basis of the CHS-CHI interaction, a model was developed using X-ray crystallography, small-angle neutron scattering (SANS), in silico docking, molecular dynamics simulations, and yeast 2-hybrid analyses.  These enzymes appear to be interacting in a manner that could facilitate the flow of intermediates from one active site to another.  These experiments also identified a series of amino acids that appear to be involved in the interaction, which are currently undergoing alteration and analysis using a yeast 2-hybrid assay to verify the authenticity of the model.  The data presented herein could be used in future engineering experiments to alter pathway flux to control the levels or types of flavonoid endproducts, resulting in more nutritious plants or flowers with novel pigments.<p> These experiments advance the study of the structure of multi-enzyme complexes, an area that currently contains little information.  As well, this is the first known use of SANS for the investigation of the architecture of metabolons.  The techniques described herein could easily be applied to other systems in an effort to better understand the organization of multi-enzyme complexes and the implications of these assemblies on metabolic regulation.",
  "description_provenance": [
    "Author Email: cdana@vt.edu",
    "Advisor Email: winkel@vt.edu",
    "Advisor Email: rawalker@vt.edu",
    "Advisor Email: drbevan@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Advisor Email: siblej@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:11Z (GMT). No. of bitstreams: 1 ChrisDanaDissertation.pdf: 1952922 bytes, checksum: b0c53f5aa38328e283fd1f7ccc20d1ed (MD5)   Previous issue date: 2004-07-08"
  ],
  "handle": "28356",
  "identifier_other": "etd-07222004-145633",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07222004-145633/",
  "identifier_uri": "http://hdl.handle.net/10919/28356",
  "publisher": "Virginia Tech",
  "relation_haspart": "ChrisDanaDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Arabidopsis",
    "Chalcone Synthase",
    "Flavonoids",
    "Chalcone Isomerase"
  ],
  "title": "Structural Characterization of the Flavonoid Enzyme Complex",
  "type": "Dissertation"
}