{
  "contributor_author": "Seek, Michael Walter",
  "contributor_committeechair": "Murray, Thomas M.",
  "contributor_committeemember": [
    "Easterling, William Samuel",
    "Charney, Finley A.",
    "Setareh, Mehdi",
    "Sotelino, Elisa D."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:14:11Z",
  "date_adate": "2007-09-04",
  "date_available": "2014-03-14T20:14:11Z",
  "date_issued": "2007-01-29",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-07-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Z-sections are widely used as secondary members in metal building roof systems.  Lateral restraints are required to maintain the stability of a Z-section roof system and provide resistance to the lateral forces generated by the slope of the roof and the effects due to the rotation of the principal axes of the Z-section relative to the plane of the roof sheathing.  The behavior of Z-sections in roof systems is complex as they act in conjunction with the roof sheathing as a system and as a light gage cold formed member, is subject to local cross section deformations. </p><p> The goal of this research program was to provide a means of predicting lateral restraint forces in Z-section supported roof systems.  The research program began with laboratory tests to measure lateral restraint forces in single and multiple span sloped roof systems.  A description of the test apparatus and procedure as well as the results of the 40 tests performed is provided in Appendix II. </p><p>\tTo better understand the need for lateral restraints and to provide a means of testing different variables of the roof system, two types of finite element models were developed and are discussed in detail in appended Paper I.  The first finite element model is simplified model that uses frame stiffness elements to represent the purlin and sheathing.  This model has been used extensively by previous researchers and modifications were made to improve correlation with test results.  The second model is more rigorous and uses shell finite elements to represent the Z-section and sheathing. </p><p>\tThe shell finite element model was used to develop a calculation procedure referred to as the Component Stiffness Method for predicting the lateral restraint forces in Z-section roof systems.  The method uses flexural and torsional mechanics to describe the behavior of the Z-section subject to uniform gravity loads.  The forces generated by the system of Z-sections are resisted by the \"components\" of the system: the lateral restraints, the sheathing and Z-section-to-rafter connection.  The mechanics of purlin behavior providing the basis for this method are discussed in appended Paper II.  The development of the method and the application of the method to supports restraints and interior restraints are provided in appended papers III, IV and V.</p>",
  "description_provenance": [
    "Author Email: mseek@vt.edu",
    "Advisor Email: seaster@vt.edu",
    "Advisor Email: fcharney@vt.edu",
    "Advisor Email: setareh@vt.edu",
    "Advisor Email: sotelino@vt.edu",
    "Advisor Email: thmurray@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:11Z (GMT). No. of bitstreams: 1 Seek-dissertation.pdf: 2504079 bytes, checksum: 6d5cf60e6b7abd6df3d7334be7efcff6 (MD5)   Previous issue date: 2007-01-29"
  ],
  "handle": "28357",
  "identifier_other": "etd-07222007-221612",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07222007-221612/",
  "identifier_uri": "http://hdl.handle.net/10919/28357",
  "publisher": "Virginia Tech",
  "relation_haspart": "Seek-dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "diaphragm",
    "standing seam",
    "through-fastened",
    "cold-formed",
    "component stiffness method",
    "finite element method",
    "lateral bracing",
    "Z-section",
    "purlin",
    "metal building"
  ],
  "title": "Prediction of Lateral Restraint Forces in Sloped Z-section Supported Roof Systems Using the Component Stiffness Method",
  "type": "Dissertation"
}