{
  "contributor_author": "Viswanadha, Srikant",
  "contributor_committeechair": "Herbein, Joseph H. Jr.",
  "contributor_committeemember": [
    "Saker, Korinn E.",
    "McGilliard, Michael L.",
    "Denbow, Donald Michael",
    "Akers, Robert Michael"
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:14:11Z",
  "date_adate": "2003-07-25",
  "date_available": "2014-03-14T20:14:11Z",
  "date_issued": "2003-07-15",
  "date_rdate": "2007-07-25",
  "date_sdate": "2003-07-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Conjugated linoleic acid (CLA) reduces adipose mass in several species.  Studies were conducted to determine: 1) the effect of dietary trans10,cis12-CLA on growth, tissue fatty acid profile, mRNA expression for stearoyl-CoA desaturase (SCD) in adipose and liver, and mRNA expression for fatty acid synthase (FAS) in adipose of mice, 2) the effect of a dietary combination of trans-vaccenic acid (TVA) and trans10,cis12-CLA on delta9- desaturation, and 3) the effect of cis9,trans11-CLA, trans10,cis12-CLA, and carnitine palmitoyltransferase-1 (CPT-1) inhibitors on expression of mRNA for CPT-1 and fatty acid profile in mouse hepatocytes (AML-12) and human hepatoma cells (HepG2).  In the first study, male or female mice were fed diets containing 0, 0.15%, or 0.30% trans10,cis12-CLA for 6 wk.  Epididymal adipose weights (males) and inguinal adipose weights (females) decreased by 81% and 52%, respectively, in response to 0.30% trans10,cis12-CLA.  Dry carcass weights decreased from 4.75 g for the control to 3.62 g for mice fed 0.30% trans10,cis12-CLA and the decrease was due to a reduction in ether extract.  Liver weights increased linearly from 0.55 g (control) to 0.65 g (0.30% trans10,cis12-CLA).  Dietary trans10,cis12-CLA (0.30%) reduced FAS and SCD mRNA in adipose by 60 and 30 % respectively, compared with the control, suggesting reduced lipogenesis and desaturation might be primary factors responsible for reducing body fat.  In the second study, adult male or female mice were fed diets containing 0.40% TVA in combination with 0, 0.15, or 0.30% trans10,cis12-CLA for 10 d.  Both TVA and trans10,cis12-CLA were incorporated into plasma, liver, adipose, muscle, and bone lipids proportional to their concentrations in the diets.  Desaturation ratios were not affected in adipose, liver, and bone.  However, ratios of 16:0 to 16:1 and 18:0 to 18:1 increased from 0.81 to 0.86 and 0.15 to 0.19 respectively, in response to dietary trans10,cis12-CLA (0.30%), suggesting inhibition of delta9 desaturation in muscle.  In the third study, AML-12 or HepG2 cells were incubated with control media or media containing 15 uM etomoxir (ETM), 30 uM ETM, 15 uM hemipalmitoylcarnitinium (HPC), 30 uM HPC, 100 uM cis9,trans11-CLA, or 100 uM trans10,cis12-CLA for 24 h.  Half the cells were harvested for analysis of fatty acids, mRNA for CPT-1, and cholesterol after 24 h.  The remaining cells were incubated for an additional 24 h in control medium. Incorporation (% of total fatty acids) of trans10,cis12-CLA was greater than cis9,trans11-CLA in AML-12 (34 vs 23.6) and HepG2 (28 vs 18) cells.  Cells incubated with trans10,cis12-CLA had higher ratios of 16:0 to 16:1, 18:0 to 18:1, and 18:2n6 to 20:4n-6, suggesting inhibition of delta9, delta5 , and delta6 desaturation.  Cis9,trans11-CLA also reduced ratio of 18:2n-6 to 20:4n-6 in both cell lines.  Trans10,cis12-CLA increased mRNA for CPT-1 in both cell lines compared with the control, suggesting enhanced oxidation of fatty acids.  In addition, trans10,cis12-CLA caused a 4-fold and 5-fold increase in free cholesterol content of AML-12 and HepG2 cells, respectively.   Overall, results demonstrated that trans10,cis12-CLA modulated lipid metabolism in tissues in vivo and altered fatty acid metabolism, cholesterol synthesis, and CPT-1 mRNA in hepatic cell lines in vitro.",
  "description_provenance": [
    "Author Email: sviswana@vt.edu",
    "Advisor Email: kesaker@vt.edu",
    "Advisor Email: herbeinj@vt.edu",
    "Advisor Email: mcg@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Advisor Email: rma@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:11Z (GMT). No. of bitstreams: 1 viswanadha.pdf: 876848 bytes, checksum: 30bf5ab86cb771010af4a9e227638bbd (MD5)   Previous issue date: 2003-07-15"
  ],
  "handle": "28354",
  "identifier_other": "etd-07222003-125032",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07222003-125032/",
  "identifier_uri": "http://hdl.handle.net/10919/28354",
  "publisher": "Virginia Tech",
  "relation_haspart": "viswanadha.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fatty acids",
    "desaturation",
    "lipogenesis",
    "CLA"
  ],
  "title": "Alterations in Lipid Metabolism in Mouse Tissues and Hepatic Cell Lines in Response to the Trans10,Cis12-18:2 Isomer of Conjugated Linoleic Acid",
  "type": "Dissertation"
}