{
  "contributor_author": "DiDomenico, Angela Terese",
  "contributor_committeechair": "Nussbaum, Maury A.",
  "contributor_committeemember": [
    "Smith-Jackson, Tonya L.",
    "Babski-Reeves, Kari L.",
    "Beaton, Robert J.",
    "Allender, Laurel",
    "Lockhart, Thurmon E."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:14:13Z",
  "date_adate": "2003-07-30",
  "date_available": "2014-03-14T20:14:13Z",
  "date_issued": "2003-07-17",
  "date_rdate": "2003-07-30",
  "date_sdate": "2003-07-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Workload is defined as the cost incurred by an individual, given their capacities, while achieving a particular level of performance on a task with specific demands.  Demands of a task or combination of tasks may include maintaining postural stability, executing physical actions, and/or performing cognitive tasks.  While there have been attempts to establish a physiological measure of concurrent physical and mental workload, as yet there has been no work towards developing a single subjective method of evaluation.<p> Select subjective assessment methodologies were evaluated quantitatively during laboratory-based experiments.  Concurrent execution of mental and physical activity was required at various levels, since it was desired to be able to measure mental workload, physical workload, and also evaluate their interaction.  Measurements of task performance were investigated to evaluate the effects of combined mental and physical demands and establish which subjective assessments were accurate and sensitive to changes in workload.  The utility of existing subjective assessment tools created for one domain appeared to be limited when evaluating multi-task situations requiring substantial mental and physical activity.<p> Further clarification of the impact of different types of physical demand on cognitive processing, performance and subjective workload assessment of a constant mental task was addressed in the second experiment.  This experiment investigated the effect of several activity types, specifically global versus localized effort, changes in load, and different task frequencies.  The results provided support that the type of activity, load and frequency of task influence subjective mental workload assessment scores and performance.  Not all existing assessment tools accurately represented an individual's ability to perform a task when there was a combination of physical and mental demands.  A unidimensional tool is suggested as a screening tool to identify situations requiring excessive or increased mental workload.  Alternative methods, possibly a new multidimensional tool, should be developed to obtain more detailed information so ratings of workload for different tasks may be compared.<p> Effectiveness of a subjective stability assessment tool was evaluated in situations demanding mental activity while maintaining an upright posture.  Tests were performed over a wide range of conditions, including various mental loads, sensory conditions, and postural stances.  The purpose was to determine the effects of each task variation on the perception of postural stability.  Postural sway increased with task difficulty, regardless of the source (i.e. postural stance, visual condition, mental workload).  The addition of mental workload did not alter the non-linear relationship between objective measures of postural sway and perceptions of postural stability.  Since decrements in balance are well perceived, subjective assessment tools may be incorporated in control strategies to minimize falls.",
  "description_provenance": [
    "Author Email: domenico@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: kbabski@vt.edu",
    "Advisor Email: bobb@vt.edu",
    "Advisor Email: laurel.allender@us.army.mil",
    "Advisor Email: lockhart@vt.edu",
    "Advisor Email: nussbaum@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:13Z (GMT). No. of bitstreams: 1 DiDomenico_dissertation.pdf: 696988 bytes, checksum: c6e55bac0c6f729746b1b894d1184a58 (MD5)   Previous issue date: 2003-07-17"
  ],
  "handle": "28368",
  "identifier_other": "etd-07232003-213904",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07232003-213904/",
  "identifier_uri": "http://hdl.handle.net/10919/28368",
  "publisher": "Virginia Tech",
  "relation_haspart": "DiDomenico_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "subjective assessment",
    "postural stability",
    "physical workload",
    "mental workload"
  ],
  "title": "An investigation on subjective assessments of workload and postural stability under conditions of joint mental and physical demands",
  "type": "Dissertation"
}