{
  "contributor_author": "Orrell, Kimberly Sue",
  "contributor_committeechair": "Jenssen, Thomas A.",
  "contributor_committeemember": [
    "Cranford, Jack A.",
    "Walters, Jeffery R.",
    "Smith, Eric P.",
    "Congdon, Justin D."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:14:12Z",
  "date_adate": "2002-08-13",
  "date_available": "2014-03-14T20:14:12Z",
  "date_issued": "2002-05-09",
  "date_rdate": "2003-08-13",
  "date_sdate": "2002-07-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Particularly lacking in the current body of sexual selection literature are studies based on reptile species and intrasexually selected mating systems.  Because the life history traits and ecology of reptiles are dramatically different from other animal taxa, current models of sexual selection are insufficient for predicting how sexual selection should influence the behavior and mating systems of lizards.  Similarly, intersexually selected mating systems (i.e., based on female choice) are inappropriate predictive models for examining species with intrasexually selected mating systems (i.e., based on consexual contests).  I  investigated three aspects of Anolis carolinensis behavior and mating system (communication signals, male mate preference, and reproductive energetics) to contribute to a theoretical model for sexual selection based on a lizard with an intrasexually selected, polygynous mating system.   \tIn my first study, I quantified the structure and use of signals exchanged by both sexes, compared signal structure and use during heterosexual interactions to that of other social contexts (e.g., male-alone, male-male, female-female), then related signal structure and use to the species mating system.  During heterosexual interactions, both sexes performed three kinds of stereotypic headbob displays with equal precision that were essentially identical to those previously documented for other social contexts.  Thus, there is no courtship-specific headbob display for A. carolinensis.  However, male and female signal use was extremely dimorphic.  For the purpose of indicating sexual identity, the sexually dimorphic patterns of signal use were excessively redundant, yet equivocal.  Although the male pattern of signal use reliably conveys sexual identity, the female pattern of signal use conveys ambiguous sexual identity.  Based on circumstantial evidence from other studies, I propose the hypothesis that the female pattern of signal use may permit female-sized, nonterritorial males to mimic female signals.  Small males may be selected to use female mimicry to gain access to the territories of larger males and mating opportunities with resident females, while females may be indirectly selected to use a signaling pattern that provides them with an alternative mating option.  From field and laboratory data on  A. carolinensis signal behavior during other social contexts and the species' female-defense mating system, I evaluate proposed functions for heterosexual signaling from a perspective of intrasexual selection.  In my second study, I tested the prediction that males should include a preference for mating with novel females (PNF) as part of their mating strategy.  This prediction was supported by both laboratory and field manipulations.  Compared to their encounters with resident females, males during laboratory encounters with novel females significantly increased their display rate, volley frequency, volley length, and significantly decreased the distance and number of movements traveled away from the female. My laboratory data also suggest that males discriminated novel females from resident females independently of female behavioral or chemical cues.  Similarly, compared to their interactions with resident females, free-ranging males responded to introduced novel females by significantly increasing the proportion of time spent in female-directed activities and the proportion of displays directed toward novel females, and significantly decreasing the proportion of time spent in territorial activities and the proportion of displays used in territorial activities.  Data from both experiments indicate that males appear to distinguish among individual females, and use this ability to increase reproductive success by identifying and preferentially pursuing novel females over previously inseminated resident females.  I suggest that males are able to cognitively identify individual resident females, and use this ability to control mating decisions within their territories.  In my third study, I examined the energy expenditure of males and females during breeding and postbreeding seasons.  I used laboratory respirometry to determine resting metabolic rates, and the doubly-labeled water technique to determine field metabolic rates in free-ranging lizards.  Resting metabolic rates were significantly influenced by body mass and season, but not sex.  Field metabolic rates were significantly influenced by body mass, but not sex or season.  I attributed the ~40% seasonal increase in resting metabolic rates to a seasonal increase in feeding rates and the effect of specific dynamic action.  Resting and field metabolic rates were used to calculate energy budgets for each sex during breeding and postbreeding seasons, and to calculate the energy expended by each sex for reproduction.  Despite having 40% smaller body mass, females expended 46% more energy for reproduction than males, and a similar amount of total maintenance energy as males.  The total maintenance energy of males was similar during both seasons, however that of females decreased 44% from breeding to postbreeding season.  I found both seasonal and sexual differences in the amount of energy lizards allocated to resting and activity.  Anolis carolinensis had field metabolic rates that were similar to tropical and temperate species of lizards, and higher than lizards from arid/semiarid environments.  Anolis carolinensis also expended more energy on eggs, and more total energy during the breeding season, than lizards from arid/semiarid habitats.",
  "description_provenance": [
    "Author Email: korrell@vt.edu",
    "Advisor Email: cranford@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: tjenssen@vt.edu",
    "Advisor Email: epsmith@vt.edu",
    "Advisor Email: congdon@srel.edu",
    "Made available in DSpace on 2014-03-14T20:14:12Z (GMT). No. of bitstreams: 1 Orrell_Dissertation.pdf: 455043 bytes, checksum: 51b4256c1d6bcc99d0571cc3fe414bdc (MD5)   Previous issue date: 2002-05-09"
  ],
  "handle": "28366",
  "identifier_other": "etd-07232002-195330",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07232002-195330/",
  "identifier_uri": "http://hdl.handle.net/10919/28366",
  "publisher": "Virginia Tech",
  "relation_haspart": "Orrell_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mate choice",
    "courtship",
    "cognition",
    "Coolidge effect",
    "reproduction",
    "communication",
    "metabolism",
    "sexual selection",
    "behavior",
    "energetics",
    "female mimicry",
    "individual recognition",
    "display behavior"
  ],
  "title": "Intersexual Communication, Male Mate Preference, and Reproductive Energetics of the Polygynous Lizard, Anolis Carolinensis",
  "type": "Dissertation"
}