{
  "contributor_author": "Khatibi, Piyum",
  "contributor_committeechair": "Schmale, David G. III",
  "contributor_committeemember": [
    "McDowell, John M.",
    "Tholl, Dorothea B.",
    "Griffey, Carl A."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:14:12Z",
  "date_adate": "2011-08-18",
  "date_available": "2014-03-14T20:14:12Z",
  "date_issued": "2011-07-12",
  "date_rdate": "2011-08-18",
  "date_sdate": "2011-07-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The fungal plant pathogen Fusarium graminearum Schwabe (teleomorph Gibberella zeae¬) produces a dangerous trichothecene mycotoxin called deoxynivalenol (DON) and causes a devastating disease of barley (Hordeum vulgare L.) called Fusarium head blight (FHB).  Food and feed products derived from barley, such as dried distillers grains with solubles (DDGS), may be contaminated with DON and pose a threat to the health of humans and domestic animals.  New methods to mitigate the threat of DON in barley need to be developed and implemented.  TRI101 and TRI201 are trichothecene 3-O-acetyltransferases that modify DON and reduce its toxicity.  The first objective of this research was to isolate unique TRI101 and TRI201 enzymes that modify DON efficiently.  We hypothesized that TRI101/TRI201 enzymes from different species of Fusarium would have varying rates and abilities to modify DON.  Using degenerate primers, an internal portion of TRI101 or TRI201 was identified in 54 strains of Fusarium. Full-length sequences of seven TRI101 or TRI201 genes were cloned and expressed in yeast.  All seven genes acetylated DON, but at different rates. The second objective of this research was to utilize transformed yeast expressing TRI101 or TRI201 to reduce DON levels in barley mashes and ultimately in DDGS.  We hypothesized that DON levels would be reduced in DDGS derived from mashes prepared with transformed yeast.  Five different barley genotypes were used to prepare the fermentation mashes and DON levels were reduced in all DDGS samples derived from mashes prepared with transformed yeast.  The third objective of this study was to characterize barley genotypes developed at Virginia Tech for resistance to FHB and DON.  We hypothesized that significant differences in resistance would be observed among barley genotypes and FHB resistance would be associated with reduced DON accumulation.  From 2006 to 2010, FHB resistance was assessed in hulled (22 to 37) and hulless (13 to 32) barley genotypes by measuring incidence and index, and DON resistance was determined by quantifying DON levels in ground grain using gas chromatography-mass spectrometry.  Our study showed that FHB and DON resistance is significantly determined by genotype.  The final objective of this study was to develop a robust tissue culture system necessary for future development of transformed barley plants with FHB resistance gene(s).  We hypothesized that callus production would vary among barley genotypes.  In our analysis of 47 Virginia barley genotypes, 76% (36/47) of the genotypes produced callus tissue and there were significant differences in callus size.  Our work sets the stage for identifying and characterizing DON detoxification genes in the future. The development of commercial barley lines that do not accumulate DON and that are resistant to FHB will directly impact growers and producers of small grains in the eastern U.S.",
  "description_provenance": [
    "Author Email: khatibpa@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Advisor Email: tholl@vt.edu",
    "Advisor Email: cgriffey@vt.edu",
    "Advisor Email: dschmale@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:12Z (GMT). No. of bitstreams: 1 Khatibi_PA_D_2011.pdf: 7721946 bytes, checksum: 7af63e600d1da37750b7562aaaea2994 (MD5)   Previous issue date: 2011-07-12"
  ],
  "handle": "28361",
  "identifier_other": "etd-07222011-150606",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07222011-150606/",
  "identifier_uri": "http://hdl.handle.net/10919/28361",
  "publisher": "Virginia Tech",
  "relation_haspart": "Khatibi_PA_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ethanol",
    "dried distillers grains with solubles",
    "TRI101",
    "TRI201",
    "Fusarium graminearum",
    "Fusarium head blight",
    "deoxynivalenol",
    "barley",
    "Hordeum vulgare"
  ],
  "title": "Reduction of the mycotoxin deoxynivalenol in barley ethanol co-products using trichothecene 3-O-acetyltransferases",
  "type": "Dissertation"
}