{
  "contributor_author": "Lokar, William Joseph",
  "contributor_committeechair": "Ducker, William A.",
  "contributor_committeemember": [
    "Anderson, Mark R.",
    "Yoon, Roe-Hoan",
    "Morris, John R.",
    "Esker, Alan R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:14:13Z",
  "date_adate": "2004-07-29",
  "date_available": "2014-03-14T20:14:13Z",
  "date_issued": "2004-07-19",
  "date_rdate": "2005-07-29",
  "date_sdate": "2004-07-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The adsorption of cationic and zwitterionic surfactants is studied in aqueous electrolyte solutions.  A Maxwell relation is applied to Atomic Force Microscopy (AFM) data to obtain changes in surfactant adsorption as a function of the separation between two glass surfaces.  In addition, self-consistent field theory (SCF) is used to calculate the adsorption profiles and interaction energies when two solid surfaces are brought into close proximity.  Addition of surfactant is shown to affect the surface forces when lateral surfactant chain interactions are significant.  The surfactant adsorbs and desorbs in response to over-lapping electric double-layers, with the adsorption being affected at larger solid-solid separations when the double-layer force is longer ranged.  Furthermore, elimination off the surface charge or net surfactant charge eliminates adsorption with decreased solid-solid separation.   The magnitude of the changes in surfactant adsorption at decreased separations is shown to scale with the chain length of the surfactant.  Surfactant adsorption exceeds that required to regulate the surface charge according to the constant potential boundary condition in Poisson-Boltzmann theory.  An equation of state including short-ranged (contact) tail interactions is proposed to describe both the adsorption of surfactant and the surface forces at small separations, where the double-layers overlap.  Furthermore, SCF calculations show confinement-induced phase transitions when the surfactant layers on opposite surfaces merge.  These phase transitions lead to further surfactant adsorption and a corresponding attractive force.",
  "description_provenance": [
    "Author Email: wlokar@yahoo.com",
    "Advisor Email: wducker@vt.edu",
    "Advisor Email: mark.anderson@vt.edu",
    "Advisor Email: ryoon@vt.edu",
    "Advisor Email: jrmorris@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:13Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 5452164 bytes, checksum: 48635949cb62a171a57cdb9b7b03df17 (MD5)   Previous issue date: 2004-07-19"
  ],
  "handle": "28369",
  "identifier_other": "etd-07232004-141823",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07232004-141823/",
  "identifier_uri": "http://hdl.handle.net/10919/28369",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "AFM",
    "self-consistent field theory",
    "Surfactant",
    "proximal adsorption",
    "adsorption",
    "charge regulation",
    "surface forces"
  ],
  "title": "Surfactant Adsorption during Collisions of Colloidal Particles: A Study with Atomic Force Microscopy (AFM)",
  "type": "Dissertation"
}