{
  "contributor_author": "Nicoli, Edoardo",
  "contributor_committeechair": "Dillard, David A.",
  "contributor_committeemember": [
    "Lesko, John J.",
    "Dowling, Norman E.",
    "Dillard, John G.",
    "Plaut, Raymond H."
  ],
  "contributor_department": "Engineering Science and Mechanics",
  "date_accessioned": "2014-03-14T20:14:13Z",
  "date_adate": "2010-08-19",
  "date_available": "2014-03-14T20:14:13Z",
  "date_issued": "2010-07-19",
  "date_rdate": "2010-08-19",
  "date_sdate": "2010-07-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The primary focus of this thesis was to investigate the critical strain energy release rates (G) for mixed-mode (I/II) fracture of wood adhesive joints.  The aims of the study were: (1) quantifying the fracture properties of two material systems, (2) analyzing the aspects that influence the fracture properties of bonded wood, (3) refining test procedures that particularly address layered orthotropic systems in which the layers are not parallel to the laminate faces, of which wood is often a particular case, and (4) developing testing methods that enhance the usefulness of performing mixed-mode tests with a dual-actuator load frame.  The material systems evaluated experimentally involved yellow-poplar (Liriodendron tulipifera), a hardwood of the Magnoliaceae family, as adherends and two different adhesives: a moisture-cure polyurethane (PU) and a phenol/resorcinol/-formaldehyde (PRF) resin.  The geometry tested in the study was the double cantilever beam that, in a dual-actuator load frame, can be used for testing different levels of mode-mixity.  The mixed-mode loading condition is obtained by applying different displacement rates with the two independently controlled actuators of the testing machine. Characteristic aspects such as the large variability of the adhesive layer thickness and the intrinsic nature of many wood species, where latewood layers are alternated with earlywood layers, often combine to confound the measures of the critical values of strain energy release rate, Gc.  Adhesive layer thickness variations were observed to be substantial also in specimens prepared with power-planed wood boards and affect the value of Gc of the specimens.  The grain orientation of latewood and earlywood, materials that often have different densities and elastic moduli, limits the accuracy of traditional standard methods for the evaluation of Gc.  The traditional methods, described in the standards ASTM D3433-99 and BS 7991:2001, were originally developed for uniform and isotropic materials but are widely used by researchers also for bonded wood, where they tend to confound stiffness variations with Gc variations.  Experimental analysis and analytical computations were developed for quantifying the spread of Gc data that is expected to be caused by variability of the adhesive layer thickness and by the variability of the bending stiffness along wooden beams.",
  "description_provenance": [
    "Author Email: enicoli@vt.edu",
    "Advisor Email: jlesko@exchange.vt.edu",
    "Advisor Email: ndowling@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: dillard@vt.edu",
    "Advisor Email: rplaut@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:13Z (GMT). No. of bitstreams: 1 Nicoli_E_D_2010.pdf: 3629144 bytes, checksum: 792fb32d9bbdd91d4ca5af283d1c1cd7 (MD5)   Previous issue date: 2010-07-19"
  ],
  "handle": "28372",
  "identifier_other": "etd-07232010-165924",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07232010-165924/",
  "identifier_uri": "http://hdl.handle.net/10919/28372",
  "publisher": "Virginia Tech",
  "relation_haspart": "Nicoli_E_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "yellow-poplar",
    "stiffness variability",
    "dual-actuator",
    "I/II",
    "mixed-mode",
    "fracture",
    "bonded wood",
    "adhesive joints",
    "composite laminate",
    "grain orientation"
  ],
  "title": "Characterization of Mixed-Mode Fracture Testing of Adhesively Bonded Wood Specimens",
  "type": "Dissertation"
}