{
  "contributor_author": "Monsegue, Niven",
  "contributor_committeechair": "Aning, Alexander O.",
  "contributor_committeemember": [
    "Reynolds, William T. Jr.",
    "Murayama, Mitsuhiro",
    "Kampe, Stephen L.",
    "Schultz, Jeffery P.",
    "Lu, Guo-Quan"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:14:13Z",
  "date_adate": "2010-08-27",
  "date_available": "2014-03-14T20:14:13Z",
  "date_issued": "2010-07-09",
  "date_rdate": "2010-08-27",
  "date_sdate": "2010-07-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Equiatomic composition of Ni and Ti was cryomilled with varying milling times to create Ni-Ti lamella structures with average spacings of 50 nm, 470 nm, and 583 nm in powder particles to vary the interfacial surface area per volume. These surfaces form interfaces for diffusion that are essential for solid state amorphization during low temperature annealing.  To compare solid state amorphization in a relatively defect free multilayer system, elemental Ni and Ti were deposited by electron beam physical vapor deposition on titanium plates with comparable spacing as above.  Both milled and deposited multilayers were annealed between 225 and 350Â°C for up to 50 hours. X-ray diffraction characterization and in situ annealing was conducted on cryomilled and deposited multilayers of Ni-Ti. Based on this characterization, an amorphization model based on the Johnson-Mehl-Avrami nucleation and growth equation has been established to predict the amorphization of both cryomilled and deposited multilayers. Cryomilled powders experienced much larger amorphization rates during annealing than that of deposited multilayer structures, for all layer spacings. This superior amorphization is seen despite the formation of amorphous phase during the milling process; the amount of which increases with increasing milling time. The difference in amorphization rates between cryomilled and deposited multilayers is attributed to excess driving force due to the extensive preexisting defects in the powders caused by cryomilling. Serial 3D reconstruction of cryomilled Ni-Ti powders was done by scanning electron microscopy and focused ion beam. Through 3D reconstruction it was observed that a random and non-linear lamella structure has been formed in cryomilled powders. Furthermore, lamellar spacing was seen to become smaller with increased milling time while at the same time becoming more homogeneous through the materialâ  s volume. 3D reconstruction of cryomilled Ni-Ti offers a unique insight into the microstructures and surface areas of cryomilled powder particles that has never been accomplished.",
  "description_provenance": [
    "Author Email: nmonsegu@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: murayama@vt.edu",
    "Advisor Email: aaning@vt.edu",
    "Advisor Email: kampe@mtu.edu",
    "Advisor Email: Jeff.Schultz@schultz-creehan.com",
    "Advisor Email: gqlu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:13Z (GMT). No. of bitstreams: 4 4.7h_Cryomilled_NiTi_3D.mp4: 602271 bytes, checksum: 76c7428b586ca0339df035b60be4eca3 (MD5) 8h_Cryomilled_NiTi_3D.mp4: 1397223 bytes, checksum: 6b8ee6d993b605bc581b861885ed33c9 (MD5) Monsegue_Niven_D_2010_MSEa.pdf: 8734671 bytes, checksum: 357e9cb31281af155c9a25efd522af19 (MD5) 2h_Cryomilled_NiTi_3D.mp4: 509782 bytes, checksum: 0633621ecdd89395eabe86e2b3848f4a (MD5)   Previous issue date: 2010-07-09"
  ],
  "handle": "28373",
  "identifier_other": "etd-07232010-232130",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07232010-232130/",
  "identifier_uri": "http://hdl.handle.net/10919/28373",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "4.7h_Cryomilled_NiTi_3D.mp4",
    "8h_Cryomilled_NiTi_3D.mp4",
    "Monsegue_Niven_D_2010_MSEa.pdf",
    "2h_Cryomilled_NiTi_3D.mp4"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Mechanical Alloying",
    "Solid State Amorphous Reactions",
    "Amorphous Metals",
    "Nickel",
    "Titanium",
    "Solid State Amorphization Model"
  ],
  "title": "Characterizing the Effects of Mechanical Alloying on Solid State Amorphization of Nanoscaled Multilayered Ni-Ti",
  "type": "Dissertation"
}