{
  "contributor_author": "Eichstadt, Amy Elizabeth",
  "contributor_committeechair": "Ward, Thomas C.",
  "contributor_committeemember": [
    "Dillard, David A.",
    "Dillard, John G.",
    "Kander, Ronald G.",
    "Davis, Richey M."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:14:15Z",
  "date_adate": "2002-08-19",
  "date_available": "2014-03-14T20:14:15Z",
  "date_issued": "2002-07-16",
  "date_rdate": "2003-08-19",
  "date_sdate": "2002-07-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Aromatic polyimides have found widespread applicability which can be partially attributed to their thermal stability, chemical resistance, and high glass transition temperature. However, deficiencies in their processability, solubility, transparency, and relatively high dielectric constants do not always provide the optimum properties for many specialty microelectronics applications. The incorporation of aliphatic segments to form partially aliphatic polyimides, has been used to counteract these shortcomings. Many of the potential uses of partially aliphatic polyimides require them to adhere to ceramic substrates, a main topic of this research.  Polyimides and copolyimides that varied in chemical composition by their aliphatic content were characterized by their molecular weight, glass transition temperature, thermal stability, coefficient of thermal expansion, refractive index, dielectric behavior, and mechanical properties. Structure-property relationships were established. The gamma and beta sub-Tg viscoelastic relaxations were investigated to understand their molecular origins.  The adhesion performance of a selected series of partially aliphatic polyimides to SiO2/Si was examined using a shaft loaded blister test, which was designed and instrumented for use in a dynamic mechanical analysis instrument. The adhesion was studied at high and low percent relative humidities and for several temperatures to examine if adhesion strength is influenced by polymer chemical composition. The adhesion energy could not be quantified for the entire series of polyimides. It was possible to interpret the quantitative adhesive fracture energies along with the qualitative adhesion strength behaviors, the failure surface analyses, and to offer an understanding of the adhesive chemical structure-physical property relationships. These understandings provide a conclusion that the incorporation of aliphatic segments into the polyimide chemical structure improves the durability of the adhesive bond to SiO2/Si under high percent relative humidities.",
  "description_provenance": [
    "Author Email: aeichsta@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:15Z (GMT). No. of bitstreams: 1 Eichstadt_dissertation_final.pdf: 7560087 bytes, checksum: b11260b8d3fe5c5d22cf6bccded6b047 (MD5)   Previous issue date: 2002-07-16"
  ],
  "handle": "28379",
  "identifier_other": "etd-07242002-225112",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07242002-225112/",
  "identifier_uri": "http://hdl.handle.net/10919/28379",
  "publisher": "Virginia Tech",
  "relation_haspart": "Eichstadt_dissertation_final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "viscoelastic properties",
    "aliphatic diamine",
    "polyimide",
    "adhesion",
    "shaft loaded blister test",
    "dielectric properties",
    "structure-property relations"
  ],
  "title": "Structure-Property Relationships and Adhesion in Polyimides of Varying Aliphatic Content",
  "type": "Dissertation"
}