{
  "contributor_author": "Kaleth, Anthony Scott",
  "contributor_committeechair": "Herbert, William G.",
  "contributor_committeemember": [
    "Cross, Lawrence H.",
    "Gregg, John M.",
    "Nickols-Richardson, Sharon M.",
    "Zedalis, Donald"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:14:15Z",
  "date_adate": "2002-07-30",
  "date_available": "2014-03-14T20:14:15Z",
  "date_issued": "2002-07-22",
  "date_rdate": "2003-07-30",
  "date_sdate": "2002-07-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Aerobic Exercise Training and Nasal CPAP Therapy: Adaptations in Cardiovascular Function in Patients with Obstructive Sleep Apnea  By  Anthony Scott Kaleth  Committee Chair: William G. Herbert   (ABSTRACT) Obstructive sleep apnea (OSA) is a serious disorder that affects up to 24% of middle-aged males.  The substantial cost and inconvenience associated with polysomnography limits the number of people who seek treatment. Therefore, information concerning exercise tolerance and hemodynamic function in obstructive sleep apnea (OSA) patients may add new and clinically meaningful information to the process of grading disease severity and/or assessing treatment outcomes.  Objectives: The primary objective of this study was to explore relationships between polysomnography (PSG) markers of sleep function and resting and exercise measures of hemodynamic function in patients diagnosed with mild-to-severe OSA.  A family of clinical markers including heart rate (HR), blood pressure (BP), cardiac index (CI), stroke volume index (SVI), total peripheral resistance (TPR), and oxygen uptake (VO2) were assessed in this study.  A second objective was to explore differences in hemodynamic function at rest and during graded exercise in OSA patients versus control subjects matched for age and body mass index (BMI).  A final objective was to evaluate the extent that treatment with nCPAP alone, or combined with a moderate aerobic exercise training program impacted markers of hemodynamic function (results not reported here).  Methods: Eleven newly diagnosed OSA patients [5 male, 6 female; age: 46.5 + 12.0 yrs; respiratory disturbance index (RDI) = 30.2 + 15.0] and 10 apparently healthy control subjects (4 male, 6 female; age: 39.8 + 6.9 yrs) completed daytime resting measurements of heart rate variability (HRV) and blood pressure (BP); and underwent a maximal cycle ergometer exercise test at baseline and 6 wk post-treatment initiation.  Pearson product moment correlations were calculated between PSG markers of sleep function and: (1) daytime measures of HRV; (2) BP; and (3) submaximal and peak exercise measures of hemodynamic function.  Independent t tests were used to explore differences between OSA patients and controls. Results: Stage 1 sleep duration was significantly related to daytime SBP (r = 0.69; P < 0.05) and MAP (r = 0.72; P < 0.05). Daytime MAP (P = 0.01) and DBP (P = 0.02) were significantly different between groups.  Exercise testing yielded the following results: RDI was significantly related to HR at 60 watts (r = -0.70; P = 0.02) and 100 watts (r = -0.69; P = 02); stage 2 sleep duration was inversely related to CI at 60 (r = -0.76; P = 0.03) and 100 watts.  In addition, stage 1 sleep duration was significantly correlated with TPR at 60 watts (r = 0.70; P = 0.06) and 100 watts (r = 0.71; P = 0.05).  At peak exercise, a significant relationship was noted between peak HR and stage 2 sleep duration (r = -0.73; P = 0.02); and RDI (r = -0.66; P = 0.03).  Furthermore, relative VO2pk was positively correlated to REM sleep duration (r = 0.62; P = 0.04).  Conclusions:  Distinct patterns exist in measures of daytime HRV and BP may provide physicians unique and clinically useful information. In addition, peak exercise capacity is reduced in the OSA patient and may be related to a blunted HR response to graded exercise.",
  "description_provenance": [
    "Author Email: akaleth@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: wgherb@vt.edu",
    "Advisor Email: jgregg@vt.edu",
    "Advisor Email: snrichar@vt.edu",
    "Advisor Email: donsleep@msn.com",
    "Made available in DSpace on 2014-03-14T20:14:15Z (GMT). No. of bitstreams: 1 Kaleth_AS_Dissertation.pdf: 5556832 bytes, checksum: dcb889b24b769be567e8a551db38b5cc (MD5)   Previous issue date: 2002-07-22"
  ],
  "handle": "28378",
  "identifier_other": "etd-07242002-111117",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07242002-111117/",
  "identifier_uri": "http://hdl.handle.net/10919/28378",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kaleth_AS_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hypertension",
    "exercise testing",
    "sleep apnea",
    "heart rate variability"
  ],
  "title": "Aerobic Exercise Training and Nasal CPAP Therapy: Adaptations in Cardiovascular Function in Patients with Obstructive Sleep Apnea",
  "type": "Dissertation"
}