{
  "contributor_author": "Chen, Wei",
  "contributor_committeecochair": [
    "Daniel E. Kauffman",
    "Daniel B. Taylor"
  ],
  "contributor_committeemember": [
    "Muhammad, Andrew",
    "Everett B. Peterson",
    "Mary A. Marchant"
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:14:13Z",
  "date_adate": "2009-08-07",
  "date_available": "2014-03-14T20:14:13Z",
  "date_issued": "2009-07-09",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-07-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation contains three papers from two projects. The first two papers (Chapter Two and Chapter Three) are from a project entitled â  Managing Flounder Openings for Maximum Revenue.â   The objective of this project is to (1) estimate the monthly dockside price of summer flounder and identify seasonality in this price; and (2) set up a mathematical programming model to maximize the landing revenue by allocating the federal government quota on summer flounder across twelve months.  <p> In the first paper (Chapter Two), various forms of inverse demand equations are used to estimate the dockside price of summer flounder. These models are evaluated based on their out-of-sample forecasting performance. A structural functional form is selected. In the second paper (Chapter Three), the selected price equation for summer flounder is applied into a revenue maximization model with both the federal government quota constraint and biological constraints from twelve months. The model is solved using CONPOT Solver of GAMS 21.5. The results of the scenarios indicate that the industry should move the landing effort from the period of October â   February to the period of March â   August. Comparing with historical data, this method can increase $44.73 million for the industry of landing summer flounder from 1991 to 2005. <p> The third paper (Chapter Four) investigates how Chinaâ  s soybean import prices and domestic prices of soybeans and soybean products affect Chinaâ  s soybean imports. Since 2000, soybeans have been the U.S. leading agricultural exports for bulk commodities. China is the largest importer of U.S. soybean exports. For Chinaâ  s soybean crushing industry, imported soybeans are inputs rather than final products and used to produce soybean meal and oil. A differential production model, which is derived from a two-stage profit maximization model in producer theory, is adopted in this research. Estimates are used to calculate conditional and unconditional price elasticities for Chinaâ  s soybean imports from its major source countries â   the United States, Argentina, and Brazil. In addition, the Divisia index and unconditional output price elasticities are obtained for Chinaâ  s soybean imports. Estimation results support the hypothesis that Chinaâ  s soybean imports are determined by its domestic demand for soybean meal, rather than soybean oil. This implies that U.S. agribusinesses should pay attention to the dominant role of Chinaâ  s demand for soybean meal and animal feed. U.S. agribusinesses can also use results in this research to evaluate how Chinaâ  s soybean imports from different source countries will change when either international market prices or Chinaâ  s domestic market prices change.",
  "description_provenance": [
    "Author Email: chenw@vt.edu",
    "Advisor Email: muhammad@agecon.msstate.edu",
    "Advisor Email: petrsone@vt.edu",
    "Advisor Email: mmarchan@vt.edu",
    "Advisor Email: dkauffma@vt.edu",
    "Advisor Email: taylord@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:13Z (GMT). No. of bitstreams: 1 WeiChenFinal2.pdf: 5081442 bytes, checksum: 9f9aacff1c0a1d2aaf7e8f961d51607f (MD5)   Previous issue date: 2009-07-09"
  ],
  "handle": "28370",
  "identifier_other": "etd-07232009-085435",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07232009-085435/",
  "identifier_uri": "http://hdl.handle.net/10919/28370",
  "publisher": "Virginia Tech",
  "relation_haspart": "WeiChenFinal2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "revenue maximization",
    "inverse demand",
    "summer flounder",
    "differential production model",
    "Chinaâ  s soybean imports"
  ],
  "title": "Three Essays on Price Analysis of Summer Flounder and China's Soybean Imports",
  "type": "Dissertation"
}