{
  "contributor_author": "Lawwill, Kenneth Stuart",
  "contributor_committeecochair": [
    "Niles, Jerome A.",
    "Teates, Thomas G."
  ],
  "contributor_committeemember": [
    "Bentley, Michael",
    "Long, Dale",
    "Magliaro, Susan G.",
    "Dodi, Norman R."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:14:14Z",
  "date_adate": "1999-07-30",
  "date_available": "2014-03-14T20:14:14Z",
  "date_issued": "1999-04-01",
  "date_rdate": "2000-07-30",
  "date_sdate": "1999-07-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Writing-to-learn strategies have been well documented in the promotion of student learning (Poirrier, 1997c). Less is known about how teachers come to use these strategies in every day instruction. This study is a description of the experiences of one science teacher at a large suburban high school who shared writing-to-learn strategies with his department to promote the use of these strategies in daily instruction of his colleagues. The strategies involved 1) improving reading comprehension using paraphrasing, 2) activating prior knowledge using generic questions: who, what, where, when, why, & how, and 3) writing before and after other classroom activities to activate prior knowledge and then better integrate new information. The strategies were shared during informal meetings at lunch. Participation was voluntary. Of the eighteen faculty members, four chose to implement the strategies on a longer-term basis. Follow-up analysis in subsequent years, showed that the strategies were still in use and that the colleagues who used the strategies had passed them on to newly inducted members of the department. Results were discussed with regards to how teachers acquire or decline the incorporation of new teaching ideas in the normal course of their work in collegial settings.",
  "description_provenance": [
    "Author Email: klaw@fc.fcps.k12.va.us",
    "Advisor Email: mbentley@vt.edu",
    "Advisor Email: Niles@vt.edu",
    "Advisor Email: Teates@vt.edu",
    "Advisor Email: Dlong@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: Ndodl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:14Z (GMT). No. of bitstreams: 1 pdf.pdf: 291615 bytes, checksum: 5869d6365f87932724ec119830697df5 (MD5)   Previous issue date: 1999-04-01"
  ],
  "handle": "28374",
  "identifier_other": "etd-072399-183948",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-072399-183948/",
  "identifier_uri": "http://hdl.handle.net/10919/28374",
  "publisher": "Virginia Tech",
  "relation_haspart": "pdf.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Science Education",
    "Collaboration",
    "Writing-to-learn strategies",
    "Professional Development"
  ],
  "title": "Using Writing-To-Learn Strategies: Promoting Peer Collaboration Among High School Science Teachers",
  "type": "Dissertation"
}