{
  "contributor_author": "Gómez,  Jesús  Emilio",
  "contributor_committeechair": "Filz, George M.",
  "contributor_committeemember": [
    "Kapania, Rakesh K.",
    "Duncan, James Michael",
    "Martin, James R. II",
    "Brandon, Thomas L."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:14:14Z",
  "date_adate": "2000-07-27",
  "date_available": "2014-03-14T20:14:14Z",
  "date_issued": "2000-07-19",
  "date_rdate": "2001-07-27",
  "date_sdate": "2000-07-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Development of an Extended Hyperbolic Model for Concrete-to-Soil Interfaces  by Jesús E. Gómez Dr. George M. Filz, Chairman Via Department of Civil Engineering  ABSTRACT  Placement and compaction of the backfill behind an earth retaining wall may induce a vertical shear force at the soil-to-wall interface. This vertical shear force, or downdrag, is beneficial for the stability of the structure. A significant reduction in construction costs may result if the downdrag is accounted for during design. This potential reduction in costs is particularly interesting in the case of U.S. Army Corps of Engineers lock walls. A simplified procedure is available in the literature for estimating the downdrag force developed at the wall-backfill interface during backfilling of a retaining wall. However, finite element analyses of typical U.S. Army Corps of Engineers lock walls have shown that the magnitude of the downdrag force may decrease during operation of the lock with a rise in the water table in the backfill. They have also shown that pre- and post-construction stress paths followed by interface elements often involve simultaneous changes in shear and normal stresses and unloading-reloading. The hyperbolic formulation for interfaces (Clough and Duncan 1971) is accurate for modeling the interface response in the primary loading stage under constant normal stress. However, it has not been extended to model simultaneous changes in shear and normal stresses or unloading-reloading of the interface. The purpose of this research was to develop an interface model capable of giving accurate predictions of the interface response under field loading conditions, and to implement this model in a finite element program. In order to develop the necessary experimental data, a series of tests were performed on interfaces between concrete and two different types of sand. The tests included initial loading, staged shear, unloading-reloading, and shearing along complex stress paths. An extended hyperbolic model for interfaces was developed based on the results of the tests. The model is based on Clough and Duncan (1971) hyperbolic formulation, which has been extended to model the interface response to a variety of stress paths. Comparisons between model calculations and tests results showed that the model provides accurate estimates of the response of interfaces along complex stress paths. The extended hyperbolic model was implemented in the finite element program SOILSTRUCT-ALPHA, used by the U.S. Army Corps of Engineers for analyses of lock walls.  A pilot-scale test was performed in the Instrumented Retaining Wall (IRW) at Virginia Tech that simulated construction and operation of a lock wall. SOILSTRUCT-ALPHA analyses of the IRW provided accurate estimates of the downdrag magnitude throughout inundation of the backfill. It is concluded that the extended hyperbolic model as implemented in SOILSTRUCT-ALPHA is adequate for routine analyses of lock walls.",
  "description_provenance": [
    "Author Email: jgomez@vt.edu",
    "Advisor Email: rkapania@vt.edu",
    "Advisor Email: filz@vt.edu",
    "Advisor Email: jmd@vt.edu",
    "Advisor Email: jrm@vt.edu",
    "Advisor Email: tbrandon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:14Z (GMT). No. of bitstreams: 17 AppendixD.pdf: 176222 bytes, checksum: 9a244f3200343dc6293ab6a26c89ad2b (MD5) AppendixC.pdf: 649478 bytes, checksum: 2c504b578ff119443491865a9ef401fb (MD5) AppendixB.pdf: 436512 bytes, checksum: f1a1dac87d0a674c358ea8523136f358 (MD5) 07chapter4.pdf: 2265718 bytes, checksum: bb7b53f2d862472b125c5fa42c777760 (MD5) AppendixA.pdf: 139151 bytes, checksum: 54685833b679949fd41cfcb5dd63bbb6 (MD5) AppendixE.pdf: 128561 bytes, checksum: aff2ee78eef77e0f2b6377d76a82a65b (MD5) 02abstract.pdf: 6969 bytes, checksum: a77d4b42b5387eff33c6b1f07fd4a127 (MD5) 04chapter1.pdf: 90212 bytes, checksum: 72fae77820a4baf0bae98dff61368f2b (MD5) 05chapter2.pdf: 216650 bytes, checksum: eb8b3e2f4a61223cc00b2c6247d91f89 (MD5) 10referen.pdf: 23299 bytes, checksum: a5e8adcf1a21168c2f56ec1e478c5eff (MD5) 01TITLE.pdf: 4714 bytes, checksum: 6703931b469c8a2b325854f89ebec322 (MD5) 06chapter3.pdf: 1850952 bytes, checksum: 62675fde92689dcc5b8c10ba2d94d468 (MD5) AppendixF.pdf: 22622 bytes, checksum: 7e33f7a2fbc6fcf140cf2b00e24e70bb (MD5) VITA.pdf: 4724 bytes, checksum: bef7f9dd09db5486d39fbd1fa5d8de1b (MD5) 08chapter5.pdf: 683482 bytes, checksum: 04ad1e722b065de573e8150e854cdb02 (MD5) 03contents.pdf: 59978 bytes, checksum: 6c4adabf4a88a75b81401b4830bb6deb (MD5) 09chapter6.pdf: 34834 bytes, checksum: 20fdf39afdf87e6553de51d565b10191 (MD5)   Previous issue date: 2000-07-19"
  ],
  "handle": "28375",
  "identifier_other": "etd-07242000-15060006",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07242000-15060006/",
  "identifier_uri": "http://hdl.handle.net/10919/28375",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "AppendixD.pdf",
    "AppendixC.pdf",
    "AppendixB.pdf",
    "07chapter4.pdf",
    "AppendixA.pdf",
    "AppendixE.pdf",
    "02abstract.pdf",
    "04chapter1.pdf",
    "05chapter2.pdf",
    "10referen.pdf",
    "01TITLE.pdf",
    "06chapter3.pdf",
    "AppendixF.pdf",
    "VITA.pdf",
    "08chapter5.pdf",
    "03contents.pdf",
    "09chapter6.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "interface element",
    "backfill inundation",
    "unloading-reloading",
    "data normalization",
    "hyperbolic parameter",
    "concrete",
    "yield surface",
    "staged shear",
    "interface model",
    "hydrocompression",
    "interface testing",
    "sand",
    "yielding"
  ],
  "title": "Development of an extended hyperbolic model for concrete-to-soil interfaces",
  "type": "Dissertation"
}