{
  "contributor_author": "Carter, Rebecca Ann",
  "contributor_committeechair": "Geor, Raymond J.",
  "contributor_committeemember": [
    "Staniar, William Burton",
    "Rankin, Janet L. Walberg",
    "McCutcheon, L. Jill",
    "Ordakowski-Burk, Amy L.",
    "Frank, Nicholas"
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:14:16Z",
  "date_adate": "2008-08-14",
  "date_available": "2014-03-14T20:14:16Z",
  "date_issued": "2008-07-18",
  "date_rdate": "2009-08-14",
  "date_sdate": "2008-07-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The present studies were conducted to determine the effects of obesity on insulin resistance, inflammatory state and risk for laminitis, and the effectiveness of exercise training to reduce obesity and insulin resistance in equids. Practical methods of assessing adiposity were developed and verified, including a condition scoring system for neck crest adiposity and morphometric measurements for generalized (girth:height) and localized (neck circumference:height) adiposity. Evaluation of 74 and 57 pony mares in March of two consecutive years resulted in the identification of predictive tests for incipient pasture-associated laminitis, including hyperinsulinemia (> 32 mU/L), hyperleptinemia (> 7.3 ng/mL), and generalized (body condition score â ¥ 7) and localized (cresty neck score â ¥ 4) obesity. Induction of obesity in 13 Arabian geldings by 4 months of overfeeding resulted in compensated insulin resistance (minimal model analysis) with hyperinsulinemia and hyperleptinemia. Although lipid concentrations (nonesterified fatty acids and triglyceride) decreased on a high concentrate diet, they did not differ before and after weight gain. The resulting obesity-induced insulin resistance was accompanied by an increase in chemokine (monocyte chemoattractant protein [MCP]-1, MCP-2, interleukin [IL]-8) but not inflammatory cytokine (tumor necrosis factor [TNF]Î±, IL-1Î², IL-6) mRNA expression in subcutaneous adipose tissue. Additionally, there was a decrease in plasma TNFÎ± protein concentration with weight gain. By using 12 of the obese, insulin resistant Arabian geldings (8 exercised, 4 control) it was demonstrated that 8 weeks of moderate intensity exercise training reduced adiposity (4% reduction in body weight, 35% reduction in fat mass) without affecting glucose and insulin dynamics or plasma hormone and lipid concentrations. Collectively, these studies demonstrate the impact obesity has on metabolism and risk for laminitis in equids, and that exercise training may provide an effective countermeasure for the reduction of obesity.",
  "description_provenance": [
    "Author Email: brusso@vt.edu",
    "Advisor Email: wstaniar@psu.edu",
    "Advisor Email: jrankin@vt.edu",
    "Advisor Email: mccutch@vt.edu",
    "Advisor Email: amyburk@umd.edu",
    "Advisor Email: nfrank@utk.edu",
    "Advisor Email: rgeor@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:16Z (GMT). No. of bitstreams: 1 Carter_PhD_Dissertation_final.pdf: 792633 bytes, checksum: d506513347c96e255119fdfb1ecd25ac (MD5)   Previous issue date: 2008-07-18"
  ],
  "handle": "28382",
  "identifier_other": "etd-07242008-093620",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07242008-093620/",
  "identifier_uri": "http://hdl.handle.net/10919/28382",
  "publisher": "Virginia Tech",
  "relation_haspart": "Carter_PhD_Dissertation_final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "insulin resistance",
    "obesity",
    "inflammation",
    "exercise",
    "horse",
    "laminitis"
  ],
  "title": "Equine obesity and its role in insulin resistance, inflammation and risk for laminitis",
  "type": "Dissertation"
}