{
  "contributor_author": "Jia, Zhenquan",
  "contributor_committeechair": "Misra, Hara P.",
  "contributor_committeemember": [
    "Gregory, Eugene M.",
    "Saker, Korinn E.",
    "Klein, Bradley G.",
    "Reilly, Christopher M."
  ],
  "contributor_department": "Biomedical and Veterinary Sciences",
  "date_accessioned": "2014-03-14T20:14:15Z",
  "date_adate": "2006-09-14",
  "date_available": "2014-03-14T20:14:15Z",
  "date_issued": "2006-07-07",
  "date_rdate": "2010-10-20",
  "date_sdate": "2006-07-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Several epidemiological studies have suggested a role for environmental chemicals in the etiology of neurodegenerative diseases such as Parkinson's disease and Alzheimer's disease. Endosulfan (an organochlorine) and zineb (zinc-ethylene-bis-dithiocarbamate) are used as pesticides on a variety of crops worldwide and pose potential health risks to humans and animals. Both endosulfan and zineb are known to affect nervous system. Because the dopaminergic system continues to develop postnatally, we hypothesized that developmental exposure to endosulfan or zineb alone or in combination would result in alteration of nigrostrial neurotransmitters and would render the nigrostrial dopamine system more susceptible to chemical challenge later in life. The objectives of this study were (1) to determine the effects of endosulfan and zineb individually and in combination on dopaminergic or cholinergic pathways in vivo, (2) to investigate the effects of exposure to endosulfan, zineb and their mixtures administered in early life (during brain development) on subsequent exposure to these pesticides on the dopaminergic and cholinergic systems,  in vivo, (3) to investigate the mechanism(s) of induction of neuronal cell death caused by these pesticides using human neuroblastoma SH-SY5Y cells in culture, (4) to define the role of oxidative stress in pesticide-induced neuronal cell death in vitro. Male C57Bl/6 mice of 7-9 months old exposed to zineb (50 and 100 mg/kg), endosulfan (1.55, 3.1 and 6.2 mg/kg) and their mixtures every other day over a 2-week period exhibited higher levels of dopamine accumulation in the striatum. Both pesticide-treated groups displayed significantly lower norepinephrine levels in the striatum (Ï  â ¤ 0.05) than the controls. The developmental exposure to zineb, endosulfan and their combination enhanced the vulnerability to subsequent neurotoxic challenges occurring later in life. Thus, C57BL/6 mice exposed to zineb, endosulfan and their mixtures as juveniles (postnatal days 5 to 19) and re-exposed at 8 months of age showed a significant depletion of striatal dopamine, to 22%, 16%, and 35% of control, respectively. Acetylcholinesterase activity in the cerebral cortex was found to be significantly increased in all pesticide treated groups. Mice given mixtures of pesticides also showed significantly increased levels of normal and aggregated alpha-synuclein, a hallmark of neurodegenerative diseases such as Parkinson's disease and Alzheimer's disease. The results of these studies indicate that exposure to these pesticides as neonates and re-exposure as adults could result in neurochemical changes that did not reveal at adulthood when the exposure was at juvenile age only.  <p> We further investigated the mechanism(s) of activation of pesticide-induced neuronal cell death in vitro. The characteristic of cell death in SH-SY5Y human neuroblastoma cells was examined. These cells are known to retain catecholaminergic phenotype. Cells were exposed to endosulfan, zineb and mixtures of two pesticides, in concentrations ranging from 50 &#956;M to 400 &#956;M. These exposures caused both apoptotic and necrotic cell death in SH-SY5Y cells as evaluated by lactate dehydrogenase release, 7-aminoactinomycin-D and Annexin-V/PI assays. Exposure to mixtures of the pesticides enhanced both the early apoptosis and late apoptosis/necrosis compared to either chemical alone. Visual evaluation using DNA ladder assay and fluorescence Annexin V/PI assay confirmed the contribution of both apoptotic and necrotic events. Furthermore, endosulfan and zineb alone and in combination altered the caspase-3 activity indicating that both pesticides exposure exert their apoptotic effect via the caspase-3 pathway. Because there has been increasing evidence of the role of reactive oxygen species (ROS) and oxidative stress in pesticide-induced neuronal cell death (apoptosis and necrosis), the levels of ROS and antioxidant enzymes were examined. Cells treated with pesticides were found to enhance the generation of superoxide anion and hydrogen peroxide both in a dose- and time-dependent manner. Mixture of pesticides significantly enhanced the production of these reactive oxygen species compared to cells exposed to individual pesticide. Cells treated with pesticides showed a decrease in superoxide dismutase, glutathione peroxidase, and catalase levels. These pesticides also induced lipid peroxides (thiobarbituric acid reactive products) formation in SH-SY5Y cells. Furthermore, cells exposed to these pesticides were found to have increased in the expression of NFkappaB activity in the nucleus. These data support the hypothesis that oxidative stress was induced in neuronal cells by exposing to these pesticides in vitro.   <p> Taken together, the results of this study support the above hypothesis and suggest that the cytotoxicity of endosulfan and zineb and their combinations may, at least in part, be associated with the generation of ROS. Furthermore, mice exposed at early age and re-exposed at adulthood become more susceptible to alteration of neurotransmitter levels compared to mice exposed to these pesticides only as juveniles. These findings could add to the growing body of knowledge on the mechanism of pesticide-induced dopaminergic neuronal cell death and could hold tremendous implication for the future understanding of the possible involvement of environmental risk factors in the pathogenesis of Parkinson's disease.",
  "description_provenance": [
    "Author Email: zjia@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Advisor Email: kesaker@vt.edu",
    "Advisor Email: bklein@vt.edu",
    "Advisor Email: creilly@vcom.vt.edu",
    "Advisor Email: hmisra@vcom.vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:15Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 1426707 bytes, checksum: 6c81a4d572cd4e2c8e7f29fbb141c453 (MD5)   Previous issue date: 2006-07-07"
  ],
  "handle": "28381",
  "identifier_other": "etd-07242006-230754",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07242006-230754/",
  "identifier_uri": "http://hdl.handle.net/10919/28381",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "zineb",
    "antioxidants",
    "oxidative stress",
    "endosulfan",
    "necrosis",
    "pesticide mixtures",
    "neurotoxicity",
    "apoptosis"
  ],
  "title": "Pesticides and Pesticide Mixtures Induce Neurotoxicity: Potentiation of Apoptosis and Oxidative Stress",
  "type": "Dissertation"
}