{
  "contributor_author": "Macabuac, Maria Cecilia Fiel",
  "contributor_committeechair": "Dunaway, Wilma A.",
  "contributor_committeecochair": "Wimberley, Dale W.",
  "contributor_committeemember": [
    "Harris, Colette",
    "Bailey, Carol A.",
    "Ballweg, John A."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:14:15Z",
  "date_adate": "2005-07-29",
  "date_available": "2014-03-14T20:14:15Z",
  "date_issued": "2005-07-15",
  "date_rdate": "2005-07-29",
  "date_sdate": "2005-07-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "﻿The Philippines is a food extractive enclave in the bust stage of export-oriented aquaculture, and this globalization agenda has had several negative impacts. Aquaculture has not expanded fish and marine foods but threatens national food security by integrating Philippine aquatic resources into the globalized food chain. Following structural adjustment policies imposed beginning in the 1980s, the Philippines shipped massive levels of animal protein to world markets, but this country has grown less food self-sufficient. During the decades that shrimp aquaculture has boomed and busted in the Philippines, the living conditions of Filipino families have steadily worsened. This study of three Panguil Bay fishing communities of Northern Mindanao demonstrates that the survival of subsistent artisan fisher households is now threatened because export-oriented producers have severely degraded the ecosystem upon which they rely. Moreover, women and children are inequitably threatened by the ecological and economic changes that have accompanied the Philippine global aquaculture agenda. In reality, capitalist commodity chains of export-oriented aquaculture externalize to households and to nature much of the true cost of producers and of ecological degradation. As a result, malnourished and impoverished Philippine fishing households subsidize global aquaculture commodity chains. While Filipino fisher households can no longer afford local food costs, their hidden inputs into capitalist commodity chains keep prices of luxury seafoods cheap in rich core countries.",
  "description_provenance": [
    "Author Email: mcfm@vt.edu, macecilia_macabuac@yahoo.com",
    "Advisor Email: coharris@vt.edu",
    "Advisor Email: wdunaway@vt.edu",
    "Advisor Email: dale.wimberley@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: jballweg@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:15Z (GMT). No. of bitstreams: 6 05Bib.pdf: 115811 bytes, checksum: 50216cfa27e35055b53b060b3add6c99 (MD5) 03Ch123.pdf: 243141 bytes, checksum: 28af1f4bdeb515c80019972c2f27bdcb (MD5) 02Intro.pdf: 57740 bytes, checksum: cb502b862f214a5b1967e1bd5ecaf48b (MD5) 01frontpages.pdf: 56606 bytes, checksum: 29218260f4c51bea46f841e1a2f8d5d3 (MD5) 04Ch456.pdf: 371910 bytes, checksum: 858fe944a4fa3d89a5150e8dbfca8ab2 (MD5) 06Appendices.pdf: 116656 bytes, checksum: 4f57cedfc00e55dc89505e66d6f7fbf4 (MD5)   Previous issue date: 2005-07-15"
  ],
  "handle": "28380",
  "identifier_other": "etd-07242005-083742",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07242005-083742/",
  "identifier_uri": "http://hdl.handle.net/10919/28380",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "05Bib.pdf",
    "03Ch123.pdf",
    "02Intro.pdf",
    "01frontpages.pdf",
    "04Ch456.pdf",
    "06Appendices.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fishing household",
    "coastal degradation",
    "global food chain",
    "food extractive enclave",
    "subsistence",
    "export aquaculture"
  ],
  "title": "After the Aquaculture Bust: Impacts of the Globalized Food Chain on Poor Philippine Fishing Households",
  "type": "Dissertation"
}