{
  "contributor_author": "Bhattacharjee, Suchismita",
  "contributor_committeechair": "Reichard, Georg",
  "contributor_committeemember": [
    "Beliveau, Yvan J.",
    "Pearce, Annie R.",
    "McCoy, Andrew P."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:14:16Z",
  "date_adate": "2010-08-17",
  "date_available": "2014-03-14T20:14:16Z",
  "date_issued": "2010-07-22",
  "date_rdate": "2012-05-08",
  "date_sdate": "2010-07-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Energy conservation and implementation of effective energy efficiency policies have become imperative to curbing the escalating consumption of energy. The imbalance in the supply and demand of a country창  s energy has increased the importance of implementing energy efficiency policies. Proper replication of strategic energy efficiency policies that are known to be successful in one country, along with development of new approaches, can be helpful in developing the energy policy portfolio of another country. Some OECD (Organization of Economic Cooperation and Development) countries like Denmark, Finland, France, Germany, Italy, the United Kingdom and the United States have benefited from their energy policies during the most recent energy crisis. The motivation of this research is to provide a tool for developing countries, which are still in the stage of formulating their energy efficiency policies, to compare energy efficiency policy portfolios across countries. These countries can improve their energy efficiency policy portfolios based on lessons learned from the developed countries. <p> The research develops a framework to compare energy efficiency policy portfolios across countries / states. Although this framework can be adopted for any type of energy policy, targeting any sector with few modifications, the current focus is on policies that target the residential building sector to reduce energy consumption. The research begins with identification of the functional domains that influence human behavior창  people, economy, environment and technology창  followed by identification of the factors affecting household energy consumption. It uses the four functional domains as the evaluation framework창  s four axes. The various factors affecting household energy consumption are positioned in the framework based on association with the functional domains. The energy efficiency policies implemented in a country are positioned in the same framework based on the pattern of diffusion of each type of policy. In addition, a prototype method is developed to identify the factors targeted by each energy efficiency policy implemented in a country. This evaluation method allows for a uniform assessment process of how energy efficiency policies target specific socio-economic factors that are known to affect energy consumption. The proposed framework will facilitate the work of policy makers and other decision makers with a powerful tool for evaluating and comparing their individual policies, or their complete portfolio of energy efficiency policies, to those from other states or countries, and to benefit from the lessons learned.",
  "description_provenance": [
    "Author Email: sbhatta@vt.edu",
    "Advisor Email: yvan@vt.edu",
    "Advisor Email: apearce@vt.edu",
    "Advisor Email: apmccoy@vt.edu",
    "Advisor Email: reichard@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:16Z (GMT). No. of bitstreams: 1 Bhattacharjee_Suchismita_D_2010.pdf: 3622288 bytes, checksum: d9a5a6ab333d2a3377da1d8c5c01c7b6 (MD5)   Previous issue date: 2010-07-22"
  ],
  "handle": "28386",
  "identifier_other": "etd-07242010-034910",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07242010-034910/",
  "identifier_uri": "http://hdl.handle.net/10919/28386",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bhattacharjee_Suchismita_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Energy Efficiency Policy Evaluation",
    "Energy Efficiency Policies",
    "Energy Efficiency",
    "Energy Consumption Factor"
  ],
  "title": "Analytical Framework to Study Energy Efficiency Policy Portfolios across Countries/States",
  "type": "Dissertation"
}