{
  "contributor_author": "Levi Altstaedter, Laura",
  "contributor_committeechair": "Judith Shrum",
  "contributor_committeemember": [
    "Janell Watson",
    "Tilley-Lubbs, Gresilda A.",
    "Peter Doolittle"
  ],
  "contributor_department": "Curriculum and Instruction - Second Language Education",
  "date_accessioned": "2014-03-14T20:14:16Z",
  "date_adate": "2009-08-19",
  "date_available": "2014-03-14T20:14:16Z",
  "date_issued": "2009-07-10",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-07-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Grounded in sociocultural theory, peer feedback can help students engage in interaction and negotiation of meaning, which serve as a basis for the construction of knowledge (Vygotsky, 1978). It can also contribute to the development of self-regulation, as well as of reflection on one's own learning (Doolittle & Hicks, 2003). Its strategic incorporation into foreign language instruction can help students use the language they are in the process of acquiring to mediate language acquisition (Shrum & Glisan, 2005). <p> Research shows that peer feedback can help students develop and advance their Zone of Proximal Development through their engagement in collaborative interaction with their peers (De Guerrero & Villamil, 1994, 2000; Donato, 2004; Lantolf, 2004; Lantolf & Thorne, 2006; Liu & Hansen, 2005). Peer feedback can also help students improve their writing proficiency, including organization of their texts and awareness of the mechanics of the language necessary for successful communication of the intended message (Kinsler, 1990; Hu, 2005; Williams, 2005). <p> Framed within a sociocultural perspective on foreign language learning and development, and following a manuscript approach, this dissertation consists of a series of studies that aim to explore: (a) whether participation in a peer feedback experience has a positive impact on studentsâ   foreign language writing proficiency; (b) whether guidelines plus training in how to provide meaningful feedback have a different impact on studentsâ   foreign language writing proficiency than guidelines alone; (c) around what themes students focus the feedback they provide to their peers; and (d) what studentsâ   perceptions of the peer feedback experience are. <p>The results of the first the study, which consisted of a pre-test post-test quasi-experimental design, showed that students significantly improved their writing proficiency after participating in a peer feedback experience, regardless of training. Further the results of this study indicated that, on average, trained and untrained students provided written peer feedback focused mainly on global aspects rather than local aspects. The results of the second study, which consisted of a mixed methods approach, showed that, on average, students had high perceptions of the peer feedback experience and that they perceived that their partnerâ  s feedback had helped them improve the global aspects of their composition more than the local aspects. Students expressed that what they liked the most about the experience was getting a different perspective on their writing, and what they liked the least was that they felt they were not proficient enough in the foreign language to provide meaningful feedback to their peers.",
  "description_provenance": [
    "Author Email: laualt@vt.edu",
    "Advisor Email: rjwatson@vt.edu",
    "Advisor Email: glubbs@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: jshrum@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:16Z (GMT). No. of bitstreams: 1 ETD_Laura_Levi_Altstaedter.pdf: 692158 bytes, checksum: 7780d0d1c001a0c26a7fd5169f131eba (MD5)   Previous issue date: 2009-07-10"
  ],
  "handle": "28384",
  "identifier_other": "etd-07242009-005233",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07242009-005233/",
  "identifier_uri": "http://hdl.handle.net/10919/28384",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD_Laura_Levi_Altstaedter.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "peer feedback",
    "sociocultural theory",
    "quasi-experimental research",
    "mixed methods research",
    "foreign language writing"
  ],
  "title": "Writing Instruction in Foreign Language Courses: Multiple Perspectives on the Impact of Peer Feedback on Studentsâ   Writing Proficiency",
  "type": "Dissertation"
}