{
  "contributor_author": "Thompson, Michael Shane",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "Yee, Gordon T.",
    "Long, Timothy E.",
    "McGrath, James E.",
    "Davis, Richey M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:14:18Z",
  "date_adate": "2007-08-07",
  "date_available": "2014-03-14T20:14:18Z",
  "date_issued": "2007-07-10",
  "date_rdate": "2007-08-07",
  "date_sdate": "2007-07-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Amphiphilic tri- and penta-block copolymers containing a polyurethane central block with pendant carboxylic acid groups flanked by hydroxyl functional polyether tails were synthesized.  Our intention was to investigate the activities of these copolymers as dispersants for magnetite nanoparticles in biological media.  A benzyl alkoxide initiator was utilized to prepare poly(ethylene oxide) (BzO-PEO-OH), poly(propylene oxide) (BzO-PPO-OH) and poly(ethylene oxide-b-propylene oxide) (poly(BzO-EO-b-PO-OH)) oligomeric tail blocks with varying lengths of PEO and PPO.  The oligomers had a hydroxyl group at the terminal chain end and a benzyl-protected hydroxyl group at the initiated end.  The polyether oligomers were incorporated into a block copolymer with a short polyurethane segment having approximately three carboxylic acid groups per chain.  The block co-polyurethane was then hydrogenated to remove the benzyl group and yield primary hydroxyl functionality at the chain ends.  End group analysis by 1H NMR showed the targeted ratio of PEO to PPO demonstrating control over block copolymer composition. Number average molecular weights determined by both 1H NMR and GPC were in agreement and close to targeted values demonstrating control over molecular weight.  Titrations of the pentablock copolymers showed that the targeted value of approximately three carboxylic acid groups per chain was achieved. Heterobifunctional poly(ethylene oxide) (PEO) and poly(ethylene oxide-b-propylene oxide) (PEO-b-PPO) copolymers were synthesized utilizing heterobifunctional initiators to yield polymers having a hydroxyl group at one chain end and additional moieties at the other chain end. For PEO homopolymers, these moieties include maleimide, vinylsilane, and carboxylic acid functional groups.  Heterobifunctional PEO oligomers with a maliemide end group were synthesized utilizing a double metal cyanide coordination catalyst to avoid side reactions that occur with a basic catalyst.  PEO oligomers with vinylsilane end groups were synthesized via alkoxide-initiated living ring-opening polymerization, and this produced polymers with narrow molecular weight distributions.  Heterobifunctional PEO-b-PPO block copolymers were synthesized in two steps where the double metal cyanide catalyst was used to polymerize propylene oxide (PO) initiated by 3-hydroxypropyltrivinylsilane.  The PPO was then utilized as a macroinitiator to polymerize ethylene oxide (EO) with base catalysis.  Heterobifunctional PEO and PEO-b-PPO block copolymers possessing carboxylic acid functional groups on one end were synthesized by reacting the vinyl groups with mercaptoacetic acid via an ene-thiol addition.",
  "description_provenance": [
    "Author Email: mithomp1@vt.edu",
    "Advisor Email: gyee@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: McGrathJim@aol.com",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:18Z (GMT). No. of bitstreams: 1 Shane_Dissertation8-1.pdf: 1248708 bytes, checksum: 11acd17d8624cf52d292ea7910038b45 (MD5)   Previous issue date: 2007-07-10"
  ],
  "handle": "28395",
  "identifier_other": "etd-07252007-221018",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07252007-221018/",
  "identifier_uri": "http://hdl.handle.net/10919/28395",
  "publisher": "Virginia Tech",
  "relation_haspart": "Shane_Dissertation8-1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "dispersion stabilizers",
    "poly(propylene oxide)",
    "Heterobifunctional",
    "(ethylene oxide)"
  ],
  "title": "Enabling Synthesis Toward the Production of Biocompatible Magnetic Nanoparticles With Tailored Surface Properties",
  "type": "Dissertation"
}