{
  "contributor_author": "Kirsch, Robert Emmanuel",
  "contributor_committeechair": "Luke, Timothy W.",
  "contributor_committeemember": [
    "Breslau, Daniel",
    "Stephens, Robert P.",
    "Lavin, Chad D."
  ],
  "contributor_department": "Alliance for Social, Political, Ethical, and Cultural Thought",
  "date_accessioned": "2014-03-14T20:14:18Z",
  "date_adate": "2012-08-10",
  "date_available": "2014-03-14T20:14:18Z",
  "date_issued": "2012-07-11",
  "date_rdate": "2013-08-10",
  "date_sdate": "2012-07-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation seeks to reengage the field of political economy to establish a political response to financial crisis, as well as the resulting social crisis of everyday life, using the political economy of Hyman P. Minsky. As an academic field, political economy is in a strange kind of limbo. The separation of politics and economics is easy enough to see, and even within economics, there is another cleavage between economics proper and the history of economics. This yields some very strange conjectures about what it means to be an â  economist,â   and how things can be a matter for either economic â  policyâ   or â  political economyâ   as if these categories were all jumbled up in a grab bag of available methodologies. This dissertation seeks to carve out some intellectual terrain in what can be called political economy by engaging in an interdisciplinary way, inspired by Minsky, in order to offer a cogent political analysis of financial crises. Minsky gives five possible definitions for political economy: the discipline of Economics, a code name for Marxism, rational choice theory of profit maximization, the management of macroeconomic policy, and finally an interdisciplinary view of political economy that works in concert with other social sciences and humanities in order to identify and remedy social ills such as unemployment and poverty. The reading of Minsky in this dissertation is thus in an explicitly political way in order to bridge the gap between various kinds of economics and the various social sciences. By analyzing and critiquing each of these possible definitions of political economy, it becomes clear that a properly social definition of political economy is the final, interdisciplinary one. This dissertation argues that Minsky had a â  preanalytic visionâ   of the kind of society he wished his political economy to yield, and is a first step in fleshing out a political program for that vision.",
  "description_provenance": [
    "Author Email: rekirsch@vt.edu",
    "Advisor Email: dbreslau@vt.edu",
    "Advisor Email: rosteph2@vt.edu",
    "Advisor Email: lavin@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:18Z (GMT). No. of bitstreams: 1  Kirsch_RE_D_2012.pdf: 1057141 bytes, checksum: fb74cb0ec2aff79fc2df16cdbad70e6d (MD5)    Previous issue date: 2012-07-11"
  ],
  "handle": "28396",
  "identifier_other": "etd-07252012-112214",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07252012-112214/",
  "identifier_uri": "http://hdl.handle.net/10919/28396",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kirsch_RE_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "political economy",
    "democracy",
    "crisis",
    "everyday life",
    "Minsky"
  ],
  "title": "Market Challenges to Democracy: The Political Economy of Hyman P. Minsky",
  "type": "Dissertation"
}