{
  "contributor_author": "Schilling, Mark Wesley",
  "contributor_committeechair": "Marriott, Norman G.",
  "contributor_committeemember": [
    "Alvarado, Christine Z.",
    "Duncan, Susan E.",
    "Wang, Hengjian",
    "Anderson-Cook, Christine M.",
    "Acton, James C."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:14:17Z",
  "date_adate": "2002-08-16",
  "date_available": "2014-03-14T20:14:17Z",
  "date_issued": "2002-07-12",
  "date_rdate": "2003-08-16",
  "date_sdate": "2002-07-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Boneless cured pork was produced from combinations of pale, soft, and exudative (PSE) and red, firm, and non-exudative (RFN) semimembranosus muscle differing in amount of modified food starch (MFS), sodium caseinate (SC), and soy protein concentrate (SPC).  Response Surface Methodology was utilized to determine the effects of these adjuncts on water holding capacity, color, and texture.  Both RFN pork and PSE pork were selected based on visual color for the following five treatments for processing: 100 % PSE, 75% PSE +25 % RFN, 50 % PSE+ 50 % RFN, 25 % PSE +75 % RFN, and 100 % RFN.  Fifteen ingredient combinations for each PSE and RFN treatment combination yielded 75 treatments per replication.  Three replications of each treatment were completed.  Chemical composition and color of raw materials also were measured and used as covariates to determine their effect on the above-mentioned responses.         Utilization of SC decreased (p<0.05) cooking loss, lightness, and cohesiveness.  SPC incorporation decreased (p<0.05) cooking loss, cohesiveness, and redness, and MFS inclusion decreased (p<0.05) expressible moisture and cohesiveness.  Utilization of SC and MFS increased (p<0.05) redness and SPC incorporation increased (p<0.05) yellowness.  Results indicated that combining soy protein concentrate and modified food starch together in formulations demonstrated the greatest potential of these adjuncts to improve water binding, color, and texture in pale, soft, and exudative pork.  Utilization of combinations of these adjuncts demonstrates potential to improve protein functionality in PSE as well as RFN pork. This research also demonstrated that diluting RFN pork with no more than 25 % PSE pork allows the formation of a high quality boneless deli ham roll.",
  "description_provenance": [
    "Author Email: mschilli@vt.edu",
    "Advisor Email: alvarado@vt.edu",
    "Advisor Email: duncans@vt.edu",
    "Advisor Email: hewang@vt.edu",
    "Advisor Email: candcook@vt.edu",
    "Advisor Email: jcacton@CLEMSON.EDU",
    "Advisor Email: marriott@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:17Z (GMT). No. of bitstreams: 1 MWSetd.PDF: 460089 bytes, checksum: 5cc61fd25231e0a2a4502825d1c77651 (MD5)   Previous issue date: 2002-07-12"
  ],
  "handle": "28391",
  "identifier_other": "etd-07252002-143654",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07252002-143654/",
  "identifier_uri": "http://hdl.handle.net/10919/28391",
  "publisher": "Virginia Tech",
  "relation_haspart": "MWSetd.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "PSE; RFN; ham; functionality",
  "title": "Functional Properties of Restructured Boneless Pork Produced From Pse and Rfn Pork Utilizing Non-Meat Adjuncts",
  "type": "Dissertation"
}