{
  "contributor_author": "Luxton, Todd Peter",
  "contributor_committeechair": "Eick, Matthew J.",
  "contributor_committeemember": [
    "Zelazny, Lucian W.",
    "Hochella, Michael F. Jr.",
    "Scheckel, Kirk"
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:14:18Z",
  "date_adate": "2007-08-13",
  "date_available": "2014-03-14T20:14:18Z",
  "date_issued": "2007-07-18",
  "date_rdate": "2012-11-06",
  "date_sdate": "2007-07-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The adsorption and desorption behavior of trace element contaminants was evaluated solids-goethite and ruthenium oxide. The importance of anion displacement as a mechanism responsible for arsenic release from iron oxides was investigated on goethite. The adsorption and polymerization of silicate on goethite was examined as a function of surface concentration determine the influence of adsorbed silicate monomers and polymers on arsenite adsorption desorption. A kinetic model was employed to describe arsenite adsorption and desorption absence and presence of silicate. The potential environmental impacts of the research discussed. Hydrous and crystalline ruthenium oxides were extensively characterized traditional colloidal surface characterization techniques, dissolution experiments, and macro- spectroscopic experiments. The two ruthenium oxide phases exhibited large specific areas, a high density of reactive surface functional groups and the presence of multiple oxidation states in both solids. Enhanced dissolution of hydrous ruthenium oxide occurred presence of oxalate and ascorbate. While enhanced dissolution of the crystalline phase only in the presence of oxalate at pH 3. Results from the dissolution experiments were develop possible mechanisms for the oxalate and ascorbate promoted dissolution of ruthenium oxides. Macroscopic adsorption studies of arsenate adsorption on both ruthenium oxides examined over a broad pH (3-10) and initial solution concentration range (0.01 to Results from the adsorption studies indicate arsenate forms a stable surface complex with ruthenium oxide phases. Extended x-ray absorption fine structure spectroscopy and Pressurejump relaxation studies indicates arsenate is specifically adsorbed the ruthenium oxide Chromate adsorption on ruthenium oxides was investigated as a function of pH and chromate solution concentration. Macroscopic adsorption studies and zeta measurements suggest chromate forms an inner-sphere surface complex with both oxide X-ray absorption near edge spectroscopy data indicates chromate (Cr(VI)) is reduced chromium (Cr(III)) on the ruthenium oxide surface. Modeling of the first Cr shell indicated two oxygen backscattering distances similar to the Cr-O atomic distances reported for coordinated to Cr(VI) and Cr(III) providing additional evidence for Cr(VI) reduction.",
  "description_provenance": [
    "Author Email: tluxton@vt.edu",
    "Advisor Email: eick@vt.edu",
    "Advisor Email: zelazny@vt.edu",
    "Advisor Email: hochella@vt.edu",
    "Advisor Email: Scheckel.Kirk@epamail.epa.gov",
    "Made available in DSpace on 2014-03-14T20:14:18Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 4694558 bytes, checksum: f802f11b1012f7b8b4a1ebf01cad6327 (MD5)   Previous issue date: 2007-07-18"
  ],
  "handle": "28394",
  "identifier_other": "etd-07252007-104027",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07252007-104027/",
  "identifier_uri": "http://hdl.handle.net/10919/28394",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Solid/Solution Interface",
    "Adsorption",
    "Arsenic",
    "Chromium",
    "Spectroscopy",
    "Pressure-"
  ],
  "title": "Oxyanion Adsorption by Iron and Ruthenium Oxides: A Macroscopic, Spectroscopic, and Kinetic Investigation",
  "type": "Dissertation"
}