{
  "contributor_author": "Mattox, Wade",
  "contributor_committeechair": "Linnell, Peter A.",
  "contributor_committeemember": [
    "Thomson, James E.",
    "Floyd, William J.",
    "Haskell, Peter E."
  ],
  "contributor_department": "Mathematics",
  "date_accessioned": "2014-03-14T20:14:18Z",
  "date_adate": "2012-08-08",
  "date_available": "2014-03-14T20:14:18Z",
  "date_issued": "2012-07-17",
  "date_rdate": "2012-08-08",
  "date_sdate": "2012-07-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this paper the following conjecture is studied:  the group von Neumann algebra N(G) is a flat CG-module if and only if the group G is locally virtually cyclic.  This paper proves that if G is locally virtually cyclic, then N(G) is flat as a CG-module.  The converse is proved for the class of all elementary amenable groups without infinite locally finite subgroups.  Foundational cases for which the conjecture is shown to be true are the groups G=Z, G=ZxZ, G=Z*Z, Baumslag-Solitar groups, and some infinitely-presented variations of Baumslag-Solitar groups.  Modules other than N(G), such as L^p-spaces and group C*-algebras, are considered as well.  The primary tool that is used to achieve many of these results is group homology.",
  "description_provenance": [
    "Author Email: wmattox@vt.edu",
    "Advisor Email: thomson@math.vt.edu",
    "Advisor Email: floyd@math.vt.edu",
    "Advisor Email: phaskell@math.vt.edu",
    "Advisor Email: linnell@math.vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:18Z (GMT). No. of bitstreams: 1 Mattox_WD_D_2012.pdf: 473943 bytes, checksum: 560a4df32a5eb4e4cc4eb020fc97915e (MD5)   Previous issue date: 2012-07-17"
  ],
  "handle": "28397",
  "identifier_other": "etd-07252012-112602",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07252012-112602/",
  "identifier_uri": "http://hdl.handle.net/10919/28397",
  "publisher": "Virginia Tech",
  "relation_haspart": "Mattox_WD_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "group theory",
    "group von neumann algebra",
    "homology"
  ],
  "title": "Homology of Group Von Neumann Algebras",
  "type": "Dissertation"
}