{
  "contributor_author": "Lentz, Amanda Jean",
  "contributor_committeecochair": [
    "Jones, Robert H.",
    "Adler, Lynn S."
  ],
  "contributor_committeemember": [
    "Walters, Jeffrey R.",
    "Lewis, Edwin E.",
    "Phillips, John B."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:14:20Z",
  "date_adate": "2007-07-31",
  "date_available": "2014-03-14T20:14:20Z",
  "date_issued": "2007-07-19",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-07-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The ecology and evolution of a species is often considered only within the context of pairwise interactions even though a species' distribution and abundance may be determined by interactions with many species within and between trophic levels. Multiple herbivores often share the same host and may interact indirectly by altering the relationships between herbivores, their host plants and their parasitoids. However, the relationships between parasitoids and herbivore hosts have typically been studied in isolation of other herbivore species. I examined how the outcomes of species interactions change when multiple relationships are considered.  </p><p>\tChapter 1 examined the potentially conflicting selection pressures Manduca sexta exerts on Nicotiana tabacum (tobacco), since M. sexta has pollinating adults but herbivorous larvae. I demonstrated that high nectar amino acids do not affect floral visitation, but increased oviposition of herbivores on leaves. Thus, the relative costs and benefits of nectar rewards may depend on the community of pollinators and their life histories.  </p><p> In the remaining chapters I examined how feeding on tobacco by the aphid Myzus persicae altered the interactions between a parasitoid (Cotesia congregata) and its hornworm host (M. sexta). Chapter 2 demonstrated that aphids reduced hornworm abundance and parasitism. Changes in hornworm abundance were not due to density-dependent changes in moth oviposition, but the proportion of caterpillars attacked by parasitoids was inversely density dependent with hornworm density. Chapter 3 examined whether changes in hornworm abundance and parasitism reflected aphid-induced changes in host plant quality or volatile emissions. Aphids increased hornworm mortality, did not affect parasitoid performance, and increased parasitoid search time. In combination with Chapter 2, results suggest that aphids can mediate parasitoid-caterpillar interactions through changes in host plants that reduce hornworm survival and alter parasitoid behavior. Chapter 4 addressed how the outcome of interactions that are altered by aphids changed with spatial scale, and found no effect spatial scale on hornworm abundance and parasitism. In this system, aphids alter parasitoid-caterpillar interactions through changes in plant quality that reduce hornworm performance and abundance, and in turn, influence parasitoid attack. This work demonstrates that the outcome of multispecies interactions may not be predictable from pairwise interactions. </p>",
  "description_provenance": [
    "Author Email: ajlentz@vt.edu",
    "Advisor Email: jwalt@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: eelewis@ucdavis.edu",
    "Advisor Email: jphillip@vt.edu",
    "Advisor Email: lsadler@ent.umass.edu",
    "Made available in DSpace on 2014-03-14T20:14:20Z (GMT). No. of bitstreams: 1 AJLDissertation.pdf: 578633 bytes, checksum: fa89d5f3f17ed621da6c32bd2ece507e (MD5)   Previous issue date: 2007-07-19"
  ],
  "handle": "28409",
  "identifier_other": "etd-07262007-141303",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07262007-141303/",
  "identifier_uri": "http://hdl.handle.net/10919/28409",
  "publisher": "Virginia Tech",
  "relation_haspart": "AJLDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Nicotiana tabacum",
    "tri-trophic interactions",
    "and parasitoids",
    "herbivores",
    "Manduca sexta",
    "Cotesia congregata"
  ],
  "title": "The effect of aphids in parasitoid-caterpillar-plant interactions",
  "type": "Dissertation"
}