{
  "contributor_author": "Kim, Myeonghwan",
  "contributor_committeechair": "Hult, Karen M.",
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "Wolf, James F.",
    "Rees, Joseph V.",
    "Wamsley, Gary L."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:14:19Z",
  "date_adate": "2004-08-19",
  "date_available": "2014-03-14T20:14:19Z",
  "date_issued": "2004-07-22",
  "date_rdate": "2004-08-19",
  "date_sdate": "2004-07-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Early studies in the sociological stream of new institutionalism contributed much to the study of organization, especially in illuminating organizational isomorphism that might appear in organizational fields. Yet, at the same time, they were limited in accounting for organizational differences in the design of institutions.  To help explain such differences, this study introduces a conceptual framework that brings together the Selznick tradition of old institutionalism with recent studies in new institutionalism. The framework includes multiple institutional logics, organizational positions, and organizational belief systems, all of which generate particular contexts that convey varying identities and produce organizational variations in institutional design.   To examine the utility of the conceptual framework, I applied it to the design of 240 masters' programs in public affairs that are members of NASPAA, APPAM, or both. I found much variation in the coverage and structure of the programs' curricula. I discovered, for example, that programs that are affiliated only with NASPAA tend to be located in political science, public administration, and public affairs units; to be ranked in the lower-tier; to have been established in 1970 or later; to have the program mission of producing public leaders; to offer MPAd degrees; and to require higher proportions of core hours to be taken in public management. In contrast, programs affiliated only with APPAM or with both NASPAA and APPAM typically are housed in public policy units, ranked in the upper-tier, were founded in 1969 or earlier, focus on generating policy analysts, offer MPP degrees, and require higher proportions of core hours in public policy.  Among the implications of these findings are that public affairs education continues to be polarized into two camps, traditional public administration and public policy. The field still lacks agreement about the courses that should be taken and how they should be taught. It seems that differing interpretations of what public affairs is and how it should be taught have helped generate the variation in the design of masters' programs in public affairs.  The results of the empirical analyses also demonstrate the utility of the conceptual framework for explaining institutional differences (and similarities). More importantly, the concept of identity may offer a helpful way to combine several key features in studying organizations, including micro versus macro approaches, old versus new institutionalisms, and organizational theory versus organizational behavior. Eventually, this idea promises to enrich the analysis of institutional similarities and differences.",
  "description_provenance": [
    "Author Email: mykim2@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:19Z (GMT). No. of bitstreams: 1 kmhDISSERTATION.pdf: 830157 bytes, checksum: 4829b2f5e81264929b414966fcc35ac6 (MD5)   Previous issue date: 2004-07-22"
  ],
  "handle": "28404",
  "identifier_other": "etd-07262004-223851",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07262004-223851/",
  "identifier_uri": "http://hdl.handle.net/10919/28404",
  "publisher": "Virginia Tech",
  "relation_haspart": "kmhDISSERTATION.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Organizational differences",
    "Multilevel framework",
    "Program design"
  ],
  "title": "An Institutional Analysis of Differences: The Design of Masters' Programs in Public Affairs",
  "type": "Dissertation"
}