{
  "contributor_author": "Fulton, Melanie B.",
  "contributor_committeechair": "Letzter, Gail",
  "contributor_committeemember": [
    "Linnell, Peter A.",
    "Haskell, Peter E.",
    "Farkas, Daniel R."
  ],
  "contributor_department": "Mathematics",
  "date_accessioned": "2014-03-14T20:14:19Z",
  "date_adate": "2006-08-14",
  "date_available": "2014-03-14T20:14:19Z",
  "date_issued": "2006-07-21",
  "date_rdate": "2006-08-14",
  "date_sdate": "2006-07-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A classification of all undirected trees with automorphism group isomorphic to $(Z_2)^l$ is given in terms of a vertex partition called a refined star partition.  Recently the notion of a quantum automorphism group has been defined by T. Banica and J. Bichon. The quantum automorphism group is similar to the classical automorphism group, but has relaxed commutivity.  The classification of all undirected trees with automorphism group isomorphic to $(Z_2)^l$ along with a similar classification of all undirected asymmetric trees is used to give some insight into the structure of the quantum automorphism group for such graphs.",
  "description_provenance": [
    "Author Email: mfulton@highpoint.edu",
    "Advisor Email: linnell@math.vt.edu",
    "Advisor Email: haskell@math.vt.edu",
    "Advisor Email: farkas@math.vt.edu",
    "Advisor Email: letzter@math.vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:19Z (GMT). No. of bitstreams: 1 MF_thesis.pdf: 397305 bytes, checksum: 019aa281eb3b6c1f3d6df4dc5f363fd0 (MD5)   Previous issue date: 2006-07-21"
  ],
  "handle": "28405",
  "identifier_other": "etd-07262006-091536",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07262006-091536/",
  "identifier_uri": "http://hdl.handle.net/10919/28405",
  "publisher": "Virginia Tech",
  "relation_haspart": "MF_thesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Automorphism Group",
    "Hopf Algebras",
    "Quantum Automorphism"
  ],
  "title": "The Quantum Automorphism Group and Undirected Trees",
  "type": "Dissertation"
}