{
  "contributor_author": "Bowen, Mary Elizabeth",
  "contributor_committeechair": "Calasanti, Toni M.",
  "contributor_committeemember": [
    "Blieszner, Rosemary",
    "Fuller, Theodore D.",
    "Kiecolt, K. Jill",
    "Roberto, Karen A.",
    "Willson, Andrea"
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:14:20Z",
  "date_adate": "2006-09-18",
  "date_available": "2014-03-14T20:14:20Z",
  "date_issued": "2006-06-12",
  "date_rdate": "2008-09-18",
  "date_sdate": "2006-07-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Elderly Black and Hispanic adults have poorer overall health, higher disability rates, and lower life expectancies than elderly Whites and other racial and ethnic minority group members. There are also sex differences in health, with women more likely to suffer from non-life threatening chronic conditions and men more likely to suffer from acute conditions. Health pathways, or the processes to good or poor health, are shaped by race, SES, and sex. This study focuses on the race and SES literature, framing race and SES inequalities within a cumulative advantage lens. Using Hierarchical Linear Modeling techniques to examine data from the Health and Retirement Survey, this study finds that there are racial differences in health through health problems, health insurance, and health care treatment, and that Black, Hispanic, and other racial and ethnic minority group members have worse self-reported health than Whites in old age. This study also finds evidence of cumulative advantage through friends in the neighborhood, and finds evidence of cumulative disadvantage through health problems and hospital and nursing home treatment. There are also cumulative disadvantages for women, who have more functional limitations in old age than their male counterparts, and these disadvantages grow over time. This study adds support to the race literature, by furthering understandings of race and SES as interconnected but not interchangeable systems of inequality. In lieu of the findings, this study provides implications for future research and ways to reduce racial health disparities in old age.",
  "description_provenance": [
    "Author Email: mbowen@vt.edu",
    "Advisor Email: toni@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Advisor Email: fullertd@vt.edu",
    "Advisor Email: kiecolt@vt.edu",
    "Advisor Email: kroberto@vt.edu",
    "Advisor Email: willson@uwo.ca",
    "Made available in DSpace on 2014-03-14T20:14:20Z (GMT). No. of bitstreams: 2 001DissertationAbstract.pdf: 125823 bytes, checksum: 1c4df40cc456e4f0a6cb6b223ba1198d (MD5) 002DissertationMainFile.pdf: 1720855 bytes, checksum: a0e865334ee8ab60582a1d3917fd1ecd (MD5)   Previous issue date: 2006-06-12"
  ],
  "handle": "28408",
  "identifier_other": "etd-07262006-192112",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07262006-192112/",
  "identifier_uri": "http://hdl.handle.net/10919/28408",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "001DissertationAbstract.pdf",
    "002DissertationMainFile.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "gender",
    "SES",
    "self-reported health",
    "cumulative advantage",
    "functional limitations",
    "race"
  ],
  "title": "The Effects of Socioeconomic Status and Race on Functional Limitations and Self-Reported Health in Old Age",
  "type": "Dissertation"
}