{
  "contributor_author": "Tilley-Lubbs, Gresilda A.",
  "contributor_committeechair": "Shrum, Judith L.",
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Lalik, Rosary V.",
    "Uttech, Melanie R.",
    "Bixler, Jacqueline E."
  ],
  "contributor_department": "Foreign Languages and Literatures",
  "date_accessioned": "2014-03-14T20:14:22Z",
  "date_adate": "2003-08-15",
  "date_available": "2014-03-14T20:14:22Z",
  "date_issued": "2003-07-21",
  "date_rdate": "2006-08-15",
  "date_sdate": "2003-07-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The overarching objective of this study is to examine the nexus of relationships that emerged between university students and Latino families paired through a university service-learning course. The relationships crossed socially constructed boundaries of ethnic groups, language, educational levels, and socioeconomic status, exploring the intersection of community service, scholarship, and teaching-and-learning. \tThe research questions necessitated the use of qualitative research methods. The narrative attempts to capture the essence of the setting, the actors, and the resultant relationships by describing and examining the spontaneous relationships that occurred. \tThe researcher spent 1½ years as an interpreter/participatory member in the Latino community prior to beginning the research study. She collected data collected for this case study over 2½ years, examining the backgrounds of the participants, their perspectives toward their partners, and the role of service-learning in the development of relationships between two disparate groups. She conducted 46 interviews with students and community members while collecting over 2500 reflection papers, 100 transformation papers, and 25 PowerPoint presentations from students.  \tThe participants developed relationships at different levels, some resulting in friendships that will probably continue for some time; others sharing respect and concern for each other only during the placement. A few unsuccessful partnerships had to be changed. Student and community voices presented an appreciation for the partner's language and culture. The data illustrated satisfying reciprocal relationships in which students and families emerged united in solidarity against a society they deemed unjust. \tThis study seeks to provide information for educators considering service-learning programs, examining a course that provides opportunities for interaction between university students and community members. Through the participants' voices, the reader can explore the integration of academic learning with learning lived in the community.  \tFinally, this study submits general proposals for the inclusion of service-learning programs in Foreign Language and Teacher Education programs as a means of nurturing paradigm shifts in student attitudes toward members of other cultures as well as paradigm shifts in the Latinos' attitudes toward their new culture, suggesting possible deeper societal transformation as the academy and the community become agents of change through service-learning in the Latino community.",
  "description_provenance": [
    "Author Email: glubbs@vt.edu",
    "Advisor Email: jshrum@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: rlalik@vt.edu",
    "Advisor Email: drmelanie@cox.net",
    "Advisor Email: jbixler@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:22Z (GMT). No. of bitstreams: 12 Ch_1.pdf: 60897 bytes, checksum: 97b41429c1475a8d42d0322ababfcd0d (MD5) APPENDIXES.pdf: 121055 bytes, checksum: 8e4ddcd71328bdb11cf911581facbd3e (MD5) Ch_8.pdf: 87517 bytes, checksum: 0465a3e920ca45e7a0925ed3138fdd39 (MD5) Ch_6.pdf: 100773 bytes, checksum: 812e2f68806f32bc88575d5eb3e72b9b (MD5) Ch_2.pdf: 80008 bytes, checksum: 9aab01de6b506a4f6841678b92fea37e (MD5) Ch_5.pdf: 117816 bytes, checksum: 4ac965e710e6c0b9b8e9028ccee60792 (MD5) Intro.pdf: 43003 bytes, checksum: 547bed47c8041f07b2a6a7046c51113c (MD5) Ch_3.pdf: 102991 bytes, checksum: 754a6132dd6d5b24e63c56b539df4e47 (MD5) References.pdf: 53622 bytes, checksum: e48f8146caee105804ce9a44dfb3acf2 (MD5) Ch_7.pdf: 74860 bytes, checksum: f0ac1d89b01807babe3e568b2af28dcd (MD5) Vita.pdf: 26762 bytes, checksum: d803ac6f6ff84b0b928c9225898e9f54 (MD5) Ch_4.pdf: 310435 bytes, checksum: 3c9a795f0fcb1c89875f2d8f4e802540 (MD5)   Previous issue date: 2003-07-21"
  ],
  "handle": "28418",
  "identifier_other": "etd-07272003-010818",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07272003-010818/",
  "identifier_uri": "http://hdl.handle.net/10919/28418",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Ch_1.pdf",
    "APPENDIXES.pdf",
    "Ch_8.pdf",
    "Ch_6.pdf",
    "Ch_2.pdf",
    "Ch_5.pdf",
    "Intro.pdf",
    "Ch_3.pdf",
    "References.pdf",
    "Ch_7.pdf",
    "Vita.pdf",
    "Ch_4.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Service-Learning",
    "Teacher Education",
    "Second Language Acquisition",
    "Latinos in the US"
  ],
  "title": "Crossing the Border Through Service-Learning: The Power of Cross-Cultural Relationships",
  "type": "Dissertation"
}