{
  "contributor_author": "Hanowski, Richard J.",
  "contributor_committeechair": "Dingus, Thomas A.",
  "contributor_committeemember": [
    "Barfield, Woodrow S.",
    "Knipling, Ronald R.",
    "Wierwille, Walter W.",
    "Kleiner, Brian M."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:14:21Z",
  "date_adate": "2000-07-27",
  "date_available": "2014-03-14T20:14:21Z",
  "date_issued": "2000-05-23",
  "date_rdate": "2001-07-27",
  "date_sdate": "2000-07-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Massie, Blower, and Campbell (1997) indicate that trucks that operate less than 50 miles from the vehicle's home base comprise 58% of the trucking industry. However, despite being the largest segment, research involving local/short haul (L/SH) operations has been scant. In fact, little is known about the general safety issues in L/SH operations. <p> As a precursor to the present research, Hanowski, Wierwille, Gellatly, Early, and Dingus (1998) conducted a series of focus groups in which L/SH drivers provided their perspective on safety issues, including fatigue, in their industry. As a follow-up to the Hanowski et al. work, the effort presented here consisted of an on-road field study where L/SH trucks were instrumented with data collection equipment. Two L/SH trucking companies and 42 L/SH drivers participated in this research. To the author's knowledge, this is the first in-situ data collection effort of its kind with L/SH drivers. <p> The analyses focused on determining if fatigue is an issue in L/SH operations. Of primary interest were critical incidents (near-crashes) where drivers were judged to be at fault. The results of the analyses indicated that fatigue was present immediately prior to driver involvement in at-fault critical incidents. Though it is difficult to determine why fatigue was present, the results seem to indicate that much of the fatigue that the drivers' experienced was brought with them to the job, rather than being caused by the job. <p> There are four basic outputs of the Phase II research: (1) a description of the L/SH drivers who participated, (2) a description of critical incidents, (3) a determination if fatigue is an issue in L/SH trucking, and (4) the validation of the fatigue factors cited in Hanowski et al. (1998) using a proposed fatigue model. These four outputs culminate in a set of pragmatic guidelines to address fatigue and other safety issues in L/SH operations. Five guidelines are proposed that are directed at: (1) driver education with regard to on-the-job drowsiness/inattention, (2) driver education with regard to sleep hygiene, (3) driver training, particularly for novice L/SH truck drivers, (4) driver screening, and (5) public monitoring of L/SH driver performance.",
  "description_provenance": [
    "Author Email: hanowski@ctr.vt.edu",
    "Advisor Email: Jbar5377@aol.com",
    "Advisor Email: Ron.Knipling@fhwa.dot.gov",
    "Advisor Email: waltw@mail.vt.edu",
    "Advisor Email: tomd@ctr.vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:21Z (GMT). No. of bitstreams: 1  Hanowski_ETD.pdf: 1007252 bytes, checksum: e44fb31132643cf672cd09f33a38cf73 (MD5)    Previous issue date: 2000-05-23"
  ],
  "handle": "28416",
  "identifier_other": "etd-07272000-08470013",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07272000-08470013/",
  "identifier_uri": "http://hdl.handle.net/10919/28416",
  "language_iso": "en_US",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hanowski_ETD.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Heavy vehicles",
    "Drowsiness",
    "Commercial Vehicle Operations",
    "Inattention"
  ],
  "title": "THE IMPACT OF LOCAL/SHORT HAUL OPERATIONS ON DRIVER FATIGUE",
  "type": "Dissertation"
}