{
  "contributor_author": "Dai, Nan",
  "contributor_committeechair": "Etzkorn, Felicia A.",
  "contributor_committeemember": [
    "Taylor, Larry T.",
    "Gandour, Richard D.",
    "Carlier, Paul R.",
    "Santos, Webster L."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:14:20Z",
  "date_adate": "2008-08-15",
  "date_available": "2014-03-14T20:14:20Z",
  "date_issued": "2008-07-25",
  "date_rdate": "2009-08-15",
  "date_sdate": "2008-07-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Collagen is one of the most important and abundant proteins in mammals. It consists of three left-handed PPII helixes coiled along a common axis to form a very compact right-handed super helix. The primary structure is shown to be (Gly-Xaa-Yaa)n repeats with high content of prolyl residues at both Xaa and Yaa positions. Cis-trans isomerization of the prolyl amide bonds is one of the rate-limiting steps during collagen triple helix folding.<p> The conformationally locked alkene isosteres Fmoc-Gly-Î¨[(E)CH=C]-Pro-Hyp(tBu)-OH and Fmoc-Pro-Î¨[(E)CH=C]-Pro-OH were designed and synthesized. The synthesis of the Gly-Pro isostere had no stereo-control, and the two diastereomers of the tripeptide isostere Fmoc-Gly-Î¨[(E)CH=C]-Pro-Hyp(tBu)-OBn were separated by normal phase HPLC. Although the stereoselectivity of the asymmetric reduction was not good for the Pro-Pro isostere, the resulting diastereomers was separable by flash chromatography, and the absolute stereochemistry of the two diastereomers was determined by Mosherâ  s method.  The Gly-Pro alkenyl peptides, and their control peptide Ac-(Gly-Pro-Hyp)8-Gly-Gly-Tyr-NH2 were synthesized and purified. All three peptides showed a maximum around 225 nm and a minimum close to 200 nm in the CD spectra, which indicated the formation of PPII helixes. The Tm value of the control peptide was determined to be 50.0 Â°C. The peptide with Gly-Î¨[(E)CH=C]-L-Pro-Hyp as the guest triplet formed a stable triple helix with a Tm value of 28.3 Â°C. The peptide with Gly-Î¨[(E)CH=C]-D-Pro-Hyp as the guest triplet showed a linear decrease in the ellipticity with increasing temperature, which indicated that no triple helix was formed.<p> \tThe Pro-Pro alkenyl peptide and its control peptide H-(Pro-Pro-Gly)10-OH were synthesized and purified. The Tm value of control peptide was determined to be 31.6 Â°C by extrapolation to 0 M TMAO in PBS buffer, which was very close to the measured value of 31.5 Â°C. The Pro-Pro alkenyl peptide began to show a maximum around 225 nm in the CD spectra when the concentration of TMAO was higher than 2.5 M. After extrapolation to 0 M TMAO, the Tm value was determined to be â  22.0 Â°C. These results indicate that the backbone inter-chain hydrogen bond is one of the major forces in stabilizing the collagen triple helix, while cis-trans isomerization has limited contribution. The intrinsic properties of the amide bond may have huge influence on the stability of the collagen triple helix.<p> The helix-turn-helix motif is an important tertiary structure in DNA-binding proteins. Stepwise modifications of the Antennapedia HTH peptide (27-55) were performed to improve the helicity and stability. The peptide with more side-chain ion-pairs was over 4 times more helical than the native Antp peptide, while the Ala-based peptide was over 9 times more helical than the native peptide.<p> A 12-membered ring, Fmoc-protected HTH-turn mimic was designed and synthesized, and was ready for solid phase peptide synthesis. The solubility of the cyclic peptide was very poor, and the purification of the final product was very difficult. The solubility problem might also affect solid phase peptide synthesis in the future.",
  "description_provenance": [
    "Author Email: ndai@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: fetzkorn@vt.edu",
    "Advisor Email: gandour@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Advisor Email: santosw@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:20Z (GMT). No. of bitstreams: 1 thesis-full-modified.pdf: 5027533 bytes, checksum: 5eb085ec13cb5f7de32bb46d0272ffd5 (MD5)   Previous issue date: 2008-07-25"
  ],
  "handle": "28411",
  "identifier_other": "etd-07262008-185945",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07262008-185945/",
  "identifier_uri": "http://hdl.handle.net/10919/28411",
  "publisher": "Virginia Tech",
  "relation_haspart": "thesis-full-modified.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "helicity",
    "HTH-turn mimic.",
    "conformationally locked isostere",
    "polypeptides",
    "triple helix",
    "stability",
    "collagen",
    "helix-turn-helix"
  ],
  "title": "I. Collagen-like polypeptides. II. Helix-turn-helix peptides and turn mimetics.",
  "type": "Dissertation"
}