{
  "contributor_author": "Pantaleoni, Eva",
  "contributor_committeecochair": [
    "Galbraith, John M.",
    "Wynne, Randolph H."
  ],
  "contributor_committeemember": [
    "Carstensen, Laurence William Jr.",
    "Campbell, James B. Jr.",
    "Daniels, Walter Lee"
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:14:22Z",
  "date_adate": "2007-08-09",
  "date_available": "2014-03-14T20:14:22Z",
  "date_issued": "2007-05-03",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-07-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Establishing wetland gains and losses, delineating wetland boundaries, and determining their vegetative composition are major challenges that can be improved through remote sensing studies. In this study, we used the Advanced Spaceborne Thermal Emission and Reflection Radiometer (ASTER) to separate wetlands from uplands in a study of 870 locations on the Virginia Coastal Plain. We used the first five bands from each of two ASTER scenes (6 March 2005 and 16 October 2005), covering the visible to the short-wave infrared region (0.52-2.185&#965;m).  We included GIS data layers for soil survey, topography, and presence or absence of water in a logistic regression model that predicted the location of over 78% of the wetlands. While this was slightly less accurate (78% vs. 86%) than current National Wetland Inventory (NWI) aerial photo interpretation procedures of locating wetlands, satellite imagery analysis holds great promise for speeding wetland mapping, lowering costs, and improving update frequency. To estimate wetland vegetation composition classs of the study locations, we generated a Classification and Regression Tree (CART) model and a Multinomial Logistic Regression (logit) model, and compared their accuracy in separating woody wetlands, emergent wetlands and open water. The overall accuracy of the CART model was 73.3%, while the overall accuracy of the logit model was 76.7%. Although the CART producer's accuracy (correct category classification) of the emergent wetlands was higher than the accuracy from the multinomial logit (57.1% vs. 40.7%), we obtained the opposite result for the woody wetland category (68.7% vs. 52.6%).  A McNemar test between the two models and NWI maps showed that their accuracies were not statistically different. We conducted a sub-pixel analysis of the ASTER images to establish canopy cover of forested wetlands. The canopy cover ranged from 0 to 225 m2. We used visble-near-infrared ASTER bands,  Delta Normalized Difference Vegetation Index, and a Tasselled Cap transformation in an ordinary linear regression (OLS) model. The model achieved an adjusted-R2 of 0.69 and an RMSE of 2.73% when the canopy cover is less than 16%. For higher canopy cover values, the adjusted-R2 was 0.4 and the RMSE was19.79%. Taken together, these findings suggest that satellite remote sensing, in concert with other spatial data, has strong potential for mapping both wetland presence and type.",
  "description_provenance": [
    "Author Email: epantale@vt.edu",
    "Advisor Email: ttcf@vt.edu",
    "Advisor Email: carstens@vt.edu",
    "Advisor Email: jayhawk@vt.edu",
    "Advisor Email: wynne@vt.edu",
    "Advisor Email: wdaniels@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:22Z (GMT). No. of bitstreams: 1 Eva_Pantaleoni_dissertation.pdf: 4931170 bytes, checksum: 40d7f8b85b7d0f612584292f7d658410 (MD5)   Previous issue date: 2007-05-03"
  ],
  "handle": "28419",
  "identifier_other": "etd-07272007-134802",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07272007-134802/",
  "identifier_uri": "http://hdl.handle.net/10919/28419",
  "publisher": "Virginia Tech",
  "relation_haspart": "Eva_Pantaleoni_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ASTER",
    "wetlands",
    "multi-temporal analysis",
    "logit model",
    "CART"
  ],
  "title": "Assessing Coastal Plain Wetland Composition using Advanced Spaceborne Thermal Emission and Reflection Radiometer Imagery",
  "type": "Dissertation"
}