{
  "contributor_author": "Goodwin, David  G",
  "contributor_committeechair": "Lindsay, David S.",
  "contributor_committeemember": [
    "Zajac, Anne M.",
    "Hrubec, Theresa",
    "Klein, Bradley G.",
    "Strobl, Jeannine S."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:14:20Z",
  "date_adate": "2011-09-12",
  "date_available": "2014-03-14T20:14:20Z",
  "date_issued": "2011-07-12",
  "date_rdate": "2011-09-12",
  "date_sdate": "2011-07-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Evidence suggests that the neurotropic parasite Toxoplasma gondii may play a role in the development of cognitive impairments. My hypothesis was that congenital exposure to T. gondii would lead to detectable age and sex related differences in behavior and neurotransmitter levels in mice. The neurotransmitter dopamine and commonly used anti-schizophrenic agents were evaluated against T. gondii in human fibroblast cells. Dopamine caused a significant increase in tachyzoite numbers at 250 nM but not 100 nM and the drugs valproic acid, fluphenazine, thioridazine and trifluoperazine inhibited T. gondii development. The effects T. gondii infection had on behavior were examined using a congenital mouse model. Previous work demonstrated maternal immune stimulation (MIS) with interferon gamma (INF-g) resulted in decreased fetal mortality from congenital T. gondii infections; therefore I examined the effects of INF- g treatment of mothers to determine if protection from the behavioral effects of T. gondii occurred in their offspring. No differences in concentrations of neurotransmitters in the brains of congenitally infected mice were observed. I found that mice infected with T. gondii developed adult onset behavior impairments with decreased rate of learning, increased activity and decreased memory, indicating cognitive impairment for male mice and not female mice. My findings support the evidence T. gondii is a factor in the development of cognitive impairments. My results for T. gondii exposed male mice are consistent with the convention that males have more cognitive impairments in the prodromal stage of schizophrenia. MIS with IFN-g had a minimal effect on behavior post sexual maturity but had a greater effect on pre sexual maturity female mice which exhibited difficulties with spatial memory, coordination and the ability to process stimuli. The results indicate the behavior alterations from IFN- g are transient. When MIS is given prior to congenital infection with T. gondii, we detected no behavior deficits in any group of mice, including male mice post sexual maturity. Based on the results of my study, I must reject the hypothesis that neurotransmitter levels are influenced by congenital toxoplasmosis and accept the hypothesis that congenital T. gondii infection caused cognitive impairments in male mice post sexual maturity.",
  "description_provenance": [
    "Author Email: dagoodwi@vt.edu",
    "Advisor Email: Lindsayd@vt.edu",
    "Advisor Email: azajac@vt.edu",
    "Advisor Email: thrubec@vt.edu",
    "Advisor Email: bklein@vt.edu",
    "Advisor Email: jestrobl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:20Z (GMT). No. of bitstreams: 1 Goodwin_DG_D_2011.pdf: 1967547 bytes, checksum: 4711ec79cebcffe097df0ada38be76c1 (MD5)   Previous issue date: 2011-07-12"
  ],
  "handle": "28412",
  "identifier_other": "etd-07262011-145307",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07262011-145307/",
  "identifier_uri": "http://hdl.handle.net/10919/28412",
  "publisher": "Virginia Tech",
  "relation_haspart": "Goodwin_DG_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Toxoplasma gondii",
    "maternal immune stimulation",
    "schizophrenia",
    "interferon gamma"
  ],
  "title": "Age and Sex Related Behavioral Changes in Mice Congenitally Infected with Toxoplasma gondii: Role of dopamine and other neurotransmitters in the genesis of behavioral changes due to congenital infection and attempted amelioration with interferon gamma",
  "type": "Dissertation"
}