{
  "contributor_author": "Martin, Michael Joseph",
  "contributor_committeechair": "Kaufman, Eric K.",
  "contributor_committeemember": [
    "Hass, Lanny",
    "Lambur, Michael T.",
    "Sutphin, Cathy M."
  ],
  "contributor_department": "Agricultural and Extension Education",
  "date_accessioned": "2014-03-14T20:14:23Z",
  "date_adate": "2011-08-19",
  "date_available": "2014-03-14T20:14:23Z",
  "date_issued": "2011-07-15",
  "date_rdate": "2011-08-19",
  "date_sdate": "2011-07-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Reducing employee turnover through retention practices is an area of great interest to employers who depend on a highly skilled workforce.  In recent years, Cooperative Extension has experienced the loss of many local agents/educators due to resignation and also retirement incentives offered as a cost saving measure to manage reduced funding.  Due to the type of work, the training needed, and the small pool of qualified applicants, it is important to pay attention to the retention of newly hired Extension workers.  Prior research suggests a linkage of factors that can predict the likelihood of new employeesâ   intention to quit.  Human resource practices including recruitment & hiring, compensation & benefits, training & development, and supervision & evaluation are items that can directly influence the level of job satisfaction of new employees as well as their level of commitment to the organization.  The level of job satisfaction and organizational commitment can, subsequently, predict an employeeâ  s level of intention to quit.  This paper will share findings of research conducted in the fall of 2010, which included 480 Extension agents/educators, representing 12 states in the Southern United States.  The study targeted employees with less than six years of employment and investigated human resource practices that influence intention to quit.  Findings indicate a significant relationship between perceptions of human resource practices and intention to quit, mediated by organizational commitment and job satisfaction.  Accordingly, the research has important implications for the management of Cooperative Extension and anyone working in or preparing to work in related fields.",
  "description_provenance": [
    "Author Email: mjmartin@vt.edu",
    "Advisor Email: lanny_hass@ncsu.edu",
    "Advisor Email: lamburmt@vt.edu",
    "Advisor Email: cmsutph@vt.edu",
    "Advisor Email: ekaufman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:23Z (GMT). No. of bitstreams: 2 Martin_MJ_D_2011.pdf: 1259373 bytes, checksum: 94deb345e6ff888516390c3c4a33074f (MD5) Martin_MJ_D_2011_FairuseIRB.pdf: 298944 bytes, checksum: ab52569cae63698ed279a58e97e4ef01 (MD5)   Previous issue date: 2011-07-15"
  ],
  "handle": "28424",
  "identifier_other": "etd-07272011-150612",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07272011-150612/",
  "identifier_uri": "http://hdl.handle.net/10919/28424",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Martin_MJ_D_2011.pdf",
    "Martin_MJ_D_2011_FairuseIRB.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Cooperative Extension",
    "Intent to Quit",
    "Human Resources",
    "Organizational Commitment",
    "Job Satisfaction"
  ],
  "title": "Influlence of Human Resource Practices on Employee Intention to Quit",
  "type": "Dissertation"
}