{
  "contributor_author": "Coleman, Mary Dean",
  "contributor_committeechair": "Nickols-Richardson, Sharon M.",
  "contributor_committeemember": [
    "Ramp, Warren K.",
    "Thye, Forrest W.",
    "Gwazdauskas, Francis C.",
    "Herbert, William G."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:14:25Z",
  "date_adate": "2004-09-15",
  "date_available": "2014-03-14T20:14:25Z",
  "date_issued": "2004-07-15",
  "date_rdate": "2007-09-15",
  "date_sdate": "2004-07-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Low-carbohydrate, high-protein (LCHP) diets have been shown to induce weight loss and beneficial changes in blood lipids that suggest cardiovascular disease risk reduction; however, LCHP diets have not been adequately investigated for health effects on the skeleton.  A randomized trial to determine the effects of a LCHP diet on bone mineral status, biomarkers of bone turnover, indicators of acid-base balance, calcium homeostasis and fasting lipids in healthy pre-menopausal women was conducted.   Women, aged 32 - 45 y, with a body mass index between 25-41 kg/m2 were randomized into one of two diet groups:  LCHP (n = 13) or high-carbohydrate, low-fat (HCLF) (n = 12).  Anthropometric (body weight, lean mass, fat mass) and bone mineral density (BMD) and content (BMC) measures and markers of lipid metabolism were taken at weeks 0, 6, and 12.  Measures of acid-base balance, protein metabolism, and calcium homeostasis were conducted at weeks 0, 1-4, 6, and 12.  Serum osteocalcin was analyzed at weeks 0, 1, 2, 6, and 12, while urinary NTx was analyzed at weeks 0, 1 and 2.  Weight loss was significant at the end of 12 weeks in both diet groups (P < 0.05) but there was no Diet x Time interaction.  Total proximal femur BMD was lower in the LCHP group (P < 0.05) compared to the HCLF group by week 12.  Femoral neck BMC decreased in the LCHP diet group (P < 0.05), whereas total forearm BMC increased (P < 0.05) in the HCLF diet group by week 12 of the study.  Serum osteocalcin showed significant main effects of diet (P < 0.05) and time (P < 0.0001), but a Diet x Time interaction was not observed.  Urinary NTx exhibited no main diet effect, time effect or Diet x Time interaction at weeks 1 or 2.  Urinary pH was lower in the LCHP group compared to the HCLF group throughout the study (P < 0.0001).  Urinary calcium excretion was higher in the LCHP group and lower in the HCLF group (P < 0.0001) compared to baseline values at all intervals of the study.  Urinary phosphorus excretion exhibited a significant diet effect (P < 0.001) and time effect (P < 0.002), while no Diet x Time interaction was observed.  Total cholesterol, high-density and low-density lipoprotein cholesterol, and triacylglycerol concentrations did not differ between diets during the study.  In conclusion, a LCHP diet appears to stimulate bone loss, while a HCLF diet appears to attenuate bone loss in healthy pre-menopausal women undergoing 12 weeks of weight loss.",
  "description_provenance": [
    "Author Email: macolema@vt.edu",
    "Advisor Email: thye@vt.edu",
    "Advisor Email: snrichar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:25Z (GMT). No. of bitstreams: 1 Coleman.pdf: 6600622 bytes, checksum: 2d01202d493035bc8fe1b95f3f122445 (MD5)   Previous issue date: 2004-07-15"
  ],
  "handle": "28429",
  "identifier_other": "etd-07282004-174858",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07282004-174858/",
  "identifier_uri": "http://hdl.handle.net/10919/28429",
  "publisher": "Virginia Tech",
  "relation_haspart": "Coleman.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "bone mineral density",
    "weight-loss",
    "high-protein",
    "obesity",
    "low-carbohydrate diet"
  ],
  "title": "Effect of a Low-Carbohydrate, High-Protein Diet on Bone Mineral Density, Biomarkers of Bone Turnover, and Calcium Metabolism in Healthy Pre-Menopausal Females",
  "type": "Dissertation"
}