{
  "contributor_author": "Blanc, Lori Ann",
  "contributor_committeechair": "Walters, Jeffery R.",
  "contributor_committeemember": [
    "Adler, Lynn S.",
    "Jones, Robert H.",
    "Haas, Carola A.",
    "Stauffer, Dean F."
  ],
  "contributor_department": "Biological Sciences",
  "date_accessioned": "2014-03-14T20:14:22Z",
  "date_adate": "2007-09-04",
  "date_available": "2014-03-14T20:14:22Z",
  "date_issued": "2007-07-17",
  "date_rdate": "2007-09-04",
  "date_sdate": "2007-07-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Cavity-nesting communities are structured by the creation of and competition for cavities as nest-sites.  Viewing these communities as interconnected webs can help identify species interactions that influence community structure.  This study examines cavity-nesting bird community interactions within the fire-maintained longleaf pine (Pinus palustris) ecosystem at Eglin Air Force Base, Florida.  In chapter 1, I provide a background review of the ecology of my study system. In chapter 2, I use nest webs to depict the flow of cavity-creation and use at Eglin.  I identified 2 webs into which most species could be placed.  One web contained 6 species associated with pines.  The second web contained 5 species associated with hardwoods.  Red-cockaded woodpeckers (Picoides borealis) and northern flickers (Colaptes auratus) created most cavities used by other species within this community.  In chapter 3, I describe snag densities and nest-site selection of the cavity-nesting bird community at Eglin.  Large, mature pine snags were abundant, exceeding other reported densities for southern pine forests.  Pine snags were heavily-used, despite the abundance of available red-cockaded woodpecker cavities in living pine.  Hardwood snags accounted for 10% of nests found, and were used by 12 of 14 species.  Diameters of nest-trees and available snags were below the range of optimal nest-snag diameters reported in other studies, indicating the need for site-specific snag management guidelines.  In chapter 4, I combine a study of basic ecological principles with endangered species management to examine interactions within the cavity-nesting bird community at Eglin.  I used a nest web to identify a potential indirect interaction between the red-cockaded woodpecker and large secondary cavity-nesters, mediated by the northern flicker.  I used structural equation modeling to test a path model of this interaction.  By experimentally manipulating cavity availability, I blocked links described in the model, confirming cavity creation and enlargement as mechanisms that influence this indirect relationship.  I demonstrated that a red-cockaded woodpecker cavity-management technique could disrupt this indirect relationship by affecting northern flicker behavior, and provided an empirical example of how, in interactive ecological communities, single-species management can have indirect effects on non-target species.",
  "description_provenance": [
    "Author Email: lblanc@vt.edu",
    "Advisor Email: lsadler@ent.umass.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: cahaas@vt.edu",
    "Advisor Email: dstauffe@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:22Z (GMT). No. of bitstreams: 1 LoriBlancETD.pdf: 2852881 bytes, checksum: 019fc5be6558c65a838c67551eb25c68 (MD5)   Previous issue date: 2007-07-17"
  ],
  "handle": "28420",
  "identifier_other": "etd-07272007-151106",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07272007-151106/",
  "identifier_uri": "http://hdl.handle.net/10919/28420",
  "publisher": "Virginia Tech",
  "relation_haspart": "LoriBlancETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cavity-nester",
    "ecosystem engineer",
    "snag",
    "structural equation modeling",
    "red-cockaded woodpecker",
    "Colaptes auratus",
    "nest web",
    "Picoides borealis",
    "longleaf pine",
    "northern flicker",
    "endangered species management",
    "indirect interaction",
    "keystone species"
  ],
  "title": "Experimental study of an avian cavity-nesting community: nest webs, nesting ecology, and interspecific interactions",
  "type": "Dissertation"
}