{
  "contributor_author": "Paul, Mou",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "Baird, Donald G.",
    "Davis, Richey M.",
    "McGrath, James E.",
    "Taylor, Larry T."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:14:23Z",
  "date_adate": "2008-08-14",
  "date_available": "2014-03-14T20:14:23Z",
  "date_issued": "2008-07-07",
  "date_rdate": "2009-08-14",
  "date_sdate": "2008-07-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Novel proton exchange (PEM) and reverse osmosis (RO) membranes for application in fuel cell and water purification respectively were developed by synthesis and crosslinking of disulfonated biphenol-based poly (arylene ether sulfone)s (BPS).  Crosslinking is a prospective option to reduce the water swelling and improve the dimensional stability of hydrophilic BPS copolymers.  Several series of controlled molecular weight, phenoxide-endcapped BPS copolymers were synthesized via direct copolymerization of disulfonated activated aromatic halide monomers.  The degree of disulfonation was controlled by varying the molar ratio of sulfonated to non-sulfonated dihalide monomers.  The molecular weights of the copolymers were controlled by offsetting the stoichiometry between biphenol and the dihalides.  Biphenol was utilized in excess to endcap the copolymers with phenoxide groups, so that the phenoxide groups could be further reacted with a suitable crosslinker.  Several crosslinking reagents such as methacrylate, multifunctional epoxy, phthalonitrile and phenylethynyls were investigated.  A wide range of crosslinking chemistries i.e. free radical (methacrylate), step growth (epoxy), heterocyclic (phthalonitrile) and acetylenic (phenylethynyl) was explored.  The effects of crosslinking on network properties as functions of molecular weight and degree of disulfonation of copolymers, crosslinking time and concentration of crosslinker were studied.  The crosslinked membranes were characterized in terms of gel fraction, water uptake, swelling, self-diffusion coefficients of water, proton conductivity, methanol permeability, water permeability and salt rejection.  In general, all of the crosslinked membranes had lower water uptake and swelling relative to their uncrosslinked counterparts, and less water uptake and volume swelling were correlated with increasing gel fractions.  It was possible to shift the percolation threshold for water absorption of BPS copolymers to a higher ion exchange capacity (IEC) value compared to that of the uncrosslinked copolymers by means of crosslinking.  This reduced water uptake increased the dimensional stability of higher IEC materials and extended their application for potential PEM or RO membranes.  The reduction in water uptake and swelling also increased the effective proton concentration, resulting in no significant change in proton conductivity of the membranes after crosslinking.  The self-diffusion coefficients of water and methanol permeability decreased with crosslinking, indicating restricted water and methanol transport.  Therefore an improvement in the selectivity (ratio of proton conductivity to water swelling or methanol permeability) of PEMs for application in either H2/air or direct methanol fuel cells was achieved by crosslinking.  The epoxy crosslinked BPS copolymers also had significantly enhanced salt rejection with high water permeability when tested in for RO applications.  Reductions in salt permeability with increasing crosslinking density suggested that crosslinking inhibited salt transport through the membrane.  \tIn addition to the random copolymers, two series of multiblocks endcapped with either a phenoxide-terminated hydrophilic unit or a hydrophobic unit were synthesized and crosslinked with a multifunctional epoxy.  Besides the crosslinking study, the effect of sequence distributions of the hydrophilic and hydrophobic blocks in the multiblock copolymers was also investigated.  Similar to randoms, crosslinked multiblocks had lower water uptake and swelling but comparable proton conductivities relative to their uncrosslinked analogues.",
  "description_provenance": [
    "Author Email: moup@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Made available in DSpace on 2014-03-14T20:14:23Z (GMT). No. of bitstreams: 2 MouETDSubmitted.pdf: 1987207 bytes, checksum: 250d5cc5e55dffd86e833e48f7678c54 (MD5) Permission.pdf: 136994 bytes, checksum: 8433d7fc6c70f891af373aaf48ef3daf (MD5)   Previous issue date: 2008-07-07"
  ],
  "handle": "28421",
  "identifier_other": "etd-07272008-224929",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07272008-224929/",
  "identifier_uri": "http://hdl.handle.net/10919/28421",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "MouETDSubmitted.pdf",
    "Permission.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Poly(Arylene Ether Sulfone)",
    "Ionomer",
    "Crosslinking",
    "Proton Exchange Membrane",
    "Reverse Osmossis Membrane"
  ],
  "title": "Synthesis, crosslinking and characterization of disulfonated poly(arylene ether sulfone)s for application in reverse osmosis and proton exchange membranes",
  "type": "Dissertation"
}