{
  "contributor_author": "Myles, Kimberly",
  "contributor_committeechair": "Smith-Jackson, Tonya L.",
  "contributor_committeemember": [
    "Babski-Reeves, Kari L.",
    "Cuqlock-Knopp, V. Grayson",
    "Kalb, Joel T.",
    "Winchester, Woodrow W. III"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:14:23Z",
  "date_adate": "2009-08-06",
  "date_available": "2014-03-14T20:14:23Z",
  "date_issued": "2009-07-07",
  "date_rdate": "2009-08-06",
  "date_sdate": "2009-07-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Many military conflicts are fought in urban environments that subject the U.S. soldier to a number of challenges not otherwise found in traditional battle.  In the urban environment, the soldier is subject to threatening attacks not only from the organized army but also from civilians who harbor hostility.  U.S. enemies use the civilian crowd as an unconventional tactic to blend in and look like civilians, and in response to this growing trend, soldiers must detect and identify civilians as a threat or non-threat.  To identify a civilian as a threat, soldiers must familiarize themselves with behavioral cues that implicate threatening individuals.  This study elicited expert strategies regarding how to use nonverbal cues to detect a threat and evaluated the best medium for distinguishing a threat from a non-threat to develop a training guide of heuristics for training novices (i.e., soldiers) in the threat detection domain.  Forty experts from the threat detection domain were interviewed to obtain strategies regarding how to use nonverbal cues to detect a threat (Phase 1).  The use of nonverbal cues in context and learning from intuitive individuals in the domain stood out as strategies that would promote the efficient use of nonverbal cues in detecting a threat.  A new group of 14 experts judged scenarios presented in two media (visual, written) (Phase 2).  Expert detection accuracy rates of 61% for the visual medium and 56% for the written medium were not significantly different, F (1, 13) = .44, p = .52.  For Phase 3 of the study, a training development guide of heuristics was developed and eight different experts in the threat detection domain subjectively rated the heuristics for their importance and relevance in training novices.  Nine heuristics were included in the training guide, and overall, experts gave all heuristics consistently high ratings for importance and relevance.  The results of this study can be used to improve accuracy rates in the threat detection domain and other populations: 1) the soldier, 2) the average U.S. citizen, and 3) employees of the Transportation Security Administration.",
  "description_provenance": [
    "Author Email: kmyles@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: kari@ise.msstate.edu",
    "Advisor Email: vgrayson@arl.army.mil",
    "Advisor Email: jkalb@arl.army.mil",
    "Advisor Email: wwwinche@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:23Z (GMT). No. of bitstreams: 1 Myles_Dissertation.pdf: 2816479 bytes, checksum: 24406567632e11bdab80164b81e381e5 (MD5)   Previous issue date: 2009-07-07"
  ],
  "handle": "28422",
  "identifier_other": "etd-07272009-131715",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07272009-131715/",
  "identifier_uri": "http://hdl.handle.net/10919/28422",
  "publisher": "Virginia Tech",
  "relation_haspart": "Myles_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "covert mischievous intentions",
    "threat detection",
    "urban environment",
    "MOUT",
    "judgment and decision making",
    "nonverbal behavior"
  ],
  "title": "Activity-Based Target Acquisition Methods for Use in Urban Environments",
  "type": "Dissertation"
}