{
  "contributor_author": "King, Steve Russell",
  "contributor_committeechair": "Hagood, Edward Scott Jr.",
  "contributor_committeemember": [
    "Wilson, Henry P.",
    "Orcutt, David M.",
    "Westwood, James H.",
    "Brann, Daniel E."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:14:24Z",
  "date_adate": "2002-08-07",
  "date_available": "2014-03-14T20:14:24Z",
  "date_issued": "2002-07-16",
  "date_rdate": "2003-08-07",
  "date_sdate": "2002-07-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Field experiments were conducted in Virginia to evaluate the efficacy of AEF-130060 03 plus AEF-107892 applied postemergence (POST) for the control of Italian ryegrass [<i>Lolium multiflorum </i>(Lam)] in barley [<i>Hordeum vulgare </i>(L.)] in comparison to other herbicides currently registered for use in wheat [<i>Triticum aestivum </i>(L.)] and barley.  Laboratory experiments were also conducted to evaluate absorption, translocation and metabolism of AEF-130060 03 plus AEF-107892 in wheat, barley, and Italian ryegrass with or without the addition of dicamba.  AEF-130060 03 plus AEF-107892 was applied alone at three POST timings.  All of these applications were effective in controlling Italian ryegrass.  The third application timing of AEF-130060 03 plus AEF-107892 commonly resulted in lower yields than the first or second application timing, due to increased duration of Italian ryegrass competition, increased barley injury and insufficient time for barley recovery from this injury.  In the field experiment, significantly greater barley injury was observed when AEF-130060 03 plus AEF-107892 was combined with 2,4-D and dicamba.  Early postemergence (EP) treatments of AEF-130060 03 plus AEF-107892 provided control of Italian ryegrass equivalent to that of delayed preemergence (DPRE) applications of flufenacet plus metribuzin when rainfall was received.  However, when rainfall was not received AEF-130060 03 plus AEF-107892 provided superior control.  Because the efficacy of AEF-130060 03 plus AEF-107892 is not dependant on rainfall, it should provide more consistent control of Italian ryegrass than DP treatments.  Laboratory experiments indicated that Italian ryegrass absorbed greater than 2.5, 2.0, and 1.5 times the amount of applied radioactivity at 24, 48, and 96 hours after treatment (HAT), respectively, than wheat or barley.  Metabolism experiments indicated that quantity of parent compound in the three species was greatest in Italian ryegrass, followed by barley and then wheat. However, the sum total of metabolites was not different between species.  A higher rate of metabolism of AEF-130060 03 plus AEF-107892 was also observed in wheat and barley than in Italian ryegrass.  Thus, lower absorption of herbicide by wheat and barley, coupled with a more rapid rate of metabolism, most likely accounts for differential selectivity between these plant species.  No differences in absorption, translocation or metabolism were observed within the three plant species due to the addition of dicamba. An additional experiment was conducted in 2000 and 2001 to evaluate the efficacy of preemergence (PRE) and EP applications of DPX-R6447 for the control of Italian ryegrass in wheat and barley in comparison to other herbicides currently registered for use in these crops.  Barley and wheat injury and yield were similar with treatments of DPX-R6447 at rates below 176 g ai/ha and treatments of flufenacet plus metribuzin applied alone in both years.  Consistent Italian ryegrass control with DPX-R6447 occurred only with rates of 176 g ai/ha or greater in both years.  However, these rates resulted in variable injury in both wheat and barley between years.  Rates higher than 176 g ai/ha of DPX-R6447 resulted in unacceptable barley and wheat injury.  The lack of consistency with regard to barley and wheat injury could limit the utility of this compound in these crops.   Field trials were conducted in Virginia to evaluate herbicide programs for control of Italian ryegrass in no-till corn [<i>Zea mays </i>(L.)] establishment.  Herbicide programs using transgenic corn hybrids were compared to standard programs that utilize non-selective herbicides in combination with high rates of triazine herbicides.  Italian ryegrass control and corn yields similar to those provided by standard programs could be attained through the use of paraquat plus atrazine, and glyphosate applied in combination with atrazine or rimsulfuron plus thifensulfuron-methyl.  In glyphosate-tolerant corn, EP applications of glyphosate controlled Italian ryegrass, but yield did not differ from yields of corn treated with standard PRE applications of glyphosate plus atrazine.  The use of glufosinate, imazethapyr plus imazapyr, or sethoxydim with appropriate herbicide-tolerant hybrids did not demonstrate potential for improved control of Italian ryegrass. Field experiments were also conducted to investigate the incidence and severity of maize chlorotic dwarf virus (MCDV) and maize dwarf mosaic virus (MDMV) in response to POST johnsongrass control in two corn hybrids.  Recent observations have indicated a lack of virus-tolerance in glyphosate-tolerant corn hybrids in Virginia.  The rapidity of virus disease development in corn resulting from application of glyphosate or nicosulfuron was also investigated.  The virus-susceptible glyphosate-tolerant hybrid developed significantly higher levels of virus incidence three weeks after treatment than the virus-tolerant, non-transgenic hybrid, and virus incidence and severity increased throughout the duration of the growing season.  Little or no disease incidence occurred in the virus-tolerant hybrid.  The virus-susceptible hybrid exhibited significant increases in disease incidence in response to any herbicide treatment applied to johnsongrass-containing plots relative to the same treatment applied to weed free plots.  Johnsongrass control with nicosulfuron or glyphosate caused similar disease incidence and severity in the virus-susceptible hybrid, regardless of application method.  Results of these experiments indicated that growers' choice of hybrid should focus primarily on disease resistance rather than herbicide resistance.",
  "description_provenance": [
    "Author Email: stking4@vt.edu",
    "Advisor Email: hwilson@vt.edu",
    "Advisor Email: dmorcutt@vt.edu",
    "Advisor Email: westwood@vt.edu",
    "Advisor Email: shagood@vt.edu",
    "Advisor Email: dbrann@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:24Z (GMT). No. of bitstreams: 8 srking_7_chapter_5.pdf: 354477 bytes, checksum: 5dbf1ae5fd050e65f54d53e375b8172d (MD5) srking_1_title_abstract.pdf: 311547 bytes, checksum: 50a2afe8a30f207a17378cc2bb8d2eed (MD5) srking_8_vita.pdf: 240735 bytes, checksum: f7f27e4831453ff91b635d584a45a692 (MD5) srking_3_chapter_1.pdf: 412670 bytes, checksum: 14286128cc4e7b6b79545429c59f5b0a (MD5) srking_4_chapter_2.pdf: 485034 bytes, checksum: 6ab9c35570dadf19c55893e5b08373e3 (MD5) srking_6_chapter_4.pdf: 344485 bytes, checksum: 13a925ab70cbda70b2471462f42ccf21 (MD5) srking_2_toc.pdf: 286580 bytes, checksum: 4ec9071984915cfceb285a3f676d553f (MD5) srking_5_chapter_3.pdf: 350463 bytes, checksum: bc43fa8a2bb8c08d7cae34afc9c32d1f (MD5)   Previous issue date: 2002-07-16"
  ],
  "handle": "28427",
  "identifier_other": "etd-07282002-165747",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07282002-165747/",
  "identifier_uri": "http://hdl.handle.net/10919/28427",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "srking_7_chapter_5.pdf",
    "srking_1_title_abstract.pdf",
    "srking_8_vita.pdf",
    "srking_3_chapter_1.pdf",
    "srking_4_chapter_2.pdf",
    "srking_6_chapter_4.pdf",
    "srking_2_toc.pdf",
    "srking_5_chapter_3.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "translocation",
    "herbicides",
    "crops",
    "metabolism",
    "weed control",
    "absorption"
  ],
  "title": "Investigation of Methods and Mechanisms of Control of Italian Ryegrass (<i>Lolium multiflorum</i>) in Corn (<i>Zea mays</i>) and Small Grains and of the Effects of Johnsongrass (<i>Sorghum halepense</i>) Control on Virus Diseases in Glyphosate-Tolerant Corn",
  "type": "Dissertation"
}