{
  "contributor_author": "Barokas, Judy",
  "contributor_committeechair": "Lichtman, Marilyn V.",
  "contributor_committeemember": [
    "Fortune, Jimmie C.",
    "Gerstein, Martin",
    "Keith, Timothy Z.",
    "Little, Linda F."
  ],
  "contributor_department": "Educational Research, Evaluation, and Policy Studies",
  "date_accessioned": "2014-03-14T20:14:27Z",
  "date_adate": "2008-07-28",
  "date_available": "2014-03-14T20:14:27Z",
  "date_issued": "1992-06-01",
  "date_rdate": "2010-03-08",
  "date_sdate": "2008-07-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This study developed and tested a model of midlife women's attainments, commitments and satisfactions under differing conditions of marriage and parenthood. The model proposed that life satisfaction for women is a function of three sets of influences: (1) adult status attainments, (2) home and work commitments, and (3) home and work satisfactions. These three sets of influences, in turn, are a function of three predetermined and correlated conditions: (1) health, (2) early childhood status and (3) educational attainment.</p><p> The model was developed using data from a cohort of midlife women drawn from the National Survey of Families and Households. The model was then tested on subsamples from that cohort using LISREL 7.</p><p> Tests of the model revealed both similarities and differences in the processes of attainment of life satisfaction for all midlife women, for those with and without husbands, and for those with and without children. In tests of the individual models, health and satisfaction with one's role at home were the primary factors influencing life satisfaction for women. Work commitment was also a significant, and negative, predictor.</p><p> Tests of the model across stacked groups, however, failed to clarify specific structural differences due to marital or parental status. For women with and without husbands, differences in both the measurement and structural models across the groups were found to be statistically insignificant. For women with and without children, however, cross-group comparisons revealed significant differences in the measurement and structural models. Because of measurement differences, however, even statistically significant structural differences could not be considered meaningful estimates of variance in patterns of influence across the groups.</p><p> This study provides only a beginning toward understanding the complex relations among midlife women's attainments, commitments and satisfactions. The proposed model fits the data better for women with husbands and for women without children than for other individually or jointly tested samples.</p><p> Family formation appears to influence the process of attainments, commitments and satisfactions, but additional research is needed to continue to unravel the complexities of interrelationship. Yet, preliminary conclusions remind counselors and policymakers that traditional conceptions of status attainments are not the only considerations for career or life planning for women.</p>",
  "description_provenance": [
    "Author Email: jbarokas@consultingresearch.net",
    "Made available in DSpace on 2014-03-14T20:14:27Z (GMT). No. of bitstreams: 1 LD5655.V856_1992.B377.pdf: 5921988 bytes, checksum: 96070124dde6c4dba016f27e3c6428cf (MD5)   Previous issue date: 1992-06-01"
  ],
  "format_medium": "BTD",
  "handle": "28435",
  "identifier_other": "etd-07282008-134938",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07282008-134938/",
  "identifier_uri": "http://hdl.handle.net/10919/28435",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1992.B377.pdf",
  "subject": [
    "Middle-aged women",
    "Satisfaction",
    "Psychology"
  ],
  "subject_lcc": "LD5655.V856 1992.B377",
  "title": "Development and test of a causal model of midlife women's attainments, commitments and satisfactions",
  "type": "Dissertation"
}