{
  "contributor_author": "Grimes-Crump, Ruth H.",
  "contributor_committeecochair": [
    "Crumwell, Sidney E. Jr.",
    "Salmon, Richard G."
  ],
  "contributor_committeemember": [
    "Worner, Wayne Dempsey",
    "Scott, Delores W.",
    "Salzberg, Cora S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:14:29Z",
  "date_adate": "2001-11-30",
  "date_available": "2014-03-14T20:14:29Z",
  "date_issued": "2000-05-08",
  "date_rdate": "2002-11-30",
  "date_sdate": "2001-07-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "VIRGINIA TEACHER LICENSURE             EXAMINATION POLICY: INTENDED AND               UNINTENDED EFFECTS ON TEACHER          AVAILABILITY AND MINORITY REPRESENTATION                        Ruth H.Grimes-Crump                             (ABSTRACT)  \tA major component of the screening process for prospective teachers is the licensure examination.  The examination serves two important functions:  (a) sorting and screening candidates and (b) defining the knowledge base for professional practice.  The first function receives the most attention from policymakers and serves the symbolic purpose of creating selectivity for entry into the profession.  Initial entry typically is controlled by raising or lowering examination passing requirements which simply allows more or fewer persons to pass (Darling-Hammond, Wise & Klein, 1995).  The second function presumes that a single instrument exists that not only contains the essential knowledge required for professional practice, but accurately identifies those most qualified to teach. \tThe Virginia Board of Education (VBOE), like several other state boards of education, has authorized validation and standard-setting studies related to its teacher licensure examination policy, and the most recent studies have occurred in the past 20 years.  The first study was authorized in April 1981 for the potential use of the National Teachers Examination (NTE).  Following completion of validation studies for the Specialty Area Tests and the Core Battery Tests, the NTE was adopted as Virginia's licensure examination which was made effective on July 1, 1986.  \tTen years later (effective July 1, 1996), the VBOE agreed that prospective teachers would be required to take Praxis I Academic Skills Assessments.  Praxis I would replace the NTE Core Battery, however, and the original NTE Specialty Area Tests would be retained. The decision to change teacher licensing examinations was precipitated primarily by the announcement by Educational Testing Service (ETS) that it would introduce new tests and eventually discontinue the NTE Core Battery. The passing requirements for Praxis I (as established in 1995) exceeded those of all states administering the test and were as follows:  reading and mathematics - 178, and writing - 176.  Review of test data obtained after the effective date of this policy revealed that the passing percentage for all test takers in 1995-96 was reading 72; mathematics 62; and writing 58.  For minorities, the passing percentages were 34, 18, and 18, respectively.  When these results were compared to test taker performance one year later (1996-97), there were modest percentage increases for all test takers:  reading - 74; mathematics - 66; and writing - 63.   For minorities, passing percentages were  36, 35 and 28, respectively. \t Despite these increases, 26 percent of all test takers failed the reading test; 34 percent failed the mathematics test; and 37 percent failed the writing test.  The long-range effects of the Praxis I passing requirements on test takers are unknown; however, one of the near-term effects likely will be a reduction in the passing rate for a significant number of persons, particularly racial minorities. \tThis study examined current Virginia teacher licensure policy, its intent, and near-term effects of examination results on teacher availability and minority representation.",
  "description_provenance": [
    "Author Email: rgrimescru@aol.com",
    "Advisor Email: crumwell@access.etsu.edu",
    "Advisor Email: wworner@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: dwscott@vuu.edu",
    "Advisor Email: salzberg@schev.edu",
    "Made available in DSpace on 2014-03-14T20:14:29Z (GMT). No. of bitstreams: 2 Resumevitavt.pdf: 71181 bytes, checksum: e855b56fc83e1cffaa338ce2c182f7c0 (MD5) POORMEE1.pdf: 521542 bytes, checksum: 53eadd8a797fe49584e8fa48da6185a1 (MD5)   Previous issue date: 2000-05-08"
  ],
  "handle": "28445",
  "identifier_other": "etd-07292001-005919",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07292001-005919/",
  "identifier_uri": "http://hdl.handle.net/10919/28445",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Resumevitavt.pdf",
    "POORMEE1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "minority representation",
    "Virginia",
    "Praxis",
    "National Teachers Exammination",
    "teacher qualifications",
    "cut scores",
    "teacher preparation institutions",
    "teacher shortage",
    "policymakers",
    "teacher availability",
    "teacher shortage"
  ],
  "title": "Virginia Teacher Licensure Examination Policy:  Intended and Unintended Effects on Teacher Availability and Minority Representation",
  "type": "Dissertation"
}