{
  "contributor_author": "Bouldin, John Conrad",
  "contributor_committeecochair": [
    "Loferski, Joseph R.",
    "Hindman, Daniel P."
  ],
  "contributor_committeemember": [
    "Woeste, Frank E.",
    "Kline, D. Earl",
    "Buehlmann, Urs K."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:14:31Z",
  "date_adate": "2011-08-16",
  "date_available": "2014-03-14T20:14:31Z",
  "date_issued": "2011-06-29",
  "date_rdate": "2012-11-29",
  "date_sdate": "2011-07-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The use of engineered wood products (EWP) in residential construction has increased in recent years.  Most specifications for the installation of these components are found in proprietary manufacturer literature rather than in the building code.  Although some home inspections include EWP prescriptive compliance, very little applied and academic literature addresses this practice.  This lack of practical information and the lack of standardized inspection methods can result in undetected non-compliant EWP installations that fail to meet the minimum safety provisions of the building code.   <p> The goal of this project was to develop a visual inspection methodology, associated knowledge base, and software application for the inspection of EWPs and connector hardware (CH) in new residential construction at the pre-drywall stage.  The methodology was based upon subject matter expert (SME) inputs and validation was derived from the use of a modified Delphi method that was able to the gather, collate, refine, and validate the research process and outputs based on the expertise of the subject matter experts.  The concept of high face validity was used to establish project validity.   <p> Installation problems with EWPs and CH were noted by the SMEs partly because the use and installation instructions for proprietary products are not found in building codes.  Building code officials (BCO) and home inspector (HI) SME responses indicated a need for a methodology and software to aid in the inspection process.  Although authoritative reference materials for prescriptive installation are available, the scope of material is not consistent between manufacturers, and is presented in different formats for different brands.   The developed software application provides ready access to reference materials needed for EWP and CH installations. <p> No widely accepted inspection methodology is available, although the HI SMEs used systematic inspection methods.  Inspection methods such as the top-down method and sighting along the patterns of repetitious framing elements can improve the detection of non-compliant installations.  BCO and HI SMEs identified both component-specific and zone-specific techniques as a part of the systematic inspection methodology.   Definable high risk areas for each EWP and CH were identified and the associated inspection methods may help the inspector reduce the incidence of undetected problem areas.  Knowledge of the high-risk areas may also enhance the inspection.  <p>  The developed software application was found to be a useful inspection tool.  BCO and HI SMEs determined that functions of the computer software necessary for use included ease of use, onboard reference materials, specific inspection techniques, prepared comments, and technical illustrations.",
  "description_provenance": [
    "Author Email: woodyzz@vt.edu",
    "Advisor Email: jlofersk@vt.edu",
    "Advisor Email: dhindman@vt.edu",
    "Advisor Email: fwoeste@vt.edu",
    "Advisor Email: kline@vt.edu",
    "Advisor Email: ubuehlm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:31Z (GMT). No. of bitstreams: 2 Bouldin_JohnC_D_2011.pdf: 48518938 bytes, checksum: e3535f1a2dd4cb3b9f36a3c118b4e6c8 (MD5) Bouldin_JohnC_D_2011_Permissions.pdf: 967180 bytes, checksum: 2a7ca1e060264dad5f32bb0d9fd31be8 (MD5)   Previous issue date: 2011-06-29"
  ],
  "handle": "28448",
  "identifier_other": "etd-07292011-130330",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07292011-130330/",
  "identifier_uri": "http://hdl.handle.net/10919/28448",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Bouldin_JohnC_D_2011.pdf",
    "Bouldin_JohnC_D_2011_Permissions.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "residential construction",
    "methodology",
    "inspection",
    "engineered wood products"
  ],
  "title": "Methodology for the Visual Inspection of Selected Engineered Wood Products and Connector Hardware for Prescriptive Non-Compliance at the Pre-Drywall Stage of Residential Construction",
  "type": "Dissertation"
}