{
  "contributor_author": "Ratliff, Thomas N.",
  "contributor_committeecochair": [
    "Ryan, John W.",
    "Wimberley, Dale W."
  ],
  "contributor_committeemember": [
    "Hawdon, James E.",
    "Mollin, Marian B.",
    "Precoda, Karl R."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:14:31Z",
  "date_adate": "2011-08-24",
  "date_available": "2014-03-14T20:14:31Z",
  "date_issued": "2011-07-28",
  "date_rdate": "2012-04-12",
  "date_sdate": "2011-07-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Social movement scholars have contended that considerable research on protest policing has been done, but research testing multiple theories in recent decades is lacking. To resolve this gap in the literature, this study integrates major paradigms in repression research and theories of policing styles around a dramaturgical approach to collective action, identifying factors influencing violence at social protests in the United States from 2006-2009. Conceiving of social protest as a form of political and symbolic action, I maintain that social actors and the qualities of their actions and immediate environment importantly influence a protest eventâ  s characteristics and outcomes. Specifically, I code for three violent outcomesâ  arrests, police violence, and any violenceâ  and one measure of threatâ  police presence. I identify four components of the protest event which influence these outcomesâ  actors (e.g., authorities, protesters, and counterprotesters), enemies (e.g., the target of protestersâ   claims), the stage (e.g., qualities of place and space where a protest occurs), and protest performance (e.g., protest size and specific tactics employed by actors). Thus, this research focuses on how qualities of police, protester, and counterprotester performances intersect to influence violence at protest events. Data for this project were collected from multiple sources from 2006-2009. Information on protest events was collected by content coding of newspaper articles in the Los Angeles Times and New York Times. Information on community policing styles was derived from lists of funding for agencies participating in the U.S. Department of Justiceâ  s Community Oriented Policing Services (COPS) program. In some instances the results of this study show that certain characteristics leading to police presence and violence at social protests in the U.S. persist from research conducted on earlier decadesâ  presence of African Americans or counterprotesters, protester use of â  more confrontationalâ   tactics and/or multiple tactics, and the damaging of property by protesters or counterprotesters. However, my findings also contradict previous studies, because I find that: (1) larger protests are less likely to be policed or result in violence; (2) social and cultural targets are more likely predictors of policing and violence rather than government or economic ones; and, (3) specific social movement families and tactical types influence protest event outcomes differently. I also found that community policing styles had no effect on protest event policing. These findings are important because they show how a protest eventâ  s symbolic nature influences policing and violent outcomes.",
  "description_provenance": [
    "Author Email: thomas.n.ratliff@gmail.com",
    "Advisor Email: johnryan@vt.edu",
    "Advisor Email: dale.wimberley@vt.edu",
    "Advisor Email: hawdonj@vt.edu",
    "Advisor Email: mmollin@vt.edu",
    "Advisor Email: karlp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:31Z (GMT). No. of bitstreams: 1 Ratliff_TN_D_2011_2.pdf: 757173 bytes, checksum: e82f1a8459e6f133de2a0f53db4f51ae (MD5)   Previous issue date: 2011-07-28"
  ],
  "handle": "28449",
  "identifier_other": "etd-07292011-161215",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07292011-161215/",
  "identifier_uri": "http://hdl.handle.net/10919/28449",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ratliff_TN_D_2011_2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "social performance",
    "repression and social control",
    "social protest",
    "U.S. social movements",
    "dramaturgy",
    "collective violence",
    "policing"
  ],
  "title": "On the Stage of Change: A Dramaturgical Approach to Violence, Social Protests, and Policing Styles in the U.S.",
  "type": "Dissertation"
}