{
  "contributor_author": "Kasap, Murat",
  "contributor_committeechair": "Chen, Jiann-Shin",
  "contributor_committeemember": [
    "Newton, William E.",
    "Gregory, Eugene M.",
    "Claus, G. William",
    "White, Robert H."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:14:29Z",
  "date_adate": "2002-08-01",
  "date_available": "2014-03-14T20:14:29Z",
  "date_issued": "2002-07-12",
  "date_rdate": "2003-08-01",
  "date_sdate": "2002-07-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "(ABSTRACT) \tThe onset of solvent production by the clostridia involves regulation at the transcriptional level. The signal triggering the onset has not been identified, but redox and energetic states have been suggested as possible factors.  Because several solvent-producing clostridia, including Clostridium acetobutylicum and Clostridium beijerinckii, are nitrogen-fixing organisms and both nitrogen-fixation and alcohol production (n-butanol, isopropanol and ethanol) are reductant-dependent processes, the effect of nitrogen fixation on the onset and progression of solvent production in C. beijerinckii NRRL B593 and vice versa was investigated.  For this purpose, a defined growth medium containing three amino acids was developed for C. beijerinckii NRRL B593, and this medium was used for growing solvent-producing and nitrogen-fixing cultures. The nitrogen-fixing cultures produced solvents with a solventogenic shift, which appeared to coincide with a decrease in nitrogen-fixing activity.  Measurement of specific activities of acetoacetate decarboxylase and aldehyde dehydrogenase and Northern blot analysis of the mRNA of the solvent-producing genes in samples harvested periodically from a nitrogen-fixing culture of C. beijerinckii showed the presence of both enzyme activities and the mRNA carrying the solvent-production genes throughout incubation.  A 2.5-fold increase in the specific activity of acetoacetate decarboxylase and a 4.5-fold increase in the specific activity of aldehyde dehydrogenase were observed when the activities in the latest cell-free extract was compared with the activities in the earliest cell-free extract.  When C. beijerinckii was grown in the medium containing 4 mM ammonium acetate, the onset of nitrogen fixation coincided with the onset of solvent production and prevented accumulation of solvents to high levels, which suggested competition between alcohol-producing enzymes and nitrogenase for the reductant.   Recently, a 20-kb region of the genomic DNA of C. beijerinckii NRRL B593 that contained the nif genes and ORFs with other putative functions was sequenced in our laboratory.  An examination of the nif clusters of C. beijerinckii, C. acetobutylicum and C. pasteurianum revealed apparent differences in the intervening ORFs which suggested differences in the regulation of nitrogen fixation in these organisms.  Transcriptional analysis of genes in the nif cluster of C. beijerinckii by Northern blotting revealed four different transcripts.  The absence of mRNAs of the nif-associated ORFs in RNA samples isolated from non-nitrogen-fixing cells indicated that the nif-associated ORFs are regulated in parallel to the nif genes.  By studying the effect of ammonia addition on nitrogen-fixing activities of C. beijerinckii and C. pasteurianum, significant differences in the regulation of nitrogen-fixation in the two species were observed.  C. beijerinckii NRRL B593, but not C. pasteurianum,  showed a rapid decrease in nitrogen-fixing activity in vivo upon ammonium acetate addition.  However, measurement of nitrogen-fixing activities in vitro before and after ammonium acetate addition showed the presence of active nitrogenase throughout growth in both organisms.  The results suggest that the nitrogenase activity in C. beijerinckii NRRL B593 is inhibited when ammonia is available.  A second nifH-hybridizing mRNA was detected in Northern blots during studies of the expression of nifH1 in C. pasteurianum.   The mRNA was identified as that from either the nifH2 or nifH6 gene after sequencing the cDNA strands, which were generated by RT (Reverse Transcriptase)-PCR.  In addition, Western blot analysis of the cell-free extracts of nitrogen-fixing cells of C. pasteurianum indicated the presence of a second NifH-related polypeptide.  The two NifH-related polypeptides were separated by preparative gel electrophoresis and characterized by MALDI-TOF (Matrix-assisted Laser Desorption Ionization Time-Of-Flight) mass spectrometry.  The results suggested the expression of NifH2/H6 protein in nitrogen-fixing cells of C. pasteurianum.  The physiological significance of the expression of the nifH2 or nifH6 gene or both is yet to be determined.",
  "description_provenance": [
    "Author Email: mkasap@vt.edu",
    "Advisor Email: wenewton@vt.edu",
    "Advisor Email: chenjs@vt.edu",
    "Advisor Email: gregorye@vt.edu",
    "Advisor Email: clausgw@vt.edu",
    "Advisor Email: rhwhite@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:29Z (GMT). No. of bitstreams: 1 THESIS.pdf: 1632825 bytes, checksum: b481aa48835cb422b09d38066068466c (MD5)   Previous issue date: 2002-07-12"
  ],
  "handle": "28446",
  "identifier_other": "etd-07292002-130002",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07292002-130002/",
  "identifier_uri": "http://hdl.handle.net/10919/28446",
  "publisher": "Virginia Tech",
  "relation_haspart": "THESIS.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "nif genes",
    "Clostridium beijerinckii",
    "solvent production",
    "nitrogen fixation"
  ],
  "title": "Nitrogen Metabolism and Solvent Production in Clostridium Beijerinckii Nrrl B593",
  "type": "Dissertation"
}