{
  "contributor_author": "Cortes Bermudez, Diego Fernando",
  "contributor_committeechair": "Shulaev, Vladimir",
  "contributor_committeemember": [
    "Mendes, Pedro J. P.",
    "Dickerman, Allan W.",
    "Laubenbacher, Reinhard C.",
    "Winkel, Brenda S. J."
  ],
  "contributor_department": "Genetics, Bioinformatics, and Computational Biology",
  "date_accessioned": "2014-03-14T20:14:33Z",
  "date_adate": "2008-08-19",
  "date_available": "2014-03-14T20:14:33Z",
  "date_issued": "2008-07-25",
  "date_rdate": "2009-08-19",
  "date_sdate": "2008-07-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In the post-genomic era, one of the most important goals for the community of plant biologists is to take full advantage of the knowledge generated by the Arabidopsis thaliana genome project, and to employ state-of-the-art functional genomics techniques to assign function to each gene. This will be achieved through a complete understanding of what all cellular components do, and how they interact with one another to produce a phenotype.    Among the proteins encoded by the Arabidopsis genome are 24 related carboxyl methyltransferases that belong to the SABATH family. Several of the SABATH methyltransferases convert plant hormones, like jasmonic acid, indole-3-acetic acid, salicylic acid, gibberellins, and other plant constituents into methyl esters, thereby regulating the biological activity of these molecules and, consequently, myriad important physiological processes.    Our research aims to decipher the function of proteins belonging to the SABATH family by applying a combination of genomics tools, including genome-wide expression analysis and gas-chromatography coupled with mass spectrometry-based metabolite profiling. Our results, combined with available biochemical information, provide a better understanding of the physiological role of SABATH methyltransferases, further insights into secondary plant metabolism and deeper knowledge of the consequences of modulating the expression of SABATH methyltransferases, both at the genome-wide expression and metabolite levels.",
  "description_provenance": [
    "Author Email: dfcortes@vt.edu",
    "Advisor Email: vshulaev@vt.edu",
    "Advisor Email: mendes@vt.edu",
    "Advisor Email: dickerman@vt.edu",
    "Advisor Email: reinhard@vt.edu",
    "Advisor Email: winkel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:33Z (GMT). No. of bitstreams: 1  DFCortes_Dissertation.pdf: 19620037 bytes, checksum: 85477a6a992bed10d854fb18457c4260 (MD5)    Previous issue date: 2008-07-25"
  ],
  "handle": "28457",
  "identifier_other": "etd-07302008-150312",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07302008-150312/",
  "identifier_uri": "http://hdl.handle.net/10919/28457",
  "publisher": "Virginia Tech",
  "relation_haspart": "DFCortes_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Genomics",
    "SABATH Methyltransferases",
    "Plant Signaling Molecules",
    "Metabolomics",
    "Transcriptomics"
  ],
  "title": "Functional genomics through metabolite profiling and gene expression analysis in Arabidopsis thaliana",
  "type": "Dissertation"
}