{
  "contributor_author": "Bieryla, Kathleen Ann",
  "contributor_committeechair": "Madigan, Michael L.",
  "contributor_committeemember": [
    "Nussbaum, Maury A.",
    "Duma, Stefan M.",
    "Gabler, Hampton Clay",
    "Granata, Kevin P."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:14:33Z",
  "date_adate": "2009-08-12",
  "date_available": "2014-03-14T20:14:33Z",
  "date_issued": "2009-07-27",
  "date_rdate": "2012-05-08",
  "date_sdate": "2009-07-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Approximately one in three adults 65 years and older fall each year and these falls lead to a substantial number of serious injuries and deaths.  Numerous interventions have been proposed for fall-prevention but the efficacy can vary, and may be due to the general nature of the interventions.  Older adults may be able to improve their ability to recover from a postural perturbation through perturbation-based balance training (PBBT), similar to the way other motor skills can be improved through training.<p>  The purpose of the first study was to investigate the effects of age and fall risk on the efficacy of PBBT.  Participants (young adults, older adults at low-risk of falling, older adults at high-risk of falling) completed PBBT on a moving platform three times a week for one month.  Balance was quantified using the time to stabilization of the COP and normalized to platform displacement (nTTS), where a decrease in nTTS can be interpreted as an improvement in balance.   A significant main effect of group revealed high-risk fallers had a significantly higher nTTS than young adults and a significant main effect of session revealed nTTS was significantly lower one week and one month post-training than before training.  <p>  The purpose of the second study was to investigate the effect of training amount on the efficacy of PBBT in older adults.  Ten healthy older adults completed PBBT either three times a week or five times a week for four weeks.  Both training amounts were sufficient for significant improvements in nTTS one week after training.  However, training five times a week was necessary for older adults to maintain improvements in nTTS one month post training.     <p> The purpose of the third study was to investigate the need for PBBT after strength training in order to improve balance in older adults.  A torque-driven, three-segment, musculoskeletal model and forward dynamic simulations were used to address the hypothesis.  Increasing joint strength was beneficial in recovering balance from a postural perturbation only after re-optimization of the torque activation.  These results provide support for supplementing strength training fall prevention interventions in older adults with task-related practice.",
  "description_provenance": [
    "Author Email: kbieryla@vt.edu",
    "Advisor Email: nussbaum@vt.edu",
    "Advisor Email: duma@vt.edu",
    "Advisor Email: mlm@vt.edu",
    "Advisor Email: gabler@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:33Z (GMT). No. of bitstreams: 1 bieryla_phd_etd_v2.pdf: 2283794 bytes, checksum: 470abc3e768f04f357688e13475db5c9 (MD5)   Previous issue date: 2009-07-27"
  ],
  "handle": "28459",
  "identifier_other": "etd-07302009-131825",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07302009-131825/",
  "identifier_uri": "http://hdl.handle.net/10919/28459",
  "publisher": "Virginia Tech",
  "relation_haspart": "bieryla_phd_etd_v2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "perturbation-based balance training",
    "older adults",
    "optimization",
    "falls"
  ],
  "title": "An investigation of perturbation-based balance training as a fall prevention intervention for older adults",
  "type": "Dissertation"
}