{
  "contributor_author": "Thongsukmag, Juthamas",
  "contributor_committeechair": "Wiswell, Albert W.",
  "contributor_committeemember": [
    "Lawrence, Harriet",
    "Boucouvalas, Marcie",
    "Belli, Gabriella M.",
    "French, Larry"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:14:32Z",
  "date_adate": "2003-08-14",
  "date_available": "2014-03-14T20:14:32Z",
  "date_issued": "2003-06-30",
  "date_rdate": "2003-08-14",
  "date_sdate": "2003-07-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Fear in the Workplace: The Relationships Among Sex, Self-efficacy, and Coping Strategies  By   Juthamas Thongsukmag  Albert K. Wiswell, Chair   (ABSTRACT)  This study adopts the components of protection motivation theory to examine the differences between coping strategies used by males and females when dealing with four unique work-related fearful situations: fear of separation, fear of punishment, fear of embarrassment and fear of harm.  Specifically, the components that are referenced include coping appraisal (self-efficacy) and threat appraisal (severity and vulnerability). Four different vignettes and a series of questions related to each of the fearful situations were presented to individuals willing to participate in the study. A total of 235 working professional graduate students and a group of full time professionals representing industries such as telecommunications, health care, and retail contributed to the study. While the first group (graduate students) was presented with the traditional paper-pencil questionnaire, the latter group was solicited to participate in the study via a sophisticated web-based instrument.  Once the responses were received, the Chi-square, t-test, and a series of ANOVA tests with post hoc testing were computed to investigate where there were differences across all the dependent measures, which includes severity of threat, vulnerability to threats, and self efficacy. Sex was mainly applied as an independent variable in most analyses. The findings suggest that among the three coping strategies, problem solving is the most dominant strategy used by males and females across all situations as a group.   However, females prefer seeking support as a coping strategy more than males do regardless of type of fears.  In contrast, males prefer avoidance coping strategies to deal with situations that provoke fear of punishment.   With regard to severity of the four fearful situations, both males and females perceived that the fear of harm scenario is the least severe while the remaining fearful scenarios are perceived as having a similar level of severity. In terms of vulnerability to the four fearful situations, males feel slightly more vulnerable to the fear of punishment scenario. Besides, males and females have comparable levels of self-efficacy.   There are weak negative relationships between self-efficacy and seeking support, and avoidance strategies.  However, self-efficacy has a positive correlation with problem solving strategies in both males and females. Research found that, the Asian ethnic group prefers to use seeking support strategy over the Black/African American and Caucasian ethnic groups.  When comparing the latter two ethnic groups, Caucasians favor seeking support strategies.",
  "description_provenance": [
    "Author Email: thongsukmag@hotmail.com, noon@vt.edu, thongsukmag@yahoo.com",
    "Advisor Email: harrietvee@erols.com",
    "Advisor Email: marcie@vt.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: awiswell@vt.edu",
    "Advisor Email: lfrench@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:32Z (GMT). No. of bitstreams: 1 workplacefear_08_06__2003_pdf.pdf: 330841 bytes, checksum: 6e2cad48c111b8e0fc58e1e3b0ec14aa (MD5)   Previous issue date: 2003-06-30"
  ],
  "handle": "28454",
  "identifier_other": "etd-07302003-144601",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07302003-144601/",
  "identifier_uri": "http://hdl.handle.net/10919/28454",
  "publisher": "Virginia Tech",
  "relation_haspart": "workplacefear_08_06__2003_pdf.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "protection motivation theory",
    "self-efficacy",
    "fear",
    "coping strategies"
  ],
  "title": "Fear in the Workplace: The Relationships among Sex, Self-efficacy, and Coping Strategies",
  "type": "Dissertation"
}