{
  "contributor_author": "Baxter, Christopher David Price",
  "contributor_committeechair": "Mitchell, James K.",
  "contributor_committeemember": [
    "Brandon, Thomas L.",
    "Duncan, James Michael",
    "Filz, George M.",
    "Rimstidt, james Donald"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:14:31Z",
  "date_adate": "1999-08-04",
  "date_available": "2014-03-14T20:14:31Z",
  "date_issued": "1999-07-15",
  "date_rdate": "2000-08-04",
  "date_sdate": "1999-07-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "There are numerous examples in the literature of time-dependent changes in the proper-ties of sands, or aging effects.  Most of these aging effects are of increases in the cone penetration resistance.  Time-dependent increases in penetration resistance have been measured in hydraulically placed fills and freshly densified deposits, with the largest in-creases following the use of ground modification techniques such as vibrocompaction, dynamic compaction, and blast densification.  It is not known what causes these increases in penetration resistance to occur.    The objective of this research was to gain an understanding of the possible mechanisms responsible for aging effects in sands.  Current hypotheses to explain what causes aging effects in sands include increased interlocking of particles, internal stress arching, and precipitation of silica or carbonate minerals at the contacts between grains.  To date, no unambiguous evidence has been presented to support these hypotheses.  A laboratory testing program was developed to study the influence of different variables on the pres-ence and magnitude of aging effects.  Three different sands were tested in rigid wall cells and buckets.  Samples were aged under different effective stresses, densities, tempera-tures, and pore fluids.  In every rigid wall cell, three independent measurements were made to monitor property changes during the aging process: small strain shear modulus using bender elements, electrical conductivity, and mini-cone penetration resistance.  At the end of each test, detailed mineralogical tests were performed to assess changes in the chemistry of the samples and pore fluids.  A total of 22 tests in rigid wall cells were per-formed with periods of aging ranging from 30 to 118 days.  Mini-cone penetration resis-tances were measured in the buckets before and at various times during the aging process.  Increases in the small strain shear modulus were measured with time.  It was found that sand type and pore fluid composition greatly influenced the amount of increase in small strain shear modulus.  Density was also found to influence the amount of increase in small strain shear modulus.  Temperature was found to have little influence on the in-crease in small strain shear modulus with time.    Changes in the chemistry of the samples were also measured with time.  The dissolution and precipitation of minerals in solution was monitored with electrical conductivity measurements.  In most of the tests, there was continual dissolution of minerals with time.  Mineralogical studies and conductivity measurements indicated precipitation of carbonates and silica in two of the tests; however, scanning electron micrographs showed no visible evidence of precipitation.  Despite the measured increases in small strain shear modulus and evidence of mineral precipitation, there were no increases in the mini-cone penetration resistance with time.  This finding is significant and suggests that small-scale laboratory experiments do not capture the mechanism(s) that are responsible for time-dependent increases in penetration resistance in the field.",
  "description_provenance": [
    "Author Email: cbaxter@vt.edu",
    "Advisor Email: jkm@vt.edu",
    "Advisor Email: tbrandon@vt.edu",
    "Advisor Email: jmd@vt.edu",
    "Advisor Email: filz@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:31Z (GMT). No. of bitstreams: 13 appen-c.pdf: 151914 bytes, checksum: 9d4e1caf41c67a7b2992a58a2e2a5269 (MD5) appen-b.pdf: 178616 bytes, checksum: dca3539049bd69232b91ea9743eb6b17 (MD5) refs.pdf: 17913 bytes, checksum: a382e413fbfe2652f014e80afc583867 (MD5) chapter7.pdf: 17207 bytes, checksum: 6ba0ac87339bcccbcaa0dca241d0f10f (MD5) chapter6.pdf: 387020 bytes, checksum: 7c8223aca47db7a7a8f3c853d8e80820 (MD5) chapter5.pdf: 488076 bytes, checksum: 56ea5ef3019ced1f292b2eeba9e145f5 (MD5) appen-a.pdf: 23162 bytes, checksum: f95cb6a700fa2e7cadd49a99ff29c3de (MD5) chapter4.pdf: 986334 bytes, checksum: 7c2befaa4e4e817a5da205c6eed0f0c3 (MD5) chapter3.pdf: 550116 bytes, checksum: c36579fc9fab44dfc3c83aef4f152bcb (MD5) chapter2.pdf: 713270 bytes, checksum: 5be50ce3ab7e04444f2a5b5740e5520f (MD5) vita.pdf: 5301 bytes, checksum: 01c065015a1b408031b308637683a618 (MD5) chapter1.pdf: 54073 bytes, checksum: c27d9f8973dbc52cf433e7e1d85da95b (MD5) Etd.pdf: 45757 bytes, checksum: 6de9a3381981b4a2ea00bffdc029371f (MD5)   Previous issue date: 1999-07-15"
  ],
  "handle": "28450",
  "identifier_other": "etd-072999-045140",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-072999-045140/",
  "identifier_uri": "http://hdl.handle.net/10919/28450",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "appen-c.pdf",
    "appen-b.pdf",
    "refs.pdf",
    "chapter7.pdf",
    "chapter6.pdf",
    "chapter5.pdf",
    "appen-a.pdf",
    "chapter4.pdf",
    "chapter3.pdf",
    "chapter2.pdf",
    "vita.pdf",
    "chapter1.pdf",
    "Etd.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "ground modification",
    "cone penetration resistance",
    "time-dependent",
    "aging"
  ],
  "title": "An Experimental Study on the Aging of Sands",
  "type": "Dissertation"
}