{
  "contributor_author": "Ludwig, Andrea  Lorene",
  "contributor_committeechair": "Hession, W. Cully",
  "contributor_committeemember": [
    "Wynn, Theresa M.",
    "Wolfe, Mary Leigh",
    "Gallagher, Daniel L.",
    "Daniels, Walter Lee"
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2014-03-14T20:14:34Z",
  "date_adate": "2010-08-04",
  "date_available": "2014-03-14T20:14:34Z",
  "date_issued": "2010-07-20",
  "date_rdate": "2010-08-04",
  "date_sdate": "2010-07-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A 0.2-hectare wetland was constructed in the floodplain of Opequon Creek in Northern Virginia as a best management practice (BMP) for stormwater management. The research goals were to 1) determine if wetland hydrology existed and quantify the role of groundwater exchange in the constructed wetland (CW) water budget, 2) estimate wetland hydraulic characteristics during overbank flows, and 3) quantify the event-scale nutrient assimilative capacity of the constructed wetland.  CW water table elevations and hydraulic gradients were measured through an array of nested piezometers. During controlled flooding events, stream water was pumped from the creek and amended with nutrients and a conservative tracer in two seasons to determine hydraulic characteristics and nutrient reduction. Samples were collected at the inlet, outlet structure, and at three locations along three transects along the wetland flowpath.   Water table elevation monitoring demonstrated that wetland hydrology existed on the site. The mean residence time of the wetland was found to be 100 min for flow-rates of 4.25-5.1 m3/min.  Residence time distributions of the high and low marsh features identified a considerable degree of flow dispersion. Manningâ  s n varied between macrotopographic features and was significantly higher in the spring event as compared to the fall event, likely due to the presence of rigid-stem vegetation. Average wetland n was 0.62. Total suspended solid concentrations decreased with increasing residence time during both experiments. Mass reduction of pollutants were 73% total suspended solids (TSS), 54% ammonia-nitrogen (NH3-N), 16% nitrate-N (NO3-N), 16% total nitrogen (TN), 23% orthophosphate-phosphorus (PO4-P), and 37% total P (TP) in the fall, and 69% TSS, 58% NH3-N, 7% NO3-N, 22% TN, 8% PO4-P, and 25% TP in the spring. Linear regression of mass flux over the event hydrograph was used to determine pollutant removal rates between the wetland inlet and outlet. Pollutant removal rates were determined through linear regression of mass flux and were higher in the spring event than in the fall. Dissolved nitrogen species were more rapidly removed than dissolved phosphorus. TSS, TP, and TN removal were greater and faster than dissolved nutrient species, suggesting that physical settling was the dominant removal mechanism for stormwater pollutants.",
  "description_provenance": [
    "Author Email: aludwig@vt.edu",
    "Advisor Email: tesswynn@vt.edu",
    "Advisor Email: mlwolfe@vt.edu",
    "Advisor Email: dang@vt.edu",
    "Advisor Email: wdaniels@vt.edu",
    "Advisor Email: chession@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:34Z (GMT). No. of bitstreams: 1 Ludwig_AL_D_2010.pdf: 43119836 bytes, checksum: e4f6d257e4a4baf854b696257ac93e09 (MD5)   Previous issue date: 2010-07-20"
  ],
  "handle": "28460",
  "identifier_other": "etd-07302010-161325",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07302010-161325/",
  "identifier_uri": "http://hdl.handle.net/10919/28460",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ludwig_AL_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Nutrient Removal",
    "Stormwater",
    "Constructed Wetlands",
    "Groundwater",
    "Phosphorus"
  ],
  "title": "Constructed Floodplain Wetland Effectiveness for Stormwater Management",
  "type": "Dissertation"
}