{
  "contributor_author": "Sharma, Amit",
  "contributor_committeechair": "Olsen, Michael D.",
  "contributor_committeemember": [
    "Christie, Iain",
    "Frechtling, Douglas C.",
    "Uysal, Muzaffer S.",
    "Murrmann, Suzanne K.",
    "Mihalik, Brian J."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:14:34Z",
  "date_adate": "2002-08-14",
  "date_available": "2014-03-14T20:14:34Z",
  "date_issued": "2002-06-17",
  "date_rdate": "2003-08-14",
  "date_sdate": "2002-07-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Co-alignment framework for Evaluating the implementation of the Tourism Satellite Accounts - A Case study of Tanzania  Amit Sharma  Abstract  The poor quality and fragmented state of international statistics for the hospitality and tourism sector lead international organizations like the World Tourism Organization (WTO), Organization of Economic Cooperation and Development (OECD) and the United Nations to develop and recognize a universally acceptable framework of tourism statistics.  These efforts culminated into the development of the Tourism Satellite Accounts (TSA), the very first sector specific Satellite System of Accounts approved by the United Nations.    The WTO has since made numerous efforts to promote the implementation of the TSA, more so in the developing countries.  While the process is gaining momentum, the implementation of the entire TSA framework is a tedious procedure requiring a high level of financial and non-financial resources.  This paradox, of scarce resources required for TSA implementation in developing countries that are in most need of its benefits, has been the crucial motivation for this research project.   The present study proposes a framework for evaluating the implementation of the TSA so that the process is manageable and is able to economize on various resources required to implement this comprehensive statistical database.  Using Tanzania as the case study, this research verifies the proposed framework for evaluating the TSA's implementation.  The underlying model for the proposed implementation framework is the Co-alignment principle from the field of Strategic Management.  Evidence of existence of the characteristics of Co-alignment model's components is verified, given the particular experience of TSA implementation in Tanzania.  The results suggest that the process in Tanzania is currently misaligned and may require reallocation of certain resources to increase the effectiveness of TSA implementation.   In context of the Co-alignment principle, there is evidence that the end-user needs have not been explicitly established.  There is also a lack of knowledge regarding gaps that exist between the current statistical databases and how the TSA would be able to fill these shortcomings.  This is true for both additional datasets required and the much needed improvements in statistical methodology.  Furthermore, there is no clear prioritization of implementation tasks, which is contributing to the lack of financial sustainability of the project.   There is indication that the allocation of current resources is misaligned with the requirements for developing institutional capacity, training, stakeholder support, (particularly with the private sector operators) and building a stable legislative framework to support the entire process.  Finally, there are no clear performance monitoring and evaluation criteria to assess the ongoing performance of the implementation process as well as that of the entire statistical database.  This is crucial to insure effectiveness of the resource allocation process.  The conclusions from these observations have been proposed as recommendations to align the process of TSA implementation in Tanzania with the objective of increasing the efficiency of these ongoing efforts at the Ministry of Natural Resources and Tourism.   Furthermore, it has been suggested that the proposed evaluation framework can be used for assessing the effectiveness of implementing any generic national or regional statistical database.",
  "description_provenance": [
    "Author Email: amsharma@vt.edu",
    "Advisor Email: ichristie@worldbank.org",
    "Advisor Email: frechtli@gwu.edu",
    "Advisor Email: samil@vt.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: bmihalik@vt.edu",
    "Advisor Email: olsenmd@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:34Z (GMT). No. of bitstreams: 1 AmitSharma-August07.pdf: 2606211 bytes, checksum: 61bdb4259bda65178c3f182a45bd2a0c (MD5)   Previous issue date: 2002-06-17"
  ],
  "handle": "28462",
  "identifier_other": "etd-07312002-165550",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07312002-165550/",
  "identifier_uri": "http://hdl.handle.net/10919/28462",
  "publisher": "Virginia Tech",
  "relation_haspart": "AmitSharma-August07.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Key words: Tourism Satellite Accounts",
    "statistics database",
    "Tanzania",
    "co-alignment principle",
    "case study",
    "economic impact",
    "System of National Accounts",
    "implementation framework"
  ],
  "title": "Co-alignment Framework for Evaluating the Implementation of the Tourism Satellite Accounts - A Case study of Tanzania",
  "type": "Dissertation"
}