{
  "contributor_author": "Stab II, Bernd Robert",
  "contributor_committeechair": "Helm, Richard F.",
  "contributor_committeemember": [
    "McDowell, John M.",
    "Bevan, David R.",
    "Sible, Jill C."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:14:35Z",
  "date_adate": "2009-08-24",
  "date_available": "2014-03-14T20:14:35Z",
  "date_issued": "2009-07-17",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-07-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Serial passaging of primary human fibroblasts leads to the formation of non-dividing senescent cells by a process termed replicative senescence. This tissue culture-based methodology is currently used as a model system to determine the underlying mechanisms of in vivo cellular aging and tumor suppression. Senescence is regarded as an alternative pathway to apoptosis, where cells undergo multiple changes in metabolic and cellular signaling pathways in order to prevent proliferation but still maintain a metabolically-active cell. Whether or not this model accurately reflects in vivo processes is presently controversial; however, replicative senescence is currently the most applicable model through which one can investigate the underlying causes of human cellular aging in the context of controlled environmental stress over time. This work was directed at understanding the molecular processes involved in replicative senescence with specific emphasis on the role of the mitochondria. <p> A series of experiments were performed to assess changes during the induction of replicative senescence under conditions of low (3%) and high (20%) oxygen levels. Measurements were made at the transcriptional, protein, and metabolite levels. Microscopy wasalso utilized to monitor changes in mitochondrial morphology and volume. While previous studies have evaluated specific pathways and/or products; this work combines a more complete metabolomic, genomic, proteomic, and morphological picture of cells undergoing senescence and oxidative stress. <p> Considering the low cell population densities of primary adherent fibroblasts and the subsequent low concentrations of small polar metabolites involved in glycolysis and the TCA cycle, methodologies needed to be developed in order to optimize metabolite extraction and liquid chromatography-mass spectrometric analysis. Protein kinase and transcriptional microarrays were also performed in order to quantify the changes in activated/deactivated signaling cascades as well as gene expression and relate these findings to metabolomic data. Mitochondrial dynamics of cells at different age time points and under different oxygen conditions were also assessed including mitochondrial size, shape, membrane potential, and percent volume per cell volume using confocal microscopy. <p> The results obtained not only confirm the major pathways involved in senescence (p53/p21, PTEN/p27, and RTK/Raf/MAPK) but also provide evidence at both the transcriptional and protein levels for additional senescence-associated pathways. The majority of the changes observed were related to pathways involved in cellular stress, cell cycle control, and the survival response. Metabolic data suggested a 창  pooling effect창   of glycolysis and TCA precursor molecules due to attenuation in enzyme function; this theory was also supported by an observed up regulation of gene expression as a compensatory mechanism. Mitochondria exhibited changes in membrane potential as well as volume and percent volume per cell which suggested compensatory hypertrophy and/or attenuation of mitochondrial fission processes. When the aforementioned analyses are tied together, a 창  theoretical model of senescence창   can be formulated and is characterized by increased metabolic protein and associated metabolite levels due to attenuation in their respective enzyme function, resulting in increases in expression of their associated genes as a compensatory mechanism.",
  "description_provenance": [
    "Author Email: bstab@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Advisor Email: drbevan@vt.edu",
    "Advisor Email: helmrf@vt.edu",
    "Advisor Email: siblej@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:35Z (GMT). No. of bitstreams: 1 Stab_revised_Final.pdf: 7926851 bytes, checksum: a489317aeff2522ab472e5248ee208fb (MD5)   Previous issue date: 2009-07-17"
  ],
  "handle": "28468",
  "identifier_other": "etd-07312009-075049",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07312009-075049/",
  "identifier_uri": "http://hdl.handle.net/10919/28468",
  "publisher": "Virginia Tech",
  "relation_haspart": "Stab_revised_Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "aging",
    "replicative senescence",
    "glycolysis",
    "metabolites",
    "oxidative stress",
    "oxygen",
    "TCA"
  ],
  "title": "The Effects of Cell Culture Oxygen Levels on the Replicative Senescence Processes of Primary Human Fibroblasts",
  "type": "Dissertation"
}