{
  "contributor_author": "Chang, Yao-Jen",
  "contributor_committeechair": "Olsen, Michael D.",
  "contributor_committeemember": [
    "Connolly, Daniel J.",
    "Belanger, France",
    "Williams, John A.",
    "Schmelzer, Claire D."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:14:34Z",
  "date_adate": "2004-08-05",
  "date_available": "2014-03-14T20:14:34Z",
  "date_issued": "2004-07-20",
  "date_rdate": "2004-08-05",
  "date_sdate": "2004-07-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "As competition has changed and made the environment more dynamic and complex for the hospitality and tourism industry, the concept of strategic management has become more important.  However, under the force driving change of technology innovation, information has gone digital and electronic for business development and management.  Adopting information technology (IT) for strategic management becomes an important issue for an organization.  The co-alignment model is believed to be one of the effective models for the purposes of strategic management in the field of hospitality and tourism.  The primary objective of this study was to investigate important considerations for the design of an information system (IS) to improve the utility of the model.  Once the important considerations are taken into account for constructing the system, such an IS is expected to facilitate the information flows associated with the co-alignment model and further work in concert with the model to strengthen the processes of strategy formulation and implementation.  Together, the co-alignment model and the IS can be viewed as a Coordination Strategy Framework which also has theoretical underpinning from the review of the literature of strategy, hospitality and tourism, management information system (MIS), computer science (CS), and information science.   Because this research topic or its similar kind has not been studied in the field of hospitality and tourism, this study is exploratory in nature.  A qualitative research approach adopting a single-case study method was used.  Using the co-alignment model as one of its theoretical supports along with other techniques to collect and test the interview data, the study achieved reliability and validity of the research findings.  As a major part of the conclusions of this study, the findings are the important considerations for the design of the future IS.  They included the seven key issues in five dimensions, eleven recommendations, and ten propositions that explained the relationships among the managerial aspects implicated in the framework implementation, especially the interactions between the future IS and the co-alignment model.  Furthermore, as the framework is an integration of a strategy model and an IT application, it also gives a new perspective to the term \"strategic IT\" that denotes the strategic use of IT.",
  "description_provenance": [
    "Author Email: ychang@vt.edu",
    "Advisor Email: connolly@du.edu",
    "Advisor Email: belanger@vt.edu",
    "Advisor Email: olsenmd@vt.edu",
    "Advisor Email: williams@humec.ksu.edu",
    "Advisor Email: claire.d.sw@insightbb.com",
    "Made available in DSpace on 2014-03-14T20:14:34Z (GMT). No. of bitstreams: 1 ychang.pdf: 642179 bytes, checksum: 6ed5e165fc0a4b10d71d55b8af39b709 (MD5)   Previous issue date: 2004-07-20"
  ],
  "handle": "28464",
  "identifier_other": "etd-07312004-141538",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-07312004-141538/",
  "identifier_uri": "http://hdl.handle.net/10919/28464",
  "publisher": "Virginia Tech",
  "relation_haspart": "ychang.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hospitality",
    "tourism",
    "information technology (IT)",
    "co-alignment model",
    "strategy",
    "information system (IS)",
    "information",
    "strategic IT",
    "strategic management"
  ],
  "title": "An Investigation into Considerations for the Design of IS to Improve the Utility of the Use of the Co-alignment Model: An Integration of Strategy and IT as A Coordination Strategy Framework - A Case Study of Virginia Beach",
  "type": "Dissertation"
}