{
  "contributor_author": "Meshref, Hossam",
  "contributor_committeechair": "VanLandingham, Hugh F.",
  "contributor_committeemember": [
    "Reinholtz, Charles F.",
    "Baumann, William T.",
    "Elshabini-Riad, Aicha A.",
    "Kachroo, Pushkin"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:14:36Z",
  "date_adate": "2002-08-22",
  "date_available": "2014-03-14T20:14:36Z",
  "date_issued": "2002-07-09",
  "date_rdate": "2003-08-22",
  "date_sdate": "2002-08-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "MODELING AUTONOMOUS AGENTS' BEHAVIOR  USING NEURO-IMMUNE NETWORKS    (Abstract)  Autonomous robots are expected to interact with their dynamic changing environment. This interactions requires certain level of behavior based Intelligence, which facilitates the dynamic adaptation of the robot behavior accordingly with his surrounding environment. Many researches have been done in biological information processing systems to model the behavior of an autonomous robot. The Artificial Immune System (AIS) provides new paradigm suitable for dynamic problem dealing with unknown environment rather than a static problem. The immune system has some features such as memory, tolerance, diversity and more features that can be used in engineering applications.  The immune system has an important feature called meta-dynamics in which new species of antibodies are produced continuously from the bone marrow. If the B-Cell (robot) cannot deal with the current situation, new behaviors (antibodies) should be generated by the meta dynamics function. This behavior should be incorporated into the existing immune system to gain immunity against new environmental changes. We decided to use a feed forward Artificial Neural Network (ANN) to simulate this problem, and to build the AIS memory.  Many researchers have tried to tackle different points in mimicking the biological immune system, but no one previously has proposed such an acquired memory.  This contribution is made as a \"proof of concept\" to the field of biological immune system simulation as a start of further research efforts in this direction. Many applications can potentially use our designed Neuro-Immune Network (NIN), especially in the area of autonomous robotics.  We demonstrated the use of the designed NIN to control a robot arm in an unknown environment.  As the system encounters new cases, it will increase its ability to deal with old and new situations encountered.  This novel technique can be applied to many robotics applications in industry, where autonomous robots are required to have adaptive behavior in response to their environmental changes. Regarding future work, the use of VLSI neural networks to enhance the speed of the system for real time applications can be investigated along with possible methods of design and implementation of a similar VLSI chip for the AIN.   Keywords: Immune Systems, Autonomous Robotics, and Neural Networks.",
  "description_provenance": [
    "Author Email: hmeshref@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:36Z (GMT). No. of bitstreams: 13 03_ListOfFigures.pdf: 14318 bytes, checksum: 077ab82d3d5efa4755ef9988480c0e7b (MD5) 12_References&Vita.pdf: 28850 bytes, checksum: 161ea3974c8f972fe9fed07707e1d27e (MD5) 11_Conclusion.pdf: 6194 bytes, checksum: 519267efc733056be94b34596fc9665e (MD5) 02_TableOfContents.pdf: 11282 bytes, checksum: 7a3971ff7369613d17e1a52720410ce0 (MD5) 05_Chapter1.pdf: 93472 bytes, checksum: 814617bcdca6de8882390934a1b2e423 (MD5) 01_Acknowledgment.pdf: 3819 bytes, checksum: b2592b059b0006a964a3ad8b5a1a3725 (MD5) 00_Cover&Abstract.pdf: 1525581 bytes, checksum: 7a078af3ac1ed4c796bf5b8e565cc199 (MD5) 10_Chapter6.pdf: 200186 bytes, checksum: e770e87912c84ba075832620242a979c (MD5) 09_Chapter5.pdf: 128022 bytes, checksum: 8f3fa50df342bbed7a569603567ddcf7 (MD5) 04_ListOfTables.pdf: 4953 bytes, checksum: 194118bd38f473de2263809510fbd74b (MD5) 08_Chapter4.pdf: 193339 bytes, checksum: 04acd9a5e17b137131bd032e07450857 (MD5) 07_Chapter3.pdf: 184016 bytes, checksum: 31ff931d86c334d5e160884dfe28559b (MD5) 06_Chapter2.pdf: 39238 bytes, checksum: 5e40543febe3b0069f7b0402f6f78601 (MD5)   Previous issue date: 2002-07-09"
  ],
  "handle": "28473",
  "identifier_other": "etd-08012002-183248",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08012002-183248/",
  "identifier_uri": "http://hdl.handle.net/10919/28473",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "03_ListOfFigures.pdf",
    "12_References&Vita.pdf",
    "11_Conclusion.pdf",
    "02_TableOfContents.pdf",
    "05_Chapter1.pdf",
    "01_Acknowledgment.pdf",
    "00_Cover&Abstract.pdf",
    "10_Chapter6.pdf",
    "09_Chapter5.pdf",
    "04_ListOfTables.pdf",
    "08_Chapter4.pdf",
    "07_Chapter3.pdf",
    "06_Chapter2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Immune Systems",
    "Autonomous Robotics",
    "Neural Networks"
  ],
  "title": "Modeling Autonomous Agents' Behavior Using Neuro-Immune Networks",
  "type": "Dissertation"
}