{
  "contributor_author": "Lower, Brian Howard",
  "contributor_committeechair": "Kennelly, Peter J.",
  "contributor_committeemember": [
    "Luckhart, Shirley",
    "Larson, Timothy J.",
    "Potts, Malcolm",
    "Popham, David L."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:14:35Z",
  "date_adate": "2001-08-08",
  "date_available": "2014-03-14T20:14:35Z",
  "date_issued": "2001-07-23",
  "date_rdate": "2007-11-06",
  "date_sdate": "2001-08-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "For many years, it has been understood that protein phosphorylation-dephosphorylation constitutes one of the most ubiquitous mechanisms for controlling the functional properties of proteins.  Although originally believed to be a eukaryotic phenomenon, protein phosphorylation is now known to occur in all three domains of life Eukarya, Bacteria, and Archaea.  Very little is known, however, concerning the origins and evolution of protein phosphorylation-dephosphorylation.  Knowledge of the structure and properties of the protein kinases resident in the members of the Archaea represents a key piece of this puzzle.      <p>  The extreme acidothermophilic archaeon, Sulfolobus solfataricus, exhibits a membrane-associated protein kinase activity.  Solubilization of the kinase activity requires the presence of detergent such as Triton X-100 or octyl glucoside, indicating its activity reside in an integral membrane protein.  This protein kinase utilizes purine nucleotides as phosphoryl donors in vitro with a requirement for a divalent metal ion cofactor, favoring Mn+2.  A preference for NTPs over NDPs and for adenyl nucleotides over the analogous guanyl nucleotides was observed.  The enzyme appears to be a glycoprotein that displays catalytic activity on SDS-PAGE corresponding to a molecular mass of 창  67 kDa, as well as an apparent molecular mass of 창  125 kDa on a gel filtration column.  Challenged with several exogenous substrates revealed the protein kinase to be relatively selective.  Only casein, reduced carboxyamidomethylated and maleylated lysozyme (RCM lysozyme), histone H4 proved, and a peptide modeled after myosin light chains (KKRAARATSNVFA) were phosphorylated to appreciable levels in vitro.  All of the aforementioned substrates were phosphorylated on threonine, while histone H4 was phosphorylated on serine as well.  When the phosphoacceptor threonine in the MLC peptide was substituted with serine an appreciable decrease in phosphorylation was noted.  The protein kinase underwent autophosphorylation on threonine and was relatively insensitive to several known \"eukaryotic\" protein kinase inhibitors.     <p>    Primary sequence motifs based on known conserved subdomains of eukaryotic protein kinases were used to search the genome of S. solfataricus for eukaryotic-like protein kinase sequences. Six hypothetical proteins were identified from S. solfataricus whose primary sequence exhibited noticeable similarities to eukaryotic protein kinases.  The hypothetical protein encoded by ORF sso0197 contained 7 putative subdomains, ORFs sso0433, sso2291, sso2387, and sso3207 contained 8 putative subdomains, and ORF sso3182, contained 9 putative subdomains of the 12 characteristically conserved subdomains found within eukaryotic protein kinases.     <p>   ORF sso2387 was cloned and expressed in Escherichia coli.  The expressed protein, SsPK2, was solubilized from inclusion bodies using 5 M urea.  SsPK2 was able to phosphorylate casein, BSA, RCM lysozyme, and mixed histones in vitro.  Phosphoamino acid analysis of casein, BSA, and mixed histones revealed that they were all phosphorylated on serine.  SsPK2 underwent autophosphorylation on serine at elevated temperature using both purine nucleotide triphosphates as phosphoryl donors in vitro, but exhibited a noticeable preference for ATP.  Autophosphorylate of SsPK2 also occurred at elevated temperature using a variety of divalent metals cofactors in order of Mn2+ > Mg2+ >> Ca2+ 창   Zn2+.  Polycations such as polyLys stimulated the phosphorylation of exogenous substrates while polyanions such as poly(Glu:Tyr) were shown to inhibit the phosphorylation of exogenous substrates.  Of the \"eukaryotic\" protein kinases inhibitors tested, only tamoxifen had any noticeable effect of the catalytic activity of SsPK2 towards itself and exogenous substrates.  A truncated form of SsPK2 containing the perceived catalytic domain also exhibited protein kinase activity towards itself and exogenous substrates. The observed protein kinase activity for SsPK2trunk was similar to that observed for SsPK2.      <p>   Proteins from the membrane fraction of S. solfataricus subject to phosphorylation in vitro on serine or threonine residues were identified using MALDI-MS / peptide fingerprinting techniques.  Nine phosphoproteins were assigned a tentative identification using the ProFound protein search engine from Rockefeller University.  The identity of two of nine phosphoproteins, a translational endoplasmic reticulum ATPase and an 창   42 kDa hypothetical protein, were determined with a relatively high degree of confidence.  Collectively the results suggested MALDI-MS peptide mapping coupled with [32P] labeling in vivo will have a tremendous potential for mapping out a major portion of the phosphoproteome of S. solfataricus.",
  "description_provenance": [
    "Author Email: blower@vt.edu",
    "Advisor Email: pjkennel@vt.edu",
    "Advisor Email: luckhart@vt.edu",
    "Advisor Email: tilarson@vt.edu",
    "Advisor Email: geordie@vt.edu",
    "Advisor Email: dpopham@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:35Z (GMT). No. of bitstreams: 2 BrianAbstract2ETD.pdf: 11305 bytes, checksum: 064dd23aade0aa23c88150d561fa1b5e (MD5) BrianDissertation2ETD.pdf: 1238802 bytes, checksum: af6ea7721c66d68a18afc9f6df79d662 (MD5)   Previous issue date: 2001-07-23"
  ],
  "handle": "28471",
  "identifier_other": "etd-08012001-203931",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08012001-203931/",
  "identifier_uri": "http://hdl.handle.net/10919/28471",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "BrianAbstract2ETD.pdf",
    "BrianDissertation2ETD.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Prokaryote",
    "Biochemistry",
    "Kinases",
    "Phosphorylation",
    "Archaea"
  ],
  "title": "Protein O-Kinases in the Archaeon Sulfolobus solfataricus",
  "type": "Dissertation"
}