{
  "contributor_author": "Halich, Gregory Stewart",
  "contributor_committeechair": "Stephenson, Stephen Kurt",
  "contributor_committeemember": [
    "Cox, William E.",
    "Radtke, Philip J.",
    "Fox, Thomas R.",
    "Taylor, Daniel B.",
    "Hilmer, Christiana E.",
    "Bosch, Darrell J."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:14:37Z",
  "date_adate": "2005-09-14",
  "date_available": "2014-03-14T20:14:37Z",
  "date_issued": "2005-06-27",
  "date_rdate": "2007-09-14",
  "date_sdate": "2005-08-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Municipal water suppliers are increasingly faced with implementing programs to address temporary water shortages in the United States.  Having reliable estimates for the effectiveness of these programs will help in water supply planning.  This dissertation estimates the reductions in residential water-use for voluntary and mandatory water-use restrictions used in Virginia during the 2002 drought.  These restrictions were evaluated using both a conventional approach (single-dummy variable for each) and non-conventional approach where program intensity was accounted for.  Program intensity was measured by information dissemination for voluntary restrictions, and by information dissemination and enforcement efforts for mandatory restrictions.  An unbalanced panel with data from 21 municipal water suppliers was used in the analysis.  Under the conventional approach, voluntary restrictions had no significant effect on water-use and mandatory restrictions showed a small to moderate effect.  However, program intensity was found to have a significant influence on the magnitude of the water-use reductions in the non-conventional approach.  These reductions ranged from 0-7% for voluntary restrictions, and from 0-22% for mandatory restrictions.  Moreover, these reductions followed a pattern of increasing program effectiveness with higher levels of information and enforcement.  This result indicates that water supply planners need to give considerable attention to the manner in which drought management programs are implemented.     Price was also found to have an important effect on residential water-use.  A moderate price increase of $3 per 1000 gallons would be expected to reduce water-use by almost 15%.  Thus combining mandatory restrictions (implemented at high intensity) with a moderate to high price increase could result in water-use savings approaching 40% based on estimates from this analysis.    Other important findings included: a) consumers were responding to a mix of pure marginal price and fixed fees/previous block rates, b) apartment accounts were found to be included in most of the localities residential data and had a significant impact on water-use, and c) the income parameter was measuring more than a pure income effect.",
  "description_provenance": [
    "Author Email: ghalich@yahoo.com",
    "Advisor Email: cox@vt.edu",
    "Advisor Email: pradtke@vt.edu",
    "Advisor Email: trfox@vt.edu",
    "Advisor Email: taylord@vt.edu",
    "Advisor Email: chilmer@vt.edu",
    "Advisor Email: kurts@vt.edu",
    "Advisor Email: bosch@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:37Z (GMT). No. of bitstreams: 1 FinalDraftGregHalichEdit16.pdf: 448696 bytes, checksum: 7eb7da350b82071d96f6ddef340b40e3 (MD5)   Previous issue date: 2005-06-27"
  ],
  "handle": "28479",
  "identifier_other": "etd-08012005-155838",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08012005-155838/",
  "identifier_uri": "http://hdl.handle.net/10919/28479",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalDraftGregHalichEdit16.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Residential Water Demand",
    "Voluntary Restrictions",
    "Water Demand",
    "Drought Management",
    "Mandatory Restrictions"
  ],
  "title": "Estimating Changes in Residential Water Demand for Voluntary and Mandatory Water-Use Restrictions Implemented during the  2002 Virginia Drought",
  "type": "Dissertation"
}