{
  "contributor_author": "Babendreier, Justin Eric",
  "contributor_committeechair": "Gallagher, Daniel L.",
  "contributor_committeemember": [
    "Widdowson, Mark A.",
    "Diplas, Panayiotis",
    "Cherry, Donald S.",
    "Mostaghimi, Saied",
    "Randall, Clifford W."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:14:35Z",
  "date_adate": "2000-08-02",
  "date_available": "2014-03-14T20:14:35Z",
  "date_issued": "2000-07-26",
  "date_rdate": "2001-08-02",
  "date_sdate": "2000-08-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Urban, agriculture and coal mining land use/cover impacts upon aquatic habitat, toxicity and biodiversity were investigated in Leading Creek, a 388 km2 watershed in southeastern Ohio.  Abandoned strip mine land (ASML) and active deep underground mines were examined along with abandoned near-surface underground mine land (AUML).  The work focused on assessment of aquatic toxicity, water quality, and biodiversity through investigation of associated ecological responses for both treated and untreated AMD.  Relations were examined among land use/cover, chemistry, and various ecological and toxicological endpoints.  Sources of data (scale 1:24000) included Landsat5 imaging from 1988 and 1994, and directly digitized extents of underground mining activities dating to the 19th century, with more recently created strip mines. USEPA and Ohio EPA qualitative habitat scoring protocols were used. Land use/cover thresholds were established using ASML=3%, AUML=2% to 10%, Urban=3% to 5%, and Bare Soil=3%.  Biodiversity was assessed using qualitative benthic macroinvertebrate taxon richness and abundance, for total and EPT groups, respectively.   <p> A better understanding of acid mine drainage (AMD) was demonstrated linking land use/cover, coal bed, sediment, and water column chemistry to aquatic ecotoxicity through examination of the origin and fate of sulfate, magnesium, iron, manganese, and zinc.  Key findings in risk assessment of Leading Creek indicated that (1) abandoned near-surface underground mine lands (AUML) were associated with >90% of untreated AMD reaching Leading Creek; (2) degradation to aquatic ecology was primarily associated with water quality degradation due to AMD, not with sediment quality degradation; (3) modest habitat destruction, especially sedimentation effects, were observed for ASML>3%, and urbanization>5% in small subsheds; (4) unique chemical signatures differentiated mining techniques instream; and (5) in situ Corbicula fluminea growth rates were dependent upon drainage area.  <p> Sporadic signs of agricultural and urban impacts were indicated from acute toxicity with Ceriodaphnia dubia and chronic in situ toxicity testing with C. fluminea.  Both the ecotoxicological tests were shown to be reliable indicators of AMD impact from AUML, on watershed and subwatershed scales.  AMD was strongly associated with depressed biodiversity, low pH, and elevated zinc.  Ecotoxicity monitoring supported interconnections found between sediment and water chemistry, land use/cover, and biodiversity.",
  "description_provenance": [
    "Author Email: jbabendr@vt.edu",
    "Advisor Email: dcherry@vt.edu",
    "Advisor Email: Dang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:35Z (GMT). No. of bitstreams: 1 Babendreier.pdf: 6035495 bytes, checksum: 7cb0e59ead830171aca7994be385d69b (MD5)   Previous issue date: 2000-07-26"
  ],
  "handle": "28470",
  "identifier_other": "etd-08012000-23390043",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08012000-23390043/",
  "identifier_uri": "http://hdl.handle.net/10919/28470",
  "publisher": "Virginia Tech",
  "relation_haspart": "Babendreier.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "biodiversity",
    "watershed",
    "acid mine drainage",
    "land use",
    "ecological risk assessment"
  ],
  "title": "Hydrologic-Based Ecological Risk Assessment of Urban, Agriculture, and Coal Mining Impacts Upon Aquatic Habitat, Toxicity, and Biodiversity",
  "type": "Dissertation"
}