{
  "contributor_author": "Bailey, Cara L.",
  "contributor_committeechair": "Bohland, James R.",
  "contributor_committeemember": [
    "Koebel, Charles Theodore",
    "Blieszner, Rosemary",
    "Roberto, Karen A.",
    "Bailey, Carol A."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:14:37Z",
  "date_adate": "2007-10-10",
  "date_available": "2014-03-14T20:14:37Z",
  "date_issued": "2007-07-23",
  "date_rdate": "2007-10-10",
  "date_sdate": "2007-08-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study explored the meaning of community engagement of older adults, within a social capital framework, in a community noted for its relatively high concentration of active, older adults. The multiple meanings of community engagement within the creation of a place of age were investigated using concepts derived from a social capital framework. A place of age is where older adults are integral to family life, participate in community life, and bring collective life experiences and wisdom to civic life.  This research addresses gaps in the current literature about suburban places and the meanings of community engagement for an aging population within these places. The importance of this research lies with expanding the understanding of the multiple meanings of community engagement and the potential for reinforcing, through public policy, these meanings through the development and support of the social capital created by older adults in places of age.  The research methodology was an in-depth case study analysis of West Saint Paul, Minnesota. In-person, semistructured interviews were conducted with 21 individuals, aged 65 years and older, who had been residents of West Saint Paul for at least 25 years.  \tFindings of this study revealed multiple meanings of community and community engagement for study participants, but all had a strong sense of community relative to their neighborhoods and the city of West Saint Paul. All had well-developed social networks that involved family members, friends, and neighbors. Nearly all engaged in neighboring behaviors of helping out when needed and generally looking out for one another. All participants expressed a feeling of trust of others within their own neighborhoods, and most did not feel trusting of others beyond their neighborhoods. All participants had consistently voted, and all engaged in formal civic activities at some point in their lives. All participants, lifelong volunteers, were members of a Christian church, and much of their volunteer time was given to church activities. The key finding from this study was the important role of neighboring behaviors, faith-based affiliation, and family in the meaning of community engagement within each participant's life.",
  "description_provenance": [
    "Author Email: cara.bailey@state.mn.us",
    "Advisor Email: tkoebel@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Advisor Email: jayjon@vt.edu",
    "Advisor Email: kroberto@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:37Z (GMT). No. of bitstreams: 2 CaraBaileyDissertation.pdf: 532807 bytes, checksum: 622ddd89590488f734d598f0c7eb37db (MD5) CaraBaileyDissertationRevised.pdf: 541058 bytes, checksum: 2d14a51a809aa64ccb73ad9cc1709918 (MD5)   Previous issue date: 2007-07-23"
  ],
  "handle": "28480",
  "identifier_other": "etd-08012007-074607",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08012007-074607/",
  "identifier_uri": "http://hdl.handle.net/10919/28480",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CaraBaileyDissertation.pdf",
    "CaraBaileyDissertationRevised.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "aging in place",
    "older adults",
    "community engagement",
    "sustainable communities",
    "social capital",
    "volunteerism",
    "community development",
    "family",
    "neighboring",
    "churches"
  ],
  "title": "Understanding the Meaning of Community Engagement for Aging in Place within a Social Capital Framework",
  "type": "Dissertation"
}