{
  "contributor_author": "Baloglu, Simge",
  "contributor_committeecochair": [
    "Boyle, Stephen M.",
    "Toth, Thomas E."
  ],
  "contributor_committeemember": [
    "Schurig, Gerhardt G.",
    "Claus, G. William",
    "Sriranganathan, Nammalwar"
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:14:38Z",
  "date_adate": "2001-08-02",
  "date_available": "2014-03-14T20:14:38Z",
  "date_issued": "2001-07-27",
  "date_rdate": "2002-08-02",
  "date_sdate": "2001-08-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Previous studies by our group showed that vaccinia virus recombinants expressing Brucella abortus (BA) antigens heat shock protein GroEL, 18 kDa protein and Cu/Zn SOD, were unable to induce protective immune responses against Brucella challenge.  This dissertation analyzes the possible reasons for this phenomenon, by using other genes/proteins from BA and Listeria monocytogenes (LM), various shuttle plasmids (pSC65, pSC11) and immune response modulators (CpG, IL-12, B7-1).  As the first objective, a vaccinia virus recombinant (WRL7/L12), expressing the BA L7/L12 gene was generated.  L7/L12 ribosomal protein was used as a T-cell reactive antigen, with protective potential to Brucella challenge.  The WRL7/L12 was able to express the gene of interest and induce IgG2A type antibody response, but not a protective immune response against Brucella challenge.  As a control, an antigen from LM proven to induce CTL and protective immune responses, was used to test the efficacy of vaccinia virus to induce protection.  A portion of hly gene, encoding partial listeriolysin (pLLO), was inserted into the same vaccinia virus stain. This recombinant (WRpLLO) was able to induce protection against a Listeria challenge.  Next another vaccinia virus recombinant expressing Brucella abortus Cu/Zn SOD was analyzed. \tAlthough a variety of approaches, including the enhancement of the protein expression by the pMCO2 synthetic promoter, booster immunization, addition of the oligomer CpG adjuvant (WRSODCpG) to enhance Th1 type response, were used, the SOD recombinant failed to protect mice against Brucella challenge.  Lastly, vaccinia virus produces a family of proteins that bind cytokines, chemokines and interferons to evade the host defensive systems. Therefore, a vaccinia virus strain co-expressing murine IL-12, and cofactor B7-1, were used to generate the recombinant WRIL12L7/L12.  In order to further boost the induction of Th 1 type response, the adjuvant CpG was used.  A similar recombinant, WRIL12pLLO, was generated with partial hly gene to serve as a positive control for protection.  Mice immune responses to these recombinants, with and without adjuvant CpG, were analyzed, and compared with the recombinants generated with vaccinia strain WR. Co-expression of IL12 and B7 abrogated the protective efficacy of the vaccinia/ pLLO recombinant.",
  "description_provenance": [
    "Author Email: sbaloglu@vt.edu",
    "Advisor Email: gschurig@vt.edu",
    "Advisor Email: clausgw@vt.edu",
    "Advisor Email: nathans@vt.edu",
    "Advisor Email: smboyle@vt.edu",
    "Advisor Email: ttoth@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:38Z (GMT). No. of bitstreams: 1 etdDissert2SimgeBaloglu.pdf: 530809 bytes, checksum: 2196e1e320eb19bcd41e54bb34334b53 (MD5)   Previous issue date: 2001-07-27"
  ],
  "handle": "28485",
  "identifier_other": "etd-08022001-040420",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08022001-040420/",
  "identifier_uri": "http://hdl.handle.net/10919/28485",
  "publisher": "Virginia Tech",
  "relation_haspart": "etdDissert2SimgeBaloglu.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "heterologous expression",
    "intracellular pathogens",
    "immune response protection"
  ],
  "title": "Applicability of vaccinia virus as cloning and expression vector for bacterial genes: mice immune responses to vaccinia virus expressing Brucella abortus and Listeria monocytogenes antigens",
  "type": "Dissertation"
}