{
  "contributor_author": "Weng, Bor-Chun Brian",
  "contributor_committeechair": "Denbow, Donald Michael",
  "contributor_committeemember": [
    "Larsen, Calvert T.",
    "Herbein, Joseph H. Jr.",
    "McElroy, Audrey P.",
    "Siegel, Paul B."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:14:38Z",
  "date_adate": "2002-08-21",
  "date_available": "2014-03-14T20:14:38Z",
  "date_issued": "2002-07-24",
  "date_rdate": "2004-08-21",
  "date_sdate": "2002-08-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Soybean oil (SBO), menhaden fish oil (FO), chicken fat (CF) or hydrogenated soybean oil (HSBO) were incorporated at 5% of the total diet to study changes  in the immunological status of both Japanese quail (JAP) and Bobwhite quail (BOB).  The SBO diet, in which 66% of the total fatty acids were polyunsaturated fatty acids (PUFA), was rich in linoleic acid (LA 18:2 n-6), alpha-linolenic acid (ALA 18:3 n-3) and low in saturated fatty acid (SFA).  The FO diet which contained about 50% PUFA, had only 40% n-6 fatty acids and 8% n-3 PUFA. The trans fatty acid isomers and other monounsaturated fatty acids (MUFA) were high in the HSBO diet.  The diet containing CF provided a relatively balanced fatty acid composition with 18% SFA, 31% MUFA and 50% PUFA.  Plasma fatty acid and hepatic fatty acid profiles consistently reflected their respective dietary lipid treatments.  There were no differences in the fatty acid profile between blood and liver within respective dietary treatments in the two species.  Dietary fatty acids had no effect on antibody titers against sheep red blood cells (SRBC) at 1, 2 and 8 months following the start of dietary lipid treatment in JAP.  However, female JAP fed FO had a significantly (p< 0.05) higher antibody production compared to the other dietary lipid treatments at 4 months following the start of fatty acids supplementation.  BOB fed either FO or SBO diets had a higher immunoglobulin G production compared to birds fed the CF diet.  The total antibody titer was significantly higher in BOB fed SBO compared to CF.  Dietary fatty acids had a significant effect on cell-mediated immunity (CMI) as accessed by toe web thickness 24 hours post intradermal injection of phytohemagglutinin-P (PHA) in both JAP and BOB.  In general, birds fed a FO diet had a significantly higher CMI response than those fed HSBO.  A diet high in n-3 PUFA increased the index of cutaneous basophil hypersensitivity (CBH), while the high trans fatty acid isomers suppressed the CBH response.  By observing a CBH response over a 72-hour period in JAP, it was concluded that quail fed CF or SBO had a different peak response time (12 hours post PHA challenge) and amplitude compared with those fed FO or HSBO (24 hours post PHA challenge).  Phagocytic ability was not affected by dietary lipid treatments in BOB while the quail fed FO diet had a faster carbon clearance rate.  The FO fed JAP had a significantly higher response (p< 0.05) to concanavalin A ensiformis (CONA) compared to HSBO fed birds.  There was no difference in B lymphocyte proliferation stimulated by lipopolysacchride (LPS) in female JAP, whereas it was significantly higher in male JAP fed SBO compared to those fed FO and HSBO.  Phorbol 12-myristate 13-acetate/ionomycin calcium salt (PMA/ION) was used to nonspecifically stimulate cell proliferation by increasing chromosome mitosis.  Dietary FO or HSBO suppressed cell proliferation stimulated by PMA/ION.  However, JAP fed SBO or CF had a significantly higher PMA/ION stimulated lymphocyte proliferation compared those fed FO or HSBO.  In male BOB, the FO fed birds had the highest response to all mitogens.  In contrast, female BOB did not show any dietary effects by lymphocyte proliferation.  Consistent with JAP, BOB fed HSBO had depressed lymphocytes proliferation in response to various mitogens stimulation.  In general, female birds had a higher plasma total protein (PTP) and lower pack cell volume (PCV) compared to their males counterparts in both BOB and JAP.  In summary, in in vivo experiments, feeding a diet high in menhaden fish oil that is rich in n-3 PUFA enhanced the CMI.  There was a minimal effect on antibody production caused by feeding n-3 PUFA in JAP since a significant treatment effect was only found at one sampling period, while BOB were more sensitive to dietary lipid manipulation and had a higher antibody production with SBO or FO treatments.  Dietary lipids exerted different effects in the two species in in vitro experiments.  While both BOB and JAP fed FO had higher lymphocyte proliferation to CON A mitogen compared to those fed HSBO, only male BOB showed a higher proliferation to LPS.  Feeding HSBO that contained a higher content of trans fatty acid isomers, MUFA, but lower PUFA content resulted in the lowest lymphocyte proliferation to various mitogens in both BOB and JAP.   (Key words: Lipid, fatty acid, antibody titer, phagocyte, lymphocyte proliferation, cell-mediated immunity, humoral immunity, Japanese quail, Bobwhite quail).",
  "description_provenance": [
    "Author Email: bweng@vt.edu, 5404499888@tms.suncom.com",
    "Advisor Email: clarsen@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Advisor Email: herbeinj@vt.edu",
    "Advisor Email: amcelroy@vt.edu",
    "Advisor Email: jacksons@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:38Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 826364 bytes, checksum: 411f2f1887c2c3c6b1ed9fb9e868195b (MD5)   Previous issue date: 2002-07-24"
  ],
  "handle": "28487",
  "identifier_other": "etd-08022002-195519",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08022002-195519/",
  "identifier_uri": "http://hdl.handle.net/10919/28487",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "lipid",
    "cell-mediated immunity",
    "Bobwhite quail",
    "hormoral immunity",
    "Japanese quail",
    "antibody titer",
    "sheep red blood cell (SRBC)",
    "lymphocyte",
    "carbon clearance",
    "fatty acid"
  ],
  "title": "Immunomodulation by dietary lipids: soybean oil, menhaden fish oil, chicken fat, and hydrogenated soybean oil in Japanese quail (Coturnix coturnix japonica) and Bobwhite quail (Colinus virginianus)",
  "type": "Dissertation"
}