{
  "contributor_author": "White, Sheneeta Williams",
  "contributor_committeechair": "Ralph D. Badinelli",
  "contributor_committeemember": [
    "Cliff T. Ragsdale",
    "Cook, Deborah F.",
    "Roberta S. Russell",
    "Christopher W. Zobel"
  ],
  "contributor_department": "Management Science and Information Technology",
  "date_accessioned": "2014-03-14T20:14:37Z",
  "date_adate": "2009-08-10",
  "date_available": "2014-03-14T20:14:37Z",
  "date_issued": "2009-07-27",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-08-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research takes the initial steps of evaluating resource planning for service operations in which the client is a direct resource in the service system. First, this research examines the effects of client involvement on resource planning decisions when a service firm is faced with efficiency and quality considerations. We develop a non-linear, deterministic, single-stage planning model that allows for examination of trade-offs among client involvement, efficiency and quality. Policy recommendations give service firms better insights into setting workforce, client intensity, and service generation levels. <p> Second, we examine the sensitivity of estimates of technology functions to data analysis and make policy recommendations to service providers on how to allocate resources when there are technology function uncertainties and uncontrollable inputs. Results show that resources are allocated to compensate for technology function uncertainties. <p> Third, we gain insights as to how resource decisions are made for multiple stages and for multiple clients. We extrapolate theoretical findings from the single-stage planning study to determine resource allocations across multiple services and stages. Results show that when the dynamic program in the single-stage study is extended there is trade-off between the cost of capacity changes and profits across multiple stages.",
  "description_provenance": [
    "Author Email: sheneeta@vt.edu",
    "Advisor Email: ralphb@vt.edu",
    "Advisor Email: crags@vt.edu",
    "Advisor Email: dcook@vt.edu",
    "Advisor Email: rrussell@vt.edu",
    "Advisor Email: czobel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:37Z (GMT). No. of bitstreams: 2 WhiteDissertation.pdf: 3573070 bytes, checksum: 2833e6802075d1ffd5d694cd2ae6152d (MD5) Permissions.pdf: 186228 bytes, checksum: 4231e97e6f0e84ee3c55ea0936affcdf (MD5)   Previous issue date: 2009-07-27"
  ],
  "handle": "28481",
  "identifier_other": "etd-08012009-133516",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08012009-133516/",
  "identifier_uri": "http://hdl.handle.net/10919/28481",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "WhiteDissertation.pdf",
    "Permissions.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "service operations",
    "resource planning",
    "client involvement"
  ],
  "title": "Planning and Scheduling of Complex, High Value-Added Service Operations",
  "type": "Dissertation"
}