{
  "contributor_author": "Olacsi, Gary Stephen",
  "contributor_committeechair": "Beaton, Robert J.",
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:14:38Z",
  "date_adate": "2001-08-21",
  "date_available": "2014-03-14T20:14:38Z",
  "date_issued": "2001-07-18",
  "date_rdate": "2010-09-23",
  "date_sdate": "2001-08-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Spatial vision refers to a general class of perceptual capabilities that allows people to see the structure of objects within an image or visual scene. For example, spatial vision underlies people's abilities to discriminate important objects (or so-called \"targets\") from less important \"background\" objects. Spatial vision capabilities, however, are not fixed or unaffected by the physical characteristics of the scene objects. Objects with similar shape, color, or size, for example, are more difficult to perceive than objects differing physically from one another. Likewise, targets surrounded by many physically similar background objects are more difficult to perceive than targets silhouetted against uniformly intensity and uncluttered scene areas (Toet, 1996).  The capabilities and limitations of visual target perception have been challenging to study scientifically because the number of variations in targets and backgrounds is large, if not intractable. Thus, the determination of causal relationships between physical properties of objects and human perception of those objects has been limited to relatively simple phenomena, such as the minimum size and luminance contrast needed for visual detection. This dissertation was directed at establishing ways to improve the prediction of target perception performance.  Specifically, this research was motivated by the idea that contemporary theories of spatial vision, as well as contemporary digital image analysis techniques, may provide a unified means of classifying the physical properties of targets and backgrounds in real-world scenes. If a unified schema exists or can be derived, the functional relationships between perceptual capabilities and the myriad combinations of target and background properties may be understood and predicted better than that allowed by extant visual psychophysical theories. With this objective, the present work begins the examination of using the quantitative stimulus descriptions of visual masking paradigms as a way to develop a framework for understanding target perception; specifically, target detection and recognition of objects in real-world scenes, such as those relevant to military target acquisition.  Visual masking is a psychophysical phenomenon that occurs when \"noise\" or background (i.e., non-information bearing) objects degrade an observer's ability to perceive target (i.e., task-relevant) objects. Masking occurs because the human eye-brain system processes background features in a manner that degrades (masks) the processing of target features. One example of this phenomenon in military operations is camouflage. Camouflage decreases target visibility by masking target structure and intensity.  Psychophysical visual masking studies often employ simple (non-real world) targets and masking stimuli, such as one-dimensional spatial frequency patterns (Wilson, 1995; Wilson, McFarlane & Phillips, 1983; Yang & Stevenson, 1998). A one-dimensional spatial frequency pattern usually consists of a sine- or square-wave grating pattern; that is, the luminance variations in the stimuli oscillate across one dimension of spatial extent. These grating patterns are hypothesized to excite the human visual mechanisms responsible for initial encoding and processing of visual scenes. In this manner, the grating patterns represent a simplification of real-world visual scenes, which are at least two-dimensional (i.e., left-right and up-down dimensions) in spatial (and spatial frequency) content.  Past psychophysical research has justified the use of one-dimensional spatial frequency patterns on the basis that more realistic two-dimensional patterns require extensive computational resources. However, with today's affordable computing machines, researchers can implement methodologies readily to explore and exploit the two-dimensional nature of visual imagery, especially the perception of digital images.  To begin investing two-dimensional visual processes in target acquisition, it is necessary to establish the existence and functional characteristics of two-dimensional masking phenomena. This dissertation first discusses a preliminary effort to establish a methodology to glean some information on two-dimensional masking effects. Specifically, Experiment 1 provided direct evidence for the existence of masking in the two-dimensional spatial frequency domain. Experiment 2 then demonstrated some functional effects on real-world target perception due to deliberate suppression of selected two-dimensional spatial frequency structure. Lastly, Experiments 3 and 4 extended the findings of the first two experiments using real-world targets and backgrounds.  The findings of this dissertation extend existing knowledge on visual masking phenomena into the realm of two-dimensional spatial frequency targets and masking fields, as well as provide a foundation for designing and interpreting more advanced studies of two-dimensional spatial frequency masking effects that may moderate visual target acquisition performance.",
  "description_provenance": [
    "Author Email: golacsi@vt.edu",
    "Advisor Email: bobb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:38Z (GMT). No. of bitstreams: 1 gary_olacsi_diss.pdf: 1536509 bytes, checksum: d600e346777a8f6e25ee4073ec7700b4 (MD5)   Previous issue date: 2001-07-18"
  ],
  "handle": "28486",
  "identifier_other": "etd-08022001-075945",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08022001-075945/",
  "identifier_uri": "http://hdl.handle.net/10919/28486",
  "publisher": "Virginia Tech",
  "relation_haspart": "gary_olacsi_diss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "Fourier Analysis",
  "title": "Examining Visual Masking in Target Aquisition Uning Two-dimensional Fourier Analysis Techniques",
  "type": "Dissertation"
}