{
  "contributor_author": "Workman, Sr., Eric R.",
  "contributor_committeechair": "Stewart, Daisy L.",
  "contributor_committeemember": [
    "Brewster, Thomas M.",
    "Hillison, John H.",
    "Tripp, Norman Wayne"
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:14:38Z",
  "date_adate": "2012-08-10",
  "date_available": "2014-03-14T20:14:38Z",
  "date_issued": "2012-06-27",
  "date_rdate": "2012-08-10",
  "date_sdate": "2012-08-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html xmlns=\"http://www.w3.org/1999/xhtml\"> <head> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" /> <title>Eric R. Workman, Sr. Abstract</title> </head>  <body> <p>Burkeâ  s Garden  High School was a small school established in 1915 that was located in a  fertile farming community in the Appalachian Mountains of Southwest Virginia. The  uniqueness of the geography of the area promoted a communal-based society whose  citizens worked together for educational prosperity. This historical study  documents the establishment of public education in Virginia, the demand for a  public school in Burkeâ  s Garden, the establishment, operation, and closing of  the school, as well as identifies the two career and technical education  programs offered at the school, agricultural and home economics education. <br />   <br />   The remoteness of  the community presented challenges to operating a school. Issues such as  maintaining student enrollment numbers as well as qualified teachers required  the school system and the community to work with neighboring communities for  the benefit of the school and community. The practice of boarding students and  teachers was employed to increase the number of students as well as to provide  additional support for teachers. Eventually, due to improved transportation  methods, construction of a new high school in the neighboring community of  Tazewell, Virginia, and the modernization of the farming industry, there were  fewer children in Burkeâ  s Garden, which led to the closing of the high school  in 1960. <br /> </p> <p>Burkeâ  s Garden  High School was one of five high schools operated in Tazewell County Public  Schools from 1915 to 1960. Tazewell County, Virginia, has two distinct areas of  economic dominance, the mining of coal and the production of agricultural  products. Two historical studies of public schools in Tazewell County outline  the relationship between specific communities and their schools: <em>A Historic Coal Mining Community and Its  School: A Study of Pocahontas High School 1908-1991,</em> by Thomas Brewster  (2000) and <em>A Coal Camp and Its Classroom:  A Historical Study of a Virginia Coal Camp and Its School 1888-1987,</em> by Terry Mullins (1996). The two schools in these  studies were both located in coal mining communities compared to Burkeâ  s Garden  High School that was located in the agricultural section of Tazewell County. </p> </body> </html>",
  "description_provenance": [
    "Author Email: eworkman@bland.org",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: tbrewster@pcva.us",
    "Advisor Email: hillison@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:38Z (GMT). No. of bitstreams: 1 Workman_ER_D_2012.pdf: 3369066 bytes, checksum: a4017d08da83a10ead46415d83b8aaab (MD5)   Previous issue date: 2012-06-27"
  ],
  "handle": "28484",
  "identifier_other": "etd-08012012-091718",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08012012-091718/",
  "identifier_uri": "http://hdl.handle.net/10919/28484",
  "publisher": "Virginia Tech",
  "relation_haspart": "Workman_ER_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Burke's Garden",
    "Agricultural Education",
    "Home Economics Education",
    "Career and Technical Education"
  ],
  "title": "Historical Study of Burkeâ  s Garden High School: 1915 to 1960",
  "type": "Dissertation"
}