{
  "contributor_author": "Jia, Tao",
  "contributor_committeechair": "Kulkarni, Rahul V.",
  "contributor_committeemember": [
    "Heflin, James R.",
    "Park, Kyungwha",
    "Pleimling, Michel J. F."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:14:38Z",
  "date_adate": "2011-08-19",
  "date_available": "2014-03-14T20:14:38Z",
  "date_issued": "2011-07-21",
  "date_rdate": "2011-08-19",
  "date_sdate": "2011-08-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Stochasticity is a ubiquitous feature of cellular processes such as gene expression that can give rise to phenotypic differences for genetically identical cells. Understanding how the underlying biochemical reactions give rise to variations in mRNA/protein levels is thus of fundamental importance to diverse cellular processes. Recent technological developments have enabled single-cell measurements of cellular macromolecules which can shed new light on processes underlying gene expression. Correspondingly, there is a need for the development of theoretical tools to quantitatively model stochastic gene expression and its consequences for cellular processes.  In this dissertation, we address this need by developing general stochastic models of gene expression. By mapping the system to models analyzed in queueing theory, we derive analytical expressions for the noise in steady-state protein distributions. Furthermore, given that the underlying processes are intrinsically stochastic, cellular regulation must be designed to control the`noise' in order to adapt and respond to changing environments. Another focus of this dissertation is to develop and analyze stochastic models of post-transcription regulation. The analytical solutions of the models proposed provide insight into the effects of different mechanisms of regulation and the role of small RNAs in fine-tunning the noise in gene expression. The results derived can serve as building blocks for future studies focusing on regulation of stochastic gene expression.",
  "description_provenance": [
    "Author Email: tjia@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: kyungwha@vt.edu",
    "Advisor Email: Michel.Pleimling@vt.edu",
    "Advisor Email: kulkarni@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:38Z (GMT). No. of bitstreams: 1 Jia_Tao_D_2011.pdf: 1429773 bytes, checksum: 5390883da15ea8d06ad952b52786ba6f (MD5)   Previous issue date: 2011-07-21"
  ],
  "handle": "28483",
  "identifier_other": "etd-08012011-170602",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08012011-170602/",
  "identifier_uri": "http://hdl.handle.net/10919/28483",
  "publisher": "Virginia Tech",
  "relation_haspart": "Jia_Tao_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "transcriptional bursting",
    "regulatory sRNA",
    "post-transcriptional regulation",
    "stochastic gene expression",
    "queueing theory"
  ],
  "title": "Stochastic Modeling of Gene Expression and Post-transcriptional Regulation",
  "type": "Dissertation"
}