{
  "contributor_author": "Penn, Chad John",
  "contributor_committeechair": "Mullins, Gregory L.",
  "contributor_committeemember": [
    "Phillips, Steven B.",
    "Mostaghimi, Saied",
    "Zelazny, Lucian W.",
    "Baker, James C."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:14:40Z",
  "date_adate": "2004-08-04",
  "date_available": "2014-03-14T20:14:40Z",
  "date_issued": "2004-07-23",
  "date_rdate": "2004-08-04",
  "date_sdate": "2004-08-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Previous research shows that dissolved P losses in runoff are well related to soil test P (STP), thus, various P loss prediction models incorporate the use of a STP vs. runoff DRP relationship.  However, the relationship between STP and runoff DRP will vary based on soil type due to differences in soil properties.  The purposes of the first two studies were to (i) investigate the effect of soil mineralogy on P sorption behavior and dissolved P in runoff and (ii) determine if any simple soil test extractions could indirectly take into account this effect of mineralogy.      Nine soil types from the Virginia Piedmont, Coastal Plain, and Ridge and Valley were collected and used in a rainfall simulation study.  Phosphorus retention among separated clay fractions and whole soils were related to Al bearing minerals such as hydroxy-interlayered vermiculite (HIV), gibbsite, and amorphous Al.  Samples dominated by kaolinite retained very little P.  Application of these results to runoff data showed that soil types with a HIV:kaolinite ratio > 0.5 caused significantly less DRP in runoff for a given soil WSP level compared to soils with a ratio < 0.5.        The second study showed that the soil P vs runoff DRP relationships varied between physiographic provinces.  Generally, the Coastal Plain soils resulted in a higher runoff DRP concentration for a given soil P level compared to Piedmont and Ridge and Valley soils.   However, soil M3-P/Al resulted in one relationship with DRP for all three groups of soils.  Results from the incubation study suggested that Al related P is more easily desorbed into solution compared to Fe related P.        The final study demonstrated that phytase enzyme and high available P corn supplements in poultry diets can reduce manure WSP and total P.  Results from the runoff study showed that DRP losses were related to sediment losses which consisted of > 90% manure particles.  Manure particles were directly deposited into the collection container followed by desorption of P based upon the WSP content of that manure type.  The results emphasized best management practices that prevent direct loss of manure particles from soil into surface waters.",
  "description_provenance": [
    "Author Email: chpenn@vt.edu",
    "Advisor Email: stevep@vt.edu",
    "Advisor Email: smostagh@vt.edu",
    "Advisor Email: zelazny@vt.edu",
    "Advisor Email: jbaker@vt.edu",
    "Advisor Email: gmullins@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:40Z (GMT). No. of bitstreams: 1 dissertation3.pdf: 545424 bytes, checksum: d3fe48b5b7ecc6f66d0171d807ae0e47 (MD5)   Previous issue date: 2004-07-23"
  ],
  "handle": "28499",
  "identifier_other": "etd-08032004-114131",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08032004-114131/",
  "identifier_uri": "http://hdl.handle.net/10919/28499",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mineralogy",
    "phytase",
    "runoff",
    "phosphorus"
  ],
  "title": "Phosphorus Losses in Runoff from Virginia Soils",
  "type": "Dissertation"
}