{
  "contributor_author": "DuRant, Sarah Elizabeth",
  "contributor_committeechair": "Hopkins, William A.",
  "contributor_committeemember": [
    "Hawley, Dana M.",
    "Hepp, Gary R.",
    "Moore, Ignacio T.",
    "Walters, Jeffrey R."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:14:39Z",
  "date_adate": "2011-08-16",
  "date_available": "2014-03-14T20:14:39Z",
  "date_issued": "2011-07-21",
  "date_rdate": "2011-08-16",
  "date_sdate": "2011-08-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The early developmental environment has a profound influence on an individualâ  s life history trajectory and parents have tremendous influence over this environment.  Despite the wealth of research demonstrating that incubation temperature affects a suite of traits important to fitness in reptiles, we are only now discovering that nest temperatures are a defining component of the avian developmental environment. Aspects of the nest environment may be an important and overlooked maternal effect in birds as nearly all birds physically incubate their eggs, thus providing a clear link between parental behavior and the developmental environment of the avian embryo. My research used an interdisciplinary approach, uniting concepts from life history theory, bioenergetics. immunology, and physiological ecology to investigate the importance of incubation temperature to avian phenotype. I found that incubation temperature affects a suite of traits important for future development, survival and reproduction in a species of birds.  Using a population of wood ducks (Aix sponsa) that has been the subject of long term studies I investigated the effects of incubation temperature on embryonic developmental patterns and energy expenditure, and body size and condition, stress endocrinology, thermoregulatory performance, and immunocompetence in hatchling wood ducks.  In all experiments freshly laid wood duck eggs were collected from nest boxes located in SC, transported to Virginia Tech and incubated at one of three temperatures (35.0, 35.9, 37.0Ë C) that fell within the range of naturally-incubated wood duck nest temperatures. I found that less than 1Ë C differences in incubation temperature affected duckling growth and body condition, stress endocrinology, immune responses, and energy expended to thermoregulate.  Many of these effects persisted days to weeks after hatching. In most cases, ducklings that hatched from eggs incubated at lowest temperature performed poorer than ducklings that hatched from eggs incubated at the higher temperatures. Incubation temperature also affected wood duck embryonic developmental trajectories and energy expended during incubation with embryos from the low incubation temperature expended more energy and developing slower than ducklings incubated at the higher temperatures. Embryonic energy expenditure could contribute to effects observed on hatchling phenotype. Because I demonstrate that incubation temperature affects hatchling phenotypic quality, the variability upon which natural selection acts, my findings have implications for avian ecology, life history evolution and conservation.",
  "description_provenance": [
    "Author Email: sdurant@vt.edu",
    "Advisor Email: hopkinsw@vt.edu",
    "Advisor Email: hawleyd@vt.edu",
    "Advisor Email: heppgar@auburn.edu",
    "Advisor Email: itmoore@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:39Z (GMT). No. of bitstreams: 1 DuRant_SE_D_2011.pdf: 1354431 bytes, checksum: 56133e3e484da93ef27746c3d979ee56 (MD5)   Previous issue date: 2011-07-21"
  ],
  "handle": "28494",
  "identifier_other": "etd-08022011-095734",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08022011-095734/",
  "identifier_uri": "http://hdl.handle.net/10919/28494",
  "publisher": "Virginia Tech",
  "relation_haspart": "DuRant_SE_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "stress endocrinology",
    "bioenergetics",
    "eco-immunology",
    "maternal effects"
  ],
  "title": "The role of incubation temperature in determining avian phenotype: implications for avian ecology, life history evolution, and conservation.",
  "type": "Dissertation"
}