{
  "contributor_author": "Brown, Launcelot Irving",
  "contributor_committeechair": "Fortune, Jimmie C.",
  "contributor_committeemember": [
    "Doolittle, Peter E.",
    "Alexander, David",
    "Gillespie, Diane Newkirk",
    "Singh, Kusum",
    "Hutchins, David E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:14:40Z",
  "date_adate": "2001-08-16",
  "date_available": "2014-03-14T20:14:40Z",
  "date_issued": "2001-07-30",
  "date_rdate": "2002-08-16",
  "date_sdate": "2001-08-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A Meta-analysis of Research  on the Influence of Leadership on Student Outcomes  by  Launcelot I. Brown  Jimmie C. Fortune, Chair  Educational Research and Evaluation  (ABSTRACT)  \t  Despite the fact that it is accepted that the role of the principal is central to the effectiveness of the school, the extent of that relationship remains a subject of continuing debate.  Utilizing the statistical analytical approach of the meta-analysis, the study synthesized the quantitative data on the subject to determine the degree to which the level of school effectiveness reflects the influence of the school leadership. The review of the quantitative literature identified 38 studies that met the criteria for inclusion in the meta-analysis, providing 339 effect sizes that formed the sample for the study.  The following research questions guided this study: 1.\tWhat empirical evidence is there to confirm or support the notion that there exists a relationship between leadership and school effectiveness  2.\tAs identified in the quantitative analysis of the available research, what is the strength of the relationship between leadership and school effectiveness? 3.\tBased on empirical evidence, what aspects, dimensions or clusters of leadership behaviors relate to school effectiveness? 4.\tRelated to the above, how do these dimensions compare in their relationship to school effectiveness? The results indicated that there is a significant and positive relationship between school leadership and the level of school effectiveness, and that while all the leadership approaches yielded significant results, the instructional leadership behaviors of the principal registered the strongest relationship.",
  "description_provenance": [
    "Author Email: labrown4@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: dgilles@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: dhutch@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:40Z (GMT). No. of bitstreams: 9 Chapter2.pdf: 162168 bytes, checksum: 49ed00a50bb089e1e0724c991f67882f (MD5) Coverpage.pdf: 86061 bytes, checksum: 7c7410b5cc4f4436bb3347847e5b9aaf (MD5) Chapter3.pdf: 43532 bytes, checksum: 97ab82d0d1fb4d7d5b9c2e33ef46238b (MD5) Chapter4.pdf: 69274 bytes, checksum: 68ba807a6eb62bef0573470b330e5398 (MD5) Chapter1.pdf: 39513 bytes, checksum: 2828b3585edf2d1750004a2c8f313188 (MD5) References.pdf: 33529 bytes, checksum: f65be1f2a3c9ca9c1c4aaef7986408cc (MD5) Appendices.pdf: 76751 bytes, checksum: 472657879dc425477cc0402d64a43206 (MD5) Chapter5.pdf: 23912 bytes, checksum: 30eb026de9394740e86e045f7e776c21 (MD5) Vita.pdf: 80432 bytes, checksum: 737aa45793ac9b16db154474fb62fc1b (MD5)   Previous issue date: 2001-07-30"
  ],
  "handle": "28498",
  "identifier_other": "etd-08032001-124306",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08032001-124306/",
  "identifier_uri": "http://hdl.handle.net/10919/28498",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter2.pdf",
    "Coverpage.pdf",
    "Chapter3.pdf",
    "Chapter4.pdf",
    "Chapter1.pdf",
    "References.pdf",
    "Appendices.pdf",
    "Chapter5.pdf",
    "Vita.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "schoo leadership school effectiveness effective sc",
  "title": "A Meta-analysis of Research on the Influence of Leadership on Student Outcomes",
  "type": "Dissertation"
}