{
  "contributor_author": "Lyon, Anna Faye",
  "contributor_committeecochair": "Hutson, Barbara A.",
  "contributor_committeemember": [
    "Gatewood, Thomas E.",
    "Cline, Marvin Gerald",
    "McDowell, Gloria M.",
    "Nespor, Jan K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:14:40Z",
  "date_adate": "2000-08-29",
  "date_available": "2014-03-14T20:14:40Z",
  "date_issued": "1999-05-07",
  "date_rdate": "2012-11-06",
  "date_sdate": "2000-08-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The observation of first grade children as they became readers led the researcher to this study. Some children found reading an effortless task, some progressed as expected with instruction, while others struggled. An effort was undertaken to gain insight into the various paths children took on their way to independent reading. The goal of this qualitative study was to describe the reading experiences of first grade children in order to enhance understanding and to describe their paths to look for similarities and differences. <p> Five themes emerged from this study. First, the study found differing definitions of reading among the children, parents, and teachers. These conflicting definitions sometimes led to complications as the children learned to read.  Second, the social construction of learning to read was clearly demonstrated by these children. Children in this study read together, held conversations about how to work their way through text, and engaged in joint decision making. While the children learned from and with each other throughout the study, a third theme that emerged was that of the personal nature of learning to read. In addition to reading and learning with peers, the children also chose to read alone. This seemed to be a time to try out and internalize new learning, as well as time to practice what was known. The various paths that the children took as they learned to read yielded a fourth theme. While the path for some was rather linear, others took a more circuitous route. The ability of the children in this study to identify more able readers and to seek them out to read and listen to emerged as the fifth and final theme.",
  "description_provenance": [
    "Author Email: lyona@erols.com",
    "Advisor Email: bhutson100@aol.com",
    "Advisor Email: gatewood@vt.edu",
    "Advisor Email: @vt.edu",
    "Advisor Email: @vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:40Z (GMT). No. of bitstreams: 2 LYON-VT.pdf: 365633 bytes, checksum: e5a300114c9d0dbb3eeb60c95aafabbd (MD5) Vita-file1.pdf: 7754 bytes, checksum: 7dd3957f19ca7793436754e24a012c2c (MD5)   Previous issue date: 1999-05-07"
  ],
  "handle": "28497",
  "identifier_other": "etd-08032000-11190031",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08032000-11190031/",
  "identifier_uri": "http://hdl.handle.net/10919/28497",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "LYON-VT.pdf",
    "Vita-file1.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "reading",
    "early literacy"
  ],
  "title": "The Transition To Reader: Multiple Perspectives",
  "type": "Dissertation"
}