{
  "contributor_author": "Dong, Dong",
  "contributor_committeechair": "Boroyevich, Dushan",
  "contributor_committeemember": [
    "Lee, Fred C.",
    "Mattavelli, Paolo",
    "De La Ree Lopez, Jaime",
    "Lesko, John J."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:14:40Z",
  "date_adate": "2012-08-06",
  "date_available": "2014-03-14T20:14:40Z",
  "date_issued": "2012-07-25",
  "date_rdate": "2012-08-06",
  "date_sdate": "2012-08-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation covers several issues related to the ac-dc bus-interface bi-directional converters in renewable energy systems. The dissertation explores a dc-electronic distribution system for residential and commercial applications with a focus on the design of an ac-dc bi-directional converter for such application. This converter is named as the â  Energy Control Centerâ   due to its unique role in the system. First, the impact of the unbalanced power from the ac grid, especially the single-phase grid, on the dc system operation is analyzed. Then, a simple ac-dc two-stage topology and an advanced digital control system is proposed with a detailed design procedure. The proposed converter system significantly reduces the dc-link capacitor volume and achieves a dynamics-decoupling operation between the interfaced systems. The total volume of the two-stage topology can be reduced by upto three times compared with the typical design of a full-bridge converter. In addition, film capacitors can be used instead of electrolytic capacitors in the system, and thus the whole system reliability is improved. A set of ac passive plus active filter solutions is proposed for the ac-dc bus-interface converter which significantly reduces the total power filter volume but still eliminate the total leakage current and the common-mode conducted EMI noises by more than 90%. The dc-side low-frequency CM voltage ripple generated by the unbalanced ac voltages can be eliminated as well. The proposed solution features a high reliability and fits three types of the prevalent low-voltage ac distribution systems. Grid synchronization, a critical interface control in ac-dc bus-interface converters, is discussed in detail. First, a novel single-phase grid synchronization solution is proposed to achieve the rejection of multiple noises as well as the capability to track the ac voltage amplitude. Then, a comprehensive modeling methodology of the grid synchronization for three-phase system is proposed to explain the output frequency behaviors of grid-interface power converters at the weak grid, at the islanded condition, and at the multi-converter condition. The proposed models provide a strong tool to predict the grid synchronization instabilities raised from industries under many operating conditions, which is critical in future more-distributed-generation power systems. Islanding detection issues in ac-dc bus-interface converters are discussed in detail. More than five frequency-based islanding detection algorithms are proposed. These solutions achieve different performances and are suitable for different applications, which are advantageous over existing solutions. More importantly, the detailed modeling, trade-off analysis, and design procedures are given to help completely understand the principles. In the end, the effectiveness of the proposed solutions in a multiple-converter system are analyzed. The results drawn from the discussion can help engineers to evaluate other existing solutions as well.",
  "description_provenance": [
    "Author Email: dongd@vt.edu",
    "Advisor Email: dushan@vt.edu",
    "Advisor Email: fclee@vt.edu",
    "Advisor Email: pmatta@vt.edu",
    "Advisor Email: jreelope@vt.edu",
    "Advisor Email: jlesko@exchange.vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:40Z (GMT). No. of bitstreams: 1 Dong_D_D_2012.pdf: 11176020 bytes, checksum: b1dedcac69f70978b5fd645a8b79f6a5 (MD5)   Previous issue date: 2012-07-25"
  ],
  "handle": "28495",
  "identifier_other": "etd-08022012-151006",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08022012-151006/",
  "identifier_uri": "http://hdl.handle.net/10919/28495",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dong_D_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "grid-interface power converter",
    "residential dc distribution systems",
    "passive filters",
    "grid-synchronization",
    "islanding detection"
  ],
  "title": "Ac-dc Bus-interface Bi-directional Converters in Renewable Energy Systems",
  "type": "Dissertation"
}