{
  "contributor_author": "Park, Chul",
  "contributor_committeechair": "Novak, John T.",
  "contributor_committeemember": [
    "Holbrook, R. David",
    "Murthy, Sudhir N.",
    "Stevens, Ann M.",
    "Randall, Clifford W.",
    "Love, Nancy G."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:14:42Z",
  "date_adate": "2007-08-16",
  "date_available": "2014-03-14T20:14:42Z",
  "date_issued": "2007-08-01",
  "date_rdate": "2007-08-16",
  "date_sdate": "2007-08-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Extracellular polymeric substances (EPS) in activated sludge are known to account for the flocculent nature of activated sludge. Extensive studies over the last few decades have attempted to extract and characterize activated sludge EPS, but a lack of agreement between studies has also been quite common. The molecular makeup of EPS has, however, remained nearly unexplored, leaving their identity, function, and fate over various stages in the activated sludge system mainly unknown. In spite of their critical involvement in bioflocculation and long history of related research, our understanding of EPS is still greatly limited and better elucidation of their composition and structure is needed. </p> <p>  The hypothesis of this research was that activated sludge floc contains different fractions of EPS that are distinguishable by their association with certain cations and that each fraction behaves differently when subjected to shear, aerobic digestion, anaerobic digestion and other processes. In order to examine this floc hypothesis, the research mainly consisted of three sections: 1) development of EPS extraction methods that target cations of interest (divalent cations, especially calcium and magnesium, iron, and aluminum) from activated sludge; 2) molecular investigations on activated sludge EPS using metaproteomic analyses, comprising sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE) and protein identification by liquid chromatography tandem mass spectrometry (LC/MS/MS), and hemaagglutination (HA)/HA inhibition assays; and 3) investigating the fate of EPS in sludge digestion using SDS-PAGE.  </p> <p> Evaluation of prior research and data from preliminary studies led to the development of the three extraction methods that were used to target specific cations from activated sludge and to release their associated EPS into solution. These methods are the cation exchange resin (CER) procedure for extracting Ca2++Mg2+, sulfide extraction for removing Fe, and base treatment (pH 10.5) for dissolving Al. The cation selectivity in the three extraction methods, the composition of EPS (protein/polysaccharide), amino acid composition, and a series of sequential extraction data established initial research evidence that activated sludge EPS that are associated with different cations are not the same. </p> <p> SDS-PAGE was successfully applied to study extracellular proteins from several sources of both full- and bench-scale activated sludges. The three extraction methods led to different SDS-PAGE profiles, providing direct evidence that proteins released by the three methods were indeed different sludge proteins. Another important outcome from this stage of research was finding the similarity and differences of extracellular proteins between different sources of activated sludge. SDS-PAGE data showed that many of CER-extracted proteins were well conserved in all the sludges investigated, indicating that a significant fraction of Ca2+ and Mg2+-bound proteins are universal in activated sludge. On the other hand, protein profiles resulting from sulfide and base extraction were more diverse for different sludges, indicating that Al and Fe and their associated proteins are quite dynamic in activated sludge systems. Protein bands at high densities were analyzed for identifications by LC/MS/MS and several bacterial proteins and polypeptides originating from influent sewage were identified in this study. This was also thought to be the first account of protein identification work for full-scale activated sludge. </p> <p>  The analysis of SDS-PAGE post sludge digestion revealed that CER-extracted proteins remained intact in anaerobic digestion while they were degraded in aerobic digestion. While the fate of sulfide-and base-extracted proteins in aerobic digestion was not as clearly resolved, their changes in anaerobic digestion were well determined in this research. Sulfide-extracted protein bands were reduced by anaerobic digestion, indicating that Fe-bound EPS were degraded under anaerobic conditions. While parts of base-extracted proteins disappeared after anaerobic digestion, others became more extractable along with the extraction of new proteins, indicating that the fate of base-extractable proteins, including Al-bound proteins, is more complex in anaerobic digestion than CER-extracted and sulfide-extracted proteins.  </p> <p> These results show that Ca2++Mg2+, Fe3+, and Al3+ play unique roles in floc formation and that each cation-associated EPS fraction imparts unique digestion characteristics to activated sludge. Finally, since a considerably different cation content is quite common for different wastewaters, it is postulated that this variability is one important factor that leads to different characteristics of activated sludge and sludge digestibility across facilities. The incorporation of the impact of cations and EPS on floc properties into an activated sludge model might be challenging but will assure a better engineering application of the activated sludge process. </p>",
  "description_provenance": [
    "Author Email: chpark1@vt.edu",
    "Advisor Email: rholbroo@vt.edu",
    "Advisor Email: smurthy@vt.edu",
    "Advisor Email: ams@vt.edu",
    "Advisor Email: cliff@vt.edu",
    "Advisor Email: nlove@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:42Z (GMT). No. of bitstreams: 1 Disseration.pdf: 2181832 bytes, checksum: 9059afbb088bb2ec9cf432037d87f880 (MD5)   Previous issue date: 2007-08-01"
  ],
  "handle": "28504",
  "identifier_other": "etd-08032007-145058",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08032007-145058/",
  "identifier_uri": "http://hdl.handle.net/10919/28504",
  "publisher": "Virginia Tech",
  "relation_haspart": "Disseration.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "metaproteomics",
    "extraction",
    "activated sludge",
    "extracellular polymeric substances",
    "cations",
    "bioflocculation",
    "proteins",
    "sludge digestion",
    "hemaagglutination"
  ],
  "title": "Extracellular Polymeric Substances in Activated Sludge Flocs:  Extraction, Identification, and Investigation of Their Link with Cations and  Fate in Sludge Digestion",
  "type": "Dissertation"
}