{
  "contributor_author": "Oliveira, Francisco Carlos De Mattos Brito",
  "contributor_committeechair": "Quek, Francis K. H.",
  "contributor_committeemember": [
    "Harrison, Steven R.",
    "Tatar, Deborah Gail",
    "Gracanin, Denis",
    "Smith-Jackson, Tonya L."
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2014-03-14T20:14:42Z",
  "date_adate": "2010-09-02",
  "date_available": "2014-03-14T20:14:42Z",
  "date_issued": "2010-08-02",
  "date_rdate": "2010-09-02",
  "date_sdate": "2010-08-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Mathematics instruction and discourse typically involve two modes of communication: speech and graphical presentation. For the communication to remain situated, dynamic  synchrony must be maintained between the speech and dynamic focus in the graphics. Sighted students use vision  for two purposes: access to graphical material and awareness of embodied behavior. This embodiment awareness keeps communication situated with visual material and speech. Our goal is to assist students who are blind or visually impaired (SBVI) in the access to such instruction/communication. We employ the typical approach of sensory replacement for the missing visual sense. Haptic fingertip reading can replace visual material. We want to make the SBVI aware of the deictic gestures performed by the teacher over the graphic in conjunction with speech. We employ a haptic glove interface to facilitate this embodiment awareness.  In this research, we address  issues from the conception through the design,  implementation, evaluation  to the effective and successful use of our Haptic Deictic System (HDS) in inclusive classrooms.",
  "description_provenance": [
    "Author Email: oliveira@vt.edu",
    "Advisor Email: srh@cs.vt.edu",
    "Advisor Email: dtatar@CS.VT.EDU",
    "Advisor Email: quek@cs.vt.edu",
    "Advisor Email: gracanin@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:42Z (GMT). No. of bitstreams: 1 oliveira_dissertation_final_version_08262010.pdf: 25191413 bytes, checksum: 5c3dd52be078a0749949cbd6a657fa5b (MD5)   Previous issue date: 2010-08-02"
  ],
  "handle": "28508",
  "identifier_other": "etd-08032010-124352",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08032010-124352/",
  "identifier_uri": "http://hdl.handle.net/10919/28508",
  "publisher": "Virginia Tech",
  "relation_haspart": "oliveira_dissertation_final_version_08262010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Haptics",
    "Multi modal",
    "Blind",
    "Embodied Interaction",
    "Assistive technology"
  ],
  "title": "Enabling the Blind to See Gestures",
  "type": "Dissertation"
}