{
  "contributor_author": "Chen, Weiping",
  "contributor_committeechair": "Bish, Ebru K.",
  "contributor_committeemember": [
    "Taaffe, Michael R.",
    "Sarin, Subhash C.",
    "Chan, Lap Mui Ann"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:14:42Z",
  "date_adate": "2007-09-06",
  "date_available": "2014-03-14T20:14:42Z",
  "date_issued": "2007-07-20",
  "date_rdate": "2007-09-06",
  "date_sdate": "2007-08-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "We study the optimal resource portfolio for a price-setter firm under a consumer choice model with supply and demand risks. The firm sells two products that are vertically differentiated, and has the option to invest in both dedicated and flexible resources.  Our objective is to understand the effectiveness of the two hedging mechanisms, resource flexibility and demand management through production differentiation, under demand and supply risks.  We show that the presence of consumer-driven substitution does not always reduce the need for the firm to offer differentiated products. In particular, when the firm faces demand risk and differential production costs, it might invest in the flexible resource and offer differentiated products for a wider range of parameters. Interestingly, more uncertainty (in the form of additional supply risk) does not always make the firm more eager to adopt a hedging mechanism. This depends on the relationship between resource risks, product attributes, and resource investment costs. On the other hand, when the firm invests in the flexible resource, this never completely replaces the dedicated resources, and always results in a \"diverse\" resource portfolio. While this happens in the supply risk setting mainly due to resource diversification advantage, it also happens in the demand risk setting due to the vertical differentiation between the products. Finally, in the absence of differential production costs, demand management by itself (without resource flexibility) becomes powerful enough to hedge against the demand risk, but not the supply risk, due to the additional resource diversification benefit of the flexible resource in the latter setting.",
  "description_provenance": [
    "Author Email: wpchen@vt.edu",
    "Advisor Email: taaffe@vt.edu",
    "Advisor Email: sarins@vt.edu",
    "Advisor Email: achan@vt.edu",
    "Advisor Email: ebru@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:42Z (GMT). No. of bitstreams: 1 ETD_Weiping_Chen_v4.pdf: 921129 bytes, checksum: 69502f662f3b1c51a7cb46001bf58d22 (MD5)   Previous issue date: 2007-07-20"
  ],
  "handle": "28505",
  "identifier_other": "etd-08032007-211352",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08032007-211352/",
  "identifier_uri": "http://hdl.handle.net/10919/28505",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD_Weiping_Chen_v4.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Supply and Demand Risk",
    "Responsive Pricing",
    "Consumer Choice",
    "Vertical Differentiation",
    "Resource Flexibility",
    "Product Differentiation"
  ],
  "title": "Firm's Optimal Resource Portfolio under Consumer Choice, and Supply and Demand Risks",
  "type": "Dissertation"
}