{
  "contributor_author": "Zhao, Xin",
  "contributor_committeechair": "Corcoran, Sean Gerald",
  "contributor_committeecochair": "Kelley, Michael J.",
  "contributor_committeemember": [
    "Edwards, Marc A.",
    "Aning, Alexander O.",
    "Reynolds, William T. Jr."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:14:42Z",
  "date_adate": "2009-08-11",
  "date_available": "2014-03-14T20:14:42Z",
  "date_issued": "2009-07-16",
  "date_rdate": "2010-10-22",
  "date_sdate": "2009-08-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Niobium (Nb) has the highest superconducting transition temperature (9.2 K) of the pure metals, which makes it the most used material for the construction of superconducting radio frequency (SRF) accelerators. The performance of the accelerator is critically dependent upon the quality of Nb surface. Electropolishing (EP) in hydrofluoric acid (HF)-containing electrolytes is the currently accepted treatment process. The presence of HF is necessary for the removal of the passive oxide surface film formed in aqueous electrolytes. But HF is hazardous and must be contained without human exposure and eliminated in an environmentally appropriate manner. <p> <p>In the present dissertation project, HF-Free EP of Nb was performed in sulfuric acid-methanol electrolytes. Sulfuric concentrations of 0.1 M, 0.5 M, 1 M, 2 M, and 3 M were used. Cyclic voltammetry and potential hold experiments were performed in cells of both two-electrode and three-electrode setups to evaluate the electrochemical process. The influence of electrolyte concentration, temperature, and EP duration was investigated. At room temperature, both the corrosion rate and the surface quality obtained were comparable to those currently obtained with HF-based processing. With decreasing temperature, the mean current level decreased and the surface quality improved substantially. For a desired average material removal of 100 μm, nanometer scale surface roughness was obtained under multiple conditions. <p> <p>Mechanism of EP was also investigated by electrochemical impedance spectroscopy (EIS). The EIS diagram indicates the presence of a compact film during EP at mass transport controlled limiting current and a film-free surface during EP at ohmic controlled current. Transfer from a film-free surface to an anodic film precipitation with decreasing temperature was also observed. Microsmoothing is only achieved under mass transport control. Nb5+ ions are determined to be the mass transport limiting species.",
  "description_provenance": [
    "Author Email: zhaox@vt.edu",
    "Advisor Email: edwardsm@vt.edu",
    "Advisor Email: aaning@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: mikelley@vt.edu",
    "Advisor Email: scg@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:42Z (GMT). No. of bitstreams: 1 Dissertation_Xin_Zhao.pdf: 7837897 bytes, checksum: cabc014c34f0763dc494bbe99fd6daff (MD5)   Previous issue date: 2009-07-16"
  ],
  "handle": "28507",
  "identifier_other": "etd-08032009-170244",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08032009-170244/",
  "identifier_uri": "http://hdl.handle.net/10919/28507",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Xin_Zhao.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "sulfuric acid-methanol",
    "niobium",
    "electropolishing",
    "hydrofluoric acid-free"
  ],
  "title": "Electropolishing of Niobium in Sulfuric Acid-Methanol Electrolytes: Development of Hydrofluoric Acid-Free Electrolytes",
  "type": "Dissertation"
}