{
  "contributor_author": "Mastropaolo, Matthew David",
  "contributor_committeecochair": [
    "Melville, Stephen B.",
    "Stevens, Ann M."
  ],
  "contributor_committeemember": [
    "Larson, Timothy J.",
    "Inzana, Thomas J."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:14:46Z",
  "date_adate": "2008-08-27",
  "date_available": "2014-03-14T20:14:46Z",
  "date_issued": "2008-07-30",
  "date_rdate": "2009-08-27",
  "date_sdate": "2008-08-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Opportunistic bacterial pathogens are present in the intestines of all mammals.  These bacteria are symbionts to a certain extent, but under certain conditions these organisms can be deadly.  Intestinal opportunistic pathogens encompass many genera and include organisms such as those in the Bacteroides fragilis group (i.e. B. fragilis and B. thetaiotaomicron), Escherichia coli, and Clostridium perfringens, resulting in an array of diseases and serious health risks.  Typically these diseases affect individuals in poor or weakened health (elderly, immuno-compromised, neonates, etc.) but can affect healthy individuals as well.  The intestinal tract is the main area of infection for these bacteria, however some of these organisms can be involved in wound infections, septicemia, urinary tract infections, and meningitis.  This study focused on three areas: 1) Analysis of differences in gene expression between Bacteroides and Escherichia coli, in order to learn more about promoter structure, 2) Establishment of a diabetic mouse model for use in examining bacterial synergy during a polymicrobial infection, and 3) Characterization of Escherichia coli 360A and evaluation of the role of several virulence factors and environmental modulators in the pathogenesis of this strain. \tWe used a newly developed lux gene reporter to evaluate gene expression in Bacteroides.  We observed that there are barriers in both transcription and translation initiation that appear to limit the expression of foreign genes in Bacteroides.  We were able to establish a mouse model for studying synergy during a polymicrobial infection and observed that E. coli 360A provided synergy towards B. fragilis NCTC 9343.  These experiments also showed that the longer a mouse is afflicted with the complications of diabetes the more susceptible it is to polymicrobial infections.  Systemic infections were used to evaluate the contribution of several virulence factors and environmental modulators in the pathogenesis of E. coli 360A.  The results showed that a strain lacking both virulence factors CNF1 and HlyA, the terminal oxidase cytochrome o, or a double cyo/cyd mutant were, deficient in survival in the spleen, but not the liver of BALB/c mice.",
  "description_provenance": [
    "Author Email: mmastrop@vt.edu",
    "Advisor Email: tilarson@vt.edu",
    "Advisor Email: tinzana@vt.edu",
    "Advisor Email: melville@vt.edu",
    "Advisor Email: ams@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:46Z (GMT). No. of bitstreams: 1 MMastropaolodissertation.pdf: 3805272 bytes, checksum: 3a76382958253f58da6b5b588b721d1d (MD5)   Previous issue date: 2008-07-30"
  ],
  "handle": "28529",
  "identifier_other": "etd-08052008-111424",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08052008-111424/",
  "identifier_uri": "http://hdl.handle.net/10919/28529",
  "publisher": "Virginia Tech",
  "relation_haspart": "MMastropaolodissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "diabetes",
    "mouse experiments",
    "cytotoxic necrotizing factor 1",
    "α-hemolysin",
    "Escherichia coli",
    "systemic infection",
    "cell culture",
    "polymicrobial infections",
    "lux reporter",
    "Bacteroides"
  ],
  "title": "Studies of Three Human Intestinal Opportunistic Pathogens",
  "type": "Dissertation"
}