{
  "contributor_author": "Hagedorn, Alexander Job",
  "contributor_committeechair": "Han, JongKoo",
  "contributor_committeemember": [
    "Smith, Robert M.",
    "Cook, Deborah F.",
    "White, Marshall S."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:14:44Z",
  "date_adate": "2009-08-31",
  "date_available": "2014-03-14T20:14:44Z",
  "date_issued": "2009-07-20",
  "date_rdate": "2009-08-31",
  "date_sdate": "2009-08-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Global industrialization was developed in response to both consumers and manufacturers demand for lower product prices and availability of goods and services.  As a result, products are transported greater distances.  Shipping constitutes the majority of costs in the export/import supply chain.  Shippers and buyers commonly attempt to offset these costs by maximizing the capacity of ocean freight containers (cube or weight).  Boxes (usually constructed of corrugated fiberboard) containing consumer grade products are commonly floor loaded into containers to maximize capacity.  Boxes that are not floor loaded are likely to be unitized on pallets in containers.  Beyond maximizing a container with cargo, a defined decision to determine which method of loading is most efficient in regard to cost and time does not exist.  For this research, field studies were conducted and questionnaires were distributed to identify the variables that influence efficiency.  A method to make an efficient decision was developed by incorporating the variables into a model.  The model compares the overall export/import supply chain efficiency for boxes that are floor loaded to boxes that are unitized on pallets in containers.  The recommended decision is determined by comparing the shipping and handling costs and the receiving dock door capability for the two loading methods.   The results of this research reveal that floor loading boxes can provide a higher value per container due to increased capacity.  Increased capacity by floor loading often reduces the number of containers needed to meet daily demand.  However, since manual labor is utilized for the loading/unloading process, more time is required, which results in higher labor costs and restricted product throughput.  Unitized boxes loaded in containers on pallets can limit container capacity, but allows for faster loading/unloading times (if no incompatibilities between product and pallet or pallet and/or material handling equipment exist), reduced labor costs, and the potential for increased product throughput.  Importing boxes unitized on pallets commonly requires more containers to meet demand, but fewer receiving dock doors.  Utilizing fewer dock doors allows otherwise occupied doors to be available to receive additional product.   The decision to floor load or unitize exports/imports needs to be made on a SKU basis meeting daily demand, not only per container capacity.  Labor cost, pallet cost, the magnitude of box variation between loading methods, and the ability of the receiver to process containers are all influencing factors in determining which loading method is most overall efficient.  Given the current cost for containerized shipments and considering all costs, most consumer goods are more efficiently shipped floor loaded.  When additional containers would be needed to meet demand for product unitized on pallets, floor loading will be more efficient.  When there is only a small difference in box count between floor loading and palletizing, palletizing product will be more efficient.  This will often occur when loads will meet container weight capacity before it reaches volume capacity.  If the product is too heavy to move manually it will be palletized.",
  "description_provenance": [
    "Author Email: ahagedor@vt.edu",
    "Advisor Email: rsmith4@vt.edu",
    "Advisor Email: dcook@vt.edu",
    "Advisor Email: hanjongk@vt.edu",
    "Advisor Email: mswhite@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:44Z (GMT). No. of bitstreams: 1 Alex_Hagedorn_Dissertation.pdf: 4821352 bytes, checksum: ae54124912887c23da2b557129d0cc16 (MD5)   Previous issue date: 2009-07-20"
  ],
  "handle": "28522",
  "identifier_other": "etd-08042009-114717",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08042009-114717/",
  "identifier_uri": "http://hdl.handle.net/10919/28522",
  "publisher": "Virginia Tech",
  "relation_haspart": "Alex_Hagedorn_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "containers",
    "floor loading",
    "unitization",
    "pallets",
    "material handling",
    "import distribution center",
    "export and import supply chain efficiency"
  ],
  "title": "The Effect of Pallets and Unitization on the Efficiency of Intercontinental Product Movement Using Ocean Freight Containers",
  "type": "Dissertation"
}