{
  "contributor_author": "Tiwari, Rajesh Kumar",
  "contributor_committeechair": "Dillard, John G.",
  "contributor_committeemember": [
    "Dorn, Harry C.",
    "Ward, Thomas C.",
    "Glanville, James O.",
    "Anderson, Mark R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:14:46Z",
  "date_adate": "2002-09-16",
  "date_available": "2014-03-14T20:14:46Z",
  "date_issued": "2002-07-18",
  "date_rdate": "2003-09-16",
  "date_sdate": "2002-08-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The lap shear strength of chromic acid anodized, primed, Ti-6Al-4V alloy bonded with a high performance FM-5 polyimide adhesive has been investigated as a function of thermal treatment for selected times at various temperatures in air.  The research findings indicate that the lap shear strength decreases with the increase in duration of the thermal treatment at constant temperature and with the increase in temperature at constant time.  The bond fails increasingly in the oxide coating with increasing treatment temperature and time of treatment.  Surface analysis results for debonded specimens suggest that the process leading to failure is the formation of fluorine-containing materials within the oxide, which weakens the adherend-adhesive bond.  The formation of the fluorine components is facilitated by treatment at elevated temperatures.  This study suggests that the presence of fluoride ions in the anodic oxide coating, prior to bonding, is detrimental to the bond strength of adhesively bonded Ti-alloy when exposed to high temperatures.   The wedge test configuration was used to investigate the influence of temperature on the bond durability of adhesively bonded chromic acid anodized Ti-6Al-4V alloy in air.  Based on the average crack length vs. exposure time data, the bond durability varied in the order -25°C > 24°C > 177°C.  In each case, the bonded joint failed cohesively within the adhesive, irrespective of the temperature of exposure.  XPS analysis and scanning electron photomicrographs of failure surfaces revealed that the failure occurred at the scrim cloth/adhesive interface.     The influence of thermal treatment history on the bond durability of adhesively bonded chromic acid anodized Ti-6Al-4V alloy immersed in boiling water was also investigated.  The average crack length vs. immersion time indicated no significant differences for specimens that were thermally treated and then bonded compared to the non-thermally treated specimens.  In addition, the failure mode was cohesive within the adhesive for specimens prepared using various thermal treatment conditions.  The crack growths for samples treated for 0.5 hour and 1.0 hour and for non-thermally treated specimens for any given exposure time were equivalent.  In addition, cohesive failure (failure within adhesive) was observed for each specimen under each treatment condition.  The specimens that were bonded and then thermally treated for 3 hours, failed in the oxide coating immediately upon insertion of the wedge.  Surface analysis results for debonded specimens suggest that the process leading to failure is the formation of fluorine-containing materials within the oxide.  The measured average activation energy for the formation of aluminum fluoride species is 149 kJ/mol.  The high activation energy suggests that the rate of aluminum fluoride formation is substantial only at high temperatures.     In summary, the presence of fluorides in the anodic oxide coatings prior to bonding is detrimental to the overall strength and durability of adhesively bonded chromic acid anodized Ti-6Al-4V joints which have been exposed to high temperatures (350°C-399°C).",
  "description_provenance": [
    "Author Email: rajeshtiw@hotmail.com",
    "Advisor Email: hdorn@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: jglanvil@vt.edu",
    "Advisor Email: maander6@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:46Z (GMT). No. of bitstreams: 5 05rktiwari.pdf: 3104776 bytes, checksum: db83c9e08de07c1121f7ba3b6ba509fb (MD5) 04rktiwari.pdf: 15679493 bytes, checksum: 1f4ff8502c6e2e1f03d02ca5aa5f858e (MD5) 01rktiwari.pdf: 210426 bytes, checksum: e395018c03c3f9d9e959601605b85e02 (MD5) 03rktiwari.pdf: 10568199 bytes, checksum: 56192648f0f184b16a39e9648dbc3bf1 (MD5) 02rktiwari.pdf: 473991 bytes, checksum: f50f45865e805fa8042231e41fadda44 (MD5)   Previous issue date: 2002-07-18"
  ],
  "handle": "28528",
  "identifier_other": "etd-08052002-102300",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08052002-102300/",
  "identifier_uri": "http://hdl.handle.net/10919/28528",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "05rktiwari.pdf",
    "04rktiwari.pdf",
    "01rktiwari.pdf",
    "03rktiwari.pdf",
    "02rktiwari.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "chromic acid anodization",
    "polyimide",
    "FM-5 adhesive",
    "titanium 6Al-4V",
    "thermal treatment",
    "lap shear test",
    "aluminum fluoride",
    "oxide stability",
    "durability",
    "wedge test"
  ],
  "title": "The Thermal Stability of Anodic Oxide Coatings - Strength and Durability of Adhesively Bonded Ti-6Al-4V Alloy",
  "type": "Dissertation"
}