{
  "contributor_author": "Harris, Kevin W.",
  "contributor_committeechair": "Harris, Larry A.",
  "contributor_committeemember": [
    "Niles, Jerome A.",
    "Parson, Stephen R.",
    "Weber, Larry J.",
    "Yardley, Dianne R."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:14:45Z",
  "date_adate": "1999-08-06",
  "date_available": "2014-03-14T20:14:45Z",
  "date_issued": "1999-07-26",
  "date_rdate": "2000-08-06",
  "date_sdate": "1999-08-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "High school coaching is recognized by many to be a very difficult occupation.  Many of the pressures in coaching center around the interactions which occur between coaches and the parents of the athletes they coach.  Very little is known about what parents expect from high school athletic programs.  In order to determine what parental expectations are of high school sports, parents from three schools within the same school division who had children who participated in a team sport during the 1997-1998 school year were surveyed by mail.  The survey attempted to determine parental positions on various issues which included the relationship between athletic participation and self-esteem, responsible decision making, educational aspirations, participation in games, parental support for their children, and expectations of coaches.  A response rate of over 40 percent was observed.  In addition responses were disaggregated to determine if differences existed between schools and gender.  Responses to the survey indicate that parents are very supportive of athletic activities and believe that athletics have a positive influence on the lives of their children.  Substantial differences between gender and schools were not observed.  Results from this survey can provide coaches with an abundance of information that can be used in establishing athletic programs and maintaining positive relationships with parents of their athletes.",
  "description_provenance": [
    "Author Email: kwharris@i-plus.net",
    "Advisor Email: lharris@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: dyardley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:45Z (GMT). No. of bitstreams: 1 HarrisKW.pdf: 306493 bytes, checksum: b88de958875b6f3125c0a857a6ad4f3a (MD5)   Previous issue date: 1999-07-26"
  ],
  "handle": "28526",
  "identifier_other": "etd-080499-202033",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-080499-202033/",
  "identifier_uri": "http://hdl.handle.net/10919/28526",
  "publisher": "Virginia Tech",
  "relation_haspart": "HarrisKW.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "high school athleetics",
    "parental expectations",
    "physical education and coaching",
    "athletic program development"
  ],
  "title": "Parental Expectations of High School Interscholastic Athletic Activities",
  "type": "Dissertation"
}