{
  "contributor_author": "Strock, Christopher Moore",
  "contributor_committeecochair": [
    "Garvin, Michael J.",
    "Borrego, Maura Jenkins"
  ],
  "contributor_committeemember": [
    "Dietrich, Andrea M.",
    "Fiori, Christine M.",
    "Hawdon, James E.",
    "Pearce, Annie R."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:14:44Z",
  "date_adate": "2010-08-23",
  "date_available": "2014-03-14T20:14:44Z",
  "date_issued": "2010-07-22",
  "date_rdate": "2010-08-23",
  "date_sdate": "2010-08-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine the effectiveness of water and sanitation service delivery in resource-limited settings using two different social theories (modernization and world system). Understanding that barriers to effectiveness are rooted in global structures that tend to present at local levels helps redefine the problem leading to comprehensive policies and practices. The guiding research questions included an identification of an effectiveness gap in services delivered in developed countries compared to those in developing countries. This study included a survey of water and sanitation professionals gauging their opinions on trends within the sector. Survey respondents demonstrated that the sector tends to align with localized (i.e. modernist) approaches. This may explain the perpetuation of differential patterns in water and sanitation access and associated diseases and deaths in developing countries. Through a case study of Partners In Health (PIH), a medical-oriented non-governmental organization used as a proxy for water and sanitation organizations, this work illustrated why personal and organizational philosophies and perspectives influence how we organize and act. It concludes with a discussion of engineering decision making through the lenses offered by modernization and world system theories; presents an organizational structure that allows organizations to overcome theoretical and geographic boundaries; and offers a set of recommendations learned from PIH and those the sector does well. This research shows how water and sanitation organizations, practices, and policies that consider local and global forces are more effective at delivering services in developing countries than those focusing solely on local forces.",
  "description_provenance": [
    "Author Email: cstrock@vt.edu",
    "Advisor Email: garvin@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Advisor Email: cfiori@vt.edu",
    "Advisor Email: hawdonj@vt.edu",
    "Advisor Email: apearce@vt.edu",
    "Advisor Email: mborrego@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:44Z (GMT). No. of bitstreams: 1 Strock_CM_D_2010.pdf: 1586991 bytes, checksum: d1aebafdd1c1116a7fce62cdc8be2582 (MD5)   Previous issue date: 2010-07-22"
  ],
  "handle": "28523",
  "identifier_other": "etd-08042010-161404",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08042010-161404/",
  "identifier_uri": "http://hdl.handle.net/10919/28523",
  "publisher": "Virginia Tech",
  "relation_haspart": "Strock_CM_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "millennium development goals",
    "modernization and world system theories",
    "case study",
    "Partners In Health",
    "organizational effectiveness",
    "social justice",
    "international development",
    "water and sanitation"
  ],
  "title": "Seeing Beyond Service - Redefining the Problem of Water and Sanitation Service Delivery in Resource-Limited Settings to Enable Effective Solutions",
  "type": "Dissertation"
}