{
  "contributor_author": "Lucas, Nicole James",
  "contributor_committeecochair": [
    "Kershaw, Terry",
    "Hughes, Michael D."
  ],
  "contributor_committeemember": [
    "Yuan, Anastasia Sue Vogt",
    "Graves, Ellington T.",
    "Bailey, Carol A."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:14:44Z",
  "date_adate": "2008-09-09",
  "date_available": "2014-03-14T20:14:44Z",
  "date_issued": "2008-07-14",
  "date_rdate": "2008-09-09",
  "date_sdate": "2008-08-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Mental health researchers have placed a lot of emphasis on the importance of informal social support resources and the effect on mental health outcomes among African Americans to help explain the low rates of mental disorder among this population (Cockerham 2006; Tausig, Michello, and Subedi 2004; Brown, Sellers, Brown, and Jackson 1999).  It has been hypothesized that informal social support resources (family, friends, partner/spouse, etc.) used by African Americans (Taylor, Chatters, and Jackson 1997; Neighbors 1985; Stack 1974) buffers/reduces the effect of stress and distress on mental health (Pearlin 1999; Taylor, Hardison, Chatters 1996).  In this study I combined the National Comorbidity Survey (NCS) and the National Comorbidity Survey - Replication (NCS-R) data sets to investigate the influence that relatives, friends, partners/spouses, and religious involvement have on levels of depression among African American men and women. I found that there is not much of a gender difference in the experiences of social support among African American men and women.  I also found that for the most part social support has the same effect on depression for both African American men and women.  Finally, there are no substantial gender differences in the way social support buffers stress for African Americans.",
  "description_provenance": [
    "Author Email: njames@vt.edu",
    "Advisor Email: avy@vt.edu",
    "Advisor Email: egraves@vt.edu",
    "Advisor Email: tkershaw@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: mdh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:44Z (GMT). No. of bitstreams: 1 Depression.pdf: 301672 bytes, checksum: da55e4f7e92d64af1ea1565571b82a7f (MD5)   Previous issue date: 2008-07-14"
  ],
  "handle": "28521",
  "identifier_other": "etd-08042008-160406",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08042008-160406/",
  "identifier_uri": "http://hdl.handle.net/10919/28521",
  "publisher": "Virginia Tech",
  "relation_haspart": "Depression.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mental health",
    "African American men",
    "African American women",
    "gender",
    "social support",
    "networks",
    "depression",
    "health"
  ],
  "title": "The Use of Social Support Among African American Men and Women and Its Effect on Depression",
  "type": "Dissertation"
}