{
  "contributor_author": "Snow, Kristine Garren",
  "contributor_committeecochair": [
    "Hohenshil, Thomas H.",
    "Fortune, Jimmie C."
  ],
  "contributor_committeemember": [
    "Curcio, Claire Cole Vaught",
    "Johnson, Scott W.",
    "Lynch, Sherry K."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:14:47Z",
  "date_adate": "1999-08-07",
  "date_available": "2014-03-14T20:14:47Z",
  "date_issued": "1999-08-02",
  "date_rdate": "2000-08-07",
  "date_sdate": "1999-08-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "(ABSTRACT)  \tThe primary purpose of this qualitative study was to discover the kinds of issues that were troubling sixth-grade students while they were in school through focus groups which were led by eighth-grade peer helpers in the school, the Natural Helpers.  The second purpose of this study was to evaluate the information that the Natural Helpers gathered in the focus groups and to compare this information to the information that the participants reported on a personal problem checklist. Third, the purpose of this study was to keep a tally of the types of worries about which the sixth graders sought help from heir guidance counselor.  Fourth, the purpose of this study was to compare these findings to information in the existing literature.  \tThe participants were 48 sixth-grade students (21 males and 27 females) whose heterogeneously-grouped classes at a suburban middle school in the Roanoke Valley in Virginia were randomly selected to participate in this study.  After the students and the parents of the students signed informed consent forms, the students completed personal problem checklists and participated in one of nine student-led focus groups.  Two of the focus groups were exclusively male, two were exclusively female, and the remaining groups contained males and females.  \tResults from the study indicated that the participants reported a variety of worries, but the majority of their discussions pertained to issues concerning grades, social lives, violence, trouble at school, and family issues. The sixth graders reported similar issues as concerns on the personal problem checklist and sought assistance from their guidance counselor for similar concerns.  However, there was one main difference in the findings between the three methodologies:  the students sought assistance for worries concerning violence and spoke extensively about their concerns regarding violence during the focus groups but did not report violence as a main concern on the problem checklist.  Probable reasons for these differences were addressed.  Overall, the participants reported many concerns that were similar to the concerns that were reported by other adolescents in the professional literature, and they reported concerns that were consistent with the developmental literature.  Exclusively male focus groups, exclusively female focus groups, and mixed focus groups generated similar information with a few noted exceptions regarding the content of their discussions and with a few noted exceptions regarding the extent to which the males spoke during the groups. This study generated recommendations for future research and for the counseling profession.",
  "description_provenance": [
    "Author Email: mustang@vt.edu",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: vaughtc@vt.edu",
    "Advisor Email: scjohnso@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: sklynch@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:47Z (GMT). No. of bitstreams: 1 Kristine.pdf: 124722 bytes, checksum: a2115b9b628341db52ec1138ba441324 (MD5)   Previous issue date: 1999-08-02"
  ],
  "handle": "28534",
  "identifier_other": "etd-080599-145508",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-080599-145508/",
  "identifier_uri": "http://hdl.handle.net/10919/28534",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kristine.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Early Adolescents",
    "School Counseling"
  ],
  "title": "Through the Eyes and Ears of Students:  Sixth Graders' Worries",
  "type": "Dissertation"
}