{
  "contributor_author": "Wagner, Paul F",
  "contributor_committeechair": "Benfield, Ernest Fredrick",
  "contributor_committeemember": [
    "Dolloff, C. Andrew",
    "Jones, Robert H.",
    "Wynne, Randolph H.",
    "Webster, Jackson R."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:14:47Z",
  "date_adate": "2001-08-06",
  "date_available": "2014-03-14T20:14:47Z",
  "date_issued": "2001-05-22",
  "date_rdate": "2002-08-06",
  "date_sdate": "2001-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "I examined streams in the Joyce Kilmer-Slickrock wilderness to determine if streams responded to logging following 75 y of recovery.  Joyce Kilmer was never logged and the Slickrock wilderness was logged from 1917 until 1922.  Wood was common in unlogged streams and averaged 417 m3 of wood/ha of streambed.  Logged streams had significantly less wood (1.1 m3 of wood/ha of stream), probably because of the construction of railroads in streambeds used to remove timber.  Fine substrates (<5.6 mm diameter) were less abundant in logged streams and the retention of fines decreased as wood volume decreased.  Species diversity was similar between streams in unlogged and logged catchments; however, the abundance of several taxa and functional feeding groups did differ.  Streams in unlogged catchments had significantly greater proportions of shredders while streams in logged catchments had significantly greater proportions of scrapers.  Ecosystem parameters showed that the linkages between streams and the forests they drain were weaker in logged   than unlogged streams and that unlogged streams derived a greater proportion of fixed carbon from riparian vegetation.  Stream-forest linkage strength increased as debris dam abundance increased, while the use of riparian vegetation inputs increased as moss increased.  Contrary to predictions, solute storage was significantly greatest in logged catchments and negatively related to debris dam abundance that decreased streambed permeability.  Additionally, phosphorus retention, instead of being enhanced by solute storage, was negatively related to transient storage.  Uptake velocity was significantly greater in unlogged than logged streams and significantly related to debris dam abundance.  Mean breakdown rate of experimental leaf packs and wood veneers was not significantly different between unlogged and logged streams.  Leaf breakdown was strongly related to shredder colonization, while wood breakdown was unrelated to variables measured.  Much of the persisting disturbance to streams by past logging was directly or indirectly related to differences in wood volume, debris dam frequency, and streambed substrate composition.  Results support the hypothesis that logging results in a downstream shift from the headwaters in ecosystem function and that logging disturbance to streams likely persists for centuries.",
  "description_provenance": [
    "Author Email: pwagner@vt.edu",
    "Advisor Email: benfield@vt.edu",
    "Advisor Email: adoll@vt.edu",
    "Advisor Email: rjones@vt.edu",
    "Advisor Email: wynne@vt.edu",
    "Advisor Email: webster@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:47Z (GMT). No. of bitstreams: 1 pwagnerdiss.pdf: 1017255 bytes, checksum: 08276a47f84d0c4b74e6673de1c25d5e (MD5)   Previous issue date: 2001-05-22"
  ],
  "handle": "28538",
  "identifier_other": "etd-08062001-090616",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08062001-090616/",
  "identifier_uri": "http://hdl.handle.net/10919/28538",
  "publisher": "Virginia Tech",
  "relation_haspart": "pwagnerdiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Streams",
    "Recovery",
    "Logging",
    "Southern Appalachian Mountains"
  ],
  "title": "Legacies of Early 20th Century Logging in Southern Appalachian Streams",
  "type": "Dissertation"
}