{
  "contributor_author": "Thornberry, Matthew P.",
  "contributor_committeechair": "Deck, Paul A.",
  "contributor_committeemember": [
    "Gandour, Richard D.",
    "Dillard, John G.",
    "Hanson, Brian E.",
    "Anderson, Mark R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:14:48Z",
  "date_adate": "2001-08-06",
  "date_available": "2014-03-14T20:14:48Z",
  "date_issued": "2001-08-03",
  "date_rdate": "2002-08-06",
  "date_sdate": "2001-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Substituent effects in eta5-cyclopentadienyl (Cp) transition metal complexes have been intensely studied since the discovery of the first such complex, ferrocene.  Modifications of the Cp ligand framework effect changes in the physical properties and chemical reactivity of the coordinated transition metal.  This concept is useful when applied to catalysis mediated by Cp complexes, because the performance of the catalyst can be markedly improved using well-chosen ligand substituents.  Studies of electronic substituent effects ideally employ a wide range of electron-donating and electron-withdrawing groups.  Unfortunately, most of the available electron-withdrawing groups suffer from problems with Cp ligand synthesis, Cp anion stability, and electron-withdrawing group stability under catalytic conditions.  This dissertation shows that the pentafluorophenyl (C6F5) substituent is highly electron-withdrawing but avoids all of these problems.  Several new C6F5-substituted cyclopentadienes are prepared by the reaction of sodium cyclopentadienide and hexafluorobenzene (C6F6) under varying conditions.  Corresponding C6F5-substituted cyclopentadienyl ligands (sodium salts) are obtained upon deprotonating the dienes with NaH.  Complexes of Mn(I), Re(I), Fe(II), Co(II), Zr(IV) are synthesized by reacting these ligands with transition metal halides.  The acidities of several C6F5- and C5F4N-substituted cyclopentadienes and indenes are measured using 19F NMR spectroscopy.  The electron-withdrawing fluorinated aryl groups have a substantial acidifying effect.  The identity and number of substituents (C6F5, C5F4N, CH3, and t-Bu), the position of the substituents on the cyclopentadiene, and the intramolecular (vicinal) steric effects also influence acidity.  The electron-withdrawing ability of the C6F5 group is also characterized by infrared spectroscopic analysis of substituted CpM(CO)3 (M = Mn(I) and Re(I)) and electrochemical analysis of substituted ferrocenes.  X-ray crystal structures of several C6F5-substituted Cp complexes reveal interesting structural motifs, including pi-stacking of the C6F5 substituents, Cp-M bond elongation, and CO-C6F5 interactions.  In addition, dynamic Cp-C6F5 and Cp-M rotational barriers are measured by variable temperature NMR spectroscopy.   Finally, ethylene polymerizations and ethylene/1-hexene copolymerizations are conducted using C6F5- and C6H5-substituted zirconocene dichlorides as catalysts.  Contrary to findings published elsewhere, this study shows that substituent electronic effects induce substantial changes in comonomer incorporation.",
  "description_provenance": [
    "Author Email: mthornbe@vt.edu",
    "Advisor Email: rgandour@chemserver.chem.vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: pdeck@chemserver.chem.vt.edu",
    "Advisor Email: bhanson@chemserver.chem.vt.edu",
    "Advisor Email: manderson@chemserver.chem.vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:48Z (GMT). No. of bitstreams: 1 etd_thornberry.pdf: 817503 bytes, checksum: af002617293b7c7412bc3075449843b5 (MD5)   Previous issue date: 2001-08-03"
  ],
  "handle": "28539",
  "identifier_other": "etd-08062001-143954",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08062001-143954/",
  "identifier_uri": "http://hdl.handle.net/10919/28539",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd_thornberry.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "substituent effects",
    "polymerization",
    "cyclopentadienyl",
    "pentafluorophenyl"
  ],
  "title": "Synthesis, Properties, and Reactivity of Pentafluorophenyl Substituted Cyclopentadienes and Their Transition Metal Complexes",
  "type": "Dissertation"
}