{
  "contributor_author": "Chen, Honghui",
  "contributor_committeecochair": [
    "Kumar, Raman",
    "Kadlec, Gregory B."
  ],
  "contributor_committeemember": [
    "Mozumdar, Abon",
    "Keown, Arthur J.",
    "Shome, Dilip K."
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:14:47Z",
  "date_adate": "1999-08-07",
  "date_available": "2014-03-14T20:14:47Z",
  "date_issued": "1999-07-23",
  "date_rdate": "2012-06-22",
  "date_sdate": "1999-08-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Theoretical models suggest that ownership structure may be an important determinant of securities' market characteristics.  For example, the presence of informed traders leads to greater bid-ask spreads (Copeland and Galai (1983), and Glosten and Milgrom (1985)), and strategic trading of informed and discretionary liquidity traders leads to intertemporal variation in both trading volume and trading costs (Admati and Pfleiderer (1988), and Foster and Viswanathan (1990)).  However, the empirical studies on the effect of ownership structure on market characteristics are limited.  Prior studies focus on either one type of market characteristics or one type of owners, and usually do not address the potential endogeneity problem between market characteristics and ownership structure.  This dissertation extends existing literature with two essays on ownership and market characteristics.  <p> The first essay broadly examines the effect of ownership structure (inside ownership, institutional ownership, and individual ownership) on market characteristics such as order flow, price impact of trade, quoted spread and quoted depth.  For each market characteristic examined, I establish an empirical model based on existing theories and empirical evidence.  My results indicate that stocks with greater inside ownership have lower order flow, greater price impact of trade, greater quoted spread and lower quoted depth, while stocks with greater active institutional ownership and greater individual shareholders have greater order flow, smaller price impact of trade, lower spread and greater depth.  These results may have implications for corporate governance.  For example, while agency theory suggests managerial ownership may align interests of managers and shareholders, this essay finds that this comes with a liquidity cost.  Further, my results suggest there are liquidity benefits of individual and institutional ownership.  If as suggested by Amihud and Mendelson (1989), investors require a higher rate of return for illiquid stocks, firms can target their shares to specific types of investors (for example, active institutions and individuals) to improve liquidity, and reduce their cost of capital.<p> The second essay is a specific application of the first essay and examines the effect of institutional ownership on price discovery around earnings announcements.  I select earnings announcements as the event for my analysis because there are three well-documented regularities about earnings announcements.  First, market participants anticipate the forthcoming earnings announcements.  Second, the announcements of earnings news are usually accompanied by abnormal price changes and abnormal volume.  Third, there is evidence that stock price continues to move in the direction of earnings surprise after the announcements of earnings news.  Since results from the first essay suggest that institutional investors affect market characteristics such as price impact of trade and quoted spread, I expect that institutional participation would also affect the price discovery process around earnings announcements.  My results indicate that institutional ownership is associated with greater anticipation of earnings news.  Further, stocks with greater institutional ownership have a greater price response to announcements of earnings news.  Finally, institutional investors have no significant effect on post-announcement drift.  The results of the second essay suggest that institutional investors contribute to the price discovery process.",
  "description_provenance": [
    "Author Email: hchen@vt.edu",
    "Advisor Email: abon@vt.edu",
    "Advisor Email: emily@vt.edu",
    "Advisor Email: rkumar@vt.edu",
    "Advisor Email: kadlec@vt.edu",
    "Advisor Email: dilip@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:47Z (GMT). No. of bitstreams: 1 DISS.PDF: 387269 bytes, checksum: 482379d3768b09c3b10d4e8cbf8269c3 (MD5)   Previous issue date: 1999-07-23"
  ],
  "handle": "28535",
  "identifier_other": "etd-080599-214218",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-080599-214218/",
  "identifier_uri": "http://hdl.handle.net/10919/28535",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISS.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Ownership Structure",
    "Market Microstructure",
    "Price Discovery",
    "Analyst Following",
    "Earnings Announcements"
  ],
  "title": "Two Essays on Ownership and Market Characteristics",
  "type": "Dissertation"
}