{
  "contributor_author": "Werth, Patricia Guy",
  "contributor_committeechair": "Stewart, Daisy L.",
  "contributor_committeemember": [
    "Asselin, Susan B.",
    "Leech, Irene E.",
    "Heath-Camp, Betty A.",
    "O'Reilly, Patrick A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:14:47Z",
  "date_adate": "1999-08-26",
  "date_available": "2014-03-14T20:14:47Z",
  "date_issued": "1999-07-07",
  "date_rdate": "2000-08-26",
  "date_sdate": "1999-08-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Vocational Education Accountability in Virginia: Analysis of Vocational Completers' Employment Status, Earnings and Job Satisfaction                                    Patricia Guy Werth                             (ABSTRACT)   Research and analysis regarding the employment outcomes of vocational education completers are growing in importance. States and their educational systems are increasingly confronted with the need to justify programs and funding and to provide evidence of the numbers and status of students graduated, obtaining  employment, and continuing in postseconday education. The need to review, improve, and implement effective programs, and to serve the practical needs of all students, including those in targeted populations, will continue in the future. The purposes of this study were to investigate and describe Virginia's vocational program completers by employment status, earnings, and job satisfaction through a review of three years of follow-up data. Descriptive statistics, including frequencies, percentages, and overall distributions, were used to identify characteristics of 9,474 employed vocational completers, in order to provide relevant data for improving vocational education in Virginia and for use in establishing baseline data for future studies. In looking at employment outcomes for targeted populations, this study found that employment figures resembled those of non-targeted populations, with high percentages reporting employment related to the service area completed. Vocational completers identified as having limited English proficiency were reported in very small numbers. Earnings data indicated clearly that with each consecutive year of the three years for which data were included, vocational completers were earning higher wages. Earnings also increased with each consecutive year for completers from targeted populations, with vocational completers who were academically disadvantaged or disabled receiving higher wages than completers from economically disadvantaged backgrounds. Completers from economically disadvantaged backgrounds also reported lower levels of job satisfaction and more part-time employment. Additionally, vocational completers in all service areas reported high levels of job satisfaction. Further longitudinal research should be conducted in order to better analyze vocational completers' transition to the workforce. Such research could be useful when planning and implementing policy, requesting grant funding, and instituting educational innovations.",
  "description_provenance": [
    "Author Email: pwerth@tcia.net",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: sasselin@vt.edu",
    "Advisor Email: ileech@vt.edu",
    "Advisor Email: heathb@vt.edu",
    "Advisor Email: orielly@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:47Z (GMT). No. of bitstreams: 13 abst.pdf: 5119 bytes, checksum: fa6843b66699f083eb3657b583193a24 (MD5) appenc.pdf: 16241 bytes, checksum: 681514f7ec048ccdc2663ef13ca27afb (MD5) table.pdf: 11716 bytes, checksum: 1f16d366f39ec11668b5676af50d96ca (MD5) app2.pdf: 81328 bytes, checksum: b55e3f2434917a89db2c63edc80eeb78 (MD5) ded.pdf: 7058 bytes, checksum: 0819484e5c9928199b2d90f9b7b89237 (MD5) app1.pdf: 95127 bytes, checksum: b4f82cf74a7697a124200b971aa3c7c0 (MD5) app4.pdf: 369564 bytes, checksum: 2668a76bac140a12a5d638539bb297e5 (MD5) app3.pdf: 171163 bytes, checksum: 6bd31e10082c88ba3fd2df0ca07dc386 (MD5) ref.pdf: 18464 bytes, checksum: 6a00330a444e59145ea3184f6f215de2 (MD5) disser5.pdf: 34934 bytes, checksum: 8fab8b138a331c34d3f8935ea2e1dcad (MD5) disser1.pdf: 87027 bytes, checksum: 08e45bb065c0a0f035f5f66fcb5e55ed (MD5) disser4.pdf: 116818 bytes, checksum: 1b8df776a0100e489f13c10df7564070 (MD5) title.pdf: 3762 bytes, checksum: 2059f06d592d6e6fcd7de48be78cbb54 (MD5)   Previous issue date: 1999-07-07"
  ],
  "handle": "28536",
  "identifier_other": "etd-080599-232633",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-080599-232633/",
  "identifier_uri": "http://hdl.handle.net/10919/28536",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "abst.pdf",
    "appenc.pdf",
    "table.pdf",
    "app2.pdf",
    "ded.pdf",
    "app1.pdf",
    "app4.pdf",
    "app3.pdf",
    "ref.pdf",
    "disser5.pdf",
    "disser1.pdf",
    "disser4.pdf",
    "title.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Targeted Populations",
    "Job Satisfaction",
    "Earnings",
    "Employment Status",
    "Vocational Education",
    "Vocational Service Areas"
  ],
  "title": "Vocational Education Accountability in Virginia: Analysis of Vocational Completers' Employment Status, Earnings, and Job Satisfaction",
  "type": "Dissertation"
}