{
  "contributor_author": "Elvington, Mark",
  "contributor_committeechair": "Brewer, Karen J.",
  "contributor_committeemember": [
    "Hanson, Brian E.",
    "Yee, Gordon T.",
    "Deck, Paul A.",
    "Anderson, Mark R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:14:50Z",
  "date_adate": "2007-10-23",
  "date_available": "2014-03-14T20:14:50Z",
  "date_issued": "2007-07-24",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The research presented here is focused on photochemical studies of a supramolecular structural motif for photoinitiated electron collection.  The complex studied, [{(bpy)2Ru(dpp)}2RhCl2](PF6)5, is of the form LA-BL-EC-BL-LA comprising a Ru(II) polyazine light absorber (LA) bearing two bpy (bpy = 2,2&#39;-bipyridine) ligands, two dpp (dpp = 2,3&#39;-bis(2-pyridyl)pyrazine) bridging ligands (BL), and a central rhodium(III) electron collector (EC).  Ruthenium-polyazine light absorbers are commonly used in light to energy conversion systems due to the intense metal to ligand charge transfer (MLCT) absorptions observed in the visible spectrum.  Electrochemical methods establish rhodium as the site of localization of the lowest lying unoccupied molecular orbital, while phosphorescence measurements are used to study electron transfer within the supramolecular assembly.  Electrochemical and photochemical experiments show that the absorption of light in the rhodium centered supramolecular complex, [{(bpy)2Ru(dpp)}2RhCl2](PF6)5, can initiate the sequential transfer of multiple electrons to the rhodium metal center, i.e. photoinitiated electron collection.  A mechanistic study of photoinitiated electron collection, involving a Stern-Volmer analysis of emission quenching and product formation, is also presented, to determine the rate constants of the possible excited state and ground state reactions.  One application of a molecular device for photoinitiated electron collection is fuel production.  It has been shown that the complex studied, [{(bpy)2Ru(dpp)}2RhCl2](PF6)5, can collect reducing equivalents and use them to catalyze the reduction of water to hydrogen.  Photocatalytic hydrogen generation experiments will also be presented including initial quantum yield optimization experiments.",
  "description_provenance": [
    "Author Email: melvingt@vt.edu",
    "Advisor Email: hanson@vt.edu",
    "Advisor Email: gyee@vt.edu",
    "Advisor Email: pdeck@vt.edu",
    "Advisor Email: kbrewer@vt.edu",
    "Advisor Email: mark.anderson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:50Z (GMT). No. of bitstreams: 1 elvingtonFINALd.pdf: 1608941 bytes, checksum: 010a08d27272b5dc55322f1070d159be (MD5)   Previous issue date: 2007-07-24"
  ],
  "handle": "28548",
  "identifier_other": "etd-08062007-220746",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08062007-220746/",
  "identifier_uri": "http://hdl.handle.net/10919/28548",
  "publisher": "Virginia Tech",
  "relation_haspart": "elvingtonFINALd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "supramolecular",
    "photocatalysis",
    "photochemistry"
  ],
  "title": "A Rhodium Centered Supramolecular Complex as a Photoinitiated Electron Collector",
  "type": "Dissertation"
}