{
  "contributor_author": "Lewis, Tracy L.",
  "contributor_committeecochair": [
    "Rosson, Mary Beth",
    "Pérez-Quiñones, Manuel A."
  ],
  "contributor_committeemember": [
    "Chase, Joseph Dwight",
    "Tegarden, David P.",
    "Smith, Wanda J.",
    "Edwards, Stephen H.",
    "Crawford, Helen J."
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2014-03-14T20:14:49Z",
  "date_adate": "2004-08-12",
  "date_available": "2014-03-14T20:14:49Z",
  "date_issued": "2004-07-16",
  "date_rdate": "2005-08-12",
  "date_sdate": "2004-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The available literature supports the fact that some students experience difficulty learning object-oriented design (OOD) principles. Previously explored predictors of OOD learning difficulties include student characteristics (cognitive activities, self-efficacy), teaching methodologies (teacher centered, course complexity), and student experiences (prior programming experience). Yet, within an extensive body of literature devoted to OOD, two explanations of student difficulty remain largely unexplored: (1) varying conceptualizations of the underlying principles/strategies of OOD, and (2) preparedness or readiness to learn OOD. This research also investigated the extent to which individual differences impacted DRAS and OOD performance. The individual difference measures of interest in this study included college grade point average, prior programming experience, cognitive abilities (spatial orientation, visualization, logical reasoning, flexibility, perceptual style), and design readiness. In addition, OOD performance was measured using two constructs: course grade (exams, labs, programs, overall), and a specially constructed design task.  Participants selected from the CS2 course from two southeastern state universities were used within this study, resulting in a sample size of 161 (School A, n = 76; School B, n = 85). School A is a mid-sized comprehensive university and School B is a large research-intensive university. If was found that the schools significantly differed on all measures of prior computer science experience and cognitive abilities.  Path analysis was conducted to determine which individual differences were related to design readiness and OOD performance.   In summary, this research identified that instructors can not ignore individual differences when teaching OOD. It was found that the cognitive ability visualization, prior OO experience, and overall college grade point average should be considered when teaching OOD. As it stands, without identifying specific teaching strategies used at the schools within this study, this research implies that OOD may require a certain level of practical computer experience before OOD is introduced into the curriculum. The cognitive ability visualization was found to have a significant indirect relationship with overall course grade through the mediating variable design readiness. Further, the results suggest that the DRAS may serve as a viable instrument in identifying successful OOD students as well as students that require supplemental OOD instruction.",
  "description_provenance": [
    "Author Email: tracyL@vt.edu",
    "Advisor Email: mrosson@psu.edu",
    "Advisor Email: perez@cs.vt.edu",
    "Advisor Email: jchase@radford.edu",
    "Advisor Email: david.tegarden@vt.edu",
    "Advisor Email: wjsmith@vt.edu",
    "Advisor Email: edwards@cs.vt.edu",
    "Advisor Email: hjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:49Z (GMT). No. of bitstreams: 1 FinalDissertation_TLL.pdf: 2766516 bytes, checksum: d5ab05b0189cbe5c7e362d4498743238 (MD5)   Previous issue date: 2004-07-16"
  ],
  "handle": "28545",
  "identifier_other": "etd-08062004-115926",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08062004-115926/",
  "identifier_uri": "http://hdl.handle.net/10919/28545",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalDissertation_TLL.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Cognitive abilities",
    "Academic performance",
    "Design readiness",
    "Individual differences",
    "Design",
    "Object-oriented design",
    "Prior computer science experience",
    "Path analysis"
  ],
  "title": "Design Readiness: An Exploratory Model of Object-Oriented Design Performance",
  "type": "Dissertation"
}