{
  "contributor_author": "Cao, Hu",
  "contributor_committeechair": "Viehland, Dwight D.",
  "contributor_committeemember": [
    "Wang, Yu",
    "Reynolds, William T. Jr.",
    "Li, Jie-Fang"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:14:51Z",
  "date_adate": "2008-10-10",
  "date_available": "2014-03-14T20:14:51Z",
  "date_issued": "2008-05-08",
  "date_rdate": "2008-10-10",
  "date_sdate": "2008-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract Ferroelectric and ferromagnetic materials have been extensively studied for potential applications in sensors, actuators and transducers. Highly electrostrictive (1-x)Pb(Mg1/3Nb2/3)-xPbTiO3 (PMN-xPT) and highly magnetostrictive Fe-xat.%Ga are two such novel materials. Both materials systems have chemical disorders and structural inhomogeneity on a microscale, giving rise to an interesting diversity of crystal structures and novel macroscopic physical properties, which are dependent on thermal and electrical histories of the crystals. In this thesis, I have to investigated phase transformations in these two systems under thermal and field (electric/magnetic) histories, using x-ray and neutron scattering techniques.<p> In PMN-xPT crystals, x-ray and neutron diffractions were performed along the different crystallographic orientations and for different thermal and electrical histories. Various intermediate monoclinic (M) phases that structurally â  bridgeâ   the rhombohedral (R) and tetragonal (T) ones across a morphtropic phase boundary (MPB) have been observed. Systematic investigations of (001) and (110) electric (E) field-temperature phase diagrams of PMN-xPT crystals have demonstrated that the phase stability of PMN-xPT crystals is quite fragile: depending not only on modest changes in E (â ¤ 0.5kV/cm), but also on the direction along which E is applied. Structurally bridging monoclinic Mc or orthorhombic (O) phases were found to be associated with the T phase, whereas the monoclinic Ma or Mb phases bridged the Cubic (C) and R ones. <p> In addition, neutron inelastic scattering was performed on PMN-0.32PT to study the dynamic origin of the MPB. Data were obtained between 100 and 600 K under various E applied along the cubic [001] direction. The lowest frequency zone-center, transverse optic phonon was strongly damped and softened over a wide temperature range, but started to recover on cooling into the T phase at the Curie temperature (TC). Comparisons of my findings with prior ones for PMN and PMN-0.60PT suggest that the temperature dependence and energy scales of the soft mode dynamics in PMN-xPT are independent of PT concentration below the MPB, and that the MPB may be defined in composition space x when TC matches the temperature at which the soft mode frequency begins to recover. High-resolution x-ray studies then showed that the Câ  T phase boundary shifted to higher temperatures under E by an expected amount within the MPB region: suggesting an unusual instability within the apparently cubic phase at the MPB.<p> In Fe-xat.%Ga alloys, the addition of Ga atoms into the b.c.c. Î±-Fe phase also results in diversity of crystal structures and structural inhomogeneity, which are likely the source of its unusual magneto-elastic properties. I have carefully investigated decomposition of Fe-xat.%Ga alloys subjected to different thermal treatments by x-ray and neutron diffraction for 12 < x < 25. Quenching was found to suppress the formation of a DO3 structure in favor of a high-temperature disordered bcc (A2) one. By contrast, annealing produced a two-phase mixture of A2 + DO3 for 14 < x < 20 and a fully DO3 phase for x = 25. A splitting of the (2 0 0) and (0 0 2) Bragg peaks observed along the respective transverse directions indicated that Fe-xat.%Ga â  crystalsâ   are composed of several crystal grain orientations (or texture structures), which are slightly tilted with respect to each other. In order to investigate the local structural distortions and heterogeneities, neutron diffuse scattering was performed on Fe-x%Ga alloys for different thermal conditions. Diffuse scattering around a (100) superlattice reflection was found for 14<x<22 in the furnace-cooled condition, indicative of short-range ordered DO3 nanoprecipitates in an A2 matrix. This diffuse intensity had an asymmetric radial contour and an off-centering. Analysis (x=19) revealed two broad peaks with c/aâ  1.2: indicating that the DO3-like nanoprecipitates are not cubic, but rather of lower symmetry with a large elastic strain. The strongest diffuse scattering was observed for x=19, which correspondingly had maximum magnetostriction: indicating a structural origin for enhanced magnetostriction.",
  "description_provenance": [
    "Author Email: hcao@vt.edu",
    "Advisor Email: yuwang@mse.vt.edu;",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: jiefang@mse.vt.edu;",
    "Advisor Email: viehland@mse.vt.edu;",
    "Made available in DSpace on 2014-03-14T20:14:51Z (GMT). No. of bitstreams: 2 Dissertation2.pdf: 3157922 bytes, checksum: 59120dff94385c197b5716592c3619f5 (MD5) Dissertation1.pdf: 177844 bytes, checksum: 735c42eb3023886ca3455629aad43cc0 (MD5)   Previous issue date: 2008-05-08"
  ],
  "handle": "28549",
  "identifier_other": "etd-08062008-102857",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08062008-102857/",
  "identifier_uri": "http://hdl.handle.net/10919/28549",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation2.pdf",
    "Dissertation1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "x-ray diffraction",
    "neutron inelastic scattering",
    "diffuse scattering",
    "domain engineering",
    "magnetostriction",
    "ferromagnetic",
    "ferroelectric",
    "phase stability",
    "phase transformation",
    "structural inhomogeneity"
  ],
  "title": "Phase transformations in highly electrostrictive and magnetostrictive crystals: structural heterogeneity and history dependent phase stability",
  "type": "Dissertation"
}