{
  "contributor_author": "Hundley, Katrina M.",
  "contributor_committeechair": "Eschenmann, Konrad Kurt",
  "contributor_committeemember": [
    "Stewart, Daisy L.",
    "Covey, Angela E.",
    "Price, William T. Jr.",
    "Anderson, Myron R.",
    "Camp, William G."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:14:48Z",
  "date_adate": "2003-08-19",
  "date_available": "2014-03-14T20:14:48Z",
  "date_issued": "2003-07-25",
  "date_rdate": "2005-08-19",
  "date_sdate": "2003-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purposes of this study were to (a) establish a profile of the current training practices of selected businesses and industries in Southwest Virginia; (b) identify the type of training methods these companies are choosing -- such as traditional classroom training or web-based training programs, and (c) identify how the training methods are selected. This profile established baseline data for current business and industry employee training programs.<p>   The population of this study included every business and industry that had participated in workforce development programs provided by community colleges located in the southwest region of Virginia in 2001 and 2002. The researcher developed an Internet-based survey instrument and solicited data from 205 organizations.<p>  Descriptive analyses were used to organize, summarize, and describe the data collected from all participants; specifically frequencies of responses to individual survey items were reported. Of the 205 organizations surveyed, 88 returned a questionnaire giving an overall response rate of 42.9%.<p>   The results showed that manufacturing was the most represented industry, most participants held a management position, and most worked in the human resources department. The majority of businesses expected some type of increase in their training programs within the next year. Nearly all indicated that they use classroom-based training programs, and a substantial number indicated using videotapes, self-study materials, computer software or CD-ROMS, and web-based training methods. Many of the participants said that they offer training for skill development in the areas of computer applications, technical skills and knowledge, communication skills, and safety procedures. Lastly, cost, flexibility, perceived value, and timeliness of the program were criteria rated as most influential in the decision to use a particular training method.",
  "description_provenance": [
    "Author Email: khundley@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: nrcovea@nr.edu",
    "Advisor Email: wprice@vt.edu",
    "Advisor Email: myron@vt.edu",
    "Advisor Email: wgc4@cornell.edu",
    "Advisor Email: eschmann@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:48Z (GMT). No. of bitstreams: 2 hundley-dissertation.pdf: 722994 bytes, checksum: 807680195a7edc6a0f677097de6996f0 (MD5) hundley-vitae.pdf: 111740 bytes, checksum: c39095d5b6075bcdb33a4722c90b213e (MD5)   Previous issue date: 2003-07-25"
  ],
  "handle": "28542",
  "identifier_other": "etd-08062003-121214",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08062003-121214/",
  "identifier_uri": "http://hdl.handle.net/10919/28542",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "hundley-dissertation.pdf",
    "hundley-vitae.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "workforce development",
    "training",
    "Southwest Virginia",
    "employee training"
  ],
  "title": "A Profile of Current Employee Training Practices in Selected Businesses and Industries in Southwest Virginia",
  "type": "Dissertation"
}