{
  "contributor_author": "Berry, Sarah Dianne Knowles",
  "contributor_committeechair": "Akers, Robert Michael",
  "contributor_committeemember": [
    "McFadden, T. B.",
    "Wong, Eric A.",
    "Pearson, Ronald E.",
    "Howard, Rick Dale"
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:14:48Z",
  "date_adate": "2002-08-28",
  "date_available": "2014-03-14T20:14:48Z",
  "date_issued": "2002-08-02",
  "date_rdate": "2003-08-28",
  "date_sdate": "2002-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The overall objective of this project was to investigate the role of locally derived growth factors and extracellular matrix proteins in regulating prepubertal heifer mammary development.  In the first experiment, short-term treatment of heifers with GH or E increased proliferation of mammary epithelial cells.  Coinciding with increased epithelial cell proliferation, IGF-I protein increased and IGFBP-3 protein decreased within mammary tissues.  Thus, proliferation was associated with an apparent net increase in the biological availability of IGF-I within the mammary gland.  In the second experiment, decreased mammary development and epithelial cell proliferation in response to ovariectomy coincided with decreased mammary expression of IGF-I mRNA and decreased binding of IGF-I to mammary microsomes.  Taken together, these results imply an important role for locally derived IGF-I in regulating heifer mammary development.  However, in contrast to our hypothesis, IGF-I mRNA did not differ between cleared or intact mammary fat pad, suggesting that expression of IGF-I mRNA is not regulated by epithelial:stromal interactions.  Neither ovariectomy or epithelial:stromal interactions influenced the mRNA expression of IGFBP-3 or IGFBP-5 within mammary tissues.  Ovariectomy increased the proportion of ERa positive mammary epithelial cells.  In contrast, GH administration to prepubertal heifers did not influence the proportion of ERa-positive epithelial cells. Interestingly, mammary development was more severely affected in heifers ovariectomized before six weeks of age than heifers ovariectomized at three months of age, implying a critical period of ovarian stimulation during the first six weeks of age.  Localization of laminin, fibronectin, and collagen in mammary parenchyma suggested specific roles for extracellular matrix proteins in regulating mammary development and ductal morphogenesis.  Laminin was decreased and fibronectin was increased by ovariectomy, suggesting a possible role for interactions between the ovary and extracellular matrix proteins within the heifer mammary gland.  Finally, the mitogenic capacities of mammary tissue extracts from control and ovariectomized heifers did not differ in their ability to stimulate in vitro proliferation of MAC-T cells.  In conclusion, the overall results support the hypothesis that locally derived IGF-I regulates prepubertal heifer mammary development.  However, ERa expression and extracellular matrix proteins also appear to be important regulators of heifer mammary development.",
  "description_provenance": [
    "Author Email: saberry@vt.edu",
    "Advisor Email: tmcfadde@zoo.uvm.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: rep@vt.edu",
    "Advisor Email: rihoward@vt.edu",
    "Advisor Email: rma@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:48Z (GMT). No. of bitstreams: 1 SDKB.pdf: 2615621 bytes, checksum: 0b543aa36e05a0318e5ca389352b4987 (MD5)   Previous issue date: 2002-08-02"
  ],
  "handle": "28541",
  "identifier_other": "etd-08062002-133454",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08062002-133454/",
  "identifier_uri": "http://hdl.handle.net/10919/28541",
  "publisher": "Virginia Tech",
  "relation_haspart": "SDKB.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "IGF-I",
    "extracellular matrix",
    "growth hormone",
    "heifer",
    "estrogen",
    "mammary"
  ],
  "title": "Growth Factor and Extracellular Matrix Regulation of Heifer Mammary Development",
  "type": "Dissertation"
}