{
  "contributor_author": "Lee, Doohwan",
  "contributor_committeechair": "Oyama, Shigeo Ted",
  "contributor_committeemember": [
    "Cox, David F.",
    "Marand, Eva",
    "Morris, John R.",
    "Davis, Richey M."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:14:48Z",
  "date_adate": "2003-08-14",
  "date_available": "2014-03-14T20:14:48Z",
  "date_issued": "2003-05-09",
  "date_rdate": "2004-08-14",
  "date_sdate": "2003-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this work the synthesis, characterization, and gas transport properties of hydrogen selective silica membranes were studied along with the catalytic reforming of CH4 with CO2 (CH4 + CO z 2 CO + 2 H2) in a hydrogen separation membrane reactor.  The silica membranes were prepared by chemical vapor deposition (CVD) of a thin SiO2 layer on porous supports (Vycor glass and alumina) using thermal decomposition of tetraethylorthosilicate (TEOS) in an inert atmosphere.  These membranes displayed high hydrogen permeances (10-8 - 10-7 mol m-2 s-1 Pa-1) and excellent H2 selectivities (above 99.9 %) over other gases (CH4, CO, and CO2).  The membranes were characterized using Scanning Electron Microscopy and Atomic Force Microscopy, and the mechanism of gas transport was studied applying existing theories with a newly developed treatment.   The catalytic reforming of CH4 with CO2 was carried out in a membrane reactor installed with a hydrogen separation ceramic membrane.  The reaction was conducted at various pressures (1 - 20 atm) and temperatures (873 K and 923 K) at non-equilibrium conditions, and the results were compared with those obtained in a packed bed reactor in order to evaluate performance of the membrane reactor for the reaction.  It was found that concurrent and selective removal of hydrogen from the reaction in the membrane reactor resulted in considerable enhancements in the yields of the reaction products, H2 and CO.  The enhancements in the product yields in the membrane reactor increased with pressure showing a maximum at 5 atm, and then decreased at higher pressures.  This was due to a trade-off between a thermodynamic quantity (hydrogen production by the reaction) and transport property (hydrogen separation through the membrane).  It was also found that the reverse water-gas shift (RWGS) reaction occurred simultaneously with the reforming reaction giving the detrimental effect on the reaction system by reducing the amount of hydrogen production in favor of water.  This was particularly significant at high pressures.",
  "description_provenance": [
    "Author Email: dolee5@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Advisor Email: emarand@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: oyama@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:48Z (GMT). No. of bitstreams: 8 chpt5-2.pdf: 312561 bytes, checksum: 40145537e33cef3a205187de997716e7 (MD5) chpt3-2.pdf: 313530 bytes, checksum: e10aa49f0296b01d4b43b4a9f64b9174 (MD5) chpt1-2.pdf: 132211 bytes, checksum: 88c06a7b92c2262ac93cd36b84d4e822 (MD5) chpt4-2.pdf: 1062374 bytes, checksum: c0261e58734098ecdbc28ee104abe767 (MD5) VITA.pdf: 51657 bytes, checksum: e39ac974a220b0852c3e4c1d12f5c4ad (MD5) abstract&list-2.pdf: 95376 bytes, checksum: 7a16526a817ef093f3a3b1615eecd616 (MD5) chpt6-2.pdf: 60577 bytes, checksum: 8744b2579d14446586bc202d148cb711 (MD5) chpt2-2.pdf: 582693 bytes, checksum: b8440b9d094ec70e3a9a508d2752ee07 (MD5)   Previous issue date: 2003-05-09"
  ],
  "handle": "28543",
  "identifier_other": "etd-08062003-145234",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08062003-145234/",
  "identifier_uri": "http://hdl.handle.net/10919/28543",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chpt5-2.pdf",
    "chpt3-2.pdf",
    "chpt1-2.pdf",
    "chpt4-2.pdf",
    "VITA.pdf",
    "abstract&list-2.pdf",
    "chpt6-2.pdf",
    "chpt2-2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Dry reforming",
    "Permeation Mechanism",
    "Silica Membrane",
    "Membrane Reactor"
  ],
  "title": "Studies on Hydrogen Selective Silica Membranes and the Catalytic Reforming of CH₄ with CO₂ in a Membrane Reactor",
  "type": "Dissertation"
}