{
  "contributor_author": "Naha, Sayangdev",
  "contributor_committeechair": "Puri, Ishwar K.",
  "contributor_committeemember": [
    "Lesko, John J.",
    "Mahajan, Roop L.",
    "Patil, Mayuresh J.",
    "Cramer, Mark S.",
    "Hajj, Muhammad R."
  ],
  "contributor_department": "Engineering Science and Mechanics",
  "date_accessioned": "2014-03-14T20:14:52Z",
  "date_adate": "2008-08-26",
  "date_available": "2014-03-14T20:14:52Z",
  "date_issued": "2008-07-25",
  "date_rdate": "2008-08-26",
  "date_sdate": "2008-08-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Flame synthesis is recognized as a much cheaper and higher throughput process for carbon nanotube/nanofiber (CNT/CNF) production compared to conventional catalytic processes like chemical vapor deposition (CVD). Nanostructured carbon materials, such as carbon nanotubes and nanofibers, exhibit superhydrophobic behavior over a range of pH values, including for corrosive liquids. Part of this research reports the development of a rapid on-demand process for the synthesis of superhydrophobic surfaces on silicon (Si) discs using an ethylene-air nonpremixed flame. Such superhydrophobic behavior, combined with increase in effective surface area due to carbon nanostructure (CNS) deposition and corresponding desirable size (nanoscale roughness) attract the growth and attachment of microbial colonies to these CNS-enhanced substrates. This has potentially high-impact application in microbial fuel cells (MiFCs) whereby stainless steel (SS) meshes coated with flame-deposited CNS are used as anodes and the electrons produced by attaching biofilms can generate electricity in a fuel cell. However, despite such and many other applications and promise of carbon nanotubes (CNTs), their production is generally based on empirical principles. There are only a few CNT formation models that predict the dependence of CNT growth on various synthesis parameters. Typically, these do not incorporate a detailed mechanistic consideration of the various processes that are involved during CNT synthesis. Herein, this need is addressed and a model is presented for catalytic CNT growth that integrates various interdependent physical and chemical mechanisms involved in CNT production. It is validated by comparing its predictions with experimental measurements for CVD synthesis of CNTs and a concise parametric study is presented. The results are extrapolated for flame synthesis that is recognized as a desirable cost-effective process for the bulk synthesis of CNTs, as already mentioned. The last part of this dissertation discusses an extension of the CNT growth model to silicon nanowire/nanowhisker (SiNW) synthesis. SiNWs are  synthesized by a number of methods â   catalysis by a metal  (involving vapor-liquid-solid or VLS growth mode), molecular beam  epitaxy, thermal evaporation and laser ablation to name a few. Our model pertains to metal-catalyzed VLS growth mode.",
  "description_provenance": [
    "Author Email: sayan@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: mahajanr@vt.edu",
    "Advisor Email: mpatil@vt.edu",
    "Advisor Email: macramer@vt.edu",
    "Advisor Email: mhajj@vt.edu",
    "Advisor Email: ikpuri@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:52Z (GMT). No. of bitstreams: 1 Thesis_Naha_ETD.pdf: 7878054 bytes, checksum: 84c41a50c5b7146a8cf946338bcf22d8 (MD5)   Previous issue date: 2008-07-25"
  ],
  "handle": "28559",
  "identifier_other": "etd-08072008-105548",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08072008-105548/",
  "identifier_uri": "http://hdl.handle.net/10919/28559",
  "publisher": "Virginia Tech",
  "relation_haspart": "Thesis_Naha_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "carbon nanofibers",
    "catalysis",
    "nanotechnology",
    "flame synthesis",
    "silicon nanowires",
    "superhydrophobicity",
    "Carbon nanotubes"
  ],
  "title": "Growth Model, Synthesis of Carbon Nanostructures and Alteration of Surface Properties Using Them",
  "type": "Dissertation"
}