{
  "contributor_author": "Gao, Tian",
  "contributor_committeechair": "Moen, Cristopher D.",
  "contributor_committeemember": [
    "Easterling, William Samuel",
    "Cousins, Thomas E.",
    "Wright, William J."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:14:51Z",
  "date_adate": "2012-08-15",
  "date_available": "2014-03-14T20:14:51Z",
  "date_issued": "2012-08-03",
  "date_rdate": "2012-08-15",
  "date_sdate": "2012-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The design of metal building roof and wall systems under uplift and suction wind loading is complicated because the laterally unbraced purlin and girtâ  s free flange is compressed, and the cross-section rotates due to the shear flow. The objective of this thesis is to introduce a Direct Strength Method (DSM) prediction approach for simple span purlins and girts with one flange through-fastened under uplift or suction loading. This prediction method is also applicable for the case when rigid board insulation is placed between the metal panel and through-fastened flange. The prediction method is validated with a database of 62 simple span tests. To evaluate the prediction for the case when rigid board is used, 50 full-scale tests with rigid board insulation are conducted by the author of this thesis. In the experimental study panel failure, connection failure and member (purlin and girt) failure are observed, and they all limit the systemâ  s capacity. Another important contribution of this thesis is that it builds the foundation for future study of a general, mechanics-based limit state design approach for metal building roof and wall systems that can accommodate uplift and gravity loads, simple and continuous spans, and through-fastened and standing seam roofs.",
  "description_provenance": [
    "Author Email: gaot@vt.edu",
    "Advisor Email: cmoen@vt.edu",
    "Advisor Email: seaster@exchange.vt.edu",
    "Advisor Email: tcousins@vt.edu",
    "Advisor Email: wjwright@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:51Z (GMT). No. of bitstreams: 1 Gao_T_D_2012.pdf: 2924829 bytes, checksum: 62d0bc0f057f2635abd21b472d974c74 (MD5)   Previous issue date: 2012-08-03"
  ],
  "handle": "28553",
  "identifier_other": "etd-08062012-125026",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08062012-125026/",
  "identifier_uri": "http://hdl.handle.net/10919/28553",
  "publisher": "Virginia Tech",
  "relation_haspart": "Gao_T_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Through-Fastened",
    "Metal Building",
    "Purlin",
    "Uplift Loading",
    "Rigid Insulation"
  ],
  "title": "Direct Strength Method for the Flexural Design of Through-Fastened Metal Building Roof and Wall Systems under Wind Uplift or Suction",
  "type": "Dissertation"
}