{
  "contributor_author": "Ho, Wai  Hong",
  "contributor_committeechair": "Haller, Hans H.",
  "contributor_committeemember": [
    "Lutz, Nancy A.",
    "Stegeman, Mark",
    "Kats, Amoz",
    "Snyder, Susan K."
  ],
  "contributor_department": "Economics (Arts and Sciences)",
  "date_accessioned": "2014-03-14T20:14:51Z",
  "date_adate": "1999-08-14",
  "date_available": "2014-03-14T20:14:51Z",
  "date_issued": "1999-05-25",
  "date_rdate": "2000-08-14",
  "date_sdate": "1999-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This collection of papers originates from my  interest in the reform efforts in transitional economies. Each of the chapters is self-contained.  Chapter one presents a brief literature survey of those schools of thought that have contributed  to our knowledge about privatization.  In chapter two, a public firm model and a private firm model are compared based on agency approach,  assuming that the owner of a firm has cost information but also bears the cost of production. I find that the question which type of ownership,  private or public, is superior does not have a clear  cut answer. Private ownership may induce higher work effort but suffers from a discrepancy of  private and social goals. While production  distortion is less serious, an obvious disincentive to work exists in the public firm.  Chapter three examines how privatization can be  considered as a threat to stimulate a public firm manager's work incentive when his effort level cannot  be observed by the government. I find that, in the case when commitment to privatize is impossible, the government will set a strictly positive wage rate and a strictly positive investment subsidy to signal the government's  determination to implement the privatization policy.  In chapter four, I examine the role that public investment plays in a financial market with a credit rationing problem.  Two kinds of borrowers co-exist in the economy, namely the public and the private. Public borrowers enjoy a \"first mover\" advantage to borrow money from banks.  In this situation, the credit rationing is found escalating. But since the success of a public project (owned by a public  borrower) can exert positive externality on the productivity  of private projects, the adverse effect induced by credit rationing  can be alleviated. We show that if the quality of the public  projects is good enough, the economic growth rate can be higher than the case without public projects in the economy.",
  "description_provenance": [
    "Author Email: who@vt.edu",
    "Advisor Email: nlutz@vt.edu",
    "Advisor Email: stegeman@vt.edu",
    "Advisor Email: amoz@vt.edu",
    "Advisor Email: sksnyder@vt.edu",
    "Advisor Email: haller@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:51Z (GMT). No. of bitstreams: 6 CHAPTER1.PDF: 58900 bytes, checksum: d906ea16be4c60743df02cf0a395b85e (MD5) CHAPTER2.PDF: 85422 bytes, checksum: 14117ca62918de88417b45e9736688f1 (MD5) CHAPTER3.PDF: 83097 bytes, checksum: 9983fddc249fe6677c56e93a9d4edba1 (MD5) CHAPTER4.PDF: 81740 bytes, checksum: 7358f447194bf964b2171b4ba18e6f24 (MD5) ETD.PDF: 16041 bytes, checksum: 4106e36e3a2433c986207aa37d647213 (MD5) VITA.PDF: 6182 bytes, checksum: 62224c34a4a6ac7e1226bba5ba173935 (MD5)   Previous issue date: 1999-05-25"
  ],
  "handle": "28554",
  "identifier_other": "etd-080699-132138",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-080699-132138/",
  "identifier_uri": "http://hdl.handle.net/10919/28554",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAPTER1.PDF",
    "CHAPTER2.PDF",
    "CHAPTER3.PDF",
    "CHAPTER4.PDF",
    "ETD.PDF",
    "VITA.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Privatization",
    "Principal-agent",
    "Credit Rationing",
    "Commitment",
    "Economic Growth"
  ],
  "title": "Economc Analysis of Privatization",
  "type": "Dissertation"
}