{
  "contributor_author": "Gratias, Melissa B.",
  "contributor_committeechair": "Foti, Roseanne J.",
  "contributor_committeemember": [
    "Cooper, Robin K. Panneton",
    "Hauenstein, Neil M. A.",
    "Singh, Kusum",
    "Donovan, John J."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:14:51Z",
  "date_adate": "2000-08-09",
  "date_available": "2014-03-14T20:14:51Z",
  "date_issued": "2000-07-10",
  "date_rdate": "2001-08-09",
  "date_sdate": "2000-08-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>In the current study, a person-centered approach was taken to the examination of the relation between leader effectiveness and personality preferences.  Type Theory and Adaption-Innovation Theory precepts were examined in tandem using cluster analytic techniques in order to discover whether past variable-centered findings relating these two theories would generalize to a person-centered examination.  Eight patterns were hypothesized to emerge from the cluster analysis based on past correlational research, and three of these patterns were present in the seven-cluster solution.</p><p> Leader effectiveness was measured in terms of multisource ratings on Benchmarks&#8482;.  Hypotheses were proposed based on past variable-centered research examining the relations between Jungian personality types and self, superior, peer, and subordinate ratings of leader effectiveness.  Some support was found for the variable-centered predictions, but the pattern-focused approach provided insight into the dynamics of the five personality preferences examined as well as suggested that indicators other than what would be predicted based on variable-centered studies may contribute to perceptions of leader effectiveness.  Overall, the results of this study show that, taken together, variable and person-centered approaches to research may help strengthen the sometimes fragile relationship between personality and leader effectiveness.  </p>",
  "description_provenance": [
    "Author Email: mgratias@alumni.wfu.edu",
    "Advisor Email: rpcooper@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: rfoti@mail.vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: donovan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:51Z (GMT). No. of bitstreams: 1 etd.pdf: 400689 bytes, checksum: db3f2144e6309745ecde6012234017ca (MD5)   Previous issue date: 2000-07-10"
  ],
  "handle": "28555",
  "identifier_other": "etd-08072000-14030039",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08072000-14030039/",
  "identifier_uri": "http://hdl.handle.net/10919/28555",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Psychological Type",
    "Creative Style",
    "Leadership Effectiveness",
    "Patterns"
  ],
  "title": "Leader Effectiveness among Patterns of  Personality Types and Creativity Styles",
  "type": "Dissertation"
}