{
  "contributor_author": "McCoy, Andrew Patton",
  "contributor_committeechair": "Thabet, Walid",
  "contributor_committeemember": [
    "Beliveau, Yvan J.",
    "Badinelli, Ralph D.",
    "Koebel, Charles Theodore",
    "O'Brien, Michael J."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:14:51Z",
  "date_adate": "2008-09-09",
  "date_available": "2014-03-14T20:14:51Z",
  "date_issued": "2008-07-25",
  "date_rdate": "2009-09-09",
  "date_sdate": "2008-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This work presents the development of a new framework for the commercialization of innovative products in the residential construction industry.  It is the aim of this work to identify commercialization decisions, actions, risks, barriers and accelerators specific to the residential construction industry market that will increase the acceptance of product innovations for those developing them. Commercialization is broadly defined as the process of developing a business enterprise from an idea, through feasibility and implementation, to its acceptance into a market (USDOE 1999, Goldsmith 2003).  Commercialization frameworks describe the concurrent decisions and actions along the innovation development process, optimizing all of the technical and business decisions required for a successful introduction to the marketplace.  Successful commercialization frameworks serve as a form of development plan, promoting solutions to questions and problems that arise along the development path.   This research derives such a framework for the commercialization of innovative products and makes it specific to residential construction through the following tasks:    1.\tUnderstanding standard terminology: defining innovation and commercialization as they relate to this work. 2.\tCreating a lens for the unique nature of commercialization in this industry: deriving a commercialization framework (matrix) from the research literature in business, construction, and concurrent engineering, capable of accepting later alterations. 3.\tUnderstanding the manufacturerâ  s role and risks: conducting case study interviews for fifteen innovative residential construction products that specify important tasks, risks and benefits for commercialization. 4.\tUnderstanding the role, risks and benefits of builders, as users of innovation: comparing case studies and workshop surveys of many residential construction industry players that focus on the builder to establish parameters for the innovation commercialization matrix. 5.\tLinking both manufacturer and builder: comparing manufacturer commercialization best-practices with builder adoption patterns for innovative products over time.",
  "description_provenance": [
    "Author Email: apmccoy@vt.edu",
    "Advisor Email: yvan@vt.edu",
    "Advisor Email: ralphb@vt.edu",
    "Advisor Email: thabet@vt.edu",
    "Advisor Email: tkoebel@vt.edu",
    "Advisor Email: mjobrien@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:51Z (GMT). No. of bitstreams: 4 RICSCopyrightPermission.pdf: 26148 bytes, checksum: 3dc7c3a96267b865a8f5f26194af619e (MD5) T&FCopyrightPermission.pdf: 56497 bytes, checksum: 5871ebfa7db2a6b5f721a88bf737f699 (MD5) APMPhDFinal082308.pdf: 1492344 bytes, checksum: aba9d163ebe1f48b9d4bef235bcb4969 (MD5) EmeraldCopyrightPermission.pdf: 42907 bytes, checksum: 751863526e44ea2256ec9f96b4baee45 (MD5)   Previous issue date: 2008-07-25"
  ],
  "handle": "28550",
  "identifier_other": "etd-08062008-184749",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08062008-184749/",
  "identifier_uri": "http://hdl.handle.net/10919/28550",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "RICSCopyrightPermission.pdf",
    "T&FCopyrightPermission.pdf",
    "APMPhDFinal082308.pdf",
    "EmeraldCopyrightPermission.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Residential Construction",
    "Commercialization",
    "Innovation"
  ],
  "title": "Commercialization for Innovative Products in the Residential Construction Industry",
  "type": "Dissertation"
}