{
  "contributor_author": "Thor, Craig Phillip",
  "contributor_committeechair": "Hampton C. Gabler",
  "contributor_committeemember": [
    "Gunnar Brolinson",
    "Stefan Duma",
    "Warren Hardy",
    "Joel Stitzel"
  ],
  "contributor_department": "Biomedical Engineering",
  "date_accessioned": "2014-03-14T20:14:51Z",
  "date_adate": "2010-08-26",
  "date_available": "2014-03-14T20:14:51Z",
  "date_issued": "2010-08-02",
  "date_rdate": "2013-05-21",
  "date_sdate": "2010-08-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This thesis has evaluated the effectiveness of GDL programs both in New Jersey and across the United States using several metrics. The New Jersey GDL program was analyzed because it is considered one of the most stringent programs in the country. It was found that GDL indeed reduces the per capita rate of crashes for teen drivers in New Jersey. However, no statistical difference was seen in the rate of fatalities in teen driver crashes. The per capita rate of violations for 16 and 17 year old drivers was lower after GDL, but the rate of point-carrying violations increased for 19 and 20 year old drivers who were licensed under GDL. The September, 2008 directive by the New Jersey Attorney General banning plea-agreements for teens significantly reduced the rate of violations further for 16 and 17 year old GDL drivers. The factors that led to teen crashes did not change in the United States after GDL. Teen drivers are still prone to distractions and inappropriate behavior while driving. Teen drivers also have higher rates of control loss and road departure crashes when compared to adults. Finally, it was found changes in the number teen driver crashes and fatalities are associated with similar changes in travel exposure. Teen crashes and fatalities have dropped with the implementation of GDL but teen VMT has also dropped. Graduated driverâ  s licensing did not change the reasons for teen driver crashes. Also, it is likely that any reductions in the number of teen crashes or fatalities are associated with reductions in exposure and not changes in teen driver behavior.",
  "description_provenance": [
    "Author Email: cthor@vt.edu",
    "Advisor Email: pbrolins@vt.edu",
    "Advisor Email: gabler@vt.edu",
    "Advisor Email: duma@vt.edu",
    "Advisor Email: whardy@vt.edu",
    "Advisor Email: jstitzel@wfubmc.edu",
    "Made available in DSpace on 2014-03-14T20:14:51Z (GMT). No. of bitstreams: 1 Thor_CP_D_2010_Edited_v2.pdf: 1621654 bytes, checksum: f90bacafc403dca1d1c2898f787e89bf (MD5)   Previous issue date: 2010-08-02"
  ],
  "handle": "28551",
  "identifier_other": "etd-08062010-093442",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08062010-093442/",
  "identifier_uri": "http://hdl.handle.net/10919/28551",
  "publisher": "Virginia Tech",
  "relation_haspart": "Thor_CP_D_2010_Edited_v2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Exposure",
    "Violations",
    "Crash Risk",
    "Effectiveness",
    "Graduated Drivers Licensing"
  ],
  "title": "The Effectiveness of Graduated Driver Licensing in the United States",
  "type": "Dissertation"
}