{
  "contributor_author": "Ridgwell, Diana M.",
  "contributor_committeechair": "Creamer, Elizabeth G.",
  "contributor_committeemember": [
    "Turrentine, Cathryn G.",
    "Spencer, Edward F. D.",
    "Collins, Denise",
    "Creamer, Donald G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:14:52Z",
  "date_adate": "2002-09-10",
  "date_available": "2014-03-14T20:14:52Z",
  "date_issued": "2002-07-22",
  "date_rdate": "2003-09-10",
  "date_sdate": "2002-08-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Perceived Impact of Institutional Culture on Advanced Degree Aspirations of Students Attending Two Southern Women's Colleges                  Diana Ridgwell                   (ABSTRACT)  \tWomen's college culture has been found to have qualities that promote the success of the women who graduate from these institutions. This research sought to identify aspects of women's college culture that students perceive as having impacted their aspirations for an advanced degree.  \tFifty-eight women at two southern women's colleges were interviewed.  The participants were members of each college's senior class and had spent their entire undergraduate years at the same institution. After an email solicitation was sent to all members of the senior class, participants were accepted until there were eight women in each of the three categories. These three categories; Keepers, Droppers, and Aspirers; were developed in order to study participant perceptions by whether they maintained or dropped their previous educational aspirations or had developed new aspirations for an advanced degree while attending a women's college. The interviews were completed over a two-month period with each interview lasting from 45 to 60 minutes.  Participants were asked about the importance of aspects of women's college culture on their aspirations for an advanced degree as well as other factors that they perceived as having influenced their decision whether or not to pursue an advanced degree.   \tThe majority of the White women in this study confirmed the positive impacts of women's college culture including high academic expectations, a mission and history that supports women, more female role models, a caring, supportive environment, and an abundance of opportunities for involvement and to learn about oneself.  In addition, participants confirmed the importance of peer relationships and romantic relationships on their educational aspirations.  \tSome women, however, perceived these same factors as having a negative impact on their degree aspirations.  These negative impacts included the Bubble effect, in which women felt that the women's college experience had sheltered them from the realities of the world outside of their present environment, the Burn-Out effect from over involvement in extra-curricular and academic activities, and confusion over field of study interest due to the many opportunities to learn about oneself offered by a liberal arts curriculum.   \tOther findings indicate that despite the supportive environment of women's colleges, women's college students still perceive romantic relationships as negatively impacting their or their friend's aspirations for an advanced degree.  In addition, the need to be taken seriously, whether their families are supportive of further education, and how well informed they are about financial aid issues, all were reported to impact educational aspirations. Unexpectedly, male role models were found to have a positive impact on women's aspirations despite the many female role models at women's colleges. \tThe African American women college students in this study reported their experiences of attending a women's college much differently than did the White women.  Although they felt they had received a quality education, the African American women were dissatisfied with the lack of representation of the African American culture at the women's college they attended. They felt the women's college culture had negatively impacted their aspirations for an advanced degree because of the lack of representation of African American culture in the women's college environment.  Almost all African American women in this study dropped their previous aspirations for an advanced degree because of the discouraging effect of the overwhelmingly White culture of the colleges they attended. \tOverall, this study found that college culture was perceived to have a clear positive impact for one group of students, no significant impact for another, and a negative impact for the third group of students. In addition, based on the perceptions of the students and the researcher's limited observations, the two colleges were found to have institutional cultures that differentiate themselves from each other.  This finding challenges previous researchers' assumptions that all women's colleges share a single culture. \tThis study adds to previous literature about women's college culture and aspirations for an advanced degree in a number of important ways.  Key findings include the identification of negative, as well as positive, impacts of women's college culture for some women, the importance of male role models for women's college students, and the dissatisfaction of the African American women in the study with their experience at a woman's college.",
  "description_provenance": [
    "Author Email: dridgwel@vt.edu",
    "Advisor Email: turc@vt.edu",
    "Advisor Email: spencere@vt.edu",
    "Advisor Email: creamere@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:52Z (GMT). No. of bitstreams: 1 Dissertationdmr3.1.pdf: 815211 bytes, checksum: 24036f8b621e8009eed72dd0ad6acd43 (MD5)   Previous issue date: 2002-07-22"
  ],
  "handle": "28557",
  "identifier_other": "etd-08072002-113455",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08072002-113455/",
  "identifier_uri": "http://hdl.handle.net/10919/28557",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertationdmr3.1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "institutional culture",
    "women's colleges",
    "women's education",
    "higher education"
  ],
  "title": "Perceived Impact of Institutional Culture on Advanced Degree Aspirations of Students Attending Two Southern Women's Colleges",
  "type": "Dissertation"
}