{
  "contributor_author": "McLeod, Mark Alexander",
  "contributor_committeecochair": [
    "Lutz, Nancy A.",
    "Eckel, Catherine C."
  ],
  "contributor_committeemember": [
    "Spanos, Aris",
    "Ball, Sheryl B.",
    "Ashley, Richard A."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:14:52Z",
  "date_adate": "2003-08-21",
  "date_available": "2014-03-14T20:14:52Z",
  "date_issued": "2003-07-14",
  "date_rdate": "2006-08-21",
  "date_sdate": "2003-08-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "My dissertation contains two separate components.  One part is a theoretical examination of the effect of ownership structure on format choice in the radio industry.  I use a Hotelling type location model to study the effects of mergers in the radio industry.  I find that common ownership of two radio stations results in format choices that are more similar than under competitive ownership, and also that the stations will advertise more if they are operated under common ownership.  Welfare results are ambiguous, but there is evidence that total welfare might decrease as the result of a merger, with obvious policy implications for the Federal Trade Commission and the Antitrust Division of the Department of Justice who evaluate and regulate mergers in all industries.   The second component is an empirical study designed to assess the effectiveness of a mathematical tutorial that I authored in conjunction with colleagues in the Math department here at Virginia Tech.  I taught four large sections of Principles of Macroeconomics in the spring and fall of 2001.  Each class met on MWF; two sections at 8 AM, one at 10:10 AM, and one at 1:25 PM.  I required one of the sections (8 AM Spring) to review the module and take a proficiency quiz to demonstrate their skill level in basic math that is used in the Economics Principles course. Final average in the course is the dependant variable in a regression designed to discover which variables have explanatory power in determining performance in introductory economics.  Besides exposure to the math module, I include other independent variables describing class time, semester, demographics and effort.  In addition, I collected qualitative information about the students' perceptions of the module's effectiveness and administration.   I find that exposure to the Math module does not have a significant effect on performance in the course. However, within the treatment group, there is a positive significant effect of time spent using the module on performance.  Also, being registered for an 8 AM section has a significant negative effect. Overall, student comments indicate a dislike for the module. Students report that they prefer learning math skills through lectures by the professor and use of textbooks.",
  "description_provenance": [
    "Author Email: markmc@vt.edu",
    "Advisor Email: aris@vt.edu",
    "Advisor Email: nlutz@vt.edu",
    "Advisor Email: sball@vt.edu",
    "Advisor Email: ashleyr@vt.edu",
    "Advisor Email: eckelc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:52Z (GMT). No. of bitstreams: 2 Vita.pdf: 84507 bytes, checksum: e9e9a9c3ed8f563eca2aa2079e5d4330 (MD5) Dissertation.pdf: 707333 bytes, checksum: 8bbf35b44f0ae662cf34f1b297354250 (MD5)   Previous issue date: 2003-07-14"
  ],
  "handle": "28558",
  "identifier_other": "etd-08072003-172643",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08072003-172643/",
  "identifier_uri": "http://hdl.handle.net/10919/28558",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Vita.pdf",
    "Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "program choice",
    "principles",
    "advertiser supported markets",
    "radio",
    "instructional technology",
    "teaching"
  ],
  "title": "Essays in Educational Economics and Industry Structure",
  "type": "Dissertation"
}