{
  "contributor_author": "Lucas, Jason David",
  "contributor_committeecochair": [
    "Bulbul, Tanyel",
    "Thabet, Walid"
  ],
  "contributor_committeemember": [
    "McCoy, Andrew P.",
    "Anumba, Chimay"
  ],
  "contributor_department": "Building Construction",
  "date_accessioned": "2014-03-14T20:14:53Z",
  "date_adate": "2012-08-23",
  "date_available": "2014-03-14T20:14:53Z",
  "date_issued": "2012-08-07",
  "date_rdate": "2012-08-23",
  "date_sdate": "2012-08-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The quality of healthcare environments has been linked to patient safety, patient and staff stress, clinical output, and patient outcome.  As part of maintaining the physical environment within the healthcare settings facility managers need to ensure that complex systems are working properly.  Facility management tasks need to be completed with minimal interference with clinical services.  This is often difficult to do because facility information is often stored in multiple systems and may be inadequate and incomplete.  Communication and exchange of information throughout the lifecycle and throughout the operational phase of the building is fragmented.  Relevant information and effective facility information management are important for efficient operation and maintenance of the facility.  It is even more important when systems are being constantly upgraded and renovated due to new technologies and for the need for facility managers to do more work with fewer resources. This research is examining the link between facility management and clinical activities, especially in terms of information exchange and management.  A framework is proposed to help facility managers more efficiently manage healthcare facility information.  Case analysis was completed on facility related patient safety events to determine the types of information needed and exchanged through the eventâ  s response by facility personnel.  The information was then organized into a product model and ontology to help capture, manage, and retrieve the information.  The goal of the research is to offer a method of storing healthcare facility information in an efficient and effective manner to support facility managers in their response to patient safety events.   This dissertation outlines the objectives of this research and the methodologies used in the case analysis.  The development of the product model and information exchanges identified is also discussed.  Lastly, conceptual model for a prototype was developed and is presented to demonstrate how the product model and ontology can be used to allow the user to query information and interact with the system.",
  "description_provenance": [
    "Author Email: jlucas06@vt.edu",
    "Advisor Email: tanyel@vt.edu",
    "Advisor Email: thabet@vt.edu",
    "Advisor Email: apmccoy@vt.edu",
    "Advisor Email: anumba@engr.psu.edu",
    "Made available in DSpace on 2014-03-14T20:14:53Z (GMT). No. of bitstreams: 1 Lucas_JD_D_2012.pdf: 8303394 bytes, checksum: 8edad945067bf39332d42ee00275545a (MD5)   Previous issue date: 2012-08-07"
  ],
  "handle": "28564",
  "identifier_other": "etd-08072012-155247",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08072012-155247/",
  "identifier_uri": "http://hdl.handle.net/10919/28564",
  "publisher": "Virginia Tech",
  "relation_haspart": "Lucas_JD_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Information Management",
    "Facility Lifecycle",
    "Facility Management",
    "Building Information Modeling",
    "Healthcare Environments"
  ],
  "title": "An Integrated BIM Framework to Support Facility Management in Healthcare Environments",
  "type": "Dissertation"
}