{
  "contributor_author": "Park, Logan O.",
  "contributor_committeecochair": [
    "Marion, Jeffrey L.",
    "Lawson, Steven R."
  ],
  "contributor_committeemember": [
    "Aust, Wallace Michael",
    "Stern, Marc J.",
    "Pasupathy, Raghu"
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:14:52Z",
  "date_adate": "2009-08-07",
  "date_available": "2014-03-14T20:14:52Z",
  "date_issued": "2009-08-03",
  "date_rdate": "2012-06-22",
  "date_sdate": "2009-08-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The issues and concerns facing recreation managers, academicians, and other practitioners are now often complex and important enough that solving them requires more than the sum of parts from social and physical disciplines.  To that end, this dissertation document identifies and addresses three research projects that in varying proportions draw from the social and ecological aspects of recreation management.  The first of three articles in this dissertation examined approximation of cross sectional soil profiles on foot trails.  Monitoring this ecological indicator with current field techniques can be expensive and time-consuming for managers.  Therefore, this article described a modified procedure for assessing trail soil loss and discusses several potentially useful geometric curves for approximating the cross-section of a trail at a given sampling point and in aggregate across a trail network.  Differences in profiles for each study area and implications for inventorying and monitoring were discussed.  The second article examined integration of soundscape and hiker spatial modeling.  GPS data were used to generate a spatial model of hiker travel, soundscape modeling software calibrated with field data was used to generate a spatial model of sound, and the models were integrated in a geographic information system to provide insights for baseline and an alternative management option scenario.  The findings suggested that small changes in soundscape, based on altered management practices, can have large effects on visitorsâ   hiking experiences in terms of soundscape. The third article discussed an observational study examining several integrative and additive, information/education and site management approaches to preventing natural resource damage along backcountry trails.  Video surveillance equipment unobtrusively captured hiker behaviors within the study area for each treatment.  The findings suggested that direct, obtrusive measures (e.g., low symbolic rope fencing) in some cases can outperform multiple concurrent measures that are less direct and/or obtrusive.  Implications on aesthetics, experiences, and management decision-making were discussed.",
  "description_provenance": [
    "Author Email: logan.park@gmail.com",
    "Advisor Email: waust@vt.edu",
    "Advisor Email: mjstern@vt.edu",
    "Advisor Email: pasupath@vt.edu",
    "Advisor Email: jmarion@vt.edu",
    "Advisor Email: slawson@rsginc.com",
    "Made available in DSpace on 2014-03-14T20:14:52Z (GMT). No. of bitstreams: 1 ParkDissertationETD004.pdf: 5974482 bytes, checksum: 4fe2c6c878dc1187d170aba60579ec56 (MD5)   Previous issue date: 2009-08-03"
  ],
  "handle": "28561",
  "identifier_other": "etd-08072009-090605",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08072009-090605/",
  "identifier_uri": "http://hdl.handle.net/10919/28561",
  "publisher": "Virginia Tech",
  "relation_haspart": "ParkDissertationETD004.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "adaptive management",
    "noise modeling",
    "prescriptive"
  ],
  "title": "Integrative Research in the Sociology and Ecology of Outdoor Recreation",
  "type": "Dissertation"
}