{
  "contributor_author": "Edwards, Stephen Wyatt",
  "contributor_committeechair": "Westfall-Rudd, Donna M.",
  "contributor_committeemember": [
    "Broyles, Thomas W.",
    "Anderson, Glenn A.",
    "Rothschild, Joyce"
  ],
  "contributor_department": "Agricultural and Extension Education",
  "date_accessioned": "2014-03-14T20:14:52Z",
  "date_adate": "2012-08-24",
  "date_available": "2014-03-14T20:14:52Z",
  "date_issued": "2012-07-24",
  "date_rdate": "2012-08-24",
  "date_sdate": "2012-08-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this qualitative case study was to examine the effects of the student teaching experience on secondary agricultural education teachers. Eight of the thirteen participants in this study served as a cooperating teacher during the 2012 spring semester for pre-service teachers in agricultural education from a land-grant institution. Three of the participants had served as a cooperating teacher during either the 2010 or 2011 spring semester but had reported a negative student teaching experience with their last student teacher. Two of the participants had served as pilot interviews for the study, but they were added as participants during the analysis of the study. The participants provided interviews, opportunities for professional observations, and teaching documents for analysis. Four major themes emerged in the study 1) The professional identities of secondary agricultural education teachers are affected by their membership in the pre-service teacher community. 2) Secondary agricultural education teachers volunteer as cooperating teachers to help others and themselves professionally. 3) Secondary agricultural education teachers empower themselves and other members of their communities through their leadership due to their strong sense of political efficacy. 4) The professional practices of agriculture teachers are influenced by their service as a cooperating teacher.",
  "description_provenance": [
    "Author Email: sedwards@moc.edu",
    "Advisor Email: mooredm@vt.edu",
    "Advisor Email: tbroyles@vt.edu",
    "Advisor Email: Glenn.Anderson@doe.virginia.gov",
    "Advisor Email: joycevt@aol.com",
    "Made available in DSpace on 2014-03-14T20:14:52Z (GMT). No. of bitstreams: 2 Edwards_SW_D_2012_Permission.pdf: 127523 bytes, checksum: 2150438ff22eafa4b8228bde502c9d76 (MD5) Edwards_SW_D_2012_2.pdf: 1019978 bytes, checksum: e29a7f49ac20ee4186bbfd0e12e76175 (MD5)   Previous issue date: 2012-07-24"
  ],
  "handle": "28562",
  "identifier_other": "etd-08072012-112451",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08072012-112451/",
  "identifier_uri": "http://hdl.handle.net/10919/28562",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Edwards_SW_D_2012_Permission.pdf",
    "Edwards_SW_D_2012_2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "teacher identity",
    "volunteering",
    "cooperating teacher",
    "student teaching experience"
  ],
  "title": "The Effects of the Student Teaching Experience on Cooperating Teachers in Secondary Agricultural Education Programs: A Case Study",
  "type": "Dissertation"
}