{
  "contributor_author": "Taylor, Charles Doulgas",
  "contributor_committeechair": "Anderson, Mark R.",
  "contributor_committeemember": [
    "Long, Gary L.",
    "Dillard, John G.",
    "Ducker, William A.",
    "Tissue, Brian M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:14:53Z",
  "date_adate": "2000-12-02",
  "date_available": "2014-03-14T20:14:53Z",
  "date_issued": "2000-08-15",
  "date_rdate": "2001-12-02",
  "date_sdate": "2000-08-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The compounds 12-phenoxy-dodecane-1-thiol, 4-dodecyloxymercaptophenol and 3-dodecyloxymercaptophenol have been synthesized using a novel synthesis to investigate the effect that the orientation of the functional group has on surface acidity.  3-dodeycloxymercaptophenol and 4-dodecyloxymercaptophenol differ in that the hydroxyl group is substituted on different carbons of the benzene ring.  The difference in substitution patterns should present the hydroxyl group in different orientations in the interface between a self-assembled monolayer of the compound and aqueous solutions buffered over a pH range of 3-13.  By preparing self-assembled monolayers of these molecules on gold substrates, the ability of the hydroxyl group to donate its proton was shown to depend on the hydroxyl group substitution pattern on the benzene ring through contact angle titration experiments.  3-dodecyloxymercaptophenol clearly showed plateaus at low and high pH with a broad transition between the two plateaus.  4-dodecyloxymercaptophenol showed a clear plateau at low pH but not at high pH, although a transition was observed.  Using infrared spectroscopy, it was further shown that the long molecular axis of the benzene ring in 3-dodecyloxymercaptophenol was tilted from the surface normal by 55&#176;.  The short molecular axis of the ring was twisted out of the plane of the surface by 28&#176; for self-assembled monolayers of this molecule on gold substrates.  In contrast, the tilt angle of 4-dodecyloxymercatophenol was measured to be 46&#176; and was twisted out of the surface plane by 36&#176;.  It was also found from cyclic voltammetry experiments in 0.5 M KOH, that the ionized monolayers of 4-dodecyloxymercaptophenol were 2.3 kJ/mol less stable than monolayers of 3-dodecyloxymercaptophenols.  This finding suggests that hydrogen bonding and other intermolecular interactions in 4-dodecyloxymercaptophenol are greater than in 3-dodecyloxymercaptophenol.",
  "description_provenance": [
    "Author Email: chtaylo5@vt.edu",
    "Advisor Email: long@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: wducker@chemserver.chem.vt.edu",
    "Advisor Email: mark.anderson@vt.edu",
    "Advisor Email: tissue@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:53Z (GMT). No. of bitstreams: 1 etdtaylor3.pdf: 934150 bytes, checksum: f0d04cb21599519bd5a6f3a28dfe2ed7 (MD5)   Previous issue date: 2000-08-15"
  ],
  "handle": "28566",
  "identifier_other": "etd-08082000-21030010",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08082000-21030010/",
  "identifier_uri": "http://hdl.handle.net/10919/28566",
  "publisher": "Virginia Tech",
  "relation_haspart": "etdtaylor3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "surface acidity",
    "Structure propertry relationship",
    "RAIRS",
    "Self assembled monolayer"
  ],
  "title": "Influence of Molecular Orientation and Surface Coverage of w-Functionalized Mercaptans on Surface Acidity",
  "type": "Dissertation"
}