{
  "contributor_author": "Ordakowski, Amy L.",
  "contributor_committeecochair": [
    "Hoffman, Rhonda M.",
    "Kronfeld, David S."
  ],
  "contributor_committeemember": [
    "Lawrence, Larry A.",
    "Houston, Michael E.",
    "Splan, Rebecca K.",
    "Sklan, David S.",
    "Davis, Barbara A."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:14:53Z",
  "date_adate": "2001-10-16",
  "date_available": "2014-03-14T20:14:53Z",
  "date_issued": "2001-07-10",
  "date_rdate": "2002-10-16",
  "date_sdate": "2001-08-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A series of studies were conducted to evaluate effects of lactation, exercise, and anti-folate drugs on folate status in the horse, and the bioavailability of supplement and feed folate in the horse.  In the first study, mares and foals had adequate plasma folate, RBC folate, and plasma homocysteine concentrations during 6 mo of lactation and growth.  Therefore, mares and foals maintained on quality grass/legume pastures and offered a pasture supplement did not require additional folate supplementation to maintain folate status during lactation and growth.  In the second study, 25 mg of oral folic acid (FA) supplemented 5 times/wk to 11 mature horses engaged in routine submaximal exercise did not improve folate status, submaximal athletic performance, or combat the increase in oxidative stress during the 12 wk supplementation period compared to 11 horses not given supplemental folate.  The common practice of supplementing horses with oral FA in vitamin supplements appears to be of little benefit to horses engaged in routine submaximal exercise.  In the third study, daily oral administration of pyrimethamine (PYR) and sulfadiazine (SDZ) for 9 wk followed by 6 wk of coadministration of either Peptidoglycan or FA was associated with a decline in folate status resulting in moderate hyperhomocysteinemia, but not clinical signs of anemia.  Peptidoglycan as a source of formylated folate and FA were not effective in improving folate status in horses coadministered PYR and SDZ, two anti-folate drugs commonly administered in equine veterinary practice.  The last study assessed the bioavailability of oral and i.v. 5-methyltetrahydrofolate (5-mTHF), 5-formyltetrahydrofolate (5-fTHF), or FA, and the bioavailability of folate from concentrates fed to horses.  The minimum efficiency of absorption for supplemental FA was 11 %.  The low bioavailability of FA indicates a need for further research on the potential benefits of alternative sources of folate, including 5-fTHF, on increasing folate status in the horse.",
  "description_provenance": [
    "Author Email: aordakow@vt.edu",
    "Advisor Email: alaw@vt.edu",
    "Advisor Email: houstonm@vt.edu",
    "Advisor Email: rsplan@vt.edu",
    "Advisor Email: rhhoffma@vt.edu",
    "Advisor Email: sklan@huji.ac.edu",
    "Advisor Email: kronfeld@vt.edu",
    "Advisor Email: badavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:53Z (GMT). No. of bitstreams: 2 ALOABSTRACT.pdf: 65756 bytes, checksum: a90d279cc177e4c5236deb1efa6971cf (MD5) ALODISSERTATION.pdf: 1928903 bytes, checksum: 081a0836af56e6060ce0f4d1188823f4 (MD5)   Previous issue date: 2001-07-10"
  ],
  "handle": "28568",
  "identifier_other": "etd-08082001-144545",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08082001-144545/",
  "identifier_uri": "http://hdl.handle.net/10919/28568",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ALOABSTRACT.pdf",
    "ALODISSERTATION.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "homocysteine",
    "Folic acid",
    "anti-folate drugs",
    "exercise",
    "growth",
    "lactation"
  ],
  "title": "Folate Status and Supplementation in the Horse",
  "type": "Dissertation"
}