{
  "contributor_author": "Braekkan, Kristian  Finne",
  "contributor_committeechair": "Markham, Steven E.",
  "contributor_committeemember": [
    "Tegarden, Linda F.",
    "Lang, James R.",
    "Carlson, Kevin D."
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:14:54Z",
  "date_adate": "2010-08-19",
  "date_available": "2014-03-14T20:14:54Z",
  "date_issued": "2010-07-27",
  "date_rdate": "2012-05-08",
  "date_sdate": "2010-08-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation offers a conceptual framework capturing forecasting related activities in a formal organizational context, and it empirically assesses how and how well an organization utilizes forecasting tools and results. Specifically, a multilevel model is formulated that suggests that forecasting capabilities and forecasting processes predict forecasting effectiveness. The model is tested through a field study utilizing a qualitative and quantitative research design. The findings suggest that there are great differences in how forecasting is done among mangers within the same organization, and that in the absence of process congruency (i.e., similar procedures for similar forecasters), the use of a bottom-up approach to forecasting contributes to inconsistent forecasting results. Further, the findings suggest that when it is difficult to establish solid market information, managers often look to competitors in order to establish pseudo-estimates of supply and demand. <p> With respect to content congruency (i.e., the imposition of higher level forecasts onto lower level entities), the dissertation examines the consequences of making decisions based on data from different levels of analyses (and with different geographic scopes).The results highlight the consequences of relying on higher level forecasts when a mismatch exists between organizational and national â  footprintsâ  . Using various economic variables to predict housing starts across levels, the analyses found disparate results for the lower level of analysis.  The results also reveal great differences in the strength of the forecasting models between different levels of analysis and between different entities at the same level. Different combinations of variables contribute toward predicting the key dependent variable, housing starts, at different levels, and even between geographic markets at the same level of analysis. <p> The findings suggest that traditional organizational forecasting performed at the national level presents decision makers with a â  hit or missâ   scenario when trying to predict housing demand in the local markets. The inability to generate strong forecasts utilizing the same variables in different markets appears to be problematic. Thus, a â  bottoms-upâ   approach to the technical generation of forecasts is desirable Recommendations for both future research and practice are suggested.",
  "description_provenance": [
    "Author Email: braekkan@vt.edu",
    "Advisor Email: tegarden@vt.edu",
    "Advisor Email: jrlang@vt.edu",
    "Advisor Email: kevinc@vt.edu",
    "Advisor Email: markhami@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:54Z (GMT). No. of bitstreams: 1 Braekkan_KF_D_2010.pdf: 1252555 bytes, checksum: b8abc829d6425f0a08ad1ff89a26c4af (MD5)   Previous issue date: 2010-07-27"
  ],
  "handle": "28573",
  "identifier_other": "etd-08082010-133511",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08082010-133511/",
  "identifier_uri": "http://hdl.handle.net/10919/28573",
  "publisher": "Virginia Tech",
  "relation_haspart": "Braekkan_KF_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "dyadic and systems influences",
    "individual forecasting effectiveness",
    "organizational forecasting",
    "multilevel analyses",
    "aggregation issues"
  ],
  "title": "Multilevel Determinants of Forecasting Effectiveness: Individual, Dyadic, and System Level Predictors and Outcomes",
  "type": "Dissertation"
}