{
  "contributor_author": "Mweetwa, Alice Mutiti",
  "contributor_committeechair": "James G. Tokuhisa",
  "contributor_committeemember": [
    "Richard E. Veilleux",
    "Flinn, Barry S.",
    "John Jelesko",
    "Shang, Chao"
  ],
  "contributor_department": "Horticulture",
  "date_accessioned": "2014-03-14T20:14:54Z",
  "date_adate": "2009-09-02",
  "date_available": "2014-03-14T20:14:54Z",
  "date_issued": "2009-07-24",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-08-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Steroidal glycoalkaloids (SGAs) are secondary metabolites produced by approximately 350 species in the Solanaceae family. SGAs are reported to be important for pest resistance and flavor enhancement at low concentrations but are toxic to humans and other mammals at high concentrations. Studies on sterol / SGA biosynthesis have implicated squalene synthase as a key regulatory enzyme because it catalyzes an irreversible step from the mevalonic acid pathway. However, the regulatory mechanisms of squalene synthase are not yet known. A study was conducted to elucidate the distribution pattern of SGAs and to clone the squalene synthase gene in order to determine a relationship between SGAs and gene expression levels.  Solanum chacoense, a wild potato species was used as a model plant from which tissues were harvested at specified developmental stages and analyzed for SGA content. The results from the SGA analysis suggest a qualitative and quantitative tissue- and age-dependent accumulation of SGAs. Regenerative tissues such as, axiliary shoots, flowers and floral buds had the highest levels of 88, 49 and 63 Âµmole/g DW, respectively.  The roots, stems and tubers showed the lowest amounts of SGAs of 1 to 8, 5 to 15 and 7 to 15 Âµmole/g DW, respectively. Stolons and tubers accumulated higher amounts of Î±-chaconine (59 to 67%) than Î±-solanine (61 to 64%) at all developmental stages analyzed.  On the other hand, in young expanding, fully expanded, and old senescing leaves where leptine and leptinines tend to dominate, Î±-solanine and Î±-chaconine together accounted for only 8 to 15%, 7 to 15%, and 8 to 45%, respectively. Plant organs that showed the highest biosynthetic activity for SGA production also had high levels of transcripts coding for genes of isoprenoid biosynthesis. The results from the cloning and characterization of squalene synthase suggest that the cloned cDNA fragment is a putative S. chacoense squalene synthase gene with an open reading frame / predicted protein precursor of 411 amino acids.  The cloned cDNA has high similarity (68-100%) to known plant squalene synthase genes and contains six deduced peptide domains observed in other species. The 3â   untranslated regions of floral buds, young leaves (early vegetative stage), and fully expanded leaves (anthesis) were different in length with, 249, 335, and 202 nucleotides, respectively. The Southern blot analysis suggests a single copy gene  although the existence of a gene family cannot be ruled out.",
  "description_provenance": [
    "Author Email: mweetwam@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: bflinn@vt.edu",
    "Advisor Email: jelesko@vt.edu",
    "Advisor Email: chshang@vt.edu",
    "Advisor Email: tokuhisa@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:54Z (GMT). No. of bitstreams: 1 AliceMweetwaFinal.pdf: 1979005 bytes, checksum: 7b731c21093092ad03afae6ae1fe47c1 (MD5)   Previous issue date: 2009-07-24"
  ],
  "handle": "28572",
  "identifier_other": "etd-08082009-204852",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08082009-204852/",
  "identifier_uri": "http://hdl.handle.net/10919/28572",
  "publisher": "Virginia Tech",
  "relation_haspart": "AliceMweetwaFinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "squalene synthase",
    "solanine",
    "chaconine",
    "wild potota species",
    "secondary metabolities",
    "solanidine"
  ],
  "title": "Biosynthesis of Steroidal Glycoakaloids in Solanum chacoense Bitter",
  "type": "Dissertation"
}