{
  "contributor_author": "Bailey, William Anthony",
  "contributor_committeechair": "Wilson, Henry P.",
  "contributor_committeemember": [
    "Parrish, David J.",
    "Hatzios, Kriton K.",
    "Hagood, Edward Scott Jr.",
    "Orcutt, David M."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:14:56Z",
  "date_adate": "2002-08-26",
  "date_available": "2014-03-14T20:14:56Z",
  "date_issued": "2002-08-09",
  "date_rdate": "2003-08-26",
  "date_sdate": "2002-08-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Integrated weed management involves the utilization of weed biology principles to develop effective and economical control strategies.  This research involved investigations of herbicide-based weed management programs in potato (<i>Solanum tuberosum</i> L.) and winter wheat (<i>Triticum aestivum</i> L.) as well as investigations of the biological characteristics of smooth pigweed (<i>Amaranthus hybridus</i>), a troublesome species in many crops.  Sulfentrazone is an herbicide registered for use in soybean [<i>Glycine max</i> (L.) Merr.] and tobacco (<i>Nicotiana tabacum</i> L.) that may also have potential for use in potato.  In field experiments, potato tolerance to preemergence (PRE) applications of sulfentrazone at rates up to 0.21 kg/ha was similar to that from the registered herbicides metribuzin, metolachlor, or metribuzin plus metolachlor PRE.  Potato generally did not tolerate sulfentrazone applications to foliage.  Sulfentrazone effectively controlled common lambsquarters (<i>Chenopodium album</i> L.) at rates as low as 0.11 kg/ha and also controlled several annual grasses at higher application rates, but was slightly less effective on jimsonweed (<i>Datura stramonium</i> L.) and ineffective on common ragweed (<i>Ambrosia artemisiifolia</i> L.). Potato tuber yield and grade from sulfentrazone PRE applications was similar to yield of potato treated with registered herbicides.  Laboratory research was also conducted to determine the mechanism of sulfentrazone selectivity between potato (a tolerant species), common lambsquarters (a sensitive species), and jimsonweed (an intermediate species).  After 48 h root exposure to [14C] sulfentrazone, absorption by common lambsquarters was nearly two-fold that of jimsonweed and three-fold that of potato.  Both weed species also exhibited nearly a two-fold increase in sulfentrazone translocation from roots to shoots compared to potato.  Since the site of action of sulfentrazone, protoporphyrinogen oxidase, is located in shoot tissue, translocation to shoots is essential for sulfentrazone toxicity.  Therefore, the proposed primary mechanisms of selectivity between these species are differential root absorption and differential translocation.  Experiments were also conducted to investigate the potential of the experimental herbicide AE F130060 03 for Italian ryegrass (<i>Lolium multiflorum</i> Lam.) control in winter wheat.  In laboratory research, foliar absorption of AE F130060 03 in Italian ryegrass was at least three times that in wheat.  Additionally, herbicide metabolism was greater in wheat, particularly in wheat treated with the herbicide safener AE F107892.  In field experiments, AE F130060 03 was as effective as diclofop-methyl for control of diclofop-sensitive Italian ryegrass and more effective than diclofop-methyl and all other herbicides tested for control of diclofop-resistant Italian ryegrass.  Although wheat injury from AE F130060 03 was greater than from other herbicides, wheat recovered and yields were not affected.  Postemergence AE F130060 03 applications controlled Italian ryegrass from emergence until the end of tillering, but applications made to four- to five-tiller Italian ryegrass resulted in the least amount of new Italian ryegrass emergence following application.  To further define the utility of AE F130060 03 in winter wheat, ten wheat cultivars adapted to Virginia were evaluated for tolerance to AE F130060 03.  Biomass production between cultivars was not influenced by AE F130060 03 application in the greenhouse, although slight yield decreases due to herbicide application were found in FFR 518, Coker 9663, AgriPro Patton, and VA98W593 under weed-free conditions in the field.  Greenhouse, growth chamber, and field experiments were also conducted to investigate growth and seed production of one imidazolinone-susceptible (S) and five -resistant (R1, R2, R3, R4, and R5) smooth pigweed biotypes.  Although the S biotype produced more total biomass than four of the five R biotypes, R4 displayed a more rapid growth rate at 3 to 5 wk after planting and a faster germination rate than S and all other R biotypes.  Seed production in R4 was similar to S and greater than in all other R biotypes.  Early rapid growth in R4 did not translate into increased biomass accumulation compared to S at the conclusion of the experiments.",
  "description_provenance": [
    "Author Email: wabailey@vt.edu",
    "Advisor Email: dparrish@vt.edu",
    "Advisor Email: hatzios@vt.edu",
    "Advisor Email: shagood@vt.edu",
    "Advisor Email: hwilson@vt.edu",
    "Advisor Email: dmorcutt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:56Z (GMT). No. of bitstreams: 12 wbailey_04_vitae.pdf: 227537 bytes, checksum: 40beded177925ed7f8328844a137d9d4 (MD5) wbailey_03_chapter_5.pdf: 338596 bytes, checksum: 735a2c324d4446c4400000a2cdf16064 (MD5) wbailey_02_table_of_contents.pdf: 277568 bytes, checksum: 1766e3bb8e1ac8e765a659b453ddaeb1 (MD5) wbailey_01_title_e_abstract.pdf: 269411 bytes, checksum: 756e0b95b7d04bdfe74190a854ae7977 (MD5) wbailey_03_chapter_7.pdf: 319436 bytes, checksum: c7d7d031a19142b770b3022fe62f94d0 (MD5) wbailey_03_chapter_8.pdf: 422707 bytes, checksum: ed5c4505498336fcc736bb32aec6667b (MD5) wbailey_03_chapter_4.pdf: 360774 bytes, checksum: 7da68c66d81d369b6f99162e82720164 (MD5) wbailey_03_chapter_6.pdf: 356211 bytes, checksum: 814cc8a385cfa3818608e1278a61ebd6 (MD5) wbailey_03_chapter_2.pdf: 330451 bytes, checksum: 639a87ad9ee505902e2ec4c13cd0c806 (MD5) wbailey_03_chapter_1.pdf: 310906 bytes, checksum: ebd02d2271115fca01dd304e3d3f69b7 (MD5) wbailey_03_chapter_3.pdf: 341808 bytes, checksum: 9b88199309d56359cbac237f71d30324 (MD5) wbailey_03_chapter_9.pdf: 229119 bytes, checksum: bd5f587cae1b0f63b4c09a54caadb602 (MD5)   Previous issue date: 2002-08-09"
  ],
  "handle": "28578",
  "identifier_other": "etd-08092002-140517",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08092002-140517/",
  "identifier_uri": "http://hdl.handle.net/10919/28578",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "wbailey_04_vitae.pdf",
    "wbailey_03_chapter_5.pdf",
    "wbailey_02_table_of_contents.pdf",
    "wbailey_01_title_e_abstract.pdf",
    "wbailey_03_chapter_7.pdf",
    "wbailey_03_chapter_8.pdf",
    "wbailey_03_chapter_4.pdf",
    "wbailey_03_chapter_6.pdf",
    "wbailey_03_chapter_2.pdf",
    "wbailey_03_chapter_1.pdf",
    "wbailey_03_chapter_3.pdf",
    "wbailey_03_chapter_9.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "absorption",
    "Italian ryegrass",
    "growth",
    "wheat",
    "metabolism",
    "smooth pigweed",
    "potato",
    "germination",
    "seed production",
    "translocation",
    "sulfentrazone",
    "weed control"
  ],
  "title": "Herbicide-based Weed Management Systems for Potato (<i>Solanum tuberosum</i>) and Wheat (<i>Triticum aestivum</i>) and Growth and Reproductive Characteristics of Smooth Pigweed (<i>Amaranthus hybridus</i>)",
  "type": "Dissertation"
}