{
  "contributor_author": "Park-Gates, Shari Lane",
  "contributor_committeecochair": [
    "Marshall-Baker, Anna",
    "Bowker, Jeanette E."
  ],
  "contributor_committeemember": [
    "Germana, Joseph",
    "Sawyers, Janet K.",
    "Cross, Lawrence H."
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2014-03-14T20:14:56Z",
  "date_adate": "2001-09-03",
  "date_available": "2014-03-14T20:14:56Z",
  "date_issued": "2001-07-16",
  "date_rdate": "2002-09-03",
  "date_sdate": "2001-08-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Effects of Group Interactive Brainstorming on Creativity  By  Shari Park-Gates  Committee Co Chairs: Anna Marshall-Baker and Jeanete E. Bowker Near Environments  (ABSTRACT)  \tCorporations spend a great deal of time and money trying to facilitate innovation in their employees.  The act of introducing something new, a product or a service that is viable and innovative is often increased by enhancing or nurturing creativity. \tThis experimental study investigated the effect of group verbally interactive brainstorming (social interaction) on creativity, not by comparing the number of ideas generated on a simple task in a brainstorming session, but by assessing creativity in the final product of a complex heuristic task.  The purpose of this study was to compare the effect of group interactive brainstorming to individual brainstorming on individual creativity assessed in the final product. \tThe hypothesis which was tested in this study was that participation in group verbally interactive brainstorming prior to developing a design solution would not facilitate creativity in the final product more than individual brainstorming. Indeed, it was hypothesized that individuals brainstorming in teams. \tParticipants were 36 interior design students in a FIDER accredited program at Virginia Tech.  The Multidimensional Stimulus Fluency Measure (MSFM) was administered before beginning the experiment in order to determine individual differences in creativity.  Subjects were randomly assigned to either a treatment group than participated in group verbally interactive brainstorming prior to developing a product individually, or a control group that participated in an individual brainstorming session.  All subjects then created a design project individually that was assessed for creativity by judges who were recruited from professional interior design organizations.  Creativity was measures using the Consensual Assessment for Interior Design Creativity (Barnard, 1992).  A post session questionnaire also was used to measure attitudes and perceptions of the subjects about the creative process. Analysis of variance revealed no significant differences when creativity scores were compared between two brainstorming grops.  That is, projects developed by interior design students did not differ significantly in creativity systematically between the two brainstorming techniques.  When scores on the two dependent variables of secondary interest (novelty and appropriateness) were compared between groups they also did not differ significantly. \tResponses to post-session questionnaires indicated that although students found it more difficult to generate ideas in a group, they still believed they would generate more ideas and preferred to generate ideas in a group rather than alone. However, when developing a project students preferred to work independently. \tThis study supports past research which suggests that group verbally interactive brainstorming does not enhance creativity.  In this study, interactive brainstorming neither enhanced nor constrained creativity in the final prodct.  The creativity scores were higher for those in the individual brainstorming condition, although not significantly so.  This study also supports findings which indicate that people still believe they will generate more ideas in a group and that they prefer to generate ideas as a group.",
  "description_provenance": [
    "Author Email: sparkgates@gsvms2.cc.gasou.edu",
    "Made available in DSpace on 2014-03-14T20:14:56Z (GMT). No. of bitstreams: 1 FinalCopyDissertation.pdf: 309999 bytes, checksum: e650430696ba7aee11f732f1bab46038 (MD5)   Previous issue date: 2001-07-16"
  ],
  "handle": "28577",
  "identifier_other": "etd-08092001-104543",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08092001-104543/",
  "identifier_uri": "http://hdl.handle.net/10919/28577",
  "publisher": "Virginia Tech",
  "relation_haspart": "FinalCopyDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "interaction and creativity",
    "creativity tasks",
    "teams and creativity",
    "measures of creativity",
    "perceptions of idea generation and creativity",
    "brainstorming and creative product",
    "electronic brianstorming and creativity",
    "creativity and the environment",
    "interior design and creativity",
    "group interaction and creativity",
    "industry and creativity",
    "innovation and team interaction",
    "brainstorming",
    "social environment and creativity",
    "ceativity",
    "groups and creativity"
  ],
  "title": "Effects of Group Interactive Brainstorming on Creativity",
  "type": "Dissertation"
}