{
  "contributor_author": "Pillai, Karthik",
  "contributor_committeechair": "Renneckar, Scott H.",
  "contributor_committeemember": [
    "Roman, Maren",
    "Esker, Alan R.",
    "Frazier, Charles E.",
    "Edgar, Kevin J."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:14:55Z",
  "date_adate": "2011-10-07",
  "date_available": "2014-03-14T20:14:55Z",
  "date_issued": "2011-04-26",
  "date_rdate": "2011-10-07",
  "date_sdate": "2011-08-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Natural composites like wood are scale-integrated structures that range from molecular to the macroscopic scale. Inspired by this design, layer-by-layer (LbL) deposition technique was used to create lignocellulosic composites from isolated wood polymers namely cellulose and lignin, with a lamellar architecture. In the first phase of the study, adsorption of alkali lignin onto cationic surfaces was investigated using a quartz crystal microbalance with dissipation monitoring (QCM-D). Complete coverage of the cationic surface with alkali lignin occured at low solution concentration; large affinity coefficients were calculated for this system at differing pH levels. Adsorption studies with organosolv lignin in an organic solvent, and spectroscopic analysis of mixtures of cationic polymer with alkali lignin revealed a non-covalent interaction. The work demonstrated how noncovalent interactions could be exploited to molecular organize thin polyphenolic biopolymers on cationic surfaces.  The second phase of the study examined the adsorption steps during the LbL assembly process to create novel lignocellulosic composites.  LbL assembly was carried out using oxidized nanocellulose (NC) and lignin, along with a cationic polymer poly(diallyldimethylammonium chloride) (PDDA). QCM-D was used to follow the sequential adsorption process of the three different polymers. Two viscoelastic models, namely Johannsmann and Voigt, were respectively used to calculate the areal mass and thickness of the adsorbed layers. Atomic force microscopy studies showed a complete coverage of the surface with lignin in all the disposition cycles, however, surface coverage with NC was seen to increase with the number of layers. Free-standing composite films were obtained when the LbL process was carried out for 250 deposition cycles (500 bilayers) on a cellulose acetate substrate, following the dissolution of the substrate in acetone. Scanning electron microscopy of the cryo-fractured cross-sections showed a lamellar structure, and the thickness per adsorption cycle was estimated to be 17 nm. The third phase of the study investigated the effect of LbL ordering of the polymers versus a cast film composed of a blended mixture of the polymers, using dynamic mechanical analysis. A tan ï ¤ peak was observed in the 30 â   40 ÂºC region for both films, which was observed in the neat NC film. Heating of the samples under a compressive force produced opposite effects in the films, as the LbL films exhibited swelling, whereas the cast films showed densification. The apparent activation energy of this transition (65 â   80 kJ mol-1) in cast films, calculated based on the Arrhenius equation was found to be coincident to those reported for the ï ¢ transition of amorphous cellulose. The peak was seen to disappear in case of LbL films in the second heat, whereas it was recurring in case of cast films of the blended mixture, and neat NC films. Altogether, the together the work details a novel path to integrate an organized lignin and cellulose molecular structure, albeit modified from their native form, into a three-dimensional composite material.",
  "description_provenance": [
    "Author Email: karthvp@vt.edu",
    "Advisor Email: maren.roman@vt.edu",
    "Advisor Email: srenneck@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: cfrazier@vt.edu",
    "Advisor Email: kjedgar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:55Z (GMT). No. of bitstreams: 2 Pillai_KV_D_2011.pdf: 3596151 bytes, checksum: 49e2bdec166bb568658711dd6119942a (MD5) Pillai_KV_D_2011_Copyright.pdf: 1470308 bytes, checksum: ba4b6f782155d733c892bef5e4ad9dda (MD5)   Previous issue date: 2011-04-26"
  ],
  "handle": "28575",
  "identifier_other": "etd-08082011-223736",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08082011-223736/",
  "identifier_uri": "http://hdl.handle.net/10919/28575",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Pillai_KV_D_2011.pdf",
    "Pillai_KV_D_2011_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Nanocellulose",
    "Nanocomposite",
    "Biomimetic",
    "Layer-by-layer (LbL)",
    "QCM-D",
    "AFM"
  ],
  "title": "Bio-inspired Cellulose Nanocomposites",
  "type": "Dissertation"
}