{
  "contributor_author": "Dredger, Mary Kathleen",
  "contributor_committeecochair": [
    "Kelly, Patricia Proudfoot",
    "Kajder, Sara B."
  ],
  "contributor_committeemember": [
    "HIcks, David",
    "Moorefield-Lang, Heather"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:14:58Z",
  "date_adate": "2011-09-06",
  "date_available": "2014-03-14T20:14:58Z",
  "date_issued": "2011-08-03",
  "date_rdate": "2011-09-06",
  "date_sdate": "2011-08-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The goal of this case study of a mindful literacy teacher in a middle school social studies class was to describe the nature of one teacher's differentiated text choices in one seven week unit. The participant was nominated by an administrator, a district supervisor, a university professor, and the researcher based on characteristics of mindful literacy instruction. Classroom observations and teacher interviews described four differentiated text events: an historical fiction novel unit; primary source oral histories; expository non-fiction articles; and picture books, magazines, and an anthology set. Interview transcripts were coded using constant comparative analysis and revealed the teacher's belief in stories, student choice, her resistance to standardized testing, and her own teaching confidence and activist spirit. The discussion addresses the teacher's effectiveness in the areas of collaboration with students, the assignment of varied and plentiful texts, the expectation of high achievement for herself and students; and her effective management of the differentiated texts in the classroom. The researcher also concluded that this teacher did not have the expertise to diagnose or remediate basic reading deficits but her disposition in seeing herself as a reading teacher, challenging mandated curricula, and working to offer appropriate choices for all of her students supported her decision to offer differentiated text choices.",
  "description_provenance": [
    "Author Email: kdredger@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: skajder@vt.edu",
    "Advisor Email: hicks@vt.edu",
    "Advisor Email: hmlang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:58Z (GMT). No. of bitstreams: 2  Dredger_MK_D_2011_fairuse.pdf: 1094050 bytes, checksum: eba0c2bdc82c97ea06af26b6cb8055f3 (MD5)  Dredger_MK_D_2011.pdf: 638289 bytes, checksum: 43b4d8812dc0949039ee4deb1bb00888 (MD5)    Previous issue date: 2011-08-03"
  ],
  "handle": "28588",
  "identifier_other": "etd-08092011-171552",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08092011-171552/",
  "identifier_uri": "http://hdl.handle.net/10919/28588",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dredger_MK_D_2011_fairuse.pdf",
    "Dredger_MK_D_2011.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Lexiles",
    "English Education",
    "Middle School",
    "Social Studies Education",
    "text complexity",
    "secondary education",
    "text-reader matching",
    "content area literacy",
    "differentiated texts",
    "case study",
    "adolescent literacy"
  ],
  "title": "A Savory Stew: Text Differentiation in a Middle School Immigration Unit",
  "type": "Dissertation"
}