{
  "contributor_author": "Peralta, Oscar  Alejandro",
  "contributor_committeechair": "Eyestone, Willard H.",
  "contributor_committeemember": [
    "Huckle, William R.",
    "Eng, Ludeman A.",
    "Meng, Xiang-Jin",
    "Sible, Jill C."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:14:58Z",
  "date_adate": "2008-09-03",
  "date_available": "2014-03-14T20:14:58Z",
  "date_issued": "2008-07-25",
  "date_rdate": "2009-09-03",
  "date_sdate": "2008-08-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The host encoded cellular prion protein (PrPC) is an N-linked glycoprotein tethered to the cell membrane by a glycophosphatidylinositol (GPI) anchor. Under certain conditions, PrPC can undergo conversion into a conformationally-altered isoform (PrPSc) widely believed to be the pathogenic agent of transmissible spongiform encephalopathies (TSEs). Thus, tissues expressing PrPC are potential sites for conversion of PrPSc during TSE pathogenesis. Although much is known about the role of PrPSc in prion diseases, the normal function of PrPC is poorly understood. Lines of mice and cattle in which PrPC has been ablated by gene knockout show no major phenotypical alterations other than resistance to TSE infection. However, recent reports using Prnp-null mouse models have suggested the participation of PrPC in neural stem/progenitor cell proliferation and differentiation. The first objective in our study was to map the expression of PrPC in twenty six somatic and reproductive tissues in ruminants. Our second objective was to characterize the ontogeny of PrPC expression during bovine embryonic and early fetal development. Finally, we used a mouse embryonic stem cell (mESC) model to study the potential role of PrPC during neurogenesis. In adult tissues, intense expression of PrPC was detected in the central nervous system (CNS), thymus and testes, whereas the liver, striated muscle and female reproductive tissues showed the lowest expression. We observed that PrPC was associated with tissues undergoing cellular differentiation including spermatogenesis, lymphocyte activation and hair follicle regeneration. Analyses in bovine embryos and fetuses indicated peaks in expression of PrPC at days 4 and 18 post-fertilization, stages associated with the maternal-zygote transition and the maternal recognition of pregnancy and initiation of placental attachment, respectively. Later in development, PrPC was expressed in the CNS where it was localized in mature neurons of the neuroepithelium and emerging neural trunks. Based on these observations, we hypothesized that PrPC was involved in neurogenesis. We tested this hypothesis in a murine embryonic stem cell model (mESC).  mESC were induced to form embryoid bodies (EBs) by placing them in suspension culture under differentiating conditions and allowed to differentiate in vitro for 20 days. We detected increasing levels of PrPC starting on day 12 (8.21- fold higher vs. day 0; P < 0.05) and continuing until day 20 (20.77-fold higher vs. day 0; P < 0.05). PrPC expression was negatively correlated with pluripotency marker Oct-4 (r= -0.85) confirming that mESC had indeed differentiated. To provide a more robust system for assessing the role of PrPC in neural differentiation, mESC were cultured with or without retinoic acid (RA) to encourage differentiation into neural lineages. Induction of EBs with retinoic acid (RA) resulted in an earlier up-regulation of PrPC and nestin (day 12 vs. day 16; P < 0.05). In addition, immunofluorescence studies indicated co-expression of PrPC and nestin in the same cells. The results of these experiments suggested a temporal link between PrPC expression and expression of nestin, a marker of neural progenitor cells. We next tested whether PrPC was involved in RA-enhanced neural differentiation from mESC using a PrPC knockdown model. Plasmid vectors designed to express either a PrP-targeted shRNA or scrambled, control shRNA were transfected into mESC. Stable transfectants were selected under G418 and cloned. PrP-targeted and control shRNA clones, as well as wild-type mESC, were differentiated in presence of RA and sampled as above. PrPC expression was knocked down in PrP-targeted shRNA cultures between days 12 and 20 (62.2 % average reduction vs. scrambled shRNA controls). Nestin expression was reduced at days 16 and 20 in PrPC knockdown cells (61.3% and 70.7%, respectively vs. scrambled shRNA controls). These results provide evidence that PrPC plays a role in the neural differentiation at a point up-stream from the stages at which nestin is expressed. In conclusion, the widely distributed expression of PrPC in ruminant tissues suggests an important biological role for this protein. In the present work we have provided evidence for the participation of PrPC in the differentiation of mESC along the neurogenic pathway.",
  "description_provenance": [
    "Author Email: operalta@vt.edu",
    "Advisor Email: weyest@vt.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: laeng@vt.edu",
    "Advisor Email: xjmeng@vt.edu",
    "Advisor Email: siblej@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:58Z (GMT). No. of bitstreams: 1 Thesis.pdf: 15608219 bytes, checksum: 33ae64d38cb31cbab7a39ed72e5c607d (MD5)   Previous issue date: 2008-07-25"
  ],
  "handle": "28584",
  "identifier_other": "etd-08092008-165032",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08092008-165032/",
  "identifier_uri": "http://hdl.handle.net/10919/28584",
  "publisher": "Virginia Tech",
  "relation_haspart": "Thesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Somatic tissues",
    "Reproductive tract",
    "Prion gene (Prnp)",
    "Cellular prion protein (PrPC)",
    "Embryogenesis",
    "Gene expression",
    "Embryonic stem cells",
    "Neural differentiation"
  ],
  "title": "Developmental Regulation of Prion Expression in Cattle and Mouse Embryonic Stem Cells",
  "type": "Dissertation"
}