{
  "contributor_author": "Donnenwerth, Jesse James",
  "contributor_committeechair": "Stratton, Richard K.",
  "contributor_committeemember": [
    "Bolin, Delmas",
    "Redican, Kerry J.",
    "Nottingham, Quinton"
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:14:57Z",
  "date_adate": "2006-09-14",
  "date_available": "2014-03-14T20:14:57Z",
  "date_issued": "2006-07-28",
  "date_rdate": "2007-09-14",
  "date_sdate": "2006-08-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Background: In recent years several state high school athletic association have investigated methods to ensure the health and safety of high school wrestlers.  One method implemented by the National Collegiate Athletic Association requires the prediction of minimum weight (MW) prior to the competition season.  This weight certification program requires the assessment of body composition and hydration status.  Results from those assessments place wrestlers in their lowest allowable wrestling weight class.  There are a variety of measurement devises that have proven to be effective in measuring body composition.  However, several considerations must be taken into account when choosing a devise such as affordability and reliability.  Of those devices leg-to-leg bioelectrical impedance analysis (BIA) has been suggested for use with wrestlers.</p><p> Purpose: To test the validity of bioelectrical impedance as an instrument of body composition and minimum wrestling weight compared to three-site skinfold using the Lohman-Brozek formula and the Bod Pod&#174; among hydrated high school wrestlers.</p><p> Methods: Criterion for this study was the Bod Pod&#174;.  Subjects included 98 high school wrestlers taking part in the pre-season wrestling weight certification program implemented by the Virginia High School League. Hydration was assessed and a urine specific gravity (USG) â ¤ 1.020 was assigned as the level of hydration.  </p><p>Results: In order to investigate the validity of BIA in this study a repeated measure ANOVA with between-subjects factors was used to assess the equality of means between the three measurement devices.  Also, in order to investigate hydration affect subjects were divided into two categories (hydrated and dehydrated).  Finally, prior to analysis subjects were placed in weight categories based on their assigned wrestling weight class.  Results of this study demonstrated that the three measurement devices did not produce similar results and it was concluded that hydration level had no affect on the measurements.  Therefore, at this time BIA should not be considered as an alternative method for assessing body composition in high school wrestling weight certification programs.</p>",
  "description_provenance": [
    "Author Email: jdonnenw@vt.edu",
    "Advisor Email: techmd@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: notti@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:57Z (GMT). No. of bitstreams: 1 DonnenwerthDissertation.pdf: 372631 bytes, checksum: d9baedf1b80444977d047e42b2a97d2e (MD5)   Previous issue date: 2006-07-28"
  ],
  "handle": "28583",
  "identifier_other": "etd-08092006-093459",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08092006-093459/",
  "identifier_uri": "http://hdl.handle.net/10919/28583",
  "publisher": "Virginia Tech",
  "relation_haspart": "DonnenwerthDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Wrestling",
    "Hydration",
    "Body Composition",
    "Bioelectrical Impedance",
    "Weight Certification"
  ],
  "title": "Validity of Bioimpedance as a Measure of Body Fat in High School Wrestlers",
  "type": "Dissertation"
}