{
  "contributor_author": "Farr, Isaac Vincent",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Castagnoli, Neal  Jr.",
    "Gibson, Harry W.",
    "Long, Timothy E.",
    "Ward, Thomas C."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:14:59Z",
  "date_adate": "1999-08-13",
  "date_available": "2014-03-14T20:14:59Z",
  "date_issued": "1999-07-26",
  "date_rdate": "2000-08-13",
  "date_sdate": "1999-08-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Phenylindane monomers 5(6)-amino-1-(4-aminophenyl)-1,3,3-trimethylindane (DAPI), 5,6-diamino-1-(4-aminophenyl)-1,3,3-trimethylindane (TAPI) and 6-hydroxy- 1-(4-hydroxyphenyl)-1,3,3-trimethylindane (DHPI) were synthesized and characterized.  DAPI, as well as other diamines, were then utilized in solution step polycondensation with a number of commercially available dianhydrides using either the two-step ester-acid solution imidization or the high temperature solution imidization routes.  High molecular weight soluble fully cyclized polyimides were successfully synthesized using a 1:1 molar ratio of dianhydride to diamine.  The polyimides were film forming and were characterized by size exclusion chromatography (SEC), differential scanning calorimetry (DSC), thermogravimetric analysis (TGA) and selective gas permeation methods, as well as other techniques.  The O2 permeation and O2/N2 selectivity values obtained for materials prepared in this thesis are discussed in relation to the concept of an \"upper bound\", as defined in the literature concerning gas separation membranes. The series of polyimides based on DAPI and several dianhydrides were found to have high glass transition temperatures (247°C-368°C) and very good short-term thermal stability as shown by TGA, despite the partially aliphatic character of DAPI.  The 5,5'-[2,2,2-trifluoro-1-(trifluoromethyl)ethylidene]bis-1,3-isobenzenefurandione (6FDA)/DAPI system also exhibited low weight loss under nitrogen at 400°C, which was comparable to that of a wholly aromatic polyimide based on 1,2,4,5-benzenetetracarboxylic dianhydride (PMDA)/4,4'-oxydianiline (ODA) which is known to have high thermal stability.  In addition, the 6FDA/DAPI polyimides had a refractive index value of 1.571 from which the dielectric constant was calculated, giving an attractively low estimated value of 2.47.          The rigid, bulky and isomeric structure of DAPI in the repeat unit imparted film forming characteristics that allowed production of solvent cast membranes which displayed a range of O2 permeability and O2/N2 selectivity characteristics.  High O2 permeabilities were observed for polyimides in which the DAPI structure predominated in relation to the overall polymer repeat unit, i.e. in combination with low molar mass dianhydrides.  The more flexible dianhydrides afforded a greater degree of molecular freedom and were thought to result in a more tightly packed polymer conformation which decreased the rate of gas penetration through thin films.  The DAPI/3,3',4,4'-benzophenonetetracarboxylic dianhydride (BTDA) system showed the best combination of O2 permeability and O2/N2 selectivity values (2.8Ba and 7.3, respectively).  Modest variations in the DAPI isomeric ratio did not significantly effect the gas permselectivity properties. \tHigh molecular weight polyimides based on DAPI and BTDA were synthesized by three different routes.  The ester-acid and thermal imidization methods produced polyimides with the highest Tgs and best thermal stability in air, as compared to the chemical imidization procedure.  For example, a Tg increase of 22°C and a 68°C increase in the 5% weight loss were found for the ester-acid imidized DAPI/BTDA polyimide over those found for the chemically imidized version.  The higher Tg and 5% weight loss values were attributed to the elimination of residual uncyclized amide acid moieties. \tPolyimides derived from 6FDA were synthesized by the high temperature solution imidization method.  Thin films, cast from NMP, were tough and creasable and afforded high Tg (>295°C) systems with good thermal stability.  When combined with rigid diamines, 6FDA contributed to high O2 permeation and moderate O2/N2 selectivity.  The high O2 permeability was ascribed to hindered interchain packing attributed to the bulky CF3 groups.  The exceptionally high oxygen permeability and O2/N2 selectivity values of the 9,9-bis(4-aminophenyl) fluorene (FDA)/6FDA system, were near the desirable \"upper bound\" for gas separation membrane materials, while those of 3,7-diamino-2,8-dimethyl-dibenzothiophene-5,5-dioxide (DDBT)/6FDA were actually above the upper bound. \tHigh performance polymers based on 4,4'-bis [4-(3,4-dicarboxyphenoxy)]biphenyl dianhydride (BPEDA), 2,2'-bis [4-(3,4-dicarboxyphenoxy)phenyl] propane dianhydride (BPADA), 2,2-bis(3-amino-4-methylphenyl)hexafluoroisopropylidene dianhydride (Bis-AT-AF) and 3,7-diamino-2,8-dimethyl-dibenxothiophene-5,5-dioxide (DDBT) were also synthesized in this work.  Additionally, they were characterized with regard to molecular weight, glass transition temperature, and thermal stability. \tPolyimide systems containing hydroxyl moieties in the repeat unit were also investigated.  Incorporation of hydroxyl moieties in the repeat unit enhanced chain stiffness via intermolecular hydrogen bonding and showed Tg increases of ~30°C  Hydroxyl moieties also decreased the thermal stability values typically observed for polyimides.  High O2/N2 selectivity was achieved with all of the 4,4'-diaminobiphenyl-3,3'-diol (HAB) containing polymers.  However, these materials also had low O2 permeabilities, which suggested a tightly packed structure, possibly facilitated by hydrogen bonding.  In contrast to suggestions in the literature, the comparison between a polyimide having pendant hydroxyl groups and another having the same repeat unit without them did not reveal a significant change in permselectivity behavior. The synthesis, characterization and crosslinking behavior of functional polyimides containing phenol, amine and acetylene moieties are also described.  A crosslinking reaction of oligomers containing phenol moieties with a tetrafunctional epoxy resin was achieved 100°C below the \"dry\" glass transition temperature and was attributed to residual solvent.  Utilization of this crosslinking mechanism could allow membrane optimization by investigating the influence of a number of variables, such as the concentration of the phenolic moiety, epoxy weight percent, catalyst concentration and residual solvent content.",
  "description_provenance": [
    "Author Email: ifarr@vt.edu",
    "Made available in DSpace on 2014-03-14T20:14:59Z (GMT). No. of bitstreams: 12 09chapter_4.pdf: 367522 bytes, checksum: 417c2d488f069eca77262d4f2003c21c (MD5) 10chapter_5.pdf: 12448 bytes, checksum: ca25b09e9dbc2ddd9fbf98ca1c8dc2f2 (MD5) 08chapter_3.pdf: 299242 bytes, checksum: 2066250f8897fc48f8a346f95e8e3aa9 (MD5) 07chapter_2.pdf: 658577 bytes, checksum: c565e31ba15056c9915ee1b54538ea79 (MD5) 06chapter_1.pdf: 5683 bytes, checksum: 60e88c0eb7e27c844128da9dd950fc50 (MD5) 05contents.pdf: 39117 bytes, checksum: a863393b0be1926491aab2e9cc45a40a (MD5) 04acknowledgments.pdf: 6417 bytes, checksum: 4c97df6e7be438e82578559cf6abfdc1 (MD5) 03dedication.pdf: 3349 bytes, checksum: ad1cfc1047959a112f13a19f6a872d8e (MD5) 02abstract.pdf: 11396 bytes, checksum: d903d6e836b4dc5e9f02cce7a080ef27 (MD5) 01title.pdf: 3959 bytes, checksum: 731b2b9fb96b6cfa8b9fec8cd51e77a7 (MD5) 11references.pdf: 36139 bytes, checksum: 038ffdf71ad97eb00e44318568101c02 (MD5) 12vita.pdf: 4357 bytes, checksum: 63280f44f79b48bfa31a3affcfca9a76 (MD5)   Previous issue date: 1999-07-26"
  ],
  "handle": "28590",
  "identifier_other": "etd-080999-123034",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-080999-123034/",
  "identifier_uri": "http://hdl.handle.net/10919/28590",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "09chapter_4.pdf",
    "10chapter_5.pdf",
    "08chapter_3.pdf",
    "07chapter_2.pdf",
    "06chapter_1.pdf",
    "05contents.pdf",
    "04acknowledgments.pdf",
    "03dedication.pdf",
    "02abstract.pdf",
    "01title.pdf",
    "11references.pdf",
    "12vita.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "phenylindane monomers",
    "structure/property",
    "selectivity",
    "permeability",
    "gas separation",
    "membrane",
    "polyimides",
    "hydroxyl",
    "crosslinking"
  ],
  "title": "Synthesis and Characterization of Novel Polyimide Gas Separation  Membrane Material Systems",
  "type": "Dissertation"
}