{
  "contributor_author": "Punpugdee, Nuttapon",
  "contributor_committeechair": "Olsen, Michael D.",
  "contributor_committeemember": [
    "Schmelzer, Claire D.",
    "Badinelli, Ralph D.",
    "Connolly, Daniel J.",
    "Murrmann, Suzanne K."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:15:00Z",
  "date_adate": "2005-08-18",
  "date_available": "2014-03-14T20:15:00Z",
  "date_issued": "2005-06-29",
  "date_rdate": "2006-08-18",
  "date_sdate": "2005-08-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Safety and security have emerged as a major force driving change in the multinational hotel industry. As a problem area not well-developed in the literature but considered a crucial force influencing hotel firms' value by the multinational hotel community, safety and security provide an excellent opportunity for industry professionals and academic researchers to improve the value creation of multinational hotel firms. A research need is more urgent in the upscale sector of the industry, and thus, an upscale brand of multinational hotel firm was selected for this study. This case study investigated how a multinational hotel firm developed a process of valuing its investments in safety and security for its properties under an upscale brand. This European hotel firm operates in twenty countries with a variety of business climates. The differences in the remote environments, namely the political, economic, socio-cultural, technological, and ecological environments, presented a great opportunity to gather different views regarding safety and security investments from hotel managers. The dimensions of hotel safety and security were identified by management teams running the firm's hotels to provide scope for decision-making. With this scope, the management teams continued to develop a framework for assessing the value generated from investments in safety and security by identifying the components of an investment decision-making model. A framework as a result of this exploratory study is suggested for future research where causality can be specified and a descriptive decision-making model can be built.",
  "description_provenance": [
    "Author Email: nuttapon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:00Z (GMT). No. of bitstreams: 1 NPunpugdee2005.pdf: 4100170 bytes, checksum: 05b574ee0423779d82e00d8493c16423 (MD5)   Previous issue date: 2005-06-29"
  ],
  "handle": "28598",
  "identifier_other": "etd-08102005-161746",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08102005-161746/",
  "identifier_uri": "http://hdl.handle.net/10919/28598",
  "publisher": "Virginia Tech",
  "relation_haspart": "NPunpugdee2005.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "hospitality",
    "security",
    "hotel",
    "intangibles",
    "safety",
    "investment",
    "strategic management",
    "co-alignment model",
    "strategy"
  ],
  "title": "Investigating the Process of Valuing Investments in Intangibles: A Case Study in Safety and Security in the Multinational Hotel Industry",
  "type": "Dissertation"
}