{
  "contributor_author": "Brandon, Duane",
  "contributor_committeechair": "Killough, Larry N.",
  "contributor_committeemember": [
    "Maher, John J.",
    "Sheetz, Steven D.",
    "Brown, Robert M.",
    "Stephens, Robert S."
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:15:00Z",
  "date_adate": "2003-09-05",
  "date_available": "2014-03-14T20:15:00Z",
  "date_issued": "2003-08-08",
  "date_rdate": "2005-09-05",
  "date_sdate": "2003-08-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation investigates auditor independence by examining the effects of various factors on independence, both in fact and as perceived by several distinct groups. The first study examines the effects of auditing students' cognitive moral development and client risk on students' judgments related to an audit partner's acquiescence to client pressure in an earnings management scenario. The results indicate that students with higher levels of moral reasoning evaluated earnings management as less ethical and were also less likely to accept earnings management by an audit client. The results also indicate that subjects in a high client risk scenario evaluated earnings management as less ethical and were also less likely to accept earnings management by an audit client. Furthermore, this study investigated whether client risk moderates the effect of cognitive moral reasoning on ethical judgments and behavioral intentions. The results do not indicate an interaction. \tThe second and third studies deal with potential consequences associated with the perceived impairment of auditor independence. Specifically, the second study deals with the effects of auditor-provided non-audit services on the client company's bond rating.  If financial statement users believe that auditors providing non-audit services impairs the auditor's independence, they are likely to recognize an increase in information risk associated with such impairment (Johnstone et al. 2001). This could occur regardless of the true nature of the auditor's independence and would suggest a negative relationship between the amount of non-audit services purchased from the company's auditor and the company's bond rating. The results of this study support that contention. \tThe third study investigates the effects of client importance and audit firm size on juror evaluations of auditor liability and damage awards. Previous research in accounting shows that client importance can affect sophisticated financial statement users' perceptions of auditor independence. However, no study has investigated perceptions of auditor independence in a litigation context. The results indicate that when an auditor is involved in litigation associated with an audit client that is financially more important to the auditor, jurors' evaluations of negligence are higher and they assess more in punitive damages. No effect of audit firm size on negligence ratings or damage awards is found.",
  "description_provenance": [
    "Author Email: dbrandon@vt.edu",
    "Advisor Email: jmaher@vt.edu",
    "Advisor Email: sheetz@vt.edu",
    "Advisor Email: larry@vt.edu",
    "Advisor Email: moren@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:00Z (GMT). No. of bitstreams: 1 Brandon-ETD.pdf: 590205 bytes, checksum: 6ad7c15dd8864c931765f3dd5f6e3c3f (MD5)   Previous issue date: 2003-08-08"
  ],
  "handle": "28596",
  "identifier_other": "etd-08102003-103059",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08102003-103059/",
  "identifier_uri": "http://hdl.handle.net/10919/28596",
  "publisher": "Virginia Tech",
  "relation_haspart": "Brandon-ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Juror Decision Making",
    "Bond Ratings",
    "Ethics",
    "Auditor Independence"
  ],
  "title": "Three Studies of Auditor Independence",
  "type": "Dissertation"
}