{
  "contributor_author": "Jung, Younghan",
  "contributor_committeecochair": [
    "Beliveau, Yvan J.",
    "Mills, Thomas H."
  ],
  "contributor_committeemember": [
    "Badinelli, Ralph D.",
    "O'Brien, Michael J.",
    "Wildman, Terry M."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:15:01Z",
  "date_adate": "2009-09-03",
  "date_available": "2014-03-14T20:15:01Z",
  "date_issued": "2009-07-31",
  "date_rdate": "2009-09-03",
  "date_sdate": "2009-08-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> The construction industry is inherently multidisciplinary and has adopted many intellectual and technical business improvements from other industries in an effort to optimize productivity. In construction, management inactivity is the root cause of 30% of non-productive time. This has created an opportunity and need for standardized and structured repeatable procedures for new managerial strategies.</p><p> A theoretical framework for Organizational Intelligence (OI), which encompasses the procedural ability of an organization to efficiently process, support, measure and reason through management issues, is proposed. The elements of organizational intelligence are divided into three types of intellectual capital: Human Capital, Organizational Capital, and Relational Capital. The performance of an organizational activity depends on the quality of these capitals that are available within an organization. An organization's Human Capital (HC) is the human resources within the organization that can be deployed to acquire and apply its knowledge to perform, respond, or control designated work with available organizational assets. Organizational Capital (OC) refers to the assets available to the organization to support the performance of organizational activities Relational Capital (RC), which combines human capital and organizational capital to perform, is needed specific organizational activities. </p><p>In addition, the research uses human cognitive abilities as the basis of a fundamental structure from which to form new organizational cognitive abilities that are capable of presenting management processes as critical value creations. Organizational cognitive ability is suggested to define appropriate organizational resources in order to integrate and determine a rational selection of applicable technologies and improvements. This ability can develop knowledge with interconnected variables, namely intellectual capital, managerial process, and performance, all of which support organizational intelligence. From the theoretical framework for OI, a prototype (Intelligibility Learning Model), which determines the role of relationships in an organization's operation and use of resources, is formulated. A case based research then applies the prototype to a managerial process in the construction industry. The case research demonstrates that the Intelligibility Learning Model (ILM) could be use effectively by industry decision makers to improve performance of organizational activities. The identification and application of a theoretical framework constitutes the foundation of a new managerial theory, Organizational Intelligence Management. It thus provides a fundamental foundation that explains how the construction processes, knowledge, skills, and resources used for managerial activities function. This theory contributes and establishes a better understanding of management, from organizational resources through to final production.</p>",
  "description_provenance": [
    "Author Email: younghan@vt.edu",
    "Advisor Email: yvan@vt.edu",
    "Advisor Email: ralphb@vt.edu",
    "Advisor Email: mjobrien@tamu.edu",
    "Advisor Email: wiley@vt.edu",
    "Advisor Email: thommill@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:01Z (GMT). No. of bitstreams: 1 Younghan_JungSep_09.pdf: 9248887 bytes, checksum: c21fe6787f791493158b1e21adb2adcb (MD5)   Previous issue date: 2009-07-31"
  ],
  "handle": "28604",
  "identifier_other": "etd-08102009-200607",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08102009-200607/",
  "identifier_uri": "http://hdl.handle.net/10919/28604",
  "publisher": "Virginia Tech",
  "relation_haspart": "Younghan_JungSep_09.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "organizational cognitive ability",
    "organizational intelligence",
    "organizational intelligence management",
    "intellectual capital"
  ],
  "title": "An Approach to Organizational Intelligence Management (A Framework for Analyzing Organizational Intelligence Within the Construction Process)",
  "type": "Dissertation"
}