{
  "contributor_author": "Yan, Zheng",
  "contributor_committeechair": "Rosenthal, Stuart",
  "contributor_committeemember": [
    "Ashley, Richard A.",
    "Ye, Keying",
    "Spanos, Aris",
    "Salehi-Isfahani, Djavad",
    "Murphy, Russell D."
  ],
  "contributor_department": "Economics (Arts and Sciences)",
  "date_accessioned": "2014-03-14T20:15:02Z",
  "date_adate": "1999-08-14",
  "date_available": "2014-03-14T20:15:02Z",
  "date_issued": "1999-07-23",
  "date_rdate": "2000-08-14",
  "date_sdate": "1999-08-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This paper examines the extent to which thin markets in conjunction with tax induced kinks in the budget constraint cause consumer demand to be skewed. To illustrate the principles I focus on the demand for owner-occupied housing. Housing units are indivisible and heterogeneous while tastes for housing are at least partly idiosyncratic, causing housing markets to be thin. In addition, prior to 1998, capital gains tax provisions introduced a sharp kink in the budget constraint of existing owner-occupiers in search of a new home: previous homeowners under age 55 paid no capital gains tax if they bought up, but were subject to capital gains tax if they bought down.  I first characterize the economic conditions under which households err on the up or down side when choosing a home in the presence of a thin market and a kinked budget constraint. I then specify an empirical model that takes such effects into account. Results based on Monte Carlo experiments indicate that failing to allow for skewness in the demand for housing leads to biased estimates of the elasticities of demand when such skewness is actually present. In addition, estimates based on American Housing Survey data suggest that such bias is substantial: controlling for skewness reduces the price elasticity of demand among previous owner-occupiers from 1.6 to 0.3. Moreover, 58% of previous homeowners err on the up while only 42% err on the down side. Thus, housing demand is skewed.",
  "description_provenance": [
    "Author Email: zyan@vt.edu",
    "Advisor Email: ashleyr@vt.edu",
    "Advisor Email: Ssrsnthl@aol.com",
    "Advisor Email: keying@vt.edu",
    "Advisor Email: aris@vt.edu",
    "Advisor Email: salehi@vt.edu",
    "Advisor Email: rdmurphy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:02Z (GMT). No. of bitstreams: 1 ETD.pdf: 408653 bytes, checksum: a04989c24502f5fee46fbb8f39a9f191 (MD5)   Previous issue date: 1999-07-23"
  ],
  "handle": "28606",
  "identifier_other": "etd-081099-142140",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-081099-142140/",
  "identifier_uri": "http://hdl.handle.net/10919/28606",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Heterogeneity Error",
    "Convex Budget Set",
    "Measurement Error",
    "Thin Market",
    "Skewness",
    "Two-Error Demand Model",
    "Kink",
    "Housing Demand",
    "Piecewise-Linear Budget Constraint"
  ],
  "title": "The Econometrics of Piecewise Linear Budget Constraints With Skewed Error Distributons: An Application To Housing Demand In The Presence Of Capital Gains Taxation",
  "type": "Dissertation"
}