{
  "contributor_author": "Welling, David Keith",
  "contributor_committeecochair": [
    "Parson, Stephen R.",
    "Earthman, Glen I."
  ],
  "contributor_committeemember": [
    "Hixson, Larry",
    "Richards, Robert R.",
    "Sughrue, Jennifer A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:15:02Z",
  "date_adate": "1999-09-18",
  "date_available": "2014-03-14T20:15:02Z",
  "date_issued": "1999-07-07",
  "date_rdate": "2000-09-18",
  "date_sdate": "1999-08-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The question of advisory group effectiveness continues to be a topic for discussion and research.  As these groups have been organized to study and give recommendations on a diversity of issues, questions have arisen in relationship to their ability to impact educational decision making.   The purpose of this research was to examine the perceptions of effectiveness held by members of a Citizen Advisory Committee and by members of a school board in relationship to the committee's ability to complete tasks as requested by the school board.  Data were gathered from members of the Citizen Advisory Committee and the school board through the use of a questionnaire and individual interviews.  Data analysis revealed concerns in relationship to the clarity and number of tasks assigned by the school board, membership on the committee, feedback from the school board, and the future of the advisory committee.   In conclusion, citizen advisory councils can be an effective avenue to involve the community in the operation of schools when given appropriate education and support.",
  "description_provenance": [
    "Author Email: dwelling@wpia.net",
    "Made available in DSpace on 2014-03-14T20:15:02Z (GMT). No. of bitstreams: 2 WELLINGVITA.PDF: 2676 bytes, checksum: cfb1aabfca61c2abe551d91d7c06c189 (MD5) etd.pdf: 260858 bytes, checksum: fbd3565cce9bbdc1f5cb198fa063c5e2 (MD5)   Previous issue date: 1999-07-07"
  ],
  "handle": "28609",
  "identifier_other": "etd-081099-223601",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-081099-223601/",
  "identifier_uri": "http://hdl.handle.net/10919/28609",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "WELLINGVITA.PDF",
    "etd.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": "advisory committee effectiveness",
  "title": "A Qualitative Study to Examine The Effectiveness of a Citizen Advisory Committee",
  "type": "Dissertation"
}