{
  "contributor_author": "Ballein, John A.",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Krouscas, James A. Jr.",
    "Burton, John K.",
    "Bolin, Delmas",
    "Stratton, Richard K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:15:01Z",
  "date_adate": "2006-09-06",
  "date_available": "2014-03-14T20:15:01Z",
  "date_issued": "2006-07-27",
  "date_rdate": "2007-09-06",
  "date_sdate": "2006-08-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Weighing the Options:  Assessing Two-A-Day Practices in Collegiate Football  John A. Ballein  Abstract  The following study examined the effectiveness and administrative implications of Virginia Tech football's two-a-day practice schedule changes.  More specifically, the research examined the relationship between weight loss and hydration as associated with two-a-day practices and studied the deviation with relations to practice patterns.  Participants included members of the Virginia Tech Football team for the years 2001, 2002, 2003, and 2004. All participants were examined by the team physician and declared fit to participate in Division IA NCAA collegiate football. Measures included the amount of weight loss and the number of heat related incidences (i.e. heat illness and IV fluid administration) from 2001 through 2004 seasons to determine if a change in practice patterns could reduce or minimize heat related illnesses.   There were numerous findings from the study to suggest that the changes in NCAA and Virginia Tech two-a-day practice policies were successful in the prevention of heat related incidences and improving the overall safety for the participants. This study concluded that the overall weight loss among players decreased in accordance with the mandated practice changes.  In addition, the number of heat related illnesses decreased from 2001 to 2004.  Upon examination of these factors, it can be concluded that the practice schedule changes have in fact, been effective at decreasing weight loss/hydration among players and preventing heat related illness. These findings can be used by athletic administrators to further develop athletic policies that will ensure the safety of student athletes involved in collegiate football during extreme environmental conditions.  In addition, this study displays the cost effectiveness of both medical personnel and hydration supplies in the reduction of heat related illnesses during two a day practice sessions.",
  "description_provenance": [
    "Author Email: jballein@vt.edu",
    "Advisor Email: jkrousca@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: techmd@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:01Z (GMT). No. of bitstreams: 1 Dissertation1.pdf: 301789 bytes, checksum: 2e4ef51af45161ec641b6efdbfc4a0bf (MD5)   Previous issue date: 2006-07-27"
  ],
  "handle": "28600",
  "identifier_other": "etd-08102006-104427",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08102006-104427/",
  "identifier_uri": "http://hdl.handle.net/10919/28600",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "hydration",
  "title": "Weighing the Options: Assessing Two-A-Day Practices in Collegiate Football",
  "type": "Dissertation"
}