{
  "contributor_author": "Lakel, William",
  "contributor_committeechair": "Aust, Wallace Michael",
  "contributor_committeemember": [
    "Wynn, Theresa M.",
    "Prisley, Stephen P.",
    "Keyser, Patrick D.",
    "Dolloff, C. Andrew"
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:15:04Z",
  "date_adate": "2008-09-04",
  "date_available": "2014-03-14T20:15:04Z",
  "date_issued": "2008-07-07",
  "date_rdate": "2008-09-04",
  "date_sdate": "2008-08-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The major study objectives include determining if a 50-foot streamside management zone (SMZ) as described in the Virginia BMP Manual (VDOF 2002) is generally sufficient to protect stream water quality, riparian soils, and stream bank integrity in headwater streams where forest harvesting has taken place, as well as comparing other SMZ widths with regard to the same environmental protection performance.  In 2003, 16 forested watersheds were clear-cut harvested for commercial timber production.  Four SMZ treatments were installed across four experimental blocks during harvest.  Each of the 16 watersheds was subsequently site-prepared with prescribed burning and planted with loblolly pine (Pinus taeda).  Within the watersheds, the established treatments were a 100-foot width with no thinning, a 50-foot width without thinning, a 50-foot width with thinning, and a 25-foot \"stringer.â    Each of the four treatments was conducted within three of four blocks (Incomplete Block Design).  After a two-year post-harvest monitoring period, it was determined that the SMZ treatments had no significant effect on water quality, channel geometry, or soil erosion in and around the streams.  There was no apparent water quality degradation as a result of harvesting timber, and larger SMZs did not have an impact on any of the parameters studied.  It was also apparent that leaving narrower SMZs or thinning within SMZs did not cause any apparent environmental degradation.  It was also determined that landowners who leave SMZs on their property have very limited opportunities to manage timber within them for financial gain in the long term.",
  "description_provenance": [
    "Author Email: william.lakel@dof.virginia.gov",
    "Advisor Email: tesswynn@vt.edu",
    "Advisor Email: prisley@vt.edu",
    "Advisor Email: pdkeyser@vt.edu",
    "Advisor Email: adoll@vt.edu",
    "Advisor Email: waust@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:04Z (GMT). No. of bitstreams: 1 LakelETD2.pdf: 2303631 bytes, checksum: 2ee17befe1e7dd6dc74f462b88287c9c (MD5)   Previous issue date: 2008-07-07"
  ],
  "handle": "28619",
  "identifier_other": "etd-08112008-143920",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08112008-143920/",
  "identifier_uri": "http://hdl.handle.net/10919/28619",
  "publisher": "Virginia Tech",
  "relation_haspart": "LakelETD2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "stream buffers",
    "riparian management",
    "headwater streams",
    "timber management",
    "soil erosion",
    "water quality",
    "streamside management zones"
  ],
  "title": "Effects of Forestry Streamside Management Zones on Stream Water Quality, Channel Geometry, Soil Erosion, and Timber Management in the Virginia Piedmont",
  "type": "Dissertation"
}