{
  "contributor_author": "Mathur, Piyush",
  "contributor_committeechair": "Luke, Timothy W.",
  "contributor_committeemember": [
    "Hatfield, Leonard L.",
    "La Berge, Ann F.",
    "Siegle, Robert B.",
    "Halfon, Saul E.",
    "Fuhrman, Ellsworth R."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:15:03Z",
  "date_adate": "2003-08-21",
  "date_available": "2014-03-14T20:15:03Z",
  "date_issued": "2003-07-28",
  "date_rdate": "2006-08-21",
  "date_sdate": "2003-08-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this dissertation, I make a theoretical exploration into the mass communication of ecological issues, a phenomenon bound to become increasingly important through the on-going dual process of economic-cum-ecological globalization and information revolution. Such an  exploration is warranted, first, because, despite the highly visible coexistence of global warming and the digital divide on the same world-stage, sociohumanistic research generally has continued to focus on ecology and (mass) communication in their mutual separation. Since interconnections of ecology and communication have received attention from only a limited number of media analysts and environmentally sensitive journalists, mass communication of ecological issues is as yet an under-examined theme. Secondly, the scarce research on the topic - though it has occasionally been done and shared under the generalized rubric of environmental or ecological communication (EC) - actually amounts to little more than disparate case studies and empirical reports related to risk and hazard communication, disaster communication, environmental journalism, or science journalism. In other words, mainstream research on communication of ecological matters falls short of a theoretical exploration into the probable interfaces between ecology and communication, pointing to the research community's overall complacency with uncoordinated and narrowly-framed case studies. Furthermore, the majority of existing EC accounts represent a positivistic, solution provider's ideology, even though they are invested in the progressive cause of environmentalism. They generally accept the media as a probative solution to ecologically suspect acts of the State or corporate sector, and are not particularly invested in the speculative realm of possible silences that may characterize the communicative landscapes of global ecologies. I contend that the issues neglected by EC researchers have already been delved into independently - even though to unrelated ends - by thinkers from other more mature discourses such as communication systems theory, development studies, philosophy and sociology of technology, political theory, and cultural and literary theories. Engaging with selected contributions from the above discourses, and drawing from the approaches of critical traditionalism on one hand, and semiotics, on the other, I attempt to go beyond EC's erstwhile media focus by theorizing EC critically. As part of that effort, I postulate and develop upon the following analytical and theoretical axes: (1) technology; (2) the nation-state; and (3) and development. I devote exclusive sections to two of the above components: against the general background of development.",
  "description_provenance": [
    "Author Email: pmathur@vt.edu",
    "Advisor Email: Len.Hatfield@vt.edu",
    "Advisor Email: alaberge@vt.edu",
    "Advisor Email: bob.siegle@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Advisor Email: shalfon@vt.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:03Z (GMT). No. of bitstreams: 13 CVphd.pdf: 131607 bytes, checksum: 8a1c0cb4926be64892fa6532fee0130e (MD5) chap7.pdf: 65343 bytes, checksum: 450ed2f59d6457c76dc2ebf972d66640 (MD5) appendix.pdf: 301035 bytes, checksum: 5495976570b5449844fcedf8d0b7aa70 (MD5) Bibliography.pdf: 91371 bytes, checksum: 55c830b4a24ee51d594e255c6b90e9a3 (MD5) chap3.pdf: 140754 bytes, checksum: 0870ae864cda0290f3c807a01acb6c35 (MD5) chap6.pdf: 136540 bytes, checksum: 15d2332e90a8fb2a30226f419765bbe8 (MD5) chap5.pdf: 225239 bytes, checksum: b4f8cad37df7306bf08b9e564a44f1f2 (MD5) abstract.pdf: 54831 bytes, checksum: 2c38c92fd4c8f53624fe519ba2c5d3bb (MD5) Acknow.pdf: 59500 bytes, checksum: ec9e34323d12c4ae8d6ad983869ea6c5 (MD5) chap2.pdf: 156441 bytes, checksum: 990bd400771a45fa5b53556a2003d635 (MD5) chap1.pdf: 172306 bytes, checksum: 5ba1db4e5a813eceb24ef88624d2ab25 (MD5) Preface.pdf: 91360 bytes, checksum: f63c7958302f8575a3b2ca6484f78c4c (MD5) chap4.pdf: 202321 bytes, checksum: 15a0b9edafe0f0d9feee5ae0aabce465 (MD5)   Previous issue date: 2003-07-28"
  ],
  "handle": "28613",
  "identifier_other": "etd-08112003-175921",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08112003-175921/",
  "identifier_uri": "http://hdl.handle.net/10919/28613",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CVphd.pdf",
    "chap7.pdf",
    "appendix.pdf",
    "Bibliography.pdf",
    "chap3.pdf",
    "chap6.pdf",
    "chap5.pdf",
    "abstract.pdf",
    "Acknow.pdf",
    "chap2.pdf",
    "chap1.pdf",
    "Preface.pdf",
    "chap4.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "Ecology; Communication; Ecological Communication;",
  "title": "Theorizing \"Ecological Communication\"",
  "type": "Dissertation"
}