{
  "contributor_author": "Treiber, Kimberly Hoffer",
  "contributor_committeechair": "Staniar, William Burton",
  "contributor_committeecochair": [
    "Kronfeld, David S.",
    "Geor, Raymond J."
  ],
  "contributor_committeemember": [
    "Boston, Ray",
    "Davy, Kevin P."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:15:03Z",
  "date_adate": "2006-10-16",
  "date_available": "2014-03-14T20:15:03Z",
  "date_issued": "2006-08-02",
  "date_rdate": "2006-10-16",
  "date_sdate": "2006-08-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Glucose is a fundamental energy source, the utilization and regulation of which impacts exercise performance and health. These studies have used modeling techniques to evaluate glucose kinetics and dynamics in equids and developed tests to evaluate the status of glucose metabolism. In Part I, 12 exercise-trained Arabians underwent insulin-modified FSIGT (with minimal model analysis) and single-injection glucose tracer (with compartmental analysis) studies at rest and during exercise to evaluate the effects of exercise on glucose kinetics and dynamics. These geldings were maintained on pasture, but adapted for 4 months to twice-daily feeding of feeds rich in sugar and starch (SS, n=6: NSC 45%, Fat 3%, NDF 24%) or fat and fiber (FF, n=6:NSC 13%, Fat 11%, NDF 45% ). Exercise increased insulin sensitivity (P = 0.070) and glucose transport (P < 0.038). Although variables were not different between FF and SS horses at rest, during exercise SS horses tended to have lower (P = 0.085) insulin sensitivity and increased (P = 0.043) glucose utilization compared to FF horses. In Part II, satisfactory proxies for minimal model parameters were developed to facilitate the evaluation of insulin sensitivity in larger populations. These proxies were applied to a population of 163 ponies and used to characterize metabolic differences between ponies predisposed to pasture laminitis (PL) from ponies not predisposed (NL). A subset of 14 ponies (7 PL, 7 NL) also underwent the FSIGT for minimal model analysis. Ponies predisposed to laminitis were found to have lower insulin sensitivity (P < 0.007) and higher insulin secretory response (P < 0.045) by both the minimal model and proxies, and higher (P < 0.001) circulating triglycerides and body condition score. Cut-point analysis for these variables was used to define a pre-laminitic metabolic syndrome with total predictive power of 78% to identifity ponies at risk for developing pasture laminitis. Increased insulin resistance and prevalence of lamintis were associated with increased non-structural carbohydrates in spring pasture. These studies demonstrate the importance of glucose regulation for exercise and animal health. When glucose regulation is altered in the case of insulin resistance, performance could be impacted and diseases such as laminitis may occur. Insulin resistance may be moderated by exercise or by avoiding sugar and starch in feeds and pasture.",
  "description_provenance": [
    "Author Email: ktreiber@vt.edu",
    "Advisor Email: kronfeld@pemtel.net",
    "Advisor Email: rgeor@vt.edu",
    "Advisor Email: wstaniar@vt.edu",
    "Advisor Email: drrayboston@yahoo.com",
    "Advisor Email: kdavy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:03Z (GMT). No. of bitstreams: 1 khtdissertationETD4.pdf: 4747437 bytes, checksum: 8d5dee04235e8e34fdd1b5e38a9ddbf8 (MD5)   Previous issue date: 2006-08-02"
  ],
  "handle": "28616",
  "identifier_other": "etd-08112006-094159",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08112006-094159/",
  "identifier_uri": "http://hdl.handle.net/10919/28616",
  "publisher": "Virginia Tech",
  "relation_haspart": "khtdissertationETD4.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "insulin sensitivity",
    "glycemic dietetics",
    "kinetics",
    "laminitis",
    "horse",
    "minimal model",
    "endurance exercise"
  ],
  "title": "Glucose disposal and insulin sensitivity at rest and during exercise in trained horses adapted to different dietary energy sources and in association with laminitis in ponies",
  "type": "Dissertation"
}