{
  "contributor_author": "Cavadas, Francisco Troitino",
  "contributor_committeechair": "Anderson, Mark R.",
  "contributor_committeecochair": "Deck, Paul A.",
  "contributor_committeemember": [
    "Carlier, Paul R.",
    "Morris, John R.",
    "Hanson, Brian E."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:15:02Z",
  "date_adate": "2003-09-12",
  "date_available": "2014-03-14T20:15:02Z",
  "date_issued": "2003-06-13",
  "date_rdate": "2004-09-12",
  "date_sdate": "2003-08-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "4-(12-mercaptododecyloxy)phenol (1), 3-(12-mercaptododecyloxy)phenol (2), 4-(12-mercaptododecyl)phenol (3), 4-(12-mercapto-dodecyl)phenol (4), 12-phenyldodecyl-mercaptan (5), 12-phenylundecyoxymercaptan (6), 4-(6-mercapto-hexyl)phenol (7), and 4-(12-mercaptododecyloxy)phenol (8) were synthesized.  The thiol products were characterized by NMR, HRMS, and elemental analysis.  Self-assembled monolayers (SAMs) on gold substrates were prepared from thiols 1-8, and the resulting monolayer surfaces were analyzed using Reflectance Absorbance Infrared Spectroscopy (RAIRS), contact angle goniometry, ellipsometry, reductive desorption cyclic voltametry, and impedance spectroscopy.    Several aromatic C-C vibrational frequencies in the RAIRS spectra, for SAMs of 1-8, reveal a dependence of peak intensity on substitution regiochemistry of the aromatic ring.  This result suggests that the orientation of the aromatic ring changes with substitution.  Peak intensity, and peak widths of alkyl C-H vibrational features in the RAIRS spectra also reveal a dependence of the environment of the alkyl chain on structure of thiols 1-8.  Meta-substitution seems to significantly alter the projection of the terminal -OH group relative to para-substitution.    Contact angles were obtained for each SAM surface using water, glycerol, and ethylene glycol.  From the contact angle data, Zisman and Fowkes analyses were performed in order to determine surface free energy values and also to determine the dispersive contribution to the surface energy.  The energy values obtained from the Zisman plots as well as the dispersive contributions obtained from the Fowkes plots suggest a dependence of surface energy on substitution regiochemistry of the aromatic ring.  The results are consistent with the interpretation of the RAIRS spectra as they relate to the effect substitution regiochemistry has on SAM structure and interfacial properties.     The results of the reductive desorption measurements performed on each monolayer surface, indicate that changes in substitution regiochemistry do not seem to affect the surface coverage of SAMs 1-8.  Desorption potentials however, are affected by the structure of the thiols composing the SAM, which suggests that the lateral stability resulting from interactions of the terminal groups and alkyl chains, is different for each monolayer surface.   Specifically SAMs of 12-phenyldodecylmercaptan (5) and SAMs of 4-(12-mercaptododecyloxy)phenol (1) seem to be more stable due to interactions of the terminal aromatic ring in SAMs of (5) and due to an increase in van der Waals interactions in SAMs of (1).    Film thicknesses, as determined by ellipsometry, also suggest that meta-substitution of the aromatic ring results in lower thicknesses for SAMs of (4), which is consistent with the interpretation of the structural changes resulting from meta-substitution, suggested by the interpretation of the RAIRS spectrum of SAMs of (4).  Thickness measurements also indicate that most of the functionalized SAMs (1-4, 7, 8) react with OTS, which suggests the terminal -OH group is not shielded at the interface and is available for reaction.  Following reaction with OTS the RAIRS spectra of the reacted surfaces reveal structural changes to the underlying SAM.  Impedance spectroscopic measurements performed on SAMs of 1-8 reveal what seems to be a correlation between the orientation of the aromatic ring and the resistance properties of the SAM.  It appears meta-substitution of the ring lowers the monolayers ability to resist electron transfer. These data suggest that meta-substitution of the aromatic ring has a significant impact upon the structure of the resulting monolayer relative to monolayers composed of para-substituted molecules. The data also suggests that there is a correlation between molecular structure and interfacial properties particularly as it relates to surface energy and reactivity.  Small atomic changes in the molecules composing the SAM result in measurable differences in macroscopic properties of the interface.  It is important to recognize the need for understanding structure-property relationships in self-assembled monolayers particularly if logical design of surfaces is to be achieved and applied towards solving problems associated with corrosion and adhesion of metal surfaces.",
  "description_provenance": [
    "Author Email: fcavadas@yahoo.com",
    "Advisor Email: pcarlier@vt.edu",
    "Advisor Email: mander6@vt.edu",
    "Advisor Email: pdeck@vt.edu",
    "Advisor Email: jrmorris@vt.edu",
    "Advisor Email: hanson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:02Z (GMT). No. of bitstreams: 1 FCThesis.pdf: 2324286 bytes, checksum: ceba9b230249ce21246ccc483b76dc6a (MD5)   Previous issue date: 2003-06-13"
  ],
  "handle": "28611",
  "identifier_other": "etd-08112003-114341",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08112003-114341/",
  "identifier_uri": "http://hdl.handle.net/10919/28611",
  "publisher": "Virginia Tech",
  "relation_haspart": "FCThesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "synthesis",
    "monolayers",
    "Alkanethiols",
    "SAMs",
    "self-assembled monolayers",
    "Reductive desorption",
    "RAIRS"
  ],
  "title": "Spectroscopic and electrochemical investigation of phenyl, phenoxy, and hydroxyphenyl-terminated alkanethiol monolayers",
  "type": "Dissertation"
}