{
  "contributor_author": "Lapointe, Nicolas WR",
  "contributor_committeechair": "Angermeier, Paul L.",
  "contributor_committeemember": [
    "Dolloff, C. Andrew",
    "Murphy, Brian R.",
    "Light, Theo"
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:15:04Z",
  "date_adate": "2010-09-15",
  "date_available": "2014-03-14T20:15:04Z",
  "date_issued": "2010-07-14",
  "date_rdate": "2010-09-15",
  "date_sdate": "2010-08-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nonnative fishes are a major threat to biodiversity and new species continue to be introduced.  In this dissertation, I described patterns and assessed determinants of fish invasions in the Mid-Atlantic region of the United States.  Data on nonnative fish distributions were obtained from the United States Geological Surveyâ  s Nonindigenous Aquatic Species Database (NASD). Nonnative fishes are introduced by a variety of pathways, and prevention efforts can be optimized by focusing on pathways posing the greatest risk of new invasions.  To assess the importance of existing pathways, I described the species associated with each pathway, analyzed the number of species introduced by decade for certain pathways, and estimated the detectability and probability of establishment of species introduced by each pathway.  Additionally, I reviewed the efficacy of existing regulations for preventing introductions via each pathway.  Historically, the intentional introduction of centrarchids and salmonids for sport was the dominant pathway.  Pathways currently posing the greatest risks included bait release, illegal introductions, stocking of private ponds, and several pathways associated with economic activities.  These pathways involved cyprinids, catostomids, and species exotic to North America.  Regulations varied considerably among states, and I suggest that region-wide prohibitions on the release of nonnative species into the wild would help prevent additional introductions. Mid-Atlantic region watersheds differ considerably in nonnative species richness (NNSR), suggesting they are not equally invasible.  I analyzed relationships between ecosystem characteristics and invasibility by compiling data on watershed characteristics and correlating these with NNSR.  I included measures of colonization pressure (i.e., the number of species introduced) and research effort, which can bias patterns of NNSR.  After controlling for these factors, the range in elevation in a watershed explained the greatest variation in NNSR.  Highland watersheds had greater NNSR, probably because of greater habitat heterogeneity due in part to human activity.  I suggest that NNSR can be reduced by restoration activities that reduce the diversity of artificial habitats available in highland watersheds. Ecosystems with similar NNSR may be invaded by different species, because differences in ecosystem characteristics may regulate the types of species that are able to establish.  To explain differences in nonnative species among ecosystem types, I grouped Mid-Atlantic region watersheds by nonnative community and tested for differences in ecosystem characteristics among groups.  Four groups were identified.  A large, speciose group in the north-west portion region was characterized by smallmouth bass (Micropterus dolomieu).  A large, speciose group in the south-west portion of the region was characterized by largemouth bass (Micropterus salmoides).  Two smaller groups with few species were found on the coastal plain; one to the north, characterized by black crappie (Pomoxis nigromaculatus) and a second to the south characterized by white crappie (Pomoxis annularis).  Nonnative community type was correctly predicted 80% of the time by models based on temperature and range in elevation.  Relatively uninvaded watersheds in the south-east part of the region were predicted to host the most diverse nonnative community, suggesting that risks of invasion are high there.  These results demonstrate the importance of species identity in determining ecosystem invasibility. There is no consensus on how to estimate the relative impacts of nonnative species.  I developed and compared several approaches for doing so.  I estimated impact by surveying fish biologists regarding the abundance and socioeconomic and ecological impacts of each species.  I obtained fish collection records as an additional estimate of abundance and consulted reports of impacts in the NASD.  I consulted reports of impacts in global invasive species databases as a basis for comparison.  I compared top-ranked species among approaches, and game and non-game biologistsâ   ratings of game and non-game species for each survey question.  Top-ranked species differed considerably among approaches.  Non-game biologists gave higher ecological impact ratings to both game and non-game species.  Approaches assessing socioeconomic impacts are most appropriate for informing social decisions, such as restricting the possession or trade of a species.  A combination of data from approaches assessing ecological impacts and abundance is most appropriate for studies of ecological patterns, such as testing for differences in traits between high- and low-impact species.  These approaches are transferrable to other regions and taxa, and can inform management decisions and improve efforts to identify factors correlated with high-impact invaders. Collectively, my results can aid in reducing the effects of nonnative fish invasions by enabling managers to focus prevention efforts on high-impact species likely to invade particular ecosystems via known pathways.  For example, bait releases, illegal introductions, private stocking, and several pathways associated with economic activities present the highest risks of future invasions, and warrant attention aimed at preventing invasions.  Prevention could also be focused on several watersheds in the south-east part of the region, which currently have few established species but were predicted to be invasible by bluegill (Lepomis gibbosus), bluntnose minnow (Pimephales notatus) channel catfish (Ictalurus punctatus), and warmouth (Lepomis gulosus).  This work represents major advancements in invasion biology, including new links between species identity and ecosystem invasibility and the development of methods for quantifying impact. â",
  "description_provenance": [
    "Author Email: lapointe@vt.edu",
    "Advisor Email: adoll@vt.edu",
    "Advisor Email: murphybr@vt.edu",
    "Advisor Email: biota@vt.edu",
    "Advisor Email: tsligh@ship.edu",
    "Made available in DSpace on 2014-03-14T20:15:04Z (GMT). No. of bitstreams: 2 IRB_approval_letter.pdf: 238928 bytes, checksum: a0bb2dadda69aa1f7c139aedb9f73fc2 (MD5) Lapointe_NWR_D_2010.pdf: 2424425 bytes, checksum: 79b406da6957240f27140b73d51b9c4d (MD5)   Previous issue date: 2010-07-14"
  ],
  "handle": "28621",
  "identifier_other": "etd-08112010-154839",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08112010-154839/",
  "identifier_uri": "http://hdl.handle.net/10919/28621",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "IRB_approval_letter.pdf",
    "Lapointe_NWR_D_2010.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "assemblage",
    "richness",
    "pathways",
    "ecosystem",
    "impact",
    "community",
    "freshwater",
    "invasibility",
    "invasive",
    "introduced species",
    "nonnative"
  ],
  "title": "Fish invasions in the Mid-Atlantic region of the United States",
  "type": "Dissertation"
}