{
  "contributor_author": "Dawson, Robert Donald",
  "contributor_committeechair": "Peterson, Everett B.",
  "contributor_committeemember": [
    "Ball, Sheryl B.",
    "Shobe, William",
    "Stephenson, Stephen Kurt",
    "Lutz, Nancy A."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:15:05Z",
  "date_adate": "2003-08-21",
  "date_available": "2014-03-14T20:15:05Z",
  "date_issued": "2003-07-25",
  "date_rdate": "2003-08-21",
  "date_sdate": "2003-08-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Vertical integration has received much attention in the last 25 years and there are well-known theories that explain this behavior.  However, the one common thread that runs through virtually all of this research is the assumption of private property rights.  Very little attention has been paid to how firms behave when the property rights structure under which they operate changes.  The commercial fishing industry is a prime example of an industry where property rights have shifted.  Due to problems of over-fishing and over-capitalization, economists have championed the conversion of fisheries from common property or open access resources, to private property through the use of quota programs. <p> Research shows that quota management is effective in reducing capitalization in fisheries, yet there are questions about other effects the programs might have.  Among these is a concern over increased vertical integration.  Some argue that this is leading to a loss of the independent fisherman that is a part of U.S. history, much like family farms.  There is also concern that increased vertical integration is in turn leading to decreased competition in these markets; by owning the quota that is required to fish, processors are increasing their power over the market for unprocessed fish.  In response to these and other concerns, the United States Congress imposed a moratorium on the implementation of individual transferable quota-style (ITQ) programs in 1996.  Speculation aside, however, there is no empirical evidence to confirm or refute that the use of quota management actually leads to increased vertical coordination. <p> Three fisheries are used as case studies to analyze what affects the decision to vertically coordinate in commercial fisheries.  The traditional reasons for vertical integration are to lower transaction costs or to foreclose a market.  But now a new factor, shifting property rights, is also considered.  Results indicate that the individual characteristics of the fishery are more important than the management or property rights regime itself.  This gives some direction to designing management programs that meet our desire to reduce over-capitalization and over-fishing, yet avoid increasing vertical coordination, all the while minimizing the loss of resource rent in the fishery.",
  "description_provenance": [
    "Author Email: rdawson2@washcoll.edu",
    "Advisor Email: sball@vt.edu",
    "Advisor Email: petrsone@vt.edu",
    "Advisor Email: wshobe@dpb.state.va.us",
    "Advisor Email: kurts@vt.edu",
    "Advisor Email: nlutz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:05Z (GMT). No. of bitstreams: 2 Title_and_Abstract.pdf: 22007 bytes, checksum: 3307c212c55c3fa3aac8d2f19fef181d (MD5) Dawson_Dissertation.pdf: 1220514 bytes, checksum: 6c6beb5fbfdec4bb5f09c00c4d22deff (MD5)   Previous issue date: 2003-07-25"
  ],
  "handle": "28627",
  "identifier_other": "etd-08122003-121419",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08122003-121419/",
  "identifier_uri": "http://hdl.handle.net/10919/28627",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Title_and_Abstract.pdf",
    "Dawson_Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Regulation",
    "Fisheries",
    "Vertical Integration",
    "Environmental Economics",
    "Natural Resource Management"
  ],
  "title": "Vertical Integration in Commercial Fisheries",
  "type": "Dissertation"
}