{
  "contributor_author": "Cauthen, Sandra Dalton",
  "contributor_committeecochair": [
    "Underhill, Robert G.",
    "Kelly, Patricia Proudfoot"
  ],
  "contributor_committeemember": [
    "Burton, John K.",
    "Magliaro, Susan G.",
    "Spaulding, Raymond"
  ],
  "contributor_department": "Curriculum and Instruction Mathematics",
  "date_accessioned": "2014-03-14T20:15:06Z",
  "date_adate": "2003-08-25",
  "date_available": "2014-03-14T20:15:06Z",
  "date_issued": "2003-06-24",
  "date_rdate": "2003-08-25",
  "date_sdate": "2003-08-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract Sandra Dalton Cauthen An operational definition of Systemic Reform is used to document a case study of mathematics education reforms occurring in the mathematics classrooms of one middle school in one school division in one state. The middle school had two lead teachers who participated in the training component of a National Science Foundation-funded state-wide Systemic Reform Initiative.  <p> Systemic Reform conceptualized reform as combining bottom-up reform with top-down support. Therefore, the research methodology confronted the challenges of the breadth and complexity of Systemic Reform through the use of selective data in the form of artifacts, interviews, and observations from four populations: (1) classroom teachers, (2) building administrators, (3) district administrators, and (4) state-level staff. <p> \tThe study was conducted at four levels over a five-year period to provide the focus for longitudinal data collection to document: (1) the status of mathematics education during the 1995-96 primary data collection year, (2) the evolution of mathematics education reform over the course of the five year period, and (3) the manner in which Systemic Reform occurred. <p> \tAll levels of educators involved made an initial five-year commitment as active participants in the State's Systemic Reform Initiative, but only the Lead Teacher actually carried through with this commitment. After the first year division-level administrators shifted the focus of reform efforts to the elementary schools and discontinued support for the middle schools; after the second year both the division and state-level administrators withdrew all support. Although changes were made at the school level which supported reform in mathematics education (i.e., adoption of constructivist-type instructional materials, purchase of classroom sets of manipulatives and calculators, implementation of block scheduling, and the organization of teachers in interdisciplinary teams) the necessary changes in technology, curriculum and assessment were not in place to support the reform efforts. Through the perseverance of the Lead Teacher some changes in mathematics classrooms were documented, but the lack of consistent administrative leadership/support and emphasis on multiple reforms ended in the all to common bandwagon phenomena at the building, division and state levels so characteristic of change efforts in schools.",
  "description_provenance": [
    "Author Email: cauthen@i-plus.net",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: bobunderh@aol.com",
    "Advisor Email: rspaulding@aol.com",
    "Advisor Email: kelly@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:06Z (GMT). No. of bitstreams: 3 Dissertationpart2.pdf: 1536285 bytes, checksum: a9677adc556cf1feae65311a8d759ca1 (MD5) VITA.pdf: 43825 bytes, checksum: d349422eb2ce2b7cc7f73b2a8c24bdcb (MD5) Dissertationpart1.pdf: 738260 bytes, checksum: 73270fcf6609ba9b133b20dd66d1d024 (MD5)   Previous issue date: 2003-06-24"
  ],
  "handle": "28628",
  "identifier_other": "etd-08122003-170407",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08122003-170407/",
  "identifier_uri": "http://hdl.handle.net/10919/28628",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertationpart2.pdf",
    "VITA.pdf",
    "Dissertationpart1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "middle school mathematics teaching",
    "constructivist mathematics",
    "qualitative research",
    "longitudinal case study",
    "systemic refrom",
    "lead teachers"
  ],
  "title": "Documenting Systemic Reform in Mathematics:  A Case Study of One Middle School",
  "type": "Dissertation"
}