{
  "contributor_author": "Marsh, Fulya Aydinalay",
  "contributor_committeechair": "Janosik, Steven M.",
  "contributor_committeemember": [
    "Burge, Penny L.",
    "Ridgwell, Diana M.",
    "Wildman, Terry M."
  ],
  "contributor_department": "Higher Education",
  "date_accessioned": "2014-03-14T20:15:05Z",
  "date_adate": "2012-09-13",
  "date_available": "2014-03-14T20:15:05Z",
  "date_issued": "2012-08-06",
  "date_rdate": "2012-09-13",
  "date_sdate": "2012-08-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The number of international graduate students coming to the U.S. to attend American colleges and universities is growing. In 2010 alone, over 20,000 Middle Eastern Graduate students (MEGS) were studying in U.S. universities (Bhandari & Chow, 2010). The purpose of this phenomenological study was to gain an understanding of how MEGS experienced the transition from their home to the host culture and recommend how to help them with it. The conceptual framework used in this study was a comprehensive transition model incorporating Schlossberg et al.â  s 4S Transition Model (1995) with the main ideas from Chickeringâ  s Vectors of Adult Development (1969), Furnham and Bochnerâ  s Social Skills and Culture Learning Model (1986), Tintoâ  s Theory of Doctoral Persistence (1987), and Taylorâ  s Cultural Learning Model (1994).  The following questions guided the research: 1.\tHow do Middle Eastern graduate students describe the academic and social environment in which they find themselves? (situation) 2.\tHow do Middle Eastern graduate students experience the academic and social transition to graduate school in the U.S.? (self)  3.\tHow do Middle Eastern graduate students describe adapting to graduate school in the U.S.? (strategy and support)  Answering these questions was accomplished through Seidmanâ  s (2006) three in-depth interview approach. The sample consisted of eight MEGS who were enrolled in a U.S. university. The studyâ  s findings showed how MEGS described their environments by focusing on the differences, challenges, role changes, and what caused them stress. Specifically, (a) male participants in this study were not educated in a co-ed education system; (b) most participants had been living with their families until moving to the host country; and (c) they were not aware of the importance of social support systems and the social environment. MEGS also experienced feeling proud, overwhelmed, conflicted, homesick, lonely, and finally, changed as a result of this transition. Finally, they described adapting to graduate school by using strategies such as (a) consulting others when faced with challenges, (b) observing then acting when they could not consult; (c) being self-reliant when faced with academic challenges; (d) getting involved socially to experience the host culture; and (e) receiving different support from others.",
  "description_provenance": [
    "Author Email: fmarsh@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: dridgwel@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:05Z (GMT). No. of bitstreams: 1 Marsh_FA_D_2012.pdf: 1169051 bytes, checksum: 839d9da5334431c17be12f4b620e5131 (MD5)   Previous issue date: 2012-08-06"
  ],
  "handle": "28623",
  "identifier_other": "etd-08112012-000850",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08112012-000850/",
  "identifier_uri": "http://hdl.handle.net/10919/28623",
  "publisher": "Virginia Tech",
  "relation_haspart": "Marsh_FA_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "transition",
    "Middle Eastern Graduate Students"
  ],
  "title": "The Transition Experiences of Middle Eastern Graduate Students in the U.S.",
  "type": "Dissertation"
}