{
  "contributor_author": "Day, Susan Downing",
  "contributor_committeecochair": [
    "Smith, David William",
    "Seiler, John R."
  ],
  "contributor_committeemember": [
    "Kreh, Richard E.",
    "Persaud, Naraine",
    "Pu, Mou"
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:15:08Z",
  "date_adate": "1999-08-24",
  "date_available": "2014-03-14T20:15:08Z",
  "date_issued": "1999-08-06",
  "date_rdate": "2000-08-24",
  "date_sdate": "1999-08-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Experiments were conducted to determine the effects of applying fill soil around existing trees and mechanisms for species tolerance to soil compaction, both common site disturbances in urban forestry. Groups of 22-year-old white oak (Quercus alba) and 13-year-old sweetgum (Liquidambar styraciflua) were subjected to one of three treatments: a control, fill (20 cm of subsoil spread over the root zones), and compacted fill (same as fill soil, but compacted). Additionally, individual trees had tree wells (fill soil pulled away from trunks), or not. After three years, treatments had no consistent effect on tree growth, chlorophyll fluorescence, or soil respiration. However, soil treatments disrupted normal soil moisture patterns at both sites. Roots of white oak grew into fill layers, although overall root growth was not significantly affected by treatment. Sweetgum roots grew very little into fill soils. However, root distribution shifted upward in the original soil under uncompacted fill. Other factors associated with raising the soil grade, such as soil trafficking and root severance, may be largely responsible for the tree decline often attributed to construction fill. <p>Another experiment investigated the relationship between tolerance of wet soils and the ability to grow in compacted soils. It was hypothesized that tree species tolerant of wet soils would have opportunities for root growth in compacted soil when high soil moisture reduced soil strength. Seedlings of flowering dogwood (Cornus florida), a species intolerant of inundation, and silver maple (Acer saccharinum), a bottomland species, were grown in a loam soil maintained at various combinations of soil strength and soil matric potential. In moderately compacted soil (1.5 g cm-3 bulk density), maple seedlings, but not dogwoods, had greater root growth rate, root length per plant, and ratio of root length to root dry weight in the wet soil (0.006 MPa soil matric potential) than in the moist and dry soils (0.026 and 0.06   MPa, respectively). No such effect was detected in highly compacted soil (1.7 g cm-3). It can be concluded that silver maple roots can grow in moderately compacted soil when high soil water content decreases soil strength, whereas dogwood is unable to take advantage of this opportunity.",
  "description_provenance": [
    "Author Email: sdd@vt.edu",
    "Advisor Email: smithdwm@vt.edu",
    "Advisor Email: jseiler@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:08Z (GMT). No. of bitstreams: 1 etd.pdf: 333378 bytes, checksum: 52f88f07b2655b623c5f8f035dca38a2 (MD5)   Previous issue date: 1999-08-06"
  ],
  "handle": "28639",
  "identifier_other": "etd-081299-103828",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-081299-103828/",
  "identifier_uri": "http://hdl.handle.net/10919/28639",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "construction damage",
    "soil compaction",
    "tree preservation",
    "grading",
    "tree wells",
    "urban forestry"
  ],
  "title": "Growth and Physiology of Several Urban Tree Species in Soils Disturbed by Construction Fill or Compaction",
  "type": "Dissertation"
}