{
  "contributor_author": "Reany, Candace Hall",
  "contributor_committeechair": "Stephenson, Max O. Jr.",
  "contributor_committeemember": [
    "Dawkins, Casey J.",
    "Rothschild, Joyce",
    "Koebel, Charles Theodore"
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:15:06Z",
  "date_adate": "2008-08-21",
  "date_available": "2014-03-14T20:15:06Z",
  "date_issued": "2008-07-29",
  "date_rdate": "2008-08-21",
  "date_sdate": "2008-08-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examines the relationship between government funding and faith-based nonprofit organizational development and professionalization.  By conducting an online survey of 1,632 executive directors at Habitat for Humanity affiliates in the United States, followed by telephone and email interviews with selected leaders from the organization, this mixed-method case study examined the organizational tensions, opportunities, bureaucratization, and professionalization of a religiously-based nonprofit as it transitioned from primarily private funding to broad acceptance of public monies.  Habitat for Humanity provided an excellent prospect for this research, as the organization announced one year before the study began that its 27-year tradition of not seeking or accepting government funding (with the exception of grants for infrastructure) would change in July 2006.  The study utilized Barry Dym and Harry Hutsonâ  s stages of organizational development, particularly their concept of professionalization, as an analytical framework for the study, with particular emphasis on the potential effects government funding may have on Habitatâ  s organizational structure. The study suggested a close relationship between increasing professionalization at the organizationâ  s national office and the decision of national leadership to allow local affiliates to pursue government funding for construction.  In addition, survey and interview data indicated that this change has been accompanied by a corresponding decrease in emphasis on religious mission, or at least a less conservative (and in some cases more pluralistic) approach to religious aims, than was evident in a 1995 International Partner training session in which the researcher participated.",
  "description_provenance": [
    "Author Email: creany@vt.edu",
    "Advisor Email: dawkins@vt.edu",
    "Advisor Email: mstephen@vt.edu",
    "Advisor Email: joycer@vt.edu",
    "Advisor Email: tkoebel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:06Z (GMT). No. of bitstreams: 1 TheSoundofSilentPartners.pdf: 5837491 bytes, checksum: 86faeaaa16acb5351f37e2a5dd83b815 (MD5)   Previous issue date: 2008-07-29"
  ],
  "handle": "28632",
  "identifier_other": "etd-08122008-135432",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08122008-135432/",
  "identifier_uri": "http://hdl.handle.net/10919/28632",
  "publisher": "Virginia Tech",
  "relation_haspart": "TheSoundofSilentPartners.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Harry Hutson",
    "government funding",
    "professionalization",
    "nonprofits",
    "faith-based",
    "Barry Dym"
  ],
  "title": "The Sound of Silent Partners: A Study of Charitable Choice and the Perceptions of Nonprofit Leaders Regarding the Effects of Government Funding on Religiously-Based Nonprofit Organizational Mission",
  "type": "Dissertation"
}