{
  "contributor_author": "Green, Russell A.",
  "contributor_committeechair": "Mitchell, James K.",
  "contributor_committeemember": [
    "Obermeier, S. F.",
    "Singh, Mahendra P.",
    "Kuppusamy, Thangavelu",
    "Martin, James R. Jr.",
    "Gutierrez, Marte S."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:15:09Z",
  "date_adate": "2001-08-14",
  "date_available": "2014-03-14T20:15:09Z",
  "date_issued": "2001-08-06",
  "date_rdate": "2002-08-14",
  "date_sdate": "2001-08-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Energy-Based Evaluation and Remediation of Liquefiable Soils  Russell A. Green Dr. James K. Mitchell, Chair Charles E. Via, Jr. Department of Civil and Environmental Engineering  ABSTRACT  Remedial ground densification is commonly used to reduce the liquefaction susceptibility of loose, saturated sand deposits, wherein controlled liquefaction is typically induced as the first step in the densification process.  Assuming that the extent of induced liquefaction is approximately equal to the extent of ground densification, the purpose of this research is to assess the feasibility of using earthquake liquefaction data in remedial ground densification design via energy-based concepts.    The energy dissipated by frictional mechanisms during the relative movement of sand grains is hypothesized to be directly related to the ability of a soil to resist liquefaction (i.e., Capacity).  This hypothesis is supported by energy-based pore pressure generation models, which functionally relate dissipated energy to residual excess pore pressures. Assuming a linearized hysteretic model, a \"simplified\" expression is derived for computing the energy dissipated in the soil during an earthquake (i.e., Demand).  Using this expression, the cumulative energy dissipated per unit volume of soil and normalized by the initial mean effective confining stress (i.e., normalized energy demand: NED) is calculated for 126 earthquake case histories for which the occurrence or non-occurrence of liquefaction is known.  By plotting the computed NED values as a function of their corresponding SPT penetration resistance, a correlation between the normalized energy capacity of the soil (NEC) and SPT penetration resistance is established by the boundary giving a reasonable separation of the liquefaction / no liquefaction data points.  NEC is the cumulative energy dissipated per unit volume of soil up to initial liquefaction, normalized by the initial mean effective confining stress, and the NEC correlation with SPT penetration resistance is referred to as the Capacity curve.  Because the motions induced during earthquake shaking and remedial ground densification significantly differ in amplitude, duration, and frequency content, the dependency of the derived Capacity curve on the nature of the loading needs to be established.  Towards this end, the calibration parameters for energy-based pore pressure generation models are examined for their dependence on the amplitude of the applied loading.  The premise being that if the relationship between dissipated energy and pore pressure generation is independent of the amplitude of loading, then the energy required to generate excess pore pressures equal to the initial effective confining stress should also be independent of the load amplitude.  However, no conclusive statement could be made from results of this review.  Next, first order numerical models are developed for computing the spatial distribution of the energy dissipated in the soil during treatment using the vibratory probe method, deep dynamic compaction, and explosive compaction.  In conjunction with the earthquake-derived Capacity curves, the models are used to predict the spatial extent of induced liquefaction during soil treatment and compared with the predicted spatial extent of improvement using empirical expressions and guidelines.  Although the proposed numerical models require further validation, the predicted extent of liquefaction and improvement are in very good agreement, thus giving credence to the feasibility of using the Capacity curve for remedial ground densification design.    Although further work is required to develop energy-based remedial densification design procedures, the potential benefits of such procedures are as follows.  By using the Capacity curve, the minimum dissipated energy required for successful treatment of the soil can be determined.  Because there are physical limits on the magnitude of the energy that can be imparted by a given technique, such an approach may lead to improved feasibility assessments and initial designs of the densification programs.",
  "description_provenance": [
    "Author Email: rugreen@vt.edu",
    "Advisor Email: sobermei@yahoo.com",
    "Advisor Email: mpsingh@vt.edu",
    "Advisor Email: kuppu@vt.edu",
    "Advisor Email: jkm@vt.edu",
    "Advisor Email: jrm@vt.edu",
    "Advisor Email: magutier@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:09Z (GMT). No. of bitstreams: 19 17_Chapter_9.pdf: 78844 bytes, checksum: 47f61454a10d64177a733b6d0b76033b (MD5) 01_Cover.pdf: 59400 bytes, checksum: 3d3884a5963bf0ed3cda4dd59c08f0e3 (MD5) 16_Chapter_8.pdf: 913661 bytes, checksum: 4007af0584358244003110efff9bd056 (MD5) 06_Table_of_Contents.pdf: 125385 bytes, checksum: 717319fe60c2dce33767c2ef06bb882e (MD5) 14_Chapter_6.pdf: 671973 bytes, checksum: 7c598e046df3d673cd49a9b301c9852e (MD5) 03_Grant_Information.pdf: 32384 bytes, checksum: abac60ccf89b97289699e0b66fc7ba93 (MD5) 05_Acknowledgements.pdf: 50040 bytes, checksum: 9d990e601401eab3ada4f02fad9261ba (MD5) 12_Chapter_4.pdf: 392981 bytes, checksum: 100e66e7bff950524e8ad503f7929a89 (MD5) 11_Chapter_3.pdf: 493344 bytes, checksum: 7cb4b2142dbde7a01ad6b7cd08771799 (MD5) 08_List_of_Figures.pdf: 260435 bytes, checksum: 8ffd00743cccfd6c154339ece37cddc6 (MD5) 13_Chapter_5.pdf: 1045051 bytes, checksum: cf0e07ac2d55c5484c05b6e93dd55e8a (MD5) 18_References.pdf: 186616 bytes, checksum: 3861dc5cb1def0a5189b4032da8ca84b (MD5) 10_Chapter_2.pdf: 999899 bytes, checksum: 8a211bff440d83f0047d0c94b04d1eb2 (MD5) 02_Abstract.pdf: 52707 bytes, checksum: c6ccb37c742fb5882f2ad43ce9066208 (MD5) 09_Chapter_1.pdf: 217963 bytes, checksum: 10c669501d862893b348120777d13885 (MD5) 04_Dedication.pdf: 54247 bytes, checksum: 758c1e5230b1be6d5a27796fe33db98c (MD5) 15_Chapter_7.pdf: 1289929 bytes, checksum: e33164d956bb48e6fa4d7c5c287e26f1 (MD5) 07_List_of_Tables.pdf: 69072 bytes, checksum: 447cd37da3b17e5cc7c632998ba67206 (MD5) 19_Vita.pdf: 314590 bytes, checksum: 3b0c872c9dbdbebd9a4c1e33953cc45b (MD5)   Previous issue date: 2001-08-06"
  ],
  "handle": "28641",
  "identifier_other": "etd-08132001-170900",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08132001-170900/",
  "identifier_uri": "http://hdl.handle.net/10919/28641",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "17_Chapter_9.pdf",
    "01_Cover.pdf",
    "16_Chapter_8.pdf",
    "06_Table_of_Contents.pdf",
    "14_Chapter_6.pdf",
    "03_Grant_Information.pdf",
    "05_Acknowledgements.pdf",
    "12_Chapter_4.pdf",
    "11_Chapter_3.pdf",
    "08_List_of_Figures.pdf",
    "13_Chapter_5.pdf",
    "18_References.pdf",
    "10_Chapter_2.pdf",
    "02_Abstract.pdf",
    "09_Chapter_1.pdf",
    "04_Dedication.pdf",
    "15_Chapter_7.pdf",
    "07_List_of_Tables.pdf",
    "19_Vita.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Earthquake",
    "Energy",
    "Liquefaction",
    "Ground Improvement",
    "Remediation",
    "Densification"
  ],
  "title": "Energy-Based Evaluation and Remediation of Liquefiable Soils",
  "type": "Dissertation"
}