{
  "contributor_author": "Hoggard, John W.",
  "contributor_committeechair": "Rossi, John F.",
  "contributor_committeemember": [
    "Olin, Robert F.",
    "Haskell, Peter E.",
    "Linnell, Peter A.",
    "Wheeler, Robert L."
  ],
  "contributor_department": "Mathematics",
  "date_accessioned": "2014-03-14T20:15:11Z",
  "date_adate": "2000-08-17",
  "date_available": "2014-03-14T20:15:11Z",
  "date_issued": "2000-07-31",
  "date_rdate": "2001-08-17",
  "date_sdate": "2000-08-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A Julia set for a complex function $f$ is the set of all points in the complex plane where the iterates of $f$ do not form a normal family.  A picture of the Julia set for a function can be generated with a computer by coloring pixels (which we consider to be small squares) based on the behavior of the point at the center of each pixel.  We consider the accuracy of computer generated pictures of Julia sets.  Such a picture is said to be accurate if each colored pixel actually contains some point in the Julia set.  We extend previous work to show that the pictures generated by an algorithm for the family $lambda e^z$ are accurate, for appropriate choices of parameters in the algorithm.  We observe that the Julia set for meromorphic functions with polynomial Schwarzian derivative is the closure of those points which go to infinity under iteration, and use this as a basis for an algorithm to generate pictures for such functions.  A pixel in our algorithm will be colored if the center point becomes larger than some specified bound upon iteration.  We show that using our algorithm, the pictures of Julia sets generated for the family $lambda \tan(z)$ for positive real $lambda$ are also accurate.  We conclude with a cautionary example of a Julia set whose picture will be inaccurate for some apparently reasonable choices of parameters, demonstrating that some care must be exercised in using such algorithms.  In general, more information about the nature of the function may be needed.",
  "description_provenance": [
    "Author Email: hoggard@math.vt.edu",
    "Advisor Email: rossi@math.vt.edu",
    "Advisor Email: haskell@math.vt.edu",
    "Advisor Email: linnell@math.vt.edu",
    "Advisor Email: wheeler@math.vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:11Z (GMT). No. of bitstreams: 1 hoggard.pdf: 357186 bytes, checksum: 8d659eb7828566a9c225ab84b0cc127f (MD5)   Previous issue date: 2000-07-31"
  ],
  "handle": "28647",
  "identifier_other": "etd-08142000-10410017",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08142000-10410017/",
  "identifier_uri": "http://hdl.handle.net/10919/28647",
  "publisher": "Virginia Tech",
  "relation_haspart": "hoggard.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "tangent",
    "meromorphic",
    "computer algorithms",
    "polynomial Schwarzian derivative",
    "Julia sets"
  ],
  "title": "Accuracy of Computer Generated Approximations to Julia Sets",
  "type": "Dissertation"
}