{
  "contributor_author": "Innawong, Bhundit",
  "contributor_committeechair": "Mallikarjunan, Parameswarakumar",
  "contributor_committeemember": [
    "Cundiff, John S.",
    "Wilson, James H.",
    "Haugh, C. Gene",
    "Flick, George J. Jr.",
    "Marcy, Joseph E."
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2014-03-14T20:15:11Z",
  "date_adate": "2001-08-15",
  "date_available": "2014-03-14T20:15:11Z",
  "date_issued": "2001-07-20",
  "date_rdate": "2002-08-15",
  "date_sdate": "2001-08-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The commercial pressure frying has been limited to frying huge amount of products due to its dependence on the amount of moisture released from the food for generating the desired pressure. This study investigated the feasibility of using nitrogen gas as a substitute for steam in the pressure frying system. The effects of various process conditions (source of pressure, frying temperature and pressure) on fried product and frying oil qualities were evaluated. Frying experiments were performed on breaded/battered poultry products including chicken nuggets (homogenous) and chicken fillets (marinated, intact muscle). Efforts were also made to develop rapid methods to determine frying oil quality and discriminate among fresh, marginal and discarded oils using a chemosensory (also known as electronic nose) or Fourier transform infrared spectroscopy (FTIR-ATR). Frying temperature and pressure affected fried food quality. An increase in frying pressure resulted in tender, juicier products with less oil uptake due to high moisture retention. An increase in frying oil temperature resulted in an increased moisture loss, oil uptake resulting in less tender and juicier products. Compared with frying using steam released from food, using nitrogen provided similar or better quality fried products in terms of moisture retention, juiciness and texture. The reused oils from the fryer using nitrogen gas was better in quality than the system using steam as evidenced from the physical, chemical and chemosensory measurements.",
  "description_provenance": [
    "Author Email: binnawon@vt.edu",
    "Advisor Email: jcundiff@vt.edu",
    "Advisor Email: jawilson@vt.edu",
    "Advisor Email: haugh@vt.edu",
    "Advisor Email: flickg@vt.edu",
    "Advisor Email: jmarcy@vt.edu",
    "Advisor Email: kumar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:11Z (GMT). No. of bitstreams: 1 Innawong01.pdf: 945934 bytes, checksum: 4c37760b89ed5e5000367dedfd52f12f (MD5)   Previous issue date: 2001-07-20"
  ],
  "handle": "28650",
  "identifier_other": "etd-08142001-154039",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08142001-154039/",
  "identifier_uri": "http://hdl.handle.net/10919/28650",
  "publisher": "Virginia Tech",
  "relation_haspart": "Innawong01.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "steam",
    "frying oil quality",
    "fried product quality",
    "pressure frying",
    "nitrogen gas"
  ],
  "title": "Improving Fried Product and Frying Oil Quality Using Nitrogen Gas in A Pressure Frying System",
  "type": "Dissertation"
}