{
  "contributor_author": "Carradine, David Marc",
  "contributor_committeecochair": [
    "Woeste, Frank E.",
    "Dolan, James Daniel"
  ],
  "contributor_committeemember": [
    "Cundiff, John S.",
    "Holzer, Siegfried M.",
    "Loferski, Joseph R."
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2014-03-14T20:15:12Z",
  "date_adate": "2002-08-26",
  "date_available": "2014-03-14T20:15:12Z",
  "date_issued": "2002-08-08",
  "date_rdate": "2003-08-26",
  "date_sdate": "2002-08-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Modern timber frame buildings are a unique combination of ancient carpentry techniques coupled with one of the newest enclosure systems found on construction sites around the world. Contemporary timber frame structures typically utilize structural-insulated panels (SIPs) attached to a timber frame skeleton to create functional, enclosed structures, such as houses, churches and a myriad of retail and industrial buildings.  The skeleton contains large wooden members connected using wooden joints held together with wooden pegs or wedges.  SIPs consist of a layer of rigid expanded polystyrene insulation covered on one side by oriented strand board and on the other side by oriented strand board, drywall, or some other interior finish.  In timber frame buildings, SIPs also serve as diaphragm elements, which are flat structural assemblies loaded by shear forces in the plane of the panel.  Current design methodologies for timber frame structures do not formally incorporate the structural benefits of SIPs as diaphragm elements, which contribute significantly to the ability of these buildings to resist lateral loads.   <p>The contribution of this research was to quantify necessary design parameters to enable timber frame designers to capitalize on the significant in-plane strength and stiffness of SIPs when designing timber frame structures to resist lateral loads.  Strength and stiffness tests were conducted on three 8 ft (2.44 m) deep and 24 ft (7.32 m) long roof diaphragm assemblies, and two 20 ft (6.10 m) deep and 24 ft (7.32 m) long roof diaphragm assemblies.  Data from these tests were collected, tabulated and analyzed according to existing methods typically utilized for post-frame diaphragm testing.  Strength and stiffness of timber frame and SIP roof diaphragm assemblies were determined from monotonic test results and a value for Response Modification Coefficient, R, for use with seismic design procedures, was estimated utilizing cyclic test data.  Procedures for calculating strength and stiffness of a roof diaphragm based on the strength and stiffness of test panels were presented and incorporated within post-frame diaphragm design methods.  Diaphragm-frame interaction analyses were performed utilizing test data from roof diaphragm assemblies that demonstrated the code conformance of members within timber frames subjected to lateral loads.  Using roof diaphragm test data and procedures developed for adjustments from the test panel to building roof length, example designs were conducted which confirmed the effectiveness of including SIPs as diaphragm elements for code conforming designs for wind and seismic load resistance of timber frame and SIP buildings.",
  "description_provenance": [
    "Author Email: dcarradi@vt.edu",
    "Advisor Email: fwoeste@vt.edu",
    "Advisor Email: jcundiff@vt.edu",
    "Advisor Email: holzer@vt.edu",
    "Advisor Email: jloferski@vt.edu",
    "Advisor Email: jddolan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:12Z (GMT). No. of bitstreams: 17 Tables.PDF: 4061 bytes, checksum: b4920f29f1266611947fb966ca2895b3 (MD5) AppendixA.PDF: 37780 bytes, checksum: 48a86ec463984994b64c6899cae54902 (MD5) Chapter3.PDF: 506828 bytes, checksum: 673041323224250790858bbb8afb491f (MD5) Chapter2.PDF: 178909 bytes, checksum: 223633de4fa3da0a7bb28c02267783a9 (MD5) AppendixB.PDF: 151900 bytes, checksum: 5484f843bbd9faf87d129208410241bf (MD5) Chapter4.PDF: 1990709 bytes, checksum: b2b2adc8fc0fa73d3c2d3b2958cb16b7 (MD5) AppendixC.PDF: 210027 bytes, checksum: bee5d2ffd17ecf2aec1c8c1a32131336 (MD5) Chapter5.PDF: 95265 bytes, checksum: aa20f4d331320aed95e5c9ea9fecf503 (MD5) Chapter1.PDF: 272248 bytes, checksum: 23e858802b8c924bb47a6b93039ffc4f (MD5) Vita.PDF: 2611 bytes, checksum: 59642f4ed2883aef57f539765f0bd315 (MD5) Figures.PDF: 9967 bytes, checksum: 0d9d7c33a7e25dda17a930b55a40b2ad (MD5) Title.PDF: 3260 bytes, checksum: 3bb793f882b2e59258ea3ae111b2c3b5 (MD5) Contents.PDF: 9122 bytes, checksum: 63644c4f91a98639224306b7063c3857 (MD5) Acknowledgements.PDF: 5474 bytes, checksum: 394dae8fd161e03a5ad503b330fb5865 (MD5) Abstract.PDF: 5362 bytes, checksum: 18367f06a1ff142daf62cc64ad5acf03 (MD5) Chapter6.PDF: 28235 bytes, checksum: 70cd6752fda7cc6549618f6245d7fa51 (MD5) References.PDF: 37298 bytes, checksum: 3d13fbb8a94f18de916f1807bff7ff4c (MD5)   Previous issue date: 2002-08-08"
  ],
  "handle": "28652",
  "identifier_other": "etd-08142002-232925",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08142002-232925/",
  "identifier_uri": "http://hdl.handle.net/10919/28652",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Tables.PDF",
    "AppendixA.PDF",
    "Chapter3.PDF",
    "Chapter2.PDF",
    "AppendixB.PDF",
    "Chapter4.PDF",
    "AppendixC.PDF",
    "Chapter5.PDF",
    "Chapter1.PDF",
    "Vita.PDF",
    "Figures.PDF",
    "Title.PDF",
    "Contents.PDF",
    "Acknowledgements.PDF",
    "Abstract.PDF",
    "Chapter6.PDF",
    "References.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "diaphragm design",
    "timber frame",
    "structural insulated panels",
    "lateral loads"
  ],
  "title": "Methodology for the Design of Timber Frame Structures Utilizing Diaphragm Action",
  "type": "Dissertation"
}