{
  "contributor_author": "Gaynor, Justin F.",
  "contributor_committeechair": "Desu, Seshu B.",
  "contributor_committeemember": [
    "Cox, David F.",
    "Love, Brian J.",
    "Wightman, James P.",
    "Wilkes, Garth L."
  ],
  "contributor_department": "Materials Engineering Science",
  "date_accessioned": "2014-03-14T20:15:12Z",
  "date_adate": "2006-08-14",
  "date_available": "2014-03-14T20:15:12Z",
  "date_issued": "1995-10-01",
  "date_rdate": "1995-10-30",
  "date_sdate": "2006-08-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>A new approach to the fabrication of polymeric thin films is presented. This approach, chemical vapor copolymerization (CVcP), has all the advantages of chemical vapor polymerization (CVP), including exceptional purity, highly conformal coatings, continuous films even when very thin, low stress, and low environmental impact. The range of film properties available by CVcP is much greater than by CVP.</p><p> A specially modified deposition system was constructed to study deposition kinetics. A model was developed which allowed quantification of the order of initiation of paraxylylene (PX), which is the initiation system for all the work reported here. This model suggests a trimer diradical is the smallest stable diradical species formed by PX at room temperature, confirming thermodynamic predictions.</p><p> This system also allows the calculation of reactivity ratios of PX with vinylic comonomers. A model is developed in which reactivity ratios can be determined if the following quantities are known: a) thickness vs. position of the final film; b) partial pressures of each reactive species entering the deposition chamber and c) composition vs. position in the final film. This model was tested yielded reasonable values for reactivity ratios.</p><p> A polymeric film extremely low in refractive index (1.38-1.39 in the visible region) is presented. This film is formed by copolymerizing poly(parachloroxylylene), or PX-C, with perfluorooctyl methacrylate (PFOMA). The refractive index of the homopolymers, by contrast, are in the 1.60-1.68 range. Film growth rates are very low for this new material.</p><p> Finally, a new deposition procedure is introduced in which a comonomer with a low vapor pressure is codeposited with PX. The reactor temperature is above the ceiling temperature of PX deposition, but at a temperature where the comonomer can condense. This makes the deposition environment extremely rich in comonomer, yielding films whose final properties are nearly identical to films composed entirely of the comonomer. The procedure is demonstrated using n-phenyl maleimide (NPMI) as a comonomer; films produced had thermal stabilities nearly matching those of poly(NPMI). This procedure has great promise for broadening the use of polymeric thin films in the microelectronics industry, as well as other fields.</p",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:15:12Z (GMT). No. of bitstreams: 1 LD5655.V856_1995.G396.pdf: 6498236 bytes, checksum: 3b165ae3a26b08442687880ef08b026b (MD5)   Previous issue date: 1995-10-01",
  "format_medium": "BTD",
  "handle": "28656",
  "identifier_other": "etd-08142006-110115",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08142006-110115/",
  "identifier_uri": "http://hdl.handle.net/10919/28656",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1995.G396.pdf",
  "subject": [
    "Polymeric thin films",
    "chemical vapor deposition"
  ],
  "subject_lcc": "LD5655.V856 1995.G396",
  "title": "Polymeric thin films by chemical vapor deposition for the microelectronics industry",
  "type": "Dissertation"
}