{
  "contributor_author": "Grinshpon, Mark S.",
  "contributor_committeechair": "Linnell, Peter A.",
  "contributor_committeemember": [
    "Parry, Charles J.",
    "Haskell, Peter E.",
    "Klaus, Martin",
    "Floyd, William J."
  ],
  "contributor_department": "Mathematics",
  "date_accessioned": "2014-03-14T20:15:12Z",
  "date_adate": "2006-10-06",
  "date_available": "2014-03-14T20:15:12Z",
  "date_issued": "2006-08-10",
  "date_rdate": "2006-10-06",
  "date_sdate": "2006-08-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Two results are obtained in this work. First, we prove that for a commutative ring embedded in a larger ring, which is not necessarily commutative, its division and rational closures coincide. Second, for an infinite discrete group G, we investigate group cohomology and homology with coefficients in lp(G). We prove that if G is of type FPn, then all its homology and cohomology groups up to n are either zero or infinite dimensional. This generalizes one of the results obtained by Bekka and Valette",
  "description_provenance": [
    "Author Email: grinshpon@vt.edu",
    "Advisor Email: parrycj@math.vt.edu",
    "Advisor Email: haskell@math.vt.edu",
    "Advisor Email: klaus@math.vt.edu",
    "Advisor Email: floyd@math.vt.edu",
    "Advisor Email: linnell@math.vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:12Z (GMT). No. of bitstreams: 1 thesis.pdf: 247001 bytes, checksum: f3f04f6b81ef2e068331c6703158758d (MD5)   Previous issue date: 2006-08-10"
  ],
  "handle": "28655",
  "identifier_other": "etd-08142006-003016",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08142006-003016/",
  "identifier_uri": "http://hdl.handle.net/10919/28655",
  "publisher": "Virginia Tech",
  "relation_haspart": "thesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Rational Closure",
    "Division Closure",
    "Group Cohomology",
    "Universal Localization"
  ],
  "title": "Universal Localization and Group Cohomology",
  "type": "Dissertation"
}