{
  "contributor_author": "Beach, Nathan Matthew",
  "contributor_committeechair": "Pierson, Frank William",
  "contributor_committeemember": [
    "Sriranganathan, Nammalwar",
    "Larsen, Calvert T.",
    "Meng, Xiang-Jin",
    "Duncan, Robert B. Jr."
  ],
  "contributor_department": "Biomedical and Veterinary Sciences",
  "date_accessioned": "2014-03-14T20:15:13Z",
  "date_adate": "2006-10-25",
  "date_available": "2014-03-14T20:15:13Z",
  "date_issued": "2006-08-04",
  "date_rdate": "2006-10-25",
  "date_sdate": "2006-08-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Hemorrhagic enteritis is a disease of turkeys caused by virulent strains of Turkey Hemorrhagic Enteritis Virus (THEV) resulting in depression, splenomegaly, intestinal hemorrhage, immunosuppression, and mortality. Avirulent strains that do not produce intestinal lesions and mortality are used in live-virus vaccines that protect turkeys from virulent field challenge. The cause for the difference in phenotype between virulent and avirulent strains is unknown.  The full-length genome of the Virginia Avirulent Strain (VAS) of THEV was sequenced and compared to the genome sequence of a virulent field isolate from Israel. Genetic differences were found in seven viral genes. Further sequencing narrowed the focus from seven genes to three: ORF1, E3, and Fiber. Consistent variation in these genes between strains of THEV with different phenotypes strongly indicates these genes as key factors affecting virulence. THEV is an officially recognized member of the viral family Adenoviridae, genus Siadenovirus. The genomes of the members of the genus, THEV and Frog Adenovirus 1, are not well-characterized. The genome sequences of both members were compared for the prediction of genetic and structural elements. Common features were found that distinguish this genus from all other adenoviruses, and differences were found that possibly contribute to host specificity of the members. The VAS is known to stimulate a life-long protective antibody response, though viral replication is only of short duration. Several studies were undertaken to determine changes in virus location and serology over time. Viral DNA was detected in various tissues through 15 weeks post-infection in the presence of high antibody titers. THEV infection was found to be similar to the non-lytic persistent infections seen with human adenoviruses.   \tRegardless of the mechanism involved in the persistent stimulation of antibodies in infected turkeys, the VAS was shown to be an ideal vector for use in a recombinant live-virus vaccine. The next step in THEV research should be the creation of a full-length infectious DNA clone, which could be used in the creation of a recombinant vaccine. The infectious clone would also allow for the systematic testing of genes that are suspected to be involved in virulence.",
  "description_provenance": [
    "Author Email: nbeach@vt.edu",
    "Advisor Email: nathans@vt.edu",
    "Advisor Email: clarsen@vt.edu",
    "Advisor Email: xjmeng@vt.edu",
    "Advisor Email: duncanr@vt.edu",
    "Advisor Email: pierson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:13Z (GMT). No. of bitstreams: 6 Part3.pdf: 658146 bytes, checksum: a18dd6fc4816451562751e3d28b77934 (MD5) Part2.pdf: 204800 bytes, checksum: 0d53d2d458e6a7a9151baf837153b5d2 (MD5) title.pdf: 20467 bytes, checksum: 58af2415af20edbf442b5f05658ab858 (MD5) Part1.pdf: 253648 bytes, checksum: cfac67841ca12d27f9c818ebadf2559e (MD5) Part4.pdf: 659320 bytes, checksum: baadcc97af5f7e6bd09cd0998bf456ed (MD5) contents.pdf: 51693 bytes, checksum: 73da5e899f3fc743b1cf731145ca61d9 (MD5)   Previous issue date: 2006-08-04"
  ],
  "handle": "28658",
  "identifier_other": "etd-08142006-145339",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08142006-145339/",
  "identifier_uri": "http://hdl.handle.net/10919/28658",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Part3.pdf",
    "Part2.pdf",
    "title.pdf",
    "Part1.pdf",
    "Part4.pdf",
    "contents.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Persistent Infection",
    "THEV",
    "Siadenovirus",
    "Hemorrhagic Enteritis"
  ],
  "title": "Characterization of Avirulent Turkey Hemorrhagic Enteritis Virus: A Study of the Molecular Basis for Variation in Virulence and the Occurrence of Persistent Infection",
  "type": "Dissertation"
}