{
  "contributor_author": "Marshall, Maureen Elizabeth",
  "contributor_committeecochair": [
    "Mallory, Walter D.",
    "Alexander, David"
  ],
  "contributor_committeemember": [
    "Farling, Alice",
    "Byers, Larry"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:15:13Z",
  "date_adate": "2006-11-15",
  "date_available": "2014-03-14T20:15:13Z",
  "date_issued": "2006-05-05",
  "date_rdate": "2006-11-15",
  "date_sdate": "2006-08-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Since the inception of the 1974 Education for all Handicapped Children legislation, the number of students referred and placed in special education has been steadily rising. The largest increase is in the learning disabilities category. With the reauthorization of the Individuals with Disabilities Education Improvement Act of 2004 and the federal requirements for schools under the No Child Left Behind law, schools are required to take a closer look at their rising special education numbers and identify alternative solutions for children's needs other than a certain placement in special education. There are different levels of variables that influence a teacher's decision to refer a student to special education. This study aimed to understand the mesosystem school variables that influence this process. Using two scales, the Organizational Health Inventory for Elementary Schools (OHI-E) and the Collective Efficacy Scale (CE-Scale) this study used purposive sampling to survey ten elementary school faculties in a large suburban district in Virginia. LD prevalence rates were collected for all elementary schools in the district. Data was analyzed to answer the following questions: (a)\tHow does school organizational health correlate with the number of students referred to special education in a given school? (b) How does collective teacher efficacy correlate to the number of students referred for special education services? The overall return rate for the survey was 87% with 490 teacher surveys completed.  Teachers did not have many teaching years in their buildings.  Teachers with twelve or more teaching years experience were more likely to refer students to special education. Collective teacher efficacy scores were correlated to school health scores but not to LD prevalence rates. Higher institutional integrity was seen in smaller schools.  Title I schools did not correlate with higher LD prevalence rates. Two variables predicted referrals to special education; years teaching in combination with teacher efficacy resulted in greater referrals to special education. The findings of this study may aid educational leaders in making sound changes within school environments to affect the school's LD prevalence rate, addressing particularly teacher efficacy and referral habits of more experienced teachers.",
  "description_provenance": [
    "Author Email: mamarsha@vt.edu",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: alice.farling@fcps.edu",
    "Advisor Email: lbyers@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:13Z (GMT). No. of bitstreams: 1 MaureenEMarshall05-05-06.pdf: 657310 bytes, checksum: d82b14c743d2793f0de813f2928fc2c9 (MD5)   Previous issue date: 2006-05-05"
  ],
  "handle": "28661",
  "identifier_other": "etd-08142006-182818",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08142006-182818/",
  "identifier_uri": "http://hdl.handle.net/10919/28661",
  "publisher": "Virginia Tech",
  "relation_haspart": "MaureenEMarshall05-05-06.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "LD Prevalence rate",
    "School Health",
    "Collective Efficacy",
    "Mesosystem"
  ],
  "title": "Mesosystem Variables and Schools' Learning Disabilities Prevalence Rates",
  "type": "Dissertation"
}