{
  "contributor_author": "Casto, Kristen  Lee",
  "contributor_committeechair": "Casali, John G.",
  "contributor_committeemember": [
    "Ahroon, William A.",
    "Kleiner, Brian M.",
    "Winchester, Woodrow W. III"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:15:14Z",
  "date_adate": "2009-09-21",
  "date_available": "2014-03-14T20:15:14Z",
  "date_issued": "2009-07-03",
  "date_rdate": "2009-09-21",
  "date_sdate": "2009-08-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Among the many occupational hazards to which Army rotary-wing aviators are exposed is intense noise generated from the aircraft.  The potential for permanent hearing loss and difficulty communicating in helicopter noise is well known; an appropriate way to evaluate a hearing-impaired pilotâ  s safety risk due to hearing loss is not as well known.  Previous research has studied communication ability in helicopter cockpit noise under different headsets, but there are not conclusive data on the combined effects of degraded speech intelligibility due to noise and flight workload under the headset technology currently available to Army helicopter pilots.  In particular, there is a scarcity of information on pilots with hearing loss.  Currently, Army Aeromedical standards stipulate audiometric threshold criteria for rated helicopter pilots to ensure their safe flying.  If the standard is not met, a flight waiver for hearing is generally granted if the pilot demonstrates good (at least 84%) binaural word recognition ability in a quiet environment.        A research study was conducted to evaluate Army helicopter pilot performance with regard to flight workload, communication signal quality, headset configuration, and pilot hearing ability.  Objectives of the study included the ability to refine current Army audiometric hearing waiver criteria, and to yield data on which to base flight and headset selection recommendations for pilots.  In general, it was believed that flight performance and ratings of situation awareness (SA) would decrease as flight workload increased and communication signal quality decreased, and that assistive communication devices coupled with headsets would afford improved flight performance over their passive counterpart.  It was also hypothesized that normal-hearing pilots would perform better than hearing-impaired pilots would.        Twenty Army helicopter pilots (one group of 10 pilots without a hearing waiver and one group of 10 pilots with a hearing waiver) participated in this study.  The pilots flew three flights in a Black Hawk flight simulator, each with a different headset configuration and with varying flight workload levels and varying air traffic control (ATC) communication signal quality.  Objective flight performance parameters of heading, altitude, and airspeed deviation and ATC command readbacks were measured.  Additionally, measurements were taken on subjective measures of workload, SA, and headset comfort/speech intelligibility.        Experimental results partially supported the research hypotheses.  Results indicated that flight performance and ratings of SA were negatively affected by increased flight workload and decreased communication signal quality for both groups of pilots.  Results also showed that a passive headset/passive earplug combination use by the hearing-impaired group of pilots led to degradation of certain flight performance parameters and lower ratings of SA than the headsets equipped with assistive communication technology; however, the same headset effect was not seen with the group of normal-hearing pilots.        This study yielded results that support a conclusion that factors other than hearing thresholds and word recognition ability in a quiet environment should be considered when evaluating Army helicopter pilots flight safety with regard to hearing sensitivity.  Rather, the synergistic effects of flight workload and communication signal quality with individual hearing levels should be considered when making continued flight recommendations and headset choice recommendations.  Results also support a recommendation requiring hearing-impaired pilots to use assistive communication technology and not be permitted to fly with passive headset devices.  Further research should include a functional hearing assessment in which pilot hearing requirements are determined and individual hearing abilities are compared to the requirements.",
  "description_provenance": [
    "Author Email: kcasto@vt.edu",
    "Advisor Email: william.ahroon@us.army.mil",
    "Advisor Email: jcasali@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: wwwinche@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:14Z (GMT). No. of bitstreams: 1 Kristen_Casto_Dissertation.pdf: 2261581 bytes, checksum: baf4d853972cce858e53131641cc4dd5 (MD5)   Previous issue date: 2009-07-03"
  ],
  "handle": "28664",
  "identifier_other": "etd-08142009-215130",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08142009-215130/",
  "identifier_uri": "http://hdl.handle.net/10919/28664",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kristen_Casto_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "active noise reduction",
    "communications earplug",
    "hearing protective devices",
    "aviation"
  ],
  "title": "An Examination of Headset, Hearing Sensitivity, Flight Workload, and Communication Signal Quality on Black Hawk Helicopter Simulator Pilot Performance",
  "type": "Dissertation"
}