{
  "contributor_author": "Hendershot, Bradford Donald",
  "contributor_committeechair": "Nussbaum, Maury A.",
  "contributor_committeemember": [
    "Madigan, Michael L.",
    "Socha, John J.",
    "Gabler, Hampton Clay",
    "Agnew, Michael J."
  ],
  "contributor_department": "Biomedical Engineering",
  "date_accessioned": "2014-03-14T20:15:14Z",
  "date_adate": "2012-09-14",
  "date_available": "2014-03-14T20:15:14Z",
  "date_issued": "2012-08-02",
  "date_rdate": "2012-09-14",
  "date_sdate": "2012-08-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Low back pain (LBP) is a substantial secondary disability among persons with lower-limb amputation (LLA).  Abnormal mechanics of movement subsequent to LLA may increase the stability demands on the spinal column, and repetitive exposures to such abnormal movements may alter trunk passive properties and/or the coordination of surrounding trunk muscle responses.  Further, preferential use of the sound limb may lead to asymmetries in these behaviors.  Spine biomechanics (e.g., loading and stability) are substantially influenced by trunk passive properties and neuromuscular control, and alterations in these behaviors are associated with abnormal mechanics of the spinal column and an increased LBP risk.  However, there is limited evidence regarding whether prolonged repeated exposures to abnormal gait and movement resulting from LLA and subsequent repeated use of a prosthetic device affect these trunk behaviors. <p> Eight males with unilateral LLA and a matched sample of non-amputation controls completed three studies in which several measures of trunk passive properties, neuromuscular control, and spine biomechanics were quantified using laboratory experiments and biomechanical analyses.  Each study involved a distinct task to investigate potential alterations and/or asymmetries in trunk passive properties and neuromuscular control.  The first study used a seated balance task to assess trunk postural control and stability.  The second study used multidirectional trunk perturbations to assess trunk mechanical and neuromuscular behaviors.  Finally, the third study   used controlled quasi-static trunk movements to assess load-sharing mechanisms between active and passive low back tissues. <p> Significant alterations and asymmetries in trunk passive properties and trunk neuromuscular responses were present among participants with LLA, specifically reduced and asymmetric trunk stiffness and reflex response; decreased and asymmetric passive contributions to trunk movements; and increased trunk muscle activities.  Significant increases in trunk postural sway and trunk muscle activities were also present during seated stability measures.  Such alterations in these behaviors may be a result of repetitive exposures to abnormal gait and movement subsequent to LLA and the use of a prosthetic device, and could play a contributing role in the development of LBP in this population. Future work should investigate the temporal relationship between altered trunk behaviors and repeated exposure to abnormal gait and movement subsequent to LLA, to better identify critical years for rehabilitation and preventative care.",
  "description_provenance": [
    "Author Email: hendershot@vt.edu",
    "Advisor Email: mlmadigan@vt.edu",
    "Advisor Email: jjsocha@vt.edu",
    "Advisor Email: gabler@vt.edu",
    "Advisor Email: mjagnew@vt.edu",
    "Advisor Email: nussbaum@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:14Z (GMT). No. of bitstreams: 2 Hendershot_BD_D_2012.pdf: 1038472 bytes, checksum: fd06d65126a3973e3e140843b4a3974c (MD5) Hendershot_BD_D_2012_ApprovalLetter.pdf: 229739 bytes, checksum: 76a7bccf2b2bcfa11918ef5de16a294b (MD5)   Previous issue date: 2012-08-02"
  ],
  "handle": "28668",
  "identifier_other": "etd-08142012-144453",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08142012-144453/",
  "identifier_uri": "http://hdl.handle.net/10919/28668",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Hendershot_BD_D_2012.pdf",
    "Hendershot_BD_D_2012_ApprovalLetter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Biomechanics",
    "Flexion-Relaxation",
    "Position Perturbation",
    "Postural Control",
    "Spine"
  ],
  "title": "Alterations and Asymmetries in Trunk Mechanics and Neuromuscular Control among Persons with Lower-Limb Amputation: Exploring Potential Pathways of Low Back Pain",
  "type": "Dissertation"
}