{
  "contributor_author": "Vance, James Aaron",
  "contributor_committeechair": "Russell, David L.",
  "contributor_committeecochair": "Klaus, Martin",
  "contributor_committeemember": [
    "Laubenbacher, Reinhard C.",
    "Sun, Shu-Ming",
    "Kelly, Marcella J.",
    "Berkson, James M."
  ],
  "contributor_department": "Mathematics",
  "date_accessioned": "2014-03-14T20:15:13Z",
  "date_adate": "2006-09-06",
  "date_available": "2014-03-14T20:15:13Z",
  "date_issued": "2006-08-10",
  "date_rdate": "2006-09-06",
  "date_sdate": "2006-08-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "One of the basic questions of concern in mathematical biology is the long-term survival of each species in a set of populations.  This question is particularly puzzling for a natural system with omnivory due to the fact that simple mathematical models of omnivory are prone to species extinction.  Omnivory is defined as the consumption of resources from more than one trophic level.   In this work, we investigate three omnivory models of increasing complexity.  We use the notion of permanent coexistence, or permanence, to study the long-term survival of three interacting species governed by a mixture of competition and predation.  We show the permanence of our models under certain parameter restrictions and include the biological interpretations of these parameter restrictions.  Sensitivity analysis is used to obtain important information about meaningful parameter data collection.  Examples are also given that demonstrate the ubiquity of omnivory in natural systems.",
  "description_provenance": [
    "Author Email: jamvance@hotmail.com",
    "Advisor Email: reinhard@vt.edu",
    "Advisor Email: sun@math.vt.edu",
    "Advisor Email: klaus@math.vt.edu",
    "Advisor Email: russell@math.vt.edu",
    "Advisor Email: makelly2@vt.edu",
    "Advisor Email: fraser@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:13Z (GMT). No. of bitstreams: 1 JAV_thesis.pdf: 669337 bytes, checksum: 933565f5eb3719c4605d1f5331857b58 (MD5)   Previous issue date: 2006-08-10"
  ],
  "handle": "28660",
  "identifier_other": "etd-08142006-154319",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08142006-154319/",
  "identifier_uri": "http://hdl.handle.net/10919/28660",
  "publisher": "Virginia Tech",
  "relation_haspart": "JAV_thesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "permanent coexistence",
    "permanence",
    "omnivory",
    "intraguild predation",
    "sensitivity analysis"
  ],
  "title": "Permanent Coexistence for Omnivory Models",
  "type": "Dissertation"
}