{
  "contributor_author": "Johnson, Alexander Arthur Theodore",
  "contributor_committeechair": "Veilleux, Richard E.",
  "contributor_committeemember": [
    "Beers, Eric P.",
    "Maroof, M. A. Saghai",
    "Buss, Glenn R.",
    "Gillaspy, Glenda E."
  ],
  "contributor_department": "Horticulture",
  "date_accessioned": "2014-03-14T20:15:14Z",
  "date_adate": "2001-08-21",
  "date_available": "2014-03-14T20:15:14Z",
  "date_issued": "2001-08-09",
  "date_rdate": "2002-08-21",
  "date_sdate": "2001-08-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Recent advances in plant genetic engineering offer substantial benefits to farmers throughout the world.  Genetic research has identified many exogenous genes that could considerably decrease production costs through transgene-mediated resistance to insect, viral, fungal and bacterial pathogens.  Potato can be produced from true potato seed (TPS) through a sexual polyploidization step, known as 4x-2x hybridization.  Little is known regarding the stability of transgenes through sexual polyploidization in potato, although studies have associated ploidy elevation with transgene silencing in plants such as Arabidopsis thaliana.  In the present study, potato was transformed with two different transgenes, cry3Aa and PVYo cp, and transgene expression was analyzed through 4x-2x hybridization.  Transgene introgression did not affect fertility or agronomic performance (tuber set, average tuber weight, total tuber yield) of the resulting 4x-2x hybrids; however, reduced seed germination was observed for several transgenic lines in an in vitro study.  Ploidy elevation did not affect a highly expressed single copy cry3Aa transgene, simplex or duplex, transmitted through pollen to 4x-2x hybrids.  By contrast, multiple copies of cry3Aa triggered significant transgene silencing in diploids and silencing was further pronounced upon pollen transmission to 4x-2x hybrids.  Crosses between two, single insert plants demonstrated additional evidence that multiple cry3Aa transgenes resulted in reduced expression, as well as provided evidence for maternal effects on expression of the cry3Aa transgene.  Finally, Cry3Aa expression levels of progeny derived from low expressing, multiple copy 4x-2x hybrids indicated that reduction of transgene number in progeny, through meiotic segregation, could increase Cry3Aa expression.  The results suggest that 4x-2x hybridization using single copy, male parents can result in high expressing, transgenic 4x-2x hybrids while segregating for a low frequency of non-transgenic hybrids that create a \"refuge\" to inhibit development of resistance to transgenes in pest populations.",
  "description_provenance": [
    "Author Email: aljohns6@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: ebeers@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: gbuss@vt.edu",
    "Advisor Email: gillaspy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:14Z (GMT). No. of bitstreams: 1 AATJ_ETD.pdf: 1311893 bytes, checksum: b376dff43e8c7942cd926e058a5efeb9 (MD5)   Previous issue date: 2001-08-09"
  ],
  "handle": "28669",
  "identifier_other": "etd-08152001-024513",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08152001-024513/",
  "identifier_uri": "http://hdl.handle.net/10919/28669",
  "publisher": "Virginia Tech",
  "relation_haspart": "AATJ_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "TPS",
    "homology-dependent gene silencing",
    "Solanum tuberosum",
    "genetic engineering",
    "transgene"
  ],
  "title": "Effect of Ploidy Elevation, Copy Number and Parent-Of-Origin on Transgene Expression in Potato",
  "type": "Dissertation"
}