{
  "contributor_author": "Chen, Chung-Yen",
  "contributor_committeechair": "Bakhit, Raga M.",
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:15:17Z",
  "date_adate": "2001-08-16",
  "date_available": "2014-03-14T20:15:17Z",
  "date_issued": "2001-08-14",
  "date_rdate": "2002-08-16",
  "date_sdate": "2001-08-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Isoflavones have antioxidant activities in vivo, however, their antioxidative potential against oxidative stress initiated by exercise was not explored.  The first study investigated the effect of high-genistin isoflavone (HGI) supplementation on erythrocyte antioxidant enzymes and tissues' thiobarbituric reactive substances (TBARS) in acutely exercised one-year old rats.  All tissue genistein concentrations increased after exercise. Ingestion of HGI seemingly enhanced running time to exhaustion, and maintained glutathione peroxidase (GPx) and catalase (CAT) activities decreased due to exercise.  The second study investigated the dose effect of HGI supplementation. Genistein concentrations were significantly higher (P<0.05) in tissues of rats fed the 1045 PPM HGI diet than in rats fed 522 or 209 PPM HGI diets and increased the glutathione (GSH)/total glutathione (TGSH) ratio (P<0.03). Reductions of the in vivo MDA concentrations (P<0.05) were observed only in the plasma of rats fed 522 and 1045 PPM HGI diets compared to those fed 0 PPM (-1.08, -0.82, and 0.03 mM, respectively). Therefore, isoflavones at 522-1045 PPM HGI diet have antioxidative effects in rats.   The last two studies investigated the effect of isoflavone supplementation on the modulation of erythrocyte antioxidant enzyme activities, glutathione homeostasis, and other oxidative biomolecules in healthy young men undergoing 80%VO2pk exercise. In Study 3 exercise at 80%VO2pk increased oxidative stress which was best demonstrated by increased superoxide dismutase (SOD) activity (16.5%), GSH/TGSH ratio, in vivo MDA (12.6%), plasma uric acid (4.9%) and ferric reducing/antioxidant ability (FRAP) ( 7.8%).  Therefore, 30 minutes 80% VO2pk exercise induced oxidative stress in moderately active college men.  In study 4, four-week HGI supplementation produced plasma genistein and daidzein concentrations of 499 and 415 ng/ml, which were significantly increased to 633 and 539 ng/ml by exercise (P=0.04 and P=0.05).  Isoflavones significantly decreased in vivo pre-exercise plasma MDA (P<0.05), increased pre-exercise blood TGSH (P=0.01) and pre-exercise erythrocyte SOD activity (P=0.0006), and maintained the decreased activities of GPx due to exercise at pre-exercise levels.  Results demonstrated that isoflavones had antioxidant activity in vivo under normal physiological conditions in healthy young men.  They also maintaining GPx activity which was decreased due to exercise, however, isoflavones may not overcome all oxidative stress initiated by intense exercise.",
  "description_provenance": [
    "Author Email: chchen2@vt.edu",
    "Advisor Email: bakhit@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:17Z (GMT). No. of bitstreams: 3 bottom.pdf: 594008 bytes, checksum: 9c5540f7170ace9b8504bab3162e3063 (MD5) body.pdf: 2311834 bytes, checksum: 8c821e0faa7836925ff7ecf110e29953 (MD5) front.pdf: 42157 bytes, checksum: c9960d9a84931447ea83956714bcf020 (MD5)   Previous issue date: 2001-08-14"
  ],
  "handle": "28676",
  "identifier_other": "etd-08162001-111701",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08162001-111701/",
  "identifier_uri": "http://hdl.handle.net/10919/28676",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "bottom.pdf",
    "body.pdf",
    "front.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "glutathione",
    "oxidative stress",
    "antioxidant enzymes",
    "exercise",
    "lipid peroxidation"
  ],
  "title": "The Effects of Isoflavone Supplementation on Rats and Humans",
  "type": "Dissertation"
}