{
  "contributor_author": "Ko, Myeong  Chul",
  "contributor_committeecochair": [
    "Choi, Sang O.",
    "Hult, Karen M."
  ],
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "Sirgy, M. Joseph",
    "Roberts, Patrick S."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:15:15Z",
  "date_adate": "2011-08-31",
  "date_available": "2014-03-14T20:15:15Z",
  "date_issued": "2011-08-02",
  "date_rdate": "2011-08-31",
  "date_sdate": "2011-08-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "There have been extensive debates on the factors that influence local policy decisions. Although many researchers have contributed to uncovering various influences such as political, economic, institutional, and demographic factors on local policy decisions, however, the concept of QoL rarely has used in extant literature. Local government spending is likely to be affected by citizen demands for achieving community well-being. Additionally, given that different policy functions variably affect local circumstances, the impact of QoL on local policy decisions will depend on the policy area. Hence, this study examined the relationship between QoL and local budgetary decisions based on Petersonâ  s (1981) policy scheme of, three distinct policy arenas (developmental, allocational, and redistributive policy). In examining the relationship of QoL and city spending across policy functions, I also considered economic, political, institutional, and demographic factors, derived from various theoretical perspectives on local policy decisions.  The relative influences of community QoL as well as other factors on local policy decisions were estimated by two-stage least squares regression analysis (2SLS) for developmental spending and by ordinary least squares (OLS) for allocational and redistributive spending. To measure community QoL, this study used 89,066 completed surveys from 167 communities in the United States for 2002-2008 are used. QoL appeared as a critical factor influencing local government expenditures in the three policy areas. The impact of QoL on local spending in the three areas differed depending on city income levels; city income levels then moderated local policy decisions.  These findings suggest that local policy priorities adjusted in accordance with economic growth. Allocational policy functions also should be thought to be functions of cities geared toward giving them a competitive edge over other cities by meeting evolved citizen preferences for city amenities. These findings also point to distinct patterns of political activities in each policy arena. Given that community QoL reflects adjusted citizensâ   demands, I contend that community QoL can contribute to performance management by providing additional public information and a complementary performance indicator.",
  "description_provenance": [
    "Author Email: goodkomc@vt.edu",
    "Advisor Email: sang@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: sirgy@vt.edu",
    "Advisor Email: patrickroberts@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:15Z (GMT). No. of bitstreams: 1 Ko_MC_D_2011.pdf: 983619 bytes, checksum: d3305695f9e6889fbe7c0e79207fab33 (MD5)   Previous issue date: 2011-08-02"
  ],
  "handle": "28673",
  "identifier_other": "etd-08152011-124111",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08152011-124111/",
  "identifier_uri": "http://hdl.handle.net/10919/28673",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ko_MC_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "City Government Spending",
    "Local Policy Decisions",
    "Community Quality of Life"
  ],
  "title": "The Effects of Community Quality of Life on Local Policy Decisions",
  "type": "Dissertation"
}