{
  "contributor_author": "Zappettini, Kris",
  "contributor_committeechair": "Beamish, Julia O.",
  "contributor_committeemember": [
    "Goss, Rosemary Carucci",
    "Parrott, Kathleen R.",
    "Emmel, JoAnn",
    "Vela, Edward"
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2014-03-14T20:15:17Z",
  "date_adate": "2001-08-30",
  "date_available": "2014-03-14T20:15:17Z",
  "date_issued": "2001-03-22",
  "date_rdate": "2007-08-30",
  "date_sdate": "2001-08-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this research was to investigate the housing satisfaction of rural, self-help homeowners with respect to the interior of their houses.  This research surveyed households' satisfaction with respect to housing quality and residential space plan design.  Aspects of housing quality included: durability and maintenance of interior building materials; appliances (range, heating and cooling units); plumbing and electrical; and furnishings (cabinet, flooring, countertops). Aspects of residential space plan design included: storage areas, size of areas, and location of rooms and features. <p> The sample for this research included 303 homeowners who built their homes through the Community Housing Improvement Program's (CHIP) Rural Self-Help Program between years the 1991 and 1997. These households came from the California counties of Butte, Glenn, and Shasta.  Elements from the mail and drop off survey methods were used; 121 respondents returned the survey.  This yielded a 40% return rate. The data were analyzed using descriptive statistics (frequencies, percentages and means), chi-square, one-way ANOVA, independent samples t-test, and regression analyses.<p>  The mean age of respondents was 38 years and 78% were Hispanic.  Of those who completed the survey, 57% of the respondents were female and 42% were male. <p> The findings revealed that the respondents were moderately satisfied with the interior of their houses with respect to storage areas, size of rooms, location and features, and housing quality.  There was overall satisfaction with the interiors of their houses.  Analysis of all of the characteristics researched showed that respondents' overall opinion of housing quality, size of area, and storage area aspects were more important indicators of overall housing satisfaction than their overall opinion of location of rooms and features. Further analysis revealed that the location of the subdivisions, number of bedrooms, number of bathrooms, and demographic characteristics of the respondents were not a significant determinate of overall housing satisfaction.<p> With respect to skills learned during the self-help training process and the respondents' completion of their own alterations and modifications, both skills learned and the performance of alterations and modifications were correlated with overall housing satisfaction.  For respondents who completed simple and/or inexpensive improvements, the ability to complete the improvements was influenced in whole or in part by the training they received in the self-help training process.  Furthermore, the respondents who completed alterations or modifications were no more likely to be satisfied with the interiors of their houses than those respondents who performed no alterations or modifications.<p> Based upon the findings from this research, recommendations for both design of CHIP's future Rural Self-Help Housing developments and recommendations for policy development were formulated.",
  "description_provenance": [
    "Author Email: kzap@dcsi.net",
    "Advisor Email: jbeamish@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:17Z (GMT). No. of bitstreams: 1 01.pdf: 1474254 bytes, checksum: d0fc86965b77e4ab1b02ab672308bc22 (MD5)   Previous issue date: 2001-03-22"
  ],
  "handle": "28677",
  "identifier_other": "etd-08162001-184842",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08162001-184842/",
  "identifier_uri": "http://hdl.handle.net/10919/28677",
  "publisher": "Virginia Tech",
  "relation_haspart": "01.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "California",
    "home",
    "satisfaction",
    "interior design",
    "homeowner",
    "self-help"
  ],
  "title": "Rural Self-Help Housing:  A Post Occupancy Evaluation of Homeowners' Satisfaction With Residential Space Plan Design and Housing Quality",
  "type": "Dissertation"
}