{
  "contributor_author": "Ersado, Lire",
  "contributor_committeecochair": [
    "Alwang, Jeffrey R.",
    "Amacher, Gregory S."
  ],
  "contributor_committeemember": [
    "Alderman, Harold",
    "Norton, George W.",
    "McGuirk, Anya M.",
    "Mills, Bradford F."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:15:17Z",
  "date_adate": "2001-08-19",
  "date_available": "2014-03-14T20:15:17Z",
  "date_issued": "2001-07-23",
  "date_rdate": "2002-08-19",
  "date_sdate": "2001-08-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation explores household risk and savings behavior in Zimbabwe, and agricultural technology adoption, and the impact of public investments on the economy and community health in Ethiopia.  The first paper analyzes changes in per capita consumption and savings behavior in Zimbabwe before and after a range of financial and weather-related shocks using comparable national income, consumption and expenditure surveys of 1990/91 and 1995/96.  The empirical results show that before droughts and macroeconomic adjustments Zimbabweans used savings to smooth consumption.  In contrast, risk management strategies were severely limited after the shocks; consumption tracked income more closely in the latter period.  The inability to effectively address the risks arising from droughts and economy-wide structural changes implies that any subsequent economic and social uncertainty will have serious welfare consequences. <p> The second paper examines the interaction between public investments, community health, and productivity- and land-enhancing technology adoption decisions by farm households in Northern Ethiopia.  It models technology adoption as a sequential process where the timing of choices can matter.  The econometric test results indicate that the decision and intensity of technology adoption are highly correlated with the sequential nature of adoption.  The most striking results concern the importance of disease - the amount of time spent sick and time spent caring for sick family members are inversely associated with both the decision and intensity of technology adoption. <p> Finally the third paper looks at the welfare impacts of a public water resource development project with health side effects in Tigray, Northern Ethiopia.  It uses a model of a social planner to characterize the optimal implementation of such projects over time, showing how health and production are important considerations in this decision.  The empirical analysis shows that the marginal net benefits of Tigray's current microdam investments are positive.  The lost income households suffer from increased time away from productive activities (due to sickness) is compensated for by increased yields and market opportunities brought about through irrigated agriculture.  However, it should be noted that this conclusion is based on efficiency and not equity.",
  "description_provenance": [
    "Author Email: lersado@vt.edu",
    "Advisor Email: halderman@worldbank.org",
    "Advisor Email: gnorton@vt.edu",
    "Advisor Email: mcguirk@vt.edu",
    "Advisor Email: Bfmills@vt.edu",
    "Advisor Email: alwangj@vt.edu",
    "Advisor Email: gamacher@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:17Z (GMT). No. of bitstreams: 2 Vita.pdf: 91026 bytes, checksum: 7bf1bde9c1839bae7623fe35132d71b0 (MD5) ETD.pdf: 621072 bytes, checksum: 6eaaf355cb5518b41247965925284d9d (MD5)   Previous issue date: 2001-07-23"
  ],
  "handle": "28678",
  "identifier_other": "etd-08162001-201925",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08162001-201925/",
  "identifier_uri": "http://hdl.handle.net/10919/28678",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Vita.pdf",
    "ETD.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Sequential Adoption",
    "Zimbabwe",
    "Ethiopia",
    "Savings",
    "Health"
  ],
  "title": "THREE ESSAYS IN DEVELOPMENT ECONOMICS: SAVINGS BEHAVIOR AND RISK; HEALTH AND PUBLIC INVESTMENTS; AND SEQUENTIAL TECHNOLOGY ADOPTION",
  "type": "Dissertation"
}