{
  "contributor_author": "Kurdziolek, Margaret Angela",
  "contributor_committeechair": "Tatar, Deborah Gail",
  "contributor_committeemember": [
    "Ehrich, Roger W.",
    "Harrison, Steven R.",
    "Pérez-Quiñones, Manuel A.",
    "Roschelle, Jeremy M."
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2014-03-14T20:15:19Z",
  "date_adate": "2011-08-25",
  "date_available": "2014-03-14T20:15:19Z",
  "date_issued": "2011-08-05",
  "date_rdate": "2011-08-25",
  "date_sdate": "2011-08-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In the past, educators and policy makers believed that by providing more resources they could directly improve student-learning outcomes. To their frustration, this turns out not to be entirely true.  Resources may be necessary but they are not sufficient.  Resources themselves are not self-enacting, that is, they do not make change inevitable. Differences in their effects depend on differences in their use. This is also true in the case of educational technologies. As developers of these technologies we need to understand how resources fit within the classroom environment as enacted and how they can be effectively used to increase student learning.   I report on four case studies conducted within the context of the Scaling-Up SimCalc study. In the study, â  treatmentâ   teachers were given a set of new resources to use: a combination of curriculum, educational software, and teacher professional development. â  Delayed treatmentâ   (control) teachers were asked to use their usual curriculum. Year-one study results demonstrated by randomized controlled testing the successful use of technology in class settings; however, there was little information on how the students and teachers actually interacted with the resources.   Case study classrooms were selected to examine the effects of variation of computational resource arrangements: one utilized a computer lab, two used mobile laptop carts, and one used a laptop connected to a projector. The first round coding and analysis shows that the observed classrooms varied not only in their classroom set-ups but also in how teachers and students interacted with the software, the workbooks, and with one another. The variety of resource interaction points to the robustness of the SimCalc project: students and teachers can interact with the SimCalc resources in a variety of ways and still achieve student-learning gains. However, through subsequent review and analysis of the observation data five themes emerged. These themes suggest commonalities in classrooms practices surrounding the use of resources. Two new theoretical constructs, â  socio-physical resource richnessâ   and â  resource use withitnessâ  , help describe (1) physical and social arrangements of resources and (2) how teachers and students manage resource use.",
  "description_provenance": [
    "Author Email: meg.kurdziolek@gmail.com",
    "Advisor Email: rehrich@vt.edu",
    "Advisor Email: srh@cs.vt.edu",
    "Advisor Email: perez@CS.VT.EDU",
    "Advisor Email: jeremy.roschelle@sri.com",
    "Advisor Email: tatar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:19Z (GMT). No. of bitstreams: 2 Kurdziolek_MA_D_2011.pdf: 3957517 bytes, checksum: 59f8faedc3768e8b23fea870dc9a22ab (MD5) Kurdziolek_MA_D_2011_Copyright.pdf: 149950 bytes, checksum: 802c176eba75f391264b7a509b20f105 (MD5)   Previous issue date: 2011-08-05"
  ],
  "handle": "28687",
  "identifier_other": "etd-08162011-160010",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08162011-160010/",
  "identifier_uri": "http://hdl.handle.net/10919/28687",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Kurdziolek_MA_D_2011.pdf",
    "Kurdziolek_MA_D_2011_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "SimCalc MathWorlds",
    "Resource use withitness",
    "Socio-physical resource richness",
    "Educational technology",
    "Classroom resources",
    "SimCalc"
  ],
  "title": "Classroom resources and impact on learning",
  "type": "Dissertation"
}