{
  "contributor_author": "Blosser, Phillip E.",
  "contributor_committeechair": "Mihalik, Brian J.",
  "contributor_committeemember": [
    "Karen P. DePauw",
    "Nancy G. McGehee",
    "Muzaffer S. Uysal"
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:15:18Z",
  "date_adate": "2009-09-02",
  "date_available": "2014-03-14T20:15:18Z",
  "date_issued": "2009-08-05",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-08-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Cities and countries increasingly seek mega-events to boost tourism, update local infrastructure, and improve the international standing of the host community.  Benefits are actively promoted by the organizing committees, but these large-scale events also create significant economic, environmental and social costs for the host community. Measuring resident support is necessary because their support is required to secure the rights to the event, and to provide the necessary economic and human resources needed for hosting the event. <p> This study utilized existing data on the 1996 Atlanta Olympic Games to investigate the impact of a mega-event on the host community, and to measure resident support for the event. Social exchange theory provided the theoretical background for this dissertation. The theory states that the costs and benefits of an exchange are continually re-evaluated by the actors in the exchange relationship. The primary contribution of this study is support for the notion that social exchanges are temporal in nature; residents continually monitored the positive and negative impacts of the event on themselves and on their community.  To reach this conclusion, this study utilized four data points in the year leading up to the Olympics to assess the changes in residentsâ   perceptions of the impacts of the event over time. These changes were evaluated in light of residentsâ   support for the event. A factor analysis reduced the fifteen impact statements into three factors: Benefits, Local Problems, and External Problems.  Residents were segmented according to their assessment of the event impacts, resulting in three clusters: Supporters, Cynics, and Realists. Proximity to the main event location also was evaluated since this variable has had mixed results in previous resident studies.  <p> Results showed that resident perceptions varied over time, thus providing support for monitoring residents over multiple time periods.  In addition, residentsâ   support and residentsâ   plans to attend the event were contributing factors in the assessment of the Benefits and Local Problems.  Supporters, Cynics, and Realists demonstrated significant differences over time in their assessment of External Problems, and proximity to the event was found to be a significant factor in residentsâ   assessment of Local Problems.",
  "description_provenance": [
    "Author Email: pblosser@vt.edu",
    "Advisor Email: kpdepauw@vt.edu",
    "Advisor Email: nmcgehee@vt.edu",
    "Advisor Email: samil@vt.edu",
    "Advisor Email: bmihalik@hrsm.sc.edu",
    "Made available in DSpace on 2014-03-14T20:15:18Z (GMT). No. of bitstreams: 1 Blosser_PE_D_2009.pdf: 905948 bytes, checksum: 70a7f5e53a90d5208d9f9c92d2afcf56 (MD5)   Previous issue date: 2009-08-05"
  ],
  "handle": "28685",
  "identifier_other": "etd-08162009-173021",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08162009-173021/",
  "identifier_uri": "http://hdl.handle.net/10919/28685",
  "publisher": "Virginia Tech",
  "relation_haspart": "Blosser_PE_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Mega-event",
    "Social Exchange Theory",
    "Longitudinal",
    "Resident Perceptions",
    "Olympic Games"
  ],
  "title": "Changes in Resident Perceptions Over Time: A Theoretical Examination of a Mega-Event",
  "type": "Dissertation"
}