{
  "contributor_author": "Faierson, Eric J.",
  "contributor_committeechair": "Logan, Kathryn V.",
  "contributor_committeemember": [
    "Clark, David E.",
    "Dowling, Norman E.",
    "Kiefer, Richard L."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:15:19Z",
  "date_adate": "2011-09-11",
  "date_available": "2014-03-14T20:15:19Z",
  "date_issued": "2011-08-04",
  "date_rdate": "2011-09-11",
  "date_sdate": "2011-08-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Ceramic and refractory metal foams have a potential for use in extreme environments, such as in fuel elements within nuclear reactors both in space and terrestrial applications.  In addition, infiltrating an open-cell ceramic foam with a continuous second phase can create an interpenetrating phase composite (IPC), consisting of a three-dimensional reinforcement structure.  One aspect of investigation within this study was the influence of foam pore/strut size, foam composition, and foam density on neutronic and mechanical properties.  Neutron transmission through open-cell tantalum carbide foams was measured using experimental techniques and modeled with Monte Carlo N-Particle (MCNP) transport code.  Neutron transmission decreased linearly within tantalum carbide (TaC)/reticulated vitreous carbon (RVC) foams as areal TaC density increased.  All MCNP modeling runs predicted slightly higher neutron transmission than what was experimentally measured, potentially indicating that the foam structure had a small influence on neutron transmission.  Compressive strength and Youngâ  s moduli of  tantalum carbide foams were measured for foam specimens that were exposed to thermal cycling and thermal shock, as well as for baseline specimens.  Extensive micro-cracking was observed in the foams after 18 thermal cycles to 2100Â° C.  However, thermal shock in liquid nitrogen did not produce observable micro-cracking in the TaC foams. The average strengths of baseline TaC/RVC foams ranged from 1.97 MPa - 3.82 MPa.  The baseline TaC/PyC/RVC foams exhibited strengths ranging from 4.57 MPa - 12.60 MPa.  The compressive strength of thermally cycled foams tended to be 1/3-1/2 that of baseline specimens.   <br><br> Another aspect of this study investigated the infiltration of RVC foams with tungsten powder in an attempt to form a tungsten-ceramic foam interpenetrating phase composite (IPC).  It was found that tungsten particle size influenced infiltrated densities more than foam pore size.  Significantly lower infiltrated densities were obtained using sub-micron tungsten than with 5-10 micron tungsten as a result of particle agglomeration.  Infiltrated 5-10 micron tungsten achieved densities ranging from 23-25% theoretical within RVC foams, whereas sub-micron tungsten densities ranged from 11-16% theoretical.  Constrained densification was observed during sintering of tungsten-infiltrated foams.",
  "description_provenance": [
    "Author Email: faierson@vt.edu",
    "Advisor Email: kvlogan@vt.edu",
    "Advisor Email: dclark@mse.vt.edu",
    "Advisor Email: ndowling@vt.edu",
    "Advisor Email: rlkief@wm.edu",
    "Made available in DSpace on 2014-03-14T20:15:19Z (GMT). No. of bitstreams: 1 Faierson_EJ_D_2011.pdf: 28696282 bytes, checksum: 78b1dbe2a1fb56c07c70252f9e851ed4 (MD5)   Previous issue date: 2011-08-04"
  ],
  "handle": "28688",
  "identifier_other": "etd-08162011-173332",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08162011-173332/",
  "identifier_uri": "http://hdl.handle.net/10919/28688",
  "publisher": "Virginia Tech",
  "relation_haspart": "Faierson_EJ_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "foam",
    "composite",
    "neutron",
    "nuclear fuel"
  ],
  "title": "Structure-Property Relationships of Tantalum Carbide Foams and Synthesis of an Interpenetrating Phase Composite",
  "type": "Dissertation"
}