{
  "contributor_author": "Rakes, Edward Lee",
  "contributor_committeechair": "Jones, Brett D.",
  "contributor_committeemember": [
    "Doolittle, Peter E.",
    "Stratton, Richard K.",
    "Williams, Thomas O. Jr."
  ],
  "contributor_department": "Educational Psychology",
  "date_accessioned": "2014-03-14T20:15:19Z",
  "date_adate": "2012-09-24",
  "date_available": "2014-03-14T20:15:19Z",
  "date_issued": "2012-08-09",
  "date_rdate": "2012-09-24",
  "date_sdate": "2012-08-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This investigation used an experimental design to examine how a visual imagery intervention and two levels of challenge would affect the flow experiences and performance of cadets engaged in Army ROTC marksmanship training. I employed MANCOVA analyses, with gender and prior marksmanship training experience as covariates, to assess cadetsâ   (n = 127) marksmanship performance and flow experiences. Findings revealed that the use of visual imagery did not positively enhance flow and improve performance with statistical certainty. The results, however, might be practically significant because they showed that when cadets were faced with a more challenging situation and had engaged in visual imagery exercises, they were more likely to outperform cadets in the same challenge condition who had not engaged in visual imagery exercises. On average, cadets in the high challenge condition who engaged in visual imagery exercises outperformed non-visual imagery cadets in the same condition by over one point on a six-point scale. Additional findings revealed that level of challenge did not affect flow experiences, which is counter to the postulates of flow theory. Level of challenge did, however, negatively impact performance. That is, when cadets were faced with a more challenging situation, they performed more poorly. Prior experience Ì¶ and by extension skill level Ì¶ was discovered to better facilitate flow experiences, as opposed to a balance of challenge and skills. Higher levels of prior marksmanship training experience were associated with cadetsâ   potential to enter the flow state. Additionally, males rated flow significantly higher than their female counterparts. Males also significantly outperformed females. Implications for future research investigating how challenge and visual imagery affect flow experiences and performance in the context of Army ROTC marksmanship training are discussed.",
  "description_provenance": [
    "Author Email: elrakes@vt.edu",
    "Advisor Email: brettjones@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: thwilli1@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:19Z (GMT). No. of bitstreams: 1 Rakes_EL_D_2012.pdf: 762673 bytes, checksum: 269bfb49a8f5fd5ca36d179df8ed7ab8 (MD5)   Previous issue date: 2012-08-09"
  ],
  "handle": "28689",
  "identifier_other": "etd-08162012-171717",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08162012-171717/",
  "identifier_uri": "http://hdl.handle.net/10919/28689",
  "publisher": "Virginia Tech",
  "relation_haspart": "Rakes_EL_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "Flow; Visual imagery; Marksmanship Training; Army",
  "title": "The impact of a visual imagery intervention on Army ROTC cadetsâ   marksmanship performance and flow experiences",
  "type": "Dissertation"
}