{
  "contributor_author": "Maddalena, Luca",
  "contributor_committeechair": "Schetz, Joseph A.",
  "contributor_committeemember": [
    "Wang, Joseph J.",
    "Ng, Fai",
    "Devenport, William J.",
    "Bruno, Claudio"
  ],
  "contributor_department": "Aerospace and Ocean Engineering",
  "date_accessioned": "2014-03-14T20:15:18Z",
  "date_adate": "2007-09-19",
  "date_available": "2014-03-14T20:15:18Z",
  "date_issued": "2007-07-25",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-08-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Investigations of Injectors for Scramjet Engines   Luca Maddalena       An experimental study of an aerodynamic ramp (aeroramp) injector was conducted at Virginia Tech. The aeroramp consisted of an array of two rows with two columns of flush-wall holes that induce vorticity and enhance mixing. For comparison, a single-hole circular injector with the same area angled downstream at 30 degrees was also examined. Test conditions involved sonic injection of helium heated to 313 K, to safely simulate hydrogen into a Mach 4 air cross-stream with average Reynolds number 5.77 e+7 per meter at a jet to freestream momentum flux ratio of 2.1. Sampling probe measurements were utilized to determine the local helium concentration. Pitot and cone-static pressure probes and a diffuser thermocouple probe were employed to document the flow. The main results of this work was that the mixing efficiency value of this aeroramp design which was optimized at Mach 2.4 for hydrocarbon fuel was only slightly higher than that of the single-hole injector at these flow conditions and the mass-averaged total pressure loss parameter showed that the aero-ramp and single-hole injectors had the same overall losses. The natural extension of the investigation was then to look in detail at two major physical phenomena that occurs in a complex injector design such the Aeroramp: the jet-shock interaction and the interaction of the vortical structures produced by the jets injection into a supersonic cross flow. Experimental studies were performed to investigate the effects of impinging shocks on injection of heated helium into a Mach 4 crossflow. It was found that the addition of a shock behind gaseous injection into a Mach 4 crossflow enhances mixing only if the shock is closer to the injection point where the counter-rotating vortex pair (always associated with transverse injection in a crossflow) is not yet formed, and the deposition of baroclinic generated of vorticity is the highest. The final investigation concerned with the interaction of the usual vortex structure produced by jet injection into a supersonic crossflow and an additional axial vortex typical of those that might be produced by the inlet of a scramjet or the forebody of a vehicle to be controlled by jet interaction phenomena. The additional axial vortices were generated by a strut-mounted, diamond cross-section wing mounted upstream of the injection location. The wing was designed to produce a tip vortex of a strength comparable to that of one of the typical counter-rotating vortex pair (CVP) found in the plume of a jet in a crossflow. The profound interaction of supersonic vortices supported by a quantitative description and characterization of the flowfield has been demonstrated.",
  "description_provenance": [
    "Author Email: maddalen@vt.edu",
    "Advisor Email: jowang@vt,edu",
    "Advisor Email: wng@vt.edu",
    "Advisor Email: devenport@vt.edu",
    "Advisor Email: bruno@dma.ing.uniroma1.it",
    "Advisor Email: ptiger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:18Z (GMT). No. of bitstreams: 1 Luca_diss_v7.pdf: 4688451 bytes, checksum: 38824c0694ea0a2457fd6b4910e517ee (MD5)   Previous issue date: 2007-07-25"
  ],
  "handle": "28683",
  "identifier_other": "etd-08162007-121431",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08162007-121431/",
  "identifier_uri": "http://hdl.handle.net/10919/28683",
  "publisher": "Virginia Tech",
  "relation_haspart": "Luca_diss_v7.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "vortex dynamics",
    "mixing",
    "scramjets",
    "experimental fluid mechanics"
  ],
  "title": "Investigations of Injectors for Scramjet Engines",
  "type": "Dissertation"
}