{
  "contributor_author": "Le Fer, Danielle",
  "contributor_committeechair": "Fraser, James D.",
  "contributor_committeemember": [
    "Stauffer, Dean F.",
    "Haas, Carola A.",
    "Benfield, Ernest Fredrick",
    "Newcomb, Tammy J.",
    "Walters, Jeffery R."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:15:20Z",
  "date_adate": "2006-10-17",
  "date_available": "2014-03-14T20:15:20Z",
  "date_issued": "2006-04-27",
  "date_rdate": "2008-10-17",
  "date_sdate": "2006-08-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Great Plains piping plover (Charadrius melodus) population was listed as threatened under the Endangered Species Act in 1986.  The challenge for managers of this population is to increase the fledging rate and to ensure that there is sufficient habitat to support an increasing population.  According to the revised recovery plan, there are insufficient quantitative data that relate habitat characteristics to reproductive success in riverine habitat.  In particular, additional data are needed to determine if piping plover reproduction is limited by food abundance at breeding sites. The goal of this research was to determine whether piping plover chick survival was limited by foraging site quality on the Missouri River.  Productivity has historically varied among river reaches.  The alkali wetlands, reported to be very productive, serve as an index to the upper limit of reproductive potential.  We compared indices of foraging site quality, chick growth and survival among a reservoir, two river reaches and alkali wetland sites from 2001-2003.  We compared piping plover use of protected shoreline and exposed shoreline to availability along two reaches of the Missouri River (Gavins and Garrison).  We also examined piping plover chick diet.  Chick weight gains were higher at alkali wetlands than Gavins and Garrison.  Invertebrate numbers were higher at the alkali wetlands than the three river sites and lowest downstream of the cold water release dam.  Invertebrate biomass was highest at the alkali wetlands and downstream of the warm water release dam and lowest downstream of the cold water release dam.  Invertebrate biomass downstream of the cold water release dam was the lowest of all 4 sites.  There was no relationship between chick daily survival rates and invertebrate biomass or predator presence.  Although Diptera occurred more frequently (23% - 64%) at all sites (sticky traps), Coleoptera occurred most frequently in the fecal samples (fecal analysis; 69% to 89%).  On the Missouri River, protected shorelines were important foraging sites for piping plovers during the breeding season.  We also found that sandbars with low-lying moist habitat are important to foraging chicks.  Results are consistent with the prediction that foraging conditions downriver from cold water release dams are inferior to conditions in other habitats in the region.  Differences in prey availability are reflected in chick growth rates, but not in survival rates.  These results underscore the variability in different indices of habitat quality (invertebrate indices, predation, growth rates, survival rates) among the four sites, and the need for monitoring and management strategies that address each site individually.  When managing or creating sandbars, ensuring the availability of protected shoreline will benefit piping plovers on the Missouri River.",
  "description_provenance": [
    "Author Email: dlefer@vt.edu",
    "Advisor Email: dstauffe@vt.edu",
    "Advisor Email: cahaas@vt.edu",
    "Advisor Email: benfield@vt.edu",
    "Advisor Email: fraser@vt.edu",
    "Advisor Email: newcombt@michigan.gov",
    "Advisor Email: jrwalt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:20Z (GMT). No. of bitstreams: 1 LeFer.pdf: 553989 bytes, checksum: 92d5dc7d430b295d6edf21a0e45fc479 (MD5)   Previous issue date: 2006-04-27"
  ],
  "handle": "28695",
  "identifier_other": "etd-08172006-104701",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08172006-104701/",
  "identifier_uri": "http://hdl.handle.net/10919/28695",
  "publisher": "Virginia Tech",
  "relation_haspart": "LeFer.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "invertebrate",
    "foraging",
    "growth rates",
    "Piping plover"
  ],
  "title": "Piping plover (Charadrius melodus) foraging ecology in the Great Plains",
  "type": "Dissertation"
}