{
  "contributor_author": "Robert, Courtney Adele",
  "contributor_committeechair": "Estabrooks, Paul A.",
  "contributor_committeemember": [
    "McFerren, Mary M.",
    "Hart, Michael",
    "Serrano, Elena L."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:15:21Z",
  "date_adate": "2010-09-16",
  "date_available": "2014-03-14T20:15:21Z",
  "date_issued": "2010-07-22",
  "date_rdate": "2010-09-16",
  "date_sdate": "2010-08-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The prevalence and severity of childhood overweight has climbed dramatically in the past three decades and is recognized as a serious public health concern that requires urgent action. The home environment has been identified as a key influence on the diet and physical activity of children. Furthermore, low-income families experience obesity at higher rates and current interventions have not been translated from research to practice settings. Therefore, there is a need to evaluate the potential for evidence-based obesity treatment strategies to be translated into community or clinical delivery settings that reach broadly into the population of low-income families. In addition, while the home environment has successfully been targeted to treat childhood obesity, there is a paucity of measurement tools available to provide a comprehensive assessment of the home physical and social environment as it pertains to physical activity and dietary intake. This dissertation includes: (1) a mixed-methods study to determine the feasibility and effectiveness of a childhood obesity treatment intervention based on a partnership with a Health Care Organization and delivered through Cooperative Extension, (2) a systematic review of home environmental measures related to physical activity and dietary intake, and (3) a home environment measure development and validation study.  Smart Choices for Healthy Families (SC) was developed through a research-practice partnership that included a local healthcare provider (Carilion Clinic), Virginia Cooperative Extension (VCE), and an interdisciplinary research team. The aim of this study was to assess the reach, implementation, and effectiveness of SC to reduce the BMI z-scores of overweight and obese children from low-income families. The resultant intervention, based on an evidence-based social-ecological model, included brief physician counseling and referral, six-biweekly group    sessions taught by VCE lay leaders, and six automated telephone counseling calls on alternate weeks. Twenty-six of 264 eligible children (50% boys; mean age=10.5 years) were recruited and 78% completed baseline and 3-month assessments. Over the 6 class sessions, there was an average 65% attendance rate and an average 58% completion rate for the automated telephone calls. Results revealed a significant reduction in childrenâ  s BMI z-score (p<0.01), an increase in lean muscle mass (p<0.001) and weight (p<0.05), and an increase in Health Related Quality of Life (HRQL; p<0.0001). The participating group had a higher income (p<0.05) and also participated in fewer food assistance programs (p<0.05). Despite this small difference, Smart Choices reached a sample that was representative of the larger target population and was effective in reducing BMI z-score, increasing lean muscle mass, and improving HRQL of low-income obese children.  \tA systematic review was conducted of the measures of the home environment in order to collect and synthesize the current body of literature. It was found that some authors choose to use non-validated measures and that there is an inconsistent use of measures across the field, making comparisons between studies difficult and conclusions regarding parental influence on childhood obesity difficult to discern. The psychometric properties that were reported on these studies are reported in this review. Through the systematic review of literature a number of measures were identified that assessed different aspects of the home environment. These measures were compiled and combined to generate a comprehensive tool to assess the physical and social aspects of the home environment that could influence eating and physical activity. This measure plus a social-ecological framework for the measure were provided to experts in the field who provided information on potential areas that had been overlooked and advice on additions or contractions        of items and scales. The modified measure, the Comprehensive Home Environment Survey (CHES), was then tested for reliability and validity in a low-income audience. Parent-child dyads (n=132; Children 47% girls, age range 5 to 17; Parent 82% mothers; mean age=36) were recruited through a pediatric clinic in Roanoke, Virginia, that serves a primarily low-income audience (i.e., 95% eligible for Medicaid). Each of these parents completed the assessment tool and additional surveys to assess concurrent and predictive validity. Height and weight was assessed in each child, and children between the ages of 9 and 17 also completed nutrition and physical activity self-report surveys. Test-retest reliability was assessed in 43 parents who complete the survey a second time one-to-two-weeks following the initial assessment. Inter-rater reliability was assessed in 36 cases by having a spouse or second care-giver complete the assessment tool. Internal consistency, test-retest, inter-rater reliability, and predictive validity all showed promising results. Across the scales internal consistency was adequate to high with Cronbachâ  s Alphas ranging from 0.67-0.92, test-retest reliability was high with Pearson Correlations ranging from 0.73-0.97 and inter-rater reliability was higher with Pearson Correlations ranging from 0.42-0.92. Finally, the CHES displayed predictive validity with subscale scores predicting outcome behaviors (e.g., parents who modeling more physical activity had children who were more active). \tThis dissertation demonstrated that the home environment is a key factor in the treatment of childhood obesity and provides avenues for both intervention and measurement in this field of study.",
  "description_provenance": [
    "Author Email: crobert@vt.edu",
    "Advisor Email: mmcferre@vt.edu",
    "Advisor Email: mhhart@carilionclinic.org",
    "Advisor Email: serrano@vt.edu",
    "Advisor Email: estabrkp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:21Z (GMT). No. of bitstreams: 1 Robert_Courtney_D_2010_2.pdf: 1139084 bytes, checksum: 78e559df8a465d0b4fdbce61e44ec9d1 (MD5)   Previous issue date: 2010-07-22"
  ],
  "handle": "28698",
  "identifier_other": "etd-08172010-090331",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08172010-090331/",
  "identifier_uri": "http://hdl.handle.net/10919/28698",
  "publisher": "Virginia Tech",
  "relation_haspart": "Robert_Courtney_D_2010_2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "low-income",
    "dissemination",
    "measurement",
    "childhood obesity"
  ],
  "title": "Childhood Obesity and the Home Environment",
  "type": "Dissertation"
}