{
  "contributor_author": "Artis, Sharnnia",
  "contributor_committeecochair": [
    "Smith-Jackson, Tonya L.",
    "Kleiner, Brian M."
  ],
  "contributor_committeemember": [
    "Scales, Glenda Rose",
    "Winchester, Woodrow W. III"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:15:20Z",
  "date_adate": "2007-10-25",
  "date_available": "2014-03-14T20:15:20Z",
  "date_issued": "2007-07-20",
  "date_rdate": "2007-10-25",
  "date_sdate": "2007-08-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Workplace safety, if not managed appropriately, can result in human and economic tolls.  The need to establish and maintain a safe working environment has probably never been more important.  Despite a mounting emphasis on safe work practices, the Bureau of Labor Statistics (BLS) reported a total of 5,702 fatalities in the United States in 2005.  Among these fatalities, Latino workers, defined as both foreign-born and native-born (U.S.-born) workers of Latino ethnicity (BLS, 2006; Dong and Platner, 2004), accounted for 16% of those fatalities (BLS, 2006).     Researchers are increasingly acknowledging that organizational factors are important in workplace safety (Hofmann, Jacobs, and Landy, 1995; Hurst, Bellamy, Geyer, and Ashley, 1991).  However, there is a lack of cross-cultural comparison in this area.  With the continuing increase in Latino construction workers and the level of injuries and fatalities, little attention has focused on the comparison of employment relationships between Latino and non-Latino construction workers and their supervisors and work environment.  Therefore, this research endeavor used social exchange theory to examine the role of organizational factors in small construction firms to help explain why Latino workers have a disproportionate number of construction casualties compared to their non-Latino counterparts and to design a safety training program to help reduce the number of injuries, accidents, and fatalities in the workplace.     The results of this is research endeavor demonstrated that both Latino and non-Latino and Latino groups had relatively equal perceptions of organizational support and distributive justice implying that Latinos and Latinos have identical support needs or that the construction firms' practices meet the support the workers need regardless of ethnicity.  In addition, the study found ethnic group differences for safety climate, safety behavior, and cultural dimensions, which may contribute to the disproportionate number of fatalities for Latino workers.   After uncovering group differences, this study tested the affect of training on perceived organizational support, distributive justice, safety climate, and safety behavior.  This research demonstrated that providing training, of any type, as a source of perceived organizational support increases workers' perception of organizational support.  Additionally, the study concluded that embedded sources of perceived organizational support in the training program increase workers' perceptions of distributive justice and safety climate.  As a result, guidelines to improve workers' perception of organizational support and safety climate were created.  Since high perceptions of safety climate are linked to less risky safety behaviors, embedding perceived organizational support into training programs can have an indirect affect on the workers' safety behavior.  For that reason, improving the safety behavior of workers and the workers' perception of a safe work environment can lead to reduced accidents, injuries, and fatalities in the construction industry.",
  "description_provenance": [
    "Author Email: sartis@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: gscales@vt.edu",
    "Advisor Email: wwwinche@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:20Z (GMT). No. of bitstreams: 1 Sharnnia_Artis_dissertation.pdf: 6383199 bytes, checksum: a6843353faa7610899ee5df4fb451377 (MD5)   Previous issue date: 2007-07-20"
  ],
  "handle": "28696",
  "identifier_other": "etd-08172007-142231",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08172007-142231/",
  "identifier_uri": "http://hdl.handle.net/10919/28696",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sharnnia_Artis_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Latino construction workers",
    "perceived organizational support",
    "safety training"
  ],
  "title": "The Effects of Perceived Organizational Support on Training and Safety in  Latino and Non-Latino Construction Workers",
  "type": "Dissertation"
}