{
  "contributor_author": "Ripepi, Nino Samuel",
  "contributor_committeechair": "Karmis, Michael E.",
  "contributor_committeemember": [
    "Luxbacher, Kramer Davis",
    "Westman, Erik Christian",
    "Luttrell, Gerald H.",
    "Nieto, Antonio V."
  ],
  "contributor_department": "Mining and Minerals Engineering",
  "date_accessioned": "2014-03-14T20:15:20Z",
  "date_adate": "2009-09-03",
  "date_available": "2014-03-14T20:15:20Z",
  "date_issued": "2009-08-03",
  "date_rdate": "2009-09-03",
  "date_sdate": "2009-08-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The mitigation of greenhouse gas emissions and enhanced recovery of coalbed methane are benefits to sequestering carbon dioxide in coal seams.  This is possible because of the affinity of coal to preferentially adsorb carbon dioxide over methane. Coalbed methane is the most significant natural gas reserve in central Appalachia and currently is economically produced in many fields in the Basin.  This thesis documents research that assesses the capacity of coal seams in the Central Appalachian Basin to store carbon dioxide and verifies the assessment through a field validation test.      This research allowed for the first detailed assessment of the capacity for coal seams in the Central Appalachian Basin to store carbon dioxide and enhance coalbed methane recovery.  This assessment indicates that more than 1.3 billion tons of carbon dioxide can be sequestered, while increasing coalbed methane reserves by as much as 2.5 trillion cubic feet.  As many of the coalbed methane fields are approaching maturity, carbon sequestration and enhanced coalbed methane recovery has the potential to add significant recoverable reserves and extend the life of these fields.     As part of this research, one thousand tons of carbon dioxide was successfully injected into a coalbed methane well in Russell County, Virginia as the first carbon dioxide injection test in the Appalachian coalfields. Research from the field validation test identified important injection parameters and vital monitoring technologies that will be applicable to commercial-scale deployment.         Results from the injection test and subsequently returning the well to production, confirm that fractured coal seams have the potential to sequester carbon dioxide and increase methane production. It was demonstrated through the use of perfluorocarbon tracers that there is a connection through the coal matrix between the injection well and surrounding producing gas wells.  This connection is a cause for concern because it is a path for the carbon dioxide to migrate to the producing wells.   The thesis concludes by presenting options for mitigating carbon dioxide breakthrough in commercial-scale injection projects.",
  "description_provenance": [
    "Author Email: nripepi@vt.edu",
    "Advisor Email: kraylux@vt.edu",
    "Advisor Email: ewestman@vt.edu",
    "Advisor Email: luttrell@vt.edu",
    "Advisor Email: mkarmis@vt.edu",
    "Advisor Email: anieto@psu.edu",
    "Made available in DSpace on 2014-03-14T20:15:20Z (GMT). No. of bitstreams: 1 Ripepi.Dissertation.pdf: 8184109 bytes, checksum: d3709fe684d00a552d18e1b604fbb4c7 (MD5)   Previous issue date: 2009-08-03"
  ],
  "handle": "28697",
  "identifier_other": "etd-08172009-121452",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08172009-121452/",
  "identifier_uri": "http://hdl.handle.net/10919/28697",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ripepi.Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Carbon Sequestration",
    "Coal",
    "Methane",
    "Virginia"
  ],
  "title": "Carbon Dioxide Storage in Coal Seams with Enhanced Coalbed Methane Recovery: Geologic Evaluation, Capacity Assessment and Field Validation of the Central Appalachian Basin",
  "type": "Dissertation"
}