{
  "contributor_author": "Hall, Amy Conlin",
  "contributor_committeechair": "Lalik, Rosary V.",
  "contributor_committeemember": [
    "Belli, Gabriella M.",
    "Magliaro, Susan G.",
    "Robinson, Carol"
  ],
  "contributor_department": "Education",
  "date_accessioned": "2014-03-14T20:15:22Z",
  "date_adate": "2011-09-09",
  "date_available": "2014-03-14T20:15:22Z",
  "date_issued": "2011-08-03",
  "date_rdate": "2011-09-09",
  "date_sdate": "2011-08-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This descriptive study was designed to be a detailed, informative study of a group of adult males who have been gamers since adolescence.  The purposes of the study are to provide information regarding gaming as a literacy practice and to explore other vernacular technological literacy practices.  The study sheds light on the merits of gaming and other new literacies by examining the literacy development of a select group of adult males.  This research was centered on vernacular technological literacy practices, the evolution of gaming practices, gaming intersections, and supporting school-based literacy.  Through extensive interviews with the researcher, the selected participants disclosed their gaming experiences as both adolescents and adults. They also shared their personal connections to gaming, and the technological literacy practices they are using in their present lives.",
  "description_provenance": [
    "Author Email: aaconlin@gmail.com",
    "Advisor Email: rlalik@vt.edu",
    "Advisor Email: gbelli@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: carobin10@verizon.net",
    "Made available in DSpace on 2014-03-14T20:15:22Z (GMT). No. of bitstreams: 1 Hall_AC_D_2011.pdf: 1060169 bytes, checksum: 7d00385105d30afcfae8f5d3426c5d22 (MD5)   Previous issue date: 2011-08-03"
  ],
  "handle": "28700",
  "identifier_other": "etd-08172011-114230",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08172011-114230/",
  "identifier_uri": "http://hdl.handle.net/10919/28700",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hall_AC_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Interpretivist",
    "Literacy",
    "Males",
    "Gaming",
    "Adolescent"
  ],
  "title": "Gaming as a Literacy Practice",
  "type": "Dissertation"
}