{
  "contributor_author": "Knowles III, John William",
  "contributor_committeechair": "Wildman, Terry M.",
  "contributor_committeemember": [
    "Johnston, Sally N.",
    "Fine, Elizabeth C.",
    "Smith, Robert M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:15:23Z",
  "date_adate": "2006-08-22",
  "date_available": "2014-03-14T20:15:23Z",
  "date_issued": "2006-07-14",
  "date_rdate": "2007-08-22",
  "date_sdate": "2006-08-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This qualitative study examined the changes that have occurred due to global and hemispheric market forces, and particularly through Hispanic immigration, in a small town in Southwest Virginia.  The interdisciplinary study is written as a narrative, and includes descriptions of the town and people of Galax, Virginia and of the predominately Mexican immigrants who have come to live there.  The primary focus is on the changes and challenges that occur in schools from the perspective of teachers and administrators, as well as from the students.  Local residents and Hispanic immigrants alike share their perspectives on the impacts of immigration and their efforts to accommodate changes in their lives and communities.  The researcher draws from his personal experience as an immigrant to Mexico to probe the search for identity and meaning that are common to immigrants.  The study found that Hispanic children have devised an unofficial dual-language peer support system for learning in the classrooms that circumvents the assimilationist approach to which the schools have adhered. Immigrant children experience marginalization even in caring school environments such as those found in the Galax schools, due largely to the lack of preparation of teachers and administrators in culturally appropriate pedagogy.  The study calls for more direct involvement between the university and local communities experiencing significant change due to global forces.  Demographic change through immigration impacts schools implicitly, and requires the support and education of teachers and administrators through regional schools of education.",
  "description_provenance": [
    "Author Email: joknowle@vt.edu",
    "Advisor Email: tepcce@charternet.com",
    "Advisor Email: bfine@vt.edu",
    "Advisor Email: rsmith1@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:23Z (GMT). No. of bitstreams: 1 Knowlesetd7-20-06.pdf: 3314966 bytes, checksum: 370b38f62ad185e1b258ab65d1a5c22f (MD5)   Previous issue date: 2006-07-14"
  ],
  "handle": "28709",
  "identifier_other": "etd-08182006-145847",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08182006-145847/",
  "identifier_uri": "http://hdl.handle.net/10919/28709",
  "publisher": "Virginia Tech",
  "relation_haspart": "Knowlesetd7-20-06.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "globalization",
    "schools",
    "immigrant",
    "Hispanic",
    "immigration",
    "Appalachia"
  ],
  "title": "Winds of Change: Mexico in a Town in Appalachia",
  "type": "Dissertation"
}