{
  "contributor_author": "Mammadov, Jafar",
  "contributor_committeechair": "Maroof, M. A. Saghai",
  "contributor_committeemember": [
    "Griffey, Carl A.",
    "Esen, Asim",
    "Buss, Glenn R.",
    "Jelesko, John G."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:15:22Z",
  "date_adate": "2004-08-23",
  "date_available": "2014-03-14T20:15:22Z",
  "date_issued": "2004-08-02",
  "date_rdate": "2006-08-23",
  "date_sdate": "2004-08-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Leaf rust caused by Puccinia hordei is an important disease of barley (Hordeum vulgare) in many regions of the world. Yield losses up to 62% have been reported in susceptible cultivars. The Rph5 gene confers resistance to the most prevalent races (8 and 30) of barley leaf rust in the United States. Therefore, the molecular mapping of Rph5 is of great interest. Genetic studies were performed by analysis of 93 and 91 F2 plants derived from the crosses 'Bowman' (rph5) x 'Magnif 102' (Rph5) and 'Moore' (rph5) x Virginia 92-42-46 (Rph5), respectively. Linkage analysis positioned the Rph5 locus to the extreme telomeric region of the short arm of barley chromosome 3H at 0.2 cM proximal to RFLP marker VT1 and 0.5 cM distal from RFLP marker C970 in the Bowman x Magnif 102 population. Synteny between rice chromosome 1 and barley chromosome 3 was employed to saturate the region within the sub-centimorgan region around Rph5 using sequence-tagged site (STS) markers that were developed based on barley expressed sequence tags (ESTs) syntenic to the phage (P1)-derived artificial chromosome (PAC) clones comprising distal region of the rice chromosome 1S. Five rice PAC clones were used as queries to blastn 370,258 barley ESTs. Ninety four non-redundant EST sequences were identified from the EST database and used as templates to design 174 pairs of primer combinations. As a result, 10 EST-based STS markers were incorporated into the 'Bowman' x 'Magnif 102' high-resolution map of the Rph5 region. More importantly, six markers, including five EST-derived STS sequences, co-segregate with Rph5. Genes, represented by these markers, are putative candidates for Rph5. Results of this study demonstrate the usefulness of rice genomic resources for efficient deployment of barley EST resources for marker saturation of targeted barley genomic region.",
  "description_provenance": [
    "Author Email: jmammado@vt.edu",
    "Advisor Email: cgriffey@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: esen@vt.edu",
    "Advisor Email: gbuss@vt.edu",
    "Advisor Email: jelesko@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:22Z (GMT). No. of bitstreams: 1 ETDJAM.pdf: 1479450 bytes, checksum: 681380aea6a85fc3fe9eb3eeac9e3b02 (MD5)   Previous issue date: 2004-08-02"
  ],
  "handle": "28704",
  "identifier_other": "etd-08182004-104543",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08182004-104543/",
  "identifier_uri": "http://hdl.handle.net/10919/28704",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETDJAM.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Expressed Sequence Tag (EST)",
    "high resolution map",
    "Rph5",
    "contig",
    "barley",
    "Bacterial Artificial Chromosome (BAC)",
    "leaf rust",
    "synteny",
    "comparative mapping",
    "molecular mapping",
    "marker-assisted selection",
    "gene pyramiding",
    "Resistance Gene Analog (RGA)",
    "rice",
    "physical mapping"
  ],
  "title": "Towards Cloning the Leaf Rust Resistance Gene Rph5",
  "type": "Dissertation"
}