{
  "contributor_author": "Mammei, Russell Rene",
  "contributor_committeechair": "Vogelaar, Robert Bruce",
  "contributor_committeemember": [
    "Heremans, Jean J.",
    "Pitt, Mark L.",
    "Khodaparast, Giti A."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:15:24Z",
  "date_adate": "2010-08-24",
  "date_available": "2014-03-14T20:15:24Z",
  "date_issued": "2010-08-11",
  "date_rdate": "2010-08-24",
  "date_sdate": "2010-08-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The use of ultracold neutrons (UCN) to study fundamental parameters such as the neutron lifetime and decay correlations in polarized neutron beta decay are poised to make significant contributions to our understand of the Standard Model and its extensions.  To this end, the UCNA experiment is pursuing a precision measurement (0.2%) of the angular correlation between the neutron spin and the direction of emission of the electron in polarized neutron decay (the ``A'' asymmetry).   The UCNA experiment makes use of the spallation-driven solid deuterium (SD2) UCN source at the Los Alamos Neutron Science Center (LANSCE).  The UCN leave the source and are 100% polarized by passing through a strong magnetic field before their decay is observed by a very sensitive electron spectrometer. <br /> <br />    UCN guides facilitate the transfer of UCN from the source to the spectrometer.  Common guide materials include stainless steel, copper, aluminum, and quartz.  Often a thin film is applied to these components to increase their ability to transport/bottle and preserve the polarization of UCN.  In the region of the SD2 UCN source, nickel-58 films are applied, whereas once the UCN are polarized, diamond-like carbon (DLC) films are employed.  This dissertation covers the application, process developments, and characterization of these coatings.  In addition a study concerning the surface finish resulting from the mechanical polishing and electropolishing of the guides that make up the UCNA beamline is presented.",
  "description_provenance": [
    "Author Email: rrmammei@gmail.com",
    "Advisor Email: heremans@vt.edu",
    "Advisor Email: vogelaar@vt.edu",
    "Advisor Email: pitt@vt.edu",
    "Advisor Email: khodapar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:24Z (GMT). No. of bitstreams: 2 Mammei_RR_D_2010.pdf: 57260597 bytes, checksum: dc5c45aed6144f568f008b647a2d1a73 (MD5) Mammei_RR_D_2010_Copywrite.pdf: 2943237 bytes, checksum: 0e8df4f913f04a138513ca8bbc694c39 (MD5)   Previous issue date: 2010-08-11"
  ],
  "handle": "28714",
  "identifier_other": "etd-08182010-112705",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08182010-112705/",
  "identifier_uri": "http://hdl.handle.net/10919/28714",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Mammei_RR_D_2010.pdf",
    "Mammei_RR_D_2010_Copywrite.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Neutron Beta Decay",
    "Polarized Ultracold Neutrons",
    "Standard Model Tests",
    "Diamond-Like Carbon",
    "Polarized Neutron Guides",
    "Pulsed Laser Deposition",
    "Ebeam Evaporation",
    "Electropolishing",
    "Mechanical Polishing",
    "Surface Roughness"
  ],
  "title": "Thin Films for the Transport of Polarized Ultracold Neutrons for Fundamental Symmetry Study",
  "type": "Dissertation"
}