{
  "contributor_author": "Chittenden, Thomas William",
  "contributor_committeechair": "Herbert, William G.",
  "contributor_committeemember": [
    "Huckle, William R.",
    "Cross, Lawrence H.",
    "Gregg, John M.",
    "Myers, Jonathan",
    "Pyle, Robert Lee",
    "Zedalis, Don",
    "Grange, Robert W."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:15:25Z",
  "date_adate": "2002-08-26",
  "date_available": "2014-03-14T20:15:25Z",
  "date_issued": "2002-07-24",
  "date_rdate": "2003-08-26",
  "date_sdate": "2002-08-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of the current study was to test the hypothesis that chronic hypoxia associated with sleep-disordered breathing relates to abnormal Nitric Oxide (NO) production and vascular endothelial growth factor (VEGF) expression patterns that contribute to aberrancy of specific determinates of cardiovascular and cardiopulmonary function before, during, and after graded exercise.  These patterns may further reflect pathologic alteration of signaling within the phosphatidylinositol 3-kinase (PI3K)/protein kinase B (Akt-1) transduction network.  To this end, 7 medically diagnosed OSA patients (3 male, 4 female), mean age 48 years and 7 apparently healthy control subjects (3 male, 4 female), mean age 42 years, underwent baseline venous blood draws and maximal bicycle ergometry. Mononuclear cells isolated from peripheral blood were utilized as reporter cells for measurement of VEGF, Akt-1, hypoxia inducible factor-1 alpha (HIF-1 alpha), and vascular endothelial growth factor receptor-2 (VEGFR2) gene expression by redundant oligonucleotide DNA microarray and real-time PCR technologies. Circulating angiogenic progenitor cells expressing VEGFR2 were profiled by flow cytometry. Plasma and serum concentrations of VEGF, nitrates/nitrites, catecholamines, and dopamine were measured by enzyme-linked immunosorbent assay (ELISA) and high performance liquid chromatography (HPLC). Arterial blood pressure, cardiac output, oxygen consumption and total peripheral resistance were determined at Baseline, 100W, and peak ergometric stress by standard techniques. There were no apparent differences (p < .05) observed in biochemical markers relating to vascular function and adaptation including, serum nitrates/nitrites, norepinephrine, dopamine, and plasma VEGF. No differences were found relative to cardiac output, stroke volume, cardiopulmonary or myocardial oxygen consumption, expired ventilation, heart rate, arteriovenous oxygen difference, total peripheral resistance, and mean arterial pressure. Due to methodological issues related to the redundant oligonucleotide DNA microarray and real-time PCR gene expression analyses, results of these experiments were uninterpretable. Thus, the research hypothesis was rejected.  Conversely, significant (p < .05) differences were observed in waist: hip ratios, recovery: peak systolic blood pressure ratio at 1 minute post-exercise and %VEGFR2 expression. OSA was associated with elevations in both waist: hip ratios and recovery: peak systolic blood pressure ratio at 1 minute post-exercise as well as significant depression of %VEGFR2 profiles.  Moreover, significant negative correlations were found regarding waist: hip ratios and %VEGFR2 expression (r = -.69;p =.005) and recovery: peak systolic blood pressure ratio at 1 minute post-exercise and %VEGFR2 expression (r = -.65;p =.01). These findings did not provide evidence that NO-dependent vasoactive mechanisms are suppressed nor did they support the supposition that angiogenic mechanisms are pathologically activated in sleep-disordered breathing.",
  "description_provenance": [
    "Author Email: mcbbphd@aol.com",
    "Advisor Email: wgherb@vt.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: cross@vt.edu",
    "Advisor Email: jgregg@vt.edu",
    "Advisor Email: drj993@aol.com",
    "Advisor Email: rpyle@vt.edu",
    "Advisor Email: donsleep@msn.com",
    "Advisor Email: rgrange@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:25Z (GMT). No. of bitstreams: 2 01Dissertation.pdf: 1877420 bytes, checksum: a0a3cd5cb96d41c85d3aa150b7b53af0 (MD5) 02Dissertationappendices.pdf: 2430109 bytes, checksum: ae6b32fd78bab88335c1c578bac89ad5 (MD5)   Previous issue date: 2002-07-24"
  ],
  "handle": "28718",
  "identifier_other": "etd-08192002-142414",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08192002-142414/",
  "identifier_uri": "http://hdl.handle.net/10919/28718",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01Dissertation.pdf",
    "02Dissertationappendices.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "DNA Microarray",
    "Exercise",
    "Nitric Oxide",
    "Vascular Endothelial Growth Factor",
    "Blood Pressure Regulation",
    "Obstructive Sleep Apnea",
    "Angiogenesis"
  ],
  "title": "Chronic Hypoxia and Cardiovascular Dysfunction in Sleep Apnea Syndrome",
  "type": "Dissertation"
}