{
  "contributor_author": "Student, James John",
  "contributor_committeechair": "Bodnar, Robert J.",
  "contributor_committeemember": [
    "Tracy, Robert J.",
    "Beard, James S.",
    "Szabo, Csaba",
    "Bekken, Barbara"
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:15:25Z",
  "date_adate": "2002-10-07",
  "date_available": "2014-03-14T20:15:25Z",
  "date_issued": "2002-07-17",
  "date_rdate": "2003-10-07",
  "date_sdate": "2002-08-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Silicate melt inclusions are ubiquitous in quartz phenocrysts, yet there are few studies of such inclusions from porphyry copper systems.  A melt inclusion forms when magma is trapped in a growing phenocryst.  If a phenocryst is able to preserve the original parent magma, then accurate information can be obtained for ancient volcanic systems.  In recent igneous systems, melt inclusions are commonly preserved as optically clear homogeneous glass representative of magma stored at depth before eruption.  Melt inclusions are difficult to recognize in quartz phenocrysts from porphyry copper system because they are crystalline and hidden by exsolved magmatic volatiles.  The inclusions range in size from less than 5 to over 150 μm.  In order to evaluate the magmatic contribution to economic mineralization, we conducted three separate studies to determine whether or not crystallized melt inclusions preserve representative samples of magma.   The first study modeled the phase relationships that occur during equilibrium crystallization and melting of haplogranite magma trapped in quartz.  Results from the model are similar to observations made during the heating of crystallized melt inclusions from porphyry copper systems.  It is necessary to re-melt the crystal and volatile phases before chemical analysis.  Micro-explosions caused by heating resulted in the loss of important chemical components.  Our second study evaluated several microthermometric heating procedures using synthetic melt inclusions trapped at conditions similar to those inferred for porphyry copper systems.  A synthetic hydrous melt was saturated with saline hydrothermal solutions allowing both melt and aqueous fluids to be trapped in quartz.  Based on microthermometric measurements from these coeval melt and aqueous fluid inclusions we were able to predict the known trapping temperature and pressure of formation. This technique can be applied to natural samples to constrain trapping pressures and temperatures.  It was found that slower heating rates could be used to avoid overheating and that heating under a confining pressure greatly minimizes the decrepitation of inclusions. The third study examined the copper concentrations in melt inclusions from the Red Mountain, Arizona porphyry copper system.  Older andesite magma contains pyroxene with melt inclusions of higher copper concentrations compared to melt inclusions in quartz from quartz latite. The higher water concentrations in crystallized melt inclusions in the quartz, and abundant aqueous fluid inclusions indicates that the exsolution of water from the magma occurred prior to the trapping of melt inclusions in quartz.  The lower water concentrations and the absence of aqueous fluid inclusions indicates that the andesite never reached the stage of water exsolution. The results obtained here are consistent with models that suggest that copper is extracted from the melt by saline magmatic fluids, producing a metal-charged hydrothermal solution and leaving behind a metal-depleted melt and serves to identify the potential contribution of melt inclusion studies to constrain the origin of ore metals in porphyry copper deposits.",
  "description_provenance": [
    "Author Email: gympupil@vt.edu",
    "Advisor Email: bubbles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:25Z (GMT). No. of bitstreams: 1 jjsdis.pdf: 4034498 bytes, checksum: c02d1ff4d143a063aa3289b3d2b8c4b7 (MD5)   Previous issue date: 2002-07-17"
  ],
  "handle": "28719",
  "identifier_other": "etd-08192002-150340",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08192002-150340/",
  "identifier_uri": "http://hdl.handle.net/10919/28719",
  "publisher": "Virginia Tech",
  "relation_haspart": "jjsdis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Magmatic",
    "Haplogranite",
    "Melt Inclusion",
    "Synthetic Glass",
    "Phenocryst",
    "Magmatic",
    "Quartz",
    "Porphyry Copper"
  ],
  "title": "Silicate Melt Inclusions in Igneous Petrogenesis",
  "type": "Dissertation"
}