{
  "contributor_author": "Nontapot, Kanokwan",
  "contributor_committeechair": "Khodaparast, Giti A.",
  "contributor_committeemember": [
    "Pitt, Mark L.",
    "Heflin, James R.",
    "Schmittmann, Beate"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:15:23Z",
  "date_adate": "2008-09-11",
  "date_available": "2014-03-14T20:15:23Z",
  "date_issued": "2008-08-06",
  "date_rdate": "2009-09-11",
  "date_sdate": "2008-08-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In recent years, spin relaxation, injection, and manipulation in semiconductors have attracted considerable interest because of several potential applications in \"spintronic\" devices and the necessity to understand and control spin-based phenomena. In light of the growing interest in spin-related phenomena and devices, there is now renewed interest in the science and engineering of narrow gap semiconductors (NGS). NGS based heterostructures are particularly interesting for spintronic applications due to their large spin-orbit coupling, which leads to considerable zero-field spin splitting.  NGS are also candidates for electronic applications, such as high-speed and low-power microprocessors;  as reported recently by Intel. Furthermore, as switching rates in electronic devices are pushed to even higher frequencies, it is important to understand dynamics in semiconductors such as NGS on femtosecond time-scales.  In this thesis, time-resolved studies of magnetic and non-magnetic NGS using ultrafast-laser spectroscopy techniques such as pump-probe spectroscopy and magneto-optical Kerr/Faraday effect, are reported. Our samples include: InSb-based quantum wells with different confinement potentials; InMnSb films, the newest III-V ferromagnetic semiconductors; and InAs films. The samples for these studies have been provided by the groups of Prof. Santos at the University of Oklahoma, Prof. Furdyna at the University of Notre Dame, and Prof. Guido at Virginia Tech.  The objectives in this thesis have been to: a) understand charge/spin dynamics in NGS with novel confinement potentials, b) probe the effect of magnetic impurities on the spin/charge dynamics, and c) develop concepts for spin based device applications. Several specific questions and concepts have been addressed including:  the effect of large spin-orbit interaction in NGS on the dynamics, how large Rashba spin splitting in these materials affect the spin coherence life time, and carrier/spin dynamics in ferromagnetic semiconductor structures.",
  "description_provenance": [
    "Author Email: kanokwan@vt.edu",
    "Advisor Email: pitt@vt.edu",
    "Advisor Email: khoda@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: schmittm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:23Z (GMT). No. of bitstreams: 2 KN_ETD_Fi.pdf: 4812784 bytes, checksum: ba02a5e75ca99f9ca38263412a90de18 (MD5) KN_ETDV7.pdf: 4781318 bytes, checksum: 64539906d0e8eeb6670bf6d5f8b89844 (MD5)   Previous issue date: 2008-08-06"
  ],
  "handle": "28712",
  "identifier_other": "etd-08182008-140738",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08182008-140738/",
  "identifier_uri": "http://hdl.handle.net/10919/28712",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "KN_ETD_Fi.pdf",
    "KN_ETDV7.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Narrow gap semiconductors",
    "Ultrafast laser spectroscopy",
    "Spin dynamics",
    "Magneto-optical Kerr/Faraday effect",
    "Time resolved pump/probe"
  ],
  "title": "Time-Resolved Studies of Magnetic and Non-Magnetic Narrow-Gap Semiconductors",
  "type": "Dissertation"
}