{
  "contributor_author": "Bryson, Joshua Matthew",
  "contributor_committeechair": "Reineke, Theresa M.",
  "contributor_committeemember": [
    "Long, Timothy E.",
    "Edgar, Kevin J.",
    "Davis, Rick M.",
    "Madsen, Louis A.",
    "Riffle, Judy S."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:15:26Z",
  "date_adate": "2009-09-29",
  "date_available": "2014-03-14T20:15:26Z",
  "date_issued": "2009-08-07",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-08-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Macromolecular magnetic resonance imaging (MRI) contrast agents have unique localization and contrast enhancement properties. We have designed and studied a monodisperse paramagnetic β-cyclodextrin click cluster (Gd10) decorated with Gd-containing arms and unique contrast enhancing polymers. To synthesize Gd10, a novel alkyne-functionalized diethylenetriaminetetraacetic acid chelate was created and coupled to a per-azido-β-cyclodextrin core and chelated with Gd(III) to yield the precursor macromolecule. Luminescence measurements were carried out using an analogous structure Eu(III)-containing structure and indicated that each lanthanide has an average of 1.8 water exchange sites. Gd10 yields a high relaxivity profile (6.2 mM<sup>-1</sup> s<sup>-1</sup> per Gd(III) at 9.4 T). Gd10 shows toxicity higher than clinically used contrast agents such as Magnevist&trade in vitro in cardiomyoblast cells. No acute toxicity was observed in the rats (n = 9) and contrast enhanced image analysis indicates renal processes may be involved in clearance.  <p>  The contrast enhancing polymers we developed are new macromolecular beacons that allow the delivery of nucleic acids to be visualized at different biological scales. They contain repeated oligoethyleneamines, for binding and compacting nucleic acids into nanoparticles, and Gd(III)/Eu(III) chelates. The chelated lanthanides allow the visualization of the delivery vehicle via microscopy and via magnetic resonance imaging (MRI). We demonstrate that these new delivery beacons effectively bind plasmid DNA(pDNA) and protect their cargo nucleic acids from nuclease damage. The lanthanide-chelate materials have been found to efficiently deliver pDNA into cultured cells and do not exhibit toxicity. Micrographs of cultured cells exposed to the nanoparticle complexes formed with fluorescein-labeled pDNA and the europium-chelated polymers reveal effective intracellular imaging of the delivery process. MRI of bulk cells exposed to the complexes formulated with pDNA and the gadolinium-chelated structures show bright image contrast, allowing visualization of effective intracellular delivery on the tissue-scale. Because of their versatility as imaging probes, these delivery beacons posses remarkable potential for tracking and understanding nucleic acid transfer in vitro and have promise for in vivo imaging applications. In later studies the Ln-chelating polymers were co-polymerized with dimethylgalacterate which definitively increases luciferase gene expression (up 50x enhancement) and cellular uptake (up to 2x enhancement).",
  "description_provenance": [
    "Author Email: Joshua_bryson@yahoo.com",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: kjedgar@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: treineke@vt.edu",
    "Advisor Email: lmadsen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:26Z (GMT). No. of bitstreams: 1  J_Bryson_Dissertation_9222009.pdf: 11076499 bytes, checksum: f4737a976e4a9fdf4a0c14706c39ed7c (MD5)    Previous issue date: 2009-08-07"
  ],
  "handle": "28726",
  "identifier_other": "etd-08192009-135953",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08192009-135953/",
  "identifier_uri": "http://hdl.handle.net/10919/28726",
  "publisher": "Virginia Tech",
  "relation_haspart": "J_Bryson_Dissertation_9222009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "MRI",
    "Contrast Agent",
    "Luminescence",
    "Drug Delivery"
  ],
  "title": "The Design and Study of Lanthanide-Chelating Macromolecular Diagnostic and Delivery Agents",
  "type": "Dissertation"
}