{
  "contributor_author": "Miles, William Clayton",
  "contributor_committeechair": "Richey M. Davis",
  "contributor_committeemember": [
    "John Y. Walz",
    "Judy S. Riffle",
    "William A. Ducker",
    "David F. Cox"
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:15:26Z",
  "date_adate": "2009-09-15",
  "date_available": "2014-03-14T20:15:26Z",
  "date_issued": "2009-08-10",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-08-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The composition and stability of polymer-magnetite complexes is essential for their use as a treatment for retinal detachment, for drug targeting and delivery, and for use as a MRI contrast agent.  This work outlines a general methodology to design well-defined, stable polymer-magnetite complexes.  Colloidal modeling was developed and validated to describe polymer brush extension from the magnetite core.  This allowed for the observation of deviations from expected behavior as well as the precise control of polymer-particle complex size.  Application of the modified Derjaguin-Verwey-Landau-Overbeek (DLVO) theory allowed the determination of the polymer loading and molecular weight necessary to sterically stabilize primary magnetite particles.   <p> Anchoring of polyethers to the magnetite nanoparticle surface was examined using three different types of anchor groups: carboxylic acid, ammonium, and zwitterionic phosphonate. As assessed by dynamic light scattering (DLS), the zwitterionic phosphonate group provided far more robust anchoring than either the carboxylic acid or ammonium anchor groups, which was attributed to an extremely strong interaction between the phosphonate anchor and the magnetite surface.  Coverage of the magnetite surface by the anchor group was found to be a critical design variable for the stability of the zwitterionic phosphonate groups, and the use of a tri-zwitterionic phosphonate anchor provided stability in phosphate buffered saline (PBS) for a large range of polymer loadings. <p> Incorporation of an amphiphlic poly(propylene oxide)-b-poly(ethyelene oxide) (PPO-b-PEO) diblock copolymer attached to the magnetite surface was examined through colloidal modeling and DLS.  The relaxivity of the complexes was related to aggregation behavior observed through DLS.  This indicated the presence of a hydrophobic interaction between the PPO layers of neighboring complexes.  When this interaction was large enough, the complexes exhibited an increased relaxivity and cellular uptake.   <p> Thus, we have developed a methodology that allows for design of polymer-magnetite complexes with controlled sizes (within 8% of predicted values).  Application of this methodology incorporated with modified DLVO theory aids in the design of colloidally stable complexes with minimum polymer loading.  Finally, determination of an anchor group stable in the presence of phosphate salts at all magnetite loadings allows for the design of materials with minimum polymer loadings in biological systems.",
  "description_provenance": [
    "Author Email: wcmiles@vt.edu",
    "Advisor Email: jywalz@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: wducker@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:26Z (GMT). No. of bitstreams: 1 WilliamMilesDissertation2.pdf: 8437066 bytes, checksum: cfab81e63c233d02163def0cf250a065 (MD5)   Previous issue date: 2009-08-10"
  ],
  "handle": "28725",
  "identifier_other": "etd-08192009-134818",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08192009-134818/",
  "identifier_uri": "http://hdl.handle.net/10919/28725",
  "publisher": "Virginia Tech",
  "relation_haspart": "WilliamMilesDissertation2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "brush extension",
    "poly(propylene oxide)",
    "poly(ethylene oxide)",
    "magnetite",
    "contrast agent",
    "steric stabilization"
  ],
  "title": "The Design of Stable, Well-Defined Polymer-Magnetite Nanoparticle Systems for Biomedical Applications",
  "type": "Dissertation"
}