{
  "contributor_author": "Harrison-Rexrode, Jill",
  "contributor_committeechair": "Ryan, John W.",
  "contributor_committeemember": [
    "Calasanti, Toni M.",
    "Kiecolt, K. Jill",
    "Hughes, Michael D.",
    "Hawdon, James E."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:15:27Z",
  "date_adate": "2009-09-03",
  "date_available": "2014-03-14T20:15:27Z",
  "date_issued": "2009-08-14",
  "date_rdate": "2009-09-03",
  "date_sdate": "2009-08-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this study I explore boundary work processes that older adults do which influences friendships among residents of a progressive care retirement community.  Accounts of boundary work as mechanisms for including some and excluding other residents as potential friends were collected by using a combination of quantitative surveys and qualitative interviews from residents (age 65+) of a progressive care retirement community in the United States.  First, a survey explored symbolic boundaries related to cultural capital, defined as music and leisure interest and participation, as well as structural and social aspects of friendships among residents (N=66).  Second, in-depth interviews of a sub-sample of residents of an assisted living facility within the community (N=15), were conducted to examine older adultsâ   narratives of how they use cultural capital as a mechanism of symbolic boundary work that influences their friendships with others in the retirement community.  The administrator of the assisted living facility (N=1) was also interviewed.  Findings from this study suggested that cultural capital was associated with sociability which offers some support for the relational â  tool kitâ   model of the theory.  However, findings from in-depth interviews suggested that while music and leisure interests and participation may be important, valuations of bodies were more likely to influence â  otheringâ   of residents, although the two are related.  This study enriches our understanding of how symbolic boundary use varies by group and context, as well as makes theoretical contributions to the literature on symbolic boundaries by exploring the ways in which aging may alter the use of boundaries.",
  "description_provenance": [
    "Author Email: jrex@vt.edu",
    "Advisor Email: johnryan@vt.edu",
    "Advisor Email: toni@vt.edu",
    "Advisor Email: kiecolt@vt.edu",
    "Advisor Email: mdh@vt.edu",
    "Advisor Email: hawdonj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:27Z (GMT). No. of bitstreams: 2 Harrison-Rexrode_JS_D_2009IRB.pdf: 254505 bytes, checksum: 30aa196fb605792c66f8a419ef293a82 (MD5) Harrison-Rexrode_JS_D_2009.pdf: 1516090 bytes, checksum: 9dae318d10a6849ee9e5cf309300b099 (MD5)   Previous issue date: 2009-08-14"
  ],
  "handle": "28728",
  "identifier_other": "etd-08192009-182654",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08192009-182654/",
  "identifier_uri": "http://hdl.handle.net/10919/28728",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Harrison-Rexrode_JS_D_2009IRB.pdf",
    "Harrison-Rexrode_JS_D_2009.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "aging bodies",
    "leisure interests",
    "musical tastes",
    "old age",
    "symbolic boundaries",
    "cultural capital",
    "progressive care retirement communities"
  ],
  "title": "\"I don't want to go up the hill\": Symbolic Boundary Work Among Residents of an Assisted Living Community",
  "type": "Dissertation"
}