{
  "contributor_author": "Zhang, Huizi",
  "contributor_committeechair": "Smith, Eric P.",
  "contributor_committeemember": [
    "Ye, Keying",
    "Boone, Edward",
    "Prins, Samantha C. Bates"
  ],
  "contributor_department": "Statistics",
  "date_accessioned": "2014-03-14T20:15:25Z",
  "date_adate": "2006-09-29",
  "date_available": "2014-03-14T20:15:25Z",
  "date_issued": "2006-08-14",
  "date_rdate": "2006-09-29",
  "date_sdate": "2006-08-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Environmental studies often employ data collected over large spatial regions. Although it is convenient, the conventional single model approach may fail to accurately describe the relationships between variables. Two alternative modeling approaches are available: one applies separate models for different regions; the other applies hierarchical models. The separate modeling approach has two major difficulties: first, we often do not know the underlying clustering structure of the entire data; second, it usually ignores possible dependence among clusters. To deal with the first problem, we propose a model-based clustering method to partition the entire data into subgroups according to the empirical relationships between the response and the predictors. To deal with the second, we propose Bayesian hierarchical models. We illustrate the use of the Bayesian hierarchical model under two situations. First, we apply the hierarchical model based on the empirical clustering structure. Second, we integrate the model-based clustering result to help determine the clustering structure used in the hierarchical model. The nature of the problem is classification since the response is categorical rather than continuous and logistic regression models are used to model the relationship between variables.",
  "description_provenance": [
    "Author Email: huzhang@vt.edu",
    "Advisor Email: keying@vt.edu",
    "Advisor Email: epsmith@vt.edu",
    "Advisor Email: elboone@vcu.edu",
    "Advisor Email: sbates@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:25Z (GMT). No. of bitstreams: 1 dissertation.pdf: 982812 bytes, checksum: 25aab98914c2cc140097deff52b3a522 (MD5)   Previous issue date: 2006-08-14"
  ],
  "handle": "28721",
  "identifier_other": "etd-08192006-115350",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08192006-115350/",
  "identifier_uri": "http://hdl.handle.net/10919/28721",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Environmental studies",
    "Clustering",
    "Hierarchical Model",
    "Classification"
  ],
  "title": "Classification Analysis for Environmental Monitoring: Combining Information across Multiple Studies",
  "type": "Dissertation"
}