{
  "contributor_author": "Conrad IV, Joseph Locke",
  "contributor_committeechair": "Bolding, M. Chad",
  "contributor_committeemember": [
    "Aust, Wallace Michael",
    "Smith, Robert L.",
    "Horcher, Andy T."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:15:28Z",
  "date_adate": "2011-09-15",
  "date_available": "2014-03-14T20:15:28Z",
  "date_issued": "2011-08-11",
  "date_rdate": "2011-09-15",
  "date_sdate": "2011-08-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Recent emphasis on producing energy from woody biomass has raised questions about the impact of a vibrant wood-to-energy market on the southern wood supply chain, which consists of forest landowners, forest industry mills, and harvesting contractors. This study utilized two surveys of southern wood supply chain participants and a designed operational study of an energywood harvest to investigate the impact of an expanded wood-to-energy market on each member of the southern wood supply chain. First, a survey of consulting foresters was conducted to examine how harvest tract size, forest ownership, and forest industry structure have changed within the U.S. South and how foresters expect the wood-to-energy market to impact the wood supply chain in the future. Second, this study employed a mail survey of forest landowners, forest industry mills, and wood-to-energy facilities from the thirteen southern states in order to investigate expected competition for resources, wood supply chain profitability, and landowner willingness to sell timber to energy facilities. Third, this study conducted a designed operational study on a southern pine clearcut in the Coastal Plain of North Carolina, with three replications of three harvest prescriptions to measure harvesting productivity and costs when harvesting woody biomass for energy. The three treatments were: a Conventional roundwood only harvest (control), an Integrated harvest in which roundwood was delivered to traditional mills and residuals were chipped for energy, and a Chip harvest in which all stems were chipped for energy use.   Results from the two surveys suggest that timber markets are inadequate in many areas of the South as a result of expanded timber supply and reduced forest products industry capacity. Only 12% of responding landowners and foresters had sold wood to an energy facility, indicating that wood-to-energy markets are non-existent in many areas of the South. Nonetheless, 98% of consulting foresters and 90% of landowners reported a willingness to sell timber to an energy facility if the right price were offered. Consulting foresters expected wood-to-energy facilities to provide an additional market for wood, and not displace forest products industry capacity. However, two-thirds of consulting foresters, wood-to-energy facilities, and private landowners expected competition between mills and energy facilities while 95% of fibermills (pulp/paper and composite mills) expected competition. Fibermills were much more concerned about competition for resources and increases in wood costs than any other member of the southern wood supply chain.   The operational study documented the challenges facing some harvesting contractors in economically producing energywood. Onboard truck roundwood costs increased from $9.35 green t-1 in the Conventional treatment to $10.98 green t-1 in the Integrated treatment as a result of reduced felling and skidding productivity. Energy chips were produced for $19.19 green t-1 onboard truck in the Integrated treatment and $17.93 green t-1 in the Chip treatment. Energywood harvesting costs were higher in this study than in previous research that employed loggers with less expensive, more fuel efficient equipment. This suggests that high capacity, wet-site capable loggers may not be able to economically harvest and transport energywood without a substantial increase in energywood prices.   This study suggests that the southern wood supply chain is in position to benefit from a vibrant wood-to-energy market. Landowners should benefit from an additional market for small-diameter stems. This study shows that high production, wet-site capable loggers should not harvest energywood until prices for this material appreciate considerably. Wet-site loggers have very expensive equipment with high hourly fuel consumption rates and this study documented that energywood production was not sufficiently high to offset the high hourly cost of owning and operating this equipment. Nevertheless, a wood-to-energy market should benefit harvesting contractors in general because unless the forest products industry contracts further, loggers can continue to harvest and deliver roundwood to mills as they do at present and those properly equipped for energywood harvesting at low cost may be able to profit from a new market. The forest products industry has the largest potential downside of any member of the southern wood supply chain. This study documents widespread anticipation of competition between the forest products and wood-to-energy industries. However, to date there has been minimal wide-scale competition between the forest products and wood-to-energy industries. It is possible that the wood-to-energy industry will complement, rather than compete with the forest products industry, and thereby benefit each member of the southern wood supply chain.",
  "description_provenance": [
    "Author Email: jconrad4@vt.edu",
    "Advisor Email: bolding@vt.edu",
    "Advisor Email: waust@vt.edu",
    "Advisor Email: rsmith4@vt.edu",
    "Advisor Email: ahorcher@fs.fed.us",
    "Made available in DSpace on 2014-03-14T20:15:28Z (GMT). No. of bitstreams: 2 Conrad_JL_D_2011.pdf: 1497848 bytes, checksum: 446f4f7776617a888745d0d835302a42 (MD5) Conrad_JL_Copyright_2011.pdf: 119385 bytes, checksum: a89c92db8a8ca3f5748fc85dc7dce8ac (MD5)   Previous issue date: 2011-08-11"
  ],
  "handle": "28738",
  "identifier_other": "etd-08202011-143834",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08202011-143834/",
  "identifier_uri": "http://hdl.handle.net/10919/28738",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Conrad_JL_D_2011.pdf",
    "Conrad_JL_Copyright_2011.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "bioenergy",
    "forest products industry",
    "forest landowners",
    "loggers",
    "harvesting costs"
  ],
  "title": "Anticipated Impact of a Vibrant Wood-to-Energy Market on the U.S. South's Wood Supply Chain",
  "type": "Dissertation"
}