{
  "contributor_author": "Struss, John Anthony",
  "contributor_committeechair": "Tanko, James M.",
  "contributor_committeemember": [
    "Brewer, Karen J.",
    "Castagnoli, Neal  Jr.",
    "Carlier, Paul R.",
    "Deck, Paul A."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:15:28Z",
  "date_adate": "2002-09-12",
  "date_available": "2014-03-14T20:15:28Z",
  "date_issued": "2002-08-15",
  "date_rdate": "2003-09-12",
  "date_sdate": "2002-08-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Two organic synthetic methods for the generation of methyl bearing chiral centers have been developed using:  1) dimerization of methylketene and 2) a free radical-based addition/elimination reaction involving allyl bromides.  The first method, the asymmetric dimerization of methyl ketene, followed by an asymmetric aldol reaction and the appropriate functional group manipulations enabled us to construct the (2S, 4S, 6S) trimethylnonyl subunit found in the siphonariene class of natural products.  The latter method explored the stereoselective potential of a free radical-based condensation reaction by examining compounds which are known to be able to support chiral auxiliaries and chiral Lewis acids.  Additionally, substituent effect on the rates of this reaction were examined closely and found to be comparable to similar, previously examined systems.  The synthetic utility, magnitude and scope of this reaction are discussed.",
  "description_provenance": [
    "Author Email: jstruss@ut.edu",
    "Advisor Email: kbrewer@chemserver.chem.vt.edu",
    "Advisor Email: ncastagn@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: pdeck@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:28Z (GMT). No. of bitstreams: 2 Dissertation.pdf: 748527 bytes, checksum: 1932c53ecdb84fad15fb701657d06187 (MD5) Titleabstract.pdf: 70920 bytes, checksum: 8afe218c432d96e2eb95e698dd2aed44 (MD5)   Previous issue date: 2002-08-15"
  ],
  "handle": "28734",
  "identifier_other": "etd-08202002-151742",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08202002-151742/",
  "identifier_uri": "http://hdl.handle.net/10919/28734",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation.pdf",
    "Titleabstract.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Allyl Bromide",
    "Methylketene",
    "Allyl Transfer",
    "Siphonarienal",
    "Asymmetric Synthesis",
    "Free Radical"
  ],
  "title": "New Methods for the Formation of Methyl Bearing Stereogenic Centers via Methylketene Dimerization and Free Radical Additions to Allyl Bromides",
  "type": "Dissertation"
}