{
  "contributor_author": "Hoagland, Richard W.",
  "contributor_committeechair": "Elshabini-Riad, Aicha A.",
  "contributor_committeemember": [
    "Scales, Wayne A.",
    "Besieris, Ioannis M.",
    "Frye, Robert C.",
    "Stephenson, F. William"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:15:28Z",
  "date_adate": "1999-08-24",
  "date_available": "2014-03-14T20:15:28Z",
  "date_issued": "1999-07-22",
  "date_rdate": "2000-08-24",
  "date_sdate": "1999-08-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This Dissertation is a study of Switched Mode Power Supply (SMPS) miniaturization and how to effectively use the available technologies to achieve the ultimate goal of a reduced size without loss of functionality while maintaining a cost effective design. This research investigates several methods used to obtain low loss, highly compact power supplies. Within these constraints, the Dissertation investigates the issues of design, materials, and cost in order to design and achieve these miniaturized power supplies. \t \t  This research addresses high performance ceramic, passive component integration. Three key issues; electrical characterization, thermal analysis and simulation, and material characterization, are examined in this work. Thick film passive components (capacitors and resistors) on AlN have been developed. Also, guidelines for the design implementation and steps necessary to integrate these passive components on prefired alumina (Al2O3) and aluminum nitride (AlN) ceramic surfaces, for power electronic applications, have been generated. The use of aluminum nitride, as a high performance ceramic substrate and the resulting issues concerning compatible inks, have been investigated. Since a sizable amount of heat is generated by power electronic circuits, the integrated components are analyzed with respect to tolerance and degeneration over a range of temperatures and frequencies. Thick film capacitors on the order of 120pF/mm2 with breakdown voltage ratings of 250V have been developed on prefired AlN. Resistors were developed with impedances ranging from 10W to 10MegW. Thermal measurements, of these resistors,  show that the thermal conductivity of the aluminum nitride with passivation layer is two to three times that of alumina.  \t  Several versions of a typical SMPS boost circuit have been generated using Direct Bond Copper (DBC) on ceramic, Insulated Metal Substrate (IMS), Printed Circuit Boards (PCB), and prefired ceramic thick film technology. The integrated passive components developed are applied on prefired ceramic versions and compared to the DBC, IMS and  PCB versions.  \t  A small daughter board consisting of the boost circuit control is introduced to further supplement miniaturization and reduce cost. The daughter board uses thick film technology with integrated thick film resistors. The design of the mother board, which houses the power boost section,can be designedand implemented on virtually any type of substrate (PCB, DBC, IMS, or conventional thick film). The fabrication and testing of each version is reported in this work.",
  "description_provenance": [
    "Author Email: rwh@vt.edu",
    "Advisor Email: aicha@engr.uark.edu",
    "Made available in DSpace on 2014-03-14T20:15:28Z (GMT). No. of bitstreams: 1 Etd.pdf: 6122846 bytes, checksum: b5225c5da221526121e43957389f4236 (MD5)   Previous issue date: 1999-07-22"
  ],
  "handle": "28732",
  "identifier_other": "etd-081999-212310",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-081999-212310/",
  "identifier_uri": "http://hdl.handle.net/10919/28732",
  "publisher": "Virginia Tech",
  "relation_haspart": "Etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "PCB",
    "Alumina",
    "AlN",
    "Thick Film",
    "SMPS",
    "DBC"
  ],
  "title": "Switchmode Power Supply Miniaturization with Emphasis on Integrated Passive Components on Prefired High Performance Ceramic Substrates",
  "type": "Dissertation"
}