{
  "contributor_author": "Aktunc, Mahir Emrah",
  "contributor_committeechair": "Mayo, Deborah G.",
  "contributor_committeemember": [
    "Burian, Richard M.",
    "Spanos, Aris",
    "Patton, Lydia K."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:15:27Z",
  "date_adate": "2011-09-06",
  "date_available": "2014-03-14T20:15:27Z",
  "date_issued": "2011-07-02",
  "date_rdate": "2011-09-06",
  "date_sdate": "2011-08-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This is a work in the epistemology of functional neuroimaging (fNI) and it applies the error-statistical (ES) philosophy to inferential problems in fNI to formulate and address these problems. This gives us a clear, accurate, and more complete understanding of what we can learn from fNI and how we can learn it.  I review the works in the epistemology of fNI which I group into two categories; the first category consists of discussions of the theoretical significance of fNI findings and the second category discusses methodological difficulties of fNI. Both types of works have shortcomings; the first category has been too theory-centered in its approach and the second category has implicitly or explicitly adopted the assumption that methodological difficulties of fNI cannot be satisfactorily addressed. In this dissertation, I address these shortcomings and show how and what kind of experimental knowledge fNI can reliably produce which would be theoretically significant.  I take fMRI as a representative fNI procedure and discuss the history of its development. Two independent trajectories of research in physics and physiology eventually converge to give rise to fMRI. Thus, fMRI findings are laden in the theories of physics and physiology and I propose how this creates a kind of useful theory-ladenness which allows for the representation of and intervention in the constructs of cognitive neuroscience.  Duhemian challenges and problems of underdetermination are often raised to argue that fNI is of little, if any, epistemic value for psychology. I show how the ES notions of severe tests and error probabilities can be applied in epistemological analyses of fMRI. The result is that hemodynamic hypotheses can be severely tested in fMRI experiments and I demonstrate how these hypotheses are theoretically significant and fuel the growth of experimental knowledge in cognitive neuroscience.  Throughout this dissertation, I put the emphasis on the experimental knowledge we obtain from fNI and argue that this is the fruitful approach that enables us to see how fNI can contribute to psychology. In doing so, I offer an error-statistical epistemology of fNI, which hopefully will be a significant contribution to the philosophy of psychology.",
  "description_provenance": [
    "Author Email: maktunc@vt.edu",
    "Advisor Email: mayod@vt.edu",
    "Advisor Email: rmburian@vt.edu",
    "Advisor Email: aris@vt.edu",
    "Advisor Email: critique@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:27Z (GMT). No. of bitstreams: 1 Aktunc_ME_D_2011.pdf: 856600 bytes, checksum: ed0aec36728dab265173fadb089ccbc4 (MD5)   Previous issue date: 2011-07-02"
  ],
  "handle": "28730",
  "identifier_other": "etd-08192011-105716",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08192011-105716/",
  "identifier_uri": "http://hdl.handle.net/10919/28730",
  "publisher": "Virginia Tech",
  "relation_haspart": "Aktunc_ME_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "evidence",
    "inference",
    "cognitive neuroscience",
    "severe tests",
    "error probabilities",
    "models of inquiry",
    "experimental knowledge"
  ],
  "title": "Experimental Knowledge in Cognitive Neuroscience: Evidence, Errors, and Inference",
  "type": "Dissertation"
}