{
  "contributor_author": "Paul, Rituparna",
  "contributor_committeechair": "Esker, Alan R.",
  "contributor_committeemember": [
    "Frazier, Charles E.",
    "Riffle, Judy S.",
    "Wilkes, Garth L.",
    "Dillard, John G."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:15:31Z",
  "date_adate": "2007-09-13",
  "date_available": "2014-03-14T20:15:31Z",
  "date_issued": "2007-08-07",
  "date_rdate": "2007-09-13",
  "date_sdate": "2007-08-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Thin film bilayers and blends composed of polymers and nanoparticles are increasingly important for technological applications that range from space survivable coatings to novel drug delivery systems. Dewetting or spontaneous hole formation in amorphous polymer films and phase separation in multicomponent polymer films can hinder the stability of these systems at elevated temperatures. Hence, fundamental understanding of dewetting and phase separation in polymer/nanoparticle bilayer and blend films is crucial for controlling transport and thermomechanical properties and surface morphologies of these systems. This dissertation provides studies on morphological evolution driven by phase separation and/or dewetting in model polymer/nanoparticle thin film bilayers and blends at elevated temperatures. </p><p> Morphological evolution in dewetting bilayers of poly(t-butyl acrylate) (PtBA) or polystyrene (PS) and a polyhedral oligomeric silsesquioxane (POSS), trisilanolphenyl-POSS (TPP) is explored at elevated temperatures. The results demonstrate unique dewetting morphologies in both PtBA/TPP and PS/TPP bilayers that are significantly different from those typically observed in dewetting polymer/polymer bilayers. Upon annealing the PtBA/TPP bilayers at 95&#176;C, a two-step dewetting process is observed. PtBA immediately diffuses into the upper TPP layer leading to hole formation and subsequently the holes merge to form interconnected rim structures in the upper TPP layer. Dewetting of both the TPP and PtBA layers at longer annealing times leads to the evolution of scattered holes containing TPP-rich, fractal aggregates. The fractal dimensions of the TPP-rich, fractal aggregates are ~2.2 suggesting fractal pattern formation via cluster-cluster aggregation. Dewetting in PS/TPP bilayers also proceeds via a two-step process; however, the observed dewetting morphologies are dramatically different from those observed in PtBA/TPP bilayers. Cracks immediately form in the upper TPP layer during annealing of PS/TPP bilayers at 200&#176;C. With increasing annealing times, the cracks in the TPP layer act as nucleation sites for dewetting and aggregation of the TPP layer and subsequent dewetting of the underlying PS layer. Complete dewetting of both the TPP and PS layers results in the formation of TPP encapsulated PS droplets. </p><p> Phase separation in PtBA/TPP thin film blends is investigated as functions of annealing temperature and time. The PtBA/TPP thin film blend system exhibits an upper critical solution temperature (LCST) phase diagram with a critical composition and temperature of 60 wt% PtBA and ~70&#176;C, respectively. Spinodal decomposition (SD) is observed for 60 wt% PtBA blend films and off-critical SD is seen for 58 and 62 wt% PtBA blend films. The temporal evolution of SD in 60 wt% PtBA blend films is also explored. Power law scaling for the characteristic wavevector with time (q ~ t^n with n = -1/4 to -1/3) during the early stages of phase separation yields to domain pinning at the later stages for films annealed at 75, 85, and 95&#176;C. In contrast, domain growth is instantly pinned for films annealed at 105&#176;C.  </p><p>Our work provides an important first step towards understanding how nanoparticles affect polymer thin film stability and this knowledge may be utilized to fabricate surfaces with tunable morphologies via controlled dewetting and/or phase separation.</p>",
  "description_provenance": [
    "Author Email: rpaul@vt.edu",
    "Advisor Email: cfrazier@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:31Z (GMT). No. of bitstreams: 1 RP_dissertation_etd.pdf: 31422603 bytes, checksum: dccb27ab87aed14e89c3e3341806393c (MD5)   Previous issue date: 2007-08-07"
  ],
  "handle": "28747",
  "identifier_other": "etd-08212007-105231",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08212007-105231/",
  "identifier_uri": "http://hdl.handle.net/10919/28747",
  "publisher": "Virginia Tech",
  "relation_haspart": "RP_dissertation_etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Polymer thin films",
    "Langmuir-Blodgett films",
    "Polymer bilayers",
    "Polyhedral oligomeric silsesquioxanes (POSS)",
    "Polymer blends"
  ],
  "title": "STABILITY AND MORPHOLOGICAL EVOLUTION IN POLYMER/NANOPARTICLE BILAYERS AND BLENDS CONFINED TO THIN FILM GEOMETRIES",
  "type": "Dissertation"
}