{
  "contributor_author": "Guo, Shu",
  "contributor_committeechair": "Dillard, David A.",
  "contributor_committeemember": [
    "Ward, Thomas C.",
    "Lesko, John J.",
    "Batra, Romesh C.",
    "Dillard, John G."
  ],
  "contributor_department": "Engineering Science and Mechanics",
  "date_accessioned": "2014-03-14T20:15:30Z",
  "date_adate": "2003-09-01",
  "date_available": "2014-03-14T20:15:30Z",
  "date_issued": "2003-03-28",
  "date_rdate": "2003-09-01",
  "date_sdate": "2003-08-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Water-assisted crack growth at an epoxy/glass interface was measured as a function of applied strain energy release rate, G, and temperature using a wedge test geometry.  The specimens consist of two glass plates bonded with a thin layer of proprietary epoxy adhesive. The crack fronts along the epoxy/glass interfaces were measured using an optical stereomicroscope.  The relationship between G and the debonding rate, v, can be measured using this method, and the threshold value of strain energy release rate, Gth, can be determined from the measured data.  Two types of testing procedures were conducted in this study: ex situ, i.e., pre-conditioned wedge tests and in situ ones, in which wedges were applied before the specimens were submerged into water.  A preliminary model was developed based on the thermal activation barrier concept, and allows the prediction of Gth for the temperatures beyond the testing region. Changes in interfacial strain energy release rate caused by thermal residual stresses in a triple-layered specimen were analyzed in Chapter Three.  The method is based on linear elastic fracture mechanics and simple beam theory.  The curvature of a bimaterial strip was chosen to characterize the residual stress in the specimen, and the strain energy release rate, caused by both tensile and compressive residual stresses in the adhesive, was derived for an asymmetric double cantilever beam (ADCB) geometry.  The contribution of the thermal residual and mechanical stress to the global energy release rate was analyzed.  The thermally induced energy release rate, GT, is found to be independent of crack length, but is a function of residual stress level and geometric and material parameters of the specimen. The adhesion of films and coatings to rigid substrates is often measured using blister geometries, which are loaded either by an applied pressure or a central shaft.  The measurement will be affected if there are residual stresses that make a contribution to the energy release rate.  This effect is investigated using analytical solutions based on the principle of virtual displacements.  A geometrically nonlinear finite element analysis is conducted for comparison.  Furthermore, the relationships among strain energy release rate, load, deflection, and fracture radius are discussed in detail in Chapter Four.  Both analytical solutions and numerical results reveal that uniform tensile residual stresses reduce a specimen's deflection if it experiences plate behavior under small loads.  However, this effect diminishes when membrane behavior is dominant. The mechanics of a single-lap joint with different boundary conditions subjected to tensile loading are investigated.  Closed-form solutions are obtained for a specimen configuration considering different clamping methods.  Based on the approach pioneered by Goland and Reissner, the solutions reported in this paper provide a simple but useful way to understand the effects of boundary conditions on this test geometry.  The solutions in this study suggest that different grip configurations mainly affect the response of the specimens if the grip position is close to the joint edge or the loads are small.  Generally, the influence caused by different gripping methods is only limited to the boundary region, and the behavior of the joint part subjected to tensile loading is almost the same as that for a simply-supported case.",
  "description_provenance": [
    "Author Email: shguo3@vt.edu",
    "Advisor Email: dillard@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:30Z (GMT). No. of bitstreams: 1 dissertation.pdf: 1846934 bytes, checksum: 89ef867b03f83f2404072faaa13f82ab (MD5)   Previous issue date: 2003-03-28"
  ],
  "handle": "28743",
  "identifier_other": "etd-08212003-101311",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08212003-101311/",
  "identifier_uri": "http://hdl.handle.net/10919/28743",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    ": thermal residual stresses",
    "stretching",
    "wedge test",
    "spacer.",
    "single-lap joint",
    "diffusion",
    "boundary conditions",
    "clamp",
    "interfacial fracture energy",
    "blister test",
    "simply-supported",
    "bending",
    "subcritical crack growth",
    "temperature",
    "epoxy-glass interface",
    "adhesion",
    "delamination",
    "residual stress",
    "coating",
    "thin film",
    "adhesion",
    "fracture mechanics"
  ],
  "title": "Experimental and Numerical Investigations on the Durability and Fracture Mechanics of the Bonded Systems for Microelectronics Application",
  "type": "Dissertation"
}