{
  "contributor_author": "Bullock, Calvin",
  "contributor_committeecochair": [
    "Craig, James E.",
    "Earthman, Glen I."
  ],
  "contributor_committeemember": [
    "Lemasters, Linda Kay",
    "Martin, Rosalie Marie"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:15:31Z",
  "date_adate": "2007-09-24",
  "date_available": "2014-03-14T20:15:31Z",
  "date_issued": "2007-08-08",
  "date_rdate": "2007-09-24",
  "date_sdate": "2007-08-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Relationship Between School Building Condition and Student Achievement at the Middle School Level in the Commonwealth of Virginia.  Calvin Bullock    Abstract \tThe purpose of this study was to investigate the relationship between school building condition and student achievement as measured by their performance on the Standards of Learning (SOL) examinations at the middle school level in the Commonwealth of Virginia.  \tThree major data components were used to complete this study. The first component was the condition of the school buildings. To obtain this information, principals were asked to complete the Commonwealth Assessment of Physical Environment (CAPE) assessment instrument. The second component was the percentage of passing scores from SOL examinations for each middle school in the Commonwealth of Virginia. The third component was the socioeconomic status of the students attending the schools as measured by the percentage of students participating in the free and reduced lunch program.    Three research questions were used to examine this topic. The first research question examined the differences in the SOL results of students in school buildings rated as standard and substandard. The second research question examined the differences in the SOL results of students in school buildings rated cosmetically as standard and substandard. The third research question examined the differences in the SOL results of students in school buildings rated structurally as standard and substandard.  This study found that building condition is related to student achievement. Students performed better in newer or recently renovated buildings than they did in older buildings. The percentage of students passing the Commonwealth of Virginia Standards of Learning Examination at the middle school level was higher in English, mathematics and science in standard buildings than it was in substandard buildings. One of the largest differences in percentage of students passing was in English at 6.10 percentage points. This difference was significant at the .05 level of significance. This is noteworthy because student's ability to read affects all other academic areas. Building age, windows in the instructional area, and overall building condition were positively related to student achievement. Finally the data from this study were compared to the results of earlier studies that examined high schools in the Commonwealth of Virginia, finding that these results were consistent with the findings of other studies.",
  "description_provenance": [
    "Author Email: calvinb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:31Z (GMT). No. of bitstreams: 4 Permission-Model.pdf: 67835 bytes, checksum: 0fcd2de857754fc1036a364229dbed05 (MD5) calvinbullock.pdf: 328910 bytes, checksum: 420ee3f02b515ed032fd975d0a792631 (MD5) Doctoraldissertformpg1.pdf: 266202 bytes, checksum: 4fc626b2753a3131cb660ae56c91780e (MD5) Doctoraldissertformpg2.pdf: 343658 bytes, checksum: b33a807ae48d61ddded7f8c029730d45 (MD5)   Previous issue date: 2007-08-08"
  ],
  "handle": "28749",
  "identifier_other": "etd-08212007-163313",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08212007-163313/",
  "identifier_uri": "http://hdl.handle.net/10919/28749",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Permission-Model.pdf",
    "calvinbullock.pdf",
    "Doctoraldissertformpg1.pdf",
    "Doctoraldissertformpg2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Student Achievement",
    "School Building"
  ],
  "title": "The Relationship Between School Building Conditions and Student Achievement at the Middle School Level in the Commonwealth of Virginia",
  "type": "Dissertation"
}