{
  "contributor_author": "Yamaguchi, Nori",
  "contributor_committeechair": "Gibson, Harry W.",
  "contributor_committeemember": [
    "Kingston, David G. I.",
    "Riffle, Judy S.",
    "Ward, Thomas C.",
    "McGrath, James E."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:15:29Z",
  "date_adate": "1999-08-27",
  "date_available": "2014-03-14T20:15:29Z",
  "date_issued": "1999-08-12",
  "date_rdate": "2000-08-27",
  "date_sdate": "1999-08-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The chemistry of the non-covalent bond has developed rapidly over the last few decades.   In particular, the successful construction of nanoscale assemblies by non-covalent forces has been described more frequently in the recent literature.   This significant progress is largely due to transferring of concepts found in the biological systems (e.g., the tobacco mosaic virus and the DNA double helix) to the area of synthetic chemistry.   As an example, the architecture of the double helix, perhaps the most well-known biological self-assembling structure, remarkably demonstrates the ability of biological systems to construct large supramolecules by multiple aggregations of relatively simple building blocks by means of hydrogen bonding.   Scientists have begun to employ such synthetic strategy adopted in Nature to construct nanoscale systems.     The use of pseudorotaxane assemblies formed between the suitably sized crown ethers and dipyridinium salts (paraquats) or dibenzylammonium ions is a viable synthetic strategy to construct non-covalent systems because of their selectivity and strong hydrogen bonding ability.   We describe the syntheses and characterization of non-covalent assemblies of different sizes and shapes via the pseudorotaxane approach.     A series of dendritic pseudorotaxanes were efficiently prepared from self-assembling complimentary building blocks, namely a triply charged ammonium ion and the 1st, 2nd, and 3rd generations of benzyl ether dendrons bearing dibenzo-24-crown-8 moiety.   The wholly complexed self-assembling dendrimers were evidenced by 1H NMR spectroscopy and mass spectrometry.     Linear supramolecular pseudorotaxane polymers were formed with reversible chain extension in solution by self-assembly of two complimentary homoditopic molecules with secondary ammonium ion and dibenzo-24-crown-8 moieties.   The fraction of the cyclic dimer and the size of the linear suprastructures were determined in solution by 1H NMR spectroscopy as a function of concentration.   Viscosity measurements corroborated the presence of aggregates of large hydrodynamic volume at high concentrations.   The solid state samples of the supramolecular polymers, prepared by freeze-drying, were analyzed by DSC and optical microscopy and shown to be distinct from the starting materials and the cyclic dimer.   Fibers and films were formed from high concentration solutions, corroborating the polymeric nature of the aggregates.   Similarly, polymolecular arrays were formed in solution from a heteroditopic self-complimentary molecule, comprising bis-m-phenylene-32-crown-10 and a paraquat unit.     Side-chain polypseudorotaxanes were prepared from spontaneous association of polymethacrylates bearing dibenzo-24-crown-8 and secondary ammonium ions.   The complexation behavior in solution was investigated using 1H NMR spectroscopy.   The solid state samples of side-chain polypseudorotaxanes, prepared by freeze-drying, showed noticeable changes in thermal behavior and morphology from the individual components.",
  "description_provenance": [
    "Author Email: nyamaguc@vt.edu",
    "Advisor Email: dkingston@chemserver.chem.vt.edu",
    "Advisor Email: hwgibson@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: tward@chemserver.chem.vt.edu",
    "Advisor Email: jmcgrath@chemserver.chem.vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:29Z (GMT). No. of bitstreams: 21 title.pdf: 3749 bytes, checksum: 2066b7e5ddb9e01c19079c7a99807b64 (MD5) ch1.pdf: 526762 bytes, checksum: 6fe45b7fef7a15dde42644148a7d36f4 (MD5) ch2.pdf: 95360 bytes, checksum: a05f733d339f931e9e373b916e6e4b25 (MD5) ch3.pdf: 132406 bytes, checksum: 3d18eba7420d31eec89f118629ec9f77 (MD5) lot.pdf: 6299 bytes, checksum: dc008b0d77e1e3f6856d4cd9ab995a8e (MD5) acknowledgements.pdf: 4356 bytes, checksum: 7c7926ad37b8782e8571a67ba089f0ab (MD5) toc.pdf: 9688 bytes, checksum: 36ed788b3180499c2a694183e55ebbc3 (MD5) lof.pdf: 28314 bytes, checksum: 7b8efb245802554764b67967fc91de41 (MD5) ch13.pdf: 56165 bytes, checksum: 54e939e1f9a0ae95e612c2dfe6591f58 (MD5) ch12.pdf: 110158 bytes, checksum: faa8d9b745632fb1dc401fbf934a60b8 (MD5) ch11.pdf: 283584 bytes, checksum: e151c4a88fea04d2f88c9259526935ef (MD5) ch10.pdf: 95729 bytes, checksum: 221f9dba5e59ea8884fac475833ee7a4 (MD5) ch8.pdf: 106046 bytes, checksum: 56e42d64d390659f109b8859d1223d85 (MD5) ch7.pdf: 49509 bytes, checksum: 963f2f6df5727140ebb4cbcdf0d739e1 (MD5) ch9.pdf: 403261 bytes, checksum: f0eb270c87b27637d6fadc94b210a8d6 (MD5) ch6.pdf: 57154 bytes, checksum: 1e76f58e0d3107ce880a2aacafe6fa5e (MD5) ch5.pdf: 173335 bytes, checksum: 61dc59d6ad84ea1d5916054ff1b8c8a1 (MD5) ch4.pdf: 292209 bytes, checksum: 6d20a6ac8c2d1db1b5d43a549ae76231 (MD5) ab.pdf: 8123 bytes, checksum: 416bd165cdbb647fe0eca1aa52467414 (MD5) ch14.pdf: 183936 bytes, checksum: 565848dfe8e1cb5b2bfdeee16b8c8684 (MD5) vita.pdf: 3507 bytes, checksum: 88cc20dfc747ba2d57781ab55a5e85d5 (MD5)   Previous issue date: 1999-08-12"
  ],
  "handle": "28741",
  "identifier_other": "etd-082099-101928",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-082099-101928/",
  "identifier_uri": "http://hdl.handle.net/10919/28741",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "title.pdf",
    "ch1.pdf",
    "ch2.pdf",
    "ch3.pdf",
    "lot.pdf",
    "acknowledgements.pdf",
    "toc.pdf",
    "lof.pdf",
    "ch13.pdf",
    "ch12.pdf",
    "ch11.pdf",
    "ch10.pdf",
    "ch8.pdf",
    "ch7.pdf",
    "ch9.pdf",
    "ch6.pdf",
    "ch5.pdf",
    "ch4.pdf",
    "ab.pdf",
    "ch14.pdf",
    "vita.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "pseudorotaxanes",
    "supramolecular chemistry",
    "dendrimers",
    "self-assembly"
  ],
  "title": "Supramolecular Assemblies: Dendrimers, Linear Arrays, and Polypseudorotaxanes",
  "type": "Dissertation"
}