{
  "contributor_author": "Kephart, Christina Marie",
  "contributor_committeechair": "Jones, Russell T.",
  "contributor_committeemember": [
    "Ollendick, Thomas H.",
    "Johnson, Scott W.",
    "Finney, Jack W.",
    "Clum, George A. Jr."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:15:30Z",
  "date_adate": "2003-09-03",
  "date_available": "2014-03-14T20:15:30Z",
  "date_issued": "2003-08-18",
  "date_rdate": "2004-09-03",
  "date_sdate": "2003-08-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Previous studies have suggested that gay, lesbian, and bisexual individuals may be at increased risk for symptoms of depression and suicidality, but little empirical investigation to date has attempted to make clearer the stressors or factors that are associated with the development of symptoms.  This study explores the roles of identity development as a sexual minority individual and the acculturative process in terms of the impact of interaction with heterosexual culture as predictors of depressive and suicidal symptoms.  In addition, other psychosocial variable that have been previously associated with suicidality in other minority groups were tested as mediators between gay cultural identity and depressive and suicidal symptoms.  Gay, lesbian, and bisexual college students were recruited for participation through social groups specific to this population.   <p> Results indicated that gay cultural identity was associated with depressive and suicidal symptoms.  Furthermore, social support was shown to mediate the relationship between gay cultural identity and symptoms.  Both frequency of social contact and interpersonal quality of social support were included in the analyses, with the latter showing a stronger relationship to the outcome variables.  These findings emphasize the importance of research investigating points of intervention and organized efforts to provide social support to gay, lesbian, and bisexual youth that may be most effective in the prevention of depressive and suicidal symptoms.",
  "description_provenance": [
    "Author Email: ckephart@vt.edu",
    "Advisor Email: rtjones@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: swj@vt.edu",
    "Advisor Email: finney@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:30Z (GMT). No. of bitstreams: 1 Kephart_diss.pdf: 263430 bytes, checksum: 2db47e5c92af7e1e3489f7b78643c70f (MD5)   Previous issue date: 2003-08-18"
  ],
  "handle": "28744",
  "identifier_other": "etd-08212003-142701",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08212003-142701/",
  "identifier_uri": "http://hdl.handle.net/10919/28744",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kephart_diss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "depression",
    "identity",
    "acculturation",
    "lesbian",
    "gay"
  ],
  "title": "Identity Development and Acculturation Processes in Gay, Lesbian, and Bisexual Youth: Associations with Depressive and Suicidal Symptoms",
  "type": "Dissertation"
}