{
  "contributor_author": "Das, Sudipto",
  "contributor_committeechair": "Frazier, Charles E.",
  "contributor_committeemember": [
    "Glasser, Wolfgang G.",
    "Roman, Maren",
    "Zink-Sharp, Audrey G.",
    "Wilkes, Garth L."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:15:30Z",
  "date_adate": "2005-09-28",
  "date_available": "2014-03-14T20:15:30Z",
  "date_issued": "2005-07-18",
  "date_rdate": "2005-09-28",
  "date_sdate": "2005-08-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The performance of polymeric diphenylmethane diisocyanate (PMDI) resin is known to be highly dependent on the wood species. This species dependence may be due to differences in: cure chemistry, interphase morphology, or both of these factors. This study addresses aspects of the cure chemistry and interphase morphology of wood/PMDI bondlines; specifically these effects are compared using two woods: yellow-poplar and southern pine.  In this study, the cure chemistry of wood-PMDI system was analyzed with solid state NMR (SSNMR) using wood samples cured with doubly labeled (15N,13C) PMDI resin. The kinetics of PMDI cure in the presence of wood was analyzed with differential scanning calorimetry. Thermogravimetric analysis was used to analyze the effect of resin impregnation on the degradation patterns of wood. The wood-PMDI bond morphology was probed with dynamic and static (creep) mechanical analyses in both dry and plasticized conditions. The effect of resin on wood polymer relaxations was quantitatively analyzed by both the time-temperature superposition principle and the Kohlrausch-Williams-Watts equation. The presence of a small but statistically significant species effect was observed on both the cure chemistry and bond morphology of wood-PMDI system at low cure temperatures. The cure of PMDI resin was found to be significantly faster in pine relative to corresponding poplar samples. Resin impregnation showed a significant species dependent effect on the wood mechanical properties; the resinated pine samples showed increase in compliance while the corresponding poplar samples became stiffer.  The in situ lignin relaxation was studied with both dynamic and static modes, using plasticized wood samples. Results showed that the lignin relaxation was slightly affected by resin impregnation in both woods, but the effect was relatively larger in pine. Static experiments of dry wood samples showed a significant reduction in the interchain interactions of wood polymers in pine samples, exclusively. Investigation of plasticized pine samples, which focuses on the in situ lignin relaxations, showed only minor changes with resin impregnation. This led us to hypothesize that the large changes observed in dry samples, were due to the in situ amorphous polysaccharides. The wood-PMDI interactions were significantly reduced upon acetylation of wood. This study also discusses three new and highly sensitive methods for the analysis of wood-resin interactions.",
  "description_provenance": [
    "Author Email: sdas@vt.edu",
    "Advisor Email: cfrazier@vt.edu",
    "Advisor Email: wglasser@vt.edu",
    "Advisor Email: maren.roman@vt.edu",
    "Advisor Email: agzink@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:30Z (GMT). No. of bitstreams: 1 das.pdf: 6225297 bytes, checksum: 530ba79f3b7516def08cdeadf160f6a2 (MD5)   Previous issue date: 2005-07-18"
  ],
  "handle": "28745",
  "identifier_other": "etd-08212005-151149",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08212005-151149/",
  "identifier_uri": "http://hdl.handle.net/10919/28745",
  "publisher": "Virginia Tech",
  "relation_haspart": "das.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "wood species",
    "solid-state nuclear magnetic resosnance",
    "differential scanning calorimetry",
    "dynamic mechanical analysis",
    "thermogravimetric analysis",
    "creep",
    "polymeric isocyanate resin"
  ],
  "title": "Wood/Polymeric Isocyanate Resin Interactions: Species dependence",
  "type": "Dissertation"
}