{
  "contributor_author": "Houghton, Lawrence Mitchell",
  "contributor_committeechair": "Fraser, James D.",
  "contributor_committeemember": [
    "Walters, Jeffery R.",
    "Vaughan, Michael R.",
    "Stauffer, Dean F.",
    "Kelly, Marcella J."
  ],
  "contributor_department": "Fisheries and Wildlife Sciences",
  "date_accessioned": "2014-03-14T20:15:32Z",
  "date_adate": "2005-09-08",
  "date_available": "2014-03-14T20:15:32Z",
  "date_issued": "2005-08-09",
  "date_rdate": "2006-09-08",
  "date_sdate": "2005-08-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In the early 1990's, a series of habitat changes caused by storms and subsequent beach management by the U.S. Army Corps of Engineers (USACE, The Corps) provided a unique opportunity to study piping plover population dynamics in a changing environment. In this study, 1993-2004, we attempt to determine the factors that limit or influence the abundance and distribution of piping plovers in West Hampton Dunes (WHD), Long Island, NY, a renourished, highly developed, and high human disturbance area. <br> The piping plover population on Westhampton Island increased after the hurricane of 1938, and declined thereafter. The decline co-occurred with beach development and vegetative succession. After storms in the winter of 1992-1993 breached the island at West Hampton Dunes, piping plovers re-colonized the area. The New York District USACE filled the breach in 1993, and renourished the beach in 1996 and 2000-2001.  USACE renourished parts of the groinfield in Westhampton Beach in 1997. <br> Each spring and summer, we monitored plovers intensively at WHD and part of the adjacent town of Westhampton Beach (The Reference Area) 1993-2004.  We located nests and estimated reproductive and nest and chick survival rates.  We monitored plover management efforts and determined causes of nest loss when possible.  We monitored piping plover behaviors and obtained an index to plover food supply.  We estimated area of plover habitats and defined areas unsuitable for piping plover nesting.   We also obtained indices to human and predator presence on the beach. <br> The WHD piping plover population increased from 0 pairs in 1992 to 39 in 2000 then decreased to 18 pairs in 2004. This decline was closely associated with changes in potential nesting habitat which increased from 22.4 ha in 1992 to 50.1 ha in 2000 then declined to 31.1 ha in 2004.<br>  The primary process regulating the WHD population appears to be density dependent immigration and emigration.  No other vital rates (clutch size, renest rate, fertility, egg survival, nest survival, chick survival, brood survival, chicks fledged/pair) were correlated with density. The higher equilibrium density at WHD (~1 pair/ha) than at The Reference Area (~0.4 pair/ha) appeared to be a function of the large bay intertidal flats at WHD.   The most common nest predators, cats (WHD = 13% of known predated nests), American Crows (17% of known predated nests) and foxes (37% of known predated nests), are newcomers to piping plover habitats.  Thus, plovers may be especially vulnerable to them.  Predator removal from the study area appeared to improve nest success and chick survival (R2 = 0.79).  Predator exclosures at nests reduced nest loss (WHD = 34% exclosed nests lost vs. 43% of unexclosed nests lost, though in one year, one or more foxes learned to exploit plovers in exclosures (22% of all exclosed nests were predated by foxes in 1995).  <br>  This study highlights the long suspected piping plover paradox: increasing beach width can temporarily raise the carrying capacity of an area, but preventing overwash can reduce or eliminate the natural formation of the bay side foraging flats that increase piping plover density, and sometimes, survival.  Moreover, beach stabilization allows human development of the habitat which also reduces the carrying capacity of the environment for piping plovers, increases human/plover interactions, and attracts potential predators.",
  "description_provenance": [
    "Author Email: houghton@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: fraser@vt.edu",
    "Advisor Email: mvaughan@vt.edu",
    "Advisor Email: dstauffe@vt.edu",
    "Advisor Email: makelly2@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:32Z (GMT). No. of bitstreams: 1 LarryHoughtonETD.pdf: 2543101 bytes, checksum: 01b1e1725af1444eb50c52fc164b5d66 (MD5)   Previous issue date: 2005-08-09"
  ],
  "handle": "28755",
  "identifier_other": "etd-08222005-172829",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08222005-172829/",
  "identifier_uri": "http://hdl.handle.net/10919/28755",
  "publisher": "Virginia Tech",
  "relation_haspart": "LarryHoughtonETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Immigration",
    "Ornithology",
    "Beach Renourishment",
    "Emmigration",
    "Population Dynamics"
  ],
  "title": "Piping plover population dynamics and effects of beach management practices on piping plovers at West Hampton Dunes and Westhampton Beach, New York",
  "type": "Dissertation"
}