{
  "contributor_author": "Chance, Donald R",
  "contributor_committeecochair": [
    "Richardson, Jesse J.",
    "Zahm, Diane L."
  ],
  "contributor_committeemember": [
    "Holloway, Rachel L.",
    "Koebel, Charles Theodore"
  ],
  "contributor_department": "Urban Affairs and Planning",
  "date_accessioned": "2014-03-14T20:15:31Z",
  "date_adate": "2007-10-31",
  "date_available": "2014-03-14T20:15:31Z",
  "date_issued": "2007-08-14",
  "date_rdate": "2007-10-31",
  "date_sdate": "2007-08-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation introduces a new theory of practice for land planning in America based on behavioralism. It is called culture based incentive planning, or CBIP. The CBIP model and techniques are based on four pillars: cultural snesitivity, behavior analysis, engineered incentive regimes, and the tools of persuasion. CBIP is designed to provide an adaptable framework from which to approch regulatory reform in planning. The framework is applicable to the full range of planning implementation strategies from commond and control to market-based approaches.    CBIP, as a systems model, has been engineered to create a cooperative rather than adversarial relationship between government and the regulated community by recognizing issues of cultural sensitivity, market response, and behavioral motivations. Under the model, effective implementation of planning objectives is directly tied to the role that incentives play in human behavior. Based on the foundation of incentive theory, CBIP integrates a variety of principles and techniques from applied behavior analysis and behavioral economics to align incentives that drive personal behavior with public planning objectives. CBIP utiliizes a variety of incentives in planning practice including economic, process, lifestyle, social, behavioral, and technical assistance inducements.",
  "description_provenance": [
    "Author Email: dochance@vt.edu",
    "Advisor Email: jessej@vt.edu",
    "Advisor Email: rhollowa@vt.edu",
    "Advisor Email: tkoebel@vt.edu",
    "Advisor Email: dzahm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:31Z (GMT). No. of bitstreams: 1 CBIPBookETDRevised101607.pdf: 953139 bytes, checksum: aea91838051ce3acaaa3f08bf3b3e772 (MD5)   Previous issue date: 2007-08-14"
  ],
  "handle": "28750",
  "identifier_other": "etd-08212007-170621",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08212007-170621/",
  "identifier_uri": "http://hdl.handle.net/10919/28750",
  "publisher": "Virginia Tech",
  "relation_haspart": "CBIPBookETDRevised101607.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "behavioral planning",
    "growth management",
    "regulatory reform",
    "market-based planning",
    "incentive planning"
  ],
  "title": "A Behavioral Theory of Planning",
  "type": "Dissertation"
}