{
  "contributor_author": "Mu, Shaohua Carolyn",
  "contributor_committeechair": "Hatfield, Donald E.",
  "contributor_committeecochair": "Gnyawali, Devi R.",
  "contributor_committeemember": [
    "Brinberg, David L.",
    "Lang, James R.",
    "Chen, Ming-Jer"
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:15:32Z",
  "date_adate": "2003-09-01",
  "date_available": "2014-03-14T20:15:32Z",
  "date_issued": "2003-07-25",
  "date_rdate": "2006-09-01",
  "date_sdate": "2003-08-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation investigates the factors that influence the learning of subsidiaries from their local environment and the sequential knowledge outflow from the subsidiaries. Scholars have recognized the ability to learn from diverse local environments as a critical source of competitive advantage for multinational corporations (MNCs). However, the factors influencing the extent to which MNCs learn from local environments in order to develop innovative capabilities have not been well understood.   Considering the complexity of institutional environments faced by subsidiaries, this dissertation explores cross-level factors that influence subsidiary learning from diverse local environments. At interface levels, a subsidiary's local embeddedness and its learning strategy influence the awareness of local strategic knowledge by the subsidiary. At context levels, local market competition and corporate entrepreneurial culture affect the motivation of a subsidiary to learn from diverse local environments. Finally at subsidiary level, top management team heterogeneity impacts the capability of a subsidiary to learn.   This dissertation applies both qualitative and quantitative research methods. Multiple-case studies provide rich details, while survey research tests the generalizability of the proposed conceptual model. Overall, the empirical evidence supports the impact of local embeddedness, learning strategy and corporate entrepreneurial culture on subsidiary learning, and in turn, on knowledge outflow. The impact of top management team heterogeneity turns insignificant upon the simultaneous inclusion of all other factors. The influence of local competition is absent. The control variables include size, technology resources, and internationalization.  This dissertation contributes to both MNC and organizational learning literature. The major contribution to MNC literature is the advancement of the understanding of knowledge acquisition and creation of MNCs by learning from the local environment. The cross-level approach with subsidiary as the unit of analysis provides a unique perspective. The major contribution of this dissertation to organizational learning literature lies in the development of a learning framework, and its application to MNC context with empirical tests. This dissertation presents potentials to advance the local responsiveness-global integration framework with a knowledge-based view.",
  "description_provenance": [
    "Author Email: smu@vt.edu",
    "Advisor Email: hatfield@vt.edu",
    "Advisor Email: devi@vt.edu",
    "Advisor Email: brinberg@vt.edu",
    "Advisor Email: jlang@vt.edu",
    "Advisor Email: ChenM@darden.virginia.edu",
    "Made available in DSpace on 2014-03-14T20:15:32Z (GMT). No. of bitstreams: 1 dissertation_mu.pdf: 3104625 bytes, checksum: aac1f5a4a2509c7c66178001d07763fe (MD5)   Previous issue date: 2003-07-25"
  ],
  "handle": "28754",
  "identifier_other": "etd-08222003-022343",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08222003-022343/",
  "identifier_uri": "http://hdl.handle.net/10919/28754",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation_mu.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Corporate entrepreneurial culture",
    "Subsidiary learning",
    "Local embeddedness",
    "Learning strategy",
    "Knowledge outflow",
    "Inter-subsidiary communication"
  ],
  "title": "Subsidiary Innovation and Diffusion: An Integrated Approach on Learning of Subsidiaries from Diverse Local Environments",
  "type": "Dissertation"
}