{
  "contributor_author": "Wang, Yuqiang",
  "contributor_committeechair": "Sarin, Subhash C.",
  "contributor_committeemember": [
    "Fraticelli, Barbara M. P.",
    "Sturges, Robert H.",
    "Koelling, Charles Patrick"
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:15:32Z",
  "date_adate": "2007-08-24",
  "date_available": "2014-03-14T20:15:32Z",
  "date_issued": "2007-08-08",
  "date_rdate": "2012-10-08",
  "date_sdate": "2007-08-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this dissertation, we address three different combinatorial optimization problems (COPs), each of which has specific real-life applications. Owning to their specific nature, these problems are different from those discussed in the literature. For each of these problems, we present a mathematical programming formulation, analyze the problem to determine its useful, inherent structural properties, and develop an efficient methodology for its solution by exploiting these properties. <p>  The first problem that we address is the course timetabling problem encountered at Virginia Tech. The course timetabling problem for a university is a difficult problem and has been studied by many researchers over the years. As a result, a plethora of models and approaches have been reported in the literature. However, most of these studies have focused on applications pertaining to course scheduling for a single or at most few departments of a university. The sheer size of the university-wide timetabling problem that we address, involving thousands of courses to be scheduled in hundreds of classrooms in each semester, makes it a challenging problem. We employ an appropriate decomposition technique that relies on some inherent structural properties of the problem both during the modeling and algorithmic development phases. We show the superiority of the schedules generated by our methodology over those that are currently being used. Also, our methodology requires only a reasonable amount of computational time in solving this large-size problem. <p>  A facility layout problem involving arbitrary-shaped departments is the second problem that we investigate in this dissertation. We designate this problem as the arbitrary-shaped facility layout problem (ASFLP). The ASFLP deals with arranging a given set of departments (facilities, workstations, machines) within the confines of a given floor space, in order to optimize a desired metric, which invariably relates to the material handling cost. The topic of facility planning has been addressed rather extensively in the literature. However, a major limitation of most of the work reported in the literature is that they assume the shape of a department to be a rectangle (or even a square). The approach that relies on approximating an arbitrary-shaped department by a rectangle might result in an unattractive solution. The key research questions for the ASFLP are: (1) how to accurately model the arbitrary-shaped departments, and (2) how to effectively and efficiently determine the desired layout. We present a mixed-integer programming model that maintains the arbitrary shapes of the departments. We use a meta-heuristic to solve the large-size instances of the ASFLP in a reasonable amount of time. <p>  The third problem that we investigate is a supply chain scheduling problem. This problem involves two stages of a supply chain, specifically, a manufacturer and one or more customers. The key issue is to achieve an appropriate coordination between the production and distribution functions of the manufacturer so as to minimize the sum of the shipping and job tardiness costs. We, first, address a single customer problem, and then, extend our analysis to the case of multiple customers. For the single-customer problem, we present a polynomial-time algorithm to solve it to optimality. For the multiple-customer problem, we prove that this problem is NP-hard and solve it by appropriately decomposing it into subproblems, one of which is solvable in polynomial time. We propose a branch-and-bound-based methodology for this problem that exploits its structural properties. Results of an extensive computational experimentation are presented that show the following: (1) our algorithms are efficient to use and effective to implement; and (2) significant benefits accrue as a result of integrating the production and distribution functions.",
  "description_provenance": [
    "Author Email: yuwang6@vt.edu",
    "Advisor Email: bfratice@vt.edu",
    "Advisor Email: sarins@vt.edu",
    "Advisor Email: sturges@vt.edu",
    "Advisor Email: koelling@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:32Z (GMT). No. of bitstreams: 1 ETD_Billy.PDF: 1176281 bytes, checksum: b8d9ff47c5fbe0db053df453af4c6c86 (MD5)   Previous issue date: 2007-08-08"
  ],
  "handle": "28757",
  "identifier_other": "etd-08222007-021549",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08222007-021549/",
  "identifier_uri": "http://hdl.handle.net/10919/28757",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD_Billy.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "University Course Timetabling Problem",
    "Integrated Production-Distribution Scheduling Pr",
    "Combinatorial Optimization",
    "Benders' Decomposition",
    "Facility Layout Problem",
    "Mixed-Integer Programming"
  ],
  "title": "Models and Algorithms for Some Combinatorial Optimization Problems: University Course Timetabling, Facility Layout and Integrated Production-Distribution Scheduling",
  "type": "Dissertation"
}