{
  "contributor_author": "Muthanna, Chittiappa",
  "contributor_committeechair": "Devenport, William J.",
  "contributor_committeemember": [
    "Simpson, Roger L.",
    "Schetz, Joseph A.",
    "Thole, Karen A.",
    "Ragab, Saad A."
  ],
  "contributor_department": "Aerospace and Ocean Engineering",
  "date_accessioned": "2014-03-14T20:15:32Z",
  "date_adate": "2002-08-26",
  "date_available": "2014-03-14T20:15:32Z",
  "date_issued": "2002-05-24",
  "date_rdate": "2003-08-26",
  "date_sdate": "2002-08-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The flow through a compressor cascade with tip leakage has been studied experimentally.  The cascade of GE rotor B section blades had an inlet angle of 65.1º, a stagger angle of 56.9º, and a solidity of 1.08.  The final turning angle of the cascade was 11.8º.  This compressor configuration was representative of the core compressor of an aircraft engine.  The cascade was operated with a tip gap of 1.65%, and operated at a Reynolds number based on the chord length (0.254 m) of 388,000.  Measurements were made at 8 axial locations to reveal the structure of the flow as it evolved through the cascade.  Measurements were also made to reveal the effects of grid generated turbulence on this flow. The data set is unique in that not only does it give a comparison of elevated free stream turbulence effects, but also documents the developing flow through the blade row of a compressor cascade with tip leakage.  Measurements were made at a total of 8 locations 0.8, 0.23 axial chords upstream and 0, 0.27, 0.48, 0.77, 0.98, and 1.26 axial chords downstream of the leading edge of the blade row for both inflow turbulence cases.  The measurements revealed the formation and development of the tip leakage vortex within the passage.  The tip leakage vortex becomes apparent at approximately X/ca= 0.27 and dominated much of the endwall flow.  The tip leakage vortex is characterized by high streamwise velocity deficits, high vorticity and high turbulence kinetic energy levels.  The result showed that between 0.77 and 0.98 axial chords downstream of the leading edge, the vortex structure and behavior changes.  The effects of grid generated turbulence were also documented.  The results revealed significant effects on the flow field.  The results showed a 4% decrease in the blade loading and a 20% reduction in the vorticity levels within tip leakage vortex.  There was also a shift in the vortex path, showing a shift close to the suction side with grid generated turbulence, indicating the strength of the vortex was decreased.  Circulation calculations showed this reduction, and also indicated that the tip leakage vortex increased in size by about 30%.  The results revealed that overall, the turbulence kinetic energy levels in the tip leakage vortex were increased, with the most drastic change occurring at X/ca= 0.77.",
  "description_provenance": [
    "Author Email: chittiappa@vt.edu",
    "Advisor Email: simpson@aoe.vt.edu",
    "Advisor Email: devenport@aoe.vt.edu",
    "Advisor Email: ptiger@vt.edu",
    "Advisor Email: thole@vt.edu",
    "Advisor Email: ragab@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:32Z (GMT). No. of bitstreams: 2 KMCDissertation.pdf: 11942195 bytes, checksum: e7da7c8d01e1ae5714d01944f42502a1 (MD5) vita.pdf: 8807 bytes, checksum: 68f33a9d401ff53c4854b02c24d60798 (MD5)   Previous issue date: 2002-05-24"
  ],
  "handle": "28753",
  "identifier_other": "etd-08222002-194441",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08222002-194441/",
  "identifier_uri": "http://hdl.handle.net/10919/28753",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "KMCDissertation.pdf",
    "vita.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Wind Tunnel",
    "Cascade",
    "Free Stream Turbulence",
    "Compressor",
    "Hot Wire Anemometry"
  ],
  "title": "The Effects of Free Stream Turbulence on the Flow Field through a Compressor Cascade",
  "type": "Dissertation"
}