{
  "contributor_author": "Norman, Mary  Ann",
  "contributor_committeecochair": [
    "Barksdale, Mary Alice",
    "Graham, Richard Terry"
  ],
  "contributor_committeemember": [
    "Smith, J. Carroll",
    "Doolittle, Peter E."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:15:31Z",
  "date_adate": "2008-09-18",
  "date_available": "2014-03-14T20:15:31Z",
  "date_issued": "2008-06-30",
  "date_rdate": "2009-09-18",
  "date_sdate": "2008-08-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract  Classroom teachers determine how reading is taught and their decisions are influenced both by the policies instituted by local, state and national agencies and the beliefs teachers hold. Teacher decision making strongly influences the teaching of reading in classrooms. Marzano (2003) stated, â  â ¦ all researchers agree that the impact of decisions made by individual teachers is far greater than the impact of decisions made at the school level (p. 71). Snow, Burns and Griffin (1998) state â  quality classroom instruction in kindergarten and the primary grades is the single best weapon against reading failureâ   (p. 343). Research on teacher decision making developed in the early 1980â  s, yet little current research focuses on decision making concerning reading instruction. Often studies examine primary level reading instruction and if grades beyond primary are investigated, comprehension is the center of the examination (Durkin, 1978). The purpose of this dissertation was to examine the decisions 2nd, 3rd and 4th grade experienced teachers make in their reading instructional practices. A case study approach was used with an analysis of data from field based observations and semi- structured interviews of 7 public school classroom teachers in one school. Artifact analysis from teacher samples and an analysis of reading instructional policies within the school and schools system were used to expand the analysis of data.  Three major themes were identified: (1) grouping; (2) instructional focus; and (3) strategies.  Major differences were found between second grade, where students did not take the state mandated testing (SMT), and third and fourth grades where students were required to take the state mandated testing (SMT). Second grade teachers focused their reading instruction on the aesthetic components of reading with the purpose of developing readers who found enjoyment in reading.  Third and fourth grade teachers focused their reading instruction on preparing students for test taking. This dissonance in reading instruction created a gap, or chasm in the decisions made about reading instruction in these grades.  The chasm appeared to be based on the dissonance of purpose for grade levels. The emphasis on passing the SMT greatly affected the purpose of teacher decisions on the third and fourth grade levels, and this purpose is influenced by local, state and federal policy of accountability by high-stakes testing.",
  "description_provenance": [
    "Author Email: manorman@vt.edu",
    "Advisor Email: csmith@gardner-webb.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: mbarksda@vt.edu",
    "Advisor Email: rgraham@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:31Z (GMT). No. of bitstreams: 2 approval.pdf: 145218 bytes, checksum: 9bc653ef75e340b9c525054206af42bb (MD5) finaldoc-9-16-08.pdf: 642137 bytes, checksum: 0b727662603856bdd91940b662ad37da (MD5)   Previous issue date: 2008-06-30"
  ],
  "handle": "28751",
  "identifier_other": "etd-08212008-101525",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08212008-101525/",
  "identifier_uri": "http://hdl.handle.net/10919/28751",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "approval.pdf",
    "finaldoc-9-16-08.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "teacher decision making",
    "elementary education",
    "teacher education",
    "reading instruction",
    "instructional focus",
    "strategies",
    "grouping",
    "literacy",
    "effects of state mandated testing"
  ],
  "title": "Looking Through Their Lens: The Decisions about Reading Instruction Made by Experienced 2nd, 3rd and 4th Grade Teachers",
  "type": "Dissertation"
}