{
  "contributor_author": "Springston, Mark R.",
  "contributor_committeechair": "Sanders, Mark E.",
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Cachaper, Cecile D.",
    "Goff, Richard M.",
    "Sherman, Thomas M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:15:35Z",
  "date_adate": "2005-09-08",
  "date_available": "2014-03-14T20:15:35Z",
  "date_issued": "2005-07-28",
  "date_rdate": "2010-10-07",
  "date_sdate": "2005-08-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>An experiment was conducted investigating the utility of teamwork exercises and problem structure for promoting technological problem solving in a student team context. The teamwork exercises were designed for participants to experience a high level of psychomotor coordination and cooperation with their teammates. The problem structure treatment was designed based on small group research findings on brainstorming, information processing, and problem formulation. First-year college engineering students (N = 294) were randomly assigned to three levels of team size (2, 3, or 4 members) and two treatment conditions: teamwork exercises and problem structure (N = 99 teams). In addition, the study included three non-manipulated, independent variables: team gender, team temperament, and team teamwork orientation. Teams were measured on technological problem solving through two conceptually related technological tasks or engineering design activities: a computer bridge task and a truss model task. The computer bridge score and the number of computer bridge design iterations, both within subjects factors (time), were recorded in pairs over four 30-minute intervals. For the last two intervals with the computer bridge, teams started construction of the truss model task, which created low and high task load conditions for the computer bridge: another within subjects factor.  </p><p> A repeated measures ANOVA was used to analyze time (computer bridge) by factor interactions. No significant time by teamwork exercises or time by problem structure interactions on computer bridge scores were found [F(2.31, 198.46) = 0.10, p = .928; F(2.31, 198.46) = 0.03, p = .984]. There was a significant interaction between the factors of time and team size [F(4.62, 198.46) = 2.75, p = .023]. An ANOVA was conducted with the between subject factors on the truss model task. A significant main effect was found for teamwork exercises [F(1, 86) = 2.84, p = .048, one-tailed], but not for problem structure or team size. Post hoc analyses were conducted for team size on computer bridge and iteration scores over time, as well as teamwork exercises effects for each team size. Findings and their implications were reported, along with suggestions for future research on technological problem solving in a team context.</p>",
  "description_provenance": [
    "Author Email: maspring@vt.edu",
    "Advisor Email: msanders@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:35Z (GMT). No. of bitstreams: 8 08TeamworkExercise3.mov: 6636904 bytes, checksum: 94af481f81456d53f4b8e4e9951ab585 (MD5) 07TeamworkExercise2.mov: 5040400 bytes, checksum: 930e4731cb14be1205d4aad11b7fedd3 (MD5) 06TeamworkExercise1.mov: 4383280 bytes, checksum: e5b38c2b47c94f141a75654029379538 (MD5) 02RegistrationWebSite.zip: 1555019 bytes, checksum: ae1e6620b51c0fb000d17c54d9aaa288 (MD5) 04EngineeringWorkSpace.pdf: 971299 bytes, checksum: 0e983e17fc808cbae80c8fd29d26e367 (MD5) 05WPBDv4GUI.mov: 16848834 bytes, checksum: e0cee4ab062f955c1605f8f211f102ed (MD5) 03AlternativeActivity.pdf: 2609842 bytes, checksum: 1afaa98db52f2e2d1a55a5c4df342ad7 (MD5) 01MspringstonDissertation.pdf: 11673808 bytes, checksum: 065a3b6940871998efd7ddb88c1ddc3c (MD5)   Previous issue date: 2005-07-28"
  ],
  "handle": "28767",
  "identifier_other": "etd-08232005-173425",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08232005-173425/",
  "identifier_uri": "http://hdl.handle.net/10919/28767",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "08TeamworkExercise3.mov",
    "07TeamworkExercise2.mov",
    "06TeamworkExercise1.mov",
    "02RegistrationWebSite.zip",
    "04EngineeringWorkSpace.pdf",
    "05WPBDv4GUI.mov",
    "03AlternativeActivity.pdf",
    "01MspringstonDissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "task load and iterations",
    "team mental models",
    "small group research",
    "engineering design activity",
    "problem structure and problem formulation",
    "educational software",
    "brainstorming and ideation",
    "team temperament and gender",
    "technology education"
  ],
  "title": "Teamwork Exercises and Technological Problem Solving with  First-Year Engineering Students: An Experimental Study",
  "type": "Dissertation"
}