{
  "contributor_author": "Byvik, Charles E.",
  "contributor_committeechair": "Wollan, David S.",
  "contributor_committeemember": [
    "Jacobs, James A.",
    "Gilmer, Thomas E.",
    "Tipsword, Ray F.",
    "Williams, Clayton D."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:15:33Z",
  "date_adate": "2013-08-22",
  "date_available": "2014-03-14T20:15:33Z",
  "date_issued": "1971-09-05",
  "date_rdate": "2013-10-25",
  "date_sdate": "2013-08-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The dynamic nuclear polarization of hydrogen nuclei by the solid  effect in single crystals of samarium doped lanthanum magnesium nitrate  (Sm:LMN) has been studied theoretically and experimentally. The equations  of evolution governing the dynamic nuclear polarization by the  solid effect have been derived in detail using the spin temperature  theory and the complete expression for the steady-state enhancement of  the nuclear polarization has been calculated. For well-resolved solid  effect transitions at microwave frequencies Ï  ~ Ï <sub>e</sub> Â± Ï <sub>n</sub>, the expression  for the steady-state enhancement differs from the expression obtained by  the rate equation approach by small terms which become zero at Ï  ~ Ï <sub>e</sub> Â± Ï <sub>n</sub>  Experimental enhancements of the proton polarization  were obtained for eight crystals at 9.2 GHz and liquid helium temperatures.  The samarium concentration ranged from 0.1 percent to 1.1 percent as determined by X-ray fluorescence. A peak enhancement of 181  was measured for a 1.1 percent Sm:LMN crystal at 3.0<sup>â  </sup> K. The maximum  enhancements extrapolated with the theory using the experimental data  for peak enhancement versus microwave power and correcting for leakage,  agree with the ideal enhancement (24O in this experiment) within  experimental error for three of the crystals. The calculated satellite separation was within 6 percent of the measured separation for each of  the enhancement curves and the peak positive and negative enhancements  were equal for all but two of the crystals. The nuclear spinâ  lattice  relaxation time was measured for one of the crystals between l.6<sup>â  </sup> K and  4.2<sup>â  </sup>  K. To account for nuclear spinâ  lattice relaxation, spin diffusion  theory in the rapid airrusion limit was incorporated into the results  of the spin temperature theory of the solid effect. The experimental  results indicate that the spin temperature theory is a quantitatively  correct approach for the description of dynamic nuclear polarization  by the solid effect for wellâ  resolved solid effect transitions.</p>",
  "description_provenance": [
    "Author Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Made available in DSpace on 2014-03-14T20:15:33Z (GMT). No. of bitstreams: 1  LD5655.V856_1971.B99.pdf: 2763235 bytes, checksum: 82559e15fcc5c022be7554e426d6661a (MD5)    Previous issue date: 1971-09-05"
  ],
  "handle": "28762",
  "identifier_other": "etd-08222013-090654",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08222013-090654/",
  "identifier_uri": "http://hdl.handle.net/10919/28762",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1971.B99.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "metallic solids",
    "polarization of nuclei",
    "non-metallic solids"
  ],
  "subject_lcc": "LD5655.V856 1971.B99",
  "title": "Dynamic Nuclear Polarization in Samarium Doped Lanthanum Magnesium Nitrate",
  "type": "Dissertation"
}