{
  "contributor_author": "Madrigal, Johanna",
  "contributor_committeechair": "Quesada-Pineda, Henry Jose",
  "contributor_committeemember": [
    "Kline, D. Earl",
    "Smith, Robert M.",
    "Camelio, Jaime A."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:15:33Z",
  "date_adate": "2012-10-03",
  "date_available": "2014-03-14T20:15:33Z",
  "date_issued": "2012-08-09",
  "date_rdate": "2012-10-03",
  "date_sdate": "2012-08-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research presents results of innovation management practices and sustainability of continuous improvement. Innovation is recognized as a growth tool for economies in general however not all economy sectors have innovation as a strategy. This research  served as a case study to analyze how innovation is managed within innovative firms to help less innovative sectors, such as the wood products industry, to become profitable. Among the observed innovation management practices, this study was able to identify the use of continuous improvement to support incremental innovation. Although, continuous improvement is well known and accepted, there are still challenges to reach a sustainable state of continuous improvement. This research also addresses the difficulty in sustaining continuous improvement through a longitudinal case study.   A literature review was conducted to identify factors influencing the sustainability of the continuous improvement. These factors were gathered within a research framework which functioned as the main source to establish the questionnaire used as the research tool. Utilizing this tool, the study evaluated the hypotheses relating to   the effects of time, location and company type on the behavior of the enabling and inhibiting factors, and the relationships among them. Results demonstrated that time has no effect on factors affecting the sustainability of the continuous improvement, although changes affect how the factors are perceived as success factors in sustaining continuous improvement. The study also concluded that type of company and location impact how the inhibiting and enabling factors are perceived as supporters of the sustainability of the continuous improvement. Finally, the study revealed that these factors are correlated among them, thus sustainability is the result of a dynamic multifactor process rather that an unique factor. In addition to this new framework, the study also developed a self-assessment tool to be used for continuous improvement practitioners. With this tool, the new developed framework can be continuously monitored and proper and informed action can be taken by managers to address any observed gap in sustaining continuous improvement. Finally, the study also brings an example of interdisciplinary research which gathers quantitative methods from the statistics field, and qualitative methods from the business and social science fields.",
  "description_provenance": [
    "Author Email: jmadriga@vt.edu",
    "Advisor Email: quesada@vt.edu",
    "Advisor Email: kline@vt.edu",
    "Advisor Email: rsmith4@vt.edu",
    "Advisor Email: jcamelio@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:33Z (GMT). No. of bitstreams: 2 Madrigal_J_D_2012_f1.pdf: 2843592 bytes, checksum: 6780baf7fea250fcf155df7565b788f8 (MD5) Madrigal_J_D_2012_f2.pdf: 421650 bytes, checksum: d95e55e96daed07f9bd93109583219cb (MD5)   Previous issue date: 2012-08-09"
  ],
  "handle": "28760",
  "identifier_other": "etd-08222012-183238",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08222012-183238/",
  "identifier_uri": "http://hdl.handle.net/10919/28760",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Madrigal_J_D_2012_f1.pdf",
    "Madrigal_J_D_2012_f2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Innovation",
    "continuous improvement",
    "wood products",
    "manufacturing"
  ],
  "title": "Assessing sustainability of the continuous improvement process through the identification of enabling and inhibiting factors",
  "type": "Dissertation"
}