{
  "contributor_author": "Muller, Christopher Dustin",
  "contributor_committeechair": "Novak, John T.",
  "contributor_committeemember": [
    "Randall, Clifford W.",
    "Berry, Duane F.",
    "Love, Nancy G.",
    "Murthy, Sudhir N."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:15:35Z",
  "date_adate": "2006-10-03",
  "date_available": "2014-03-14T20:15:35Z",
  "date_issued": "2006-07-20",
  "date_rdate": "2006-10-03",
  "date_sdate": "2006-08-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> This study was conducted to address the controlling factors of biosolids stability as they relate to mesophilic anaerobic digestion, dewatering processes and digestion enhancement by wet sludge disintegration technologies.  The working hypothesis of this study is that digestion performance; nuisance odor generation and the degree of digestion enhancement by wet sludge disintegration are directly related to anaerobic floc structure and its interaction with shearing forces.  Mesophilic digestion was studied in two modes of operation, convention high rate and internal recycle mode to enhanced digestion using a wet sludge disintegration device.  The internal recycle system operated on the premise that stabilized sludge would be removed from the digester disintegrated, either by mechanical shear or ultrasonic disintegration for this study, and returned it for to the digester further for futher stabilization.  Both benchscale and full-scale demonstrations found this mode of digestion enhancement to be effective for mechanical shear and ultrasonic disintegration.   </p><p> It was also determined that volatile solids destruction in both conventional and enhanced mesophilic anaerobic digesters can be reasonably predicted by the concentration of cations in the sludge being treated.  It was found that depending on the disintegration device used to enhance digestion performance was influenced by different cation associated fractions of the sludge floc.   </p><p> Along with the improvement of digester performance, overall biosolids stability was investigated through of volatile organic sulfur emissions from dewatered biosolids.  In doing so, a method to mimic high solids centrifugation in the laboratory was developed.  The centrifugation method identified three major factors that contribute to the generation of odors from biosolids: shear, polymer dose, and cake dryness.  The inclusion of shearings suggest that one means of reducing odors from biosolids generated by centrifugation is to use a shear enhanced digestion technology to degrade odor precursors, such as amino acids, within the digester prior to dewatering.  Furthermore, the mechanical shearing within a digester is thought to be similar to that of mechanical shear enhanced digestion; therefore, the floc properties that control the digestion process would control observed odor generation.</p>",
  "description_provenance": [
    "Author Email: cmuller@vt.edu",
    "Advisor Email: cliff@vt.edu",
    "Advisor Email: duberry@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Advisor Email: nlove@vt.edu",
    "Advisor Email: sudhirmurthy@dcwasa.com",
    "Made available in DSpace on 2014-03-14T20:15:35Z (GMT). No. of bitstreams: 1 ETD-MULLER-2006.PDF: 651973 bytes, checksum: 49fc261d4ae21927b97554e38199edf9 (MD5)   Previous issue date: 2006-07-20"
  ],
  "handle": "28768",
  "identifier_other": "etd-08232006-110509",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08232006-110509/",
  "identifier_uri": "http://hdl.handle.net/10919/28768",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD-MULLER-2006.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "stability",
    "nuisance odors",
    "biosolids",
    "mechanical shear",
    "floc structure",
    "centrifugal dewatering",
    "ultrasonics",
    "anaerobic digestion",
    "enhanced anaerobic digestion"
  ],
  "title": "Shear Forces, Floc Structure and their Impact on Anaerobic Digestion and Biosolids Stability",
  "type": "Dissertation"
}