{
  "contributor_author": "Wang, Hui-Shan  Amy",
  "contributor_committeechair": "Holladay, Steven D.",
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:15:36Z",
  "date_adate": "2007-08-31",
  "date_available": "2014-03-14T20:15:36Z",
  "date_issued": "2007-08-10",
  "date_rdate": "2007-08-31",
  "date_sdate": "2007-08-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Arsenic is a human carcinogen associated with urinary bladder transitional cell carcinoma and other cancers.  Arsenic is also a strong comutagen and cocarcinogen.  One possible mode of action for arsenic carcinogenesis/cocarcinogenesis is inhibition of DNA damage repair.  In laboratory animals, urinary bladder transitional cell carcinoma has only been observed in dimethylarsinic acid [DMA(V)]-exposed F344 rats.       The goal of the present studies was to investigate inhibition of DNA repair as a mode of action for arsenic carcinogenesis/ cocarcinogenesis in the urinary bladder. Methods were first developed to harvest only transitional cells, the target cell type of arsenic carcinogenesis, suitable for RNA extraction or for DNA damage detection by Comet assay.  Morphological studies established that DMA(V) in drinking water at 40 ppm was cytotoxic to the urothelium of Sprague-Dawley and F344 rats, and mitochondria were targeted by DAM(V).      To investigate whether DMA(V) decreases the expression of DNA repair genes, mRNA levels of DNA repair genes in transitional cells were next measured in F344 rats exposed to up to 100 ppm DMA(V) in drinking water for 4 weeks. The mRNA levels of Ataxia Telangectasia mutant (ATM), X-ray repair cross-complementing group 1 (XRCC1), excision repair cross-complementing group 3/Xeroderma Pigmentosum B (ERCC3/XPB), and DNA polymerase beta genes were not altered, as measured by real time RT PCR.  These results suggested either that DMA(V) affects DNA repair without affecting the baseline expression of DNA repair genes or that DMA(V) does not affect DNA repair in the bladder.      Arsenic effects on DNA repair were further investigated in F344 rats given 100 ppm DMA(V) or arsenate in drinking water for 1 week.  DNA damage levels in transitional cells and micronuclei frequency (MN) in bone marrow were measured.  Dimethylarsinic acid did not affect in vivo cyclophosphamide-induced DNA damage, and neither DMA(V) nor arsenate inhibited in vitro repair of hydrogen peroxide- or formaldehyde-induced DNA damage, as measured by Comet assay.  Neither DMA(V) nor arsenate increased MN or elevated in vivo cyclophosphamide-increased MN.  These results suggest inhibition of DNA repair by arsenic, in the transitional epithelium, may not be a major mechanism responsible for carcinogensis/cocarcinogenesis in the bladder.",
  "description_provenance": [
    "Author Email: amywang@vt.edu",
    "Advisor Email: holladay@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:36Z (GMT). No. of bitstreams: 1 Hui-Shan_Amy_Wang_Dissertation.pdf: 2969790 bytes, checksum: 6c84ed6e409c6bb42b8ab0f4c3b68264 (MD5)   Previous issue date: 2007-08-10"
  ],
  "handle": "28773",
  "identifier_other": "etd-08232007-180656",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08232007-180656/",
  "identifier_uri": "http://hdl.handle.net/10919/28773",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hui-Shan_Amy_Wang_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mode of action",
    "urinary bladder cancer",
    "arsenic",
    "cancer",
    "DNA damage repair",
    "cocarcinogen"
  ],
  "title": "Arsenic in drinking water caused ultra-structural damage in urinary bladder but did not affect expression of DNA damage repair genes or repair of DNA damage in transitional cells",
  "type": "Dissertation"
}