{
  "contributor_author": "Bechtel, Donald Keith",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Driscoll, Lisa G.",
    "Salmon, Richard G.",
    "Earthman, Glen I.",
    "Binggeli, Brian T."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:15:35Z",
  "date_adate": "2007-09-25",
  "date_available": "2014-03-14T20:15:35Z",
  "date_issued": "2007-04-24",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-08-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Educators often employ instructional approaches because of their customary use in the classroom, not because they are necessarily supported by validated evidence. Missing from leadership literature is an understanding specifically about elementary school principals' use of knowledge sources to support their instructional leadership. This study identified the knowledge sources used by nine elementary school principals, discovered the barriers they faced in using the sources, and revealed how they guided their teachers to use the sources. This study was guided by three research questions: (a) What are the knowledge sources used by elementary school principals in Virginia? (b) What are the barriers elementary school principals face to using the knowledge sources? (c) How do elementary school principals guide their teachers to use the sources? The elementary school principals completed extensive data analysis of students' Standards of Learning (SOL) test results and curriculum related benchmark test results to determine their students' instructional weaknesses and strengths. Despite the complexity of challenges such as students' poverty, mobility, and diversity, the elementary school principals conveyed a commitment to access the best current professional knowledge related to the curriculum, leadership, the brain, poverty, diversity, and motivation. Time constraints and funding limitations emerged as barriers for elementary school principals with using knowledge sources. The elementary school principals disseminated knowledge to teachers in a variety of formats. This study provides useful information to school system leaders, school board members, designers of principal preparation programs, and for professional organizations that seek to improve the profession by promoting evidence-based practices. The elementary school principals led with an overriding belief that all children could be successful. Their omnipresent spirit and motivating presence allowed their teachers to prevail despite significant contextual issues and identified instructional weaknesses related to their students. As head learners they accessed the best available knowledge sources and exemplified continuous professional enhancement. Results from SOL tests and curriculum based tests data were critically important knowledge sources. Data allowed the elementary school principals to lead teachers to make sound instructional decisions and enhance their pedagogical repertoires.",
  "description_provenance": [
    "Author Email: donald_bechtel@ccpsnet.net",
    "Advisor Email: ldriscol@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: brian.binggeli@fcps.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:35Z (GMT). No. of bitstreams: 1 Bechtel42407.pdf: 727220 bytes, checksum: e2cc358229c795f075f4a8058c3de4f9 (MD5)   Previous issue date: 2007-04-24"
  ],
  "handle": "28772",
  "identifier_other": "etd-08232007-161734",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08232007-161734/",
  "identifier_uri": "http://hdl.handle.net/10919/28772",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bechtel42407.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "knowledge sources",
    "elementary school principals",
    "leadership"
  ],
  "title": "A Study to Identify the Knowledge Sources Used by Nine Elementary School Principals in Virginia",
  "type": "Dissertation"
}