{
  "contributor_author": "Fink, Glenn Allen",
  "contributor_committeechair": "North, Christopher L.",
  "contributor_committeemember": [
    "Midkiff, Scott F.",
    "Arthur, James D.",
    "Tatar, Deborah Gail",
    "Marchany, Randolph C."
  ],
  "contributor_department": "Computer Science",
  "date_accessioned": "2014-03-14T20:15:35Z",
  "date_adate": "2006-10-05",
  "date_available": "2014-03-14T20:15:35Z",
  "date_issued": "2006-08-15",
  "date_rdate": "2007-10-05",
  "date_sdate": "2006-08-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Much computer communications activity is invisible to the user, happening without explicit permission. When system administrators investigate network communications activities, they have difficulty tracing them back to the processes that cause them. The strictly layered TCP/IP networking model that underlies all widely used, general-purpose operating systems makes it impossible to trace a packet seen on the network back to the processes that are responsible for generating and receiving it. The TCP/IP model separates the concerns of network routing and process ownership so that the layers cannot share the information needed to correlate packets to processes. But knowing what processes are responsible for communications activities can be a great help in determining whether that activity is benign or malicious.  </p><p> My solution combines a visualization tool, a kernel-level correlation engine, and middleware that ties the two together. My research enables security personnel to visually correlate packets to the processes they belong to helping users determine whether communications are benign or malicious. I present my discoveries about the system administrator community and relate how I created a new correlation technology. I conducted a series of initial interviews with system administrators to clarify the problem, researched available solutions in the literature, identified what was missing, and worked with users to build it. The users were my co-designers as I built a series of prototypes of increasing fidelity and conducted usability evaluations on them. I hope that my work will demonstrate how well the participatory design approach works. </p><p> My work has implications for the kernel structure of all operating system kernels with a TCP/IP protocol stack and network model. In light of my research, I hope security personnel will more clearly see sets of communicating processes on a network as basic computational units rather than the individual host computers. If kernel designers incorporate my findings into their work, it will enable much better security monitoring than is possible today making the Internet safer for all. </p>",
  "description_provenance": [
    "Author Email: finkga@vt.edu",
    "Advisor Email: north@cs.vt.edu",
    "Advisor Email: midkiff@vt.edu",
    "Advisor Email: arthur@vt.edu",
    "Advisor Email: tatar@cs.vt.edu",
    "Advisor Email: marchany@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:35Z (GMT). No. of bitstreams: 1 Final.pdf: 15167769 bytes, checksum: faf68330799112e26acfe773289bd738 (MD5)   Previous issue date: 2006-08-15"
  ],
  "handle": "28770",
  "identifier_other": "etd-08232006-203521",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08232006-203521/",
  "identifier_uri": "http://hdl.handle.net/10919/28770",
  "publisher": "Virginia Tech",
  "relation_haspart": "Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Insight-Based Method",
    "Computer Security",
    "Software Architecture",
    "Software Design",
    "Information Visualization",
    "Human-Computer Interaction"
  ],
  "title": "Visual Correlation of Network Traffic and Host Processes for Computer Security",
  "type": "Dissertation"
}