{
  "contributor_author": "Xu, Xiaohua",
  "contributor_committeechair": "Kulkarni, Rahul V.",
  "contributor_committeemember": [
    "Robinson, Hans D.",
    "Park, Kyungwha",
    "Pleimling, Michel J. F."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:15:40Z",
  "date_adate": "2010-09-16",
  "date_available": "2014-03-14T20:15:40Z",
  "date_issued": "2010-08-11",
  "date_rdate": "2010-09-16",
  "date_sdate": "2010-08-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Molecular cell biology has been an intensively studied interdisciplinary field with the rapid development of experimental techniques and fast upgrade of computational hardware and numerical tools. Recent technological developments have led to single-cell experiments which allow us to probe the role of stochasticity in cellular processes. Stochastic modeling of the corresponding processes is thus an essential ingredient for the understanding and interpretation of cellular systems of interest. In this thesis, we explore several nucleation-based stochastic cellular processes, i.e. Min protein oscillation in Escherichia coli, pausing phenomena in DNA transcription, and single-molecule enzyme kinetics. We focus on the key experimental results and build up stochastic models accordingly to provide quantitative insights to the underlying physical mechanisms for the corresponding biological processes. We utilize specific mathematical methods and computational algorithms to gain a better understanding and make predictions for further experimental explorations in the relevant fields.",
  "description_provenance": [
    "Author Email: xxh@vt.edu",
    "Advisor Email: hansr@vt.edu",
    "Advisor Email: kyungwha@vt.edu",
    "Advisor Email: pleim@vt.edu",
    "Advisor Email: kulkarni@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:40Z (GMT). No. of bitstreams: 1 Xiaohua_Xu_D_2010.pdf: 2874691 bytes, checksum: 925e51f18d7c47f83630437d145eb5c5 (MD5)   Previous issue date: 2010-08-11"
  ],
  "handle": "28784",
  "identifier_other": "etd-08242010-161307",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08242010-161307/",
  "identifier_uri": "http://hdl.handle.net/10919/28784",
  "publisher": "Virginia Tech",
  "relation_haspart": "Xiaohua_Xu_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "stochastic modeling",
    "first passage time",
    "nucleation",
    "subcellular localization",
    "biophysics"
  ],
  "title": "Modeling of nucleation-based stochastic processes in cellular systems",
  "type": "Dissertation"
}