{
  "contributor_author": "Gross, Martha E.",
  "contributor_committeechair": "Garvin, Michael J.",
  "contributor_committeemember": [
    "Flintsch, Gerardo W.",
    "Allen, Gary R.",
    "Kumar, Raman"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:15:40Z",
  "date_adate": "2010-09-10",
  "date_available": "2014-03-14T20:15:40Z",
  "date_issued": "2010-08-18",
  "date_rdate": "2010-09-10",
  "date_sdate": "2010-08-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "With its central role in the development of public-private partnership (PPP) contracts, procurement structure has a significant influence on the economic and policy success of privately-financed toll roads throughout their lifecycle.  Following a review of PPP fundamentals and the public-policy differentiation between public interest and public objectives, several approaches for establishing the key contract strategies of toll pricing, concession length, and risk mitigation are explored.  These underpinnings motivate the central research question: Given specific policy objectives for road pricing, how should public owners select PPP contract strategies which support these outcomes?  Through qualitative comparative analysis (QCA), a recently-developed method for evaluating qualitative data quantitatively, patterns of PPP contract strategies which correspond to three common policy objectives--achieving a specific toll rate, managing congestion, and minimizing state subsidy/maximizing revenue--are identified through evaluation of 18 domestic and international projects.  Three practical decision-making tools resulting from this work are illustrated through application to current PPP procurements: (1) a traffic-risk worksheet, which provides a rapid estimate of a toll-financed projectâ  s viability; (2) analytical QCA results, which offer guidance for structuring PPP contracts based on the desired pricing objectives; and (3) case-library comparisons, which enable drawing parallels between proposed procurements and established PPP projects.  Additional insights explore the nature of risk in this study, which concludes with thoughts on the appropriate role of PPPs in infrastructure delivery.",
  "description_provenance": [
    "Author Email: martha.gross@vt.edu",
    "Advisor Email: flintsch@vt.edu",
    "Advisor Email: gary.allen@vdot.virginia.gov",
    "Advisor Email: rkumar@vt.edu",
    "Advisor Email: garvin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:40Z (GMT). No. of bitstreams: 1 Gross_ME_D_2010.pdf: 1397941 bytes, checksum: 6334f5590bed146a19d5fc978c0c5fd2 (MD5)   Previous issue date: 2010-08-18"
  ],
  "handle": "28785",
  "identifier_other": "etd-08242010-173605",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08242010-173605/",
  "identifier_uri": "http://hdl.handle.net/10919/28785",
  "publisher": "Virginia Tech",
  "relation_haspart": "Gross_ME_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Public-private partnerships",
    "Transportation policy",
    "Toll roads",
    "QCA",
    "Qualitative comparative analysis"
  ],
  "title": "Aligning Public-Private Partnership Contracts with Public Objectives for Transportation Infrastructure",
  "type": "Dissertation"
}