{
  "contributor_author": "Arritt III, Fletcher M.",
  "contributor_committeecochair": [
    "Jahncke, Michael L.",
    "Eifert, Joseph D."
  ],
  "contributor_committeemember": [
    "Decker, C.",
    "Williams, Robert C.",
    "Pierson, Frank William"
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:15:41Z",
  "date_adate": "2004-08-27",
  "date_available": "2014-03-14T20:15:41Z",
  "date_issued": "2004-08-02",
  "date_rdate": "2004-08-27",
  "date_sdate": "2004-08-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Fish products under vacuum (VAC) and/or modified atmosphere packaging (MAP) conditions can have a significantly extended shelf life. Prevention of toxin production by Clostridium botulinum is essential for processors of VAC and MAP refrigerated fishery products.  The objective of this study was to determine if C. botulinum toxin development precedes microbiological spoilage and sensory rejection in fully cooked breaded and battered Alaskan Pollock or raw aquacultured flounder fillets.     Aquacultured summer flounder (Paralichthys dentatus) fillets and fully cooked breaded and battered Alaskan pollock (Theragra chalcogramma) were either aerobically packed (Oxygen Transmission Rate (OTR) of 3,000 cc/m2/24h@70°F for flounder and 6,000 cc/m2/24h@70°F for Pollock), vacuum packed or MAP packaged in a 100% CO2 atmosphere (OTR of 7.3 cc/m2/24h@70°F).  Flounder fillets were stored at either 4 or 10°C while pollock portions were stored at 8 and 12°C. Based on the time to spoilage (counts >107 CFU/g), additional samples were inoculated with five strains of nonproteolytic C. botulinum and analyzed qualitatively for botulinum toxin using a mouse bioassay.       For flounder at 4°C, toxin formation did not occur after 35 days in aerobically packed fillets.  Vacuum packed and 100% CO2 fillets produced toxin before spoilage at days 20 and 25, respectively.  In the aerobic packages at 10°C, toxin production occurred after spoilage at day 8, but before spoilage in the vacuum and 100% CO2 packages at day 9. Sensory evaluation of toxic vacuum and 100% CO2 packages at 4°C revealed toxin production proceeded spoilage and absolute sensory rejection. However, at 10°C toxin production was evident only after absolute sensory rejection and microbiological spoilage for aerobically packed fillets.  Vacuum packages and 100% CO2 packages were toxic during spoilage but before absolute sensory rejection.      Toxin was not present in the aerobically and 100% CO2 packed pollock samples at 8°C and the 100% CO2 packed samples at 12°C after 35 days.  Aerobically packed portions stored at 12°C first produced toxin at day 25; toxicity occurred after absolute sensory rejection and before spoilage. The vacuum packed portions first formed toxin at day 25 for 8 and 12°C storage before spoilage and absolute sensory rejection.",
  "description_provenance": [
    "Author Email: farritt@vt.edu",
    "Advisor Email: rcwillia@vt.edu",
    "Advisor Email: pierson@vt.edu",
    "Advisor Email: mjahncke@vt.edu",
    "Advisor Email: jeifert@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:41Z (GMT). No. of bitstreams: 1 Arrittdissertation04.pdf: 391818 bytes, checksum: d04df797402768c2537d6c513b43f816 (MD5)   Previous issue date: 2004-08-02"
  ],
  "handle": "28790",
  "identifier_other": "etd-08252004-160303",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08252004-160303/",
  "identifier_uri": "http://hdl.handle.net/10919/28790",
  "publisher": "Virginia Tech",
  "relation_haspart": "Arrittdissertation04.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "pollock",
    "Clostridium botulinum",
    "modified atmosphere",
    "flounder"
  ],
  "title": "The Effects of Modified Atmosphere Packaging on Toxin Production by Clostridium botulinum in Raw Aquacultured Flounder Fillets and Fully Cooked Breaded and Battered Pollock Portions",
  "type": "Dissertation"
}