{
  "contributor_author": "Colley, Kenna",
  "contributor_committeechair": "Parson, Stephen R.",
  "contributor_committeecochair": "Kelly, Patricia Proudfoot",
  "contributor_committeemember": [
    "Pitonyak, David",
    "Harris, Larry A.",
    "Niles, Jerome A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:15:43Z",
  "date_adate": "1999-08-27",
  "date_available": "2014-03-14T20:15:43Z",
  "date_issued": "1999-07-09",
  "date_rdate": "2000-08-27",
  "date_sdate": "1999-08-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to identify specific cultural elements within one elementary school to provide information about the school's identity and functioning.   These elements included values, beliefs, play, rituals, ceremonies, and cultural objects.  Schools are distinct and unique cultures.  The culture of each school building drives the daily happenings.  The culture either enhances or stifles growth.  By creating an awareness of school culture, educators can better understand the meaning of their day to day activities and how their school evolves towards continuous improvement.  The aim of interpreting a school culture is thus to understand meaning and symbols as they have been created by the members of the culture (Schultz, 1995). \tThis study uncovered evidence to demonstrate that  the awareness of stakeholders  of a school's culture influences how the culture works.  Interviews, artifact collection, digital photographs, meeting analysis, and fieldnotes from observations comprise the data.  The interviews were conducted with educators, staff, and parents to ascertain their perceptions of their culture.  Artifacts include documents such as weekly bulletins and meeting agendas that reflect the cultural workings.  These focus on personal and social aspects of the culture such a party invitation, which spoke of the members' personal and interpersonal connections.  Digital photographs were taken of inanimate objects within the building that visually depicted the values of the culture.  Meetings play a key role in cultivating and representing a culture's values and beliefs.  Meeting analysis helped to emphasize how this culture made decisions and how the culture structured its daily rhythm.  Fieldnotes based on direct observations of meetings an\t- 3 -d of key events within specific locations in and around the school building were taken.  Data sources were analyzed across interconnected themes.  These themes explain  how the culture worked and why its members did the things they did.  This study isolated specific cultural elements, specified the internal relationships among those elements, and then characterized the whole culture based on the current knowledge of the culture.",
  "description_provenance": [
    "Author Email: kcolley@radford.edu",
    "Advisor Email: dimagine@aol.com",
    "Advisor Email: lharris@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: kellyp@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:43Z (GMT). No. of bitstreams: 1 KColley.pdf: 964012 bytes, checksum: 6d1c5d6a0cbe764d03dc9303ef615269 (MD5)   Previous issue date: 1999-07-09"
  ],
  "handle": "28799",
  "identifier_other": "etd-082599-222148",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-082599-222148/",
  "identifier_uri": "http://hdl.handle.net/10919/28799",
  "publisher": "Virginia Tech",
  "relation_haspart": "KColley.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "beliefs",
    "collaboration",
    "play",
    "ceremonies",
    "rituals",
    "values"
  ],
  "title": "Coming to Know a School Culture",
  "type": "Dissertation"
}