{
  "contributor_author": "Gilbert, Elizabeth Ruth",
  "contributor_committeechair": "Wong, Eric A.",
  "contributor_committeemember": [
    "Dibner, Julia J.",
    "Jiang, Honglin",
    "McElroy, Audrey P.",
    "Webb, Kenneth E. Jr."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:15:41Z",
  "date_adate": "2008-09-04",
  "date_available": "2014-03-14T20:15:41Z",
  "date_issued": "2008-08-12",
  "date_rdate": "2008-09-04",
  "date_sdate": "2008-08-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "To better understand the digestive and absorptive capacities of the chick intestine so that we may feed diets that better meet the nutritional needs of the chick, it is important to understand how expression of nutrient transporter genes changes in response to various factors. A series of feeding trials were conducted to evaluate the dietary and developmental regulation of nutrient transporter mRNA abundance in the small intestine of two lines of broilers selected on corn-based (Line A) or wheat-based (Line B) diets. Abundance of mRNA was quantified in all experiments using real time PCR and the absolute quantification method. The objective of the first study was to investigate intestinal nutrient transporter and enzyme mRNA in Line A and B broilers at embryo day 18 and 20, day of hatch, and d 1, 3, 7, and 14 posthatch. Genes evaluated included the peptide transporter, PepT1, 10 AA transporters (rBAT, bo,+AT, ATBo,+, CAT1, CAT2, LAT1, y+LAT1, y+LAT2, BoAT and EAAT3), four sugar transporters (SGLT1, SGLT5, GLUT5, and GLUT2), and a digestive enzyme, APN. For PepT1, Line B had greater quantities of mRNA compared with Line A (P = 0.001), suggesting a greater capacity for absorption of AA as peptides. Levels of PepT1 mRNA were greatest in the duodenum (P < 0.05), whereas the abundances of SGLT1, GLUT5 and GLUT2 mRNA were greatest in the jejunum (P < 0.05). Abundances of EAAT3, bo,+AT, rBAT, BoAT, LAT1, CAT2, SGLT5 and APN mRNA were greatest in the ileum (P < 0.05). Quantities of PepT1, EAAT3, BoAT, SGLT1, GLUT5, and GLUT2 mRNA increased linearly (P < 0.01), while CAT1, CAT2, y+LAT1, and LAT1 mRNA decreased linearly (P < 0.05) with age. The objective of the second study was to evaluate the effect of dietary protein quality on intestinal peptide, AA, and glucose transporter, and digestive enzyme mRNA abundance in Line A and B broilers. At day of hatch (doh), chicks from both lines were randomly assigned to corn-based diets containing 24% crude protein (CP) with either soybean meal (SBM) or corn gluten meal (CGM) as the supplemental protein source, ad libitum. Groups of chicks from both lines were also assigned to the SBM diet at a quantity restricted to that consumed by the CGM group (SBM-RT). Abundance of PepT1, EAAT3, and GLUT2 mRNA was greater in Line B (P < 0.03), while APN and SGLT1 were greater in Line A (P < 0.04). When feed intake was equal (CGM vs restricted SBM), a greater abundance of PepT1 and bo,+AT mRNA was associated with the higher quality SBM (P < 0.04), while a greater abundance of EAAT3 and GLUT2 mRNA was associated with the lower quality CGM (P < 0.01). When feed intake was restricted (SBM vs SBM-RT), a greater abundance of PepT1 mRNA was associated with the restricted intake (P < 0.04). The objective of the third study was to determine the effect of dietary protein composition on mRNA abundance of peptide and AA transporters, and a digestive enzyme. From day 8 to day 15 posthatch, Line A and B broilers were fed equal amounts of 1 of 3 diets (24% CP). Dietary protein sources included whey protein concentrate (whey), a partial whey hydrolysate (hydro), or a mixture of free amino acids (AA) similar to the composition of whey. Intestine was collected at days 8, 9, 11, 13, and 15. Expression of all genes except LAT1 was greater (P < 0.05) in Line B compared with A. Abundance of PepT1, EAAT3, y+LAT2, CAT1, bo,+AT, and APN mRNA varied little across diets in Line A but for CAT1 mRNA was greatest (P = 0.005) in Line A birds that consumed the AA diet. Expression of these genes was greatest (P < 0.006) in Line B birds consuming the hydro diet. A greater (P < 0.05) age response of bo,+AT, EAAT3, CAT1, and APN mRNA was observed in birds consuming the hydro or AA diets relative to the whey diet. Results from these studies collectively demonstrate that nutrient transporter gene expression is responsive to a variety of factors, including developmental stage, dietary manipulation, and genetic selection. Information from these studies can be used to improve dietary formulation so that nutrient utilization is enhanced, resulting in improved growth of the broiler.",
  "description_provenance": [
    "Author Email: egilbert@vt.edu",
    "Advisor Email: jjdibn@novusint.com",
    "Advisor Email: hojiang@vt.edu",
    "Advisor Email: amcelroy@vt.edu",
    "Advisor Email: webbk@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:41Z (GMT). No. of bitstreams: 1 DISSERTATION_ERG_FINAL3.pdf: 1527828 bytes, checksum: 8e83352bd6a0ca39ae89c6a10e9830d2 (MD5)   Previous issue date: 2008-08-12"
  ],
  "handle": "28795",
  "identifier_other": "etd-08252008-071136",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08252008-071136/",
  "identifier_uri": "http://hdl.handle.net/10919/28795",
  "publisher": "Virginia Tech",
  "relation_haspart": "DISSERTATION_ERG_FINAL3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "PepT1",
    "Key Words: Nutrient transporter",
    "Dietary protein",
    "Real time PCR",
    "Broiler",
    "Developmental regulation"
  ],
  "title": "Dietary and Developmental Regulation of Nutrient Transporter Gene Expression in the Small Intestine of Two Lines of Broilers",
  "type": "Dissertation"
}