{
  "contributor_author": "Zhang, Jinming",
  "contributor_committeechair": "Yoon, Roe-Hoan",
  "contributor_committeecochair": "Gandour, Richard D.",
  "contributor_committeemember": [
    "Adel, Gregory T.",
    "Luttrell, Gerald H.",
    "Novak, Thomas"
  ],
  "contributor_department": "Mining and Minerals Engineering",
  "date_accessioned": "2014-03-14T20:15:43Z",
  "date_adate": "2003-09-10",
  "date_available": "2014-03-14T20:15:43Z",
  "date_issued": "2003-07-30",
  "date_rdate": "2006-06-28",
  "date_sdate": "2003-08-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Steel producers use various organic and inorganic coatings to protect cold-rolled steel (CRS) sheets from corrosion during shipment and storage. It is well known that CRS sheets can be protected from corrosion by galvanizing, phosphating, chromating, topcoating with organic, or their combinations. The chromate rinsing is particularly effective for preventing white rusting of galvanized steel.  But there is an increasing interest in a replacement for the chromating process because of environmental and health concerns. The objective of the present work is to develop a chrome-free conversion coating for steel sheets. Various carboxylic acids and their salts have been studied for coating phosphated electrogalvanized (EG) steel sheets, including 10-undecenoic acid (UA), oleic acid (OA), and other fatty acids such as stearic acid (SA) and palmitic acid (PA). When they were used alone, or subsequently coated with resin, they could produce a highly hydrophobic surface and improve the corrosion resistance.  Thiols such as 1-octadecanethiol (ODT) can form a self-assembled monolayer on metal substrates. This close-packed monolayer could provide an excellent corrosion resistance for EG steel sheets. It was capable of withstanding 50~60 hours of salt spray test (SST) although its thickness was only a few nanometers. The EG steel itself usually started rusting only after 2~4 hours of salt spray.  In another coating system, thiols were mixed with a conventional resin to improve the corrosion resistance of EG steel. This new technique gave 100~120 hours of corrosion resistance. When the resin was applied directly on EG steel surface, its corrosion resistance was less than 72 hours. It was shown that further optimization of this technique increased the corrosion resistance to 200 hours and more in the standard SST.",
  "description_provenance": [
    "Author Email: jizhang2@vt.edu",
    "Advisor Email: ryoon@vt.edu",
    "Advisor Email: adel@vt.edu",
    "Advisor Email: luttrell@vt.edu",
    "Advisor Email: gandour@vt.edu",
    "Advisor Email: tomnovak@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:43Z (GMT). No. of bitstreams: 9 Chapter4.pdf: 1130707 bytes, checksum: 5947ab6ccc8949e95a07ece1fb04700b (MD5) Acknowledgments.pdf: 54786 bytes, checksum: 3def5f110a316a5737121912172e5e6f (MD5) Title-Abstract.pdf: 79559 bytes, checksum: 8c0107c19d7f550ce39b9ec5d8bf3370 (MD5) Chapter5.pdf: 92602 bytes, checksum: 96a7a952e1a19258a2b06e334ba3f222 (MD5) Chapter3.pdf: 1192573 bytes, checksum: 4b6c2a5371cfeae69521b97f092c3855 (MD5) Vita.pdf: 52072 bytes, checksum: 937964d80c70462d26b5005a6ae1bb01 (MD5) Chapter2.pdf: 623770 bytes, checksum: 440d17a59b7aae1d1c7b26a7b8fa763f (MD5) Chapter1.pdf: 931833 bytes, checksum: cf28a56a02c9c4ec0507f0e07b5a12c2 (MD5) Contents.pdf: 284502 bytes, checksum: e820caa68720d3031f9526a45c714715 (MD5)   Previous issue date: 2003-07-30"
  ],
  "handle": "28803",
  "identifier_other": "etd-08262003-164704",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08262003-164704/",
  "identifier_uri": "http://hdl.handle.net/10919/28803",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter4.pdf",
    "Acknowledgments.pdf",
    "Title-Abstract.pdf",
    "Chapter5.pdf",
    "Chapter3.pdf",
    "Vita.pdf",
    "Chapter2.pdf",
    "Chapter1.pdf",
    "Contents.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Salt Spray Test",
    "Carboxylic Acid",
    "Corrosion",
    "Self-Assembled Monolayer",
    "Resin",
    "Organic Coating",
    "Thiol",
    "Steel"
  ],
  "title": "Development of Environmentally Friendly Non-Chrome Conversion Coatings for Cold-Rolled Steel",
  "type": "Dissertation"
}