{
  "contributor_author": "Park, Soo-Young",
  "contributor_committeechair": "Rohr, John A.",
  "contributor_committeemember": [
    "Wamsley, Gary L.",
    "Hult, Karen M.",
    "Lane, Larry M.",
    "Wolf, James F."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:15:44Z",
  "date_adate": "2005-11-11",
  "date_available": "2014-03-14T20:15:44Z",
  "date_issued": "2005-08-22",
  "date_rdate": "2005-11-11",
  "date_sdate": "2005-08-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Who is the American bureaucracy's master in national government? At least three different sets of answers have been proposed.  The first answer claims a single master of American bureaucracy, be it the president, Congress, or the courts.  The second denies that there is any master over the bureaucracy and claims the existence of bureaucratic autonomy.  In the middle of the two theories, there lies multiple masters theory.   This dissertation attempts to advocate multiple masters theory by answering such questions as \"Is the conception of multiple masters only theoretically conceivable, or is it historically supported?\" or \"Does the historical record suggest that multiple masters scheme was seriously in play in actual American constitutional dialogue?\" \tTo be a master, one should have at least one of the following powers - budget, personnel, information, and regulatory review.  This dissertation focuses on one of them - the appointing power.  To look at it historically, this dissertation chose four distinct periods of American history.  They are the founding era, Jacksonian era, Republican era, and the Carter Administration.  These eras were related to the four important civil service reform acts: the two Tenure of Office Acts of 1820 and 1867, Pendleton Act of 1883, and the CSRA of 1978.  Congressional debates recorded in Congressional Record were analyzed to find evidences supporting multiple masters perspective.   \tThere were evidences that support the significant existence and role of the multiple masters perspective in all the four eras analyzed. Although weakened in the 1978 debate, the multiple masters theory was supported in important congressional debates by leading politicians of the day, providing historical foundation for the theory.   \tThe multiple masters perspective provides a need to construct a normative foundation for bureaucrats to adopt, because bureaucrats, in many cases, cannot avoid making decisions on which master to choose and which to ignore at a given time on a given issue.   Under the multiple masters scheme, bureaucrats may have to play the role of balance wheel in the constitutional order, using their statutory powers and professional expertise to favor whichever constitutional masters need their help to preserve the purpose of the Constitution itself.",
  "description_provenance": [
    "Author Email: refounding@vt.edu",
    "Advisor Email: jrohr@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Advisor Email: lmlane@tds.net",
    "Advisor Email: jfwolf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:44Z (GMT). No. of bitstreams: 1 dissertation_final_ETD.pdf: 596657 bytes, checksum: cd390d30ae54ea258f0ab0dbbeef7216 (MD5)   Previous issue date: 2005-08-22"
  ],
  "handle": "28804",
  "identifier_other": "etd-08262005-220709",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08262005-220709/",
  "identifier_uri": "http://hdl.handle.net/10919/28804",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation_final_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "civil service reform",
    "bureaucratic autonomy",
    "multiple masters",
    "Civil Service Reform Act",
    "Tenure of Office Act",
    "Pendleton Act"
  ],
  "title": "Who Is Our Master? -Debates during Civil Service Reforms-",
  "type": "Dissertation"
}