{
  "contributor_author": "Kendra, Angelina",
  "contributor_committeechair": "Hull, Robert Bruce IV",
  "contributor_committeemember": [
    "Parkhurst, James A.",
    "Buhyoff, Gregory J.",
    "Hall, Troy E.",
    "McMullin, Steve L."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:15:43Z",
  "date_adate": "2003-09-03",
  "date_available": "2014-03-14T20:15:43Z",
  "date_issued": "2003-07-30",
  "date_rdate": "2004-09-03",
  "date_sdate": "2003-08-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Article 1  As forest ownership continues to change, forestry must change to be relevant to its new constituency and client base. Market segmentation can help in this task. There is no such thing as an average forest owner. This study assessed the motivations and forest practices of 661 new owners of forested lands ranging in size between 2 and 50 acres. The study focused on rapidly growing counties in Virginia. Cluster analysis techniques were used to identify six market segments: Absentee Investors, Young Families, Forest Planners, Preservationists, Farmers, And Professionals. Only the smallest market segment (Absentee Investors, n = 26) reflects motivations and forest management interests that somewhat resemble \"traditional\" forest landowners. The results suggest that \"lifestyle\" concerns are the major motivations of these new owners and seemingly determine receptivity to professional forestry advice. This analysis helps understand these differently motivated segments and suggests possible marketing strategies professional foresters can use to \"sell\" forestry and active forest management.  Article 2  Land managers increasingly are seeking to promote management of private forestland that transcends political and ownership boundaries. Descriptive analyses were used to characterize new landowners' intentions to participate in active management, both within individual property boundaries and in cooperation with neighboring landowners. The study also describes obstacles that these new owners perceive constrain their participation in active management. Further analysis explores potential differences in these variables related to amount of land owned, attitudes about private property rights, trust in forestry professionals, and attitudes about clearcutting and harvesting practices. The results suggest that private property rights are not an insurmountable problem to ecosystem management efforts. The forestry profession, however, seems to suffer from an invisibility problem among the population of new landowners. The very audience that ecosystem management programs target (owners of fewer than 20 acres of forestland) perceives itself to be least relevant to the message of cooperation. In fact, the biggest obstacle identified was that these new landowners have never thought about participating in active management, either within or across property boundaries.",
  "description_provenance": [
    "Author Email: a_kendra@yahoo.com",
    "Advisor Email: hullrb@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:43Z (GMT). No. of bitstreams: 1 KendraETD2.pdf: 781920 bytes, checksum: cb480954b67ad3839eea419753e9e7ca (MD5)   Previous issue date: 2003-07-30"
  ],
  "handle": "28802",
  "identifier_other": "etd-08262003-120653",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08262003-120653/",
  "identifier_uri": "http://hdl.handle.net/10919/28802",
  "publisher": "Virginia Tech",
  "relation_haspart": "KendraETD2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "market segmentation",
    "nonindustrial private forest",
    "ecosystem management",
    "cluster analysis",
    "NIPF",
    "cooperative management"
  ],
  "title": "New Landowners in Virginia's Forest: A Study of Motivations, Management Activities, and Perceived Obstacles",
  "type": "Dissertation"
}