{
  "contributor_author": "Sutton, Daniel Joseph",
  "contributor_committeechair": "Ball, Joseph A.",
  "contributor_committeemember": [
    "Sun, Shu-Ming",
    "Klaus, Martin",
    "Johnson, Martin E."
  ],
  "contributor_department": "Mathematics",
  "date_accessioned": "2014-03-14T20:15:44Z",
  "date_adate": "2010-09-15",
  "date_available": "2014-03-14T20:15:44Z",
  "date_issued": "2010-08-12",
  "date_rdate": "2010-09-15",
  "date_sdate": "2010-08-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is primarily concerned with studying the invariant subspaces of left-invertible, weighted shifts, with generalizations to left-invertible operators where applicable. The two main problems that are researched can be stated together as When does a weighted shift have the one-dimensional wandering subspace property for all of its closed, invariant subspaces? This can fail either by having a subspace that is not generated by its wandering subspace, or by having a subspace with an index greater than one. For the former we show that every left-invertible, weighted shift is similar to another weighted shift with a residual space, with respect to being generated by the wandering subspace, of dimension $n$, where $n$ is any finite number. For the latter we derive necessary and sufficient conditions for a pure, left-invertible operator with an index of one to have a closed, invariant subspace with an index greater than one. We use these conditions to show that if a closed, invariant subspace for an operator in a class of weighted shifts has a vector in $l^1$, then it must have an index equal to one, and to produce closed, invariant subspaces with an index of two for operators in another class of weighted shifts.",
  "description_provenance": [
    "Author Email: dasutto1@vt.edu",
    "Advisor Email: sun@math.vt.edu",
    "Advisor Email: mklaus@math.vt.edu",
    "Advisor Email: daymv@math.vt.edu",
    "Advisor Email: joball@math.vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:44Z (GMT). No. of bitstreams: 1 Sutton_DJ_D_2010.pdf: 424155 bytes, checksum: 0f44b14c9f0a4fd8c58b33b1de1192f5 (MD5)   Previous issue date: 2010-08-12"
  ],
  "handle": "28807",
  "identifier_other": "etd-08262010-161822",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08262010-161822/",
  "identifier_uri": "http://hdl.handle.net/10919/28807",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sutton_DJ_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Index",
    "Wandering Subspace",
    "Invariant Subspace",
    "Weighted Shift",
    "Left-Invertible"
  ],
  "title": "Structure of Invariant Subspaces for Left-Invertible Operators on Hilbert Space",
  "type": "Dissertation"
}