{
  "contributor_author": "Peterson, Brennan Daniel",
  "contributor_committeechair": "Rosen, Karen H.",
  "contributor_committeemember": [
    "Johnson, Scott W.",
    "Protinsky, Howard O. Jr.",
    "McCollum, Eric E.",
    "Skaggs, Gary E."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:15:44Z",
  "date_adate": "2002-08-30",
  "date_available": "2014-03-14T20:15:44Z",
  "date_issued": "2002-08-21",
  "date_rdate": "2003-08-30",
  "date_sdate": "2002-08-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study explored the individual and dyadic coping processes of men and women in infertile couples and their relationship to infertility stress, marital adjustment, and depression.  Study participants were comprised of 1,026 men and women (420 of which were couples) who were referred to a university-affiliated teaching hospital for advanced reproductive treatments between the years of 1991 and 2001.  Three months prior to treatment, participants completed the Ways of Coping Questionnaire (WCQ), the Fertility Problem Inventory (FPI), the Dyadic Adjustment Scale (DAS), and the Beck Depression Inventory (BDI).  Findings from the study showed that escape avoidance, accepting responsibility, and self controlling were strongly related to increased stress, depression, and decreased marital adjustment for both men and women; while seeking social support was related to increased marital adjustment.  Multivariate analyses of variance and covariance consistently showed that participants in four groups of couples who used high and low amounts of coping differed in their reports of infertility stress, marital adjustment, and depression.  In addition, gender differences were found, with females consistently reporting greater levels of stress and depression than males.  Several significant couple pairings among the four groups were found.  Clinical implications linking study findings with marital and family therapies and ideas for future research are discussed.",
  "description_provenance": [
    "Author Email: brpeters@vt.edu",
    "Advisor Email: swj@vt.edu",
    "Advisor Email: krosen@vt.edu",
    "Advisor Email: e.mccollum@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:44Z (GMT). No. of bitstreams: 2 TitleAbstractTableofContents.pdf: 184804 bytes, checksum: fa61bee906686a72b47aef74daf38274 (MD5) FinalManuscript.pdf: 2774014 bytes, checksum: a96934f867f3cf9e45ac53eab8d97796 (MD5)   Previous issue date: 2002-08-21"
  ],
  "handle": "28809",
  "identifier_other": "etd-08272002-151120",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08272002-151120/",
  "identifier_uri": "http://hdl.handle.net/10919/28809",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "TitleAbstractTableofContents.pdf",
    "FinalManuscript.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "marital adjustment",
    "coping",
    "infertility stress",
    "depression"
  ],
  "title": "Examining the Individual and Dyadic Coping Processes of Men and Women in Infertile Couples and Their Relationship to Infertility Stress, Marital Adjustment, and Depression",
  "type": "Dissertation"
}