{
  "contributor_author": "Verghese, Kandathil Eapen",
  "contributor_committeechair": "Lesko, John J.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Riffle, Judy S.",
    "Ward, Thomas C.",
    "Reifsnider, Kenneth L."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:15:46Z",
  "date_adate": "1999-08-27",
  "date_available": "2014-03-14T20:15:46Z",
  "date_issued": "1999-08-18",
  "date_rdate": "1999-08-27",
  "date_sdate": "1999-08-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT  As fiber reinforced polymer matrix composites find greater use in markets such as civil infrastructure and ground transportation, the expectations placed on these materials are ever increasing.  The overall cost and reliability have become the drivers of these high performance materials and have led to the disappearance of resins such as bismaleimides (BMI), cyanate esters and other high performance polyimides and epoxys.  In their place polymers, such polyester and vinylester have arisen.  The reinforcing fiber scenario has also undergone changes from the high quality and performance assured IM7 and AS4 to cheaper and hybrid systems consisting of both glass and low cost carbon.  Manufacturing processes have had their share of changes too with processes such as pultrusion and other mass production techniques replacing hand lay-up and resin transfer molding.  All of this has however come with little or no concession on material performance. The motivation of the present research has therefore been to try to improve the properties of these low cost composites by better understanding the constituent materials (fiber and matrix) and the region that lies in-between them namely the interphase. In order to achieve this, working with controls is necessary and the present discourse therefore deals with the AS4 fiber system from Hexcel Corporation and the vinyl ester resin, Derakane 441-400 from The Dow Chemical Company.  The following eight chapters sum up the work done thus far on composites made with sized fibers and the above mentioned resin and fiber systems.  They are in the form of publications that have either been accepted, submitted or going to be submitted to various peer reviewed journals.  The sizings used have been poly(vinylpyrrolidone) PVP and Polyhydroxyether (Phenoxy) thermoplastic polymers and G' an industrial sizing material supplied by Hexcel.  A number of issues have been addressed ranging from viscoelastic relaxation to enviro-mechanical durability.   Chapter 1 deals with the influence of the sizing material on the fatigue response of cross ply composites made with the help of resin infusion molding.  Chapter 2 describes the effects of a controlled set of interphase polymers that have the same chemical structure but differ from each other in polarity.  The importance of the atomic force microscope (AFM) to view and perform nano-indentations on the interphase regions has been demonstrated.  Finally, it attempts to tie everything together with the help of the fatigue response of the different composites.  Chapter 3 deals only with the vinyl ester resin and examines the influence of network structure on the molecular relaxation behavior (cooperativity) of the glassy polymer.  It also tries to make connections between structural features of the glass and fracture toughness as measured in its glassy state.  Chapter 4 extends the results obtained in chapter 3 to examine the cooperativity of pultruded composites made with the different sizings.  A correlation between strength and cooperativity is found to exist, with systems having greater cooperativity being stronger.  Chapter 5 moves into the area of hygrothermal aging of Derakane 441-400 resin.  It looks specifically at identifying a mechanism for the unusual moisture uptake behavior of the polymer subjected to a thermal-spiking environment.  This it does by identifying the presence of hydrogen bonding in the resin.  Finally, chapters 6 to 8 present experimental and analytical results obtained on PVP K90, Phenoxy and G' sized, AS4/Derakane 411-350 LI vinyl ester composites that were pultruded at Strongwell Inc., on their lab-scale pultruder in Bristol, Virginia.",
  "description_provenance": [
    "Author Email: kev@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: tward@chemserver.chem.vt.edu",
    "Advisor Email: mrl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:46Z (GMT). No. of bitstreams: 13 chapter8.pdf: 1865616 bytes, checksum: 51dfc5cb7b7502975ab3a04dc2d1e1fc (MD5) Chapter5.pdf: 259528 bytes, checksum: 4749f0e6a62a2fbb334229f570f2ef6a (MD5) Chapter2.pdf: 864138 bytes, checksum: abe55f6b3e343833159942463688732f (MD5) Chapter1.pdf: 690293 bytes, checksum: 3924416da7ef72d264a88f5877fa82af (MD5) chapter6.pdf: 6230116 bytes, checksum: dfccf9347061c39df4897e447decdc01 (MD5) chapter7.pdf: 154585 bytes, checksum: 456a3449893c943350029c6ddeb4dc40 (MD5) Chapter3.pdf: 131357 bytes, checksum: fb00b98b56c32ac9f9bedc329f69f9d0 (MD5) coverpage.pdf: 2575 bytes, checksum: 542345a2b58ba6fe25024135bb774c0b (MD5) Vita.pdf: 4327 bytes, checksum: 04cbff706b09166f9bc3d12b1c19494e (MD5) references.pdf: 36237 bytes, checksum: bc97164cc12c22040b7c152fb762701f (MD5) chapter4.pdf: 125225 bytes, checksum: 3b795daf27aad66968f48da3409e00d7 (MD5) Chapter9.pdf: 11831 bytes, checksum: 065435ffe2857c7c7c0ada44a62e18ad (MD5) FRONT.PDF: 49902 bytes, checksum: 07224dad576a0b1618e1c08ee55282b0 (MD5)   Previous issue date: 1999-08-18"
  ],
  "handle": "28817",
  "identifier_other": "etd-082799-151752",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-082799-151752/",
  "identifier_uri": "http://hdl.handle.net/10919/28817",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chapter8.pdf",
    "Chapter5.pdf",
    "Chapter2.pdf",
    "Chapter1.pdf",
    "chapter6.pdf",
    "chapter7.pdf",
    "Chapter3.pdf",
    "coverpage.pdf",
    "Vita.pdf",
    "references.pdf",
    "chapter4.pdf",
    "Chapter9.pdf",
    "FRONT.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Fatigue",
    "Vinylester",
    "Viscoelastic Cooperativity",
    "Environmental Durability",
    "Composites",
    "Interphase"
  ],
  "title": "Durability of Polymer Matrix Composites for Infrastructure: The Role of the Interphase",
  "type": "Dissertation"
}