{
  "contributor_author": "Seleem, Mohamed N.",
  "contributor_committeechair": "Sriranganathan, Nammalwar",
  "contributor_committeemember": [
    "Witonsky, Sharon G.",
    "Mukhopadhyay, Biswarup",
    "Schurig, Gerhardt G.",
    "Boyle, Stephen M."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:15:46Z",
  "date_adate": "2006-11-01",
  "date_available": "2014-03-14T20:15:46Z",
  "date_issued": "2006-08-23",
  "date_rdate": "2008-11-01",
  "date_sdate": "2006-08-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The species of Brucella were isolated and characterized almost 120 years ago and their genomes sequenced for almost 4 years. Compared to other bacterial pathogens relatively, little is known about the factors contributing to their persistence in hosts and multiplication within phagocytic cells. Also, many aspects of the interactions between Brucella and its host remain unclear. Molecular characterization of intracellular survival processes of Brucella will provide guidance for additional prevention and control measures. One of the features that distinguishes Brucella is that they do not express classic virulence factors. Thus identification of virulence factors has been elusive and some of the identified virulence genes are putative. Disruption of putative virulence genes and studying the consequent effect on attenuation in cell lines or mouse models is a widely used method. However, in most cases it is not apparent whether the mutated genes encode virulence factors or merely affect normal metabolic or biological functions. Some mutations in Brucella can be compensated by redundancy or backup mechanisms. One method for identifying putative virulence genes involved in pathogenesis is to express these genes in a nonpathogenic host and isolate recombinants with increased virulence or survival ability either in cell culture or animal model. We hypothesize that over-expression of Brucella putative virulence genes in the non-pathogenic and close phylogenic relative Ochrobactrum anthropi should enhance its survival in infection models in vivo.            O. anthropi is one of the closest Brucella relatives based on DNA, rRNA, and protein analyses but it is unable to establish chronic infection and considered as opportunistic pathogen that, under certain circumstances, may produce disease in immunocompromised humans. Therefore, we established enhanced expression system in Brucella and Ochrobactrum to identify B. suis virulence genes. We created an enhanced expression system that can be used for cloning and expression of heterologous genes in Brucella and Ochrobactrum. We studied the transcriptional activity of several promoters and created some tools to enhance the expression, detection and purification of Brucella recombinant protein in Ochrobactrum.   The presumable importance of alkyl hydroperoxide reductases encoded by ahpC and ahpD genes and their contribution to intracellular survival of Brucella were studied by over-expressing them. The recombinant O. anthropi expressing B. suis ahpC and ahpD genes were able to resist in vitro killing by H2O2 and or cumene hydroperoxide and survived longer in the macrophage J774 A.1 cell line. The control O. anthropi was cleared from BALB/c mice in five days while the recombinants were recovered from spleens, livers and lungs of infected mice up to eight days post-infection. We tested the contribution of B. suis cyclic glucan synthetase gene (cgs) to virulence by over-expressing it in O. anthropi. We studied the ability of the recombinant O. anthropi to resist killing in vitro and in vivo. We generated evidence that B. suis cgs when over-expressed in O. anthropi increased the amount of cyclic glucans synthesized and accumulated in the periplasmic space. This accumulation changed the virulence of the microorganism from a soil bacterium that cleared from mice in less than five days into a pathogenic organism that could survive up to 9 days and at higher doses killed the mice. In summary, several vectors have been constructed for gene expression and protein purification in Brucella and Ochrobactrum. Novel useful tools for enhancement of heterologous gene expression were created and demonstrated to work in Brucella and Ochrobactrum. Brucella putative virulence genes were studied in Ochrobactrum using the newly constructed vectors and tools. Ochrobactrum as a gain of function model for studying putative virulence genes of intracellular pathogens in general and for Brucella in particular proved to be a very useful model.",
  "description_provenance": [
    "Author Email: naguieb@vt.edu",
    "Advisor Email: nathans@vt.edu",
    "Advisor Email: switonsky@vt.edu",
    "Advisor Email: bmukhopa@vt.edu",
    "Advisor Email: gschurig@vt.edu",
    "Advisor Email: smboyle@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:46Z (GMT). No. of bitstreams: 2 Chapter2.pdf: 3084072 bytes, checksum: 7379d6e6968c0e5fe8e7f5c53c74bdce (MD5) Chapter1.pdf: 1688066 bytes, checksum: edfd755f7298e0c580a7598083b8a8ad (MD5)   Previous issue date: 2006-08-23"
  ],
  "handle": "28818",
  "identifier_other": "etd-08282006-174114",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08282006-174114/",
  "identifier_uri": "http://hdl.handle.net/10919/28818",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter2.pdf",
    "Chapter1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "virulence genes",
    "cyclic glucan synthase",
    "expression vectors",
    "ahpC",
    "UP element",
    "RNA stem loop",
    "Ochrobactrum anthropi",
    "Brucella suis"
  ],
  "title": "Ochrobactrum anthropi: a soil bacterium for the study of Brucella virulence",
  "type": "Dissertation"
}