{
  "contributor_author": "Moore, David M.",
  "contributor_committeechair": "Keller, James F.",
  "contributor_committeemember": [
    "Fu, Victoria R.",
    "Maxwell, Joseph W.",
    "Lichtman, Marilyn V.",
    "Stith, Sandra M."
  ],
  "contributor_department": "Family and Child Development",
  "date_accessioned": "2014-03-14T20:15:45Z",
  "date_adate": "2007-08-27",
  "date_available": "2014-03-14T20:15:45Z",
  "date_issued": "1995-11-01",
  "date_rdate": "2012-10-02",
  "date_sdate": "2007-08-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A series of interpretive dialogues with one object relations, couple therapy, case study were performed to research the role of projective and introjective identification within an intersubjective context. The method, Gadatner's (1993) philosophical hermeneutics, involved a dialectical moving back and forth between the more intrapsychic standpoint of the case study and the intersubjective perspectives of philosophical hermeneutics and recent object relations thinking (Ogden, 1994). These interpretive dialogues became written mediations yielding increasingly coherent and in depth understandings of projective and introjective identification. <p> The mediations delineated three turning points in the case study. In each, projective and introjective identification was critical to understanding the marriage's conflict and possible repair. Further interpretation of these turning points yielded an understanding of projective and introjective identification as a part of what Klein (Ogden, 1989, 1994) and Fairbairn (1952) have called the paranoid-schizoid position, as opposed to the higher functioning depressive position. Ogden's (1994) contention that these positions are in dialectical relationship, and not developmentally exclusive, avoided the objections (Kemberg, 1974) (Meissner, 1974) that projective and introjective identification is a psychotic defense mechanism. While most couples are in the depressive position, the mediations revealed that under stress, couples regress to the paranoid-schizoid position, where projective and introjective identifications render the relationship chaotic but also repairable through the re-enactment of old conflicts. Projective and introjective identification also was central to the process of transference and countertransference by which the therapist gained understanding of the couple and enabled then1 to work toward repair. <p> Projective and introjective identification was understood as an intersubjective process that occurred between persons, as opposed to some form of mind invasion. This intersubjective perspective enabled the research understandings to be highly interpersonal without denying the richness of the intrapsychic world. <p> As a research method, philosophical hermeneutics proved, as anticipated, unwieldy, circular and highly dependent on the researcher's interpretive abilities. Ho\\vever, this method was highly commensurate with the subject matter at a depth inconceivable in a quantitative analysis. This post-modem method valued the relationship between subjects over objectivity in a way that was congruent with therapy relationships and helpful in understanding them.",
  "description_provenance": [
    "Author Email: dmmoore712@GMAIL.COM",
    "Made available in DSpace on 2014-03-14T20:15:45Z (GMT). No. of bitstreams: 1 LD5655.V856_1995.M665.pdf: 8681621 bytes, checksum: 31927576fbf88d410f3729c90a9ce09d (MD5)   Previous issue date: 1995-11-01"
  ],
  "format_medium": "BTD",
  "handle": "28811",
  "identifier_other": "etd-08272007-163941",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08272007-163941/",
  "identifier_uri": "http://hdl.handle.net/10919/28811",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1995.M665.pdf",
  "subject": [
    "Couples Therapy",
    "Marital Therapy"
  ],
  "subject_lcc": "LD5655.V856 1995.M665",
  "title": "Projective and introjective identification in a couple therapy case study :a hermeneutical examination",
  "type": "Dissertation"
}