{
  "contributor_author": "Lightbourn, Gordon James",
  "contributor_committeechair": "Veilleux, Richard E.",
  "contributor_committeemember": [
    "Welbaum, Gregory E.",
    "Nowak, Jerzy",
    "Maroof, M. A. Saghai",
    "Winkel, Brenda S. J."
  ],
  "contributor_department": "Horticulture",
  "date_accessioned": "2014-03-14T20:15:44Z",
  "date_adate": "2004-09-13",
  "date_available": "2014-03-14T20:15:44Z",
  "date_issued": "2004-08-12",
  "date_rdate": "2005-09-13",
  "date_sdate": "2004-08-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Inbred lines for hybrid crop production have been a mainstay of plant breeding. Biotechnological approaches to hasten the process are available including anther culture to halve the genome and protoplast fusion to create hybrids between incompatible partners. We applied these techniques to potato to evaluate their potential for breeding highly heterozygous, cross-pollinating species. Four families of monoploids (2n=1x=12), developed from diploid hybrids with diverse genomic constitutions but heavily favoring Solanum phureja, a primitive cultivated potato, were used in electrofusion experiments to create intermonoploid somatic hybrids (SH). The \"monoploid sieve\" results in the survival of only those gametes free of lethal and deleterious genes but generates sterile sporophytes, necessitating protoplast fusion for SH development.  From six intermonoploid electrofusion combinations, 276 plants were regenerated over 6-9 months.  Fusion conditions were optimized.  Ploidy was determined by flow-cytometry and SH confirmed by microsatellite analysis.  Field evaluations over three years revealed that intermonoploid SH were inferior to cultivars.  Dihaploids derived by anther culture of a tetraploid intermonoploid SH were reduced in vigor with an increase in homozygosity, while 2x X 2x sexually derived populations had better yield than the SH, suggesting that producing SH introduced or eliminated factors required for productivity.  Molecular analysis of the SH was conducted to examine genomic stability through protoplast isolation and plant regeneration.  Sequence specific amplified polymorphism (S-SAP) represents a hybrid system incorporating amplified fragment length polymorphism (AFLP) technology in conjunction with the use of a defined genomic sequence, e.g., retrotransposon display (RD) when the defined sequence is anchored into a consensus sequence of a retrotransposon such as the long terminal repeat (LTR) sequence of Tst1.  Parental monoploids, SH and various Solanaceae were evaluated by RD.  Fluorescently-labeled retrotransposon-based primers were used in the ALFexpress automated fragment analyzer system.  Eleven probes from RD were created for Southern blot analysis and used to verify taxonomic relationships between selected Solanaceae.  Blots of intermonoploid somatic hybrids confirmed hybridity and occasional loss of genomic fragments.  No activation or replication of retrotransposons was detected.  Sequencing of inter-retrotransposon amplified polymorphism (IRAP) and S-SAP fragments revealed that all fragments had the expected Tst1 retroelement and/or the AFLP adaptor sequence.  BLAST analysis identified 4 of the 17 fragments sequenced as part of the chloroplast genome, a tobacco anther-specific gene, repetitive DNA, and the phytochrome F gene.",
  "description_provenance": [
    "Author Email: glightbo@vt.edu",
    "Advisor Email: welbaum@vt.edu",
    "Advisor Email: jenowak@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: winkel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:44Z (GMT). No. of bitstreams: 1 LightbournThesis.pdf: 7736814 bytes, checksum: 6c287f24676abf9e143f3b07df43397b (MD5)   Previous issue date: 2004-08-12"
  ],
  "handle": "28810",
  "identifier_other": "etd-08272004-164824",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08272004-164824/",
  "identifier_uri": "http://hdl.handle.net/10919/28810",
  "publisher": "Virginia Tech",
  "relation_haspart": "LightbournThesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "retrotransposon",
    "S-SAP",
    "AFLP",
    "IRAP",
    "Solanum phureja",
    "Solanum tuberosum",
    "monoploid",
    "protoplast fusion"
  ],
  "title": "Development of intermonoploid somatic hybrids of potato and their molecular analysis based on polymorphism for retroelement Tst1",
  "type": "Dissertation"
}