{
  "contributor_author": "Airen, Osaro Ehigiato",
  "contributor_committeecochair": [
    "Burge, Penny L.",
    "Bodenhorn, Nancy E."
  ],
  "contributor_committeemember": [
    "Day-Vines, Norma L.",
    "Amenkhienan, Charlotte A."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:15:45Z",
  "date_adate": "2009-09-22",
  "date_available": "2014-03-14T20:15:45Z",
  "date_issued": "2009-08-26",
  "date_rdate": "2012-04-24",
  "date_sdate": "2009-08-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "There has been a considerable amount of research focused on the multicultural counseling competence (MCC) of counselors, but research examining the MCC of school counselors looking at school counselorsâ   awareness of the national achievement gap has been quite sparse. The current study was conducted to fill this gap. One hundred and sixty five American School Counselor Association (ASCA) members participated in the current study. The study was a web survey where each participant was contacted through email and invited to participate by Survey Monkey, an on-line survey tool. Survey Monkey was used to post the survey and demographic questionnaire and collect the data. The Multicultural Counseling Competence and Training Survey-Revised (MCCTS-R) (Holcomb-McCoy & Day-Vines, 2004) was used to examine the perceived MCC of school counselors. A Demographic Questionnaire was also added consisting of questions regarding variables such as race/ethnicity, gender, school level, and school urbanicity and questions that examined school counselorsâ   awareness of the national achievement gap. The results of the current study suggested that school counselors possessed a self-perceived MCC between somewhat competent and competent. The results also suggested that school counselors who had taken a Masterâ  s level or specialty course on multicultural counseling possessed a higher MCC than those who had not, school counselors of Color were found to possess a higher MCC than their White counterparts, and gender was found to have no significant relationship with MCC.  In addition, the results suggested that school counselors were aware of the national achievement gap, believed in the importance of being aware of the national achievement gap, were committed to activities aimed at closing the achievement gap, and believed that it was the duty of school counselors to participate in activities aimed at closing the gap. Finally, using the Marlowe-Crowne Social Desirability Scale (M-C SDS), the results suggested that social desirability may have played a small role in the results of the MCCTS-R.",
  "description_provenance": [
    "Author Email: oairen@vt.edu",
    "Advisor Email: ndayvine@vt.edu",
    "Advisor Email: camen@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:45Z (GMT). No. of bitstreams: 1 Airen_OE_D_2009.pdf: 848109 bytes, checksum: dd14451453427dd72a40fd9d6b7c2296 (MD5)   Previous issue date: 2009-08-26"
  ],
  "handle": "28815",
  "identifier_other": "etd-08272009-174832",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08272009-174832/",
  "identifier_uri": "http://hdl.handle.net/10919/28815",
  "publisher": "Virginia Tech",
  "relation_haspart": "Airen_OE_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "School Counselors",
    "Multicultural Counseling",
    "Achievement Gap",
    "Race",
    "Ethnicity"
  ],
  "title": "School Counselors and Their Multicultural Counseling Competence and Awareness of the National Achievement Gap: A National Study",
  "type": "Dissertation"
}