{
  "contributor_author": "Byrd, Devin Alfred",
  "contributor_committeechair": "Ollendick, Thomas H.",
  "contributor_committeemember": [
    "Scott, Delores W.",
    "Cooper, Robin K. Panneton",
    "Finney, Jack W.",
    "Jones, Russell T."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:15:48Z",
  "date_adate": "2000-09-14",
  "date_available": "2014-03-14T20:15:48Z",
  "date_issued": "2000-05-11",
  "date_rdate": "2001-09-14",
  "date_sdate": "2000-08-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The primary focus of the present study was to delineate the relationships among variables comprising a proposed model of depression for middle school adolescents.  The investigation of the validity of a newly proposed dimension of self-concept (i.e., ethnic evaluations) for African-American versus Caucasian adolescents was also a major thrust.  An additional emphasis of the present study was to examine which variables (i.e., contextual, self-concept, and global self-worth) accounted for the greatest amount of variance in predicting depression scores for African-American and Caucasian participants.   Approximately 1,100 adolescents were recruited for participation.  Of these, 959 participants actually participated in the study with the final sample consisting of 792 participants (males n = 389, females n = 403).  Participants ranged in age from 11 = 14 years of age and were in 6th, 7th, and 8th grades.  The ethnic make-up of participants was as follows: Native American (1%), Asian (1%), African-American (32%), Caucasian (60%), Hispanic (1%), Pacific Islander (>1%), Biracial (3%), Multiracial (1%), and other (>1%) participants.  All questionnaire sessions were conducted in a group format during a pre-selected class period (i.e., Health, English, or Science classes).  Participants were administered a demographic information form, the Reynold's Adolescent Depression Scale (RADS), the Multidimensional Anxiety Scale for Children (MASC), the Harter Self-Perception Profile for Adolescents (SPPA), an Ethnic Evaluations instrument, the Acculturation Scale, the Dubow Social Support Scale for Adolescents, the How I Coped Under Pressure Scale for Children (HICUPS), and the Life events scale.  Results revealed that self-concept and global self-worth were significantly and inversely correlated with depression scores.  In addition, a newly created measure of ethnic evaluations proved to be a concurrently valid measure of self-concept for all participants and demonstrated differing rates of significance with depression for Caucasian and African-American participants.  An examination of the proposed model for African-American adolescents revealed that social support, negative life events, physical appearance, athletic competence, and inter-ethnic evaluations were most significant in predicting depression.  Results of the regression analysis for Caucasian adolescents revealed social support, negative life events, social acceptance, athletic competence, physical appearance, and global self-worth as accounting for the greatest amount of variance.",
  "description_provenance": [
    "Author Email: devinb@aiken.sc.edu",
    "Advisor Email: tho@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:48Z (GMT). No. of bitstreams: 1 Df.pdf: 337310 bytes, checksum: ed020c8c76ee082d75407b27e8f0f3b9 (MD5)   Previous issue date: 2000-05-11"
  ],
  "handle": "28828",
  "identifier_other": "etd-08302000-23210028",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08302000-23210028/",
  "identifier_uri": "http://hdl.handle.net/10919/28828",
  "publisher": "Virginia Tech",
  "relation_haspart": "Df.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Adolescents",
    "Self-concept",
    "Global Self-Worth",
    "Ethnicity",
    "Depression"
  ],
  "title": "Self-concept in Adolescents: The Role of Ethnicity and Contextual Variables in the Manifestation of Depression",
  "type": "Dissertation"
}