{
  "contributor_author": "Lenth, Christopher Allen",
  "contributor_committeechair": "Kamke, Frederick A.",
  "contributor_committeemember": [
    "Watson, Layne T.",
    "Loferski, Joseph R.",
    "Dillard, David A.",
    "Zink-Sharp, Audrey G.",
    "Frazier, Charles E."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:15:48Z",
  "date_adate": "2000-09-06",
  "date_available": "2014-03-14T20:15:48Z",
  "date_issued": "1999-05-11",
  "date_rdate": "2001-09-06",
  "date_sdate": "2000-08-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An improved knowledge of wood material behavior in hot-pressing environments can provide the benefit of an increased understanding of material properties during the manufacture of wood-based composites as well as insight into the development of new processes and products which manipulate the viscoelastic nature of wood.  Two specific areas where additional knowledge is needed are: the high temperature equilibrium moisture content (EMC) behavior and the moisture dependent softening behavior.   EMC data was collected and desorption isotherms were generated for mature and juvenile wood of aspen, loblolly pine and yellow-poplar at 50 and 160°C.  High temperature EMC behavior was found to be distinct from that at lower temperatures, and considerable differences between the isotherms for juvenile and mature wood were detected.  Substantial thermal degradation was observed during desorption at 160 °C and found to be strongly influenced by relative humidity.  The thermal softening behavior of wood was evaluated using dielectric thermal analysis (DETA) at moisture levels from 0 to 20 percent.  Coincident in situ relaxations of hemicellulose and amorphous cellulose in the range of 20 to 200 °C were observed and found to exhibit the characteristics of a secondary (glass) transition.  The moisture dependence of this transition was characterized, and differences in the observed Tg were detected between juvenile and mature wood.  Time-temperature superposition was also shown to be applicable to the wood-water system.",
  "description_provenance": [
    "Author Email: chris.lenth@forestresearch.co.nz",
    "Advisor Email: kamkefa@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:48Z (GMT). No. of bitstreams: 1 cal.pdf: 687909 bytes, checksum: 7028fae2c0b9ccd932bfbcf72882aa95 (MD5)   Previous issue date: 1999-05-11"
  ],
  "handle": "28826",
  "identifier_other": "etd-08302000-12360026",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08302000-12360026/",
  "identifier_uri": "http://hdl.handle.net/10919/28826",
  "publisher": "Virginia Tech",
  "relation_haspart": "cal.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "high temperature",
    "equilibrium moisture content",
    "viscoelasticity",
    "thermal softening"
  ],
  "title": "Wood Material Behavior in Severe Environments",
  "type": "Dissertation"
}