{
  "contributor_author": "Eristi, Can M.",
  "contributor_committeechair": "Rutherford, Charles L.",
  "contributor_committeemember": [
    "Winkel, Brenda S. J.",
    "Popham, David L.",
    "Grabau, Elizabeth A.",
    "Esen, Asim"
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:15:47Z",
  "date_adate": "2003-09-10",
  "date_available": "2014-03-14T20:15:47Z",
  "date_issued": "2003-07-22",
  "date_rdate": "2004-09-10",
  "date_sdate": "2003-08-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A 5' AMP-degrading activity appears during the course of development in Dictyostelium discoideum between the prestalk and prespore zones.  This enzyme is referred as 5'-Nucleotidase (5NT).  Given the critical role of cyclic AMP in cell differentiation in this organism, 5NT is thought to be involved in cell positioning during development.  Southern blot analysis showed a single form of the gene.  The expression of the 5nt gene is known to be developmentally regulated.  The message appears first at about 5 hr of the Dictyostelium development and remains constant throughout the rest of the development.  Primer extension indicated two potential transcriptional start sites (118 bp and 148 bp upstream of the ATG initiation codon) for the 5nt expression.  The 5nt promoter region was cloned and analyzed to investigate the expression of 5nt.  Analysis of the cloned 5nt promoter fused to lacZ enabled the localization of the 5nt expression in pstAB cells during development.  To identify cis-acting regulatory sequences, a series of 5' and internal promoter deletions were generated and fused to a luciferase reporter gene.  The reporter activity driven by the 1,212 bp promoter started at the early aggregation stage, in agreement with temporal expression of the 5nt gene.  Also, the expression was induced by exogenous cAMP.  The reporter activity was high and relatively equivalent for all deletion constructs that contained 547 bp or more of the promoter region.  No luciferase activity was detected using 365 bp or less of the promoter.  A gradual decrease in activity was observed when three deletion constructs between -547 and -365 bp were tested suggesting the presence of at least two cis-regulatory elements within this region.  Internal deletion analysis indicated another potential regulatory region located between -307 and -226 bp.  To identify protein factor(s) that bind specifically to these regulatory sequences, gel shift assays were performed.  Two bands, 0.33 Rf and 0.13 Rf, were detected in both cytoplasmic and nuclear extracts using radiolabeled DNA fragments located between -227 and -198 bp and -252 and -203 bp of the promoter region, respectively.  Competition experiments confirmed the specificity of binding.  The protein factors in these DNA binding activities were purified using various chromatography techniques.  Mass spectrometry analysis of the purified 70 kDa protein corresponding to the 0.33 Rf band activity and a subsequent search in the Dictyostelium genomic database revealed that the purified protein was a putative formyltetrahydrofolate synthase.",
  "description_provenance": [
    "Author Email: ceristi@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:47Z (GMT). No. of bitstreams: 1 EristiETD.pdf: 1031997 bytes, checksum: cf274185c3585a41ff3a455f4f13e8b3 (MD5)   Previous issue date: 2003-07-22"
  ],
  "handle": "28822",
  "identifier_other": "etd-08292003-154546",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08292003-154546/",
  "identifier_uri": "http://hdl.handle.net/10919/28822",
  "publisher": "Virginia Tech",
  "relation_haspart": "EristiETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "development",
    "Dictyostelium",
    "5'-nucleotidase",
    "promoter analysis"
  ],
  "title": "Investigation of Transcriptional Regulation of 5'-Nucleotidase in Dictyostelium Discoideum",
  "type": "Dissertation"
}