{
  "contributor_author": "Yuan, Huali",
  "contributor_committeechair": "Little, John C.",
  "contributor_committeemember": [
    "Edwards, Marc A.",
    "Love, Brian J.",
    "Gallagher, Daniel L.",
    "Marr, Linsey C."
  ],
  "contributor_department": "Environmental Engineering",
  "date_accessioned": "2014-03-14T20:15:47Z",
  "date_adate": "2005-10-21",
  "date_available": "2014-03-14T20:15:47Z",
  "date_issued": "2005-08-25",
  "date_rdate": "2006-10-21",
  "date_sdate": "2005-08-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Indoor air quality is recognized as one of the most important environmental concerns, since people spend almost 90% of their lifetime indoors.  Indoor sources of volatile organic compounds (VOCs) are a determinant of air quality in houses.  Many materials used to construct and finish the interiors of new houses emit VOCs.  These emissions are a probable cause of acute health effects and discomfort among occupants.  Ventilation is another determinant of indoor air quality in houses, because it serves as the primary mechanism for removal of gaseous contaminants generated indoors.  Thus, higher contaminant concentrations are expected at lower ventilation rates given constant emission rates.  The trend in new construction is to make house envelopes tighter for higher energy efficiency.  The use of Structural Insulated Panels (SIPs) in new construction and major renovation to create very tight building envelopes is one popular approach to realizing this goal.  The basic SIPs configuration uses oriented strand board (OSB) and polystyrene foam (PSF) in a multi-layered sandwich-like structure.  Specific benefits of SIPs include lower energy consumption, stronger more durable structures and better resource efficiency.  These advantages make panelized systems very attractive from both environmental impact and energy use perspectives.  However, there is a potential for houses constructed with SIPs to have degraded air quality relative to conventionally constructed houses that utilize fewer engineered wood products.  OSB emits pentanal and hexanal, two odorous aldehydes.  These contaminants originate in the wood drying process through the breakdown of wood tissue and are, thus, inherent to most engineered wood products.  The PSF in SIPs is a major source of styrene.  The large surface area of installed SIPs systems (typically the entire exterior shell), combined with the resulting decrease in ventilation rate due to very low infiltration, exacerbates the indoor air problem.  Thus, the potential release of volatile contaminants must be taken into careful consideration when designing homes constructed with SIPs.  The ability to predict and ultimately minimize the negative impact of panel systems on indoor concentrations of contaminants of concern would be extremely useful for advancing housing technologies.  No prior investigations of VOC emissions from SIPs have been reported in the literature.  Two main methods are used to characterize emissions from building materials: chamber studies and mathematical modeling.  While chamber studies are costly and time-consuming, mathematical modeling is becoming an economical and effective alternative.  Physically-based models are especially useful because they provide insight into the governing mechanisms and the factors that control the emissions process.  Although emissions from building materials have traditionally been empirically characterized in chambers, we have recently validated a mechanistic model that predicts VOC emissions from vinyl flooring.  The approach involved independently measuring C0 (the initial material-phase concentration), D (the material-phase diffusion coefficient), K (the material/air partition coefficient) and then predicting the emission rate a priori using a fundamental mass-transfer model  We now wish to generalize this approach and use it to predict emissions from multi-layered SIPs.  To begin with, we will apply a single-layer model to predict emissions from each of the two SIP components: OSB and PSF.  Once this has been accomplished, it should be possible to develop a multi-layer model to predict emissions from the composite SIPs.  Our first research objective was to characterize transport of volatile organic compounds (VOCs) in polystyrene foam (PSF), a diffusion-controlled building material.  The sorption/desorption behavior of the polystyrene foam was investigated using a single-component system.  A microbalance was used to measure the sorption/desorption kinetics and to obtain equilibrium relationships.  Hexanal and styrene were selected as the target compounds.  While styrene transport in PSF can be described by Fickian diffusion with a symmetrical and reversible sorption/desorption process, the hexanal transport process exhibited significant hysteresis, with desorption being much slower than sorption.  To address this hysteresis, a porous media diffusion model that assumes local equilibrium governed by a non-linear Freundlich isotherm was developed.  The model was found to conform closely to the experimental kinetic data for both sorption and desorption.  By incorporating the Freundlich sorption mechanism into the traditional Fickian diffusion model, the hysteresis in the hexanal transport process in PSF was explained.  Contaminant emissions from building materials may tail extensively and require longer times to desorb than absorb.  This slow desorption or hysteresis problem has been an obstacle to understanding VOC emissions from building materials.  The overall goal of our second research objective was to (i) develop a predictive nonlinear emission model by incorporating a local Freundlich sorption equilibrium to account for the slow desorption; (ii) validate the new nonlinear emission model using independent chamber data; and (iii) compare the new nonlinear emission model with a previously published linear emission model.  Styrene in polystyrene foam (PSF) and hexanal in oriented strand board (OSB) were selected as the target compounds and materials, respectively.  Sorption/desorption kinetic experimental data show that while styrene sorption/desorption in PSF is symmetrical, hexanal sorption/desorption in OSB is not symmetrical.  For hexanal in OSB, slower desorption was observed.  Model validation results show that while the simple linear emission model can predict styrene emissions from PSF, it underestimates hexanal emissions from OSB.  With the new nonlinear emission model developed in this research, hexanal emission from OSB can be predicted.  These results suggest that local sorption equilibrium needs to be considered when predicting the emission rate of polar compounds from building materials.  The final objective was to develop a new multi-layer model for a layered SIP system.  Composite layered building materials are widely used in indoor environments due to their environmental and energy advantages.  However, the tight structure may result in degraded indoor air quality and the potential release of volatile organic compounds (VOCs) from these layered materials must be considered.  A theoretical physically-based diffusion model for predicting VOCs emissions from such multi-layer materials is described in this research.  It is assumed that the individual layers are flat homogeneous slabs, that internal mass transfer is governed by diffusion, and that the indoor air is well mixed.  For each layer, the material-phase diffusion coefficient (D), the material-phase partition coefficient (K), and the initial material-phase concentration (C0) are the key model parameters.  In this model, fugacity is used to numerically solve the model because this eliminates the discontinuities in concentration at the interface between layers.  This overcomes an insurmountable obstacle associated with numerically simulating mass transfer in composite layers.  The fugacity-based numerical model is checked by comparing predicted concentrations to those obtained with a previously published analytical model for double-layered materials.  In addition, transport of hexanal and styrene within, and emissions of hexanal and styrene from, multi-layer Structural Insulated Panels (SIPs) are simulated to demonstrate the usefulness of the model.  These preliminary results establish the viability of the fugacity approach.  Finally, the multi-layer layer model is used to demonstrate the impact that barrier materials can have. Results show that contaminant gas phase concentration can be reduced greatly with a barrier layer on the surface.  This deomonstrates the potential of thin barrier layers to minimize the environmental impact of panelized systems.  Future work will focus on a more complete experimental validation of the multi-layer model.",
  "description_provenance": [
    "Author Email: huyuan@vt.edu",
    "Advisor Email: edwardsm@vt.edu",
    "Advisor Email: blove@vt.edu",
    "Advisor Email: dang@vt.edu",
    "Advisor Email: jcl@vt.edu",
    "Advisor Email: lmarr@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:47Z (GMT). No. of bitstreams: 1 ETD_Huali_Yuan.pdf: 608465 bytes, checksum: 7f797c95761db58c50b511eea6095f9e (MD5)   Previous issue date: 2005-08-25"
  ],
  "handle": "28823",
  "identifier_other": "etd-08292005-164527",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08292005-164527/",
  "identifier_uri": "http://hdl.handle.net/10919/28823",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD_Huali_Yuan.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "multi-layer",
    "diffusion",
    "modeling",
    "transport",
    "VOC",
    "indoor",
    "emission",
    "SIPs"
  ],
  "title": "Modeling VOCs Emissions from Multi-layered Structural Insulated Panels(SIPs)",
  "type": "Dissertation"
}