{
  "contributor_author": "O'Sullivan, Sean",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Krill, Cecelia W.",
    "Byers, Larry",
    "Mallory, Walter D."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:15:49Z",
  "date_adate": "2006-10-09",
  "date_available": "2014-03-14T20:15:49Z",
  "date_issued": "2006-08-28",
  "date_rdate": "2006-10-09",
  "date_sdate": "2006-08-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<p>This study investigated the relationship between school building conditions and student academic achievement in Pennsylvania's high schools. Research questions analyzed by step-wise multiple regression were: (a) Is there a relationship between overall school building conditions and student academic achievement in Pennsylvania's high schools when socio-economic status (SES) is held constant?; (b) Is there a relationship between the cosmetic conditions of school facilities and student academic achievement in Pennsylvania's high schools when socio-economic status (SES) is held constant?; and (c) Is there a relationship between the structural conditions of school facilities and student academic achievement in Pennsylvania's high schools when socio-economic status (SES) is held constant?</p><p> Two hundred and five randomly selected high schools in the Commonwealth of Pennsylvania were identified as the population for this study. Selected high school principals or principal designees were sent an on-line version of a modified Commonwealth Assessment of Physical Environment (CAPE) survey to ascertain information regarding the building conditions of their respective high schools. Student academic achievement data was measured by a three year scale score average of students' performance on the writing, reading and mathematics sections of the Pennsylvania System of School Assessment (PSSA) exams. Socio-economic status (SES) was identified as the percentage of students eligible for free or reduced lunch. This factor was used as a covariant to control academic achievement variance related to SES.</p><p> A step-wise regression analysis identified that a relationship exists between high school building conditions and student academic achievement in Pennsylvania's high schools. As the building conditions in the participant high schools surveyed improved, a corresponding increase in the academic achievement of its students was noted. It did not appear to matter if the improvement in a school buildings condition was cosmetic or structural; any improvement in a school buildings condition was associated with an increase in student academic achievement. This would seem to indicate that a relationship exists between student academic achievement and school building conditions in Pennsylvania high schools.</p>",
  "description_provenance": [
    "Author Email: seano@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:49Z (GMT). No. of bitstreams: 1 SOSETD.pdf.pdf: 374022 bytes, checksum: 4f65e174d29bedff9893b1538215727e (MD5)   Previous issue date: 2006-08-28"
  ],
  "handle": "28837",
  "identifier_other": "etd-08312006-155402",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08312006-155402/",
  "identifier_uri": "http://hdl.handle.net/10919/28837",
  "publisher": "Virginia Tech",
  "relation_haspart": "SOSETD.pdf.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Building Conditions",
    "Pennsylvania System of School Achievement",
    "Student Academic Achievement"
  ],
  "title": "A Study of the Relationship between Building Conditions and Student Academic Achievement in Pennsylvania's High School",
  "type": "Dissertation"
}