{
  "contributor_author": "Waller, Tremayne  O'Brian",
  "contributor_committeecochair": [
    "Watford, Bevlee A.",
    "Magliaro, Susan G."
  ],
  "contributor_committeemember": [
    "Carter, Edith H.",
    "Sanders, Mark E."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:15:49Z",
  "date_adate": "2009-09-14",
  "date_available": "2014-03-14T20:15:49Z",
  "date_issued": "2009-07-20",
  "date_rdate": "2009-09-14",
  "date_sdate": "2009-08-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "For nearly half a century, institutions of higher education have implemented bridge programs in order to increase the retention and graduation rates of at-risk students (Pascarella & Terenzini, 2005).  In fact, summer bridge programs (SBPs), which typically occur prior to a studentâ  s freshman fall term, are among the oldest strategies used to improve college retention rates (Garcia, 1991).  Surprisingly, even though SBPs are widely acknowledged by both students and program administrators to be beneficial, there is very little empirical evidence assessing their effectiveness (Garcia, 1991; Kluepfel,1994; Pascarella & Terenzini; Rita and Bacote,1997; Ackerman 1990; Gandara & Maxwell-Jolly, 1999).  This study, therefore, used a mixed methods approach to investigate the various adjustment issues of participants versus non-participants in a summer bridge program for engineering students at a predominantly White institution (PWI) in the mid-southeastern region of the United States.  Specifically, the Academic, Social, Personal-Emotional, and Goal Commitment/Institutional Attachment subscales of the Student Adaptation to College Questionnaire (SACQ) were utilized (Baker & Siryk, 1999) for this purpose.  One important finding that the SACQ revealed was that the personal-emotional scale was significant for gender since scores for men were higher than for females.  The Summer Bridge Inventory (SBI) that was employed in this research also revealed that summer bridge participants and the director of support programs shared similar opinions about the strengths and weaknesses of the program and its related activities.  In conclusion, college administrators and directors of summer support programs should carefully assess programmatic outcomes to ensure that their institutionsâ   SBPs provided the needed supports that will enhance the retention and graduation rates of at-risk students in engineering.",
  "description_provenance": [
    "Author Email: trwaller@vt.edu",
    "Advisor Email: ecarter@radford.edu",
    "Advisor Email: deuce@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: msanders@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:49Z (GMT). No. of bitstreams: 1 WALLER_TO_D_2009.pdf: 1689089 bytes, checksum: b4d3580329deb1697f03dce9d06cc7c2 (MD5)   Previous issue date: 2009-07-20"
  ],
  "handle": "28839",
  "identifier_other": "etd-08312009-145520",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08312009-145520/",
  "identifier_uri": "http://hdl.handle.net/10919/28839",
  "publisher": "Virginia Tech",
  "relation_haspart": "WALLER_TO_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Summer Bridge Program",
    "Engineering",
    "Retention",
    "Adjustment"
  ],
  "title": "A Mixed Method Approach for Assessing the Adjustment of Incoming First-Year Engineering Students in a Summer Bridge Program",
  "type": "Dissertation"
}