{
  "contributor_author": "Crocker, Jeanne P.",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Eller, John F.",
    "Singh, Kusum",
    "Roberts, James T."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:15:49Z",
  "date_adate": "2007-11-02",
  "date_available": "2014-03-14T20:15:49Z",
  "date_issued": "2007-08-22",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-08-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated teacher beliefs and organizational climate constructs of collective efficacy, faculty trust, academic emphasis, enabling bureaucracy, and mindfulness as antecedents for implemented professional development. Researchers previously combined collective efficacy, faculty trust, and academic emphasis into academic optimism. Using Conscious Discipline as professional development and book study as delivery, in this mixed methodology study, 489 teachers in 17 suburban elementary schools completed surveys measuring organizational climate constructs, teacher beliefs about classroom management, and self-reported degree of imlementation. Morning greeting and classroom walkthrough observations collected evidence of implementation. Sixteen focus group teachers from four elementary schools explained the degree of implementation. This study found that (a) Teacher and school demographic data correlated with organizational climate constructs; (b) Teacher beliefs and faculty mindfulness explained 65.7% of variance in self-reported degree of implementation; and (c) Socioeconomic status, book club participation, and teacher beliefs explained 77.1% of variance in observation degree of implementation.",
  "description_provenance": [
    "Author Email: jmcrocker@cox.net",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: jeller@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: ROBERJI@cps.k12.va.us",
    "Made available in DSpace on 2014-03-14T20:15:49Z (GMT). No. of bitstreams: 8 AppendixA.pdf: 185471 bytes, checksum: 84deb54b472679eea5be4d63033709d4 (MD5) AppendixesIJ.pdf: 70071 bytes, checksum: fc753b9c1cd62d867e2c936633aeef48 (MD5) AppendixK.pdf: 61006 bytes, checksum: 269b715dc9d636bc5a962323a7b14bb0 (MD5) AppendixesFG.pdf: 136491 bytes, checksum: 21088258505531d92d9a019ce8203099 (MD5) AppendixH.pdf: 97846 bytes, checksum: 526e2a5c4df03b961225e086c8a8f9b0 (MD5) Body.pdf: 2270656 bytes, checksum: da750de95e3e395eea4064d815395223 (MD5) AppendixesBCDE.pdf: 157492 bytes, checksum: dc6f1c59b997b10a9b7860db5cbd5acc (MD5) TitleAbstractIndex.pdf: 128967 bytes, checksum: ee42ac83fe1342f228dfd2be07602cb3 (MD5)   Previous issue date: 2007-08-22"
  ],
  "handle": "28838",
  "identifier_other": "etd-08312007-211502",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08312007-211502/",
  "identifier_uri": "http://hdl.handle.net/10919/28838",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "AppendixA.pdf",
    "AppendixesIJ.pdf",
    "AppendixK.pdf",
    "AppendixesFG.pdf",
    "AppendixH.pdf",
    "Body.pdf",
    "AppendixesBCDE.pdf",
    "TitleAbstractIndex.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mindfulness",
    "enabling bureaucracy",
    "collective efficacy",
    "classroom management",
    "academic emphasis",
    "organizational climate",
    "teacher beliefs",
    "trust",
    "professional development"
  ],
  "title": "Organizational Climate, Teacher Beliefs, and Professional Development: An Investigation of the Relationships",
  "type": "Dissertation"
}