{
  "contributor_author": "Allender-Hagedorn, Susan",
  "contributor_committeechair": "Zallen, Doris T.",
  "contributor_committeemember": [
    "de Wolf, Peggy L.",
    "Tolin, Sue A.",
    "Burian, Richard M.",
    "Barrow, Mark V. Jr."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:15:48Z",
  "date_adate": "2001-09-04",
  "date_available": "2014-03-14T20:15:48Z",
  "date_issued": "2001-04-10",
  "date_rdate": "2004-09-04",
  "date_sdate": "2001-08-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Human Genome Project (HGP), the name given to the scientific program to map and decode all of human genetic material, has been projected to revolutionize the conduct of biological science in the twenty-first century. For several years before its formation in 1990, a federally-funded, systematic study of the human genome was discussed first in the scientific arena and then in the public arena. <p>  The central thesis of this dissertation is that the arguments supporting or rejecting creation of the HGP and the rhetorical devices used to further those arguments had a major influence on the shape the HGP took in 1991.  The argumentation used both for and against the creation of the HGP before the public as well as on the border between the public and scientific arenas is studied.  The rhetorical devices such as metaphor, narrative, and selective word choices used to further these arguments are also examined.  In particular, a rhetorical content analysis was performed on the 1986-1991 argumentation available to the most crucial audience for such persuasion: the members of Congress who ultimately voted for or against the program's funding and its establishment as a part of U.S. science policy.</p><p>  The proponents of the HGP, especially after the first year of public debate, presented their arguments in a wider arena of discussion and presented more and more varied arguments to advocate the project. The opposition raised questions that had for the most part been answered earlier in the debate. Often anti-HGP arguments focused on less effective audiences (scientists instead of members of Congress). Opposition to the project didn't become organized until near the end of the time frame studied, too late to have much of an impact on the outcome of the debate.  The rhetorical devices studied served to magnify the impact of arguments used: in particular, the metaphor served as a boundary object to bridge discussions between the scientific and the public arenas.</p><p> Ultimately the victory in the debate over the establishment of the HGP was awarded to the promulgators of the strongest underlying metaphor--the idealized excitement and profit of exploration of unknown territory--and the benefits to come from filling in and conquering the unknown areas of the human genetic map, territory the U.S. was eager to claim for its own. </p>",
  "description_provenance": [
    "Author Email: hagedors@vt.edu",
    "Advisor Email: dtzallen@vt.edu",
    "Advisor Email: woofer@vt.edu",
    "Advisor Email: stolin@vt.edu",
    "Advisor Email: rmburian@vt.edu",
    "Advisor Email: barrow@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:48Z (GMT). No. of bitstreams: 1 HGP.pdf: 3620708 bytes, checksum: d0be67dcbef9de6733a356d22253092a (MD5)   Previous issue date: 2001-04-10"
  ],
  "handle": "28834",
  "identifier_other": "etd-08312001-082318",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08312001-082318/",
  "identifier_uri": "http://hdl.handle.net/10919/28834",
  "publisher": "Virginia Tech",
  "relation_haspart": "HGP.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "science policy",
    "DNA sequencing",
    "DNA mapping",
    "rhetoric of science",
    "metaphor",
    "Human Genome Project",
    "big science",
    "content analysis",
    "narrative",
    "ethos"
  ],
  "title": "Arguing the Genome: A Topology of the Argumentation Behind the Construction of the Human Genome Project",
  "type": "Dissertation"
}