{
  "contributor_author": "Mackasmiel, Lucas A",
  "contributor_committeechair": "Tolin, Sue A.",
  "contributor_committeemember": [
    "Abaye, Azenegashe Ozzie",
    "Pfeiffer, Douglas G.",
    "Stromberg, Erik L.",
    "Warren, Herman L."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:15:49Z",
  "date_adate": "2004-09-10",
  "date_available": "2014-03-14T20:15:49Z",
  "date_issued": "2004-07-12",
  "date_rdate": "2004-09-10",
  "date_sdate": "2004-08-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<I>Bean pod mottle virus </I>(BPMV, Genus <I>Comovirus</I>, Family: <I>Comoviridae</I>)is an important virus in soybean (<I>Glycine max</I> (L.) Merrill), causing quality and yield loss due to seed coat mottling and seed weight reduction.  Although BPMV has been known in Virginia since 1958 and has always been regarded as causing negligible losses, its impact is changing as BPMV incidence has increased in many soybean growing areas of Virginia and the USA in general.  From 1997 to 2001, a total of five BPMV isolates (V-W1, V-W2, V-S98-1, V-S98-15 and V-S01-10) were collected in Virginia and characterized.  In this study, the effects of these isolates were studied, alone or with Soybean mosaic virus (SMV, Genus Potyvirus, Family Potyviridae) strain SMV G1, and isolates S98-51 and S98-52, on selected soybean cultivars.  Individual isolates of BPMV showed variable symptom severity, and resulted in yield loss of between 40.4 to 58.1%, while SMV caused 23.7% in the most severe interactions.  Up to 100% yield loss was realized from double inoculations of selected BPMV and SMV isolates, BPMV V-S98-1 + SMV S98-52 and BPMV S98-15 + SMV S98-52 on Hutcheson and Hutcheson Roundup Ready&#174; (BC5) soybeans, respectively.  Time of inoculation, a critical factor in the impact of many virus diseases, affected seed coat mottling in four cultivars and seed weight in two cultivars, in tests with four BPMV isolates and three stages of soybean development.  All BPMV isolates inoculated to plants at vegetative stage V1-V3 severely increased seed coat mottling and reduced seed weight than those inoculated at V4-V6 and reproductive stage R1-R3.  Seedlings grown from non-mottled seeds germinated more uniformly had fewer thin-stemmed seedlings and grew faster than those grown from mottled seeds.  Inoculation of various cultivars and breeding lines showed that there was no correlation between the severity of virus-induced foliar symptoms, relative accumulation of SMV, and extent of seed coat mottling.  Thus, by avoiding the presence of BPMV at an early growth stage through proper timing of planting to avoid vectors, proper cultural practices like weed control, use of SMV free seeds, and chemical control, it is possible to greatly improve seed quality and reduce yield losses in soybean.",
  "description_provenance": [
    "Author Email: lmackasm@vt.edu",
    "Advisor Email: stolin@vt.edu",
    "Advisor Email: cotton@vt.edu",
    "Advisor Email: dgpfeiff@vt.edu",
    "Advisor Email: elstrom@vt.edu",
    "Advisor Email: hwarren@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:49Z (GMT). No. of bitstreams: 8 Chapter3.pdf: 508004 bytes, checksum: 49775fdc98af33202858bb13dbd34c5e (MD5) Chapter1.pdf: 347911 bytes, checksum: 95d70497426948d43392dc57c4a2d3c9 (MD5) Chapter2.pdf: 1364380 bytes, checksum: bee10744e4bc74cc9100da7a92ba54f7 (MD5) Chapter4.pdf: 664108 bytes, checksum: 8c39cf93c64b7f47b8d890e4c535f1bf (MD5) Vitae.pdf: 56472 bytes, checksum: bb957b56eef0656ac1e6f78c5777e355 (MD5) Chapter5.pdf: 600107 bytes, checksum: ec3c402e5a8fe2db0cf37d85609bb11c (MD5) Chapter6.pdf: 797675 bytes, checksum: fd6130c24f5793b80a03c5df6a45c520 (MD5) Frontmatter.pdf: 249704 bytes, checksum: 13e51f366d97a850c12cb83a79eaddae (MD5)   Previous issue date: 2004-07-12"
  ],
  "handle": "28836",
  "identifier_other": "etd-08312004-143153",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08312004-143153/",
  "identifier_uri": "http://hdl.handle.net/10919/28836",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter3.pdf",
    "Chapter1.pdf",
    "Chapter2.pdf",
    "Chapter4.pdf",
    "Vitae.pdf",
    "Chapter5.pdf",
    "Chapter6.pdf",
    "Frontmatter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "seed coat mottling",
    "time of infection",
    "yield loss",
    "virus diversity",
    "synergism",
    "seed quality",
    "herbicide resistance-virus interactions"
  ],
  "title": "Assessing the Distribution and Impact of <I>Bean pod mottle virus</I> (BPMV) as a Re-emerging Virus, and <I>Soybean mosaic virus </I>(SMV) in Soybean Grown in Virginia.",
  "type": "Dissertation"
}