{
  "contributor_author": "Kozak, Jeffrey D",
  "contributor_committeechair": "Ng, Fai",
  "contributor_committeemember": [
    "Burdisso, Ricardo A.",
    "O'Brien, Walter F. Jr.",
    "King, Peter S.",
    "Dancey, Clinton L."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:15:48Z",
  "date_adate": "2000-09-14",
  "date_available": "2014-03-14T20:15:48Z",
  "date_issued": "2000-08-17",
  "date_rdate": "2001-09-14",
  "date_sdate": "2000-08-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A series of experiments were conducted in a F109 turbofan engine to investigate the unsteady wake profiles of an Inlet Guide Vane (IGV) at a typical spacing to the downstream fan at subsonic and transonic relative blade velocities.  The sharp trailing-edge vanes were designed to produce a wake profile consistent with modern IGV.  Time averaged baseline measurements were first performed with the IGV located upstream of the aerodynamic influence of the fan.  Unsteady experiments were performed with an IGV-fan spacing of 0.43 fan chords.  High-frequency on-vane pressure measurements showed strong peak-to-peak amplitudes at the blade passing frequency (BPF) of 4.7 psi at the transonic fan speeds.  High-frequency total pressure measurements of the IGV wake were taken between the IGV and fan.  Results showed that the total pressure loss coefficient of the time averaged IGV wake is reduced by 30% for the subsonic fan, and increased by a factor of 2 for the transonic fan compared to the baseline.  Time resolved wake profiles for subsonic fan speeds show constructive and destructive interactions over each blade pass generated by the fan potential flow field.  Time resolved wake profiles for the transonic fan speeds show that shock interactions with the IGV surface result in the wake shedding off of the vane at the BPF.  Furthermore, the effectiveness of trailing edge blowing (TEB) flow control was investigated.  TEB is the method of injecting air aft of the IGV to reduce the low pressure regions (deficits) in the viscous wakes shed by the vanes.  Minimizing the IGV wakes reduces the forcing function on the downstream fan blades, thereby reducing high cycle fatigue. The TE span of the vane contains discrete holes at the axial centerline for TEB.  Baseline results showed that TEB eliminates the IGV wake, while using only 0.03% of the total engine mass flow per IGV.  TEB for the subsonic fan at the close spacing shows complete wake filling using the same mass flow as the baseline.  TEB for the transonic fan shows a reduction of 68% in the total pressure loss coefficient, while requiring 2.5 times the mass flow as the baseline.",
  "description_provenance": [
    "Author Email: jdkeme@rit.edu",
    "Advisor Email: rburdiss@vt.edu",
    "Advisor Email: walto@vt.edu",
    "Advisor Email: psking@vt.edu",
    "Advisor Email: cld@vt.edu",
    "Advisor Email: wng@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:48Z (GMT). No. of bitstreams: 2 Kozakpart2.pdf: 1618584 bytes, checksum: c768947c106b6b253c1545bac0c15660 (MD5) Kozakpart1.pdf: 5899818 bytes, checksum: 29219bfe605add098c775baf6ec0fa4c (MD5)   Previous issue date: 2000-08-17"
  ],
  "handle": "28833",
  "identifier_other": "etd-08312000-14560008",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08312000-14560008/",
  "identifier_uri": "http://hdl.handle.net/10919/28833",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Kozakpart2.pdf",
    "Kozakpart1.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Wake",
    "Fan",
    "Inlet Guide Vane",
    "Trailing Edge Blowing",
    "F109",
    "Transonic",
    "Flow Control",
    "Unsteady Stator-rotor"
  ],
  "title": "Investigation of Inlet Guide Vane Wakes in a F109 Turbofan Engine with and without Flow Control",
  "type": "Dissertation"
}