{
  "contributor_author": "Kaushiva, Bryan D.",
  "contributor_committeechair": "Wilkes, Garth L.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Marand, Eva",
    "Conger, William L.",
    "Ward, Thomas C."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:15:50Z",
  "date_adate": "1999-09-28",
  "date_available": "2014-03-14T20:15:50Z",
  "date_issued": "1999-08-16",
  "date_rdate": "2000-09-28",
  "date_sdate": "1999-08-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examined several structure-property features of flexible polyurethane foams that are important aspects of foam production.  AFM and WAXS were used to demonstrate the existence, for the first time in typical polyurethane foam systems, of lamellae-like polyurea structures ca. 0.2 mm long and ca 5-10 nm across.  Aggregations of these lamellae-like hard domains may be the polyurea balls typically observed via TEM.  Diethanolamine, a widely used cross-linking agent in molded foams, was shown to disrupt ordering in the polyurea hard domains and alter the interconnectivity of hard domains by preventing the formation of lamellae-like structures.  These changes were shown to lead to softening of the foam.  Copolymer polyol is frequently applied as reinforcing filler in foams.  It was found that a common method of adding this component alters the hard segment/soft segment (HS/SS) ratio, thus increasing the load bearing capacity of the foam.  It was observed in this report that at constant HS/SS ratio, the copolymer polyol only increased load bearing under humid conditions.  It was also shown that the collapse of the cellular structure of a foam prior to the point of urea precipitation alters the aggregation behavior of the hard domains and alters solid-state properties. Surfactant is thus suggested to play a secondary role in the development of the hard domains by maintaining the cellular structure in the foam as the phase separation occurs and at least until the polyurethane foam has more fully organized hard segment domains.  It was found that cure temperature could be manipulated to predictably change interdomain spacings and hydrogen bond development in the polymer.  Curing above 100°C was found to lower hard segment content for plaques of the same formulation possibly as a result of water and isocyanate vaporization. Apart from polyurethane materials, structure-property relationships were examined in cast blends based on poly(tetrafluoroethylene) (PTFE) and the terpolymer poly(tetrafluoroethylene-co-vinylidene fluoride-co-hexafluoropropylene) (FKM).  This revealed that tensile and dynamic moduli could be predictably altered by controlling the degree of FKM cross-linking or by varying PTFE content in the film.  Inducing PTFE fibrillation was found to yield higher modulus films without increasing PTFE content.",
  "description_provenance": [
    "Author Email: blue.bird@bigfoot.com, bryan.kaushiva@lyondell.com",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: emarand@vt.edu",
    "Advisor Email: wlconger@vt.edu",
    "Advisor Email: tward@chemserver.chem.vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:50Z (GMT). No. of bitstreams: 1 KAUSHIVA1.PDF: 3839003 bytes, checksum: cd8b0ecdb8f516c3f81d77e5cf7526b5 (MD5)   Previous issue date: 1999-08-16"
  ],
  "handle": "28843",
  "identifier_other": "etd-083199-185156",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-083199-185156/",
  "identifier_uri": "http://hdl.handle.net/10919/28843",
  "publisher": "Virginia Tech",
  "relation_haspart": "KAUSHIVA1.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "PTFE",
    "surfactant",
    "polyurethane foam",
    "atomic force micros"
  ],
  "title": "Structure-Property Relationships of Flexible Polyurethane Foams",
  "type": "Dissertation"
}