{
  "contributor_author": "Keim, Steven Anthony",
  "contributor_committeecochair": [
    "Karmis, Michael E.",
    "Luxbacher, Kramer Davis"
  ],
  "contributor_committeemember": [
    "Luttrell, Gerald H.",
    "Westman, Erik Christian",
    "Faria, Claudio"
  ],
  "contributor_department": "Mining and Minerals Engineering",
  "date_accessioned": "2014-03-14T20:15:50Z",
  "date_adate": "2011-10-12",
  "date_available": "2014-03-14T20:15:50Z",
  "date_issued": "2011-08-18",
  "date_rdate": "2011-10-12",
  "date_sdate": "2011-08-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Advanced three-dimensional reservoir modeling was used to determine the optimum strategy for coalbed methane production in China창  s Qinshui Basin.  Multiple completion strategies were analyzed for pre-mining methane drainage on the bases of economic, environmental, and mining-safety-based factors.  Effective degasification in the Qinshui Basin is crucial to enhance the health and safety of the underground mining workforce and to decrease carbon dioxide equivalent greenhouse gas emissions.  Active, large-scale degasification wells in the region include hydraulically stimulated vertical fracture wells and multilaterally drilled horizontal patterns, with the latter much less common.  Reservoir modeling concludes that despite their limited implementation, horizontal coalbed methane drainage wells offer the benefits of faster reservoir depressurization, high gas production rates, and faster recovery times than traditional vertical fracture wells.  Coupled with reservoir modeling results, discounted cash flow analyses show that high drilling density multilateral horizontal patterns are the most financially feasible degasification strategy in the Qinshui Basin, albeit a higher initial capital investment compared to traditional vertical fracture wells and lower drilling density horizontal patterns.   Additionally, horizontal wellbore designs can be altered to account for varying permeability, enhancing the productivity of methane from reservoirs exhibiting permeability values less than 1 millidarcy. Furthermore, modeling suggests that proper orientation of select horizontal wellbore patterns is crucial to optimize recoverable reserves.  Finally, a function was derived to represent the production rates of horizontal coalbed methane wells as a function of time.  Analysis of the function창  s validity to actual production data and simulated production data suggest that it is most applicable in gassy coal seams up to 10 feet in thickness.  The production rate curve was transformed to an analytical model, representing a function of well geometry and coal permeability as applied to other geological conditions of the Qinshui Basin.  Scientific contributions associated with this research include: An in depth study of degasification associated with the Qinshui Basin창  s low permeability coals; The methodology for assessing environmental, safety and economic benefits of coal degasification; The relationship between lateral spacing and permeability to maintain substantial gas production rates; An improved production model to describe the entire producing period of coalbed methane wells.",
  "description_provenance": [
    "Author Email: skeim@vt.edu",
    "Advisor Email: mkarmis@vt.edu",
    "Advisor Email: kraylux@vt.edu",
    "Advisor Email: luttrell@vt.edu",
    "Advisor Email: ewestman@vt.edu",
    "Advisor Email: claudiofaria@msn.com",
    "Made available in DSpace on 2014-03-14T20:15:50Z (GMT). No. of bitstreams: 1 Keim_SA_D_2011.pdf: 3808892 bytes, checksum: 2a927fa86772e437d7192677f9a64474 (MD5)   Previous issue date: 2011-08-18"
  ],
  "handle": "28842",
  "identifier_other": "etd-08312011-120400",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-08312011-120400/",
  "identifier_uri": "http://hdl.handle.net/10919/28842",
  "publisher": "Virginia Tech",
  "relation_haspart": "Keim_SA_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Qinshui Basin",
    "reservoir modeling",
    "coalbed methane"
  ],
  "title": "Optimization of Coalbed Methane Completion Strategies, Selection Criteria and Production Prediction: A Case Study in China창  s Qinshui Basin",
  "type": "Dissertation"
}