{
  "contributor_author": "McLeod, Michael  Allen",
  "contributor_committeechair": "Baird, Donald G.",
  "contributor_committeemember": [
    "Baird, Donald G.",
    "Wilkes, Garth L.",
    "Loos, Alfred C.",
    "Davis, Richey M.",
    "Conger, William L."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:15:50Z",
  "date_adate": "1998-01-09",
  "date_available": "2014-03-14T20:15:50Z",
  "date_issued": "1997-12-18",
  "date_rdate": "1999-01-09",
  "date_sdate": "1997-12-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "One portion of this work was concerned with injection molding pregenerated microcomposites composed primarily of poly(ethylene terephthalate) (PET) as the matrix and HX1000 as the thermotropic liquid crystalline polymer (TLCP).  Several factors were examined to maximize the mechanical properties of these composites, including injection molding temperature, matrix viscosity, and nozzle tip exit diameter.  In addition, concentrated strands of HX1000/PET (50/50 wt%) were diluted using both an injection molding grade of PET and an injection molding grade of PBT.  From this work, it was determined that the best mechanical properties were produced when the microcomposites were processed at the lowest injection molding temperatures, diluted with PBT, and injection molded using a large nozzle tip exit diameter.  The pregenerated microcomposite properties were compared against theoretical predictions as well as glass-filled PET.  It was found that the pregenerated microcomposites had tensile moduli of approximately 70% of theoretical expectations in the machine direction.  Additionally, the comparisons against glass-filled PET revealed that at the same weight fraction of reinforcement, the pregenerated microcomposites had lower properties.  Still, the composites were found to have smoother surfaces than glass-filled PET and at temperatures up to 150° C the storage and loss moduli of the pregenerated microcomposites were similar to those of glass filled PET.  It was concluded that if the theoretically expected levels of reinforcement could be attained, the pregenerated microcomposites processing scheme would be a viable method of producing light weight, wholly thermoplastic composites with smoother surfaces than are obtained with glass reinforcement. An additional focus of this research was to evaluate the ability to modify the crystallization behavior of a high melting TLCP (HX6000, Tm = 332° C) with a lower melting TLCP (HX8000, Tm = 272°C).  It was found that it was possible to tailor the crystallization behavior of these TLCP/TLCP blends by varying the weight fraction of each component, as determined by rheological cooling scans and differential scanning calorimetric cooling tests.  Based on the analysis of these TLCPs at the maximum injection molding temperature of 360° C, it was speculated that they had reacted with one another.",
  "description_provenance": [
    "Author Email: mmcleod@vtvm1.cc.vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:50Z (GMT). No. of bitstreams: 9 PREFACE.PDF: 56303 bytes, checksum: bdf30f9c2863e3f81652c36453f2cfc5 (MD5) CH1.PDF: 371441 bytes, checksum: 2e6009765a6cac5af5f462b97f873bfc (MD5) CH2.PDF: 899961 bytes, checksum: 05fa5ebb93bed1b966f45d1d8c49875f (MD5) CH3.PDF: 317051 bytes, checksum: f3cc5a27c1cdab27e8be19b36d5ff7e0 (MD5) CH4.PDF: 511626 bytes, checksum: 6275ce7fcc2b8b704f8bf9e1f24cf57e (MD5) CH5.PDF: 166663 bytes, checksum: d0a4c3d8ea59366b8fb326cae014e8f2 (MD5) CH6.PDF: 10929 bytes, checksum: dbdec7b407bbcb61f6e3452f424fddc5 (MD5) APPENDIX.PDF: 823417 bytes, checksum: aeb736954341a9e9f1c7f0a10c217ea7 (MD5) VITA.PDF: 193347 bytes, checksum: 4f9b73043028284f0bb330b2852f3cf3 (MD5)   Previous issue date: 1997-12-18"
  ],
  "handle": "28844",
  "identifier_other": "etd-0898-145634",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-0898-145634/",
  "identifier_uri": "http://hdl.handle.net/10919/28844",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "PREFACE.PDF",
    "CH1.PDF",
    "CH2.PDF",
    "CH3.PDF",
    "CH4.PDF",
    "CH5.PDF",
    "CH6.PDF",
    "APPENDIX.PDF",
    "VITA.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "fiber spinning",
    "thermotropic liquid crystalline polymer",
    "polymer blend",
    "pregenerated microcomposite",
    "composite",
    "injection molding"
  ],
  "title": "Injection Molding of Pregenerated Microcomposites",
  "type": "Dissertation"
}