{
  "contributor_author": "Anderson, Emily Baird",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "Riffle, Judy S.",
    "Turner, S. Richard",
    "Davis, Richey M.",
    "Ward, Thomas C."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:15:52Z",
  "date_adate": "2010-09-28",
  "date_available": "2014-03-14T20:15:52Z",
  "date_issued": "2010-08-18",
  "date_rdate": "2010-12-21",
  "date_sdate": "2010-09-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Phosphonium ions readily compare to ammonium ions in regards to their aggregate characteristics, thermal stability, and antibacterial activity. Ionic aggregation in phosphonium-based polymers provides thermoreversible crosslinks, ideal for reversible self-assembly, self-healing, and smart response. In polymers, these ionic functionalities aggregate, providing improved moduli, and altering the size and structure of ionic aggregates regulates polymer melt processability.    This dissertation highlights phosphonium-based chemistry for the synthesis of novel step-growth ionomers and structure-property relationships in ionic polymers. The synthesis of phosphonium endcapping reagents for melt polyester reactions afforded a thermally stable ionic functionality that controlled molecular weight. Weak association was present with phosphonium ions at low ion concentrations below 7.7 mole %. The use of novel ionic bisacetoacetate monomers in the formation of networks from Michael addition reactions led to the synthesis of ionic networks with increased and broadened glass transitions and improved tensile stresses at break and strains at break compared to those in the non-ionic networks. The first electrospun fibers from Michael addition crosslinking reactions are reported, and equilibrium ionic liquid uptake experimental results indicated that ionic functional networks absorb close to three times the amount of ionic liquid as non-ionic, poly(ethylene glycol)-based films. Chain-extending polyurethanes with a phosphonium diol and subsequently varying the hard segment content led to changes in ionic aggregation, crystallinity, and thermal transitions in the polymers. Additionally, novel phosphonium-based methacrylate monomers incorporated into diblock copolymers with styrene exhibited microphase separation. Overall, the inclusion of phosphonium ions pendant to or in the main chain of various types of polymers led to changes in morphology, improved tensile properties, enhanced moduli, broadened transitions, changes in crystalline melting points, changes in solubility, and appearance of ionic aggregation.",
  "description_provenance": [
    "Author Email: eander05@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: srturner@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:52Z (GMT). No. of bitstreams: 1 Anderson_EB_D_2010.pdf: 7770180 bytes, checksum: e452ad27e6dc56549fe65811eea2dbdf (MD5)   Previous issue date: 2010-08-18"
  ],
  "handle": "28849",
  "identifier_other": "etd-09012010-115556",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09012010-115556/",
  "identifier_uri": "http://hdl.handle.net/10919/28849",
  "publisher": "Virginia Tech",
  "relation_haspart": "Anderson_EB_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ionomers",
    "non-covalent interactions",
    "polyurethanes",
    "polyesters",
    "multi-walled carbon nanotubes",
    "Michael addition",
    "ionic liquids",
    "methacrylates",
    "step-growth polymerization",
    "imdiazolium",
    "phosphonium"
  ],
  "title": "Synthesis and Non-Covalent Interactions of Novel Phosphonium-Containing Polymers",
  "type": "Dissertation"
}