{
  "contributor_author": "Holbrook, Jr., Richard David",
  "contributor_committeecochair": [
    "Novak, John T.",
    "Love, Nancy C."
  ],
  "contributor_committeemember": [
    "Grizzard, Thomas J.",
    "Eick, Matthew J.",
    "Daigger, Glen T.",
    "Bevan, David R."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:15:52Z",
  "date_adate": "2003-09-05",
  "date_available": "2014-03-14T20:15:52Z",
  "date_issued": "2003-07-22",
  "date_rdate": "2005-09-05",
  "date_sdate": "2003-09-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The presence of biologically-active estrogenic endocrine disrupting compounds (EDCs) in treated effluents from biological wastewater treatment facilities has prompted wide-spread interest in the behavior of these contaminants during the activated sludge process.  The yeast-estrogen screen (YES) was used to quantify the estrogenic activity of samples taken from different areas of three wastewater treatment facilities.  An estrogenic mass-balance around these facilities revealed that the majority of influent estrogenic activity was removed in the activated sludge process, but the main route for EDC discharge to the natural environment was via the treated effluent.  The estrogenic activity in the effluent from a membrane bioreactor (MBR) was lower compared to a fully aerobic activated sludge process using secondary clarification, suggesting that enhanced removal of particulate and colloidal material may improve EDC removal efficiency.   \t         <P> Colloidal material was obtained from settled mixed liquor suspended solids (MLSS) collected from a pilot MBR and a full-scale activated sludge process that included anoxic and aerobic zones.  The MLSS was sized fractionated by filtration, and used to quantify the sorption coefficients for pyrene, 17&#946;-estradiol (E2), and 17&#945;-ethinylestradiol (EE2) by fluorescence quenching.  The MLSS-derived colloidal organic carbon (COC) sorption coefficient (Kcoc) for pyrene ranged from (< 1 to 80) L/kgcoc, indicating a similar affinity for pyrene compared to natural organic matter.  Kcoc coefficients for E2 ranged between (< 1 to 158) L/kgcoc for E2 and (< 1 to 228) L/kgcoc for EE2, and are the highest E2 and EE2 sorption coefficients reported in the literature to date.  There was a strong correlation between the Kcoc coefficients and molar extinction coefficient at 280 nm (e280) for pyrene and E2, suggesting that the interaction of the &#960;-electrons is an important factor in determining overall sorption behavior.  There was no such correlation for EE2.  Based on the Kcoc coefficients and COC concentrations of the samples, between 1 and 50% of the aqueous E2 and EE2 concentrations were associated with colloidal material.    \t</p><p> In a novel application of the YES bioassay, the bioavailability of colloid-associated E2 was quantified by comparing the EC50 values of the dose-response curves generated in the presence and absence of size fractionated COC.  An increase in EC50 values as a function of COC concentration was attributed to a reduction in bioavailability of E2, suggesting that MLSS-derived COC can reduce, but not eliminate, the biological impact of EDCs.  However, there was a high degree of variability in the EC50 values, and estimates of the colloid-associated E2 fraction based on the Kcoc-e280 correlation were unsuccessful in accurately predicting increases in EC50 values.  Nevertheless, the YES bioassay may represent a powerful tool in determining the bioavailability of EDCs in complex environmental samples.  \t</p><p> Results from this research effort suggest that the colloidal phase derived from activated sludge systems represents an important transport vehicle whereby EDCs and other trace organic compounds can enter into the natural environment.  Consequently, wastewater treatment plants discharging to sensitive ecosystems or involved with direct water reuse programs should optimize the treatment process to remove colloidal material.",
  "description_provenance": [
    "Author Email: dholbrook@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Advisor Email: grizzard@vt.edu",
    "Advisor Email: eick@vt.edu",
    "Advisor Email: gdaigger@ch2m.com",
    "Advisor Email: nlove@vt.edu",
    "Advisor Email: drbevan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:52Z (GMT). No. of bitstreams: 1 Dissertation7.pdf: 1630721 bytes, checksum: 551c7243f3067ee4e25b5083b87186f2 (MD5)   Previous issue date: 2003-07-22"
  ],
  "handle": "28853",
  "identifier_other": "etd-09022003-181914",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09022003-181914/",
  "identifier_uri": "http://hdl.handle.net/10919/28853",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation7.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Colloids",
    "Bioavailability",
    "Endocrine Disruptor",
    "Activated Sludge",
    "Estrogenic Activity",
    "Sorption Coefficients"
  ],
  "title": "Fate and Transport of Endocrine Disrupting Compounds during Wastewater Treatment: The Role of Colloidal and Particulate Material",
  "type": "Dissertation"
}