{
  "contributor_author": "Jacobsen, Lance Steven",
  "contributor_committeechair": "Schetz, Joseph A.",
  "contributor_committeemember": [
    "Vandsburger, Uri",
    "Jakubowski, Antoni K."
  ],
  "contributor_department": "Aerospace and Ocean Engineering",
  "date_accessioned": "2014-03-14T20:15:53Z",
  "date_adate": "2001-11-27",
  "date_available": "2014-03-14T20:15:53Z",
  "date_issued": "2001-04-16",
  "date_rdate": "2002-11-27",
  "date_sdate": "2001-09-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The first integrated, flush-wall, aero-ramp-fuel-injector/plasma-torch igniter and flame propagation system for supersonic combustion applications with hydrocarbon fuels was developed and tested.  The main goal of this project was to develop a device which could be used to demonstrate that the correct placement of a plasma-torch-igniter/flame-holder in the wake of the fuel jets of an aero-ramp injector array could make sustained, efficient supersonic combustion with low losses and thermal loading possible in a high enthalpy environment.  Three phases of research were performed to develop the device using the supersonic cold flow facilities at Virginia Tech.  The experimental investigations included some of the following methods: shadowgraphs, surface oil flow, pressure-sensitive paint, high- or low-speed photography, aerothermodynamic sampling, and spectroscopy.  During this research effort, a new mixing parameter was also developed to quantify the injector plume mass fraction concentration values using successive profiles of ambient or heated air as the injectant.   The first phase of the research effort was conducted at Mach 3.0 at a static pressure and temperature of 0.19 atm and 101 K.  This phase involved component analyses to improve on the designs of the aero-ramp and plasma-torch as well as address integration and incorporation difficulties.  The information learned from these experiments lead to the creation of the first prototype integrated aero-ramp/plasma torch design featuring a new simplified four-hole aero-ramp design.   The second phase of the project consisted of experiments at Mach 2.4 involving a cold-flow mixing evaluation of the new aero-ramp design and a resizing of the device for incorporation into a scramjet flow path test rig at the Air Force Research Laboratories (AFRL).  Experiments were performed at a static pressure and temperature of 0.25 atm and 131 K, and at injector-jet to freestream momentum flux ratios ranging from 1.0 to 3.3.  Results showed the aero-ramp to mix at a considerably faster rate than the injector used in the AFRL baseline combustor configuration due to high levels of vorticity created by the injector array.  In addition, the plume of the aero-ramp lifted off the test section wall without trapping a secondary core inside the shear layer near the surface, unlike the earlier nine-hole aero-ramp arrays.  The mitigation of the secondary fuel core leads to a lower level of combustion near the surface and a lower potential for thermal loading on the wall.   The last phase of the research involved testing the final device design in a cold-flow environment at Mach 2.4 with ethylene fuel injection and an operational plasma torch with methane, nitrogen, a 90-percent nitrogen 10-percent hydrogen (by volume) mixture, and air feedstock gases.  Experiments were performed with injector jet to freestream momentum flux ratios ranging from 1.4 to 3.3, and 1.2 with the plasma torch at a nominal power level 2000 watts.  Overall, the final integrated design showed a high mixing efficiency and a higher potential for repeatable main fuel ignition and flame propagation with the plasma torch placed at the middle of the three downstream torch stations tested (x/dinjector = 8 downstream from the center of the injector area), with nitrogen as the torch feedstock.  Furthermore, the integrated device created a sustained flame, demonstrating main fuel ignition in a cold and low pressure supersonic environment with a plasma-torch.  Local intensity distributions of the major excited species generated from the interaction of the plasma-torch with the main fuel plume were also identified with a spectrometer.  As a result of the research and development process, an injector block for scramjet combustor experiments consisting of four integrated aero-ramp-injector/plasma-torch-igniters was created for near future tests at the AFRL.",
  "description_provenance": [
    "Author Email: lance@gohypersonic.com",
    "Advisor Email: ptiger@vt.edu",
    "Advisor Email: uri@vt.edu",
    "Advisor Email: ajakubow@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:53Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 9792458 bytes, checksum: c2439007a6efecea7d87e95320b0c982 (MD5)   Previous issue date: 2001-04-16"
  ],
  "handle": "28858",
  "identifier_other": "etd-09032001-185111",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09032001-185111/",
  "identifier_uri": "http://hdl.handle.net/10919/28858",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "title": "An Integrated Aerodynamic-Ramp-Injector/ Plasma-Torch-Igniter for Supersonic Combustion Applications with Hydrocarbon Fuels",
  "type": "Dissertation"
}