{
  "contributor_author": "Guzy, Matthew Thomas",
  "contributor_committeecochair": [
    "Van Cott, Kevin E.",
    "Davis, Richey M."
  ],
  "contributor_committeemember": [
    "Gibson, Harry W.",
    "Heflin, James R.",
    "Wilkes, Garth L."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:15:52Z",
  "date_adate": "2005-09-30",
  "date_available": "2014-03-14T20:15:52Z",
  "date_issued": "2003-07-07",
  "date_rdate": "2006-09-30",
  "date_sdate": "2003-09-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Layer-by-layer deposition techniques were used to fabricate films with second order nonlinear optical (NLO) properties.  These materials are key to the development of electro-optic modulators used in fiber optic communication systems.  Performance benefits and lower manufacturing costs are driving the development of organic NLO materials as replacements for inorganic crystalline materials such as lithium niobate. The layer-by-layer deposition technique in which polyelectrolytes are deposited on a surface by electrostatic effects is called the Ionically Self-Assembled Monolayer or ISAM method.  The role of the optically inactive polycation's structure on deposition and chromophore orientation was studied by fabricating films with several different polycations.  While the specific interactions responsible for chromophore orientation in ISAM films remains unclear, hydrogen bonding and electrostatic effects are ruled out as the sole sources of orientation.  The highest values of &967;(2) were observed under pH conditions that resulted in flat and thin layers.  The relationship between pH and the optical homogeneity of the film was also explored.  Deposition of polymers under pH conditions in which the polymer chains were aggregated in solution results in films that are not suitable for use in devices. In this work, a new layer-by-layer deposition technique was developed.  Coined hybrid deposition, it relies on covalent bonds and electrostatic interactions for film fabrication.  Optically inactive polyamines were used as sources of positive charges and as binding sites with optically active low molecular weight chromophores functionalized with a reactive triazine ring and negative charged sulfonate groups.  Polar ordering of the chromophores was obtained when the deposition was done under conditions in which covalent bonding was the preferred attachment mechanism for the chromophore molecules.  pH conditions in which electrostatic attachment dominated resulted in poorer orientation.  The effect of adding ionic salts to the dye solutions was studied, with hopes of increasing the chromophore density in the film by shielding inter-dye electrostatic repulsions.  A linear relationship in deposited amount, as characterized by absorbance/bilayer, was observed as the salt concentration was increased.  Little effect on &967;(2) was observed for films made with the as-received Procion Red MX-5B chromophore.  However, films fabricated from purified Procion Brown MX-GRN showed a definite dependence on added salt.  Exceptional &967;(2) values were obtained for Procion Brown films deposited using 0.5 M NaCl and PAH.  The importance of depositing from non-aggregated solutions was again highlighted, as films made with the less soluble Procion Orange were significantly less homogeneous than those made from Procion Red and Procion Brown which were highly soluble.  The role of polycation structure on the deposition and orientation of Procion Brown and Red was examined.",
  "description_provenance": [
    "Author Email: mguzy@vt.edu",
    "Advisor Email: kvancott@vt.edu",
    "Advisor Email: hwgibson@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:52Z (GMT). No. of bitstreams: 1 guzyfinaldisseration.pdf: 1976243 bytes, checksum: e8b9a6b8ab5da3fe54920a0a1c30893b (MD5)   Previous issue date: 2003-07-07"
  ],
  "handle": "28852",
  "identifier_other": "etd-09022003-164429",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09022003-164429/",
  "identifier_uri": "http://hdl.handle.net/10919/28852",
  "publisher": "Virginia Tech",
  "relation_haspart": "guzyfinaldisseration.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Layer-by-layer deposition",
    "second order nonlinear optics",
    "chromophore orientation",
    "self assembly",
    "polymeric thin films"
  ],
  "title": "Organic Self-Assembled Layer-by-Layer Thin Films for Second-Order Nonlinear Optics",
  "type": "Dissertation"
}