{
  "contributor_author": "Ward, Randall A.",
  "contributor_committeechair": "Nespor, Jan K.",
  "contributor_committeemember": [
    "Lalik, Rosary V.",
    "Niles, Jerome A.",
    "Garrison, James W.",
    "Moore, Sandra"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:15:54Z",
  "date_adate": "1999-09-07",
  "date_available": "2014-03-14T20:15:54Z",
  "date_issued": "1999-08-20",
  "date_rdate": "2000-09-07",
  "date_sdate": "1999-09-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<HTML> <HEAD> <META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=windows-1252\"> <META NAME=\"Generator\" CONTENT=\"Microsoft Word 97/98\"> <TITLE>ABSTRACT</TITLE> <META NAME=\"Template\" CONTENT=\"TJ:Microsoft Office 98:Templates:Web Pages:Blank Web Page\"> </HEAD> <BODY LINK=\"#0000ff\" VLINK=\"#800080\">  <B><P ALIGN=\"CENTER\">ABSTRACT</P> <P ALIGN=\"CENTER\">&nbsp;</P> </B><P>This dissertation examines how elementary school teachers in a small rural district set between two state universities talked about the contextual elements that interacted with their teaching roles. The school district served a predominantly European American population, socio-economic ranging from middle-class to working class and some families living in poverty. </P> <P>Fieldnotes collected during a year of teaching third grade in a small rural school, artifacts in the form of paper material collected in schools (e.g. memos, newsletters, handouts, etc.) as well as news articles, and interviews with twenty six participants, provided the data for this study. The interviews, mostly with elementary school teachers, were the focus of the research.</P> <P>Findings make problematic the way most research conducted on elementary schools makes sense of school environments. Teachers described how processes within and external to their school environments entwined in a constantly changing manner. This inquiry raises questions about the impact of innovative programs, technology, the commodification of teachers&#146; time and space and the hierarchical distribution of power in schools on teachers&#146; work. It also reveals a lack of fit between the organization of schools and how they function. Finally, it shows problems with inquiry done by researchers positioned between public schools and research settings. </P></BODY> </HTML>",
  "description_provenance": [
    "Author Email: raward@vt.edu",
    "Advisor Email: lalik@vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: wesley@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:54Z (GMT). No. of bitstreams: 1 RAWARDETD.pdf: 281425 bytes, checksum: a5c3bd5fe6ebd955b9c501da205e70c8 (MD5)   Previous issue date: 1999-08-20"
  ],
  "handle": "28868",
  "identifier_other": "etd-090499-125154",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-090499-125154/",
  "identifier_uri": "http://hdl.handle.net/10919/28868",
  "publisher": "Virginia Tech",
  "relation_haspart": "RAWARDETD.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "elementary",
    "education",
    "Appalachian",
    "contexts"
  ],
  "title": "THE BRAID OF TEACHING:  Exploring the weave of elementary school contexts in an Appalachian school district",
  "type": "Dissertation"
}