{
  "contributor_author": "Towe, Sheri Lynn",
  "contributor_committeechair": "Stephens, Robert S.",
  "contributor_committeemember": [
    "Kim-Spoon, Jungmeen",
    "Winett, Richard A.",
    "Clum, George A. Jr."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:15:54Z",
  "date_adate": "2012-10-09",
  "date_available": "2014-03-14T20:15:54Z",
  "date_issued": "2012-08-23",
  "date_rdate": "2012-10-09",
  "date_sdate": "2012-09-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Marijuana use remains the most commonly used illicit drug in the United States, and many people experience problems related to their marijuana use yet do not seek treatment. Web-based interventions for problematic marijuana use represent a potentially cost-effective and highly accessible way to reach a large number of adults who are ambivalent about changing their marijuana use, or are concerned about seeking in-person counseling for their use. The goal of this online study was to evaluate the effectiveness of a brief web-based feedback intervention for adult marijuana users who reported at least some problems related to their marijuana use. Eighty-two adult college students who reported at least some problems related to marijuana use at baseline were randomized to one of two conditions to examine whether a personalized feedback report would impact marijuana use at follow-up relative to an education control group. Feedback reports were delivered to participants after completion of a baseline assessment battery, and participants were reassessed at one- and three-months post-baseline. Primary outcome variables were problems related to marijuana use and frequency of marijuana use. Main outcome analyses examined change over time by condition as well as possible moderating variables of Stage of Change and family history of problematic substance use. Both marijuana-related problems and marijuana use rates showed some indication of reduction over time at the one-month follow-up, but  there were no significant interactions by condition indicative of differential change. These reductions were not sustained at three-months. Analyses across the final follow-up period were likely not significant due to low follow-up completion rates, as well as an overall lower-than-expected sample size. Study recruitment will continue for one additional year to increase sample size for future analyses, but at this time there was no clear evidence the personalized feedback intervention was effective.",
  "description_provenance": [
    "Author Email: towe@vt.edu",
    "Advisor Email: jungmeen@vt.edu",
    "Advisor Email: rswinett@VT.EDU",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:54Z (GMT). No. of bitstreams: 2 Towe_SL_D_2012.pdf: 1623262 bytes, checksum: 29a8cd7a7c9aa708b30d98f9ed99890c (MD5) Towe_IRB-approval.pdf: 246904 bytes, checksum: 8f2213d976e16adb1a34af7ae008c40a (MD5)   Previous issue date: 2012-08-23"
  ],
  "handle": "28861",
  "identifier_other": "etd-09032012-112314",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09032012-112314/",
  "identifier_uri": "http://hdl.handle.net/10919/28861",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Towe_SL_D_2012.pdf",
    "Towe_IRB-approval.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "internet",
    "intervention",
    "Marijuana"
  ],
  "title": "The Impact of Personalized Feedback on Marijuana Use: Examining a Brief Intervention Delivered via the Internet",
  "type": "Dissertation"
}