{
  "contributor_author": "O'Brien, Kristen Wilson",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "Long, Timothy E.",
    "Esker, Alan R.",
    "Lesko, John Jack",
    "McGrath, James E."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:15:55Z",
  "date_adate": "2003-09-08",
  "date_available": "2014-03-14T20:15:55Z",
  "date_issued": "2003-08-21",
  "date_rdate": "2003-09-08",
  "date_sdate": "2003-09-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Poly(dimethylsiloxane) (PDMS) fluids containing magnetite nanoparticles stabilized with carboxylic acid-functionalized PDMS were prepared.  PDMS-magnetite complexes were characterized using transmission electron microscopy, elemental analysis, and vibrating sample magnetometry.  PDMS-magnetite complexes containing up to 67 wt% magnetite with magnetizations of ~52 emu gram-1 were prepared.  The magnetite particles were 7.4 ± 1.7 nm in diameter.  Calculations suggested that the complexes prepared using mercaptosuccinic acid-functionalized PDMS (PDMS-6COOH) complexes contained unbound acid groups whereas the mercaptoacetic acid-functionalized PDMS (PDMS-3COOH) complexes did not.  Calculations showed that the PDMS-3COOH and PDMS-6COOH covered the same surface area on magnetite.  Calculations were supported by molecular models and FTIR analyses.  The complexes were dispersed into PDMS carrier fluids by ultrasonication, resulting in magnetic PDMS fluids with potential biomedical applications.    Magnetite particles (100 nm to 1 mm in diameter) were prepared by crystallization from goethite/glycol/water solutions under pressure.  Two methods for particle growth were investigated in which the crystallization medium was varied by adjusting the amount of water or by adding itaconic acid.  Particle surfaces were analyzed by x-ray photoelectron spectroscopy (XPS).  Particles with clean surfaces were coated with carboxylic acid-functionalized poly(e-caprolactone) stabilizers.  Adding itaconic acid to the reactions afforded particles ~100 nm in diameter.  The magnetite particles displayed magnetic hysteresis.  The particles were dispersed into vinyl ester resins by ultrasonication and it was demonstrated that the ~100 nm particles remained dispersed for three days without agitation.  These dispersions have applications in magnetic induction heating for composite repair.  Living polymerizations of hexamethylcyclotrisiloxane were terminated with dimethylchlorosilane, phenylmethylchlorosilane, or diisopropylchlorosilane (DIPCS).  Platinum-catalyzed hydrosilation of the hydrosilane-terminated PDMS with allyloxyethanol afforded a systematic series of hydroxyalkyl-terminated PDMS.  The reactions were successful except for the hydrosilation of the sterically-hindered DIPCS-functionalized PDMS where no reaction was observed.  Hydroxyalkyl-terminated PDMS oligomers were successful in initiating the stannous octoate-catalyzed copolymerization of e-caprolactone, which afforded PDMS-b-PCL diblock copolymers of controlled composition.",
  "description_provenance": [
    "Author Email: krwilso2@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:55Z (GMT). No. of bitstreams: 1 KWODissertation.pdf: 7028664 bytes, checksum: 0699d29ab271c56cfdb0eb61617e381d (MD5)   Previous issue date: 2003-08-21"
  ],
  "handle": "28869",
  "identifier_other": "etd-09052003-105648",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09052003-105648/",
  "identifier_uri": "http://hdl.handle.net/10919/28869",
  "publisher": "Virginia Tech",
  "relation_haspart": "KWODissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "polymers",
    "steric stabilization",
    "magnetic fluids",
    "iron oxides"
  ],
  "title": "Synthesis of Functionalized Poly(dimethylsiloxane)s and the Preparation of Magnetite Nanoparticle Complexes and Dispersions",
  "type": "Dissertation"
}