{
  "contributor_author": "Butcher, Andrew Timothy",
  "contributor_committeechair": "Ollendick, Thomas H.",
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:15:54Z",
  "date_adate": "2001-09-06",
  "date_available": "2014-03-14T20:15:54Z",
  "date_issued": "2000-07-13",
  "date_rdate": "2002-09-06",
  "date_sdate": "2001-09-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Ongoing controversies regarding the clinical and nosological status of ADHD in adults emphasize the need for studies examining whether DSM-IV ADHD symptom dimensions and subtypes identified in research with children are valid for adults.  Firm symptom criteria validated by data from adult samples have not been developed.  Moreover, many clinic-referred adults present with attentional complaints and exhibit symptoms, neurocognitive weaknesses, and secondary problems similar to those seen in ADHD.  However, data are mixed regarding the profile of neurocognitive deficits involved in adult expressions of ADHD, and it is unknown whether patterns of weakness in neurocognitive performance can be identified that reliably discriminate adults with ADHD from those with other neurobehavioral disorders (e.g., learning disabilities, LD).  The purpose of this study was to further (a) evaluate the discriminant validity of DSM-IV ADHD in adults, (b) examine the nature and severity of neurocognitive deficits in adult ADHD, and (c) clarify the diagnostic utility of executive functioning measures among clinic-referred adults. </p><p>Overall, results supported the discriminant validity of adult ADHD, but little support emerged for the existence of separate DSM-IV subtypes.  Importantly, symptom ratings supported the existence of two broad symptom domains consistent with those delineated in DSM-IV.  Moreover, principal components analysis of neuropsychological data identified three dimensions of neurocognitive executive functioning (EF; verbal working memory; sustained intention; and effortful learning) in which ADHD adults (n=35) performed  significantly less well than those who received an LD diagnosis (n=24) or no diagnosis (n=21).  Furthermore, composite scores in these EF domains generated correct classifications that were significantly better than chance when classifying adults that (a) did and did not meet criteria for ADHD, (b) met criteria for ADHD or LD, and (c) met criteria for ADHD or no clinical diagnosis.  Classification results were robust when submitted to a jackknife (leave-one-out) validation procedure.  Finally, results provided general support for the developmental lag hypothesis of frontal-subcortical functioning in ADHD when considered vis-&#224;-vis child ADHD data, but findings also supported the notion that ADHD in adults is associated with continuing dysfunction in specific neuroanatomical pathways believed to subserve executive attentional functions (e.g., dorsolateral prefrontal-subcortical; anterior cingulate-subcortical; orbitofrontal-subcortical). </p>",
  "description_provenance": [
    "Author Email: abutcher@bcm.tmc.edu",
    "Advisor Email: tho@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:54Z (GMT). No. of bitstreams: 2 8_30_01.pdf: 995675 bytes, checksum: 60eb6dff425e1b97080843f8d3470a08 (MD5) 8_30abst.pdf: 10897 bytes, checksum: 6721ba72d852e777b13541da4e00f29e (MD5)   Previous issue date: 2000-07-13"
  ],
  "handle": "28862",
  "identifier_other": "etd-09042001-132640",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09042001-132640/",
  "identifier_uri": "http://hdl.handle.net/10919/28862",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "8_30_01.pdf",
    "8_30abst.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "symptom dimensions",
    "diagnostic utility",
    "adult ADHD",
    "neuropsychological functioning",
    "discriminant validity",
    "secondary impairment"
  ],
  "title": "Symptom Dimensions and Neurocognitive Functioning in Adult ADHD",
  "type": "Dissertation"
}