{
  "contributor_author": "Jo, Chang  Hyun",
  "contributor_committeechair": "Dietrich, Andrea M.",
  "contributor_committeemember": [
    "Edwards, Marc A.",
    "Little, John C.",
    "Duncan, Susan E.",
    "Novak, John T.",
    "Tanko, James M."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:15:54Z",
  "date_adate": "2008-09-24",
  "date_available": "2014-03-14T20:15:54Z",
  "date_issued": "2008-08-26",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-09-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research involved an investigation of the application and reaction mechanisms of UV/H2O2 for the simultaneous removal of regulated halogenated disinfection byproducts (DBPs) and odorous aldehydic algal byproducts in the presence of geosmin and 2-methylisoborneol, which are earthy-musty odorants that commonly occur in drinking water. UV/H2O2 is an expensive advanced oxidation process that is used to successfully control geosmin and 2-methylisoborneol. The aqueous oxidation of odorous aldehydes and halogenated DPBs were compared to that of the earthy-musty odorants and the changes to the sensory properties of the drinking water were examined. Geosmin, 2-methylisoborneol, heptadienal, decadienal, and nonadienal, hexanal, and the two most prevalent classes of DBPs, trihalomethanes (THMs) and haloacetic acids (HAAs) were oxidized by UV photolysis alone and the UV/H2O2 process with 6 mg/L H2O2 and realistic ng/l to μg/L concentrations of the test compounds. <p> The di-, and tri-brominated THMs and HAAs were substantially (80-99%) removed by direct UV photolysis mechanism at the same UV/H2O2 dose required for removing 95% of geosmin and 65% of 2-methylisoborneol with faster reaction rates for the more bromine substituted compounds. The C-Br bond cleavage is the first step of brominated HAAs degradation by UV photolysis, and followed by either of two second steps: reaction with oxygen producing peroxyl radical or interaction with water molecule causing O-H insertion/H-Br elimination.  <p> Trichloromethane and mono-, di-, and tri-chlorinated HAAs were not substantially removed under the same conditions used for the brominated compounds. The principal removal mechanism was by the reaction with hydroxyl radical for the UV/H2O2 process. The second order reaction rate constants were on the order of 106 - 108 M-1 s-1 with faster reaction rates for the less chlorine substituted compounds. Based on the reaction rates, hydrogen and halogen ion balance, and isotope effect, both hydrogen abstraction and electron transfer reaction were involved in the first steps of the chlorinated HAA degradation.  <p> Three odorous aldehydes - heptadienal, decadienal, and nonadienal - were removed faster than geosmin or 2-methylisoborneol, and direct UV photolysis was the principal reaction mechanism for the removal of these unsaturated aldehydes. Hexanal was poorly removed. In sensory tests, new odors such as sweet or chalky odors were produced while the concentration and initial odor intensity of these fishy/grassy-smelling aldehydes were reduced with increasing exposure time to UV/H2O2. Carbonyl compounds were detected as products of the UV photolysis of nonadienal. These carbonyls were not removed by further UV irradiation, which was thought to be partially related with production of new odors. <p> The results indicate that the UV/H2O2 is effective to control both odorous compounds and brominated DBPs. This process can be seasonally applied to control both contaminants especially, in the warm summer when both odorants and DBPs have their higher concentrations. Removal of brominated DBPs can be a significant addition to water utilities that have difficulty in meeting regulatory levels for these highly toxic compounds.  The result on the removal of odorous aldehydes indicate that new types of odors were produced from the oxidation of odorous aldehydes suggesting sensory test coupled with chemical analysis should be considered in designing oxidation process to control recalcitrant odorants.",
  "description_provenance": [
    "Author Email: dream88@vt.edu",
    "Advisor Email: edwardsm@vt.edu",
    "Advisor Email: jcl@vt.edu",
    "Advisor Email: duncans@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:54Z (GMT). No. of bitstreams: 1 ChangHyun_Jo_disseration.pdf: 2728709 bytes, checksum: 390f76bbf3861b7caeef9f55919b509b (MD5)   Previous issue date: 2008-08-26"
  ],
  "handle": "28866",
  "identifier_other": "etd-09042008-150502",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09042008-150502/",
  "identifier_uri": "http://hdl.handle.net/10919/28866",
  "publisher": "Virginia Tech",
  "relation_haspart": "ChangHyun_Jo_disseration.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Disinfection byproduct",
    "Advanced oxidation process",
    "UV/H2O2",
    "Odorant"
  ],
  "title": "Oxidation of Disinfection Byproducts and Algae-related Odorants by UV/H2O2",
  "type": "Dissertation"
}