{
  "contributor_author": "Wu, Jiedi",
  "contributor_committeechair": "Hole, John A.",
  "contributor_committeemember": [
    "Snoke, J. Arthur",
    "Chapman, Martin C.",
    "Spotila, James A.",
    "Zhou, Ying"
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:15:55Z",
  "date_adate": "2008-09-26",
  "date_available": "2014-03-14T20:15:55Z",
  "date_issued": "2008-09-01",
  "date_rdate": "2008-09-26",
  "date_sdate": "2008-09-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The structure of fault zones (FZs) plays an important role in understanding fault mechanics, earthquake rupture and seismic hazards. Fault zone seismic guided waves (GW) carry important information about internal structure of the low-velocity fault damage zone. Numerical modeling of observed FZGWs has been used to construct models of FZ structure. However, the depth extent of the waveguide and the uniqueness of deep structure in the models have been debated. Elastic finite-difference synthetic seismograms were generated for FZ models that include an increase in seismic velocity with depth both inside and outside the FZ. Strong GWs were created from sources both in and out of the waveguide, in contrast with previous homogenous-FZ studies that required an in-fault source to create GW. This is because the frequency-dependent trapping efficiency of the waveguide changes with depth. The near-surface fault structure efficiently guides waves at lower frequencies than the deeper fault. Fault structure at seismogenic depth requires the analysis of data at higher frequencies than the GWs that dominate at the surface. Adapting a two-station technique from surface wave studies, dispersive differential group arrival times between two earthquakes can be used to solve for FZ structures between the earthquakes. This method was tested with synthetic data and shallow events recorded in the SAFOD borehole in the San Andreas Fault. A pair of deep earthquakes recorded in the SAFOD borehole indicate a ~150 m wide San Andreas Fault waveguide with >20% velocity contrast at 10-12 km depth. With additional earthquakes, the full FZ structure at seismogenic depth could be imaged. Subsurface FZ structure can also be derived from a surface source and receiver array analogous to a body-wave refraction survey. Synthetic seismograms for such source-receiver geometry were generated and verified that FZGWs are refracted by the increase in velocity with depth. Synthetic data from a surface array were successfully inverted to derive FZ structure in the subsurface. The new methods presented in this dissertation extend the potential of FZGWs to image deeper FZ structure than has been uniquely constrained in the past.",
  "description_provenance": [
    "Author Email: wujd@vt.edu",
    "Advisor Email: hole@vt.edu",
    "Advisor Email: snoke@vt.edu",
    "Advisor Email: mcc@vt.edu",
    "Advisor Email: spotila@vt.edu",
    "Advisor Email: yingz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:55Z (GMT). No. of bitstreams: 1 Wu_2008_Thesis_IIH.pdf: 17686480 bytes, checksum: a914b95387985e447fc461ea21e1a0a9 (MD5)   Previous issue date: 2008-09-01"
  ],
  "handle": "28873",
  "identifier_other": "etd-09052008-151838",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09052008-151838/",
  "identifier_uri": "http://hdl.handle.net/10919/28873",
  "publisher": "Virginia Tech",
  "relation_haspart": "Wu_2008_Thesis_IIH.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fault zones",
    "guided waves",
    "low-velocity zone",
    "wave propagation",
    "finite difference",
    "velocity structure",
    "dispersion curve",
    "earthquakes",
    "and refraction"
  ],
  "title": "New Constraints on Fault-Zone Structure from Seismic Guided Waves",
  "type": "Dissertation"
}