{
  "contributor_author": "Garg, Akhilesh",
  "contributor_committeechair": "Davis, Richey M.",
  "contributor_committeemember": [
    "Gibson, Harry W.",
    "Rajagopalan, Padmavathy",
    "Walz, John Y.",
    "Heflin, James R."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:15:55Z",
  "date_adate": "2008-09-12",
  "date_available": "2014-03-14T20:15:55Z",
  "date_issued": "2008-08-25",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-09-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Organic materials exhibiting second-order non-linear optical (NLO) properties are a key to the development of advanced electro-optic (EO) modulators used in fiber-optic communications system. This work addresses the fabrication and characterization of organic materials with NLO properties using a self-assembly approach by alternately dipping a charged substrate into positively and negatively charged polymers to build up layer-by-layer (LbL) films.  <p> The effect of solution pH on the formation of LbL films fabricated using the polycation poly(allylamine hydrochloride) (PAH) and the polyanion poly{1-[p-(3â  -carboxy-4â  -hydroxyphenylazo)benzenesulfonamido]-1,2-ethandiyl} (PCBS) was studied using a quartz crystal microbalance with dissipation (QCM-D) monitoring, ellipsometry, absorbance, and second harmonic generation (SHG) measurements. PCBS has an azo-benzene chromophore side group that, when sufficiently oriented, results in measurable SHG. Films of PAH/PCBS fabricated at neutral pH where both PAH and PCBS are highly charged led to thin bilayers, ~1 nm, with a 1:1 molar ratio of PCBS:PAH. This molar ratio was found to be important for long-range polar ordering of PCBS in these films. Increasing the rate of convection was found to reduce the time required for complete adsorption of the polyion. This can have a significant impact on fabrication of films with high bilayer numbers.  <p> A variation of the above technique, which involves adsorbing one of the constituents electrostatically and another covalently, was studied using PAH and a reactive dye, Procion Brown (PB), which has a significantly higher hyperpolarizability than PCBS. It was found that a high pH, ~10.5, was important for achieving covalent attachment of the PB to the underlying PAH films. This resulted in much higher SHG intensities compared to when PB was deposited pH at 8.5-9.5 where the attachment of PB was due to a combination of electrostatic and covalent interactions. QCM-D results for PAH/PB films revealed the presence of a high percentage of unreacted amine groups in the underlying PAH film. A rate constant value for PB attachment step to the underlying PAH was also calculated.  <p> To enhance the SHG intensity of these films, silver nanoprisms were synthesized and deposited onto films using physisorption. An enhancement in the SHG intensity was observed for both PAH/PCBS and PAH/PB films.",
  "description_provenance": [
    "Author Email: akhilesh.garg@gmail.com",
    "Advisor Email: hwgibson@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: padmar@vt.edu",
    "Advisor Email: jywalz@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:55Z (GMT). No. of bitstreams: 1 agarg.pdf: 5351610 bytes, checksum: 75e22252899b832a782a4a917baead81 (MD5)   Previous issue date: 2008-08-25"
  ],
  "handle": "28872",
  "identifier_other": "etd-09052008-134914",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09052008-134914/",
  "identifier_uri": "http://hdl.handle.net/10919/28872",
  "publisher": "Virginia Tech",
  "relation_haspart": "agarg.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Nonlinear Optics (NLO)",
    "Ionically self-assembled multilayer (ISAM)",
    "quartz crystal microbalance (QCM)",
    "layer-by-layer",
    "polyelectrolyte adsorption"
  ],
  "title": "Organic Self-Assembled Films for Nonlinear Optics: Film Structure, Composition and Kinetics of Film Formation",
  "type": "Dissertation"
}