{
  "contributor_author": "Westfall, Sarah Ann",
  "contributor_committeecochair": [
    "Magliaro, Susan G.",
    "Stratton, Richard K."
  ],
  "contributor_committeemember": [
    "Poole, Jon R.",
    "Wildman, Terry M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:15:55Z",
  "date_adate": "2007-09-10",
  "date_available": "2014-03-14T20:15:55Z",
  "date_issued": "2007-09-04",
  "date_rdate": "2007-09-10",
  "date_sdate": "2007-09-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Sarah Westfall - Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>This study examined the influence of a professional development project on the process of change experienced by four veteran physical education teachers. This study was part of a larger study that included all of the physical educators within an entire school district. The information shared here is from a sub-group of teachers who taught primary-age students. The professional development project was content-based, situated in classroom practice, sustained over time, focused on the design and implementation of standards-based content and assessment into physical education classroom practice. A qualitative methodology was used to investigate the process of change experienced by these teachers before, during, and after participating in this project. Findings were based on project conversations, interviews, multiple classroom observations, questionnaires, and document analysis of materials produced during the project and in the classrooms of these four veteran physical education teachers throughout the three-year span of the project. It was found that the participants changed their thoughts and practices regarding content, instruction, and assessment in an interconnected non-linear manner. Changes include: student learning became a predominant instructional goal; standards were viewed as a planning tool; and assessment for and of student learning became important. Perceptions of self as professional changed from feelings of marginalization to being an important and valued member of their schools. Four major conclusions were drawn from the findings about the features of the professional development project. These are: (a) teaching is an isolated enterprise, and the social context of this project supported change; (b) learning to teach as a situated endeavor and by situating the project in the context of classroom physical education supports change; (c) adequate resources to maintain a sustained focus during implementation of practices supported change; (d) incompatibility of teacher knowledge and beliefs with the intentions of the professional development personnel inhibited change. </p> <br> </body> </html>",
  "description_provenance": [
    "Author Email: swestfal@vt.edu",
    "Advisor Email: jpoole@radford.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: wiley@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:55Z (GMT). No. of bitstreams: 1 Westfallfinaletd.pdf: 1062753 bytes, checksum: ee9438a4f72afe938f317fc77a8eba42 (MD5)   Previous issue date: 2007-09-04"
  ],
  "handle": "28870",
  "identifier_other": "etd-09052007-112407",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09052007-112407/",
  "identifier_uri": "http://hdl.handle.net/10919/28870",
  "publisher": "Virginia Tech",
  "relation_haspart": "Westfallfinaletd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "physical education",
    "assessment",
    "professional development"
  ],
  "title": "The Effect of Professional Development on Physical Education Teachers' Use  of Assessment in the Classroom",
  "type": "Dissertation"
}