{
  "contributor_author": "Reich, Allen Z",
  "contributor_committeechair": "McCleary, Ken W.",
  "contributor_committeemember": [
    "Williams, John A.",
    "Sirgy, M. Joseph",
    "Uysal, Muzaffer S.",
    "Khan, Mahmood A."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:15:56Z",
  "date_adate": "2002-11-25",
  "date_available": "2014-03-14T20:15:56Z",
  "date_issued": "2002-04-30",
  "date_rdate": "2003-11-25",
  "date_sdate": "2002-09-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Abstract       Social responsibility and ethics have been shown to have a positive influence on consumer behavior, however the vast majority of related research has measured this relationship indirectly through scenario analysis of hypothetical firms rather than consumers' perceptions of real-world firms. This dissertation focused on a real-world application of the theory.      Each hypothesis that specified a positive relationship was supported. These results show that Brand Social Responsibility Image not only positively influences Brand Loyalty, but also influences the perception of both Product Quality and Service Quality. Concurrently, it was found that both Product and Service Quality Image influenced Brand Loyalty. When controlling for the effect of other variables, some of the relationships proved to be weaker than expected. There were three hypotheses that tested the moderating effect of Inclination to Reward Brand Social Responsibility Image. The moderating influence of Inclination to Reward Brand Social Responsibility Image (RSRI) on the relationships between Brand Social Responsibility Image (BSRI) and Product Quality       Image and between BSRI and Brand Loyalty were greatest for low levels of BSRI. Consumers rated Product Quality Image and Brand Loyalty lowest under conditions of L-BSRI and H-RSRI. Alternatively, when BSRI was high, both high and low treatments of RSRI resulted in similar sample means for both Product Quality Image and Brand Loyalty (i.e., minimal moderating effect).      Inclination to Reward Brand Social Responsibility Image (RSRI) appeared to moderate the relationship between Brand Social Responsibility Image (BSRI) and Service Quality Image at high levels of BSRI. In other words, the perception of service quality was relatively high when both BSRI and RSRI were viewed as being high. Under conditions of H-BSRI and L-RSRI, Service Quality Image was substantially lower. Under conditions of L-BSRI, there was very little difference between L- and H-RSRI.",
  "description_provenance": [
    "Author Email: allen.reich@nau.edu",
    "Advisor Email: McCleary@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:56Z (GMT). No. of bitstreams: 1 Reich.pdf: 1418529 bytes, checksum: 6095ac1a195825e34d2b353226c5bcd4 (MD5)   Previous issue date: 2002-04-30"
  ],
  "handle": "28876",
  "identifier_other": "etd-09062002-160833",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09062002-160833/",
  "identifier_uri": "http://hdl.handle.net/10919/28876",
  "publisher": "Virginia Tech",
  "relation_haspart": "Reich.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Social Responsibility Image",
    "Inclination to Reward Social Responsibility Image",
    "Product and Service Quality",
    "Brand Loyalty"
  ],
  "title": "The Influence of Consumer and Brand Social Responsibility on Brand Loyalty in Quick-Service Restaurants",
  "type": "Dissertation"
}