{
  "contributor_author": "Ma, Guihua",
  "contributor_committeechair": "Love, Nancy G.",
  "contributor_committeemember": [
    "Novak, John T.",
    "Dietrich, Andrea M.",
    "Stevens, Ann M.",
    "Terlesky, Kathy C.",
    "Benoit, Robert E."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:15:58Z",
  "date_adate": "1999-09-08",
  "date_available": "2014-03-14T20:15:58Z",
  "date_issued": "1999-09-02",
  "date_rdate": "2000-09-08",
  "date_sdate": "1999-09-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "BTX biodegradation rates, biochemical expression patterns and microbial ecology were studied under anoxic (denitrifying), anoxic/microaerobic/aerobic, and anoxic/microaerobic conditions in activated sludge sequencing batch reactors. The studies showed that toluene and m-xylene were denitrified via benzoyl-CoA reductase. Although benzene, o-, and p-xylene were recalcitrant under denitrifying conditions, they were biodegraded under microaerobic (< 0.2 mg/L dissolved oxygen) and nitrate or nitrite (NOx)-supplemented microaerobic conditions. The patterns of the specific enzymes associated with BTX biodegradation under microaerobic conditions indicated that the three compounds were metabolized by oxygen-dependent pathways. The expression levels of catechol 1, 2-dioxygenase and catechol 2, 3-dioxygenase under microaerobic conditions were induced to levels as high as under aerobic conditions (> 4 mg/L dissolved oxygen). Benzene, o-, and p-xylene biodegradation rates were twice as fast under NOx-supplemented compared to NOx-free microaerobic conditions, and the specific biodegradation rates under aerobic and NOx-supplemented microaerobic conditions were comparable. 16S rRNA probes targeting representative toluene-degraders were used to investigate the microbial communities in the three sequencing batch reactors by using a dot blot hybridization technique. The hybridization results suggest that multiple redox environments fostered a more diverse microbial community and the activities of the target organisms in the reactors with multiple redox environments were higher than in the single redox reactor. Additionally, facultative toluene-degraders appeared to play a less significant role than the strict anoxic and aerobic toluene-degraders in all three SBRs.",
  "description_provenance": [
    "Author Email: guma@vt.edu",
    "Advisor Email: jtnov@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Advisor Email: ams@vt.edu",
    "Advisor Email: rbenoit@vt.edu",
    "Advisor Email: nlove@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:58Z (GMT). No. of bitstreams: 3 vita.pdf: 2326 bytes, checksum: 2370c2ec3185f017bbfd24140668e51d (MD5) appendix.pdf: 483115 bytes, checksum: 3e249e2c4a678c63e880cc63a43828ac (MD5) dissertation.pdf: 486437 bytes, checksum: 1df18eb1c67e6028a12c2eeb909bf9f1 (MD5)   Previous issue date: 1999-09-02"
  ],
  "handle": "28883",
  "identifier_other": "etd-090699-164851",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-090699-164851/",
  "identifier_uri": "http://hdl.handle.net/10919/28883",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "vita.pdf",
    "appendix.pdf",
    "dissertation.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "16S rRNA",
    "BTX",
    "microbial activity",
    "anoxic",
    "enzymes",
    "dot blot hybridization",
    "standard blots",
    "energy balance",
    "redox",
    "aerobic",
    "microaerobic",
    "probe"
  ],
  "title": "The Kinetics, Biochemical Patterns, and Microbial Ecology in Multiredox (Anoxic, Microaerobic, Aerobic) Activated Sludge Systems Treating BTX Containing Wastewater",
  "type": "Dissertation"
}