{
  "contributor_author": "McNeill, Andrea Lynn",
  "contributor_committeecochair": [
    "Cennamo, Katherine S.",
    "Doolittle, Peter E."
  ],
  "contributor_committeemember": [
    "Hicks, David",
    "Burton, John K.",
    "Holmes, Glen A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:15:58Z",
  "date_adate": "2004-09-13",
  "date_available": "2014-03-14T20:15:58Z",
  "date_issued": "2004-08-24",
  "date_rdate": "2007-09-13",
  "date_sdate": "2004-09-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Research in the area of multimedia instruction has yielded results that indicate that learning is better when verbal information is presented auditorily instead of visually (i.e. modality effect) and when redundant on-screen text is removed from the instructional environment (i.e. redundancy effect). The present study aimed to extend these findings by exploring the effects of presentation modality and redundancy of verbal information on students' ability to apply and recall a historical inquiry strategy.<p>  Fifty-six students were randomly assigned to three treatment groups, which differed according to the presentation mode combination used to present the strategy instruction. Specifically, students received the instruction either as animation and narration, animation and text, or animation, narration, and text. The students were engaged in a multimedia strategy intervention for a total of five days, for approximately 25 minutes a day. Three strategy application tests (i.e., pre-test, post-test, maintenance test) and a recall test were used to measure the students' learning.<p>  Data attained through the strategy application tests and recall tests were analyzed using Analysis of Variance (ANOVA) procedures. The results of the study revealed significant differences in the training main effects analysis indicating that strategy instruction can be effectively provided in a multimedia learning environment. However, no significant differences were found for the modality and redundancy main effects indicating that there was no difference in strategy application or recall between the groups. Although the results did not provide the statistical significance that supports the literature on the modality and redundancy effects, the implications of the findings of the research provide several viable areas for future research.",
  "description_provenance": [
    "Author Email: angrove@vt.edu",
    "Advisor Email: hicks@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: cennamo@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: holmesg@wssu.edu",
    "Made available in DSpace on 2014-03-14T20:15:58Z (GMT). No. of bitstreams: 1 etd.pdf: 913875 bytes, checksum: 0ee92e76bb3cc7d6a15f5de54784b383 (MD5)   Previous issue date: 2004-08-24"
  ],
  "handle": "28888",
  "identifier_other": "etd-09072004-181427",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09072004-181427/",
  "identifier_uri": "http://hdl.handle.net/10919/28888",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "strategy instruction",
    "redundancy effect",
    "modality effect",
    "multimedia",
    "strategy"
  ],
  "title": "The Effects of Training, Modality, and Redundancy on the Development of a Historical Inquiry Strategy in a Multimedia Learning Environment",
  "type": "Dissertation"
}