{
  "contributor_author": "Contreras Rojas, Andrea Paz",
  "contributor_committeechair": "Schurig, Gerhardt G.",
  "contributor_committeemember": [
    "Vemulapalli, Ramesh",
    "Falkinham, Joseph O. III",
    "Ahmed, S. Ansar",
    "Sriranganathan, Nammalwar",
    "Boyle, Stephen M."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:15:58Z",
  "date_adate": "2004-09-22",
  "date_available": "2014-03-14T20:15:58Z",
  "date_issued": "2004-07-30",
  "date_rdate": "2006-09-22",
  "date_sdate": "2004-09-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Brucella abortus (BA) are gram-negative, facultative intracellular bacteria that cause abortions in cattle and debilitating illness in humans. The US is now virtually free of bovine brucellosis, but the disease is endemic in wildlife. The official brucellosis vaccine in the US is strain RB51 (RB51). It elicits protective cell-mediated immunity (CMI) against BA infections.  \tMycobacterium avium subspecies paratuberculosis (MAP) causes paratuberculosis in ruminants. It is a slow growing intracellular parasite that requires CMI for its control, belongs to the genus Mycobacterium, and is closely related to M. avium avium (MA).  \tUsing RB51 as a vector that induces strong protective CMI may be useful to protect against MAP if it expresses MAP protective antigens. Therefore, MAP 85A and 35kDa proteins were expressed at low levels in RB51, and the immune responses elicited by these vaccines in BALB/c mice were evaluated. Strong anti-Brucella immunity was generated, but the anti-mycobacterial response was low. To evaluate protective efficacy, a BALB/c model using MA was developed. When mice were challenged with MA, protection was obtained in some experiments but was inconsistent. This may be due to the low expression of MAP antigens in RB51. Another objective was to evaluate the effect of an ongoing Brucella-infection on the efficacy of RB51 vaccination, and whether vaccination of already infected animals could have a curative effect. Mice acutely or chronically infected with virulent BA, rapidly cleared the RB51 vaccine organisms, but there was no significant decrease in the number of virulent BA.  Brucella spp. have been developed as biological weapons, but there are no vaccines to protect humans. The development of a very attenuated protective vaccine is necessary to prevent human infections, as well as to protect wildlife. To generate such a vaccine, RB51 based vaccines were irradiated to render them non-replicative, but metabolically active. We demonstrated that in general, irradiated and non-irradiated RB51 vaccines remain protective at levels similar to those elicited by the live vaccines. Therefore, irradiation of strain RB51 is an effective means of attenuating the strain without affecting its protective characteristics, and could eventually be used as a vaccine for wildlife and humans.",
  "description_provenance": [
    "Author Email: acontrer@vt.edu",
    "Advisor Email: rvemulap@purdue.edu",
    "Advisor Email: jofiii@vt.edu",
    "Advisor Email: gschurig@vt.edu",
    "Advisor Email: ansrahmd@vt.edu",
    "Advisor Email: nathans@vt.edu",
    "Advisor Email: smboyle@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:58Z (GMT). No. of bitstreams: 1 DissertationAndreaContrerasV3.pdf: 1312366 bytes, checksum: 4061f4023d746a4be75f74b3d5643b2d (MD5)   Previous issue date: 2004-07-30"
  ],
  "handle": "28887",
  "identifier_other": "etd-09072004-141252",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09072004-141252/",
  "identifier_uri": "http://hdl.handle.net/10919/28887",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationAndreaContrerasV3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "vaccine",
    "therapeutic",
    "RB51",
    "Brucella",
    "overexpression",
    "cytokine",
    "curative",
    "gamma irradiation",
    "cell mediated immunity",
    "recombinant",
    "Mycobacterium",
    "paratuberculosis",
    "avium."
  ],
  "title": "Brucella abortus RB51 vaccine: Testing its Spectrum of Protective and Curative Characteristics",
  "type": "Dissertation"
}