{
  "contributor_author": "Goodwin, Stephanie Kay",
  "contributor_committeechair": "Hosig, Kathryn Wright",
  "contributor_committeemember": [
    "Redican, Kerry J.",
    "You, Wen",
    "Schroeder, Aaron D.",
    "Serrano, Elena L."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:15:57Z",
  "date_adate": "2011-09-23",
  "date_available": "2014-03-14T20:15:57Z",
  "date_issued": "2011-09-02",
  "date_rdate": "2011-09-23",
  "date_sdate": "2011-09-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Since many adolescents experience the transition to young adulthood in college, the university health environment could play a significant role in addressing the current rise in chronic disease and obesity epidemic. The University Health Index for Nutrition and Physical Activity (UHI) tool, guided by the Center for Disease Control and Prevention (CDC) K-12 School Health Index, was developed to evaluate the associations between the university health environment and student health outcomes related to nutrition, physical activity, and weight. Several studies were conducted to examine what university characteristics are most strongly associated with college student health habits related to weight, nutrition, and physical activity behaviors. These studies culminated in a study to develop and validate the UHI. A request soliciting participation in the completion of the UHI was posted on the American College Health Association (ACHA) listserve. The final dataset used for analysis included 13 universities (N = 19) with a total of 9,460 National College Health Assessment (NCHA) student participants. Data were analyzed using Mixed-effects REML regression model adjusting for clustering effects, with statistical significance set at p < 0.05 and trends set a p < 0.10. Data were analyzed to determine associations between the total UHI score, individual module scores, and individual components of each module with student outcomes from the NCHA data (fruit/vegetable intake per day, days per week of aerobic and strength physical activity, and body mass index: BMI; kg/m2 calculated from self-reported height and weight). Total UHI score was not significantly associated with outcome variables related to BMI, nutrition, or physical activity. The total health promotion module, however, was associated with vigorous physical activity (coefficient = 0.095; SE = 0.048; p = 0.046) and the built environment was associated with moderate physical activity (coefficient = 0.029; SE = 0.017; p = 0.096) and with high fruit and vegetable intake (coefficient = 0.021; SE = 0.011; p = 0.061). Individual questions related to recreational sports and fitness and nutrition and/or weight management counseling were associated with outcome variables as well. Measures for physical activity are better developed than for nutrition as there was only one nutrition question available with limited utility in terms of data analysis to test the UHI. Studying the university health environment and college studentsâ   health habits related to weight, nutrition, and physical activity is multifaceted and challenging. Unlike the K-12 school system, there is not a central university entity with jurisdiction over health-related student issues. Instead, health-related student issues and services are the responsibility of a variety of departments at a university and it is difficult to realize the complete university health environment. Results of this research can be used to refine future versions of the UHI and to continue to investigate the university characteristics that are most strongly associated with specific student health behaviors and outcomes related to nutrition, physical activity, and weight.",
  "description_provenance": [
    "Author Email: skgoodwin@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: wenyou@vt.edu",
    "Advisor Email: aaron.schroeder@vt.edu",
    "Advisor Email: serrano@vt.edu",
    "Advisor Email: khosig@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:57Z (GMT). No. of bitstreams: 1 Goodwin_SK_D_2011.pdf: 5762102 bytes, checksum: 660f99ea7fa0984920ec0913599eb11c (MD5)   Previous issue date: 2011-09-02"
  ],
  "handle": "28881",
  "identifier_other": "etd-09062011-145745",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09062011-145745/",
  "identifier_uri": "http://hdl.handle.net/10919/28881",
  "publisher": "Virginia Tech",
  "relation_haspart": "Goodwin_SK_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "physical activity",
    "weight",
    "university health environment",
    "nutrition",
    "College students"
  ],
  "title": "Development of the University Health Index to Examine the Interface between Campus Environment and Nutrition, Physical Activity, and Weight in College Students",
  "type": "Dissertation"
}