{
  "contributor_author": "Dobbins, Thomas Roy",
  "contributor_committeechair": "Camp, William G.",
  "contributor_committeemember": [
    "Stewart, Daisy L.",
    "Hillison, John H.",
    "Barrett, J. David",
    "Wehrenberg, William",
    "White, John M."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:15:59Z",
  "date_adate": "1999-09-09",
  "date_available": "2014-03-14T20:15:59Z",
  "date_issued": "1999-08-20",
  "date_rdate": "2000-09-09",
  "date_sdate": "1999-09-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Clinical Experiences for Agricultural Teacher Education Programs in North Carolina, South Carolina, and Virginia.   ABSTRACT   The purpose of this study was to build a task list for the clinical experience program, both early field and student teaching, for the agricultural teacher education programs in North Carolina, South Carolina, and Virginia. The objectives were:  (1) compile a list of clinical experiences, both early field and student teaching, that currently are provided in the clinical experiences for students of agricultural education in three-selected teacher education programs, and (2) use an expert panel to determine what should be included in early field experiences and student teaching experiences for students enrolled in the agricultural teacher education program. A modified Delphi technique was used to collect data via three questionnaires. Data were analyzed using mean scores and standard deviations of tasks rated on a five point Likert-type scale. Those tasks that the panelists rated with a standard deviation of less than or equal to one were considered to have met consensus.  The population for this study consisted of agriculture teachers, secondary school administrators, agricultural education field staff, and agricultural education teacher educators from North Carolina, South Carolina, and Virginia. Thirty-four Delphi panel members were purposively selected from the population. Thirty-one panel members responded to Round I, 33 panel members responded to Round II, and 29 responded to Round III yielding an overall  response rate of 92%. This researcher asked the Delphi panel members to rate each task on a five-point Likert type scale, 1 = strongly disagree, 2 = disagree, 3 = not sure, 4 = agree, and 5 = strongly agree. The study used mean scores and standard deviations to analyze the results. Consensus was met if the standard deviation of a task was equal to or less than one. Rounds I, II, and III resulted in 102 tasks for early field and student teaching experiences that met consensus.  Based on the findings, the researcher developed a task list for early field experiences and student teaching experiences to be considered for use by the agricultural education programs in the three cooperating states. The task list developed is a very comprehensive list that relates to every aspect of clinical experiences.",
  "description_provenance": [
    "Author Email: tdbbns@clemson.edu",
    "Advisor Email: wgcamp@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: hillison@vt.edu",
    "Advisor Email: davebarr@vt.edu",
    "Advisor Email: bwhrnbr@clemson.edu",
    "Advisor Email: jmwhite@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:59Z (GMT). No. of bitstreams: 3 Dobbins3.pdf: 66729 bytes, checksum: f6f2ba75b37cc681926dc8faf2c3640f (MD5) Dobbins2.pdf: 36071 bytes, checksum: 6c99bbebc2c2d63f7d6916fa1c24a653 (MD5) DOBBINS1.PDF: 287551 bytes, checksum: 1752f998e054c8b2affed64037cc1dc9 (MD5)   Previous issue date: 1999-08-20"
  ],
  "handle": "28892",
  "identifier_other": "etd-090799-094331",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-090799-094331/",
  "identifier_uri": "http://hdl.handle.net/10919/28892",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dobbins3.pdf",
    "Dobbins2.pdf",
    "DOBBINS1.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "agricultural education",
    "early field experiences",
    "clinical experiences",
    "student teaching"
  ],
  "title": "Clinical Experiences for Agricultural Teacher Education Programs in North Carolina, South Carolina, and Virginia.",
  "type": "Dissertation"
}