{
  "contributor_author": "Hickner, Michael Anthony",
  "contributor_committeecochair": [
    "McGrath, James E.",
    "Wilkes, Garth L."
  ],
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Zawodzinski, Thomas A.",
    "Baird, Donald G."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:15:59Z",
  "date_adate": "2003-09-12",
  "date_available": "2014-03-14T20:15:59Z",
  "date_issued": "2003-08-27",
  "date_rdate": "2004-09-12",
  "date_sdate": "2003-09-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Transport properties of novel sulfonated wholly aromatic copolymers and the state-of-the-art poly(perfluorosulfonic acid) copolymer membrane for fuel cells, Nafion, were compared.  Species transport (protons, methanol, water) in hydrated membranes was found to correspond with the water-self diffusion coefficient as measured by pulsed field gradient nuclear magnetic resonance (PFG NMR), which was used as a measure of the state of absorbed water in the membrane.  Generally, transport properties decreased in the order Nafion > sulfonated poly(arylene ether sulfone) > sulfonated poly(imide). The water diffusion coefficients as measured by PFG NMR decreased in a similar fashion indicating that more tightly bound water existed in the sulfonated poly(arylene ether sulfone) (BPSH) and sulfonated poly(imide) (sPI) copolymers than in Nafion.    Electro-osmotic drag coefficient (ED number of water molecules conducted through the membrane per proton) studies confirmed that the water in sulfonated wholly aromatic systems is more tightly bound within the copolymer morphology.  Nafion, with a water uptake of 19 wt % (λ = 12, where λ = N H2O/SO3H) had an electro-osmotic drag coefficient of 3.6 at 60°C, while BPSH 35 had an electro-osmotic drag coefficient of 1.2 and a water uptake of 40 wt % (λ = 15) under the same conditions.    Addition of phosphotungstic acid decreased the total amount of water uptake in BPSH/inorganic composite membranes, but increased the fraction of loosely bound water.  Zirconium hydrogen phosphate/BPSH hybrids also showed decreased bulk water uptake, but contrary to the results with phosphotungstic acid, the fraction of loosely bound water was decreased.  This dissimilar behavior is attributed to the interaction of phosphotungstic acid with the sulfonic acid groups of the copolymer thereby creating loosely bound water.  No such interaction exists in the zirconium hydrogen phosphate materials.  The transport properties in these materials were found to correspond with the water-self diffusion coefficients.  Proton exchange membrane (PEM) transport properties were also found to be a function of the molecular weight of sulfonated poly(arylene thioether sulfone) (PATS).  Low molecular weight (IV ~ 0.69) copolymers absorbed more water on the same ion exchange capacity basis than the high molecular weight copolymers (IV ~ 1.16).  Surprisingly, protonic conductivity of the two series was similar.  Moreover, the methanol permeability of the low molecular weight copolymers was increased, resulting in lower membrane selectivity and decreased mechanical properties.    The feasibility of converting the novel sulfonated wholly aromatic systems to membrane electrode assemblies (MEAs) for use in fuel cells was studied by comparing free-standing membrane properties to those of MEAs assembled with standard Nafion electrodes.  Significantly higher interfacial resistance was measured for BPSH samples.  Fluorine was introduced into the copolymer backbone by utilizing bisphenol-AF in the copolymer synthesis (6F copolymers).  These 6F copolymers showed a markedly lower interfacial resistance with Nafion electrodes and correspondingly greater direct methanol fuel cell performance.  It was proposed that the addition of the hexafluoro groups increased the compatibility of the PEM with the highly fluorinated Nafion electrode.",
  "description_provenance": [
    "Author Email: mhickner@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: taz5@po.cwru.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:59Z (GMT). No. of bitstreams: 1 hicknerdissertation.pdf: 2182438 bytes, checksum: 11d1f7353fababcc422beed5806eae83 (MD5)   Previous issue date: 2003-08-27"
  ],
  "handle": "28895",
  "identifier_other": "etd-09082003-121021",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09082003-121021/",
  "identifier_uri": "http://hdl.handle.net/10919/28895",
  "publisher": "Virginia Tech",
  "relation_haspart": "hicknerdissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "state of water",
    "electro-osmotic drag",
    "transport properties",
    "proton exchange membrane",
    "fuel cell",
    "direct methanol"
  ],
  "title": "Transport and Structure in Fuel Cell Proton Exchange Membranes",
  "type": "Dissertation"
}