{
  "contributor_author": "Hammerand, Daniel C.",
  "contributor_committeechair": "Kapania, Rakesh K.",
  "contributor_committeemember": [
    "Johnson, Eric R.",
    "Batra, Romesh C.",
    "Dillard, David A.",
    "Plaut, Raymond H.",
    "Inman, Daniel J."
  ],
  "contributor_department": "Aerospace and Ocean Engineering",
  "date_accessioned": "2014-03-14T20:15:59Z",
  "date_adate": "1999-09-09",
  "date_available": "2014-03-14T20:15:59Z",
  "date_issued": "1999-08-25",
  "date_rdate": "2000-09-09",
  "date_sdate": "1999-09-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Over the past several decades, the use of composite materials has grown considerably.  Typically, fiber-reinforced polymer-matrix composites are modeled as being linear elastic.  However, it is well-known that polymers are viscoelastic in nature. Furthermore, the analysis of complex structures requires a numerical approach such as the finite element method.  In the present work, a triangular flat shell element for linear elastic composites is extended to model linear viscoelastic composites. Although polymers are usually modeled as being incompressible, here they are modeled as compressible.  Furthermore, the macroscopic constitutive properties for fiber-reinforced composites are assumed to be known and are not determined using the matrix and fiber properties along with the fiber volume fraction. Hygrothermo-rheologically simple materials are considered for which a change in the hygrothermal environment results in a  horizontal shifting of the relaxation moduli curves on a log time scale, in addition to the usual hygrothermal loads. Both the temperature and moisture are taken to be prescribed. Hence, the heat energy generated by the viscoelastic deformations is not considered. <p> When the deformations and rotations are small under an applied load history, the usual engineering stress and strain measures can be used and the time history of a viscoelastic  deformation process is determined using the original geometry  of the structure.    If, however, sufficiently large loads are applied, the deflections and rotations will be large leading to changes in the  structural stiffness  characteristics and possibly the internal loads carried throughout the structure. Hence, in such a case, nonlinear effects must be taken into account and the appropriate stress and strain measures must be used.  Although a geometrically-nonlinear finite element code could always be used to compute geometrically-linear deformation processes, it is inefficient to use such a code for small deformations, due to the continual generation of the  assembled internal load vector, tangent stiffness matrix, and  deformation-dependent external load vectors.   Rather, for small deformations, the appropriate deformation-independent stiffness matrices and  load vectors to be used  for all times can be determined once at the start of the analysis.  Of course, the time-dependent viscoelastic effects need to be correctly taken into account in both types of analyses. The present work details both geometrically-linear and nonlinear triangular flat shell formulations for linear viscoelastic composites. The accuracy and capability of the formulations are shown through a range of numerical examples involving beams,  rings, plates, and shells.",
  "description_provenance": [
    "Author Email: dhammer@aoe.vt.edu",
    "Advisor Email: erjohns4@vt.edu",
    "Advisor Email: rbatra@vt.edu",
    "Advisor Email: dillard@vt.edu",
    "Advisor Email: rplaut@vt.edu",
    "Advisor Email: dinman@vt.edu",
    "Advisor Email: rkapania@vt.edu",
    "Made available in DSpace on 2014-03-14T20:15:59Z (GMT). No. of bitstreams: 1 title.pdf: 1861948 bytes, checksum: aefbfd4853c8f0c44669439474d468ac (MD5)   Previous issue date: 1999-08-25"
  ],
  "handle": "28893",
  "identifier_other": "etd-090799-161241",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-090799-161241/",
  "identifier_uri": "http://hdl.handle.net/10919/28893",
  "publisher": "Virginia Tech",
  "relation_haspart": "title.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "shells",
    "composites",
    "plates",
    "finite element method",
    "viscoelasticity"
  ],
  "title": "Geometrically-Linear and Nonlinear Analysis of Linear Viscoelastic Composites Using the Finite Element Method",
  "type": "Dissertation"
}