{
  "contributor_author": "Miller, Gwen Elizabeth Dudginski",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Cash, Carol S.",
    "Wheeler, Thelma D.",
    "Glenn, William J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:16:03Z",
  "date_adate": "2008-10-14",
  "date_available": "2014-03-14T20:16:03Z",
  "date_issued": "2008-09-05",
  "date_rdate": "2009-10-14",
  "date_sdate": "2008-09-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT  \tThe purpose of this study was to determine in what ways the menteesâ   behavior changed during a formal mentoring and coaching program conducted during the 2006-2007 school year in Virginia and what accounted for the change(s). Because a sharp increase in responsibilities in recent years has made the job of the principal more demanding and stressful, it is imperative that principals get help from a mentor coach to sharpen the leadership skills that they need to be successful. Information obtained in this study pertaining to a formal mentoring and coaching program and whether or not it changed the leadership behavior of mentees can be used to develop future mentoring and coaching programs for high school principals. \tThis qualitative study took a collective case study approach that focused on collecting information regarding the leadership skills of high school principals who had worked with a mentor coach during the 2006-2007 school year. This study involved six high school principals who formed three dyads during the formal mentoring and coaching program. Triangulation of data sources included interviews with participants, data from the 2006/2007 and 2007/2008 National Association of Secondary School Principals (NASSP) 360 Self and Observer Assessments, reflection log protocols of the mentor coaches, and mentee shadowing protocols. Data were analyzed using a logical analysis approach which included coding data, finding patterns, labeling themes, and developing category systems. Results of this study were presented as categories and discussed using both the conceptual framework and the 10 leadership skill dimensions identified by NASSP and closely related to the standards endorsed by the Interstate School Leaders Licensure Consortium (ISLLC). \tThis collective case study reveals that the three mentees who participated in a formal mentoring and coaching program in Virginia experienced change, meaning improvement, in the following eight of the ten NASSP leadership skill dimensions: (a) setting leadership direction, (b) teamwork, (c) sensitivity, (d) organizational ability, (e) judgment, (f) results orientation, (g) developing others, and (h) understanding own strengths and weaknesses. Two mentees improved slightly and one not at all in the two leadership skill dimensions, oral communication and written communication. The history of the mentee, some characteristics of the mentor coaches, and several variables pertaining to the administrative mentoring and coaching program accounted for their change in leadership behavior.",
  "description_provenance": [
    "Author Email: gmiller3@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: twheeler@richmond.edu",
    "Advisor Email: wglenn@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:03Z (GMT). No. of bitstreams: 1 GwenMillerDissertation.pdf: 698745 bytes, checksum: 6e97887499399f8bef00211a2ca7a809 (MD5)   Previous issue date: 2008-09-05"
  ],
  "handle": "28906",
  "identifier_other": "etd-09082008-215310",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09082008-215310/",
  "identifier_uri": "http://hdl.handle.net/10919/28906",
  "publisher": "Virginia Tech",
  "relation_haspart": "GwenMillerDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "principals",
    "mentor coaches",
    "mentors",
    "mentees"
  ],
  "title": "A Cross-case Analysis of Mentee Change in Leadership Behavior during a Mentoring and Coaching Program in Virginia",
  "type": "Dissertation"
}