{
  "contributor_author": "Jain, Vaibhav",
  "contributor_committeechair": "Heflin, James R.",
  "contributor_committeemember": [
    "Richey M. Davis",
    "Soghomonian, Victoria",
    "Gibson, Harry W."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:16:03Z",
  "date_adate": "2009-09-25",
  "date_available": "2014-03-14T20:16:03Z",
  "date_issued": "2009-09-02",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-09-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This thesis presents work done to improve the switching speed and contrast performance of electrochromic devices. Layer-by-Layer (LbL) assembly was used to deposit thin electrochromic films of materials ranging from organic, inorganic, conducting polymers, etc.  The focus was on developing new materials with high contrast and long lifecycles.  A detailed switching-speed study of solid-state EC devices of already-developed (PEDOT (Poly(3,4-ethylenedioxythiophene)), polyviologen, inorganic) materials and some new materials (Prodot-Sultone) was performed. Work was done to achieve the optimum thickness and number of bilayers in LbL films resulting in high-contrast and fast switching. Device sizes were varied for comparison of the performance of the lab-made prototype device with the commercially available â  small pixelâ   size displays. Symmetrical EC devices were fabricated and tested whenever conducting polymers are used as an EC material. This symmetrical configuration utilizes conducting polymers as an electroactive layer on each of two ITO-coated substrates; potential is applied to the two layers of similar conducting polymers and the device changes color from one redox state to another. This method, along with LbL film assembly, are the main factors in the improvement of switching speed results over already-published work in the literature. PEDOT results show that EC devices fabricated by LbL assembly with a switching speed of less than 30 ms make EC flat-panel displays possible by adjusting film thickness, device size, and type of material. The high contrast value (84%) for RuP suggests that its LbL films can be used for low-power consumption displays where contrast, not fastest switching, is the prime importance.   In addition to the electrochromic work, this thesis also includes a section on the application of LbL assembly in fabricating electromechanical bending actuators.  For bending actuators based on ionic polymer metal composites (IPMCs), a new class of conductive composite network (CNC) electrode was investigated, based on LbL self-assembled multilayers of conductive gold (Au) nanoparticles. The CNC of an electromechanical actuator fabricated with 100 bilayers of polyallylamine hydrochloride (PAH)/Au NPs exhibits high strain value of 6.8% with an actuation speed of 0.18 seconds for a 26 Âµm thick IPMC with 0.4 Âµm thick LbL CNCs under 4 volts.",
  "description_degree": "PhD",
  "description_provenance": [
    "Author Email: jainv@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: soghomon@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: hwgibson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:03Z (GMT). No. of bitstreams: 1  VJPhDthesis.pdf: 11254791 bytes, checksum: 311b72a3a7fc06daaf7ad6c0d0f761bf (MD5)    Previous issue date: 2009-09-02"
  ],
  "handle": "28907",
  "identifier_other": "etd-09082009-103552",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09082009-103552/",
  "identifier_uri": "http://hdl.handle.net/10919/28907",
  "publisher": "Virginia Tech",
  "relation_haspart": "VJPhDthesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Layer-by-Layer (LbL)",
    "Polyviologen",
    "Ionic Polymer Metal Composite (IPMC)",
    "Switching speed",
    "Electrochromic (EC)",
    "actuators",
    "PEDOT"
  ],
  "title": "Applications of Layer-by-Layer Films in Electrochromic Devices and Bending Actuators",
  "type": "Dissertation"
}