{
  "contributor_author": "Brown, Rebecca Huyck",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Moore, Robert B.",
    "Riffle, Judy S.",
    "Tanko, James M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:16:03Z",
  "date_adate": "2009-09-29",
  "date_available": "2014-03-14T20:16:03Z",
  "date_issued": "2009-08-26",
  "date_rdate": "2012-05-08",
  "date_sdate": "2009-09-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Use of a mixed triisobutylaluminum/1,1-diphenylhexyllithium intiator enabled the anionic polymerization of methyl methacrylate at room temperature, resulting in narrow molecular weight distributions and syndiorich structures.  Polymerizations were controlled above Al:Li = 2, and control significantly decreased at elevated temperatures above 25 Â°C.  A significant increase in Tg with increasing control of syndiotacticity demonstrated the ability to tailor polymer properties using this technique.  Analysis with MALDI-TOF/TOF spectroscopy revealed the dominance of a back-biting side reaction at elevated temperatures.<p> Hydroxy-functional random and block copolymers of n-butyl acrylate (nBA) and 2-hydroxyethyl acrylate were synthesized using nitroxide mediated polymerization.  Controlled polymerization was demonstrated, resulting in narrow polydispersities and linear molecular weight vs. conversion plots.  In situ FTIR spectroscopy monitored the polymerizations and revealed pseudo first order rate kinetics for random copolymerizations.  Protection of the hydroxyl using trimethylsilyl chloride alleviated isolation issues of amphiphilic polymer products. For the first time zwitterion-containing copolymers were electrospun to form nanoscale fibers with diameters as low as 100 nm.  Free radical copolymerization of nBA and sulfobetaine methacrylamide produced zwitterionic copolymers with 6-13 mol % betaine.  Dynamic mechanical analysis revealed a rubbery plateau and biphasic morphology similar to ionomers.  Electrospinning from chloroform/ethanol solutions (80/20 v/v) at 2-7 wt % afforded polymeric fibers at viscosities below 0.02 Paâ ¢s, which is the lowest viscosity observed for fiber formation in our laboratories.  We hypothesized that intermolecular interactions rather than chain entanglements dominated the electrospinning process.     <p> Solution rheology of zwitterionic copolymers containing 6 and 9 mol % sulfobetaine methacrylate functionality revealed two concentration regimes with a boundary at ~1.5 â   2.0 wt %, regardless of molecular weight.  This transition occurred at an order of magnitude lower specific viscosity than the entanglement concentration (Ce) for poly(nBA), and correlated to the onset of fiber formation in electrospinning.  Comparison to existing models for polymer solution dynamics showed closest agreement to Rubinsteinâ  s theory for associating polymers, in support of our hypothesis that zwitterionic interactions dominate solution dynamics.<p> The effect of ionic liquid (IL) uptake on mechanical properties and morphology of zwitterionic copolymers was explored using 1-ethyl-3-methylimidazolium ethylsulfate (EMIm ES).  Dynamic mechanical analysis and impedance spectroscopy revealed a significant change in properties above a critical uptake of ~10 wt % IL.  X-ray scattering revealed a significant swelling of the ionic domains at 15 wt % IL, with a 0.3 nm-1 shift in the ionomer peak to lower scattering vector.  Results indicated the water-miscible IL preferentially swelled ionic domains of zwitterionic copolymers.",
  "description_provenance": [
    "Author Email: rhuyck@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: rbmoore3@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: jtanko@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:03Z (GMT). No. of bitstreams: 1 Brown_RH_D_2009.pdf: 4692457 bytes, checksum: 62eda135adb380831461b41fc34153c3 (MD5)   Previous issue date: 2009-08-26"
  ],
  "handle": "28908",
  "identifier_other": "etd-09082009-185912",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09082009-185912/",
  "identifier_uri": "http://hdl.handle.net/10919/28908",
  "publisher": "Virginia Tech",
  "relation_haspart": "Brown_RH_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ionomer",
    "sulfobetaine",
    "zwitterion",
    "nitroxide mediated polymerization",
    "n-butyl acrylate",
    "living polymerization",
    "organoaluminum",
    "electrospinning",
    "solution rheology"
  ],
  "title": "Effects of Functionality and Charge in the Design of Acrylic Polymers",
  "type": "Dissertation"
}