{
  "contributor_author": "Johnson, James Matthew",
  "contributor_committeechair": "Walters, Jeffery R.",
  "contributor_committeemember": [
    "Haig, S. M.",
    "Greenberg, Russell S.",
    "Phillips, John B."
  ],
  "contributor_department": "Biological Sciences",
  "date_accessioned": "2014-03-14T20:16:02Z",
  "date_adate": "2006-11-30",
  "date_available": "2014-03-14T20:16:02Z",
  "date_issued": "2006-08-07",
  "date_rdate": "2006-11-30",
  "date_sdate": "2006-09-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "I conducted demographic and behavioral studies of Western Sandpipers (Calidris mauri) breeding on the Yukon-Kuskokwim River Delta, Alaska (1998-2005).  In chapter one, I estimated apparent annual survival (product of true survival and site fidelity) while correcting for the probability of encounter for 237 males and 296 females.  Overall return rates (individual returned to the site in a subsequent season) were lower for females (40%) than males (65%), as was apparent annual survival (&#177; SE, females = 0.65 &#177; 0.05, males = 0.78 &#177; 0.03), and encounter rate (females = 0.51 &#177; 0.07, males = 0.74 &#177; 0.04).  In chapter two, I examined the effects of mate and site fidelity on nesting success (N = 430 nests).  Annual divorce rate ranged between 37-83%, with 17-63% of pairs reuniting annually. Reuniting pairs initiated clutches earlier than newly formed pairs, and clutches that were initiated early in the season had higher nest success rates compared to late-season nests.  When I controlled for clutch-initiation date, nests tended by individuals with prior breeding-site experience had higher daily survival rates compared to birds breeding at the site for the first time.  The effect of site experience was greater for males than females.  In chapter 3, I reported that Western Sandpipers exhibited aggregated breeding behavior on a 36 ha plot.  Breeding aggregations occurred when dominant and/or older individuals excluded younger, subordinate individuals from preferred habitat.  The pattern of habitat occupancy conformed to an ideal despotic distribution with aggregated nesting birds in less preferred habitat experiencing lower reproductive success.  In chapter 4, I described and demonstrated the form and function of parent-chick communication in the Western Sandpiper.  Through experimental playback of adult vocalizations to chicks in the field, I demonstrated: (1) chicks respond to the alarm call by vocalizing relatively less often and moving away from the signal source, (2) chicks respond to the gather call by vocalizing relatively more often and moving toward the signal source, (3) and chicks respond to the freeze call by vocalizing relatively less often and crouching motionless on the substrate for extended periods of time.  I also describe two distinct chick vocalizations (chick-contact and chick-alarm calls).",
  "description_provenance": [
    "Author Email: jedibirdnerd@yahoo.com",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: susan_haig@usgs.gov",
    "Advisor Email: greenbergR@si.edu",
    "Advisor Email: jphillip@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:02Z (GMT). No. of bitstreams: 1  johnson_dissertation_1.pdf: 1920401 bytes, checksum: 7cd2a6ebe8fa7b6546662e89521f23b9 (MD5)    Previous issue date: 2006-08-07"
  ],
  "handle": "28903",
  "identifier_other": "etd-09082006-130942",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09082006-130942/",
  "identifier_uri": "http://hdl.handle.net/10919/28903",
  "publisher": "Virginia Tech",
  "relation_haspart": "johnson_dissertation_1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "vocal signals",
    "call function",
    "reproduction",
    "parental care",
    "despotic distribution",
    "dispersal",
    "mark-recapture",
    "mate fidelity",
    "nest success",
    "fitness",
    "divorce",
    "shorebird",
    "resource use",
    "breeding site fidelity",
    "survival"
  ],
  "title": "Demography and Behavior of Western Sandpipers (Calidris mauri) Breeding on the Yukon-Kuskokwim River Delta, Alaska",
  "type": "Dissertation"
}