{
  "contributor_author": "Park, Sangjun",
  "contributor_committeechair": "Rakha, Hesham Ahmed",
  "contributor_committeemember": [
    "Abbas, Montasir M.",
    "Trani, Antoino A.",
    "Marr, Linsey C.",
    "Ahn, Kyoungho"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:16:04Z",
  "date_adate": "2008-10-13",
  "date_available": "2014-03-14T20:16:04Z",
  "date_issued": "2008-09-03",
  "date_rdate": "2008-10-13",
  "date_sdate": "2008-09-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In the last few years, scientific consensus is that emission of greenhouse gases (GHGs) into the atmosphere is contributing to changes in the earth's climate. While uncertainty remains over the pace and dimensions of the change, a consensus on the need for action has grown among the public and elected officials. In part, this shift has been accelerated by concern over energy security and rising fuel prices. The new political landscape has led many cities, states, and regions to institute policies aimed at reducing GHG emissions. These policies and emerging initiatives have significant implications for the transportation planning process. The transportation sector accounts for approximately 27% of GHG production in the U.S. (as of 2003) and while the U.S. accounts for only roughly 5% of the world's population, it is estimated that it produces over 20% of the world's GHG emissions. Note that this does not include \"lifecycle\" emissions that result from the processes undertaken to extract, manufacture, and transport fuel. Carbon dioxide represents approximately 96% of the transportation sector's radiative forcing effects. Unlike conventional air pollutants, carbon dioxide emissions are directly tied to the amount of fuel consumed and its carbon intensity. Therefore, emissions reductions can be achieved by increasing the use of low-carbon fuels, improving fuel economy, or reducing total vehicle miles of travel - often called the three legged stool. (A fourth leg is congestion reduction, at certain optimal speeds). These same factors are related to our use of imported oil, so actions taken to reduce GHG emissions may actually produce benefits in both policy areas.  The climatic risks of additional emissions associated with capacity projects must be balanced against the mobility, safety, and economic needs of a community or region. Consequently, this dissertation attempts to quantify the impacts of high-emitting vehicles on the environment and to propose solutions to enhance the currently-used high-emitting vehicle detection procedures. In addition, fuel consumption and emission models for high-speed vehicles are developed in order to provide more reliable estimates of vehicle emissions and study the impact of vehicle speeds on vehicle emissions.<p> The dissertation extends the state-of-the-art analysis of high emitting vehicles (HEVs) by quantifying the network-wide environmental impact of HEVs. The literature reports that 7% to 12% of HEVs account for somewhere between 41% to 63% of the total CO emissions, and 10% are responsible for 47% to 65% of HC emissions, and 10% are responsible for 32% of NOx emissions. These studies, however, are based on spot measurements and do not necessarily reflect network-wide impacts. Consequently, the research presented in this dissertation extends the state-of-knowledge by quantifying HEV contributions on a network level. The study uses microscopic vehicle emission models (CMEM and VT-Micro model) along with pre-defined drive cycles (under the assumption that the composite HEV and VT-LDV3 represent HEVs and NEVs, respectively) in addition to the simulation of two transportation networks (freeway and arterial) to quantify the contributions of HEVs. The study demonstrates that HEVs are responsible for 67% to 87% of HC emissions, 51% to 78% of CO emissions, and 32% to 62% of the NOX emissions for HEV percentages ranging from 5% to 20%. Additionally, the traffic simulation results demonstrate that 10% of the HEVs are responsible for 50% to 66% of the I-81 HC and 59% to 78% of the Columbia Pike HC emissions, 35% to 67% of the I-81 CO and 38% to 69% of the Columbia Pike CO emissions, and 35% to 44% of the I-81 NOX and 35% to 60% of the Columbia Pike NOX emissions depending on the percentage of the normal-emitting LDTs to the total NEVs. HEV emission contributions to total HC and CO emissions appear to be consistent with what is reported in the literature. However, the contribution of NOX emissions is greater than what is reported in the literature. The study demonstrates that the contribution of HEVs to the total vehicle emissions is dependent on the type of roadway facility (arterials vs. highways), the background normal vehicle composition, and the composition of HEVs. Consequently, these results are network and roadway specific. Finally, considering that emission control technologies in new vehicles are advancing, the contribution of HEVs will increase given that the background emission contribution will decrease.<p> Given that HEVs are responsible for a large portion of on-road vehicle emissions, the dissertation proposes solutions to the HEV screening procedures. First, a new approach is proposed for estimating vehicle mass emissions from concentration remote sensing emission measurements using the carbon balance equation in conjunction with either the VT-Micro or PERE fuel consumption rates for the enhancement of current state-of-the-art HEV screening procedures using RSD technology. The study demonstrates that the proposed approach produces reliable mass emission estimates for different vehicle types including sedans, station wagons, full size vans, mini vans, pickup trucks, and SUVs. Second, a procedure is proposed for constructing on-road RS emission standards sensitive to vehicle speed and acceleration levels. The proposed procedure is broadly divided into three sub-processes. In the first process, HE cut points in grams per second are developed as a function of a vehicle's speed and acceleration levels using the VT-Micro and CMEM emission models. Subsequently, the HE cut points in grams per second are converted to concentration emissions cut points in parts per million using the carbon balance equation. Finally, the scale factors are computed using either ASM ETW- and model-year-based standards or engine-displacement-based standards. Given the RS emissions standards, the study demonstrated that the use of on-road RS cut points sensitive to speed and acceleration levels is required in order to enhance the effectiveness of RS.<p> Finally, the dissertation conducted a study to develop fuel consumption and emissions models for high-speed vehicles to overcome the shortcomings of state-of-practice models. The research effort gathered field data and developed models for the estimation of fuel consumption, CO2, CO, NO, NO2, NOx, HC, and PM emissions at high speeds. A total of nine vehicles including three semi-trucks, three pick-up trucks, and three passenger cars were tested on a nine-mile test track in Pecos, Texas. The fuel consumption and emission rates were measured using two portable emission measurement systems. Models were developed using these data producing minimum errors for fuel consumption, CO2, NO2, HC, and PM emissions. Alternatively, the NO and NOx emission models produced the highest errors with a least degree of correlation. Given the models, the study demonstrated that the newly constructed models overcome the shortcomings of the state-of-practice models and can be utilized to evaluate the environmental impacts of high speed driving.<p>",
  "description_provenance": [
    "Author Email: sangjun@vt.edu",
    "Advisor Email: abbas@vt.edu",
    "Advisor Email: vuela@vt.edu",
    "Advisor Email: hrakha@vt.edu",
    "Advisor Email: lmarr@vt.edu",
    "Advisor Email: kahn@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:04Z (GMT). No. of bitstreams: 1 SP_Dissertation.pdf: 8878271 bytes, checksum: 291e5c6f7cdbf8a755ab98535e51d030 (MD5)   Previous issue date: 2008-09-03"
  ],
  "handle": "28918",
  "identifier_other": "etd-09092008-131447",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09092008-131447/",
  "identifier_uri": "http://hdl.handle.net/10919/28918",
  "publisher": "Virginia Tech",
  "relation_haspart": "SP_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Mobile Source Emission Models",
    "High Emitting Vehicles",
    "Remote Sensing Devices",
    "High Speed Vehicles",
    "Fuel Consumption Models"
  ],
  "title": "High Automobile Emissions: Modeling Impacts and Developing Solutions",
  "type": "Dissertation"
}