{
  "contributor_author": "Esposito, Judith Folmar",
  "contributor_committeechair": "Curcio, Claire Cole Vaught",
  "contributor_committeemember": [
    "Agnew, David T.",
    "Lynch, Sherry K.",
    "Getz, Hilda M.",
    "Fortune, Jimmie C."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:16:04Z",
  "date_adate": "1999-09-14",
  "date_available": "2014-03-14T20:16:04Z",
  "date_issued": "1999-08-08",
  "date_rdate": "2000-09-14",
  "date_sdate": "1999-09-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study is an investigation into the middle school counseling programs that facilitate the early adolescent need to belong to a group. Particular focus is on the effectiveness of teacher-advisory programs, peer mediation programs, and group counseling programs, and how all three programs work together as components of a comprehensive middle school guidance program. Factors associated with successful implementation of these programs and the role of the middle school counselor in the implementation these three programs were also examined. Five middle schools were studied, using qualitative interviews of principals, counselors, and teachers. A focus group of seven to ten students was conducted at each middle school. Results provide a look at several different ways to combine the three programs in a middle school, along with factors for successful implementation.",
  "description_provenance": [
    "Author Email: jesposit@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:04Z (GMT). No. of bitstreams: 1 esposito.pdf: 506605 bytes, checksum: e91eed9ea548f13620915ad685747492 (MD5)   Previous issue date: 1999-08-08"
  ],
  "handle": "28913",
  "identifier_other": "etd-090899-150617",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-090899-150617/",
  "identifier_uri": "http://hdl.handle.net/10919/28913",
  "publisher": "Virginia Tech",
  "relation_haspart": "esposito.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Peer Mediation",
    "Middle School Counseling",
    "Advisory",
    "Groups"
  ],
  "title": "Group-Oriented Practices of Middle School Counselors",
  "type": "Dissertation"
}