{
  "contributor_author": "Bookhart, Portia Yvonne",
  "contributor_committeecochair": [
    "Lichtman, Marilyn V.",
    "Gatewood, Thomas E."
  ],
  "contributor_committeemember": [
    "McGrady, Harold J.",
    "Woods, Leroy",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:16:04Z",
  "date_adate": "1999-09-25",
  "date_available": "2014-03-14T20:16:04Z",
  "date_issued": "1999-06-06",
  "date_rdate": "2000-09-25",
  "date_sdate": "1999-09-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The tension between exclusion and inclusion has been a shaping force in U.S. society and education. Public schools, in particular, have experienced stages of incorporating a larger number of children with disabilities into classrooms. In the United States, until approximately 1800, the great majority of students considered to be learners with disabilities were not deemed worthy of formal education, even though they were perceived as brothers and sisters who were part of the community (Hawes, 1991; Rothman, 1971).      The purpose of this study was to explore the perceptions of an urban inclusive program by secondary learning disabled students, their teachers, and support staff. Questions that were answered were: 1) What are the similarities and differences of perceptions between a regular education classroom and a special education classroom? 2) What are the intrapersonal and interpersonal skills of students who have been diagnosed as learning disabled? 3) What are the perceptions of learning disabled students in regard to family life? The method that was utilized was a case study design.       The findings of this study indicate that in spite of the students being included in regular education classes, they (students) preferred being in special education. The teachers liked the inclusion program, but felt that it lacked the resources necessary to make the program successful.      It can be concluded that inclusion is a worthwhile program; however, the needs of the special education students could not be totally met.",
  "description_provenance": [
    "Author Email: pbookhar@vt.edu",
    "Advisor Email: gatewood@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:04Z (GMT). No. of bitstreams: 1 BOOKHART.PDF: 158555 bytes, checksum: f6d85bfd5073ab83f3730403183e8a53 (MD5)   Previous issue date: 1999-06-06"
  ],
  "handle": "28914",
  "identifier_other": "etd-090899-172654",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-090899-172654/",
  "identifier_uri": "http://hdl.handle.net/10919/28914",
  "publisher": "Virginia Tech",
  "relation_haspart": "BOOKHART.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "inclusive",
    "learning disabled",
    "teacher"
  ],
  "title": "Perceptions of An Inclusive Program By Secondary Learning Disabled Students, Their Teachers, and Support Staff",
  "type": "Dissertation"
}