{
  "contributor_author": "Chala, Zelalem Teklu",
  "contributor_committeecochair": [
    "Norton, George W.",
    "Grant, Jason H."
  ],
  "contributor_committeemember": [
    "Stephenson, Stephen Kurt",
    "Taylor, Daniel B."
  ],
  "contributor_department": "Economics (Agriculture)",
  "date_accessioned": "2014-03-14T20:16:03Z",
  "date_adate": "2010-09-14",
  "date_available": "2014-03-14T20:16:03Z",
  "date_issued": "2010-06-25",
  "date_rdate": "2010-09-14",
  "date_sdate": "2010-09-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this thesis was to assess the economic implications of an export promotion policy on poverty reduction and inter-industry growth of Ethiopia. The study was conducted in four steps. The first and the second steps involved simulation scenarios. Scenario 1 simulated the change in the incidence of poverty when FDI capital was selectively introduced into non-coffee export agriculture. Scenario 2 simulated a situation in which the coffee industry received the same policy treatment as other export agriculture in accessing FDI capital. Step three analyzed inter-industry growth under the two scenarios. In the fourth step, sensitivity analysis was conducted to assess the possible outcomes of Scenario 1 and 2 under fluctuations in world coffee prices and changes in substitution parameters. A micro-simulated CGE model was constructed to determine optimum production, income and consumption. A Beta frequency distribution function and FGT poverty measures were used to examine the changes in three household groupsâ   income distribution and prevalence of poverty.  For these analyses, the National Accounting Matrix and the Household Income and Expenditure Sample Survey data set were used. At the macro level, growth in GDP due to expansion of export agriculture was significant. But at a micro level, the magnitude and dimension of economic changes were different with respect to each policy alternative. In the selective export promotion, for instance, only rural households were able to achieve statistically significant income changes. More particularly, about 10 percent of rural households were drawn out of poverty while only 1.7 and 0.5 percent of small and large urban households overcame poverty. When export promotion was assumed to be implemented across the board of all agricultural activities, the welfare gains were extended beyond rural household groups. In this policy alternative, statistically significant mean income   changes were observed for both rural and urban household members. Specifically, about 12 percent of rural, 9 percent of small urban and 5 percent of large urban households were able to escape poverty. These achievements were attributed to higher intensification of coffee production and better linkages with other industries to efficiently allocate factors of production where they provided higher rates of return. The increase in income and consumption of millions of coffee dependent households has also stimulated more agricultural and some non-agricultural productions. Simulation results were observed to deteriorate when export promotion was evaluated under world coffee price fluctuation. The negative effect of a price shock, however, was observed to be minimized under alternative an export promotion approach.",
  "description_provenance": [
    "Author Email: ztchala@vt.edu",
    "Advisor Email: gnorton@vt.edu",
    "Advisor Email: jhgrant@vt.edu",
    "Advisor Email: kurts@vt.edu",
    "Advisor Email: taylord@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:03Z (GMT). No. of bitstreams: 1 Chala_ZT_D_2010.pdf: 3459755 bytes, checksum: 98152222fd1a23c4f39edcbdee115177 (MD5)   Previous issue date: 2010-06-25"
  ],
  "handle": "28910",
  "identifier_other": "etd-09082010-160119",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09082010-160119/",
  "identifier_uri": "http://hdl.handle.net/10919/28910",
  "publisher": "Virginia Tech",
  "relation_haspart": "Chala_ZT_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Selective export promotion policy",
    "computable general equilibrium",
    "poverty reduction and foreign direct investment."
  ],
  "title": "Economic Significance of Selective Export Promotion on Poverty Reduction and Inter-Industry Growth of Ethiopia.",
  "type": "Dissertation"
}