{
  "contributor_author": "Rojas, Christian Andres",
  "contributor_committeechair": "Peterson, Everett B.",
  "contributor_committeecochair": "Lutz, Nancy A.",
  "contributor_committeemember": [
    "Haller, Hans H.",
    "Eckel, Catherine C.",
    "Ashley, Richard A."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:16:04Z",
  "date_adate": "2005-09-23",
  "date_available": "2014-03-14T20:16:04Z",
  "date_issued": "2005-09-05",
  "date_rdate": "2006-09-23",
  "date_sdate": "2005-09-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A large part of the empirical work on differentiated products markets has focused on demand estimation and the pricing behavior of firms. These two themes are key inputs in important applications such as the merging of two firms or the introduction of new products. The validity of inferences, therefore, depends on accurate demand estimates and sound assumptions about the pricing behavior of firms. This dissertation makes a contribution to this literature in two ways. First, it adds to previous techniques of estimating demand for differentiated products. Second, it extends previous analyses of pricing behavior to models of price leadership that, while important, have received limited attention. The investigation focuses on the U.S. brewing industry, where price leadership appears to be an important type of firm behavior. The analysis is conducted in two stages. In the first stage, the recent Distance Metric (DM) method devised by Pinkse, Slade and Brett is used to estimate the demand for 64 brands of beer in 58 major metropolitan areas of the United States. This study adds to previous applications of the DM method (Pinkse and Slade; Slade 2004) by employing a  demand specification that is more flexible and also by estimating advertising substitution coefficients for numerous beer brands. In the second stage, different pricing models are compared and ranked by exploiting the exogenous change in the federal excise tax of 1991. Demand estimates of the first stage are used to compute the implied marginal costs for the different models of pricing behavior prior to the tax increase. Then, the tax increase is added to the these pre-tax increase marginal costs, and equilibrium prices for all brands are simulated for each model of pricing behavior. These \"predicted\" prices are then compared to actual prices for model assessment. Results indicate that Bertrand-Nash predicts the pricing behavior of firms more closely than other models, although Stackelberg leadership yields results that are not substanitally  different from the Bertrand-Nash model. Nevertheless, Bertrand-Nash tends to under-predict prices of more price-elastic brands and to over-predict prices of less price- elastic brands. An implication of this result is that Anheuser-Busch could exert more market power by increasing the price of its highly inelastic brands, especially Budweiser. Overall, actual price movements as a result of the tax increase tend to be more similar across brands than predicted by any of the models considered. While this pattern is not inconsistent with leadership behavior, leadership models considered in this dissertation do not conform with this pattern.",
  "description_provenance": [
    "Author Email: crojas@vt.edu",
    "Advisor Email: haller@vt.edu",
    "Advisor Email: nlutz@vt.edu",
    "Advisor Email: eckelc@vt.edu",
    "Advisor Email: ashleyr@vt.edu",
    "Advisor Email: petrsone@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:04Z (GMT). No. of bitstreams: 1 Dissertation_Final.pdf: 905867 bytes, checksum: 0e9064bfae176d0b1baad8ee24747124 (MD5)   Previous issue date: 2005-09-05"
  ],
  "handle": "28916",
  "identifier_other": "etd-09092005-143148",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09092005-143148/",
  "identifier_uri": "http://hdl.handle.net/10919/28916",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Bertrand-Nash",
    "Excise Tax",
    "Price Competition",
    "Beer",
    "Demand",
    "Differentiated Products",
    "Distance Metric",
    "Advertising",
    "Brewing"
  ],
  "title": "Demand Estimation with Differentiated Products: An Application to Price Competition in the U.S. Brewing Industry",
  "type": "Dissertation"
}