{
  "contributor_author": "Walk, Carrie L.",
  "contributor_committeechair": "McElroy, Audrey P.",
  "contributor_committeemember": [
    "Dalloul, Rami A.",
    "Pierson, F. William",
    "Wyatt, Craig L."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:16:05Z",
  "date_adate": "2009-09-22",
  "date_available": "2014-03-14T20:16:05Z",
  "date_issued": "2009-09-03",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-09-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A series of experiments were conducted to evaluate the effects of dietary enzyme supplementation in broilers exposed to a live coccidia oocyst vaccine.  In each experiment, Cobb 500 broilers were obtained at day of hatch from a commercial hatchery.  Half of the chicks were sprayed with Coccivac BTM and housed in battery brooders in experiment (EXP) 1 and 2 or floor pens (EXP 3).  Experimental diets were formulated according to Cobb 500 nutrient recommendations (positive control; PC) with the exception of Ca and available P (aP), which were reduced in the negative control (NC) diets approximately 0.1% (EXP 1), 0.11 and 0.13%, respectively (EXP 2), and 0.13% (EXP 3).  Negative control diets in EXP 1 were supplemented with phytase (PHY), protease (PRO), xylanase (XYL), and the combination of PHY+PRO, PHY+XYL, and PHY+PRO+XYL.  Negative control diets in EXP 2 were supplemented with PHY A, PHY B, and PHY C.  In EXP 3, PC diets were supplemented with PHY at 1000 FTU/kg, and NC diets were supplemented with PHY at 1000 or 5000 FTU/kg.  In all three experiments PHY supplementation generally improved (P â ¤ 0.05) broiler performance and bone ash.  Vaccination reduced (P â ¤ 0.05) broiler performance in EXP 1 and 3, but increased (P â ¤ 0.05) broiler performance in EXP 2.  Xylanase and/or PHY supplementation tended to improve (P = 0.10) ileal amino acid digestibility (IAAD) in vaccinated broilers in EXP 1 and EXP 3.  Phytase supplementation improved (P â ¤ 0.05) IAAD and vaccination reduced (P â ¤ 0.05) IAAD in EXP 3.  Small intestinal morphology and goblet cell numbers were affected by enzyme supplementation and vaccination, which resulted in significant (P â ¤ 0.05) interactions.  In general, vaccination increased (P â ¤ 0.05) small intestinal crypt depth and reduced (P â ¤ 0.05) goblet cell numbers in EXP 3.  Phytase supplementation of the NC diets fed to vaccinated broilers ameliorated the reduction in ileal goblet cells associated with vaccination (EXP 3).  Enzyme supplementation tended to improve nutrient digestibility and altered small intestinal morphology in vaccinated broilers.  Vaccination reduced broiler performance but nutrient digestion and dietary enzymes may improve nutrient utilization during a coccidia vaccination.",
  "description_provenance": [
    "Author Email: clwalk@vt.edu",
    "Advisor Email: rdalloul@vt.edu",
    "Advisor Email: pierson@vt.edu",
    "Advisor Email: craigwyatt@abvista.us",
    "Advisor Email: amcelroy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:05Z (GMT). No. of bitstreams: 1 Walk_CL_D_2009.pdf: 564613 bytes, checksum: d5a2de2ce846148d31b00594705ae41a (MD5)   Previous issue date: 2009-09-03"
  ],
  "handle": "28923",
  "identifier_other": "etd-09092009-151027",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09092009-151027/",
  "identifier_uri": "http://hdl.handle.net/10919/28923",
  "publisher": "Virginia Tech",
  "relation_haspart": "Walk_CL_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "coccidia",
    "broiler",
    "phytase",
    "xylanase",
    "protease"
  ],
  "title": "Effects of dietary enzyme supplementation on performance, bone ash, small intestinal morphology, and apparent ileal amino acid digestibility of broilers exposed to a live coccidia oocyst vaccine",
  "type": "Dissertation"
}