{
  "contributor_author": "Zhu, Yitan",
  "contributor_committeechair": "Wang, Yue J.",
  "contributor_committeemember": [
    "Zaghloul, Amir I.",
    "Lu, Chang-Tien",
    "Wyatt, Christopher L.",
    "Xuan, Jianhua Jason"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:16:05Z",
  "date_adate": "2009-10-01",
  "date_available": "2014-03-14T20:16:05Z",
  "date_issued": "2009-09-02",
  "date_rdate": "2009-10-01",
  "date_sdate": "2009-09-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this dissertation, we propose and develop innovative data modeling and analysis methods for extracting meaningful and specific information about disease mechanisms from microarray gene expression data.  To provide a high-level overview of gene expression data for easy and insightful understanding of data structure, we propose a novel statistical data clustering and visualization algorithm that is comprehensively effective for multiple clustering tasks and that overcomes some major limitations of existing clustering methods. The proposed clustering and visualization algorithm performs progressive, divisive hierarchical clustering and visualization, supported by hierarchical statistical modeling, supervised/unsupervised informative gene/feature selection, supervised/unsupervised data visualization, and user/prior knowledge guidance through human-data interactions, to discover cluster structure within complex, high-dimensional gene expression data.  For the purpose of selecting suitable clustering algorithm(s) for gene expression data analysis, we design an objective and reliable clustering evaluation scheme to assess the performance of clustering algorithms by comparing their sample clustering outcome to phenotype categories. Using the proposed evaluation scheme, we compared the performance of our newly developed clustering algorithm with those of several benchmark clustering methods, and demonstrated the superior and stable performance of the proposed clustering algorithm. To identify the underlying active biological processes that jointly form the observed biological event, we propose a latent linear mixture model that quantitatively describes how the observed gene expressions are generated by a process of mixing the latent active biological processes. We prove a series of theorems to show the identifiability of the noise-free model. Based on relevant geometric concepts, convex analysis and optimization, gene clustering, and model stability analysis, we develop a robust blind source separation method that fits the model to the gene expression data and subsequently identify the underlying biological processes and their activity levels under different biological conditions.  Based on the experimental results obtained on cancer, muscle regeneration, and muscular dystrophy gene expression data, we believe that the research work presented in this dissertation not only contributes to the engineering research areas of machine learning and pattern recognition, but also provides novel and effective solutions to potentially solve many biomedical research problems, for improving the understanding about disease mechanisms.",
  "description_provenance": [
    "Author Email: yitanzhu@vt.edu",
    "Advisor Email: amirz@vt.edu",
    "Advisor Email: ctlu@vt.edu",
    "Advisor Email: clwyatt@vt.edu",
    "Advisor Email: XUAN@vt.edu",
    "Advisor Email: yuewang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:05Z (GMT). No. of bitstreams: 1 Zhu_Y_D_2009.pdf: 2927002 bytes, checksum: 8b7e5c409c34b940df78bdbec4afd71d (MD5)   Previous issue date: 2009-09-02"
  ],
  "handle": "28924",
  "identifier_other": "etd-09092009-214731",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09092009-214731/",
  "identifier_uri": "http://hdl.handle.net/10919/28924",
  "publisher": "Virginia Tech",
  "relation_haspart": "Zhu_Y_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Blind Source Separation",
    "Convex Analysis and Optimization",
    "Gene Expressions",
    "Clustering Evaluation",
    "Data Clustering and Visualization"
  ],
  "title": "Learning Statistical and Geometric Models from Microarray Gene Expression Data",
  "type": "Dissertation"
}