{
  "contributor_author": "Shen, Yi",
  "contributor_committeechair": "Diplas, Panayiotis",
  "contributor_committeemember": [
    "Dancey, Clinton L.",
    "Gutierrez, Marte S.",
    "Orth, Donald J.",
    "Schetz, Joseph A."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:16:05Z",
  "date_adate": "2009-09-30",
  "date_available": "2014-03-14T20:16:05Z",
  "date_issued": "2009-09-09",
  "date_rdate": "2009-09-30",
  "date_sdate": "2009-09-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Reservoir releases for generating power need to be reconciled with efforts to maintain healthy ecosystems in regulated rivers having irregular channel topography. Fluctuating, complex flow patterns near river obstructions such as boulders and large woody debris provide unique habitat for many aquatic organisms. Numerical modeling of the flow structures surrounding these obstructions is challenging, yet it represents an important tool for aquatic habitat assessment. Moreover, efforts for modeling the morphologically and biologically important transient flows, as well as quantifying their impacts on physical fish habitat during the unsteady-flow period remain rare.  In this dissertation, the ability of two- (2-D) and three-dimensional (3-D) hydraulic models to reproduce the localized complex flow features at steady base and peak flows is examined first. The performance of the two hydraulic models is evaluated by comparing the numerical results with measurements of flow around a laboratory hemisphere and boulders located at a reach of the Smith River in Virginia. Close agreement between measured values and the velocity profiles predicted by the two models is obtained outside the wakes behind these obstructions. However, results suggest that in the vicinity of theses obstructions the 3-D model is better suited for reproducing the circulation flow behavior favored by many aquatic species over a broad range of flows.  Further, time-dependent flow features affecting channel morphology and aquatic physical habitat are investigated using the numerical models for the same reach in the Smith River. Temporal variation measurements of water surface elevation and velocity profile obtained in the field during a reservoir release are in good agreement with the numerical results. A hypothetical â  staggeringâ   flow release scenario simulated by the 3-D model leads to reduced erosional area and longer refugia availability for juvenile brown trout during hydropeaking. Finally, an unsteadiness parameter Î² is proposed for determining whether an unsteady flow regime can be either modeled using a truly dynamic flow approach or a quasi-steady flow method.",
  "description_provenance": [
    "Author Email: yi.shen@tpwd.state.tx.us",
    "Advisor Email: pdiplas@vt.edu",
    "Advisor Email: cld@vt.edu",
    "Advisor Email: mgutierr@mines.edu",
    "Advisor Email: dorth@vt.edu",
    "Advisor Email: ptiger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:05Z (GMT). No. of bitstreams: 1 Shen_Yi_D_2009.pdf: 6914987 bytes, checksum: 1520b470a9b67a331a4a61794d540684 (MD5)   Previous issue date: 2009-09-09"
  ],
  "handle": "28925",
  "identifier_other": "etd-09092009-222602",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09092009-222602/",
  "identifier_uri": "http://hdl.handle.net/10919/28925",
  "publisher": "Virginia Tech",
  "relation_haspart": "Shen_Yi_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Three-Dimensional Models",
    "Two-Dimensional Models",
    "Aquatic Habitat",
    "Unsteady Flows",
    "Fluctuating Flow Regimes",
    "Reservoir Releases",
    "Spatial Flow Patterns"
  ],
  "title": "Evaluating Ecological Influences of Altered Flow Regimes Using Two- and Three-Dimensional Hydrodynamic Models",
  "type": "Dissertation"
}