{
  "contributor_author": "Tickle, Benjamin Ray",
  "contributor_committeecochair": [
    "Salmon, Richard G.",
    "Chang, Mido"
  ],
  "contributor_committeemember": [
    "Alexander, David",
    "McCracken, Robert C.",
    "Martin, Rosalie Marie"
  ],
  "contributor_department": "Administration and Supervision of Special Education",
  "date_accessioned": "2014-03-14T20:16:06Z",
  "date_adate": "2008-10-08",
  "date_available": "2014-03-14T20:16:06Z",
  "date_issued": "2008-08-29",
  "date_rdate": "2008-10-08",
  "date_sdate": "2008-09-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Due to a high rate of teacher attrition currently being experienced in public schools, a teacher shortage may be looming in the near future.  Research shows that attrition rates are highest among novice teachers.  In part, teacher attrition has also made it increasingly difficult for schools to meet the â  highly qualifiedâ   requirement of the No Child Left Behind Act of 2001.  Past efforts to reverse this trend have concentrated on increasing the supply of qualified teachers; however, more recent studies have shown that the solution lies partially in raising retention rates.  Research has identified several reasons teachers have left the profession, such as, low salary, student misbehavior and working conditions, including administrative support.  Another common thread among teachers who leave the profession has been dissatisfaction with working conditions in their school.     This study examined the relationship between teachersâ   intent to stay in teaching, teachersâ   job satisfaction, perceived administrative support, teaching experience, perceived student behavior, and teachersâ   satisfaction with their salaries.  After the conduct of a preliminary descriptive analysis, a hypothesized path model was employed through the use of four different samples derived from the 2003-04 Schools and Staffing Survey, Public School Teacher Questionnaire (Form SASS-4A).  The first sample was the combined environmental setting.  The second, third, and fourth sub-samples were urban, urban fringe, and rural samples, respectively, as identified by the respondent. Based on the path analysis, perceived administrative support, teaching experience, perceived student behavior, and teachersâ   satisfaction with their salary were identified as significant predictors of teachersâ   job satisfaction and intent to stay in teaching.  Administrative support was the most significant predictor of teachersâ   job satisfaction, while teachersâ   job satisfaction was the most significant predictor of teachersâ   intent to stay in teaching.  The path analysis also confirmed that perceived administrative support mediates the effect of teaching experience, perceived student behavior, and teachersâ   satisfaction with their salary relative to both teachersâ   job satisfaction and intent to stay in teaching.  No significant differences were found among the sample and their sub-samples based on the environmental setting of the school.",
  "description_provenance": [
    "Author Email: btickle@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: mchang@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: rmcracke@radford.edu",
    "Advisor Email: rowhite@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:06Z (GMT). No. of bitstreams: 1 Dissertation-Tickle.pdf: 496149 bytes, checksum: 51f3eaa2a42e432c07b30367af4ff2c3 (MD5)   Previous issue date: 2008-08-29"
  ],
  "handle": "28931",
  "identifier_other": "etd-09102008-214736",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09102008-214736/",
  "identifier_uri": "http://hdl.handle.net/10919/28931",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-Tickle.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Teachers' Satisfaction with Their Salary",
    "Student Behavior",
    "Teaching Experience",
    "Teacher Attrition",
    "Job Satisfaction",
    "Environmental Setting of the School",
    "Administrative Support"
  ],
  "title": "Public School Teachers' Perceptions of Administrative Support and its Mediating Effect on Their Job Satisfaction and Intent to Stay in Teaching",
  "type": "Dissertation"
}