{
  "contributor_author": "Graham, Allan Wayne",
  "contributor_committeechair": "Maher, John J.",
  "contributor_committeemember": [
    "Brozovsky, John A.",
    "Kumar, Raman",
    "Brown, Robert M.",
    "Thompson, G. Rodney"
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:16:07Z",
  "date_adate": "2000-09-18",
  "date_available": "2014-03-14T20:16:07Z",
  "date_issued": "2000-08-31",
  "date_rdate": "2001-09-18",
  "date_sdate": "2000-09-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Environmental remediation liabilities are generated primarily as a result of past actions by a firm. The most important of these liabilities for domestic U.S. firms are related to Superfund sites as designated by the Environmental Protection Agency (EPA). These liabilities are important for domestic firms because of their size, which is estimated to be approximately $300 billion (Congressional Budget Office 1994) and because of public concern for the environment.  \tThis study examines the relation among bond ratings, bond yields, and EPA-based estimates of contingent environmental remediation liabilities to test if the relationships hold as theory implies it would. Extant theory suggests that financial variables, such as environmental remediation liabilities, have incremental explanatory power beyond the information included in bond ratings for bond yield. The purpose of this study is to determine the importance of external estimates of a firm's contingent environmental liabilities for a firm's cost of debt. In addition, the manner in which a firm's contingent environmental liabilities are included in the costs of debt is examined in this study. The results of this study indicate that external estimates for environmental liabilities are associated with the bond ratings and bond yield for a data set of new bond issues collected from the period 1995 to 1997. Despite that firms are increasing their recognition of environmental liabilities, either due to regulatory pressure or other factors, the measures based on EPA data still have significant explanatory power. The results imply that firms are either still lagging in appropriate recognition or that the external measures proxy for amounts imputed by the capital markets for some probable unspecified future costs. The latter explanation is supported by additional evidence in this study that the largest monetary measure of the liability is the most significantly associated with bond ratings and bond yields. Further, the results indicate that the external estimates are incorporated in bond ratings as part of the firm's default risk and have no direct influence over bond yield beyond that included in the bond ratings. This implies that bond ratings are particularly important for any evaluation of investment in debt securities from firms that have contingent environmental liabilities.",
  "description_provenance": [
    "Author Email: grahamaw@uri.edu",
    "Advisor Email: jmaher@vt.edu",
    "Advisor Email: jbrozovs@vt.edu",
    "Advisor Email: rkumar@vt.edu",
    "Advisor Email: moren@vt.edu",
    "Advisor Email: grod@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:07Z (GMT). No. of bitstreams: 2 vita.pdf: 3480 bytes, checksum: 86b9a0a011f7eda915d13958c1ec2241 (MD5) graham.pdf: 265747 bytes, checksum: 0f1d9faae0e418d8357027196c55c567 (MD5)   Previous issue date: 2000-08-31"
  ],
  "handle": "28937",
  "identifier_other": "etd-09112000-17020026",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09112000-17020026/",
  "identifier_uri": "http://hdl.handle.net/10919/28937",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "vita.pdf",
    "graham.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "contingent liabilities",
    "bond yields",
    "bond ratings",
    "environmental liabilities",
    "cost of debt"
  ],
  "title": "Environmental Liabilities and Bond Yields",
  "type": "Dissertation"
}