{
  "contributor_author": "Aigster, Annelisse",
  "contributor_committeecochair": [
    "Barbeau, William E.",
    "Duncan, Susan E."
  ],
  "contributor_committeemember": [
    "Conforti, Frank D.",
    "Hosig, Kathryn Wright",
    "Thatcher, Craig D.",
    "Zhou, Kequan Kevin"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:16:07Z",
  "date_adate": "2009-10-06",
  "date_available": "2014-03-14T20:16:07Z",
  "date_issued": "2009-09-01",
  "date_rdate": "2009-10-06",
  "date_sdate": "2009-09-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The incidence of type 2 diabetes is considered an epidemic in Western countries, and its prevalence is more common in the Hispanic population than in non-Hispanic whites. Postprandial hyperglycemia has been associated with oxidative stress (OS), thus; reducing postprandial glycemia and/or OS through dietary consumption of resistant starch (RS) may be one approach to help modulate glucose and insulin responses. The purpose of this study was twofold: 1) to evaluate the physicochemical and sensory properties of cereal food products supplemented with RS. 2) to compare the effects of a single ingestion of granola bars with high (~18 grams of RS) and low (~0 grams of RS) RS compositions on the postprandial glucose and insulin responses (n=14) and oxidative stress parameters (cellular glutathione peroxidase, F2- isoprostanes, and oxygen radical absorbance capacity) in Hispanic women (n=9). Granola bars and cereals were developed to provide 2 levels (10% and 15%) of RS; isocaloric (0% RS) control samples were prepared with readily digestible (high amylopectin) starch. Samples were stored for up to 4 weeks at 20 °C. Mean composition of the high RS granola bars was 6% protein, 15% moisture, and 18% lipid. RS levels slightly increased from 14 to 16 g/serving after 4 weeks of storage, supporting published research that RS increases with storage due to retrogradation and crystallization of amylose chains. Color became lighter as the level of RS increased (p<0.001). Granola bars containing RS were less brittle (p=0.0043) than control granola bars. Sensory results indicated granola bars/cereals were acceptable. RS-supplemented granola bars were then used for the evaluation of RS ingestion in humans.   There was no difference in postprandial glucose and insulin responses after a single ingestion of a RS-supplemented (18 g) granola bar. No differences were found in the oxidative stress parameters measured. In a subgroup of subjects (n=9), a lower glucose response 30 minutes after RS consumption was found (p=0.0496). Thus, RS consumption may lower fluctuations in blood glucose, which may help manage glucose levels in individuals at risk of type 2 diabetes. Further studies of short term RS consumption are warranted to elucidate its benefits in glucose management.",
  "description_provenance": [
    "Author Email: aaigster@vt.edu",
    "Advisor Email: barbeau@vt.edu",
    "Advisor Email: duncans@vt.edu",
    "Advisor Email: fconfort@vt.edu",
    "Advisor Email: khosig@vt.edu",
    "Advisor Email: Craig.Thatcher@asu.edu",
    "Advisor Email: kzhou@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:07Z (GMT). No. of bitstreams: 2  Aigster_A_D_2009_Copyright.pdf: 108455 bytes, checksum: 246e6f38cbf0e364b06f3459e5c43adf (MD5)  Aigster_A_D_2009.pdf: 1028691 bytes, checksum: 565caad42e2629ab2182d9b5839490a8 (MD5)    Previous issue date: 2009-09-01"
  ],
  "handle": "28934",
  "identifier_other": "etd-09102009-135325",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09102009-135325/",
  "identifier_uri": "http://hdl.handle.net/10919/28934",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Aigster_A_D_2009_Copyright.pdf",
    "Aigster_A_D_2009.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "amylose",
    "cereal bars",
    "consumer acceptability",
    "glucose response",
    "postprandial",
    "reactive oxygen species",
    "Resistant starch"
  ],
  "title": "Physicochemical and Sensory Properties of Resistant Starch-Based Cereal Products and Effects on Glycemic and Oxidative Stress Responses in Hispanic Women",
  "type": "Dissertation"
}