{
  "contributor_author": "Gu, Hongmei",
  "contributor_committeechair": "Zink-Sharp, Audrey G.",
  "contributor_committeemember": [
    "Youngs, Robert L.",
    "Diller, Thomas E.",
    "Lamb, Fred M.",
    "Kamke, Frederick A."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:16:08Z",
  "date_adate": "2001-09-13",
  "date_available": "2014-03-14T20:16:08Z",
  "date_issued": "2001-08-09",
  "date_rdate": "2002-09-13",
  "date_sdate": "2001-09-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The importance of precise values for the parameters used in heat and mass transfer models has been demonstrated by many research studies. Thermal conductivity values used in previous models are usually empirical and fluctuate. Theoretical analysis and estimations of wood thermal conductivities in the radial and tangential directions were conducted with the geometric models built up from the macro- and micro-structure observations. Theoretically, thermal conductivity in the radial direction is about 1.5 to 2.5 times of the tangential direction for softwood species with moisture content (MC) below Fiber Saturation Point (FSP). When MC is over the FSP, tangential radial thermal conductivity both increase dramatically and are linear function of MC. The two thermal conductivity values are close with a ratio of near one estimated by the model for MC above the FPS. In hardwood species, radial thermal conductivity estimated by the model is 1.5 times of the tangential thermal conductivity. Validation tests for model estimations of thermal conductivities in the radial and tangential directions for three wood species showed the reliability of the geometric models developed in this project. Correlations between the wood thermal conductivity and structure parameters, such as latewood percentage and cell wall percentage, were examined. Linear relationships for the thermal conductivity and average temperature in wood were established in both radial and tangential directions of three wood species. <p> A two-dimensional transient heat conduction model was developed utilizing thermal conductivity values derived from geometric models. The anisotropic material property affect on heat transport in radial and tangential directions was discussed using an assumed situation. The simulation run showed slightly faster heat flow in the radial direction than in the tangential direction due to higher thermal conductivity in the radial direction. Validation tests on practical wood blocks showed the 2D model with the use of theoretical thermal conductivity values can predict good temperature distribution in wood during the heating process. However, in the practical wood samples with curved rings on the cross section, no significant difference was found in the two transverse directions. <p> Mathematica software was introduced in this study for the intense and complicated math calculations and model programming. Mathematica was found to be a powerful technique for solving sophisticated math problems. It had abundant and flexible plotting options for providing optimized presentations for the results. These advantages make Mathematica popular for engineering modeling research.",
  "description_provenance": [
    "Author Email: hgu@utk.edu",
    "Advisor Email: ryoungs@vt.edu",
    "Advisor Email: tdiller@vt.edu",
    "Advisor Email: fml195@vt.edu",
    "Advisor Email: agzink@vt.edu",
    "Advisor Email: kamkefa@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:08Z (GMT). No. of bitstreams: 15 06chapterOne.pdf: 149635 bytes, checksum: 4696e8e94348ce90c533280b465a43b6 (MD5) 09ChapterTwo-5and6.pdf: 1464471 bytes, checksum: 9d3fe6ca3cabbfd8bcda3189d0b026bb (MD5) 00FrontPage.pdf: 18515 bytes, checksum: 27ff09db5ba7720d85249f38ada39806 (MD5) 04TOF.pdf: 60488 bytes, checksum: 05b063a83027af6ef2cf5fa1a8a71924 (MD5) 01Abstract.pdf: 13537 bytes, checksum: 69fb4cdf35fda6b8337bb101bf64a8e7 (MD5) 05TOT.pdf: 26309 bytes, checksum: 774c481f4c03ddf6f0dafaa79fec4f8e (MD5) 07ChapterTwo-1and2.pdf: 277249 bytes, checksum: d02b07fe3717fa31e1b0874dbc0f5b48 (MD5) 13AppendixA.pdf: 336193 bytes, checksum: 5658693b4c9a624f5eb8e4670fd23ee6 (MD5) 11ChapterFour.pdf: 36431 bytes, checksum: 5e11028fcf26306c62ecd229c5b5f5ff (MD5) 10ChapterThree.pdf: 1010165 bytes, checksum: 3df34fd3b8df941ef4dbcad0924defd9 (MD5) 12Vita.pdf: 9158 bytes, checksum: 3d541cc64b13a7b6025a92e771d66892 (MD5) 02Acknowledgement.pdf: 10240 bytes, checksum: 8ae7c51910f799536e2e72c6037dbbc0 (MD5) 03TOC.pdf: 59593 bytes, checksum: 4b4a43bcc207768bbe82b77c022c49f8 (MD5) 14AppendixB.pdf: 160444 bytes, checksum: 48cfbf13d65d644a862ead440c25b3d6 (MD5) 08ChapterTwo-3and4.pdf: 886783 bytes, checksum: 4141f55334267a9486f2c9fd4e65c7cd (MD5)   Previous issue date: 2001-08-09"
  ],
  "handle": "28938",
  "identifier_other": "etd-09112001-113739",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09112001-113739/",
  "identifier_uri": "http://hdl.handle.net/10919/28938",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "06chapterOne.pdf",
    "09ChapterTwo-5and6.pdf",
    "00FrontPage.pdf",
    "04TOF.pdf",
    "01Abstract.pdf",
    "05TOT.pdf",
    "07ChapterTwo-1and2.pdf",
    "13AppendixA.pdf",
    "11ChapterFour.pdf",
    "10ChapterThree.pdf",
    "12Vita.pdf",
    "02Acknowledgement.pdf",
    "03TOC.pdf",
    "14AppendixB.pdf",
    "08ChapterTwo-3and4.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Geometric modeling",
    "Finite difference",
    "numerical model",
    "Thermal conductivity",
    "Anatomical structure"
  ],
  "title": "Structure Based, Two-dimensional, Anisotropic, Transient Heat Conduction model for Wood.",
  "type": "Dissertation"
}