{
  "contributor_author": "Herrera-Alonso, Jose M",
  "contributor_committeechair": "Eva Marand",
  "contributor_committeemember": [
    "John C. Little",
    "Donald G. Baird",
    "Stephen M. Martin"
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:16:06Z",
  "date_adate": "2009-09-30",
  "date_available": "2014-03-14T20:16:06Z",
  "date_issued": "2009-08-31",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-09-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objective of this study was to determine if the method of incorporation of a silicate layered nanoclay into a polymer matrix can affect the barrier properties of the pristine polymer in order to decrease the transport of volatile organic compounds (VOC) in indoor air. Building materials are a primary source for VOCs.  These emissions are a probable cause of acute health effects and discomfort among occupants and are known to diminish productivity. The predicted concentrations of several of the VOCs emitted by structural insulated panels (SIP) are of concern with respect to health and comfort of occupants. The main issue related to the barrier membranes is the dispersion properties of the nanoclays in the polymer matrix, and the generation of a tortuous pathway that will decrease gas permeation. The tortuous pathway is created by a nanoclay filler, whose ideal exfoliated structure has high surface area, and high aspect ratio. By choosing the appropriate surfactants, the nanoclays can be modified to allow improved molecular interactions between the nanoclay and the polymer matrix.<p> Several studies were performed in order to evaluate the dispersion properties of the nanoclay in the polymer matrix. Polymer/clay nanocomposites barrier membranes were generated via different synthesis methods. In the first study, barrier membranes were composed of a polyurethane, Estane ® 58315, and different nanoclays, Cloisite ® 10A, Cloisite ® 20A, Cloisite ® 30B. The interaction of the polyurethane and the different surfactants used to organically modify the nanoclay was evaluated. The dispersion of the clay platelets was analyzed by varying the pre-processing method; sonication vs stirring. The decrease in gas permeability results was enhanced by the effect of pre-processing via sonciation in comparison to plain stirring. These results also suggest that nanoclay platelets modified with alkylammonium groups with one tallow tail Cloisite ® 10A and Cloisite ® 30B, allow better dispersion and penetration of the polymer within the basal spacing of the nanoclays. Once the decrease in gas permeability was confirmed, the next challenge was to study and evaluate the performance of the polyurethane/clay nanocomposites barrier membranes in the determination of diffusivity coefficients for volatile organic compounds (VOCs). This was achieved via gravimetric sorption characterization. This method allowed for characterization of the sorption and desorption phenomena of VOC in barrier membranes. Barrier membranes pretreated with sonication demonstrated lower diffusivity coefficients than those only treated with stirring. At high clay loadings, 50 wt% of nanoclay in the polymer, the decrease in diffusivity coefficients for VOCs such as butanol and toluene, was found to be one order of magnitude. Other VOCs such as decane and tetradecane also showed a significant decrease in diffusivity coefficient. The results for VOC sorption studies suggest that there is some variability. <p> In order to enhance the exfoliation of the clay, we decided to examine in situ polymerization of poly (n-butyl methacrylate) in the presence of nanoclay. In this study the clay wt% was kept at a low concentration of 1-5 wt%. The surface modification of natural montmorillonite, Cloisite ® Na+, was achieved via ion exchange, and the effect of pre-processing was also explored. The modification rendered a tethered group on the surface of the clay that was able to react with the monomer/oligomer chains and thus expand and exfoliate the clay platelets. Gas permeation data suggest that sonication also produced better barrier properties than its counterpart stirring. XRD diffractograms also confirmed exfoliation of the clay platelets in the poly (n-butyl methacrylate) polymer matrix. Thermogravimetric analysis (TGA) suggested that exfoliation of the clay platelets led to improved thermal stability by increasing the decomposition temperature of the membranes. A small increase in Tg also suggested restricted segmental chain motion within the clay platelets. Overall gas permeation decreased even at low clay content. <p>Phenomenological models such as those of Cussler and Nielsen were used to model the experimental permeation results. These models suggest that although the aspect ratio of the clay platelets is within the specifications provided by the manufacturer, it does not reflect the ideal behavior of the models. The last step of this work was to achieve exfoliation of the modified nanoclay platelets via emulsion polymerization of poly (n-butyl methacrylate).  The clay concentration in the emulsion was kept the same as in the in situ polymerization. DLS results suggest a uniform distribution of the polymer/clay nanocomposites particles in the emulsion. Permeation data indicated higher permeation values than the in situ method of synthesis of the nanocomposite membranes. This led us to explore the use of glassy co-polymer of poly(n-butyl methacrylate)-poly(methyl methacrylate) as the matrix. The addition of a more glassy component in the polymer matrix led to improved barrier properties of the nanocomposite membranes. As expected, the copolymer had a higher Tg than the PMMA polymer. Analysis via phenomenological models, also suggested that the chemistry of the co-polymer played an important role in decreasing gas permeability within the polymer/clay nanocomposite membranes, although the effect of the glassy component in the matrix was not quatified by the phenomenological models.",
  "description_provenance": [
    "Author Email: herreraj@vt.edu",
    "Advisor Email: jcl@vt.edu",
    "Advisor Email: dgb@vt.edu",
    "Advisor Email: martinsm@vt.edu",
    "Advisor Email: emarand@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:06Z (GMT). No. of bitstreams: 1 Herrera-Alonso_JoseM-D-2009.pdf: 7672094 bytes, checksum: dec22dc989c9e7e81368212fd570ed57 (MD5)   Previous issue date: 2009-08-31"
  ],
  "handle": "28933",
  "identifier_other": "etd-09102009-095732",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09102009-095732/",
  "identifier_uri": "http://hdl.handle.net/10919/28933",
  "publisher": "Virginia Tech",
  "relation_haspart": "Herrera-Alonso_JoseM-D-2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "barrier materials",
    "nanocomposites",
    "VOC",
    "in situ polymerization"
  ],
  "title": "Polymer/Clay Nanocomposites as Barrier Materials Used for VOC Removal",
  "type": "Dissertation"
}