{
  "contributor_author": "Brands, Charles",
  "contributor_committeechair": "Heflin, James R.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Takeuchi, Tatsu",
    "Indebetouw, Guy J.",
    "Tauber, Uwe C."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:16:08Z",
  "date_adate": "2003-09-17",
  "date_available": "2014-03-14T20:16:08Z",
  "date_issued": "2003-08-24",
  "date_rdate": "2004-09-17",
  "date_sdate": "2003-09-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this thesis, detailed studies are presented into self-assembled, noncentrosymmetric, optically active films. Second harmonic generation (SHG) is used to measure the second order nonlinear optical susceptibility (?(2)) of ionically self-assembled monolayer (ISAM) thin films.  <p> Conventional ISAM films are fabricated by alternately immersing a substrate into oppositely-charged polyelectrolyte solutions. The polyelectrolytes bind electrostatically to the oppositely-charged substrate, and thus reverse the charge of the substrate. The charge reversal limits the amount of adsorbed material and primes the substrate for the next layer. During the deposition of the nonlinear optical (NLO) active layer, the chromophores are attracted to the oppositely-charged surface, which results in net orientation of the chromophores. Some of the net orientation is lost during the deposition of the next NLO-inactive layer as this layer orients some of the chromophores away from the substrate.  <p> A disadvantage of the polymer ISAM deposition method is that although there is a net orientation toward the substrate, a large number of chromophores are randomly or oppositely oriented. This reduces the nonlinear optical response. To overcome this problem, two alternative methods with a better net orientation are discussed: hybrid covalent / ionic deposition and multivalent monomer deposition. In both deposition methods, the NLO-active material is a monomer instead of a polymer. In hybrid covalent / ionic deposition, the NLO-inactive polymer is deposited using electrostatic attraction while the NLO-active monomer is deposited covalently. This forces alignment of the chromophores. The multivalent method uses chromophores with multiple charges on one side of the molecule and one charge (same sign) on the other. The difference in electrostatic attraction causes a preferential orientation of the chromophores during deposition. Attempts have been made to further improve the net orientation by complexation of the monomers with cyclodextrins (cone shaped organic molecules), so far with only limited success.  <p> The SHG response of NLO-active layers near the glass and air interfaces is much stronger than the SHG response of layers in the bulk of the film for all deposition methods and NLO-active materials investigated in this thesis. For larger number of bilayers (the bulk regime), the square root of the SHG signal increases linearly with the number of bilayers as expected for a uniform chromophore orientation. We isolated the interface effects through use of buffer layers of NLO-inactive polymers. The glass interface effect extends roughly one bilayer deep for all investigated materials. The air interface effect is different for polymers and monomers. For monomers, this effect extends only one bilayer deep, while it extends multiple layers deep for polymers.  <p> Using glass cells to contain the polyelectrolyte solutions, we were able to measure the SHG signal in situ, which proved to be a powerful tool to monitor the deposition rate as a function of chosen parameters. All depositions were rapid, on the order of one minute or less. Provided that a minimum concentration is met, the deposition rate and final SHG values are independent of concentration. Bulk layers deposit at the same rate as layers near the interface. For polymer NLO-active layers a secondary, slower growth of SHG is observed that is presumably due to reorganization of the adsorbed polymer layer. This secondary growth is not observed in the deposition of NLO-active monomers.",
  "description_provenance": [
    "Author Email: cbrands@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: takeuchi@vt.edu",
    "Advisor Email: gindebet@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: tauber@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:08Z (GMT). No. of bitstreams: 1 etd.pdf: 2104294 bytes, checksum: a84367eb185500f323258ad473213743 (MD5)   Previous issue date: 2003-08-24"
  ],
  "handle": "28939",
  "identifier_other": "etd-09112003-071527",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09112003-071527/",
  "identifier_uri": "http://hdl.handle.net/10919/28939",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Thin Films",
    "Nonlinear Optics",
    "Interface effects",
    "Second Harmonic Generation"
  ],
  "title": "Interface Effects and Deposition Process of Ionically Self-Assembled Monolayer Films: In Situ and Ex Situ Second Hamonic Generation Measurements",
  "type": "Dissertation"
}