{
  "contributor_author": "Frazier, Matthew Allen",
  "contributor_committeechair": "Khodaparast, Giti A.",
  "contributor_committeemember": [
    "Kulkarni, Rahul V.",
    "Heflin, James R.",
    "Heremans, Jean J."
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:16:07Z",
  "date_adate": "2010-09-23",
  "date_available": "2014-03-14T20:16:07Z",
  "date_issued": "2010-09-03",
  "date_rdate": "2010-09-23",
  "date_sdate": "2010-09-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The goal of this project was to study some unexplored optical and magneto-optical properties of the newest member of III-V ferromagnetic structures, InMnSb, as well as InSb films and InSb/AlInSb quantum wells. The emphasis was on dynamical aspects such as charge and spin dynamics in order to address several important issues of the spin-related phenomena. The objectives in this project were to: 1) understand charge/spin dynamics in NGS with different confinement potentials, 2) study phenomena such as interband photo-galvanic effects, in order to generate spin polarized current, 3) probe the effect of magnetic impurities on the spin/charge dynamics. This thesis describes three experiments: detection and measurement of spin polarized photocurrents in InSb films and quantum wells arising from the circular photogalvanic effect, and measurements of the carrier and spin relaxation in InSb and InMnSb structures by magneto-optical Kerr effect and differential transmission. The samples for our studies have been provided by Prof. Heremans at Virginia Tech, Prof. Santos at the University of Oklahoma, and Prof. Furdyna at the University of Notre Dame.",
  "description_provenance": [
    "Author Email: fraziema@vt.edu",
    "Advisor Email: khoda@vt.edu",
    "Advisor Email: kulkarni@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: heremans@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:07Z (GMT). No. of bitstreams: 1 Frazier_MA_D_2010.pdf: 4088610 bytes, checksum: 3681ea4b122a0abf49d7c0caa9992461 (MD5)   Previous issue date: 2010-09-03"
  ],
  "handle": "28935",
  "identifier_other": "etd-09102010-175624",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09102010-175624/",
  "identifier_uri": "http://hdl.handle.net/10919/28935",
  "publisher": "Virginia Tech",
  "relation_haspart": "Frazier_MA_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Circular photo-galvanic effect",
    "Magneto-optical Kerr effect",
    "Spin polarized  current",
    "Narrow gap semiconductors"
  ],
  "title": "Probe of Coherent and Quantum States in Narrow-Gap Based Semiconductors in the Presence of Strong Spin-Orbit Coupling",
  "type": "Dissertation"
}