{
  "contributor_author": "Hannesdottir, Dagmar Kristin",
  "contributor_committeechair": "Ollendick, Thomas H.",
  "contributor_committeemember": [
    "Bell, Martha Ann",
    "Clum, George A. Jr.",
    "Dunsmore, Julie C.",
    "Scarpa-Friedman, Angela"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:16:09Z",
  "date_adate": "2007-09-28",
  "date_available": "2014-03-14T20:16:09Z",
  "date_issued": "2007-08-31",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-09-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A research study was conducted to examine Fredricksonâ  s Broaden-and-build theory of positive emotions in a speech anxious sample of undergraduate students. Experimental elicitation of positive emotions has previously been shown to speed cardiovascular recovery, increase attention, and broaden thought-action repertoires compared to elicitation of negative or neutral emotions (Fredrickson et al., 2000). 88 undergraduate students were selected from a screening process based on their reported speech anxiety on the Personal Report of Confidence as a Speaker (PRCS). Students who reported low or high speech anxiety completed an anxiety provoking task and were subsequently exposed to either a neutral emotion condition (â  Pipesâ   film) or one of two positive emotion conditions (â  Puppyâ   film or thinking of a happy memory task). Fredricksonâ  s theory was not supported since results showed no differences in cardiovascular recovery, thought-action repertoires, or global thinking for either groups or conditions. However, differences were found for broadened scope of attention on a modified Stroop task where the low anxiety group responded faster to threat words in the neutral and happy memory conditions than after viewing a positive film. Results of the study are discussed in light of attribution theory of emotion and previous studies on the effects of positive emotions.",
  "description_provenance": [
    "Author Email: dkh@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Advisor Email: mabell@vt.edu",
    "Advisor Email: gclum@vt.edu",
    "Advisor Email: jdunsmor@vt.edu",
    "Advisor Email: ascarpa@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:09Z (GMT). No. of bitstreams: 2 abstract.pdf: 54904 bytes, checksum: ed5e8bfc575f037979008d71dcfd0fce (MD5) dissertation.pdf: 2186370 bytes, checksum: 917936fba9e1292a4271d94514acdbcc (MD5)   Previous issue date: 2007-08-31"
  ],
  "handle": "28941",
  "identifier_other": "etd-09112007-171749",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09112007-171749/",
  "identifier_uri": "http://hdl.handle.net/10919/28941",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "abstract.pdf",
    "dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "positive emotions",
    "speech anxiety",
    "Emotion regulation",
    "college students"
  ],
  "title": "Reduction of fear arousal in young adults with speech anxiety through elicitation of positive emotions",
  "type": "Dissertation"
}