{
  "contributor_author": "Yang, Chao",
  "contributor_committeemember": [
    "Etzkorn, Felicia A.",
    "Carlier, Paul R.",
    "Gibson, Harry W.",
    "Brewer, Karen J.",
    "Kingston, David G. I."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:16:09Z",
  "date_adate": "2008-10-17",
  "date_available": "2014-03-14T20:16:09Z",
  "date_issued": "2008-08-26",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-09-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Paclitaxel was isolated from the bark of Taxus brevifolia in the late 1960s. It exerts its biological effect by promoting tubulin polymerization and stabilizing the resulting microtubules. Paclitaxel has become one of the most important current drugs for the treatment of breast and ovarian cancers. <p> Studies aimed at understanding the biologically active conformation of paclitaxel bound on ï ¢â  tubulin are described. In this work, the synthesis of isotopically labeled taxol analogs is described and the REDOR studies of this compound complexed to tubulin agrees with the hypothesis that palictaxel adopts T-taxol conformation. Based on T-taxol conformation, macrocyclic analogs of taxol have been prepared and their biological activities were evaluated. The results show a direct evidence to support T-taxol conformation. <p> (+) Discodermolide is a polyketide isolated from the Caribbean deep sea sponge Discodermia dissoluta in 1990. Similar to paclitaxel, discodermolide interacts with tubulin and stabilizes the microtubule in vivo. Studies aimed at understanding the biologically active conformation of discodermolide bound on ï ¢â  tubulin are described. In this work, the synthesis of fluorescent labeled discodermolide analogs is described and their biological activities were evaluated. Synthetic approaches to fluorescent labeled and isotopically labeled discodermolide analogs discodermolide are also described.",
  "description_provenance": [
    "Author Email: chaoyang@vt.edu",
    "Advisor Email: fetzkorn@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Advisor Email: hwgibson@vt.edu",
    "Advisor Email: kbrewer@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:09Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 1256635 bytes, checksum: 09c737eb24a59fabf98f66a0900f9aa6 (MD5)   Previous issue date: 2008-08-26"
  ],
  "handle": "28942",
  "identifier_other": "etd-09112008-083828",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09112008-083828/",
  "identifier_uri": "http://hdl.handle.net/10919/28942",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "tubulin-binding conformation",
    "macrocyclic taxoids",
    "T-taxol conformation",
    "discodermolide",
    "Taxol",
    "drug targeting",
    "thio-taxol"
  ],
  "title": "Syntheses and Bioactivities of Targeted and Conformationally Restrained Paclitaxel and Discodermolide Analogs",
  "type": "Dissertation"
}