{
  "contributor_author": "Kominsky, Daniel",
  "contributor_committeecochair": [
    "Pickrell, Gary R.",
    "Stolen, Roger Hall"
  ],
  "contributor_committeemember": [
    "Heflin, James R.",
    "Safaai-Jazi, Ahmad",
    "Jacobs, Ira"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:16:10Z",
  "date_adate": "2005-09-28",
  "date_available": "2014-03-14T20:16:10Z",
  "date_issued": "2005-09-06",
  "date_rdate": "2005-09-28",
  "date_sdate": "2005-09-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation reports the development of two new categories of optical fibers.  These are the Random Hole Optical Fiber (RHOF) and the Crucible Technique Hybrid Fiber (CTF).  The RHOF is a new class of microstructure fiber which possesses air holes which vary in diameter and location along the length of the fiber.  Unlike all prior microstructure fibers, these RHOF do not have continuous air holes which extend throughout the fiber.  The CTF is a method for incorporating glasses with vastly differing thermal properties into a single optical fiber.  Each of these two classes of fiber brings a new set of optical characteristics into being.  The RHOF exhibit many of the same guidance properties as the previously researched microstructure fibers, such as reduced mode counts in a large area core.  CTF fibers show great promise for integrating core materials with extremely high levels of nonlinearity or gain.  The initial goal of this work was to combine the two techniques to form a fiber with exceedingly high efficiency of nonlinear interactions.  Numerous methods have been endeavored in the attempt to achieve the fabrication of the RHOF.  Some of the methods include the use of sol-gel glass, microbubbles, various silica powders, and silica powders with the incorporation of gas producing agents.  Through careful balancing of the competing forces of surface tension and internal pressure it has been possible to produce an optical fiber which guides light  successfully.    The optical loss of these fibers depends strongly on the geometrical arrangement of the air holes.  Fibers with a higher number of smaller holes possess a markedly lower attenuation.  RHOF also possess, to at least some degree the reduced mode number which has been extensively reported in the past for ordered hole fibers.  Remarkably, the RHOF are also inherently pressure sensitive.  When force is applied to an RHOF either isotropically, or on an axis perpendicular to the length of the fiber, a wavelength dependent loss is observed.  This loss does not come with a corresponding response to temperature, rendering the RHOF highly anomalous in the area of fiber optic sensing techniques.  Furthermore an ordered hole fiber was also tested to determine that this was not merely a hitherto undisclosed property of all microstructure fibers.  Crucible technique fibers have also been fabricated by constructing an extremely thick walled silica tube, which is sealed at the bottom.  A piece of the glass that is desired for the core (such as Lead Indium Phosphate) is inserted into the hole which is in the center of the tube.  The preform is then drawn on an fiber draw tower, resulting in a fiber with a core consisting of a material which has a coefficient of thermal expansion (CTE) or a melting temperature (Tm) which is not commonly compatible with those of silica.",
  "description_provenance": [
    "Author Email: dkominsky@primephotonics.com",
    "Advisor Email: pickrell@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: stolen@vt.edu",
    "Advisor Email: ajazi@vt.edu",
    "Advisor Email: ijacobs@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:10Z (GMT). No. of bitstreams: 3 FrontMatter2.pdf: 68284 bytes, checksum: b5cd35c533f72637f592bc7dceba496a (MD5) EndMatter.pdf: 326921 bytes, checksum: 493775ae8a697c1a3549e6bf116575e2 (MD5) Dissertation.pdf: 3308012 bytes, checksum: c69eefb0d24f04caf42496a699d60ce4 (MD5)   Previous issue date: 2005-09-06"
  ],
  "handle": "28949",
  "identifier_other": "etd-09122005-142440",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09122005-142440/",
  "identifier_uri": "http://hdl.handle.net/10919/28949",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "FrontMatter2.pdf",
    "EndMatter.pdf",
    "Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Microstructure Optical Fibers",
    "Fiber Optic Sensors",
    "Crucible Technique Fibers"
  ],
  "title": "Development of Random Hole Optical Fiber and Crucible Technique Optical Fibers",
  "type": "Dissertation"
}