{
  "contributor_author": "Perry, Shirley Ann",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Fortune, Jimmie C.",
    "Doolittle, Peter E.",
    "Zeakes, Beverly",
    "Potter, Kenneth R."
  ],
  "contributor_department": "Learning Sciences and Technologies",
  "date_accessioned": "2014-03-14T20:16:10Z",
  "date_adate": "2007-10-15",
  "date_available": "2014-03-14T20:16:10Z",
  "date_issued": "2007-08-29",
  "date_rdate": "2010-10-07",
  "date_sdate": "2007-09-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Determining the Quality of Physical Education Programs in Selected Virginia Schools   Shirley Ann Perry  (ABSTRACT)  The purpose of this study was to determine the extent to which the selected school districts in the Commonwealth of Virginia were following the Virginia school mandates and fulfilling the requirements identified by NASPE and AHA, as critical elements required in a quality physical education program and the NASPE national recommendations. The population for this study was 116 physical education teachers in the Virginia counties of Carroll, Floyd, Giles, Pulaski, Roanoke, Wythe, and the City of Radford. The evaluation criteria used for the study was influenced by the 2006 Shape of the Nation Report.  The instrument used was a web-based survey that consisted of 21 questions in the areas of demographics, time requirements, class size, standards and curriculum, student assessment and program accountability, and school accountability.  The following conclusions were drawn: (1) The school districts followed the Virginia school mandates and overall are implementing the national recommendations; (2) The school districts varied in following the Virginia school mandates and implementing the national recommendations; (3) Even though the schools varied at different grade levels in the same school district, the degree of disparity  was slight; (4) The originally introduced Senate Bill 1130 needs to be signed into law as opposed to the less stringent Senate Bill 1130 that was passed; (5) The Virginia school mandates need to include time requirements for daily physical education for all students K-12; (6) The school districts need to focus on promoting quality physical education programs at all grades and in all areas that were evaluated in the study. The following recommendations were suggested:  (1) Further studies on schools that offer quality physical education programs and the affects  these â  qualityâ   physical education programs have on reducing the percentage of overweight or obese children; (2) Studies of other school districts in the Commonwealth of Virginia and how they compare in following  state mandates, and implementing the national recommendations; (3) School districts performing their own audits of their present physical education programs to determine the quality of their programs.",
  "description_provenance": [
    "Author Email: sperry@pcva.us",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: bzeakes@radford.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:10Z (GMT). No. of bitstreams: 1 final2.pdf: 3704054 bytes, checksum: b543e0428e69c65125af866000e33663 (MD5)   Previous issue date: 2007-08-29"
  ],
  "handle": "28953",
  "identifier_other": "etd-09122007-160457",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09122007-160457/",
  "identifier_uri": "http://hdl.handle.net/10919/28953",
  "publisher": "Virginia Tech",
  "relation_haspart": "final2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Quality Physical Education Programs",
    "Virginia School Mandates",
    "Childhood Obesity",
    "National Recommendations"
  ],
  "title": "Determining the Quality of Physical Education Programs in Selected Virginia Schools",
  "type": "Dissertation"
}