{
  "contributor_author": "Henderson , David Lockhart III",
  "contributor_committeecochair": [
    "Sheetz, Steven D.",
    "Belanger, France"
  ],
  "contributor_committeemember": [
    "Rees, Loren Paul",
    "Tegarden, David P.",
    "Wallace, Linda G."
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:16:10Z",
  "date_adate": "2007-09-25",
  "date_available": "2014-03-14T20:16:10Z",
  "date_issued": "2007-09-07",
  "date_rdate": "2010-10-27",
  "date_sdate": "2007-09-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Although methodology use generally leads to fewer software defects and reductions in development time, the introduction of a formalized systems development methodology is often met with substantial resistance. Motivated by the purported benefits of methodology use, yet resistance to the introduction of a methodology, this study explains developer attitude toward using a formalized commercial methodology.    An important variable for explaining attitude is perceived usefulness, defined as the degree to which using a methodology will enhance a developerâ  s job performance. If, however, a benefit of using a methodology is different than increased job performance, then limiting the definition of perceived usefulness to beliefs surrounding job performance may provide an incomplete representation of what makes a methodology useful to developers. A methodology may be perceived as a rational process, used to achieve objectives such as increasing job performance or as a political process used to achieve objectives particular to one person or group. In order to determine what makes a methodology useful to developers, the perceived usefulness construct was expanded to include benefits of methodology use related toward achieving political objectives. In addition to broadening the perceived usefulness construct, this research also broke down perceived usefulness into its referent dimensions. Decomposing perceived usefulness provided a deeper understanding of what makes a methodology useful to developers and revealed the relative importance of each dimension of perceived usefulness.    The study surveyed 120 developers. Partial least squares regression was used to test the antecedents of developer attitude as well as the hypothesized structure of perceived usefulness. Results indicate that developers will have more favorable attitudes toward methodologies they perceive as useful, easy to use, and consistent with the way they like to develop systems. Additionally, findings suggest that developers may find methodologies not only useful for achieving rational goals such as increasing system quality, raising productivity, and enhancing communication, but also useful for achieving political goals such as increasing career opportunities, showing others that professional development practices are being used, reducing anxiety, and defending against unreasonable user demands.",
  "description_provenance": [
    "Author Email: davidlhenderson@vt.edu",
    "Advisor Email: lrees@vt.edu",
    "Advisor Email: dtegarde@vt.edu",
    "Advisor Email: wallacel@vt.edu",
    "Advisor Email: sheetz@vt.edu",
    "Advisor Email: belanger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:10Z (GMT). No. of bitstreams: 1 DaveHendersonDissertation.pdf: 2064454 bytes, checksum: 1708f9bd114b785957d08b97848b49f2 (MD5)   Previous issue date: 2007-09-07"
  ],
  "handle": "28954",
  "identifier_other": "etd-09122007-195738",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09122007-195738/",
  "identifier_uri": "http://hdl.handle.net/10919/28954",
  "publisher": "Virginia Tech",
  "relation_haspart": "DaveHendersonDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "systems development methodologies",
    "attitude",
    "developer",
    "perceived usefulness"
  ],
  "title": "Explaining Developer Attitude Toward Using Formalized Commercial Methodologies: Decomposing Perceived Usefulness",
  "type": "Dissertation"
}