{
  "contributor_author": "Hu, Deyu",
  "contributor_committeechair": "Burton, John K.",
  "contributor_committeemember": [
    "Moore, David Michael",
    "Lockee, Barbara B.",
    "Potter, Kenneth R.",
    "Doolittle, Peter E."
  ],
  "contributor_department": "Learning Sciences and Technologies",
  "date_accessioned": "2014-03-14T20:16:10Z",
  "date_adate": "2006-10-24",
  "date_available": "2014-03-14T20:16:10Z",
  "date_issued": "2006-09-07",
  "date_rdate": "2006-10-24",
  "date_sdate": "2006-09-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine two scaffolding methods on the performance of students in computer-based concept linking and retention of comprehension. After training and practice in concept mapping and CmapTools--a computer-based concept mapping program, 116 undergraduate students were randomly assigned to one of four treatment groups to work on a computer-based concept mapping task. Students in the no scaffolding (NS) group did not receive any scaffolding. Students in the linking phrase scaffolding (PS) group received linking words or phrases as scaffolding. Students in the articulation hint scaffolding (AS) group received a hint question as scaffolding, which asked them to elaborate on relationships between concepts in full sentences. Students in the linking phrase and articulation hint scaffolding (PAS) group received both scaffolding while working on the computer-based concept mapping task. One week after the treatment, students took a concept linking posttest, in which they constructed a concept map in CmapTools based on a web-based instruction on the human heart. After another week, they took another posttest on retention of comprehension about the heart. Two 2 X 2 factorial Analysis of Variance (ANOVA) were conducted to examine the main effects of linking phrase scaffolding and articulation hint scaffolding and any interaction effect between them on the performance of students in computer-based concept linking and retention of comprehension. The results showed no significant difference in the performance of students in both tests. However, the Pearson's correlation analysis showed that there was a positive correlation between students' performance in computer-based concept linking and retention of comprehension (γ = 0.447, p < 0.01).",
  "description_provenance": [
    "Author Email: dhu@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:10Z (GMT). No. of bitstreams: 1 HuETD.pdf: 2939122 bytes, checksum: 520c77eee37c1a228358557f9ac029b1 (MD5)   Previous issue date: 2006-09-07"
  ],
  "handle": "28950",
  "identifier_other": "etd-09122006-005403",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09122006-005403/",
  "identifier_uri": "http://hdl.handle.net/10919/28950",
  "publisher": "Virginia Tech",
  "relation_haspart": "HuETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "scaffolding",
    "alternative assessment",
    "concept linking",
    "concept map"
  ],
  "title": "The Effects of Scaffolding on the Performance of Students in Computer-based Concept Linking and Retention of Comprehension",
  "type": "Dissertation"
}