{
  "contributor_author": "Lou, Jianying",
  "contributor_committeechair": "Reynolds, Marion R. Jr.",
  "contributor_committeemember": [
    "Smith, Eric P.",
    "Woodall, William H.",
    "Kim, Dong-Yun"
  ],
  "contributor_department": "Statistics",
  "date_accessioned": "2014-03-14T20:16:11Z",
  "date_adate": "2008-10-03",
  "date_available": "2014-03-14T20:16:11Z",
  "date_issued": "2008-09-04",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-09-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Control charts are fundamental SPC tools for process monitoring. When a control chart or combination of charts signals, knowing the change point, which distributional parameter changed, and/or the change size helps to identify the cause of the change, remove it from the process or adjust the process back in control correctly and immediately. In this study, we proposed using maximum likelihood (ML) estimation of the current process parameters and their ML confidence intervals after a signal to identify and estimate the changed parameters. The performance of this ML diagnostic procedure is evaluated for several different charts or chart combinations for the cases of sample sizes   and  , and compared to the traditional approaches to diagnostics. None of the ML and the traditional estimators performs well for all patterns of shifts, but the ML estimator has the best overall performance. The ML confidence interval diagnostics are overall better at determining which parameter has shifted than the traditional diagnostics based on which chart signals. The performance of the generalized likelihood ratio (GLR) chart in shift detection and in ML diagnostics is comparable to the best EWMA chart combination. With the application of the ML diagnostics naturally following a GLR chart compared to the traditional control charts, the studies of a GLR chart during process monitoring can be further deepened in the future.",
  "description_provenance": [
    "Author Email: jlou@vt.edu",
    "Advisor Email: mrr@vt.edu",
    "Advisor Email: epsmith@vt.edu",
    "Advisor Email: bwoodall@vt.edu",
    "Advisor Email: dongyunkim@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:11Z (GMT). No. of bitstreams: 1 Dissertation.Jianying.Lou.pdf: 762463 bytes, checksum: aaaa4a51acae7925d467d5d9a9ddd735 (MD5)   Previous issue date: 2008-09-04"
  ],
  "handle": "28957",
  "identifier_other": "etd-09122008-151143",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09122008-151143/",
  "identifier_uri": "http://hdl.handle.net/10919/28957",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.Jianying.Lou.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "maximum likelihood",
    "diagnostic procedure",
    "signal",
    "Control chart",
    "generalized likelihood ratio"
  ],
  "title": "Diagnostics after a Signal from Control Charts in a Normal Process",
  "type": "Dissertation"
}