{
  "contributor_author": "Elias, Carlos Guillermo",
  "contributor_committeechair": "Alwang, Jeffrey R.",
  "contributor_committeemember": [
    "Pease, James W.",
    "McGuirk, Anya M.",
    "McDowell, George R.",
    "Taylor, Daniel B."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:16:11Z",
  "date_adate": "2008-11-18",
  "date_available": "2014-03-14T20:16:11Z",
  "date_issued": "2008-08-04",
  "date_rdate": "2008-11-18",
  "date_sdate": "2008-09-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation contains three related papers.  The first paper revisits the concept of integrated rural development and provides examples on how to design balanced development work programs for the Trifinio region, a small rural region shared by 3 Central American countries.  Work programs should balance 3 development objectives: economic development, social development and environmental protection.  Finding a balance between these 3 competing objectives is difficult.  The literature of Sustainable Development recognizes that policy makers often fail to balance objectives while the Integrated Rural Development literature points out the challenges of combining the objectives in a manageable project.  We argue that, by focusing on identifying sources of economic friction and by accurately measuring tradeoffs using appropriate tools, we can design sound work programs.  We present a toolkit that allows policy makers to identify sources of economic friction, measure their drag on the economy, and prioritize these sources so as to reduce the frictions that slow rural development.  The toolkit contains 4 tools to assist in program design and 1 for implementation.  GIS and building municipal indices of outcomes, household surveys, conjoint analysis and economic field experiments, are the tools that we have applied to design work programs in the Trifinio.  In addition, balanced programs must be multi-dimensional in scope so we propose a tool that focuses on the institutional setup required for successful program execution.  Finally we make policy recommendations and suggest additional tools that may also be added to our tool kit.    In the second paper we create municipal indices of agricultural value of production, personal consumption and poverty in the Trifinio region of Central America with the objective of using them to guide investment priorities.  Our indices synthesize information from the complex economic, social and geographic system of this region.  In this respect we depart from established practices of estimating indicesâ  for outcomes such as competitivenessâ  that select factors and create the index by adding them up.  The established practice follows a normative approach because the index results from adding factors that should have an impact on the outcome.  In this context the index author does not observe the outcome or the impact of factors; and does not know the functional relationship between factors and outcome.  The author assumes all the information to create indices.  Our methodology follows a positive approach and departs from the established practice because we estimate the outcome and identify factors that have an impact on it. To do it we use household survey and municipal level data to estimate determinants of agricultural value of production, consumption and poverty for the 45 municipalities in the Trifinio region.  We then show how to identify municipalities in greatest need, identify factors of greatest impact on the outcome, and identify complementary activities.  In addition we use GIS to develop a method that allows for the â  generationâ   of missing agricultural-related data by extrapolating high quality yet limited information from a subsection of the region to the whole.  The data generated has been validated in the field by agriculture experts thus confirming the legitimacy of this innovation.  Finally we offer policy recommendations.  The final paper presents an economic model of group formation with an application to data collected from an agricultural credit program in western Honduras.  We formulate a simple theory of group formation using the concept of centers of gravity to explain why individuals join a group.  According to our theory, prospective members join based on the potential benefits and costs of group membership, and based on their perception of social distance between themselves and other group members.  Social distance is unobservable by outsiders but known by the individual: if you are in then you know who has blue hair.  Thus, we argue that social distance helps explain preferences for group formation.  To test our theory we analyze data collected from members and non-members of PRODERT, a program that has helped create 188 â  Cajas Ruralesâ   (CRs).  Using conjoint analysis we test for differences in preferences between members and non-members for the main attributes of the CR.  We find that members and non-members exhibit similar preferences for the attributes of the CR; therefore non-membership is not related to supply factors.  Using information gathered by executing field experiments, we estimate a proxy for social distance.  We use this proxy to run a group formation equation and find that it explains, along with individual characteristics, participation in the CR.  Finally we offer suggestions on how to balance performance and coverage in programs in which beneficiaries decide who joins.  Small cohesive groups may show exceptional performance at the cost of low coverage, and the opposite may be true.",
  "description_provenance": [
    "Author Email: cgaelias@gmail.com",
    "Advisor Email: Jim.Pease@vt.edu",
    "Advisor Email: anya.mcguirk@sas.com",
    "Advisor Email: George.McDowell@nrvunwired.net",
    "Advisor Email: alwangj@vt.edu",
    "Advisor Email: taylord@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:11Z (GMT). No. of bitstreams: 1 submission_format_3.pdf: 3004088 bytes, checksum: dca6dc385df523c90b4c8928c7936abf (MD5)   Previous issue date: 2008-08-04"
  ],
  "handle": "28958",
  "identifier_other": "etd-09122008-161325",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09122008-161325/",
  "identifier_uri": "http://hdl.handle.net/10919/28958",
  "publisher": "Virginia Tech",
  "relation_haspart": "submission_format_3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Economic Development",
    "Rural Development",
    "Trifinio",
    "GIS",
    "Indices",
    "Social Distance"
  ],
  "title": "Balancing competing development objectives in the Trifinio region of Central America: economic and social development and environmental protection",
  "type": "Dissertation"
}