{
  "contributor_author": "DeMato, Doris S.",
  "contributor_committeechair": "Curcio, Claire Cole Vaught",
  "contributor_committeemember": [
    "Singh, Kusum",
    "Agnew, Tom",
    "Hutchins, David E.",
    "Hohenshil, Thomas H."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:16:13Z",
  "date_adate": "2001-09-17",
  "date_available": "2014-03-14T20:16:13Z",
  "date_issued": "2002-09-03",
  "date_rdate": "2002-09-17",
  "date_sdate": "2001-09-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Job Satisfaction Among Elementary School Counselors  in Virginia: Thirteen Years Later By Doris S. DeMato Committee Chairperson: Claire Cole Curcio \t\tProfessor and Program Leader, Counselor Education (ABSTRACT) \tThis study was conducted to determine the current job satisfaction level of elementary school counselors in Virginia and compare it with elementary school counselors surveyed in 1995 and 1988. At the time of the 1988 survey, the Virginia Board of Education had passed a resolution to phase elementary guidance and counseling programs into the public schools over a four-year period beginning in the 1986-1987 school year. The elementary school counseling program was in full effect when the 1995 survey was conducted. In 2001 the program was no longer state mandated, but instead was a local option to be determined by school boards. An array of social and political changes have taken place since the first two studies were conducted by Kirk (1988) and Murray (1995) that may have impacted how satisfied counselors in Virginia are with their jobs. Because the job satisfaction level of elementary school counselors in Virginia in 2001 was undetermined, this study was undertaken .    \tTwo mailed questionnaires were used to collect the data. An Individual Information Form (IIF)  and a modified version of the Minnesota Satisfaction Questionnaire (MSQ) were sent to 444 elementary school counselors who were members of the Virginia School Counselor Association. The total response rate was 76.35%.   \tIn the current study, 90.9% of counselors surveyed indicated they were either satisfied or very satisfied with their jobs, while 9.1% were very dissatisfied or dissatisfied. Of the 20 aspects of work measured by the MSQ, counselors only indicated dissatisfaction with the compensation area. The two demographic variables of educational degree status and counselors' intent to remain in the current position were found to be predictors of job satisfaction for counselors in 2001. \tA majority of all counselors in the 2001 study responded affirmative to whether the current social and political climate affected their feelings about their jobs. Counselors expressed feeling dissatisfaction with the lack of a state mandated counseling program and feeling stress and pressure from conflicting role expectations and demands.  \tCompared to counselors surveyed in 1995 and 1988, the overall level of job satisfaction in 2001 is similar. There were six areas of counselors' jobs that produced the most satisfaction in all three studies although the order varied somewhat. These areas were social service, moral values, creativity, activity, variety, and ability utilization. In all three studies, counselors were the least satisfied with the same three areas which included compensation, company policies, and advancement. Job security was the fourth area producing the most dissatisfaction in both the 2001 and 1995 studies, while it was eighth in 1988. There was an increase of about 5% in the number of counselors who are dissatisfied with their jobs in 2001 compared to 1995 and about a 2% increase from 1988. There has been a slight increase across all three studies in the percentage of counselors who are very satisfied with their jobs.",
  "description_provenance": [
    "Author Email: dnjdemato@lynchburg.net",
    "Made available in DSpace on 2014-03-14T20:16:13Z (GMT). No. of bitstreams: 1 final2.pdf: 643909 bytes, checksum: a032925396dee8fef76f11a778feb72c (MD5)   Previous issue date: 2002-09-03"
  ],
  "handle": "28964",
  "identifier_other": "etd-09132001-131513",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09132001-131513/",
  "identifier_uri": "http://hdl.handle.net/10919/28964",
  "publisher": "Virginia Tech",
  "relation_haspart": "final2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Role Conflict",
    "Stress",
    "Elementary School Counseling",
    "Job Satisfaction"
  ],
  "title": "Job Satisfaction Among Elementary School Counselors in Virginia: Thirteen Years Later",
  "type": "Dissertation"
}