{
  "contributor_author": "Pankow, Shannon Anderson",
  "contributor_committeechair": "Johnson, Scott W.",
  "contributor_department": "Marriage and Family Therapy",
  "date_accessioned": "2014-03-14T20:16:11Z",
  "date_adate": "2000-09-22",
  "date_available": "2014-03-14T20:16:11Z",
  "date_issued": "2000-09-11",
  "date_rdate": "2001-09-22",
  "date_sdate": "2000-09-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Using survey data gathered by both Internet and mailed questionnaires, 125 graduates of COAMFTE-accredited marriage and family therapy (MFT) programs imparted information about their perspectives on their MFT training, their current and desired career practices, and their  advice to MFT trainees and graduates about maximizing career options.  The results demonstrated that MFT graduates attach many different meanings to the training and career experiences they've had.  Marriage and family therapists work in a variety of settings, including agency and administrative work, private practice, academia, pastoral settings, school settings,  medical administration and education, and residential treatment settings.  Some graduates have  left the MFT field to pursue other career avenues.  The average income for MFT graduates in this sample was approximately $52,000 for doctoral-level graduates and $36,000 for masters-level graduates.  Although approximately 72% of the participants reported satisfaction with their current  professional position, several themes emerged in the data which indicate areas in which graduates felt unprepared when they entered the work force.  Those areas include:  information about the contemporary mental health marketplace, such as working with managed care and insurance companies and the political ramifications of being a marriage and family therapist in a professional climate dominated by other mental health disciplines.  MFT graduates also reported lacking sufficient training in diagnosis and use of the DSM.  Among the most valuable training experiences for participants were the clinical internship/practicum and the associated supervision received. Implications for the training and socialization of MFTs into the world of professional practice are discussed, along with suggestions for future research.",
  "description_provenance": [
    "Author Email: shannon_pankow@hotmail.com",
    "Advisor Email: scottwj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:11Z (GMT). No. of bitstreams: 1 pankowdiss.pdf: 401930 bytes, checksum: 450b6bc327176d5017f193e29c9e6160 (MD5)   Previous issue date: 2000-09-11"
  ],
  "handle": "28961",
  "identifier_other": "etd-09132000-15100014",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09132000-15100014/",
  "identifier_uri": "http://hdl.handle.net/10919/28961",
  "publisher": "Virginia Tech",
  "relation_haspart": "pankowdiss.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "marriage and family therapy",
    "mental health",
    "career",
    "training",
    "psychotherapy"
  ],
  "title": "Career Practices and Training Perspectives of Marriage and Family Therapy Program Graduates",
  "type": "Dissertation"
}