{
  "contributor_author": "Bullions, Todd Aaron",
  "contributor_committeechair": "Loos, Alfred C.",
  "contributor_committeemember": [
    "Dillard, David A.",
    "Baird, Donald G.",
    "Kander, Ronald G.",
    "McGrath, James E."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:16:11Z",
  "date_adate": "2000-09-18",
  "date_available": "2014-03-14T20:16:11Z",
  "date_issued": "2000-09-04",
  "date_rdate": "2001-09-18",
  "date_sdate": "2000-09-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The initial objective of this research project was to determine the feasibility of manufacturing carbon fiber-reinforced (CFR) composites with a matrix consisting of a phenylethynyl-terminated version of a thermoplastic poly(etherimide) termed PETU.  Successful composite manufacture with 3,000 g/mol (3k) PETU led to a survey of CFR 3kPETU mechanical properties for comparison with other high-performance composites.  Encouraging results led to a study of moisture sorption effects on CFR 3kPETU properties.  The success of these initial studies spawned the large scale production of 2,500 g/mol (2.5k) PETU. <p> Thermal characterization of neat and CFR 2.5kPETU via differential scanning calorimetry, dynamic mechanical thermal analysis, and parallel plate rheometry resulted in an understanding of the influence of cure time and temperature on reaction progress via both reaction kinetics and monitoring of the glass transition temperature.  From the rheological characterization, a two-stage, dual-Arrhenius model was developed to successfully model isothermal complex viscosity over the range of processing temperatures. <p> Neat 2.5kPETU and CFR 2.5kPETU specimens were exposed separately to elevated temperature environments of different moisture and different oxygen concentrations to evaluate the effects of moisture absorption, moisture desorption, and thermal oxidation on material properties.  Moisture absorption took place in a 90 °C / 85% relative humidity environment followed by moisture desorption in a 90 °C / 10% relative humidity environment.  Thermal-oxidative aging for up to 5000 hours took place at 204 204 °C in environments of four different oxygen partial pressures:  0.0 kPa, 2.84 kPa, 20.2 kPa, and 40.4 kPa.  Following exposure to the different aging environments, the specimens were tested for retention of mechanical properties.  In addition, moisture sorption properties were measured. <p> Results from the moisture sorption studies on CFR 3kPETU and CFR 2.5kPETU suggest that fully cured composites will withstand moisture absorption and desorption with negligible effects on mechanical properties, whereas, lack of full cure allows moisture sorption to permanently damage the composites.  Despite a lack of mass loss or visual evidence of degradation following thermal-oxidative aging, a decline in mechanical properties was observed with the reduction becoming greater with longer aging times and higher oxygen partial pressures.",
  "description_provenance": [
    "Author Email: tbullion@vt.edu",
    "Advisor Email: dillard@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: aloos@vt.edu",
    "Advisor Email: rkander@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:11Z (GMT). No. of bitstreams: 1 bullions.pdf: 10959992 bytes, checksum: 7bcda9592acd3b94c03757283b7fb355 (MD5)   Previous issue date: 2000-09-04"
  ],
  "handle": "28962",
  "identifier_other": "etd-09132000-15470046",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09132000-15470046/",
  "identifier_uri": "http://hdl.handle.net/10919/28962",
  "publisher": "Virginia Tech",
  "relation_haspart": "bullions.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "glass transition temperature",
    "rheology",
    "composite",
    "dry powder prepregging",
    "phenylethynyl-terminated poly(etherimide)",
    "moisture",
    "thermal-oxidative aging",
    "cure kinetics"
  ],
  "title": "Manufacture of and Environmental Effects on Carbon Fiber-Reinforced PhenylEthynyl-Terminated Poly(EtherImide)",
  "type": "Dissertation"
}