{
  "contributor_author": "Bekker, Andrey",
  "contributor_committeechair": "Eriksson, Kenneth A.",
  "contributor_committeemember": [
    "Rimstidt, james Donald",
    "Read, James Fredrick",
    "Bambach, Richard K.",
    "Kaufman, Alan Jay",
    "Karhu, Juha A."
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:16:13Z",
  "date_adate": "2001-09-13",
  "date_available": "2014-03-14T20:16:13Z",
  "date_issued": "2001-08-24",
  "date_rdate": "2002-09-13",
  "date_sdate": "2001-09-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Evidence of three glaciations in Paleoproterozoic successions of North America and at least one on three other continents, suggests that these glaciations were of global extent.  In common with the Neoproterozoic record, carbonates cap the glacials.  However, the relationship between biogeochemical cycling of carbon and ice ages has not been fully appreciated.  This research involved the sedimentology and isotope stratigraphy of carbonates and shales in Paleoproterozoic glacially-influenced successions of Wyoming and South Africa.  Carbonates of the Vagner Formation cap the middle of three diamictites in the Snowy Pass Supergroup, Medicine Bow Mountains, WY.  The Duitschland Formation occurs between two glacial horizons in South Africa.  Limestones retain negative d13C values for over 60 m in the Vagner Formation, and for over 100 m in the lower part of the Duitschland Formation.  Isotope compositions of TOC from the lower part of the Duitschland Formation reveal pronounced enrichment resulting in significantly lower fractionation between organic and inorganic carbon.  This is similar to enrichment noted in Neoproterozoic cap carbonates.  Combined with strongly positive carbon isotope compositions in upper Duitschland carbonates, the data from the Vagner Formation underscores strongly positive-to-negative carbon isotope trends bracketing Paleoproterozoic glaciations.  These trends mimic those noted in Neoproterozoic glacial successions and possibly indicate a recurrence of global glaciations. The Slaughterhouse and Nash Fork formations significantly postdate the glacial epoch.  Both the lower part of the Nash Fork Formation, Medicine Bow Mountains and the Slaughterhouse Formation, Sierra Madre contains carbonates with 13C-enrichment >+6â ° and locally up to +28%, whereas carbonates higher in the Nash Fork Formation have d13C values between 0 and 2.5%.  This dramatic change in the composition of the Paleoproterozoic ocean is constrained at ca. 2.1 Ga (Karhu, 1993).  Carbonates in the Rawhide Canyon section of the Whalen Group in the Hartville Uplift (the easternmost exposure of the Wyoming Craton) display Î´13C values up to +8.2% suggesting correlation with the Slaughterhouse and Nash Fork formations and their deposition on continuous carbonate platform along the margin of the Wyoming Craton.  These data support an open-marine, and therefore a global origin for the ca. 2.2-2.1 Ga carbon isotope excursion.",
  "description_provenance": [
    "Author Email: abekker@vt.edu",
    "Advisor Email: kaufman@umd.edu",
    "Advisor Email: Juha.Karhu@helsinki.fi",
    "Advisor Email: kaeson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:13Z (GMT). No. of bitstreams: 1 ETD.pdf: 7814295 bytes, checksum: 9508b960e584df67ca6b4f4db67e2151 (MD5)   Previous issue date: 2001-08-24"
  ],
  "handle": "28965",
  "identifier_other": "etd-09132001-152530",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09132001-152530/",
  "identifier_uri": "http://hdl.handle.net/10919/28965",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "biogeochemical cycling of carbon",
    "Paleoproterozoic",
    "carbonates",
    "chemostratigraphy",
    "climate change",
    "glacials"
  ],
  "title": "Chemostratigraphy of the Early Paleoproterozoic carbonate successions (Kaapvaal and Wyoming cratons)",
  "type": "Dissertation"
}