{
  "contributor_author": "Talcott, Kristen Alanna",
  "contributor_committeechair": "Casali, John G.",
  "contributor_committeemember": [
    "Smith-Jackson, Tonya L.",
    "Williams, Henry",
    "Kleiner, Brian M."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:16:14Z",
  "date_adate": "2011-11-15",
  "date_available": "2014-03-14T20:16:14Z",
  "date_issued": "2011-08-30",
  "date_rdate": "2011-11-15",
  "date_sdate": "2011-09-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Noise-induced hearing loss and tinnitus are the two most prevalent service-connected disabilities for veterans receiving compensation (Department of Veterans Affairs, 2010). While it is possible to protect against noise-induced hearing damage with hearing protection devices (HPDs) and hearing protection enhancement devices (HPEDs), military personnel resist using HPDs/HPEDs that compromise their situational awareness, including ability to localize enemy gunfire. Manufacturers of a new generation of â  pass-throughâ   level-dependent HPEDs claim these devices preserve normal or near-normal hearing.  A research study was conducted to evaluate localization of suprathreshold gunshotâ  s report (from blank ammunition) with one passive (3Mâ  s Single-Ended Combat Armsï£ª earplug) and three electronic level-dependent HPEDs (Peltorâ  s Com-Tac IIï£ª electronic earmuffs and Etymoticâ  s EB 1 and EB 15 High-Fidelity Electronic BlastPLGï£ª earplugs), in comparison to the open ear in an in-field test environment with ambient outdoor noise and in 82 dBA diesel truck noise with nine normal and four impaired hearing participants.  Statistical analysis showed worse localization accuracy and response time with the Com-Tac IIï£ª earmuffs than with the other tested HPEDs. Performance with all HPEDs was worse than that with the open ear, except on right-left confusions, in which the Com-Tac IIï£ª stood alone as worst, and in response time, for which the EB 1 earplug was equivalent to the open ear. There was no significant main effect of noise level. There was generally no significant effect of hearing ability. However, participants with impaired hearing had more right-left confusions than those with normal hearing. Subjective ratings related to localization generally corroborated objective localization performance.  Three follow-up experiments were performed: (1) an assessment of the effect of microphone position on localization with the EB 15, which showed a limited advantage when the microphone was positioned near the opening of the ear canal compared to when it was facing outwards; (2) an assessment of Etymoticâ  s QuickSIN test as a predictor localization performance, which showed little correlation with localization performance; and (3) an assessment of the acoustic properties of the experiment site, which was inconclusive with regards to the direction of dominant sound energy from gunshots from each of the shooter positions.",
  "description_provenance": [
    "Author Email: kristen.talcott@gmail.com",
    "Advisor Email: jcasali@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: henry.williams@navy.mil",
    "Advisor Email: bkleiner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:14Z (GMT). No. of bitstreams: 3 Talcott_KA_Permissions.pdf: 381440 bytes, checksum: 80cfd307a154997ac40aa82ccd941bd0 (MD5) Talcott_KA_D_2011.pdf: 40573607 bytes, checksum: fba282418f862bba1a05e7ef6d913682 (MD5) Talcott_KA_IRB.pdf: 714797 bytes, checksum: 33ef0c8442a4f6d911aceacd2556c1e8 (MD5)   Previous issue date: 2011-08-30"
  ],
  "handle": "28969",
  "identifier_other": "etd-09132011-213957",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09132011-213957/",
  "identifier_uri": "http://hdl.handle.net/10919/28969",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Talcott_KA_Permissions.pdf",
    "Talcott_KA_D_2011.pdf",
    "Talcott_KA_IRB.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Noise",
    "Gunshot",
    "Impulse",
    "Hearing Protection",
    "Auditory Localization"
  ],
  "title": "An In-Field Experiment on the Effects of Hearing Protection/Enhancement Devices and Military Vehicle Noise on Auditory Localization of a Gunshot in Azimuth",
  "type": "Dissertation"
}