{
  "contributor_author": "Hyder, Zeshan",
  "contributor_committeechair": "Karmis, Michael E.",
  "contributor_committeemember": [
    "Luxbacher, Kramer Davis",
    "Westman, Erik Christian",
    "Karfakis, Mario G.",
    "Luttrell, Gerald H.",
    "Agioutantis, Zacharias"
  ],
  "contributor_department": "Mining and Minerals Engineering",
  "date_accessioned": "2014-03-14T20:16:15Z",
  "date_adate": "2012-10-10",
  "date_available": "2014-03-14T20:16:15Z",
  "date_issued": "2012-09-06",
  "date_rdate": "2012-10-10",
  "date_sdate": "2012-09-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Underground Coal Gasification (UCG), although not a new concept, is now attracting considerable global attention as a viable process to provide a 창  clean창   and economic fuel from coal. Climate change legislation and the declining position of coal reserves (i.e., deeper and thinner seams) in many parts of the world are promoting and fueling the UCG renaissance. This research presents an analysis of operational parameters of UCG technology to determine their significance and to evaluate the effective range of values for proper control of the process. The study indicates that cavity pressures, gas and water flow rates, development of linkage between wells, and continuous monitoring are the most important operating parameters.  A protocol for the selection of suitable sites for UCG projects is presented in this study. The site selection criteria are developed based on successes and failures of previous experiments and pilot studies. The criteria take into account the site characteristics, coal quality parameters, hydrology of the area, availability of infrastructure and regulatory and environmental restrictions on sites. These criteria highlight the merits and demerits of the selected parameters, their importance in site selection and their economic and environmental potentials.  Based on the site selection criteria, a GIS model is developed to assist in selecting suitable sites for gasification in any given area of interest. This GIS model can be used as a decision support tool as well since it helps in establishing the tradeoff levels between factors, ranking and scaling of factors, and, most importantly, evaluating inherent risks associated with each decision set.  The potential of UCG to conform to different frameworks defined to assess the capability and potential of any project that merits the label, 창  sustainable,창   has been evaluated. It has been established that UCG can integrate economic activity with ecosystem integrity, respect for the rights of future generations to the use of resources and the attainment of sustainable and equitable social and economic benefits. The important aspects of UCG that need to be considered for its sustainable development are highlighted.  In addition, the environmental benefits of UCG have been evaluated in terms of its potential for reduction in greenhouse gas (GHG) emissions. The findings indicate that UCG significantly reduces GHG emissions compared to other competitive coal exploiting technologies. A model to compute the life cycle greenhouse emissions of UCG has been developed, and it reveals that UCG has distinctive advantages in terms of GHG emissions over other technologies and competes favorably with the latest power generation technologies. In addition to GHG emissions, the environmental impacts of these technologies based on various impact assessment indicators are assessed to determine the position of UCG in the technology mix. It is clear from the analysis that UCG has prominent environmental advantages and has the potential to develop and utilize coal resources in an environmentally friendly and economically sound manner.",
  "description_provenance": [
    "Author Email: zeshan@vt.edu",
    "Advisor Email: kraylux@vt.edu",
    "Advisor Email: ewestman@vt.edu",
    "Advisor Email: mario@vt.edu",
    "Advisor Email: luttrell@vt.edu",
    "Advisor Email: mkarmis@vt.edu",
    "Advisor Email: zach@mred.tuc.gr",
    "Made available in DSpace on 2014-03-14T20:16:15Z (GMT). No. of bitstreams: 2 Hyder_Z_D_2012.pdf: 32995556 bytes, checksum: 73ab60fc644405375ad793434cc47194 (MD5) Hyder_Z_2012_Copyright.pdf: 160798 bytes, checksum: e4a5c16f3a190686734d763affc3fcbb (MD5)   Previous issue date: 2012-09-06"
  ],
  "handle": "28970",
  "identifier_other": "etd-09132012-155859",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09132012-155859/",
  "identifier_uri": "http://hdl.handle.net/10919/28970",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Hyder_Z_D_2012.pdf",
    "Hyder_Z_2012_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "GIS",
    "Sustainability and Sustainable Development",
    "Site Characteristics",
    "Underground Coal Gasification",
    "Greenhouse Gas Emissions",
    "Life Cycle Assessment"
  ],
  "title": "Site Characterization, Sustainability Evaluation and Life Cycle Emissions Assessment of Underground Coal Gasification",
  "type": "Dissertation"
}