{
  "contributor_author": "Larkin, George Richard",
  "contributor_committeechair": "Dickey, John. W.",
  "contributor_committeemember": [
    "Wamsley, Gary L.",
    "Dudley, Larkin S.",
    "Wolf, James F.",
    "Kopfler, Frederick C."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:16:15Z",
  "date_adate": "1999-09-21",
  "date_available": "2014-03-14T20:16:15Z",
  "date_issued": "1999-08-16",
  "date_rdate": "2000-09-21",
  "date_sdate": "1999-09-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study provides insights into the behavior of an environmental policy subsystem. The study uses neural network theory to model the Gulf of Mexico Program's allocation of implementation funds. The Gulf of Mexico Program is a prototype effort to institutionalize a policy subsystem. A project implementation fund is at the core of the Gulf of Mexico Program. The United States Environmental Protection Agency provides the implementation fund and the Mexico Program Office (GMPO) administers it.  The GMPO uses the implementation fund to encourage other federal, state, local, and private organizations to undertake projects designed to improve the environmental quality and economic vitality of the Gulf of Mexico and its surrounding region. The implementation fund constitutes a program \"portfolio\" and is the Gulf of Mexico Program's primary means of influencing policy. The way a policy subsystem manages its program portfolio through the allocation of fiscal resources provides important insights about its priority concerns and dominant actors. \t The benefits of this study are threefold. First, the study offers an initial systematic description and analysis of the Gulf of Mexico Program and its policy implementation process. Second, using the Gulf of Mexico Program as a prototype, the study sheds new light on why and how policy subsystems formulate and implement policy. Finally, the study provides a means to assess the value of neural network theory as a technique for modeling and analyzing policy subsystem behavior.",
  "description_provenance": [
    "Author Email: dlarkin@westga.edu",
    "Made available in DSpace on 2014-03-14T20:16:15Z (GMT). No. of bitstreams: 1 PolSub.pdf: 609416 bytes, checksum: d3997a0fa1e272d9ee4edabe4dec5d45 (MD5)   Previous issue date: 1999-08-16"
  ],
  "handle": "28971",
  "identifier_other": "etd-091399-112633",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-091399-112633/",
  "identifier_uri": "http://hdl.handle.net/10919/28971",
  "publisher": "Virginia Tech",
  "relation_haspart": "PolSub.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "policy subsystems",
    "public policy",
    "policy networks",
    "neural networks"
  ],
  "title": "Policy Subsystem Portfolio Management: A Neural Network Model of the Gulf of Mexico Program",
  "type": "Dissertation"
}