{
  "contributor_author": "Sebolt, Stephanie Ann Doswald",
  "contributor_committeechair": "Tilley-Lubbs, Gresilda A.",
  "contributor_committeemember": [
    "Doolittle, Peter E.",
    "Garrison, James W.",
    "Shrum, Judith L."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:16:16Z",
  "date_adate": "2010-11-04",
  "date_available": "2014-03-14T20:16:16Z",
  "date_issued": "2010-09-08",
  "date_rdate": "2010-11-04",
  "date_sdate": "2010-09-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Parental involvement has been at the forefront of many studies leading to the conclusion that increased parental involvement improves academic achievement. Despite findings suggesting the benefits of parental involvement, research reveals a lack of parental involvement among Spanish-speaking parents. The overarching objective of this qualitative case study was to explore how Spanish-speaking mothers make sense of the construct of parental involvement.      This qualitative study was comprised of three cases: one Guatemalan mother and two Honduran mothers each with children attending elementary school. My methodology allowed me to explore and depict historical and sociocultural factors that influence how the mothers view their role in their childrenâ  s education. I collected data through semi-structured interviews, informal observations, and extensive fieldnotes and I conducted on-going analysis on these data.      Data provide evidence that the mothers in the study hold a different perspective of parental involvement from that of school personnel. Their views stem directly from their own historical and cultural knowledge, which differs from that of middle-class, White Americans. They are involved in their childrenâ  s overall education in ways not acknowledged by educators.",
  "description_provenance": [
    "Author Email: ssebolt@vt.edu",
    "Advisor Email: glubbs@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: wesley@vt.edu",
    "Advisor Email: jshrum@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:16Z (GMT). No. of bitstreams: 6 Sebolt_SAD_D_2010_Assent.pdf: 125040 bytes, checksum: 19b7b50d174d1503f63313418607689d (MD5) Sebolt_SAD_D_2010_IRB.pdf: 253971 bytes, checksum: 6a780ce956255e54bd9d78e17d20f0e4 (MD5) Sebolt_SAD_D_2010_Consent.pdf: 132028 bytes, checksum: 8ba779bd4eb6c18257d14def5afd124c (MD5) Sebolt_SAD_D_2010.pdf: 947829 bytes, checksum: dc375f7789d97c586149571603cfef41 (MD5) Sebolt_SAD_D_2010_Observation_Permission_for_Children.pdf: 144427 bytes, checksum: 5e8be824522745ea11c5096a7f59cc69 (MD5) Sebolt_SAD_D_2010_Observation_Permission_for_Parents.pdf: 140404 bytes, checksum: ec3e0679fcafa43a2c68261d9d228e41 (MD5)   Previous issue date: 2010-09-08"
  ],
  "handle": "28979",
  "identifier_other": "etd-09142010-103848",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09142010-103848/",
  "identifier_uri": "http://hdl.handle.net/10919/28979",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Sebolt_SAD_D_2010_Assent.pdf",
    "Sebolt_SAD_D_2010_IRB.pdf",
    "Sebolt_SAD_D_2010_Consent.pdf",
    "Sebolt_SAD_D_2010.pdf",
    "Sebolt_SAD_D_2010_Observation_Permission_for_Children.pdf",
    "Sebolt_SAD_D_2010_Observation_Permission_for_Parents.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Parental Involvement",
    "Student Achievement",
    "Latino",
    "Hispanic",
    "English as a Second Language"
  ],
  "title": "Negotiating Meaning: How Spanish-Speaking Mothers Make Sense of the Construct of Parental Involvement",
  "type": "Dissertation"
}