{
  "contributor_author": "Perkins, Ross A.",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_committeemember": [
    "Holmes, Glen A.",
    "Burton, John K.",
    "Wilkinson, Thomas W.",
    "Magliaro, Susan G."
  ],
  "contributor_department": "Instructional Technology",
  "date_accessioned": "2014-03-14T20:16:15Z",
  "date_adate": "2003-09-17",
  "date_available": "2014-03-14T20:16:15Z",
  "date_issued": "2003-09-05",
  "date_rdate": "2006-09-17",
  "date_sdate": "2003-09-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This case study examined how contextual factors influenced the adaptation of on-line courses created in the United States as they were re-purposed for use in Malawi.<p>  The investigation starts and ends within Year Two of a five year project funded by the United States Agency for International Development (USAID). The grant brings together an instructional technology program at a large research university in the southeastern United States and a newly established national university in Malawi, Africa.<p>  A total of 24 people participated in the study. Of these, nine were directly involved in the adaptation process, five of whom were students from Malawi. Six other Malawian students took part in a formative review of the instructional products. Three professors of instructional technology were also directly involved in the adaptation process.<p>  The participants involved in the adaptation process did their work over the course of one semester. They took pre-existing web-based courses created for an on-line master's degree program in instructional technology and adapted them for use in Malawi by accounting for various contextual elements.<p>  Data included project documents, student-created materials including personal journal reflections, interviews with students and faculty at both institutions, field notes, and personal observations by the researcher. Data analysis procedures followed protocols established for descriptive, qualitative methodologies.<p>   The findings emphasize the importance of a needs assessment and context analysis as developed by people who are native to a particular culture. Instructional designers who are made aware of contextual factors through such documents become more sensitive to cultural issues related to teaching and learning. Negotiation among team members to come to a workable consensus is also important, as project goals inevitably evolve. Another interesting outcome of this study was the fact that not one context, but two, affect adaptation. Whereas the Malawian context impacted content and delivery mechanisms of the courses, the U.S. context influenced the process and procedure for design.",
  "description_provenance": [
    "Author Email: rperkins@vt.edu",
    "Advisor Email: gholmes@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: twilkie@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:15Z (GMT). No. of bitstreams: 1 rperkins_dissertation.pdf: 1779767 bytes, checksum: 2286960b2f4f5c7062e3d5ed45df9725 (MD5)   Previous issue date: 2003-09-05"
  ],
  "handle": "28972",
  "identifier_other": "etd-09142003-141456",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09142003-141456/",
  "identifier_uri": "http://hdl.handle.net/10919/28972",
  "publisher": "Virginia Tech",
  "relation_haspart": "rperkins_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "context",
    "Malawi",
    "Africa",
    "international project",
    "adaptation",
    "on-line learning",
    "distance learning",
    "transformation",
    "instructional technology"
  ],
  "title": "The role of context in instructional design: A case study examining the re-purposing of web-based master's degree courses for use in Malawi",
  "type": "Dissertation"
}