{
  "contributor_author": "Ward, Daniel Lee",
  "contributor_committeechair": "Marini, Richard P.",
  "contributor_committeemember": [
    "Hess, John L.",
    "Beers, Eric P.",
    "Barden, John A.",
    "Harris, James Roger",
    "Byers, Ross E."
  ],
  "contributor_department": "Horticulture",
  "date_accessioned": "2014-03-14T20:16:15Z",
  "date_adate": "2004-09-17",
  "date_available": "2014-03-14T20:16:15Z",
  "date_issued": "2004-08-31",
  "date_rdate": "2005-09-17",
  "date_sdate": "2004-09-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Apple preharvest fruit drop frequently results in severe economic losses.  Cultural control of preharvest drop has relied upon plant growth regulators (PGRs), but the loss of daminozide (Alar) and 2,4,5-TP has severely limited the choices of effective stop-drop compounds. A more complete understanding of factors involved in preharvest drop is therefore imperative. Experiments were conducted to provide information about cellulase activity in the abscission zone, effects of applied auxin and ethylene biosynthesis inhibition on drop, changing sensitivity to abscission induction during the season, and relationships among seed number, fruit weight, and day of drop. Observational studies were used to study effects of fruit maturity, canopy positions, and morphology of stem attachment on time of fruit drop as well as characterizing the natural timing of late-season fruit drop. Increased activity of cellulase, but not polygalacturonase, in the abscission zone was detected within 4 days of cutting fruit to induce abscission. Both aminoethoxyvinyl glycine (AVG) and naphthaleneacetic acid (NAA) applied 2 or 4 days after cutting delayed drop, but  NAA delayed drop 1.6 days longer than did AVG. Fruit of \"RedChief Delicious\"(D) exhibited a significantly reduced sensitivity to abscission-inducing treatments from mid-June until early July compared to earlier orr later in the season. Application of plant growth regulators to cut fruit revealed a significant interaction of NAA treatment with AVG treatment  such that NAA delayed drop when applied with AVG but not without AVG. Fallen fruit had lower starch and higher soluble solids than fruit on the tree on the day of collection. The highest fruit in  the canopy fell an average of 4.4d earlier than the lowest fruit. Day of drop was not different for fruit from king blooms vs. side blooms within an inflorescence.  There was a trend for fruit from first year wood to drop later than fruit from older wood on \"Delicious\", but not \"Smoothee Golden Delicious\" trees. There was no detectable effect of angle of orientation of the subtending spur on the limb, the pedicel:spur abscission zone, or fruit axis of symmetry on time of fruit drop. No difference was detected in time of fruit drop between East and West or North and South sides of the trees. No substantial variation in day of drop of individual fruit was explained by number of seed in the fruit. Daily drop was recorded for three cultivars (\"RedChief Delicious\", \"Smoothee Golden Delicious\", and \"Commander York\") for three years. Variance of average day of drop from year to year was 40.1, while variance among cultivars within a year was 51.8. Variance from tree to tree within each cultivar, within each year, was only 18.6. Multiple regression modeling to identify relationships between weather factors and daily fruit drop revealed that much of the variability in time of drop was due to factors other than the weather events modeled. The best regression models developed explained only 8% to 35% of the variability in time of drop. The most important weather factors were daily minimum temperatures and precipitation. Rain events of greater than 5.0 mm following a drier period appeared to cause increased drop of all three cultivars in one out of the three years investigated.",
  "description_provenance": [
    "Author Email: daward2@vt.edu",
    "Advisor Email: jlhess@vt.edu",
    "Advisor Email: ebeers@vt.edu",
    "Advisor Email: bardenja@vt.edu",
    "Advisor Email: rharris@vt.edu",
    "Advisor Email: marinirp@vt.edu",
    "Advisor Email: rossebye@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:15Z (GMT). No. of bitstreams: 1 DLWDissETD.pdf: 3070244 bytes, checksum: ae2e7193f81138f5fe7b801c6e8054dd (MD5)   Previous issue date: 2004-08-31"
  ],
  "handle": "28973",
  "identifier_other": "etd-09142004-105126",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09142004-105126/",
  "identifier_uri": "http://hdl.handle.net/10919/28973",
  "publisher": "Virginia Tech",
  "relation_haspart": "DLWDissETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cellulase",
    "PGR",
    "starch",
    "weather",
    "abscission",
    "seasonal"
  ],
  "title": "Factors Affecting Preharvest Fruit Drop of Apple",
  "type": "Dissertation"
}