{
  "contributor_author": "Wu, Miaozong",
  "contributor_committeechair": "Jiang, Honglin",
  "contributor_committeemember": [
    "Akers, Robert Michael",
    "Hall, John B.",
    "Liu, Dongmin",
    "Webb, Kenneth E. Jr."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:16:16Z",
  "date_adate": "2007-09-24",
  "date_available": "2014-03-14T20:16:16Z",
  "date_issued": "2007-08-31",
  "date_rdate": "2007-09-24",
  "date_sdate": "2007-09-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The overall objective of this dissertation research was to understand the mechanisms by which serum insulin-like growth factor-I (IGF-I) is regulated by nutritional intake in cattle. Two studies were conducted to achieve this objective. In the first study, effects of feeding levels on basal and growth hormone (GH)-stimulated serum concentrations of IGF-I, IGF binding protein-3 (IGFBP-3) and acid-labile subunit (ALS), and their mRNA expression in the liver were determined in beef cows. It was found that increased nutritional intake did not alter basal concentrations of serum IGF-I, IGFBP-3 or ALS, or their mRNA expression in the liver. However, under increased nutritional intake, GH administration stimulated a greater increase in serum IGF-I concentration, and this greater increase was not due to reduced degradation of IGF-I in serum. Increased nutritional intake did not enhance GH-stimulated IGF-I mRNA expression in the liver, but it increased the amount of IGF-I mRNA associated with polysomes, suggesting that liver translation of IGF-I mRNA is enhanced under increased nutritional intake. Under increased nutritional intake, GH also stimulated greater increases in serum IGFBP-3 and ALS concentrations, but these greater increases were not due to greater expression or translation of their mRNAs in the liver. Taken together, these results suggest that translation of GH-stimulated IGF-I mRNA in the liver is enhanced under increased nutritional intake and this enhancement may be partially responsible for the greater GH-stimulated increase in serum IGF-I concentration. These results also suggest that the greater GH-stimulated increases in serum IGFBP-3 and ALS may be secondary to the greater increase in serum IGF-I because increased IGF-I may increase the formation of IGF-I/IGFBP-3/ALS complexes, thereby increasing the retention of IGFBP-3 and ALS in the blood. In the second study, the effects of food deprivation on serum IGF-I concentration in steers and the underlying mechanism were determined. It was found that food deprivation decreased serum IGF-I concentration and that this decrease was not due to increased IGF-I degradation in serum. Food deprivation decreased liver IGF-I mRNA expression, and this decrease was associated with decreased expression of GH receptor (GHR) mRNA and protein in the liver. Food deprivation was also associated with increased mRNA expression of two inhibitors of the GHR signaling pathway, suppressor of cytokine signaling-2 (SOCS2) and cytokine-inducible SH2 protein (CIS). These results suggest that decreased IGF-I gene expression in the liver may be at least partially responsible for the decrease in circulating IGF-I concentration during food deprivation, and that the former decrease may be due to increased expression of SOCS2 and CIS, and decreased expression of GHR in the liver. Overall, this dissertation research indicates that multiple mechanisms are involved in nutritional regulation of circulating IGF-I concentration in cattle.",
  "description_provenance": [
    "Author Email: amiaowu@vt.edu",
    "Advisor Email: hojiang@vt.edu",
    "Advisor Email: rma@vt.edu",
    "Advisor Email: jbhall@vt.edu",
    "Advisor Email: doliu@vt.edu",
    "Advisor Email: webbk@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:16Z (GMT). No. of bitstreams: 1 MWu07.pdf: 1911555 bytes, checksum: 03f3fd9d9e9d416a8dcbbe573a8e85e0 (MD5)   Previous issue date: 2007-08-31"
  ],
  "handle": "28977",
  "identifier_other": "etd-09142007-104105",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09142007-104105/",
  "identifier_uri": "http://hdl.handle.net/10919/28977",
  "publisher": "Virginia Tech",
  "relation_haspart": "MWu07.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Acid-labile subunit",
    "Cattle",
    "Insulin-like growth factor-I",
    "Nutrition",
    "IGF binding protein-3",
    "Growth hormone"
  ],
  "title": "Nutritional Regulation of Serum Insulin-Like Growth Factor-I Concentration in Cattle",
  "type": "Dissertation"
}