{
  "contributor_author": "Whittaker, Sarah M.",
  "contributor_committeecochair": [
    "Burge, Penny L.",
    "Getz, Hilda M."
  ],
  "contributor_committeemember": [
    "Darden, Ellen",
    "Mathai, Christina",
    "Bodenhorn, Nancy E."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:16:17Z",
  "date_adate": "2004-09-22",
  "date_available": "2014-03-14T20:16:17Z",
  "date_issued": "2004-09-07",
  "date_rdate": "2005-09-22",
  "date_sdate": "2004-09-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Sarah Whittaker Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>Clinical supervision of counselors in training is an integral part of the professional and personal development of counselors. Accrediting bodies in academia and licensure standards in most fields require beginning professionals to receive clinical supervision. During clinical supervision, supervisees frequently experience anxiety and the supervisees' self-efficacy, or belief about their ability to counsel clients, is affected by supervision. The questions addressed in this study were to what extent does clinical supervision affect supervisees' anxiety and self-efficacy and do different types of supervision have varying effects on supervisees' anxiety and self-efficacy. </p> <p>A meta-analysis comprised of ten studies was conducted to determine the influence of supervision on supervisees' anxiety and self-efficacy. Clinical supervision was found to have a medium effect, ES = .454 and ES = .430, on supervisees' anxiety. Clinical supervision had a large, ES = .655, effect on supervisees' self-efficacy. In addition, a qualitative review of the studies included in the meta-analysis yielded methodological concerns in the areas of adequate control group, sample size, representativeness of sample, and follow-up assessment. </p> <p>Due to the small number of studies meeting the meta-analysis criteria, quantitative findings were limited. Therefore, individual interviews with clinical supervisors and supervisees were conducted to corroborate or refute the findings of the meta-analysis and to lend multiple \"voices\" in an attempt to answer the research questions. Face-to-face interviews were conducted with nine supervisees and five supervisors in a Counselor Education program. The results of the interviews corroborated the finding of the meta-analysis that clinical supervision affects supervisees' anxiety and self-efficacy by increasing both. All types of supervision were described as increasing anxiety and self-efficacy with no particular type predominating. </p> <p>Limitations of the research and implications for educators, practitioners, and future research are discussed. A limitation of the meta-analysis was the relatively small number of existing studies meeting the criteria for inclusion. This limited the interpretation of the findings in terms of answering the research questions. The interview portion of the research was limited due to the use of a purposive sample, participants all being students from the same program, and the researcher was also a student in this program. </p> <p>  </p> </body> </html>",
  "description_provenance": [
    "Author Email: whittakers@concord.edu",
    "Advisor Email: dardene@concord.edu",
    "Advisor Email: cmathai@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:17Z (GMT). No. of bitstreams: 1 whittakeretd.pdf: 326261 bytes, checksum: 99a8d3338291bed73845e4d351b85238 (MD5)   Previous issue date: 2004-09-07"
  ],
  "handle": "28983",
  "identifier_other": "etd-09152004-151749",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09152004-151749/",
  "identifier_uri": "http://hdl.handle.net/10919/28983",
  "publisher": "Virginia Tech",
  "relation_haspart": "whittakeretd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "clinical supervision",
    "self-efficacy",
    "anxiety"
  ],
  "title": "A Multi-Vocal Synthesis of Supervisees' Anxiety and Self-Efficacy During Clinical Supervision: Meta-Analysis and Interviews",
  "type": "Dissertation"
}