{
  "contributor_author": "Rothwell, Virginia Leigh",
  "contributor_committeemember": [
    "Hawdon, James E.",
    "Yuan, Anastasia Sue Vogt",
    "Bailey, Carol A.",
    "Shoemaker, Donald J."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:16:18Z",
  "date_adate": "2009-09-29",
  "date_available": "2014-03-14T20:16:18Z",
  "date_issued": "2009-09-11",
  "date_rdate": "2009-09-29",
  "date_sdate": "2009-09-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Various sociological theories of deviance have demonstrated the importance of an individualâ  s attitudes toward deviance in determining whether or not that individual will engage in deviant behavior.  This research contributes to the theoretical and empirical literature on deviant behavior by examining the strength of two cultural factors, the scientific worldview and individualism, in predicting an individualâ  s attitudes toward deviance when tested alongside the tenets of other predominate individual level theories of deviance, namely Hirschiâ  s (1969) social control theory and Sutherlandâ  s (1939) differential association theory.  The sample for this analysis is 202 students from a large research university in Southwest Virginia.  The findings of this research lend support to Sutherlandâ  s (1939) differential association theory and to the scientific worldview as significant predictors of tolerant attitudes toward deviance. Several of the bonds of Hirschiâ  s (1969) social control theory were also supported in this research; however, some failed to predict deviant behavior, leading to the conclusion that future research should focus on clearly elucidating the conceptualization of the social bonds forwarded in the original theory.  Finally, the cultural ideology of individualism was not a significant predictor of tolerant attitudes toward deviance in this study.  Future empirical studies should work to more clearly operationalize this variable as Hawdon (2005) described it and investigate the variables significance as a predictor of tolerant attitudes toward deviance.",
  "description_provenance": [
    "Author Email: vrothwel@vt.edu",
    "Advisor Email: hawdonj@vt.edu",
    "Advisor Email: avy@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: shoemake@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:18Z (GMT). No. of bitstreams: 1 Rothwell_VL_D_2009.pdf: 538766 bytes, checksum: d50379b0657f542b1a4fb3f7250547ad (MD5)   Previous issue date: 2009-09-11"
  ],
  "handle": "28988",
  "identifier_other": "etd-09152009-092751",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09152009-092751/",
  "identifier_uri": "http://hdl.handle.net/10919/28988",
  "publisher": "Virginia Tech",
  "relation_haspart": "Rothwell_VL_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Differential associations",
    "Social control",
    "Individualism",
    "Scientific worldview",
    "Delinquency"
  ],
  "title": "The Relationship between Attitudes toward Deviance and Deviant Behavior:  The Influence of Science, Individualism, Social Bonds and Deviant Peers",
  "type": "Dissertation"
}