{
  "contributor_author": "Kiser, Larry Christopher",
  "contributor_committeechair": "Fox, Thomas R.",
  "contributor_committeemember": [
    "Richter, Daniel D.",
    "Berry, Duane F.",
    "Seiler, John R."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:16:18Z",
  "date_adate": "2011-10-03",
  "date_available": "2014-03-14T20:16:18Z",
  "date_issued": "2011-08-26",
  "date_rdate": "2011-10-03",
  "date_sdate": "2011-09-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Forest plantations in the southeastern U.S. are fertilized to increase growth on infertile, sandy soils. Nitrogen (N) and phosphorus (P) are the most common growth limiting nutrients. A key question that arises following fertilization of these soils is whether the applied fertilizer benefits only the current trees in the stand or also improves long-term site quality. The objectives of this study were to compare accumulation of N and P in the forest floor and mineral soil among unfertilized and fertilized plantations, determine soluble and residual N and P fractions and soluble carbohydrate and phenol fractions in foliage and litter, determine whether higher N in the forest floor from fertilization resulted in increased release of N from the forest floor and increased mineral soil N availability, and determine loblolly pine forest floor decomposition rate and release of nutrients in a simulated disturbance environment. Research was conducted at a 25-year old loblolly pine (Pinus taeda L.) plantation in NC (SETRES) and 13-year old loblolly pine and sweetgum (Liquidambar styraciflua L.) plantations in GA (Mt. Pleasant). Fertilization resulted in increases in mineral soil N that were likely to be temporary and not sustained following cessation of fertilization N applications. This was likely due to an inability of acidic, sandy mineral soils to retain NH4-N and NO3-N. The forest floor accumulated N due to slow release of N during decomposition. Fertilization with N results in only temporary increases in mineral soil N availability that occur during fertilizer application and from forest floor decomposition. Future changes in N availability are primarily determined by decomposition of the forest floor following a disturbance that accelerates decomposition. In contrast to N, fertilization of loblolly pine and sweetgum with P results in a long-term increase in site P availability. Fertilization with P has lasting effects by increasing mineral soil P in stable forms that can be made available for plant uptake over time suggesting increased supply of P to trees in the next rotation. Retention of P in the mineral soil was likely due to the tendency of acidic, sandy mineral soils to accumulate P in Al- and Fe-phosphates.",
  "description_provenance": [
    "Author Email: lckiser@vt.edu",
    "Advisor Email: drichter@duke.edu",
    "Advisor Email: duberry@vt.edu",
    "Advisor Email: trfox@vt.edu",
    "Advisor Email: jseiler@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:18Z (GMT). No. of bitstreams: 1 Kiser_CK_D_2011.pdf: 827912 bytes, checksum: c18a018a4951e5d93c4f84c3432e143b (MD5)   Previous issue date: 2011-08-26"
  ],
  "handle": "28989",
  "identifier_other": "etd-09152011-094724",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09152011-094724/",
  "identifier_uri": "http://hdl.handle.net/10919/28989",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kiser_CK_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "forest fertilization",
    "forest floor decomposition",
    "nitrogen",
    "phosphorus"
  ],
  "title": "Nutrient Retention and Cycling in Southeastern U.S. Loblolly Pine (Pinus taeda L.) and Sweetgum (Liquidambar styraciflua L.) Plantations",
  "type": "Dissertation"
}