{
  "contributor_author": "Jones, Sr., Irving Cornelius",
  "contributor_committeechair": "Parson, Stephen R.",
  "contributor_committeemember": [
    "Earthman, Glen I.",
    "Alexander, David",
    "Tucker, Calanthia",
    "Fortune, Jimmie C."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:16:17Z",
  "date_adate": "1999-09-16",
  "date_available": "2014-03-14T20:16:17Z",
  "date_issued": "1999-07-28",
  "date_rdate": "2000-09-16",
  "date_sdate": "1999-09-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study is to identify critical elements that impact the transition of students who return from an alternative program back into their high school.  In order to address the purpose of this study the following research questions have been investigated: a. What are the critical elements that are reported as having impacted students' success or failure in making the transition from an alternative program back into high school? b. What types of intervention strategies occur when students return to high school from alternative programs? c. How are students returning from alternative programs achieving in terms of their grades, attendance and behavior?  In this study students and parents, along with administrators, counselors and teachers, share their understandings about the value of interactions and interventions.  Their descriptions will help explain why some students achieve success and why some experience failure when they return to high school from an alternative setting.",
  "description_provenance": [
    "Author Email: ijones@albemarle.org",
    "Advisor Email: parson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:17Z (GMT). No. of bitstreams: 1 etd.pdf: 161941 bytes, checksum: ff32cd22c5bb24e37bc5aa9eb7bb2d42 (MD5)   Previous issue date: 1999-07-28"
  ],
  "handle": "28981",
  "identifier_other": "etd-091499-194006",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-091499-194006/",
  "identifier_uri": "http://hdl.handle.net/10919/28981",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Interventions",
    "Interactions",
    "Mentorship",
    "Transition"
  ],
  "title": "Case Studies of Students Transitioning From an Alternative School Back Into High School",
  "type": "Dissertation"
}