{
  "contributor_author": "Conway, M. Christine",
  "contributor_committeechair": "Amacher, Gregory S.",
  "contributor_committeemember": [
    "Sullivan, Jay",
    "Prisley, Stephen P.",
    "Wear, David N.",
    "Haney, Harry L. Jr."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:16:19Z",
  "date_adate": "2003-03-10",
  "date_available": "2014-03-14T20:16:19Z",
  "date_issued": "2002-08-30",
  "date_rdate": "2004-03-10",
  "date_sdate": "2002-09-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study models the timber market entry decisions of nonindustrial private landowners.  It involves examining reservation prices both for harvesting timber from existing forest land and for afforestation of marginal agricultural and abandoned land.  An important conclusion drawn from these models is that financial returns are not the only drivers of these decisions.  Preferences for amenities derived from forests and farmland are also important.  An empirical model follows which characterizes willingness to accept for various landowner groups in Virginia and Mississippi.  We identify preferences and characteristics of landowners and features of forest sites that are important to the unobserved price specific to each landowner.  Estimation results are also used to assess the size of payments needed to encourage harvesting or conversion from agricultural to forest uses with 50% probability. The determination of reservation prices for landowners in different regions aids in forecasting potential timber supplies from NIPF lands that are either actively managed for timber production or are not, as well as from marginal land not yet in forests, under different policy and pricing scenarios.  Furthermore, it gives insight into evolving land use patterns.",
  "description_provenance": [
    "Author Email: conwayc@vt.edu",
    "Advisor Email: jsulliv@vt.edu",
    "Advisor Email: prisley@vt.edu",
    "Advisor Email: dwear@fs.fed.us",
    "Advisor Email: hhaney@vt.edu",
    "Advisor Email: gamacher@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:19Z (GMT). No. of bitstreams: 2 mcconwayETD.pdf: 711227 bytes, checksum: 8afff8b8cd0f575f87feeff6505e42dd (MD5) mcconwayETDAppendix.pdf: 574757 bytes, checksum: cc96bb7091d3bbcf245fe58d15c77f48 (MD5)   Previous issue date: 2002-08-30"
  ],
  "handle": "28991",
  "identifier_other": "etd-09162002-113744",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09162002-113744/",
  "identifier_uri": "http://hdl.handle.net/10919/28991",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "mcconwayETD.pdf",
    "mcconwayETDAppendix.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "nonindustrial private forest landowners",
    "reservation price",
    "harvesting",
    "land use"
  ],
  "title": "Targeting Nonindustrial Private Forest Landowner Groups for Timber Market Entry",
  "type": "Dissertation"
}