{
  "contributor_author": "Flynt, Cynthia J.",
  "contributor_committeecochair": [
    "Singh, Kusum",
    "Bodenhorn, Nancy E."
  ],
  "contributor_committeemember": [
    "Wood, Frank",
    "Day-Vines, Norma L."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:16:20Z",
  "date_adate": "2008-10-13",
  "date_available": "2014-03-14T20:16:20Z",
  "date_issued": "2008-08-28",
  "date_rdate": "2008-10-13",
  "date_sdate": "2008-09-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "PREDICTING ACADEMIC ACHIEVEMENT FROM CLASSROOM BEHAVIORS  by  Cynthia J. Flynt Nancy Bodenhorn & Kusum Singh, Co-Chairs Counselor Education  (ABSTRACT)  \t This study examined the influence of behaviors exhibited in the classroom on reading and math achievement in the first, third and eighth grades; and the influence of teacher perceptions on reading and math achievement of African-Americans versus White students and male versus female students.  Lastly, the study examined teacher ratings of student behavior and standardized measures of intelligence in predicting reading and math achievement.   \tThe Classroom Behavior Inventory (CBI) was used to measure student classroom behavior.  The CBI contains 10 subscales of classroom behaviors:  extroversion, introversion, independence, dependence, creativity/curiosity, task orientation, verbal intelligence, hostility, distractibility, and considerateness.  Reading and math achievement were measured using reading and math subtests from the Woodcock-Johnson Psychoeducational Battery.   The Peabody Picture Vocabulary Test (PPVT) in first grade, and the Weschler Intelligence Scale for Children-Revised (WISC-R) in third grade, were used as standardized measures of intelligence. \tResults revealed that overall, teacher ratings, as measured by the CBI, were better predictors of reading and math achievement than standardized measures of intelligence in first, third and eighth grades.  Students who were rated higher on positive behaviors had overall higher achievement scores than students who were rated higher on negative behaviors.  Minor differences in teacher ratings of classroom behavior based on race and gender were observed.  Teachers rated White students higher on consideration and independence, while African American students were rated as more dependent and hostile.  Males were rated as more hostile, introverted and distracted, while females were rated higher on consideration.",
  "description_provenance": [
    "Author Email: cflynt@vt.edu",
    "Advisor Email: fwood@wfubmc.edu",
    "Advisor Email: ndayvine@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:20Z (GMT). No. of bitstreams: 1 Dissertation4.pdf: 409864 bytes, checksum: 48618b54a3614abea61a1042e050e93d (MD5)   Previous issue date: 2008-08-28"
  ],
  "handle": "28996",
  "identifier_other": "etd-09162008-100711",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09162008-100711/",
  "identifier_uri": "http://hdl.handle.net/10919/28996",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation4.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Academic Achievement",
    "Classroom Behavior",
    "Teacher Perceptions",
    "African-American"
  ],
  "title": "Predicting Academic Achievement from Classroom Behaviors",
  "type": "Dissertation"
}