{
  "contributor_author": "Lizotte, Jeremy Richard",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "Joseph, Eugene G.",
    "McGrath, James E.",
    "Wilkes, Garth L.",
    "Riffle, Judy S."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:16:20Z",
  "date_adate": "2003-09-22",
  "date_available": "2014-03-14T20:16:20Z",
  "date_issued": "2003-08-27",
  "date_rdate": "2003-09-22",
  "date_sdate": "2003-09-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The stable free radical polymerization methodology for production of controlled macromolecules was investigated using a novel monomer, 2-vinylnaphthalene.  Initial polymerizations resulted in molecular weight distributions typical of conventional free radical polymerization techniques (>2.0). Manipulation of the initiator concentration and the molar ratio of initiator to nitroxide demonstrated no significant control over the resulting polymer products.  Analysis of the polymerization kinetics for a 2-vinylnaphthalene polymerization performed in the presence and absence of the free radical initiator revealed identical monomer consumption profiles as well as pseudo first order kinetics indicating a significant degree of the thermal polymerization was occurring at the polymerization temperature (130°C).  Comparison of the thermal polymerization propensity of 2-vinylnaphthalene and styrene revealed an increased tendency for 2-vinylnapthahlene to undergo thermal polymerization.  Styrene is considered highly active in its propensity to thermally polymerize.  However, an Arhenius analysis using in situ FTIR was employed to determine the activation energy for the thermal polymerization of styrene and 2-vinylnaphthalene.  The 2-vinylnaphthalene activation energy for thermal polymerization was determined for the first time to be almost 30 kJ/mol less than styrene.  A novel modified Mayo mechanism was proposed for the 2-vinylnaphthalene thermal initiation mechanism.  Moreover, this thermal initiation was employed to initiate nitroxide mediated polymerizations of styrene.  This first use of a 2-vinylnaphthalene initiating system resulted in polystyrene with a large macrocyclic initiating fragment.  The presence of the initiating moiety was studied using both UV-Vis spectroscopy and 1H NMR spectroscopy.  The extension of stable free radical polymerization to the acrylate monomer family was examined using a novel nitroxide mediator, N-tert-butyl-N-[1-diethylphosphono-(2,2-dimethylpropyl)] nitroxide (DEPN).  The synthesis of DEPN was monitored using in situ FTIR spectroscopy to determine optimum reaction conditions.  The purified nitroxide was subsequently employed in the synthesis of various block and random acrylate copolymers.  The production of a unique amphiphilic block copolymer consisting of acrylic sequences was achieved.  Poly(t-butyl acrylate-b-2ethylhexyl acrylate-b-t-butyl acrylate) was synthesized using the SFRP process.  The t-butyl functionalities were subsequently removed in a post-polymerization acid catalyzed hydrolysis.  The effect of steric bulk and electronic factors on the resulting SFRP process was also investigated and revealed similar polymerization kinetics for various alkyl acrylates.  However, addition of a hydroxyl containing monomer, 2-hydroxyethyl acrylate, resulted in an increase in the polymerization rate up to 2 times.  The rate enhancement was attributed to hydrogen bonding effects and this was confirmed using the unprecedented addition of dodecanol, which also demonstrated a significant rate enhancement.  Block copolymers were also achieved using a novel difunctional nitroxide synthesized from 4-hydroxy TEMPO and 1,6-hexamethylene diisocyanate.  The identity of the nitroxide was confirmed using mass spectrometry and 1H NMR.  The dinitroxide was used in the polymerization of styrene and subsequently used to produce symmetric ABA triblock copolymers with t-butyl styrene using a unique two-step polymerization route.  In addition, the dinitroxide demonstrated an increased tendency for decomposition due to the complex mediation equilibrium.  The decomposition was studied using GPC to evaluate the decomposition effects on the polymerization.      Results of the research efforts presented herein are written as individual research reports with contributing authors and pertinent literature reviews presented at the beginning of each chapter.",
  "description_provenance": [
    "Author Email: jlizotte@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:20Z (GMT). No. of bitstreams: 1 dissertation.pdf: 3698113 bytes, checksum: 5dd94a541b4e9b69522b25eec4b6947d (MD5)   Previous issue date: 2003-08-27"
  ],
  "handle": "28998",
  "identifier_other": "etd-09172003-075955",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09172003-075955/",
  "identifier_uri": "http://hdl.handle.net/10919/28998",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "stable free radical polymerization",
    "thermal polymerization",
    "polymer modification",
    "in situ FTIR spectroscopy",
    "2-vinyl naphthalene",
    "alkyl acrylates",
    "adhesives"
  ],
  "title": "Synthesis and Characterization of Tailored Macromolecules via Stable Free Radical Polymerization Methodologies",
  "type": "Dissertation"
}