{
  "contributor_author": "Li, Yanxiang",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Riffle, Judy S.",
    "Taylor, Larry T.",
    "Dillard, John G.",
    "Davis, Richey M."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:16:20Z",
  "date_adate": "2007-09-27",
  "date_available": "2014-03-14T20:16:20Z",
  "date_issued": "2007-08-31",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-09-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> The purity of the disulfonated monomer, such as 3,3â  -disulfonated-4,4â  -dichlorodiphenyl sulfone (SDCDPS), was very important for obtaining high molecular weight copolymers and accurate control of the oligomerâ  s molecular weight. A novel method to characterize the purity of disulfonated monomer, SDCDPS, was developed by using UV-visible spectroscopy. This allowed for utiliziation of the crude SDCDPS directly in the copolymerization to save money, energy, and time. Three series of tert-butylphenyl terminated disulfonated poly(arylene ether sulfone) copolymers (BPSH35, 6FSH35, and 6FSH48) with controlled molecular weightsï¼ Mnï¼ , 20 to 50 kgâ ¢mol-1, were successfully prepared by the direct copolymerization method. The molecular weight of the copolymer was controlled by a monofunctional monomer tert-butylphenyl, and characterized by the combination of 1H NMR spectra and modified intrinsic viscosity measurements in NMP with 0.05 M LiBr, which was added to suppress the polyelectrolyte effect. The mechanical properties of the membranes, such as the modulus, strength and elongation at break, were improved by increasing the molecular weights, but water uptake and proton conductivities found insensitive to copolymersâ   molecular weights. </p><p>  Three series of disulfonated poly(arylene ether ketone) random copolymers have been synthesized and comparatively studied, according to their different chemical structures, for use as proton exchange membranes. The copolymers containing more flexible molecular structures had higher water uptake and proton conductivity than the rigid structures at the same ion exchange capacity. This may be due to the more flexible chemical structures being able to form better phase separated morphology and higher hydration levels.</p><p>  A new hydrophobic-hydrophilic multiblock copolymer has been successfully synthesized based on the careful coupling of a fluorine terminated poly(arylene ether ketone) (6FK) hydrophobic oligomer and a phenoxide terminated disulfonated poly(arylene ether sulfone) (BPSH) hydrophilic oligomer. AFM images and the water diffusion coefficient results confirmed that the multiblock copolymer formed better proton transport channels. This multiblock copolymer showed comparable proton conductivity and fuel cell performance to the NafionÂ® control and had much better proton transport properties than random ketone copolymers under partially hydrated conditions. This suggested that the multiblock copolymers are promising candidates for proton exchange membranes especially for applications at high temperatures and low relative humidity.</p>",
  "description_provenance": [
    "Author Email: lyxiang@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: jriffle@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: john.dillard@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:20Z (GMT). No. of bitstreams: 1 YanxiangLiDissertation.pdf: 2886093 bytes, checksum: 25404e680813f55d558b3860602b4788 (MD5)   Previous issue date: 2007-08-31"
  ],
  "handle": "28995",
  "identifier_other": "etd-09162007-203027",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09162007-203027/",
  "identifier_uri": "http://hdl.handle.net/10919/28995",
  "publisher": "Virginia Tech",
  "relation_haspart": "YanxiangLiDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "molecular weight",
    "poly(arylene ether sulfone)",
    "morphology",
    "multiblock",
    "random",
    "poly(arylene ether ketone)",
    "disulfonated copolymers",
    "proton exchange membrane",
    "fuel cell"
  ],
  "title": "The Influence of Aromatic Disulfonated Random and Block Copolymers' Molecular Weight, Composition,and Microstructure on the Properties of Proton Exchange Membranes for Fuel Cells",
  "type": "Dissertation"
}