{
  "contributor_author": "Fang, Jian",
  "contributor_committeechair": "Kiran, Erdogan R.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Martin, Stephen M.",
    "Angel, Ross J."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:16:22Z",
  "date_adate": "2008-10-13",
  "date_available": "2014-03-14T20:16:22Z",
  "date_issued": "2008-09-10",
  "date_rdate": "2008-10-13",
  "date_sdate": "2008-09-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Thermoreversible Gelation, Crystallization and Phase Separation Kinetics in Polymer Solutions under High Pressure   Jian Fang  Abstract  This thesis is an experimental investigation of phase behavior, crystallization, gelation and phase separation kinetics of polymer solutions in dense fluids at high pressures.  The miscibility and dynamics of phase separation were investigated in solutions of atactic polystyrene with low polydispersity (Mw = 129,200; PDI = 1.02) in acetone. Controlled pressure quench experiments were conducted at different polymer concentrations to determine both the binodal and the spinodal envelops using time- and angle resolved light scattering techniques. At each concentration, a series of rapid pressure quenches with different penetration depths in a range from 0.1 MPa to 3 MPa were imposed and the time evolution of the angular distribution of the scattered light intensities was monitored. The solution with 11.4 wt % polymer concentration underwent phase separation by spinodal decomposition mechanism for both shallow and deep quenches. Below this critical polymer concentration, phase separation was found to proceed by nucleation and growth mechanism for shallow quenches, but by spinodal decomposition for deeper quenches.  Gelation and crystallization processes and the influence of pressure and the fluid [Cho et al. 1993]composition were investigated in solutions of poly(4-methyl-1-pentene) [P4MP1] in n-pentane + CO2 and in solutions of syndiotactic polystyrene [sPS] in toluene + CO2, and also in acetophenone + CO2 fluid mixtures over a pressure range up to 55 MPa and carbon dioxide levels up to 50 wt %.  In pure pentane, P4MP1 undergoes crystallization and leads to Form III polymorph at low pressures, but to Form II at high pressures. In n-pentane + CO2 mixture fluids, the polymorphic state changes from a mixture of Forms III and II to Form II and eventually to Form I with increasing CO2 content. High level of carbon dioxide (â ¥40 wt %) in the solution was found to lead to gelation instead of crystallization. No liquid-liquid phase boundaries could be observed in any of the P4MP1 solutions.  In contrast to P4MP1 in n-pentane, syndiotactic polystyrene was found to undergo gelation in toluene or acetophenone forming a polymer-solvent compound with the Î´ crystal form. Also in contrast to P4MP1 systems, addition of carbon dioxide to sPS solutions alters the process from that of gelation to crystallization leading to the Î² crystal form. In solutions with high CO2 level, in addition to the gelation or crystallization boundaries, a liquid-liquid phase separation boundary was also observed.  The phase separation path followed was found to influence the eventual morphology and the crystal state of the polymer. In sPS solutions in toluene + CO2, if the sol-gel boundary were crossed first by cooling the solution at a fixed pressure, the resulting morphology was found to be fibrillar and the polymer displayed the Î´ crystal form. If instead, the liquidâ  liquid phase boundary were crossed first by reducing pressure at a fixed temperature, the polymer-rich phase leads to a stacked-lamellar morphology with the Î² crystal form while the polymer-lean phase leads to a mixed morphology with lamellar layers connected by fibrils with the polymer displaying Î´ + Î² crystal forms.  In solutions in acetophenone + carbon dioxide, when the gelation boundary is crossed first, the resulting structure is the Î´ form as in the toluene + CO2 case. At comparable CO2 levels, when the L-L phase boundary is crossed first, in the acetophenone system, polymer-rich phase was found to generate a mixture of Î´ + Î² forms while only the Î´ form was found in the polymer-lean phase, in contrast to the observations in the toluene + CO2 systems.  Based on crystallographic, spectral and microscopic data, a thermodynamic framework was developed which provides a mechanistic account for the formation of the different polymorphs.",
  "description_provenance": [
    "Author Email: jifang@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: martinsm@vt.edu",
    "Advisor Email: ekiran@vt.edu",
    "Advisor Email: rangel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:22Z (GMT). No. of bitstreams: 1 JianFangDissertationETD.pdf: 6387556 bytes, checksum: 6d3a810d1318671c103a22636343d1f0 (MD5)   Previous issue date: 2008-09-10"
  ],
  "handle": "29004",
  "identifier_other": "etd-09172008-022306",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09172008-022306/",
  "identifier_uri": "http://hdl.handle.net/10919/29004",
  "publisher": "Virginia Tech",
  "relation_haspart": "JianFangDissertationETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Crystallization",
    "Gelation",
    "Phase Separation Kinetic",
    "Phase Behavior"
  ],
  "title": "Thermoreversible Gelation, Crystallization and Phase Separation Kinetics in Polymer Solutions under High Pressure",
  "type": "Dissertation"
}