{
  "contributor_author": "Johnson, Matthew B.",
  "contributor_committeechair": "Wilkes, Garth L.",
  "contributor_committeemember": [
    "Long, Timothy E.",
    "Saraf, Ravi F.",
    "Conger, William L.",
    "Davis, Richey M."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:16:23Z",
  "date_adate": "2000-10-09",
  "date_available": "2014-03-14T20:16:23Z",
  "date_issued": "2000-09-06",
  "date_rdate": "2001-10-09",
  "date_sdate": "2000-09-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An investigation was carried out on a three stage method (extrusion/annealing/uniaxial-stretching) (MEAUS) utilized to produce semicrystalline polymeric microporous membranes.  The two semicrystalline polymers studied were selected based on a set-of-prerequisites proposed for the formation of highly porous membranes via the method in question.  The prerequisites included \"fast\" crystallization kinetics, presence of an ac relaxation, ability to form a planar stacked lamellar morphology with a \"good\" crystalline orientation upon melt-extrusion, and rapid heat transfer of the film during extrusion.  The first polymer was isotactic poly(4-methyl-1-pentene) (PMP), and the second was polyoxymethylene (POM).  Three PMP resins were studied, which differed in weight average molecular weight.  Three POM resins were also investigated where two of resins were characterized by relatively narrow molecular weight distributions (MWD) ca 2 while the third POM resin possessed a MWD ca 5.9.  The melt-extruded film morphologies and orientation values were a consequence of the melt-relaxation times as a result of the resin characteristics and/or the melt-extrusion conditions. Following the extrusion stage, the effect of annealing (second stage) on film properties was investigated.  The annealing variables investigated included the temperature, time, and level of extension applied during annealing.  The annealed films were then subjected to the uniaxially stretching stage (third stage) consisting of a cold and hot step, respectively, where deformation was along the extrusion direction.  The variables of interest included the cold and hot stretch temperature and extension level.  It was found that starting precursor morphology and orientation, annealing conditions, and stretching variables impact the final film microporous morphology and permeability.  Additionally, the proposed prerequisites were verified in both the PMP and POM film series. In addition to the MEAUS study, a comprehensive investigation was conducted of the optical properties of blown and cast films made from conventional Ziegler-Natta catalyzed linear low density polyethylene (LLDPE) as well as metallocene-catalyzed LLDPE resins.  From this work, it was determined that in PE blown and cast films made using conventional processing conditions, the optical haze properties are adversely affected due to enhanced surface roughness caused by the formation of spherulitic-like superstructures in polymer melts that possess fast relaxing and low melt elasticity rheological characteristics.  This optical property study was also published in J. Appl. Polym. Sci., 77(13), 2845, (2000).",
  "description_provenance": [
    "Author Email: majohn17@excite.com",
    "Advisor Email: NA@vt.edu",
    "Advisor Email: NA@vt.edu",
    "Advisor Email: NA@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:23Z (GMT). No. of bitstreams: 14 11_Chpt5.pdf: 2854178 bytes, checksum: efe78413f1ffa8f9769edeb07e5b84e0 (MD5) 10_Chpt4.pdf: 2831773 bytes, checksum: c30973fdb4516804670c874bf0a2adc8 (MD5) 14_Chpt8.pdf: 2911664 bytes, checksum: f2c91a4c5411e22745093e06c1d6447a (MD5) 5_LOF.pdf: 76711 bytes, checksum: 5a922d9aac347f8374be61d43b9e3474 (MD5) 6_LOT.pdf: 18452 bytes, checksum: 0211fc3a44c1d0961b003262848dafa8 (MD5) 8_litreview.pdf: 1246918 bytes, checksum: 42047e6b68cc99a52acb1f350779b136 (MD5) 13_Chpt7.pdf: 45489 bytes, checksum: 239308ec1d6af1269f46eb72ebca77c3 (MD5) 7_Intro.pdf: 26770 bytes, checksum: 640473ed8d6b5892fb92df280c76756b (MD5) 3_Acknow.pdf: 8893 bytes, checksum: bddff0eb9b4ee7dfd2c300126b877ec8 (MD5) 1_Title.pdf: 5429 bytes, checksum: 3179763d25307d9597625a0111289991 (MD5) 4_TOC.pdf: 10661 bytes, checksum: de44745f71af7fcd6ee7105510987bd0 (MD5) 12_Chpt6.pdf: 3246192 bytes, checksum: 5b8d12a4e0fcbb89ac2b8e0bfdec4c16 (MD5) 9_Chpt3.pdf: 2359683 bytes, checksum: bd5a17ee8b001c43308902a5c324a062 (MD5) 2_Abstract.pdf: 11411 bytes, checksum: 7513b7e9cf29df43aaa2e7824b370005 (MD5)   Previous issue date: 2000-09-06"
  ],
  "handle": "29009",
  "identifier_other": "etd-09182000-13140044",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09182000-13140044/",
  "identifier_uri": "http://hdl.handle.net/10919/29009",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "11_Chpt5.pdf",
    "10_Chpt4.pdf",
    "14_Chpt8.pdf",
    "5_LOF.pdf",
    "6_LOT.pdf",
    "8_litreview.pdf",
    "13_Chpt7.pdf",
    "7_Intro.pdf",
    "3_Acknow.pdf",
    "1_Title.pdf",
    "4_TOC.pdf",
    "12_Chpt6.pdf",
    "9_Chpt3.pdf",
    "2_Abstract.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Polyoxymethylene",
    "POM",
    "PMP",
    "Processing",
    "Membranes",
    "LLDPE",
    "Poly(4-methyl-1-penetene)",
    "Haze",
    "Film",
    "Semicrystalline",
    "Polymers"
  ],
  "title": "Investigations of the Processing-Structure-Property Relationships of Selected Semicrystalline Polymers",
  "type": "Dissertation"
}