{
  "contributor_author": "Lee, Young Seok",
  "contributor_committeechair": "Smith-Jackson, Tonya L.",
  "contributor_committeemember": [
    "Pérez-Quiñones, Manuel A.",
    "Nussbaum, Maury A.",
    "Kleiner, Brian M."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:16:21Z",
  "date_adate": "2007-09-26",
  "date_available": "2014-03-14T20:16:21Z",
  "date_issued": "2007-09-03",
  "date_rdate": "2007-09-26",
  "date_sdate": "2007-09-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research addressed how older adults experience their mobile phones in their everyday lives and how mobile phones could be designed to best meet their needs.  Two studies were conducted using a mixed-research method to identify representative user clusters and to understand user experiences.  In Study 1, 154 older adult mobile phone users completed a questionnaire to investigate 1) functional usage, 2) perception about mobile phone quality, and 3) other aspects of user experiences (e.g., motivations of acquisition and learning method).  Results showed that older adults are generally conservative mobile phone users who use a few functions of mobile phones and perceive their phone to be difficult to use.  Understanding error messages, menu navigation, and text input were found to be most difficult for them.  Female users perceived their phones to be more difficult to use than male users.  Three user clusters (explorers, basicians, and minimalists) were identified based on mobile phone usage behavior, and their characteristics were described.  User satisfaction was effected by three attributes of mobile phones: usefulness, ease of use, and pleasure of use, indicating that developers need to focus on improving all factors when designing a mobile phone for older adults. Study 2 used a more holistic approach to describe older adultsâ   user experiences.  The aims of Study 2 were 1) to capture stories that reflected user experiences, 2) to identify barriers that older adults faced through the course of user experience and 3) to provide recommendations to improve user experiences.  Qualitative data was collected in the form of existential phenomenology-based interviews.  Twelve older adult mobile phone users (over age 56), representing the three clusters found from Study 1, participated in this study.  The domestication of technology theory was adopted as a framework to describe instances and themes represented in usersâ   utterances and behaviors.  Results showed that, regardless of their abilities to operate technology, older adults used a limited number of mobile phone functions because of their parsimonious cost-benefit analyses when integrating technologies into their lives.  A theoretical explanation for this phenomenon was provided using socio-emotional selectivity theory.  Barriers (perceptual, cognitive, attitudinal, knowledge, and information barriers) were found to hinder older adultsâ   utilization of mobile phone technology over the four dimensions of the domestication process (appropriation, objectification, incorporation, and conversion).  Recommendations to resolve those barriers were provided and related to published literature.  This study proved that the domestication of technology theory can be a useful analytical tool for describing and understanding user experiences and capturing users' needs.  Detailed discussion about its applicability to user needs analysis process was provided.  A set of user requirements along with diverse user profiles were developed as outcomes of this research.",
  "description_provenance": [
    "Author Email: youngLee@vt.edu",
    "Advisor Email: perez@cs.vt.edu",
    "Advisor Email: nussbaum@vt.edu",
    "Advisor Email: smithjack@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:21Z (GMT). No. of bitstreams: 1 Dissertation_YSL.pdf: 2531512 bytes, checksum: 41f9997c15993f48da0619745cd43691 (MD5)   Previous issue date: 2007-09-03"
  ],
  "handle": "29003",
  "identifier_other": "etd-09172007-135013",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09172007-135013/",
  "identifier_uri": "http://hdl.handle.net/10919/29003",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_YSL.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "user clusters",
    "domestication of technology",
    "user requirements",
    "older adults",
    "mobile phones",
    "user experience"
  ],
  "title": "Older adultsâ   user experiences with mobile phones: identification of user clusters and user requirements",
  "type": "Dissertation"
}