{
  "contributor_author": "Abee, Mark Winfield",
  "contributor_committeechair": "Cox, David F.",
  "contributor_committeemember": [
    "Oyama, Shigeo Ted",
    "Hanson, Brian E.",
    "Anderson, Mark R.",
    "Hochella, Michael F. Jr."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:16:23Z",
  "date_adate": "2001-09-24",
  "date_available": "2014-03-14T20:16:23Z",
  "date_issued": "2001-09-05",
  "date_rdate": "2004-09-24",
  "date_sdate": "2001-09-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Acid/Base characterizations of metal oxide surfaces are often used to explain their catalytic behavior.  However, the vast majority of these studies have been performed on powders or supported oxides, and there is very little information available in the literature on the interaction of acid/base probe molecules with well-defined oxide surfaces of known coordination geometry and oxidation state.  The well-defined, single crystal surfaces of Cu<sub>2</sub>O (111), SnO<sub>2</sub> (110), and Cr<sub>2</sub>O<sub>3</sub> (10<u>1</u>2) were investigated for their acid/base properties by the interactions between the probe molecules and the well-defined surface features.  The adsorption of NH<sub>3</sub> at cation sites was used to characterize the Lewis acidity of SnO<sub>2</sub> (110) and Cu<sub>2</sub>O (111) surfaces.  The adsorption of CO<sub>2</sub>, a standard acidic probe molecule, was used to characterize the Lewis basicity of the oxygen anions on SnO<sub>2</sub> (110), Cu<sub>2</sub>O (111) , and Cr<sub>2</sub>O<sub>3</sub> (10<u>1</u>2) surfaces.  BF<sub>3</sub>, while not a standard probe molecule, has been tested as a probe of the Lewis basicity of the oxygen anions on SnO<sub>2</sub> (110) and Cr<sub>2</sub>O<sub>3</sub> (10<u>1</u>2).       By studying probe molecules on well-defined metal oxide surfaces with known coordination geometry and oxidation state, an overall evaluation of NH<sub>3</sub>, CO<sub>2</sub>, and BF<sub>3</sub> as probe molecules can be made using the surfaces studied.  NH<sub>3</sub> probed differences in Lewis acidity of Sn cations on SnO<sub>2</sub> (110), which had differences in coordination environments and oxidation states.  But, NH<sub>3</sub> adsorption failed to provide any direct information on differences in Lewis acidity of Cu cations in different local coordination geometries on Cu<sub>2</sub>O (111).  CO<sub>2</sub> is a poor probe of the Lewis basicity of oxygen anions on the metal oxide surfaces studied here.  CO<sub>2</sub> does not strongly adsorb to either SnO<sub>2</sub> (110) or Cu<sub>2</sub>O (111).  On Cr<sub>2</sub>O<sub>3</sub> (10<u>1</u>2), CO<sub>2</sub> does interact with oxygen sites but in two different coordinations, which vary with surface condition, making a comparison of basicity difficult.  In the cases studied here, CO<sub>2</sub> either does not adsorb, or it does not provide a clear set of results that can be related simply to Lewis basicity.  BF<sub>3</sub> seems to be a much better probe of the Lewis basicity than CO<sub>2</sub> for the well-defined metal oxide surfaces studied here.  On SnO<sub>2</sub> (110) and Cr<sub>2</sub>O<sub>3</sub> (10<u>1</u>2), the boron atom of BF<sub>3</sub> directly interacts with oxygen sites by accepting their electrons.  BF<sub>3</sub> thermal desorption seems to provide a direct measure of the Lewis basicity of different surface oxygen species as long as they are thermally-stable in vacuum.",
  "description_provenance": [
    "Author Email: mark_abee@hotmail.com",
    "Advisor Email: dfcox@vt.edu",
    "Advisor Email: oyama@vt.edu",
    "Advisor Email: hanson@vt.edu",
    "Advisor Email: maander6@vt.edu",
    "Advisor Email: hochella@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:23Z (GMT). No. of bitstreams: 10 dissertation3.pdf: 126229 bytes, checksum: 577e611cbb166177848fc56b3dd573d7 (MD5) dissertation2.pdf: 137303 bytes, checksum: 4052958b80bad0b615b3f22c39788427 (MD5) dissertation7.PDF: 148640 bytes, checksum: 37e6b5a9b88ea45c00bab86f7f49329e (MD5) dissertation6.pdf: 147881 bytes, checksum: ee16903982e0e868982d6c1fd98921e9 (MD5) dissertation5.pdf: 142381 bytes, checksum: f4cf88b0a114aa4b9ada4c44564ebf09 (MD5) dissertation4.pdf: 58768 bytes, checksum: 36b4257976f3d438b5a3a57a8f92db61 (MD5) dissertation8.pdf: 24636 bytes, checksum: c5247998443c9abcc944827e9ca465bb (MD5) dissertation9.pdf: 4049 bytes, checksum: dce5f80c50dd922666fca61f7e6a02b1 (MD5) dissertation1a.pdf: 35334 bytes, checksum: 86f31ffa6f9e66925b271a2242818a3f (MD5) dissertation1b.PDF: 685708 bytes, checksum: bf697fbe645bc8ce0a05c6f737fb6101 (MD5)   Previous issue date: 2001-09-05"
  ],
  "handle": "29011",
  "identifier_other": "etd-09182001-163931",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09182001-163931/",
  "identifier_uri": "http://hdl.handle.net/10919/29011",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "dissertation3.pdf",
    "dissertation2.pdf",
    "dissertation7.PDF",
    "dissertation6.pdf",
    "dissertation5.pdf",
    "dissertation4.pdf",
    "dissertation8.pdf",
    "dissertation9.pdf",
    "dissertation1a.pdf",
    "dissertation1b.PDF"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "TDS",
    "ammonia",
    "cuprous oxide",
    "single-crystals",
    "XPS",
    "chromium oxide",
    "metal oxides",
    "UPS",
    "tin oxide",
    "boron trifluoride",
    "carbon dioxide",
    "probe molecules",
    "acid-base"
  ],
  "title": "Interaction of Acid/Base Probe Molecules with Specific Features on Well-Defined Metal Oxide Single-Crystal Surfaces",
  "type": "Dissertation"
}