{
  "contributor_author": "Jones, Allan M.",
  "contributor_committeechair": "White, Orion F. Jr.",
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "McSwain, Cynthia J.",
    "Wolf, James F.",
    "Harmon, Michael M."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:16:24Z",
  "date_adate": "2005-01-03",
  "date_available": "2014-03-14T20:16:24Z",
  "date_issued": "2004-09-08",
  "date_rdate": "2006-01-03",
  "date_sdate": "2004-09-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Traditional management-leadership and organizational literature depicts the individual as conflated with their role and instructs them to handle their employees and the situations that arise daily and over the course of business cycles instrumentally and for the purposes of control and productivity.  This more traditional and mainstream literature does not adequately address, if at all, the unconscious factors influencing people or the management situations in which they find themselves.  Using a model based upon the theory of the Swiss psychologist Carl Gustav Jung and the relationship of consciousness to the unconscious, this dissertation looks at situational management cases and reveals the existence of the unconscious in the midst of our strongest claims to rationality.  Present and active, the cases show the unconscious to be a significant factor in creating subjective meaning and ordering our world even in the most \"rational\" moments of our lives in public administration.  They further describe how it is that the individual in the manager-leader role is implicated in and caused by the very situations they are attempting to manage and the way in which acknowledging and relating to the unconscious provides an additional resource for public managers.",
  "description_provenance": [
    "Author Email: amjones1@cox.net",
    "Made available in DSpace on 2014-03-14T20:16:24Z (GMT). No. of bitstreams: 1 Jones.pdf: 675763 bytes, checksum: cab115733cf472a2f53a00153d9a6dc2 (MD5)   Previous issue date: 2004-09-08"
  ],
  "handle": "29013",
  "identifier_other": "etd-09182004-163347",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09182004-163347/",
  "identifier_uri": "http://hdl.handle.net/10919/29013",
  "publisher": "Virginia Tech",
  "relation_haspart": "Jones.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "systems",
    "learning",
    "individuation",
    "transformation",
    "ego-Self axis",
    "situation",
    "organizational change",
    "development",
    "archetypes",
    "projection",
    "reflective practice",
    "persona",
    "group process",
    "Leadership",
    "Management",
    "theory",
    "unconscious",
    "analytical psychology",
    "Jungian",
    "process consultation",
    "depth-psychology"
  ],
  "title": "An Absence of Being: A Jungian-Based Model for Understanding Situational Management In Public Organizations",
  "type": "Dissertation"
}