{
  "contributor_author": "Gratton-Lavoie, Chiara",
  "contributor_committeecochair": [
    "Lutz, Nancy A.",
    "Stegeman, Mark"
  ],
  "contributor_committeemember": [
    "Eckel, Catherine C.",
    "Snyder, Susan K.",
    "Michalopoulos, Charles"
  ],
  "contributor_department": "Economics (Arts and Sciences)",
  "date_accessioned": "2014-03-14T20:16:23Z",
  "date_adate": "2000-09-21",
  "date_available": "2014-03-14T20:16:23Z",
  "date_issued": "2000-06-06",
  "date_rdate": "2001-09-21",
  "date_sdate": "2000-09-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Selling state-owned enterprises to the private sector has become a popular policy for governments all around the world.    Chapter 1 provides an historical perspective on privatization, and it describes the objectives and the privatization techniques that have been adopted by many governments since the late 70s.  The chapter then focuses on two important issues in the privatization debate, the underpricing of shares and the effect of ownership on performance.  It reviews the most significant theoretical and empirical contributions to the analysis of these two issues, and it introduces the questions addressed in the remaining chapters of this dissertation.  In Chapter 2 I consider a government that first privatizes a company and then competes for votes against a political opponent. The government's objective is to choose the price of shares and the level of promotional effort to maximize its total net revenues.  After the sale of the company to the public there is an election and the two parties announce what expropriation rate they would implement if they win the political competition.  I show that in this context it is optimal for the party in power in the first period to actively promote the sale and to underprice the stock with respect to its true value, in order to increase the size of the shareholders' interest group that will vote for the party announcing a low expropriation rate.   In Chapter 3 I estimate the long-term impact of the British privatization program of the 70s, 80s, and 90s, on the government's finances.  For a large sample of British companies that were privatized in the years 1979 to 1994, regression analysis shows no effect of change in ownership on company's gross profitability.  This information is then combined with estimates of all relevant costs (implicit and explicit) and revenues for each sale, to assess the long-term effect of the privatization policies on the government's net worth.  The results show that \"Selling the State\" generated considerable losses for the British Government.",
  "description_provenance": [
    "Author Email: cgratton@fullerton.edu",
    "Advisor Email: lutz@vt.edu",
    "Advisor Email: stegeman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:23Z (GMT). No. of bitstreams: 4 Chapter2.PDF: 288934 bytes, checksum: d3c8f383cd0b105d5a13ea6e9518a4d6 (MD5) Chapter3.PDF: 215173 bytes, checksum: 6f3489f2cf9e00c82f8d9a85e550c2fa (MD5) Introduction.PDF: 15032 bytes, checksum: 660658edb1d6a3348d2a5880ca92c227 (MD5) Chapter1.PDF: 75848 bytes, checksum: 226702bbcdaca9a934ea166e50e01ed6 (MD5)   Previous issue date: 2000-06-06"
  ],
  "handle": "29010",
  "identifier_other": "etd-09182000-19510041",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09182000-19510041/",
  "identifier_uri": "http://hdl.handle.net/10919/29010",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter2.PDF",
    "Chapter3.PDF",
    "Introduction.PDF",
    "Chapter1.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Share Ownership",
    "Underpricing",
    "Expropriation",
    "Public Budget",
    "Politics",
    "Privatization"
  ],
  "title": "Essays on Privatization",
  "type": "Dissertation"
}