{
  "contributor_author": "Powers, Matthew N.",
  "contributor_committeechair": "Miller, Patrick A.",
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Jones, James R.",
    "Doolittle, Peter E.",
    "Bork, Dean R."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:16:24Z",
  "date_adate": "2006-11-03",
  "date_available": "2014-03-14T20:16:24Z",
  "date_issued": "2006-09-08",
  "date_rdate": "2006-11-03",
  "date_sdate": "2006-09-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Design is a multidimensional activity involving a variety of skills and thought processes, including analytic reasoning, intuition, and creative expression. Learning how to design can be a frustrating and confusing process that some students find difficult to understand. Professors employ a range of strategies when teaching design. These strategies are often based on how their professors taught them with little or no theoretical basis in how students learn. For students, the failure to grasp the process of designing can challenge their willingness to stay motivated and actively engaged in the studio project. The result is less than optimal learning and students that do not achieve their full potential. One important factor that influences design learning is the process of self-regulated learning. Self-regulated learning (SRL) refers to a student's self-generated thoughts, strategies, and goal-directed behaviors. This study examined SRL in landscape architecture design studios in order to find out how students self-regulate their learning and performance on studio projects. Interviews with landscape architecture students were used to answer the research questions. Study findings suggest that landscape architecture students self-regulate their learning on studio projects through a process of engaging in design, then using SRL to address issues that arise during design, then generating more design issues that require additional SRL, and so on. The findings indicate that a student's ability to engage in SRL is based on their understanding of design as a complex set of behaviors and activities. Since students in each year have a different understanding of what designing entails, they use and engage in SRL differently. The findings suggest that high achievement in a design studio is a result of advanced knowledge that comes from the freedom to pursue additional issues beyond the basic requirements of the project. The freedom comes when a student attains the expertise to shift cognitive resources away from learning how to design and redirects them towards risk-taking, personal interests, and learning new information. The study sheds light on how students learn, engage, and self-regulate their learning in design studios and provides design educators with a basis for effective design teaching strategies.",
  "description_provenance": [
    "Author Email: mapowers@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: wolverine@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: drbork@vt.edu",
    "Advisor Email: pmiller@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:24Z (GMT). No. of bitstreams: 2 02Appendix.pdf: 9281240 bytes, checksum: a95d115ac38c12ed1bec914079539db1 (MD5) 01AStudyofSRLinLADesignStudios.pdf: 3043359 bytes, checksum: e8b8373139dcc38cd1fe948b72e72639 (MD5)   Previous issue date: 2006-09-08"
  ],
  "handle": "29015",
  "identifier_other": "etd-09182006-094841",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09182006-094841/",
  "identifier_uri": "http://hdl.handle.net/10919/29015",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "02Appendix.pdf",
    "01AStudyofSRLinLADesignStudios.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "teaching",
    "learning",
    "architecture",
    "studio",
    "design education",
    "design",
    "self-directed learning"
  ],
  "title": "A Study of Self-Regulated Learning in Landscape Architecture Design Studios",
  "type": "Dissertation"
}