{
  "contributor_author": "Minton, Mary Amanda",
  "contributor_committeechair": "Cox, David F.",
  "contributor_committeemember": [
    "Oyama, Shigeo Ted",
    "Morris, John R.",
    "Dillard, John G.",
    "Hanson, Brian E."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:16:24Z",
  "date_adate": "2006-11-13",
  "date_available": "2014-03-14T20:16:24Z",
  "date_issued": "2006-09-07",
  "date_rdate": "2008-11-13",
  "date_sdate": "2006-09-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The thermally induced reaction of halogenated ethylenes on the Î±-Cr<sub>2</sub>O<sub>3</sub> (10 2) single crystal surface results in the formation of gas phase hydrocarbons including acetylene, ethylene, butadiene, and dihydrogen, and deposition of surface chlorine adatoms.  No surface carbon or combustion products are observed in any reactions indicating no thermally induced C-C bond cleavage occurs and surface lattice oxygen is not incorporated into surface intermediates.  Thermal desorption spectroscopy indicates that in all halogenated ethylene reactions acetylene is the major product, regardless of the reaction scheme. The surface reactions of halogenated ethylenes are proposed to proceed through C-X (X=halogen) bond cleavage to form surface halogen adatoms and surface C2 hydrocarbon fragments.  Halogen adatom deposition affects reaction barriers to hydrocarbon formation, and eventually shuts down surface chemistry.  Photoemission and near edge x-ray absorption fine structure spectra show that all studied reactants undergo some C-X bond cleavage upon low temperature adsorption forming adsorbed C2 fragments and halogen adatoms. Photoemission for each reaction system shows at least two C1s features (283.0-286.0 eV) and two Cl2p features (2p<sub>3/2</sub>=198.0-201.0 eV) with higher binding energy features associated with molecularly intact halogenated ethylenes and lower binding energy features associated with dissociated surface species.  Near edge x-ray absorption fine structure spectra taken, corresponding to photoemission spectra, indicate the occurrence of C1sâ  Ï * transitions, indicating intact p-systems are present.  Heating the surface results in a reduction in intensity of higher energy photoemission and near edge x-ray absorption fine structure indicative of a decrease in surface C-X bonds.",
  "description_provenance": [
    "Author Email: mminton@vt.edu",
    "Advisor Email: oyama@vt.edu",
    "Advisor Email: jrmorris@vt.edu",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: hanson@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:24Z (GMT). No. of bitstreams: 1 MMintondissertation.pdf: 780807 bytes, checksum: 89d640340a96c8496253791b32b2198e (MD5)   Previous issue date: 2006-09-07"
  ],
  "handle": "29014",
  "identifier_other": "etd-09182006-091123",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09182006-091123/",
  "identifier_uri": "http://hdl.handle.net/10919/29014",
  "publisher": "Virginia Tech",
  "relation_haspart": "MMintondissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "vinylidene",
    "chlorovinyl",
    "vinyl",
    "butadiene",
    "ethylene",
    "acetylene",
    "halocarbons"
  ],
  "title": "Reactions of Halogenated Ethylenes on the alpha-Cr2O3 (1012) Surface",
  "type": "Dissertation"
}