{
  "contributor_author": "Cao, Yu",
  "contributor_committeechair": "Burton, John K.",
  "contributor_committeemember": [
    "Potter, Kenneth R.",
    "Moore, David Michael",
    "Lockee, Barbara B.",
    "Doolittle, Peter E."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:16:24Z",
  "date_adate": "2006-09-29",
  "date_available": "2014-03-14T20:16:24Z",
  "date_issued": "2006-09-06",
  "date_rdate": "2006-09-29",
  "date_sdate": "2006-09-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The purpose of this study was to examine whether cueing strategies embedded in computer delivered text messages affected the recall and comprehension of students who differed in their field dependent-independent cognitive style orientations. Two hundred thirty-eight undergraduate students of Virginia Tech participated the study, and 219 sets of valid data were used for the statistical analyses. All participants were given the Group Embedded Figures Test to determine their level of field dependence-independence. They were then randomly assigned to one of three treatment groups that varied in their use of cueing strategy. The first treatment group featured computer delivered text messages with color-highlighted-keywords, the second group featured the same textual content with color-highlighted-key-phrases, and the third group was a control group that featured the same content and employed no cueing strategy. Participants were administered two tests following the treatments, one that assessed knowledge of terminology and another that assessed comprehension. </p><p> A 3 x 3 Analysis of Variance was conducted to explore the main effects for field dependency and cueing strategy and any interaction effect between the two factors. The results showed that field independents outperformed field dependents in all tests. There were no significant differences for the three treatments; the cueing strategies employed in this study had no effect on participants' learning. A significant interaction was seen between field dependency and cueing strategy. However, the results of a one-way ANOVA are unexpected: the cueing strategies employed did not improve field dependents' performance on the assessments and actually hindered the performance of field independents.</p>",
  "description_provenance": [
    "Author Email: caoyu@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:24Z (GMT). No. of bitstreams: 1 CCdissertation_FinalVersion_REV.pdf: 1267964 bytes, checksum: 66831fd2d85bc3687a609b4090a435a4 (MD5)   Previous issue date: 2006-09-06"
  ],
  "handle": "29017",
  "identifier_other": "etd-09182006-215357",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09182006-215357/",
  "identifier_uri": "http://hdl.handle.net/10919/29017",
  "publisher": "Virginia Tech",
  "relation_haspart": "CCdissertation_FinalVersion_REV.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Field Dependency",
    "Cueing Strategy",
    "Instructional Message Design",
    "Color",
    "Cognitive Style"
  ],
  "title": "Effects of Field Dependent-Independent Cognitive Styles and Cueing Strategies on Students' Recall and Comprehension",
  "type": "Dissertation"
}