{
  "contributor_author": "Garnar, Andrew Wells",
  "contributor_committeechair": "Pitt, Joseph C.",
  "contributor_committeemember": [
    "Luke, Timothy W.",
    "Garrison, James W.",
    "Fuhrman, Ellsworth R.",
    "Burian, Richard M."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:16:27Z",
  "date_adate": "2008-01-16",
  "date_available": "2014-03-14T20:16:27Z",
  "date_issued": "2007-09-09",
  "date_rdate": "2008-01-16",
  "date_sdate": "2007-09-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "I develop a framework for making visible the impacts that science has on human subjectivity, along with demonstrating how these transformations support the existing social order.  In order to develop this framework, I critique the work of Wilfrid Sellars.  Sellars is one of the few analytic philosophers of science who directly addresses the connections between science and subjectivity.  What makes Sellars particularly interesting is the way he sought to preserve a strong conception of normativity alongside a quasi-eliminativist scientific realism.  I set the stage for my critique of Sellars by contrasting two different accounts of subjectivity, one Cartesian, the other pragmatic.  I argue in favor of the pragmatic because it completely grounds the subject in the world (a point with which Sellars basically agrees).  I begin my critique of Sellars by explaining his scientific realism.  This is then connected to his vision of the interconnections between science and subjectivity.  I then argue that Sellarsâ   scientific realism is fundamentally incoherent, which leads his system into nihilism.  From this I trace out the role that science can play with respect to subjectivity in a nihilistic world.  To partially counter this nihilism, I articulate an alternative to scientific realism that is based, in part, on my pragmatic account of subjectivity. I conclude by re-appropriating elements of Sellarsâ   philosophy, routed through my alternative scientific realism, in order to complete the framework discussed above.",
  "description_provenance": [
    "Author Email: agarnar@clemson.edu",
    "Advisor Email: jcpitt@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Advisor Email: wesley@vt.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Advisor Email: rmburian@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:27Z (GMT). No. of bitstreams: 1 awgdiss.pdf: 1050357 bytes, checksum: 2cf3f4e9ddc816514782f687abbc1eeb (MD5)   Previous issue date: 2007-09-09"
  ],
  "handle": "29029",
  "identifier_other": "etd-09192007-194730",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09192007-194730/",
  "identifier_uri": "http://hdl.handle.net/10919/29029",
  "publisher": "Virginia Tech",
  "relation_haspart": "awgdiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Scientific Realism",
    "Subjectivity",
    "Pragmatism",
    "Onto-politics",
    "Wilfrid Sellars"
  ],
  "title": "\"An essay concerning subjectivity and scientific realism: Some fancies on Sellarsian themes and onto-politics\"",
  "type": "Dissertation"
}