{
  "contributor_author": "Peairs, Abigail Desiree",
  "contributor_committeechair": "Rankin, Janet L. Walberg",
  "contributor_committeemember": [
    "O'Keefe, Sean F.",
    "Saker, Korinn E.",
    "Davy, Brenda M.",
    "Houston, Michael E.",
    "Lee, Yong Woo"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:16:27Z",
  "date_adate": "2007-10-05",
  "date_available": "2014-03-14T20:16:27Z",
  "date_issued": "2007-09-06",
  "date_rdate": "2007-10-05",
  "date_sdate": "2007-09-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Two thirds of American adults are overweight and almost half of those qualify as obese.  Obesity independently increases risk for cardiovascular disease (CVD), type II diabetes (T2D), and hypertension; thus, strategies to reduce risk in this population are desperately needed.  Oxidative stress and inflammation are two perpetuators of these chronic diseases that are often elevated in obesity.  Interventions that target reductions in oxidative stress and inflammation may help to reduce co-morbidities associated with obesity.  Weight loss is shown to reduce oxidative stress and inflammation.  However, the composition of and food choices within the weight loss diet may influence the response of these factors to weight loss, and has not been adequately assessed.  We first tested whether there were differential effects of a conventional low-fat, high carbohydrate weight loss diet (LF) and the Atkins diet (a popular low carbohydrate, high fat diet (HF)) on oxidative stress and inflammation.  We demonstrated that HF raised C-reactive protein (CRP) levels relative to LF in overweight and obese women over four weeks.  This finding raises questions as to the long term safety of the HF eating plan in terms of CVD risk.  We next examined the role of oxidative stress in the HF diet-induced increase in inflammation by evaluating the effects of an antioxidant supplement versus a placebo in conjunction with HF in overweight and obese men and women.  Although our full hypothesis was not supported, as oxidative stress did not increase with HF, the trend for a differential effect on CRP when antioxidants were consumed is provocative.  It suggests that future research on the connection between oxidative stress, the macronutrient content of the diet, and inflammation in obesity is warranted.   Regarding the effects of specific fats, epidemiological research shows that diets high in saturated fat (SFA) are associated with higher CVD risk while diets higher in omega 3 fats (n-3FA) with lower CVD risk.  However, the acute effects of these fats on indices of inflammation and oxidative stress are less understood, particularly in the overweight/obese population.  As the majority of the time is spent in the postprandial state, the acute responses to high fat meals are gaining attention for their contribution to endothelial dysfunction and CVD.  We showed that acute meals high in SFA increased a marker of endothelial activation (ICAM-1) which could contribute to the atherogenic associations with SFA.  Conversely, including n-3FA in a high fat meal acutely enhanced NF-κB activation in circulating mononuclear cells; however, there were no increases in any inflammatory proteins measured over the 6 h postprandial period.  It is apparent that dietary macronutrients can influence factors associated with chronic disease in overweight and obese individuals.  The evidence presented here may help to refine dietary recommendations for this population.",
  "description_provenance": [
    "Author Email: aturpyn@vt.edu",
    "Advisor Email: okeefes@vt.edu",
    "Advisor Email: Korinn_Saker@ncsu.edu",
    "Advisor Email: jrankin@vt.edu",
    "Advisor Email: bdavy@vt.edu",
    "Advisor Email: houstonm@vt.edu",
    "Advisor Email: ywlee@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:27Z (GMT). No. of bitstreams: 1 PeairsFINAL4.pdf: 1121303 bytes, checksum: 678e9f976f034c05f3b8c8f072f33c82 (MD5)   Previous issue date: 2007-09-06"
  ],
  "handle": "29027",
  "identifier_other": "etd-09192007-132236",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09192007-132236/",
  "identifier_uri": "http://hdl.handle.net/10919/29027",
  "publisher": "Virginia Tech",
  "relation_haspart": "PeairsFINAL4.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "postprandial inflammation",
    "C-reactive protein",
    "energy restriction",
    "obesity"
  ],
  "title": "The Effects of Macronutrient Composition on Oxidative Stress and Inflammation in Overweight and Obese Humans",
  "type": "Dissertation"
}