{
  "contributor_author": "Tucker, Jennifer",
  "contributor_committeechair": "Allen, Barbara L.",
  "contributor_committeemember": [
    "Abbate, Janet E.",
    "Zallen, Doris T.",
    "Reeves, Barbara J."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:16:25Z",
  "date_adate": "2009-09-30",
  "date_available": "2014-03-14T20:16:25Z",
  "date_issued": "2009-09-09",
  "date_rdate": "2009-09-30",
  "date_sdate": "2009-09-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation explores motivation in decision-making and action in science and technology, through the lens of a case study: scientific data sharing in cancer research. The research begins with the premise that motivation and emotion are key elements of what it means to be human, and consequently, are important variables in how individuals make decisions and take action.  At the same time, institutional controls and social messaging send a variety of signals intended to motivate specific actions and behaviors.  Understanding the interplay between personal motives and social influences may point to strategies that better align individual and social perceptions and discourse.    To explore these dynamics, this research centers on a large-scale cancer research program led by the National Institutes of Healthâ  s National Cancer Institute. The goal of the program is to encourage interoperability and data sharing between diverse and highly autonomous cancer centers across the U.S.  Housed in an organization focused on biomedical informatics, the program has a technologically-focused mission; the goal is to facilitate institutional data sharing to connect the cancer research enterprise.     This focus contrasts with the more relationship-based point-to-point data sharing currently reported by researchers as the norm.  Researchers are motivated to share data with others under specific conditions: when there is a foundation of trust with the person or community being shared with; when the perceived reward of sharing is well-defined and of value to the person sharing; and when there is perceived to be a lower risk or cost than the benefit received.  Without these conditions, there are often determined to be insufficient incentives and rewards for sharing.    Data sharing is both a personal decision and a social level problem. Data is both subjective and personal; it is often an extension of researcherâ  s identity, and serves as a measure of his or her value and capability. In the search for standards and interoperable data sets, institutional and technologically-mediated forms of data sharing are perceived to ignore the subjective and local knowledge embodied in the data being shared. To explore these dimensions, this study considers the technology, economics, legal elements, and personal sides of data sharing, and applies two conceptual frameworks to evaluate alternatives for action.",
  "description_provenance": [
    "Author Email: jtucker@tuckertalk.net",
    "Advisor Email: abbate@VT.EDU",
    "Advisor Email: dtzallen@vt.edu",
    "Advisor Email: reeves@VT.EDU",
    "Advisor Email: ballen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:25Z (GMT). No. of bitstreams: 1 Tucker_J_D_2009.pdf: 3182409 bytes, checksum: 6150b8f453cd7da284ce17b6e7bae122 (MD5)   Previous issue date: 2009-09-09"
  ],
  "handle": "29022",
  "identifier_other": "etd-09182009-161937",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09182009-161937/",
  "identifier_uri": "http://hdl.handle.net/10919/29022",
  "publisher": "Virginia Tech",
  "relation_haspart": "Tucker_J_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "data sharing",
    "biomedical informatics",
    "cancer research",
    "metaphor",
    "reversal theory"
  ],
  "title": "Motivating Subjects: Data Sharing in Cancer Research",
  "type": "Dissertation"
}