{
  "contributor_author": "Mao, Min",
  "contributor_committeechair": "Turner, S. Richard",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Long, Timothy E.",
    "Esker, Alan R.",
    "Dillard, John G."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:16:27Z",
  "date_adate": "2007-09-28",
  "date_available": "2014-03-14T20:16:27Z",
  "date_issued": "2007-09-05",
  "date_rdate": "2007-09-28",
  "date_sdate": "2007-09-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Synthesis and Characterization of Highly Functional Substituted Stilbene Copolymers and Semi-crystalline Poly(aryl ether sulfone)s   Min Mao   (ABSTRACT)    Novel, highly functional rod-like copolymers have been synthesized by alternating copolymerization of N, N, Nâ  , Nâ  -tetraalkyl-4, 4â  -diaminostilbenes (TDAS) with maleic anhydride. Dynamic light scattering, 2H solid state NMR and persistence length measurement reveal high chain rigidity of the polymer backbone. Double quantum heteronuclear local field solid state NMR spectroscopy (2Q-HLF Solid State NMR) has been employed to investigate the chain structure of 13C labelled copolymer. The torsional angle of the H-13C-13C-H part of the anhydride ring was zero degrees, indicating an all cis configuration of the H-13C-13C-H moiety of the anhydride ring. <p> Rod-coil block copolymers containing rigid polyampholyte blocks were designed and synthesized by addition-fragmentation chain transfer (RAFT) copolymerization.  The rigid polyampholytes blocks were formed by hydrolysis of alternating copolymers and the flexible coil block consists of poly(oligo(ethylene glycol) methacrylate).  The rod-coil block copolymers form polyion complex (PIC) aggregates even when the polyampholyte blocks are charge imbalanced.  The aggregates did not dissociate upon the addition of high concentrations of NaCl unlike the dissociation of flexible polyampholytes in NaCl solution.  These unique solution properties are induced by â  like-charge attractionsâ   of the rigid polyampholytic alternating copolymer chains.<p> An example, of what is birefringent to be a novel class of material, has been prepared which enables the control of the birefringence of a polymer film by controlling the rotation of aromatic groups pendant to the polymer backbone.<p>   A linear rigid bisphenol monomer, 4,4â  -dihydroxyterphenyl (DHTP), has been incorporated into poly(aryl ether sulfone)s (PAES) in a study to impart crystallization to these amorphous polymers. Three bisphenols, 4, 4â  -isopropylidenediphenol, 4, 4â  -(hexafluoroisopropylidene)diphenol and 4,4â  -dihydroxybiphenyl have been copolymerized with DHTP and dichlorodiphenylsulfone. Only the segmented polysulfone containing 50% BP and 50% DHTP was semi-crystalline. This PAES had a melting temperature (Tm) 320oC in the first heating cycle of a DSC measurement and the presence of crystallites was confirmed by wide angle X-ray diffraction (WAXS).",
  "description_provenance": [
    "Author Email: mmao@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: john.dillard@vt.edu",
    "Advisor Email: srturner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:27Z (GMT). No. of bitstreams: 1 Min_Mao_PhD_Dissertation.pdf: 1912225 bytes, checksum: 81284ae25687f89d8dc1316073b8ae6d (MD5)   Previous issue date: 2007-09-05"
  ],
  "handle": "29028",
  "identifier_other": "etd-09192007-141158",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09192007-141158/",
  "identifier_uri": "http://hdl.handle.net/10919/29028",
  "publisher": "Virginia Tech",
  "relation_haspart": "Min_Mao_PhD_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "poly(aryl ether sulfone)",
    "birefringence",
    "polyampholyte",
    "rod-coil block copolymer",
    "alternating copolymerization",
    "stilbene"
  ],
  "title": "Synthesis and Characterization of Highly Functional Substituted Stilbene Copolymers and Semi-crystalline Poly(aryl ether sulfone)s",
  "type": "Dissertation"
}