{
  "contributor_author": "Belote, Russell Travis",
  "contributor_committeechair": "Jones, Robert H.",
  "contributor_committeemember": [
    "Fox, Thomas R.",
    "Nilsen, Erik T.",
    "Haas, Carola A."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:16:25Z",
  "date_adate": "2008-10-10",
  "date_available": "2014-03-14T20:16:25Z",
  "date_issued": "2008-09-05",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-09-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "For this dissertation, I measured how plant communities in Appalachian forests responded to disturbances caused by forest management activities. I had two primary objectives including (1) testing theories of biological diversity and invasions by nonnative species; and (2) providing empirical data that will help guide the sustainable use of forest resources. This work is part of the Southern Appalachian Silviculture and Biodiversity (SASAB) experiment that was established in the early 1990s to investigate ecosystem responses to a gradient of timber harvesting disturbances. Ranging from undisturbed controls to silvicultural clearcuts, the disturbance gradient is replicated at sites located throughout the Appalachian mountains of Virginia and West Virginia. The plant community was sampled across a wide range of spatial scales (2 hectares to 1 m2) using a nested sampling design and was also sampled at three times including pre-disturbance, one year post-disturbance, and ten year post-disturbance. <p> \tFor one element of the study I tested modern theories of biological invasions and investigated how the forest disturbance gradient interacted with species diversity to influence invasion by nonnative species (Chapter 2). Contrary to popular ecological theories of biotic resistance, the most diverse sites tended to be more easily invaded following intense canopy disturbance. Interestingly, none of the sites in this study were dominated by invasive plants, which led me to ask whether dominant tree species in forests provided resistance to nonnative plant establishment and growth through the quality of the litter they produce. I also asked how might animals that are known to alter litter layers interact with dominant tree species to influence plant invasions. Therefore, I conducted an experiment investigating how changes in litter from dominant tree species and invasions by nonnative earthworms might influence invasibility of forests using forest floor mesocosms (Chapter 3). I found that plant invasion was inhibited by native oak litter even when earthworms were present, suggesting that oak forests may resist plant invasions via oak tree litter. In contrast, plant invasion was greater under invasive tree litter and earthworm activity tended to facilitate invasive plant success only under invasive tree litter. <p> \tI was also interested in understanding how disturbance might alter relationships between local and regional diversity. The long-term data of the forest disturbance experiment allowed me to investigate how local species richness is mediated by regional species richness after disturbance and during forest community development (Chapter 4). Local richness depended strongly on regional richness only after disturbance via colonization of species, but this relationship changed during forest aggradation. These results suggest that regional species pools are important to maintain local diversity following disturbance, but that local interactions (through canopy closure of dominant trees) exert control over species diversity during community reorganization.  <p> \tLastly, I tested current theories on how diversity influences compositional stability after disturbance (Chapter 5). Disturbance consistently resulted in decreased compositional stability, but diversity was associated with stability in complex ways, which depended on how stability was measured and at what scale. Species-rich areas were in some instances less stable; in other instances areas with intermediate levels of diversity were more stable. These results suggest that disturbance causes shifts in species composition via colonization, but the ways in which diversity of sites influences compositional stability is complex and depends on methods used and the scales of observation.  \tTaken together, these results suggest that disturbance influences invasibility, species saturation, and compositional stability of ecological communities. These properties change immediately following disturbance, and during forest development and canopy closure. Data from this project were useful in testing existing theories of community ecology, and may ultimately prove useful for forest managers as they decide how to protect biodiversity while planning for other uses of forest resources.  Overall, these results suggest that colonization of species is the primary process driving plant community patterns in Appalachian forests following disturbance.",
  "description_provenance": [
    "Author Email: rtbelote@vt.edu",
    "Advisor Email: trfox@vt.edu",
    "Advisor Email: enilsen@vt.edu",
    "Advisor Email: cahaas@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:25Z (GMT). No. of bitstreams: 1 BeloteETDv2.pdf: 4633406 bytes, checksum: 5b6b7ec6fc510dba5a2caf2458e5ea10 (MD5)   Previous issue date: 2008-09-05"
  ],
  "handle": "29020",
  "identifier_other": "etd-09182008-232754",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09182008-232754/",
  "identifier_uri": "http://hdl.handle.net/10919/29020",
  "publisher": "Virginia Tech",
  "relation_haspart": "BeloteETDv2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "forest management",
    "introduced species",
    "earthworms",
    "diversity-stability",
    "diversity-invasibility",
    "Appalachian Mountains",
    "species richness",
    "silviculture"
  ],
  "title": "Diversity, Invasibility, and Stability of Appalachian Forests across an Experimental Disturbance Gradient",
  "type": "Dissertation"
}