{
  "contributor_author": "Ferguson, Holly J.",
  "contributor_committeechair": "Eaton, John L.",
  "contributor_committeemember": [
    "Rogers, Charlie E.",
    "Ravlin, Forrest W.",
    "Fell, Richard D.",
    "Pienkowski, Robert L."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:16:29Z",
  "date_adate": "2005-09-20",
  "date_available": "2014-03-14T20:16:29Z",
  "date_issued": "1992-05-05",
  "date_rdate": "2005-09-20",
  "date_sdate": "2005-09-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>Laboratory and field studies of the fall armyworm, <i>Spodoptera frugiperda</i>, were undertaken to determine if a high larval rearing density produces premigrant traits, and if these traits can be used as criteria for separating nonpremigrant from premigrant groups. An increase in larval rearing density significantly decreased pupal weight and forewing width in the laboratory  but not in the field. The greatest differences in developmental time among laboratory density treatments were 0.6 d and 1.07 d for females and males, respectively, but differences were not considered biologically significant. Rearing density did not affect duration of pupal stage in the field-reared fall armyworms.</p> <p> An actograph was used to measure adult flight activity and was validated with videotape recordings of moths in actograph cages. Behaviors other than flying occurred; hence, computer-recorded counts were termed activity counts (one activity count was recorded each time a moth broke an infrared beam directed through a window in an actograph cage). Male moths showed a greater proportion of long-duration activity bouts (spells of activity), a significantly greater activity bout duration, and a generally greater magnitude of activity during peak periods than female moths. Generally, actograph activity was not significantly affected by rearing density. Both mated and unmated females exposed to males showed very little actograph activity, and most of the females mated when exposed to males, regardless of rearing density. An increase in rearing density in the laboratory significantly increased adult lipid reserves, but higher lipid reserves were not related to a higher activity potential. Although larval rearing density did not affect wing-loading values, the fall armyworm as a migrant species showed lower than theoretically expected wing-loading values.</p> <p> Because some premigrant traits were produced by increasing the rearing density and other premigrant traits and behaviors were not produced, it is inconclusive that premigrants were produced by these rearing methods. Based on these results and data taken from the literature, there is reason to believe that the fall armyworm does not have a separable premigrant phase, and that components of weather are more influential than larval density in initiating its migratory behavior.</p>",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:16:29Z (GMT). No. of bitstreams: 1 LD5655.V856_1992.F473.pdf: 26794464 bytes, checksum: eccfb3e1252a5da1e43027a51a37d716 (MD5)   Previous issue date: 1992-05-05",
  "format_medium": "BTD",
  "handle": "29036",
  "identifier_other": "etd-09202005-091015",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09202005-091015/",
  "identifier_uri": "http://hdl.handle.net/10919/29036",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1992.F473.pdf",
  "subject": "Fall armyworm migration",
  "subject_lcc": "LD5655.V856 1992.F473",
  "title": "Rearing density effects on premigrant traits of the fall armyworm, Spodoptera frugiperda (J.E. Smith) (Lepidoptera: Noctuidae)",
  "type": "Dissertation"
}