{
  "contributor_author": "Slade, Vatara Copeland",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Hoover, J. Larry",
    "Sexton, Mildred",
    "Martin, Rosalie Marie",
    "Creighton, Theodore B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:16:29Z",
  "date_adate": "2007-09-26",
  "date_available": "2014-03-14T20:16:29Z",
  "date_issued": "2007-08-27",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-09-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>                                    The purpose of this study was to determine the impact of the professional development component of Comprehensive School Reform on the mathematics achievement of third and fifth grade students attending selected Title I schools in Virginia.  A qualitative research design was used to examine data from a focus group of four technical assistance providers, six principal interviews, and thirteen teacher surveys. This study involved participants of the 2003 cohort of the Comprehensive School Reform process during a 3-year period from 2003 through 2006.  A set of questions was developed for each group of participants to acquire their perceptions of the components of professional development that impacted instruction and enhanced student achievement in mathematics.  A constant comparative method was used to analyze key words and direct quotes from the focus group interview, principal interviews, and teacher surveys.  Triangulation of these data was utilized to identify emergent themes. </p><p>\tThe findings revealed that the professional development component of Comprehensive School Reform had a significant impact on classroom instruction and student achievement in mathematics.  Findings also revealed that the technical assistance provider served as a coach and resource for professional development.  Findings indicated that professional development included data analysis and research-based instructional strategies as contributing factors for increased student achievement.  The Virginia Standards of Learning pass rates of spring 2006 showed significant gains in the mathematics achievement of students in Grades 3 and 5 attending the Title I schools participating in Comprehensive School Reform.  It was evident in the findings of this study that professional development significantly impacted the mathematics achievement of students attending the 2003 Comprehensive School Reform cohort of selected schools in Virginia. This information will serve as a resource for administrators of Title I schools in Virginia that have not met the Adequate Yearly Progress (AYP) requirements of the No Child Left Behind Act of 2001.   </p>",
  "description_provenance": [
    "Author Email: vslade@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: msexton@sbo.hampton.k12.va.us",
    "Advisor Email: tcreigh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:29Z (GMT). No. of bitstreams: 1 SladeDissertation26.pdf: 4444709 bytes, checksum: 9be7af1e1ce2cf8119a4d4c17d48355f (MD5)   Previous issue date: 2007-08-27"
  ],
  "handle": "29039",
  "identifier_other": "etd-09202007-203314",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09202007-203314/",
  "identifier_uri": "http://hdl.handle.net/10919/29039",
  "publisher": "Virginia Tech",
  "relation_haspart": "SladeDissertation26.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "comprehensive school reform",
    "professional development",
    "achievement"
  ],
  "title": "The Impact of the Professional Development Component of Comprehensive School Reform on the Mathematics Achivement of Third and Fifth Grade Students Attending Selected Title I Schools in Virginia",
  "type": "Dissertation"
}