{
  "contributor_author": "Wang, Jialin",
  "contributor_committeechair": "Yoon, Roe-Hoan",
  "contributor_committeemember": [
    "Hochella, Michael F. Jr.",
    "Gandour, Richard D.",
    "Walz, John Y.",
    "Clark, David E."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:16:27Z",
  "date_adate": "2008-10-08",
  "date_available": "2014-03-14T20:16:27Z",
  "date_issued": "2008-09-08",
  "date_rdate": "2008-10-08",
  "date_sdate": "2008-09-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In 1982, Israelachvili and Pashley reported the first measurements of a hitherto unknown attractive force between two mica surfaces hydrophobized in cetyltrimethylammonium bromide (CTAB) solutions. Follow-up experiments conducted by many investigators confirmed their results, while others suggested that the â  hydrophobic forceâ   is an artifact due to nanobubbles (or cavitation). Evidences for the latter included the discontinuities (or steps) in the force versus distance curves and the pancake-shaped nano-bubbles seen in atomic force microscopic (AFM) images. Recent measurements conducted in degassed water showed, however, smooth force versus distance curves, indicating that the hydrophobic force is not an artifact due to nanobubbles.1, 2  Still other investigators3, 4 suggested that the long-range attraction observed between hydrophobic surfaces is due to the correlation between the patches of adsorbed ionic surfactant and the patches of unoccupied surface. For this theory to work, it is necessary that the charged patches be laterally mobile to account for the strong attractive forces observed in experiment. In an effort to test this theory, AFM force measurements were conducted with gold substrates hydrophobized by self-assembly of alkanethiols and xanthates of different chain lengths. The results showed long-range attractions despite the fact that the hydrophobizing agents chemisorb on gold and, hence, the adsorption layer is immobile.  When the gold surfaces were hydrophobized in a 1 Ã  10-3 M thiol-in-ethanol solution for an extended period of time, the force curves exhibited steps. These results indicate that the long-range attractions are caused by the coalescence of bubbles, as was also reported by Ederth.5 The steps disappeared, however, when the species adsorbed on top of the chemisorbed monolayer were removed by solvent washing, or when the gold substrates were hydrophobized in a 1 Ã  10-5 M solution for a relatively short period of time.  AFM force measurements were also conducted between gold substrates coated with short-chain thiols and xanthates to obtain hydrophobic surfaces with water contact angles (ï ±) of less than 90o. Long-range attractions were still observed despite the fact that cavitation is thermodynamically not possible.  Having shown that hydrophobic force is not due to coalescence of pre-existing bubbles, cavitation, or correlation of charged patches, the next set of force measurements was conducted in ethanol-water mixtures. The attractive forces became weaker and shorter-ranged than in pure water and pure ethanol. According to the Derjaguinâ  s approximation6, an attractive force arises from the decrease in the excess free energy (ï §f) of the thin film between two hydrophobic surfaces.7 Thus, the stronger hydrophobic forces observed in pure water and pure ethanol can be attributed to the stronger cohesive energy of the liquid due to stronger H-bonding. Further, the increase in hydrophobic force with decreasing separation between two hydrophobic surfaces indicates that the H-bonded structure becomes stronger in the vicinity of hydrophobic surfaces. The force measurements conducted at different temperatures in the range of 10-40ÂºC showed that the hydrophobic attraction between macroscopic surfaces causes a decrease in film entropy (Sf), which confirms that the hydrophobic force is due to the structuring of water in the thin film between two hydrophobic surfaces. The results showed also that the hydrophobic interaction entails a reduction in the excess film enthalpy (Hf), which may be associated with the formation of partial (or full) clathrates formed in the vicinity of hydrophobic surfaces. The presence of the clathrates is supported by the recent finding that the density of water in the vicinity of hydrophobic surfaces is lower than in the bulk.8",
  "description_provenance": [
    "Author Email: jialinw@vt.edu",
    "Advisor Email: hochella@vt.edu",
    "Advisor Email: gandour@vt.edu",
    "Advisor Email: jywalz@vt.edu",
    "Advisor Email: ryoon@exchange.vt.edu",
    "Advisor Email: dclark@mse.vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:27Z (GMT). No. of bitstreams: 1 Jialin-Phd-Dissertation.pdf: 1359256 bytes, checksum: 5fde728f8defde7435f46315aafa1691 (MD5)   Previous issue date: 2008-09-08"
  ],
  "handle": "29031",
  "identifier_other": "etd-09192008-152113",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09192008-152113/",
  "identifier_uri": "http://hdl.handle.net/10919/29031",
  "publisher": "Virginia Tech",
  "relation_haspart": "Jialin-Phd-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "AFM",
    "thin film",
    "gold",
    "hydrophobic force",
    "surface force",
    "DLVO",
    "water structure",
    "long-range attraction",
    "temperature effect"
  ],
  "title": "AFM surface force measurements between hydrophobized gold surfaces",
  "type": "Dissertation"
}