{
  "contributor_author": "Miwa, Masato",
  "contributor_committeechair": "Aust, Wallace Michael",
  "contributor_committeemember": [
    "Burger, James A.",
    "Mostaghimi, Saied",
    "Persaud, Naraine",
    "Burkhart, Harold E."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:16:31Z",
  "date_adate": "1999-09-30",
  "date_available": "2014-03-14T20:16:31Z",
  "date_issued": "1999-08-04",
  "date_rdate": "2000-09-30",
  "date_sdate": "1999-09-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Southeastern Lower Coastal Plain wet pine flats include thousands of acres of jurisdictional wetlands that are economically, socially, and environmentally important.  These highly productive forests have been intensively managed as pine plantations for the past few decades.  More recently, harvesting and site preparation practices have become a concern among natural resource managers because intensive forestry practices may alter soil physical properties and site hydrology.  These alterations could decrease seedling survival, growth, and future site productivity.  However, the effects of soil disturbance on long-term site productivity and the effects of amelioration techniques on site hydrology are uncertain.  The overall objectives of this study were (1) to characterize disturbed forest soil morphology and physical properties, (2) to assess their impact on the processes that control site hydrology and site productivity, (3) to determine effects of harvesting and site preparation on site hydrology, specifically on the overall hydrological balance and on spatial and temporal patterns of surface water storage.    The study site is located in an intensively managed loblolly pine (Pinus taeda L.) plantation in the lower coastal plain of South Carolina.  This study was established in winter 1991, and dry- and wet-weather harvesting treatments were installed in summer 1993 and winter 1994, respectively.  Bedding and mole channel/bedding treatments were installed in both dry- and wet-harvested plots in fall 1995.  Soil profiles were described for a recently disturbed, deeply-rutted area, and 2-year-old deeply-rutted and churned areas, bedded and undisturbed areas.  Intact soil core samples and composite loose soil samples were collected from each morphological section for soil physical characterizations.  Automated weather station and wells were used to collect continuous climatic and surface water level data since 1996.  Surface water levels were monitored monthly on a 20 x 20 m grid of 1-m wells since 1992.  Total groundwater heads were determined from differential piezometer measurements at high and low elevation places in each treatment plot.    Soil profile descriptions and soil physical property measurements indicated that significant amounts of organic debris were incorporated into the surface horizons, and subsurface soil horizons showed significant soil structural changes and increased redoximorphic features caused by soil disturbance.  The disturbed soil layers in recently created traffic ruts consisted of exposed and severely disturbed subsurface soils, but this layer was naturally ameliorated 2 years after the disturbance.  Bedding site preparation had little amelioration effects on the physical properties of surface soil horizons because the surface horizons already had some incorporation of organic debris.  Overall, the main consequence of bedding in a disturbed wet site was to increase the aerated soil volume.  The bedding appeared to have little effect on disturbed subsurface horizons.    Groundwater head in the study site was constantly higher than -25 cm during the study period, which caused groundwater inflow when the surface water level was low.  Frequent fluctuation of the surface water level and constant water supply from the groundwater probably explain the high productivity of the study site.  Results of the annual water balance showed that surface soil water storage changes were very small, and annual precipitation and potential evapotranspiration were approximately equal. Silvicultural practices and minor topography on the study site had significant effects on the water balance because they influenced surface water level.    Surface water hydraulic gradient evaluation and multivariate cluster analysis indicated that micro-site hydrology and water flow patterns were significantly altered by wet-weather harvesting and bedding site preparation, but overall site hydrology was not altered.  Evaluation of predicted surface water level indicated that micro-topography and precipitation patterns had significant influences on surface water levels during the site establishment period.  These results revealed that the hydrologic components of wetland delineation are complex in the wet pine flatwoods.",
  "description_provenance": [
    "Author Email: mmiwa@vt.edu",
    "Advisor Email: waust@vt.edu",
    "Advisor Email: jaburger@vt.edu",
    "Advisor Email: smostagh@vt.edu",
    "Advisor Email: npers@vt.edu",
    "Advisor Email: burkhart@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:31Z (GMT). No. of bitstreams: 4 CHAP6&7END.PDF: 529996 bytes, checksum: c311793fe05c64bbf5124b19bee2edc4 (MD5) chap5.pdf: 441260 bytes, checksum: 558a09cddfb66d1ff4cce015b8d3b68f (MD5) chap1234.pdf: 442523 bytes, checksum: ec1956a84b14644cb3c209c652562060 (MD5) front.pdf: 37107 bytes, checksum: c012c8a1f03d6d038a7cc8da9c88edc7 (MD5)   Previous issue date: 1999-08-04"
  ],
  "handle": "29049",
  "identifier_other": "etd-092199-104939",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-092199-104939/",
  "identifier_uri": "http://hdl.handle.net/10919/29049",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "CHAP6&7END.PDF",
    "chap5.pdf",
    "chap1234.pdf",
    "front.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "site preparation",
    "soil disturbance",
    "water balance",
    "spatial data analysis",
    "soil physical properties",
    "multivariate analysis",
    "Atlantic Lower Coastal Plain",
    "loblolly pine plantation",
    "wet pine flat",
    "wetland hydrology"
  ],
  "title": "Physical and Hydrologic Responses of an Intensively Managed Loblolly Pine Plantation to Forest Harvesting and Site Preparation",
  "type": "Dissertation"
}