{
  "contributor_author": "Moore, Tim Orland II",
  "contributor_committeechair": "Marr, Linsey C.",
  "contributor_committeemember": [
    "Kolivras, Korine N.",
    "Dymond, Randel L.",
    "Gallagher, Daniel L.",
    "Little, John C."
  ],
  "contributor_department": "Environmental and Water Resources",
  "date_accessioned": "2014-03-14T20:16:30Z",
  "date_adate": "2009-10-14",
  "date_available": "2014-03-14T20:16:30Z",
  "date_issued": "2009-09-08",
  "date_rdate": "2009-10-14",
  "date_sdate": "2009-09-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "According to the World Health Organization, urban air pollution is a high public health priority due its linkage to cardio-pulmonary disease and association with increased mortality and morbidity (1, 2). Additionally, air pollution impacts climate change, visibility, and ecosystem health. The development of effective strategies for improving air quality requires accurate estimates of  air pollutant emissions. In response to the need for new approaches to measuring emissions, we have designed a mobile Flux Lab for the Atmospheric Measurement of Emissions (FLAME) that applies a proven, science-based method known as eddy covariance for the direct quantification of anthropogenic emissions to the atmosphere.  The mobile flux lab is a tool with novel, multifaceted abilities to assess air quality and improve the fidelity of emission inventories. Measurements of air pollutant concentrations in multiple locations at the neighborhood scale can provide much greater spatial resolution for population exposure assessments. The labâ  s mobility allows it to target specific sources, and plumes from these can be analyzed to determine emission factors. Through eddy covariance, the lab provides the new ability to directly measure emissions of a suite of air pollutants.  We have deployed the FLAME to three different settingsâ  a rural Appalachian town where coal transport is the dominant industry; schools in the medium-sized city of Roanoke, Virginia; and the large urban areas around Norfolk, Virginiaâ  to measure neighborhood-scale emissions of air pollution. These areas routinely experience high ozone and particulate matter concentrations and include a diverse array of residential neighborhoods and industries. The FLAME is able to capture emissions from all ground-based sources, such as motor vehicles, rail and barge traffic, refuse fires and refueling stations, for which no direct measurement method has been available previously. Experiments focus on carbon dioxide (CO2), the principal greenhouse gas responsible for climate change; nitrogen oxides (NOx), a key ingredient in ground-level ozone and acid rain; volatile organic compounds (VOCs), a second key ingredient in ozone and many of which are air toxics; and fine particulate matter (PM2.5), a cause of mortality, decreased visibility, and climate change.    This research provides some of the first measurements of neighborhood-scale anthropogenic emissions of CO2, NOx, VOCs and PM2.5 and as a result, the first opportunity to validate official emission inventories directly. The results indicate that a mobile eddy covariance system can be used successfully to measure fluxes of multiple pollutants in a variety of urban settings. With certain pollutants in certain locations, flux measurements confirmed inventories, but in others, they disagreed by factors of up to five, suggesting that parts of the inventory may be severely over- or underestimated. Over the scale of a few kilometers within a city, emissions were highly heterogeneous in both space and time. FLAME-based measurements also confirmed published emission factors from coal barges and showed that idling vehicles are the dominant source of emissions of air toxics around seven schools in southwest Virginia.   Measurements from this study corroborate existing emission inventories of CO2 and NOx and suggest that inventories of PM2.5 may be overestimated. Despite the tremendous spatial and temporal variability in emissions found in dense urban areas, CO2 fluxes on average are very similar across the areas in this study and other urban areas in the developed world. Nevertheless, the high level of variability in spatial and temporal patterns of emissions presents a challenge to air quality modelers. The finding that emissions from idling vehicles at schools are likely responsible for creating hot spots of air toxics adds to the urgency of implementing no-idling and other rules to reduce the exposure of children to such pollutants. Ultimately, the results of this study can be used in combination with knowledge from existing emission inventories to improve the science and policies surrounding air pollution.",
  "description_provenance": [
    "Author Email: timmoore@vt.edu",
    "Advisor Email: lmarr@vt.edu",
    "Advisor Email: korine@vt.edu",
    "Advisor Email: dymond@vt.edu",
    "Advisor Email: dang@vt.edu",
    "Advisor Email: jcl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:30Z (GMT). No. of bitstreams: 1 Moore_TO_D_2009.pdf: 6405642 bytes, checksum: 16e8058ba8ea0c523ae832ee698744fe (MD5)   Previous issue date: 2009-09-08"
  ],
  "handle": "29046",
  "identifier_other": "etd-09212009-110122",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09212009-110122/",
  "identifier_uri": "http://hdl.handle.net/10919/29046",
  "publisher": "Virginia Tech",
  "relation_haspart": "Moore_TO_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "flux",
    "PM2.5",
    "VOC",
    "nitrogen oxides",
    "carbon dioxide",
    "National Emission Inventory",
    "National Air Toxics Assessment",
    "relaxed-eddy accumulation",
    "eddy covariance"
  ],
  "title": "Application of a Mobile Flux Lab for the Atmospheric Measurement of Emissions (FLAME)",
  "type": "Dissertation"
}