{
  "contributor_author": "Kegley, Janet Brockington",
  "contributor_committeechair": "Curcio, Claire Cole Vaught",
  "contributor_committeemember": [
    "Talbutt, Lou",
    "Getz, Hilda M.",
    "Hohenshil, Thomas H.",
    "Singh, Kusum"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:16:30Z",
  "date_adate": "2000-09-25",
  "date_available": "2014-03-14T20:16:30Z",
  "date_issued": "2000-09-14",
  "date_rdate": "2001-09-25",
  "date_sdate": "2000-09-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examined the perceptions of elementary school counselors regarding their experience in using solution-focused brief counseling for meeting the demanding responsibilities of their job and the particular needs of the students they serve. Specifically, the four research questions addressed the school counselors' perceptions regarding: (1) use and importance of particular solution-focused techniques; (2) effectiveness of solution-focused strategies in addressing specific student issues; (3) training in solution-focused brief counseling; and (4) use of this approach in settings other than the counseling office. \tThe data for this study were collected from elementary school counselors in Virginia who had previously received training in solution-focused brief counseling.  This training was provided by their school systems as inservice and was conducted by the same workshop leader in all instances.  The school counselors were sent a questionnaire that was developed by the researcher.  The survey contained a selection of Likert-style scale questions, yes/no items, rank-order items, and open-ended questions.  The final section contained questions designed to obtain demographic information about the respondent and the school and students they served. The researcher conducted a follow-up interview with several school counselors to supplement the survey data. The data analysis was descriptive and relational in nature. \tThe findings of the study indicate that elementary school counselors who have received training in solution-focused brief counseling philosophies and techniques find it important and useful for working with children. The majority of the school counselors indicated that they use all of the solution-focused techniques listed in the survey to at least some degree. Their responses to the survey indicated the perception that this approach is effective with various student issues. The school counselors reported the perception that they have some proficiency with solution focused brief counseling and that they have interest in pursuing more training. The school counselors also indicated that they were able to use solution-focused brief counseling philosophies in school settings other than the counseling office. \tIn summary, school counselors appear to have a relatively positive perception of solution-focused brief counseling as an approach for working with elementary age school students.  Recommendations for practice and future research are presented.",
  "description_provenance": [
    "Author Email: jbkegley@juno.com",
    "Advisor Email: Ltalbutt@mail.roanoke.k12.va.us",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: vaughtc@vt.edu",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:30Z (GMT). No. of bitstreams: 1 1jkegleydis.pdf: 337459 bytes, checksum: 06fd8c07cb23df5ff90210a5990bf2af (MD5)   Previous issue date: 2000-09-14"
  ],
  "handle": "29043",
  "identifier_other": "etd-09212000-14140037",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09212000-14140037/",
  "identifier_uri": "http://hdl.handle.net/10919/29043",
  "publisher": "Virginia Tech",
  "relation_haspart": "1jkegleydis.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "soultion-focused brief therapy",
    "solution-focused brief counseling",
    "school counseling",
    "elementary school counseling"
  ],
  "title": "Perceptions of Elementary School Counselors Regarding the Utility of Solution-Focused Brief Counseling in the School Setting",
  "type": "Dissertation"
}