{
  "contributor_author": "Watson, Donna Hardy",
  "contributor_committeecochair": [
    "Magliaro, Susan G.",
    "Wilkins, Jesse L. M."
  ],
  "contributor_committeemember": [
    "Lloyd, Gwendolyn M.",
    "Burge, Penny L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:16:30Z",
  "date_adate": "2005-09-28",
  "date_available": "2014-03-14T20:16:30Z",
  "date_issued": "2005-09-07",
  "date_rdate": "2005-09-28",
  "date_sdate": "2005-09-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Life stories were constructed for three young women from Appalachia to explore their mathematics experiences as students in public schools of the region. Data sources included interviews, school records, and a self-drawn chart of estimated mathematics ability for each year, from kindergarten through twelfth grade. A cross-case analysis revealed similar characteristics among the three women including shyness, difficulty with middle school mathematics and with high school geometry, the choice not to take a mathematics course in the last year of high school, and an awareness of a negative Appalachian stereotype. The mathematics education received by all the women was inadequate as demonstrated by their self-created graphs, their life story accounts, and their initial difficulties in making the minimum required score on the Praxis I Mathematics test. Their subsequent successes in graduating from college can be attributed to their own motivation and tenacity in addition to the encouragement of their families and some teachers. Connections to Standards-based reform in mathematics education include questions about the teaching and learning of geometry and about opportunities for students, especially females, to participate in mathematical discourse throughout their school mathematics experiences, a situation impacted by their expressed shyness and by overt and subtle incidences of gender and racial biases. Appalachian cultural connections seem to be an aspect of fatalism which influences attribution of natural ability versus effort and, in some instances, a climate of male dominance. Connections to the problems of education in rural poverty included a number of ineffective teachers, a situation exacerbated by a sense of social stratification within the Appalachian culture and a reluctance to challenge school or teacher practices. As for learning preferences, the women tended to favor teachers who offered good explanations and who demonstrated caring, which highlights an emphasis placed on relationships within the Appalachia culture.   \tDetermining the degree of influence of the Appalachian culture on the education, especially in mathematics, of these three young women was difficult to ascertain.  The factors of culture, socioeconomic levels, and rural isolation combined with the effects of race, gender and ethnicity in the individual to impact the opportunities to a quality education.",
  "description_provenance": [
    "Author Email: dwatson@bluefield.edu",
    "Advisor Email: lloyd@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: wilkins@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:30Z (GMT). No. of bitstreams: 1 DHWatson2005.pdf: 2597939 bytes, checksum: e72bac261d20ca498cc5c769783b4ce0 (MD5)   Previous issue date: 2005-09-07"
  ],
  "handle": "29045",
  "identifier_other": "etd-09212005-181731",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09212005-181731/",
  "identifier_uri": "http://hdl.handle.net/10919/29045",
  "publisher": "Virginia Tech",
  "relation_haspart": "DHWatson2005.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mathematics education",
    "Praxis I Mathematics",
    "rural poverty",
    "life stories",
    "Appalachia"
  ],
  "title": "Learning Mathematics in Appalachia: Life Histories of Beginning Teachers",
  "type": "Dissertation"
}