{
  "contributor_author": "Suarez Zambrano, Nestor Ricardo",
  "contributor_committeechair": "Brandon, Thomas L.",
  "contributor_committeecochair": "Mitchell, James K.",
  "contributor_committeemember": [
    "Green, Russell A.",
    "Filz, George M."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:16:31Z",
  "date_adate": "2012-11-09",
  "date_available": "2014-03-14T20:16:31Z",
  "date_issued": "2012-09-03",
  "date_rdate": "2012-11-09",
  "date_sdate": "2012-09-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Granular soils exhibit a generally beneficial change in engineering properties with time after deposition or densification, during a process commonly known as aging. Soil properties reported to change during aging include the small strain modulus and stiffness, penetration resistance, liquefaction resistance, and pile setup. Different hypotheses have been proposed to explain the occurrence of aging in granular soils, including cementation induced by dissolution of silica and precipitation at the particle contacts, cementation due to microbiological activity, internal stress redistribution caused by particle crushing, and buckling of the load chains due to particle slippage. New evidence points out that internal and time-dependent changes in the soil structure caused by particle slippage and rearrangement as the source of the time-dependent variations in soil properties.   This investigation is focused on the study of aging at the particle scale to determine its main driving mechanism and define the factors which affect it. Results from an extensive laboratory testing program and computer simulations based on the discrete element method provide insight into the causes of aging and its effects on the macroscopic properties of sands based on the analysis of the interaction between sand grains.",
  "description_provenance": [
    "Author Email: nsuarez@vt.edu",
    "Advisor Email: tbrandon@vt.edu",
    "Advisor Email: jkm@vt.edu",
    "Advisor Email: rugreen@vt.edu",
    "Advisor Email: filz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:31Z (GMT). No. of bitstreams: 1 Suarez_NR_D_2012_2.pdf: 28186183 bytes, checksum: a2edede3dd894ab444bae8317c7ef766 (MD5)   Previous issue date: 2012-09-03"
  ],
  "handle": "29048",
  "identifier_other": "etd-09212012-220649",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09212012-220649/",
  "identifier_uri": "http://hdl.handle.net/10919/29048",
  "publisher": "Virginia Tech",
  "relation_haspart": "Suarez_NR_D_2012_2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "aging",
    "creep",
    "sand",
    "acoustic emissions",
    "computed tomography",
    "discrete element method",
    "rate process theory"
  ],
  "title": "Micromechanical Aspects of Aging in Granular Soils",
  "type": "Dissertation"
}