{
  "contributor_author": "Quintela, Yvette",
  "contributor_committeechair": "Donovan, John J.",
  "contributor_committeemember": [
    "Hauenstein, Neil M. A.",
    "Foti, Roseanne J.",
    "Carlson, Kevin D."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:16:33Z",
  "date_adate": "2005-10-21",
  "date_available": "2014-03-14T20:16:33Z",
  "date_issued": "2005-09-02",
  "date_rdate": "2005-10-21",
  "date_sdate": "2005-09-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Few studies have examined whether performance feedback on a given task can have implications for motivational processes on an altogether distinct task. The present study proposes and tests a model for motivational spillover in a goal-setting context. Participants (N = 201) were provided with goal-performance discrepancy feedback (GPD) on a creativity task (CT) and were subsequently asked to complete an unrelated stock-predicting task (SPT). Results indicate that GPD feedback on the CTs was positively associated with positive affect such that negative GPDs resulted in low levels of positive affect and positive GPDs resulted in high levels of positive affect. This positive affect was in turn positively related to self-efficacy for the SPT. Self-efficacy was positively associated with personal goals, and goals were positively related to performance on the SPT. These findings provide initial evidence for the occurrence of positive and negative motivational spillover in a natural performance setting.",
  "description_provenance": [
    "Author Email: yquintel@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: kevinc@vt.edu",
    "Advisor Email: donovan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:33Z (GMT). No. of bitstreams: 2 QuintelaDissertationBody.pdf: 321539 bytes, checksum: e71fbbbd7693f3a98312ab580ed0f232 (MD5) QuintelaDissertationFrontMatter.pdf: 12636 bytes, checksum: 2b8078a9090a55b3ca2e81a836419088 (MD5)   Previous issue date: 2005-09-02"
  ],
  "handle": "29058",
  "identifier_other": "etd-09222005-152312",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09222005-152312/",
  "identifier_uri": "http://hdl.handle.net/10919/29058",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "QuintelaDissertationBody.pdf",
    "QuintelaDissertationFrontMatter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "goal performance discrepancies",
    "positive and negative affect",
    "Motivational spillover",
    "goal-setting",
    "self-efficacy"
  ],
  "title": "A Model of Motivational Spillover: When One Thing Leads to Another",
  "type": "Dissertation"
}