{
  "contributor_author": "Li, Huimin",
  "contributor_committeechair": "Anderson, Mark R.",
  "contributor_committeemember": [
    "Brewer, Karen J.",
    "Morris, John R.",
    "Long, Gary L.",
    "Davis, Richey M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:16:33Z",
  "date_adate": "2004-09-24",
  "date_available": "2014-03-14T20:16:33Z",
  "date_issued": "2004-09-08",
  "date_rdate": "2005-09-24",
  "date_sdate": "2004-09-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Relationship Between Molecular Structure and    Surface Properties of Self-Assembled Monolayers Huimin Li (Abstract)   Polyimides are frequently used as insulating layers in the microelectronics industry. These polymers are tough, have high thermal stability, and have favorable dielectric properties; consequently, polyimides are excellent materials for insulating layers in microelectronic devices. In this research, self-assembled monolayers are investigated for use as an adhesion promoter for metal substrates, and for corrosion protectors of the metal surface.   Gold substrates modified by adsorption of 3- and 4-aminothiophenol monolayers, 3- and (4-mercaptophenyl) phthalimide (MPP) monolayers, and by reaction of the 3- and 4-aminothiophenol monolayers with the phthalic anhydride were studied using reflection absorption infrared spectroscopy, contact angle measurement, ellipsometry,  and electrochemical measurements.  Reactions on the monolayers are used to model the attachment of an insulating polyimide to the substrate. The covalent attachment of the anhydride is confirmed, and the efficiency of the reaction of the aminothiolphenol monolayers is investigated. The reactivity of the aminothiolphenol monolayers is found to depend on the position of the amino-group around the phenyl ring.  Impedance spectroscopy is used to investigate the ionic insulating properties of these systems. The 4-mercaptophthalimide monolayer is found to have the highest monolayer resistance to ion transport. This result suggests that it forms the most densely packed monolayer. The monolayer resistance of the surfaces prepared by adsorption of the aminothiolphenol isomers followed by reaction with phthalic anhydride is much lower than the corresponding deposited mercaptophthalimide monolayers. These results suggest that the reaction efficiency is low. Impedance spectroscopy and polarization measurements suggests a higher protection efficiency for 3-mercaptophenylphthalimide.  These results will be discussed in the context of the ability of the isomeric mercaptophthalimide monolayers to serve as protectors against substrate corrosion.",
  "description_provenance": [
    "Author Email: huli@vt.edu",
    "Advisor Email: mark.anderson@vt.edu",
    "Advisor Email: kbrewer@vt.edu",
    "Advisor Email: jrmorris@vt.edu",
    "Advisor Email: long@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:33Z (GMT). No. of bitstreams: 1 dissertation.pdf: 1223457 bytes, checksum: 7de9eada5d54a22ee0ca63833839ac93 (MD5)   Previous issue date: 2004-09-08"
  ],
  "handle": "29056",
  "identifier_other": "etd-09222004-150415",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09222004-150415/",
  "identifier_uri": "http://hdl.handle.net/10919/29056",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "adhesion promoter",
    "structure property relationship",
    "EIS",
    "self-assembled monolayer",
    "RAIRS",
    "corrosion protection"
  ],
  "title": "Relationship between molecular structure and surface properties of self-assembled monolayers",
  "type": "Dissertation"
}