{
  "contributor_author": "Plotnikov, Valeri",
  "contributor_committeechair": "Collura, John",
  "contributor_committeemember": [
    "Ghandforoush, Parviz",
    "Triantis, Konstantinos P.",
    "Hobeika, Antoine G.",
    "Tignor, Samuel C."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:16:32Z",
  "date_adate": "2001-10-12",
  "date_available": "2014-03-14T20:16:32Z",
  "date_issued": "2001-09-05",
  "date_rdate": "2002-10-12",
  "date_sdate": "2001-09-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this research, an effort is made to analyze the costs of fare collection on heavy rail and motorbus systems in the U.S. Since existing ticketing and fare collection (TFC) systems are major elements of transit infrastructure and there are several new alternative TFC technologies available on the market, the need to evaluate the performance of existing TFC systems arises. However, very little research has been done, so far, to assess impacts of TFC technologies on capital and operating expenses in public transit. The two objectives of this research are: (1) to formulate a conceptual evaluation framework and a plan to assess the operating costs of existing TFC systems in transit and (2) to analyze the operating expenses associated with existing TFC systems on heavy rail and motorbus transit in the U.S. with the aid of the evaluation framework and plan. This research begins with a review of the current state of knowledge in the areas of transit TFC evaluation, the economics of public transit operations, and fare collection practices and technologies. It helps to determine the scope of work related to assessment of TFC operating costs on public transit and provides the basis for the development of a conceptual evaluation framework and an evaluation plan. Next, this research presents a systematic approach to define and describe alternative TFC systems and suggests that the major TFC system determinants are payment media, fare media, TFC equipment, and transit technology (mode). Following this is the development of measures of effectiveness to evaluate alternative TFC systems. These measures assess cost-effectiveness and labor-intensiveness of TFC operations. The development of TFC System Technology Index follows. This Index recognizes the fact that TFC systems may consist of different sets of TFC technologies both traditional and innovative. Finally, this research presents statistical results that support the hypothesis that TFC operating costs are related to transit demand, transit technology (mode) and TFC technologies. These results further suggest that: (1) TFC operating costs per unlinked passenger trip on heavy rail systems are higher than on motorbus systems and (2) TFC operating costs per unlinked passenger trip tend to increase as the use of non-electronic fare media increases. Actions for further research are also recommended.",
  "description_provenance": [
    "Author Email: vplotnik@vt.edu",
    "Advisor Email: jcollura@vt.edu",
    "Advisor Email: pghandfo@vt.edu",
    "Advisor Email: triantis@vt.edu",
    "Advisor Email: hobeika@vt.edu",
    "Advisor Email: stignor@aol.com",
    "Made available in DSpace on 2014-03-14T20:16:32Z (GMT). No. of bitstreams: 1 dissertation_update_3_final.pdf: 1299200 bytes, checksum: 71d38b77fc6391cc4c27e45fa1e580ed (MD5)   Previous issue date: 2001-09-05"
  ],
  "handle": "29052",
  "identifier_other": "etd-09222001-231459",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09222001-231459/",
  "identifier_uri": "http://hdl.handle.net/10919/29052",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation_update_3_final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "TFC technology",
    "fare media",
    "operating costs",
    "transit",
    "fare collection"
  ],
  "title": "An Analysis of Fare Collection Costs on Heavy Rail and Bus Systems in the U.S.",
  "type": "Dissertation"
}