{
  "contributor_author": "Adams, Tiffany E",
  "contributor_committeechair": "Filz, George M.",
  "contributor_committeemember": [
    "Hochella, Michael F. Jr.",
    "Brandon, Thomas L.",
    "Mitchell, James K.",
    "Foti, Roseanne J."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:16:35Z",
  "date_adate": "2011-10-06",
  "date_available": "2014-03-14T20:16:35Z",
  "date_issued": "2011-09-08",
  "date_rdate": "2011-10-06",
  "date_sdate": "2011-09-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Increasing interest, from the U.S. Army Corps of Engineers (USACE) and other agencies, in using deep-mixing methods (DMM) to improve the stability of levees constructed on soft ground is driven by the need to reduce levee footprints and environmental impacts and to allow for more rapid construction.  Suitable methods for analysis and design of these systems are needed to ensure that the DMM technology is properly applied. <p> DMM shear walls oriented perpendicular to the levee alignment are an effective arrangement for supporting unbalanced lateral loads.  Shear walls constructed by overlapping individual DMM columns installed with single-axis or multiple axis equipment include vertical joints caused by the reduced width of the wall at the overlap between adjacent columns.  These joints can be made weaker by misalignment during construction, which reduces the efficiency of the overlap.  Depending on the prevalence and strength of these joints, complex failure mechanisms, such as racking due to slipping along vertical joints between adjacent installations in the shear walls, can occur.  Ordinary limit equilibrium analyses only account for a composite shearing failure mode; whereas, numerical stress-strain analyses can account for other failure modes. <p> Five case studies provided by the USACE were analyzed to evaluate the behavior of levee and floodwall systems founded on soft ground stabilized with DMM shear walls.  These identified and illustrated potential failure mechanisms of these types of systems.  Two-dimensional numerical stability and settlement analyses were performed for the case studies using the FLAC computer program.  The key findings and conclusions for the individual case studies were assessed and integrated into general conclusions about design of deep-mixing support for levees and floodwalls. <p> One of the significant findings from this research was to identify the potential for a partial depth racking failure, which can control design when the DMM shear walls are socketted into a relatively strong bearing layer.  The potential for partial depth racking failure is not discussed in the literature and represents a new failure mode identified by this research.  This discovery also highlights the importance of adapting suitable methods for analysis and design of these systems to address all potential failure modes.",
  "description_provenance": [
    "Author Email: teadams@vt.edu",
    "Advisor Email: hochella@vt.edu",
    "Advisor Email: tbrandon@vt.edu",
    "Advisor Email: jkm@vt.edu",
    "Advisor Email: filz@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:35Z (GMT). No. of bitstreams: 1 Adams_TE_D_2011.pdf: 5858178 bytes, checksum: 708dc6d7b0e88769ce0bc98d6f7cf305 (MD5)   Previous issue date: 2011-09-08"
  ],
  "handle": "29065",
  "identifier_other": "etd-09222011-092706",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09222011-092706/",
  "identifier_uri": "http://hdl.handle.net/10919/29065",
  "publisher": "Virginia Tech",
  "relation_haspart": "Adams_TE_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Levee stability",
    "Deep-mixed shear walls",
    "Column-supported embankment",
    "Numerical finite difference analysis",
    "Failure mode analysis"
  ],
  "title": "Stability of Levees and Floodwalls Supported by Deep-Mixed Shear Walls:  Five Case Studies in the New Orleans Area",
  "type": "Dissertation"
}