{
  "contributor_author": "DePolo, Wade Scott",
  "contributor_committeechair": "Baird, Donald G.",
  "contributor_committeemember": [
    "Lesko, John Jack",
    "Marand, Eva",
    "Davis, Richey M."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:16:35Z",
  "date_adate": "2005-10-21",
  "date_available": "2014-03-14T20:16:35Z",
  "date_issued": "2005-09-12",
  "date_rdate": "2007-10-21",
  "date_sdate": "2005-09-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This work has been concerned with the dimensional stability and the structure-property relationships of thermoplastics reinforced with particulate and fiber fillers.  The first part of this study was concerned with ascertaining the main causes of warpage observed for injection-molded thermoplastics reinforced with high aspect ratio fibers.  Typically, warpage in injection-molded fiber reinforced thermoplastics is primarily attributed to residual thermal stresses associated with shrinkage and thermal contraction of the parts.  Therefore, it is assumed that flow-induced stresses generated during mold filling do not play a significant role in the warpage.  The warpage of PP composites reinforced with TLCP fibers was found to increase with an increase in fiber loading.  The shrinkage and the thermal expansion of the TLCP/PP composites and, hence, the thermally induced stresses decreased with an increase in fiber loading while the flow-induced stresses increased.  The increase in the flow-induced stresses was attributed to an inhibition of stress relaxation and greater generation of orientation of the polymer chains with an increase in fiber loading.  Therefore, it was found that in order to accurately predict the warpage of fiber reinforced thermoplastics, the flow-induced residual stresses must be accounted for.  </p><p> The second part of this work was concerned with minimizing the particle loading of reinforced PC/PBT composites while maintaining the stiffness, i.e. modulus, and the dimensional stability of injection molded flat panels.  This was accomplished by using high aspect ratio (&#8776;100-150) nano-clays as opposed to micron-size talc (&#8776;5-10).  It was found that by using nano-clays surface modified with a quaternary ammonium salt that contained two hydroxyl groups as opposed to fine talc particles, the level of particle reinforcement could be reduced from 6 to 1 wt% without sacrificing the modulus of the reinforced PC/PBT composites.  Further benefits included a 26% increase in flexural strength, 77% increase in the tensile toughness and 3% reduction in the density of the reinforced PC/PBT composites.  An increase in the modulus and tensile toughness was observed even though there was evidence of loss in molecular weight of the PC/PBT matrix, which was supported by the rheological behavior of the composites.</p>",
  "description_provenance": [
    "Author Email: wdepolo@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: emarand@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:35Z (GMT). No. of bitstreams: 1 DissertationVT2.pdf: 13270201 bytes, checksum: 266f2420ac5df6adc07404ebcee47c76 (MD5)   Previous issue date: 2005-09-12"
  ],
  "handle": "29068",
  "identifier_other": "etd-09232005-103058",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09232005-103058/",
  "identifier_uri": "http://hdl.handle.net/10919/29068",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationVT2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Rheology",
    "Stucture-Property Relationships",
    "Warpage",
    "Nanocomposites"
  ],
  "title": "Dimensional Stability and Properties of Thermoplastics Reinforced with Particulate and Fiber Fillers",
  "type": "Dissertation"
}