{
  "contributor_author": "Kim, BeomCheol  Peter",
  "contributor_committeecochair": [
    "Murrmann, Suzanne K.",
    "Carlson, Kevin D."
  ],
  "contributor_committeemember": [
    "Perdue, Richard R.",
    "McCleary, Ken W."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:16:34Z",
  "date_adate": "2010-10-01",
  "date_available": "2014-03-14T20:16:34Z",
  "date_issued": "2010-09-10",
  "date_rdate": "2010-10-01",
  "date_sdate": "2010-09-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examines the relationships of work family conflict with job related consequences. Although past studies related work family conflict to different types of job outcomes, little is known regarding its impact on more distal organizationally important outcomes and causal mechanisms through which these effects occur. Based on both quantitative and qualitative literature reviews, mediation hypotheses were developed to test whether proximal outcomes which were commonly used in past studies mediate the relationships of work family conflict with distal consequences including ratings of job performance and organizationally meaningful performance outcomes.   Data were collected from 220 customer service workers, matched to 29 managers in 31 hotel food service outlets. In particular, this study used three sources of information such as employee and supervisor surveys and system-generated archival indexes for data analysis. The results of multiple regression analysis (Baron & Kenny, 1986) revealed that job satisfaction and organizational commitment mediate the relationship of work family conflict with only one work outcomeâ  self-reported contextual performance. However, job satisfaction and organizational commitment failed to mediate the relationship between work family conflict and other distal outcomes (e.g., results-organizational indexes). Further, work family conflict was related to one of distal outcomes, check size.  The significance of work family conflictâ  s influence on job related consequences and the utility of proximal outcome variables are discussed. Implications for both research and practice are provided along with future directions for research on work family conflict in the hospitality literature.",
  "description_provenance": [
    "Author Email: bckim@vt.edu",
    "Advisor Email: perduerr@vt.edu",
    "Advisor Email: mccleary@vt.edu",
    "Advisor Email: smurrm@vt.edu",
    "Advisor Email: kevinc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:34Z (GMT). No. of bitstreams: 1 Kim_BC_D_2010.pdf: 1618887 bytes, checksum: 89d6307c8efae17a4844262788916df8 (MD5)   Previous issue date: 2010-09-10"
  ],
  "handle": "29064",
  "identifier_other": "etd-09222010-224656",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09222010-224656/",
  "identifier_uri": "http://hdl.handle.net/10919/29064",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kim_BC_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "mediation",
    "job results",
    "job behaviors",
    "job attitudes",
    "Work family conflict"
  ],
  "title": "Work family conflict and its job consequences: From attitudes to behaviors to the bottom-line",
  "type": "Dissertation"
}