{
  "contributor_author": "Savelyeva, Tamara",
  "contributor_committeecochair": [
    "Hillison, John H.",
    "Stewart, Daisy L."
  ],
  "contributor_committeemember": [
    "McKenna, James R.",
    "Sutphin, H. Dean"
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:16:34Z",
  "date_adate": "2008-10-07",
  "date_available": "2014-03-14T20:16:34Z",
  "date_issued": "2008-09-11",
  "date_rdate": "2008-10-07",
  "date_sdate": "2008-09-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In this study I defined the global learning environment (GLE) as it appeared in the Global Seminar Project (GSP) to address the issues of change in higher education under the pressure of globalization. The combination of constructivist theory and a Biggs' (2003) deep learning concept provided a framework for answering the following research questions: (a)what project components make the course global? and (b)in what ways does the Global Seminar contribute to deep learning?  For the purposes of this study, I used three forms of data collection, including in-depth, open-ended interviews of 20 GSP's instructors; 11 direct observations of the GSP classroom; and analysis of GSP's written documents and artifacts. I used the open-coding feature of ATLAS.ti software to analyze the interview data and identify the descriptive themes that emerged from the observations and documents.   The interview analyses revealed that the GSP's global learning environment included five areas: (a) course structure and academic leadership/management; (b) stakeholder involvement; (c) institutional support; (d) course conducive content; and (e) teaching and learning practices. Within these five major areas I indicated four \"global\" categories of the learning environment established in the course: innovative, international, interactive, supported by the culture of mutual learning. Evidence of deep learning included observed development of students' generic metacompetencies, identified components of instructors' teaching quality, and recognized value of the relationships among course participants.   The research findings brought about two co-dependent understandings of the GLE as a conceptual phenomenon and a practical model. As a conceptual phenomenon, the GLE can be defined as a specific property of an educational structure that occurs when teachers and students are engaged in innovative experiences with the purpose of acquiring understanding of complex global-scale issues by means of cross-cultural interactions and on the basis of mutual learning.   Applied to an educational practice, this understanding of the GLE forms a constructive and participatory model that provides possibilities for transforming higher education practices: shifting from mass-production knowledge to genuine quality education based on the values of teachers. These conclusive definitions open a dialogue regarding how the GLE can initiate meaningful changes in educational theory and practices.",
  "description_provenance": [
    "Author Email: tsavelye@vt.edu",
    "Advisor Email: jamckenn@vt.edu",
    "Advisor Email: dsutphin@vcom.vt.edu",
    "Advisor Email: hillison@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:34Z (GMT). No. of bitstreams: 2 Savelyeva2008_abstract.pdf: 10946 bytes, checksum: 5af5c405de458bde7fa95d32485d7e8c (MD5) Savelyeva2008.pdf: 1835695 bytes, checksum: fbf4aee7d6cb5bb941c4e6b0c1ba8dc7 (MD5)   Previous issue date: 2008-09-11"
  ],
  "handle": "29062",
  "identifier_other": "etd-09222008-141204",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09222008-141204/",
  "identifier_uri": "http://hdl.handle.net/10919/29062",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Savelyeva2008_abstract.pdf",
    "Savelyeva2008.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Higher Education",
    "Transformative Change",
    "Global Education",
    "Global Learning Environment"
  ],
  "title": "Defining a Global Learning Environment in Higher Education: A Case for the Global Seminar Project",
  "type": "Dissertation"
}