{
  "contributor_author": "Hall, Tracy Smith",
  "contributor_committeechair": "Dudley, Larkin S.",
  "contributor_committeemember": [
    "Wolf, James F.",
    "White, Orion F. Jr.",
    "McSwain, Cynthia J.",
    "Woodard, Colleen"
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:16:36Z",
  "date_adate": "2006-11-15",
  "date_available": "2014-03-14T20:16:36Z",
  "date_issued": "2006-09-08",
  "date_rdate": "2006-11-15",
  "date_sdate": "2006-09-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The dissertation explores the two primary types of public administration feminist literature, equity feminism and other voice feminism, and determines that they do not reveal a clear typology that practically outlines the characteristics of an alternative organizational viewpoint from that of the dominant viewpoint.  Building on Camilla Stivers' metaphor of the home, and drawing on nine other strands of literature, a typology comprised of 4 primary dimensions -- epistemology; ontology; social theory; and ethics -- was constructed that opposed the home metaphorical perspective and the dominant business metaphorical perspective.  The home metaphor, based on Stivers' historical analysis of the early founding of the field of public administration, provided a framework for implementing the rediscovered typology.  The home metaphor was then practically illustrated and revealed through a content analysis of two cases of community policing.  The analysis of these case studies revealed the apparent difficulty of moving from the dominant business metaphorical perspective to the less familiar home metaphorical perspective.  Despite this apparent difficulty, the case studies revealed rich examples of how the home metaphor plays out in cities that are striving to utilize community policing practices.  Public administrators and researchers may use this typology to identify other alternative perspectives for analysis and praxis, as well as nonconventional courses of action.  The case studies demonstrated that a critical aspect of public administration, that of policing, has begun to strongly value this alternative perspective and the positive gains that it brings to strengthening the relationship between public administrators and citizens.",
  "description_provenance": [
    "Author Email: tracysmithhall@comcast.net, hallt@focushope.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: mcswite@sbcglobal.net",
    "Advisor Email: mcswite@sbcglobal.net",
    "Advisor Email: cwoodard@fed-tech.com",
    "Made available in DSpace on 2014-03-14T20:16:36Z (GMT). No. of bitstreams: 1 TracySmithHallDissertation.pdf: 2985011 bytes, checksum: aea9a1f8dda67ec81530e047f7c2b593 (MD5)   Previous issue date: 2006-09-08"
  ],
  "handle": "29075",
  "identifier_other": "etd-09242006-143004",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09242006-143004/",
  "identifier_uri": "http://hdl.handle.net/10919/29075",
  "publisher": "Virginia Tech",
  "relation_haspart": "TracySmithHallDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "public administration",
    "feminine organizational theory"
  ],
  "title": "Rediscovering a Fundamentally New and Practical Administrative Alternative",
  "type": "Dissertation"
}