{
  "contributor_author": "Paye, Julie Melissa Davis",
  "contributor_committeechair": "Williams, Kimberly Forsten",
  "contributor_committeemember": [
    "Love, Brian J.",
    "Akers, Robert Michael",
    "Goldstein, Aaron S.",
    "Van Cott, Kevin E."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:16:35Z",
  "date_adate": "2003-10-14",
  "date_available": "2014-03-14T20:16:35Z",
  "date_issued": "2003-09-10",
  "date_rdate": "2007-01-05",
  "date_sdate": "2003-09-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The overall objective of this research consists of two main parts: (1) provide evidence that autocrine production of IGF-I modulates tight junction permeability and (2) demonstrate the ability of IGFBPs to regulate IGF-I delivery across cell layers.  To meet the first objective, parental and IGF-I secreting bovine mammary epithelial cells were tested for cell layer permeability, tight and adherens junction proteins, IGF-IR, and a downstream signaling components of IGF-IR.  In comparison with parental cells, IGF-I secreting cells had high levels of IGF-IRs, but low levels of the junction components E-cadherin, b-catenin, and occludin.  The differences in parental and IGF-I secreting cells was not due to extracellular stimuli since inclusion of IGF-I, IGFBP-3, or co-culture with SV40-IGF-I cells did not alter the barrier properties of parental cells, suggesting that intracrine signaling may alter cell connectivity.  The second objective focused on exogenous rather than endogenous IGF-I and the role of IGFBPs and IGF-IRs in ligand transcytosis.  Bovine aortic endothelial cells (BAECs) cultured on surfaces optimized to minimize paracellular transport were utilized to investigate the kinetics involved in the transport of insulin-like growth factor-I from the apical side of confluent monolayers to the basolateral side.  Binding competitors were used to determine the role of the cell surface insulin-like growth factor-I receptor (IGF-IR) and cell surface insulin-like growth factor binding proteins (IGFBPs) in this transport process.  Although IGFBPs initially retard delivery of IGF-I, using a computation model, this report shows that pulse durations of less than 6 hrs resulted in enhanced delivery of IGF-I in the presence of IGFBPs, above that for delivery in the absence of IGFBPs.  In addition, the model was utilized to identify key parameters to target when developing engineered growth factors for the treatment of diseases.  It is shown that the sorting factions and internalization rates are reasonable targets for the design of engineered growth factors.  Since the sorting fractions are dictated by binding affinities in the acidic environment of the endosomes, it may be beneficial to design and analog of IGF-I that is more resistant to changes in pH, similar to those develop from epidermal growth factor.",
  "description_provenance": [
    "Author Email: jpaye@vt.edu",
    "Advisor Email: blove@vt.edu",
    "Advisor Email: rma@vt.edu",
    "Advisor Email: goldst@vt.edu",
    "Advisor Email: kfw@vt.edu",
    "Advisor Email: kvancott no spam @vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:35Z (GMT). No. of bitstreams: 1 JMDPaye.pdf: 3580732 bytes, checksum: 3faeacb1c3d6ef9cc979277c52a418c0 (MD5)   Previous issue date: 2003-09-10"
  ],
  "handle": "29071",
  "identifier_other": "etd-09242003-142645",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09242003-142645/",
  "identifier_uri": "http://hdl.handle.net/10919/29071",
  "publisher": "Virginia Tech",
  "relation_haspart": "JMDPaye.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "diabetes",
    "Scatchard plot",
    "tumor metastasis",
    "computational model",
    "Satin plot"
  ],
  "title": "Effect of the Insulin-like Growth Factor (IGF) Axis on the Transport Properties of Endothelial and Epithelial Cells In Vitro",
  "type": "Dissertation"
}