{
  "contributor_author": "Elmasry, Sarah Khalil",
  "contributor_committeechair": "Jones, James R.",
  "contributor_committeemember": [
    "Earthman, Glen I.",
    "Dunlap, Daniel R.",
    "Schubert, Robert P.",
    "Jones, Dennis B."
  ],
  "contributor_department": "Architecture",
  "date_accessioned": "2014-03-14T20:16:35Z",
  "date_adate": "2007-10-04",
  "date_available": "2014-03-14T20:16:35Z",
  "date_issued": "2007-09-10",
  "date_rdate": "2007-10-04",
  "date_sdate": "2007-09-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research proposes sets of design patterns of learning environments as an innovative approach towards an intelligent architectural design process. These patterns are based on teachers창   spatial and pedagogical use of their learning environments.  The study is based in the desired condition that learning environments are expected to host learning technologies efficiently, to adapt to the fact that its life span is much longer than that of any technology within it, and to accommodate a variation of teaching modes and learning styles.  In an effort to address these issues; calls for designing flexible learning spaces have emerged, as well as recommendations for alternative layouts. Yet, more challenging questions emerge; how efficiently do these technologies integrate with other systems in the classroom space? What should architects and facility planners consider for a successful systems창   integration which incorporates learning technologies in the design of the classroom space? And how can these spaces support variations in pedagogical practice. This study attempts to answer these questions by developing a pattern language to support the early design phases of a technology-rich learning environment.  The study is qualitative in nature, and based on interviews with a sample of teachers at academic year Governor창  s science and technology schools in Virginia. The researcher attempts to capture problems and challenges related to occupants창   performance within the physical boundaries of the classroom when learning technologies are in use. The variation of teaching-learning modes is taken into consideration.  In this process, the researcher focuses on integration patterns of learning technologies with the envelope and the interior systems. The findings are then translated into the design language in the form of a pattern language at the building systems scale.",
  "description_provenance": [
    "Author Email: selmasry@vt.edu",
    "Advisor Email: wolverine@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: dunlapd@vt.edu",
    "Advisor Email: silver@vt.edu",
    "Advisor Email: dbjones@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:35Z (GMT). No. of bitstreams: 2 SElmasryETDbodytext.pdf: 3523407 bytes, checksum: 8e8c0aa5c586896fdd13a1c683381a5f (MD5) SElmasryETDAppndicesRef.pdf: 6639455 bytes, checksum: bdfb9bac16fc90046669529f4b40d7a7 (MD5)   Previous issue date: 2007-09-10"
  ],
  "handle": "29070",
  "identifier_other": "etd-09232007-220306",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09232007-220306/",
  "identifier_uri": "http://hdl.handle.net/10919/29070",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "SElmasryETDbodytext.pdf",
    "SElmasryETDAppndicesRef.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Learning Environments",
    "Pattern Language",
    "Architectural Systems' Integration"
  ],
  "title": "Integration Patterns of Learning Technologies",
  "type": "Dissertation"
}