{
  "contributor_author": "Roehrich, Susan K",
  "contributor_committeecochair": [
    "Lawson, Gerard F.",
    "Burge, Penny L."
  ],
  "contributor_committeemember": [
    "Uray, M. Semiha",
    "Bodenhorn, Nancy E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:16:36Z",
  "date_adate": "2007-10-02",
  "date_available": "2014-03-14T20:16:36Z",
  "date_issued": "2007-09-10",
  "date_rdate": "2007-10-02",
  "date_sdate": "2007-09-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Men as well as women are affected by the life-changing events of pregnancy and childbirth. The nature of fatherhood and the role of the male in the birthing process have undergone significant changes in the past several decades. While this phenomenon has been well-documented regarding the changes a father experiences during a healthy pregnancy and birth, there is little research that addresses the implications for the man when his spouse or partner is diagnosed with postpartum depression. Approximately 10 to 20% of birth mothers are affected by some form of this disorder (Greenberg & Springen, 2001). The literature on this topic has grown steadily in an effort to better understand the reasons and implications of such a diagnosis for a woman. This researcher's intent was to identify the perspectives of men whose spouses or partners were diagnosed with postpartum depression. Understanding this situation from their  perspectives can represent information regarding the effects of postpartum depression on the interpersonal relationship and, secondarily, the family unit. In particular, relationship strains between the men and their spouses or partners and the impact on the adjustment to having an infant to care for were explored. Medical records were reviewed in a medical practice for significant scores on the mother's Edinburgh Postnatal Screening Scale. After a series of elimination steps, seven men were identified and willing to participate in the research. In an hour-long interview, the men discussed their experience with their spouse/partner's postpartum depression. Field notes were taken before, during and immediately following the interviews to add clarification, using nonverbal responses to the setting and interview questions. The transcripts of the interviews were coded to identify common categories, which in turn generated themes of emotional deregulation, seeking normalcy, understanding self, and disappointment. Anger was noted by the seven men as a response on several levels to the postpartum depression. In addition to anger, frustration was expereinced with the lack of information received and the lack of response from the medical community as a whole. Several of the men reported surprise at their previous emotions resurfacing so readily when answering the interview questions.",
  "description_provenance": [
    "Author Email: therapy4u@verizon.net",
    "Advisor Email: glawson@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:36Z (GMT). No. of bitstreams: 1 0907RoehrichDissertation.pdf: 793307 bytes, checksum: d0a2909bd076efa598c5a01d84e4fb6a (MD5)   Previous issue date: 2007-09-10"
  ],
  "handle": "29076",
  "identifier_other": "etd-09242007-164439",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09242007-164439/",
  "identifier_uri": "http://hdl.handle.net/10919/29076",
  "publisher": "Virginia Tech",
  "relation_haspart": "0907RoehrichDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "postpartum depression",
    "father's expereince"
  ],
  "title": "Men's Perspectives on a spouse or partner's postpartum depression",
  "type": "Dissertation"
}