{
  "contributor_author": "Velpuri, Jayalakshmi",
  "contributor_committeechair": "Nickols-Richardson, Sharon M.",
  "contributor_committeemember": [
    "Stewart, Daisy L.",
    "Stadler, Kathleen M.",
    "Barbeau, William E.",
    "Leiferman, Jennifer"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:16:36Z",
  "date_adate": "2004-10-29",
  "date_available": "2014-03-14T20:16:36Z",
  "date_issued": "2004-09-10",
  "date_rdate": "2007-10-29",
  "date_sdate": "2004-09-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Effective educational efforts require knowledgeable health professionals to promote breastfeeding and instigate changes in individual behavior.  This research was conducted to assess breastfeeding knowledge, and attitudes, beliefs, and intentions among students and professionals in health-related fields. A 5-year prospective study was conducted to investigate breastfeeding knowledge, and attitudes, beliefs, and intentions regarding breastfeeding in the workplace among nutrition students (n=69) while in school and later while in the workplace. A 47-item questionnaire was mailed to participants to survey knowledge, and attitudes, beliefs, and intentions related to breastfeeding in the workplace along with demographic information. From baseline to follow-up, nutrition students had a significant increase in breastfeeding knowledge (P<0.001), and change in attitudes (P<0.01) and change in intentions (P<0.02) regarding breastfeeding in the workplace. Sources of breastfeeding information were predictors of attitudes and intentions regarding breastfeeding in the workplace. In a separate study, a cross-sectional comparison of nutrition students (n=270) and non-nutrition students (n=271) at Virginia Tech demonstrated that nutrition students had significantly higher scores on breastfeeding knowledge, and attitudes, beliefs, and intentions regarding breastfeeding in the workplace scales (all P<0.001) compared to non-nutrition students. The 47-item questionnaire was also used in this investigation with junior, senior, and graduate students enrolled at Virginia Tech in spring of 20004. In both nutrition and non-nutrition students, attitudes and beliefs were significant predictors (both P<0.001) of intentions regarding breastfeeding in the workplace. In a final study, a cross-sectional evaluation of the Caribbean Association of Home Economics (CAHE) (n=71) revealed that respondents had mean (&#177;SD) scores of 5.76 + 1.34 for breastfeeding knowledge, 3.67 + 0.50 for attitudes, and 4.23 + 0.68 for beliefs related to breastfeeding in the workplace. Based on the 35-item survey, attitudes regarding breastfeeding in the workplace were positive predictors of beliefs (P<0.001). Overall, nutrition students, nutrition graduates, and CAHE members are knowledgeable about breastfeeding and possess positive attitudes and intentions regarding breastfeeding in the workplace. Attitudes regarding breastfeeding in the workplace are critical to intended behaviors. Nutrition program graduates may be effective educators of and advocates for breastfeeding and for breaking barriers to breastfeeding in the workplace.",
  "description_provenance": [
    "Author Email: jvelpuri@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Advisor Email: stadler@vt.edu",
    "Advisor Email: snrichar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:36Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 748077 bytes, checksum: 99cd19aefea050686ec1a7b71b5d4696 (MD5)   Previous issue date: 2004-09-10"
  ],
  "handle": "29073",
  "identifier_other": "etd-09242004-172258",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09242004-172258/",
  "identifier_uri": "http://hdl.handle.net/10919/29073",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Knowledge",
    "Workplace",
    "Students",
    "Health professionals",
    "Attitudes",
    "Breastfeeding"
  ],
  "title": "Breastfeeding knowledge, attitudes, beliefs, and intentions regarding breastfeeding in the workplace among students and professionals in health-related fields",
  "type": "Dissertation"
}