{
  "contributor_author": "Azbej, Tristan",
  "contributor_committeechair": "Bodnar, Robert J.",
  "contributor_committeemember": [
    "Szabo, Csaba",
    "Tracy, Robert J.",
    "Kiran, Erdogan R.",
    "Beard, James S.",
    "Rimstidt, james Donald"
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:16:36Z",
  "date_adate": "2007-09-17",
  "date_available": "2014-03-14T20:16:36Z",
  "date_issued": "2006-08-22",
  "date_rdate": "2007-09-17",
  "date_sdate": "2006-09-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The role and behavior of fluids in hydrothermal and magmatic environments have been studied. Experimental studies have been carried out to determine fluid properties, in natural environments and in both synthetic and natural fluid and melt inclusions. One of these studies dealt with the effect of composition on the critical P-T-X properties of aqueous salt solutions approximated by the H2O-NaCl-KCl-CaCl2 system. The results indicate a systematic variation in critical properties as a function of composition over the range of P-T-X studied. A technique for analyzing individual H2O-CO2 inclusions using Raman spectroscopy has also been developed. The resulting empirical equation relating Raman intensities and composition is valid for compositions â ¤50mol% CO2. The technique has been applied to H2O-CO2 inclusions from the Butte, MT Porphyry Cu-Mo deposit and the results agree with compositions estimated from microthermometric and petrographic observations. The aim of another study was to study water loss from melt inclusions during laboratory heating. Melt inclusions had lost insignificant amounts of water when held at experimental conditions (800Â°C, 1 kbar) for â ¤24 hours. However, significant water loss was observed for longer duration experiments. Ocelli, which are globular bodies of felsic minerals are interpreted as products of magmatic melt immiscibility. As such, the carbonate aggregates in Cretaceous lamprophyres from Hungary with similar petrographic characteristics have also generally been interpreted to be products of magmatic immiscibility. Petrographic and geochemic studies have shown three three distinct genetic groups for these aggregates, none of which were consistent with a magmatic origin.",
  "description_provenance": [
    "Author Email: tazbej@vt.edu",
    "Advisor Email: rjb@vt.edu",
    "Advisor Email: cszabo@cerberus.elte.hu",
    "Advisor Email: rtracy@vt.edu",
    "Advisor Email: ekiran@vt.edu",
    "Advisor Email: jbeard@vnhm.org",
    "Advisor Email: jdr02@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:36Z (GMT). No. of bitstreams: 1 Azbej3.pdf: 3420016 bytes, checksum: a93a36df0254438ecff044d775174164 (MD5)   Previous issue date: 2006-08-22"
  ],
  "handle": "29074",
  "identifier_other": "etd-09242006-134907",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09242006-134907/",
  "identifier_uri": "http://hdl.handle.net/10919/29074",
  "publisher": "Virginia Tech",
  "relation_haspart": "Azbej3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "raman",
    "melt inclussions",
    "hydothermal fluids",
    "H2O-CO2",
    "salt solutions",
    "critical behavior",
    "critical point",
    "synthetic fluid inclusions",
    "fluid inclusions"
  ],
  "title": "The Role of Fluids in Geological Processes",
  "type": "Dissertation"
}