{
  "contributor_author": "West, Richard Wayne",
  "contributor_committeecochair": [
    "Parks, David J.",
    "Earthman, Glen I."
  ],
  "contributor_committeemember": [
    "Parson, Stephen R.",
    "Myers, William S.",
    "Richards, Robert R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:16:40Z",
  "date_adate": "2000-10-31",
  "date_available": "2014-03-14T20:16:40Z",
  "date_issued": "2000-06-01",
  "date_rdate": "2001-10-31",
  "date_sdate": "2000-09-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "This is a qualitative study of second-career military personnel who have become teachers after they completed an alternative certification program. Factors that contributed to the transition of second-career military teachers to the classroom were examined. Obstacles the teachers  encountered during the transition were also examined. How well the alternative certification program prepared the participants for selected components of teaching in this study was determined. Finally, the  beginning teacher program in the school division was examined to determine how well the program facilitated the transition. Nine school principals, nine mentors, and 13 second-career teachers were interviewed. Their responses were placed in categories to answer the research questions. Patterns and themes emerged from the responses to determine the findings.  Five factors emerged that contributed to the second-career teachers' transition: (a) life experiences, (b) values and attitudes, (c) willingness to accept diversity, (d) ability to adapt, and (e) previous military rank and status. The interviewees identified five obstacles they encountered: (a) learning to relate to students, (b) environmental differences between the military and schools, (c) the lack of knowledge about how schools operate, (d) staff and community relations, and (e) the lack of feedback on their performance.  The alternative certification program facilitated the transition to the classroom. The second-career teachers entered teaching with excellent knowledge in their content areas. They demonstrated strengths in doing lesson plans and accepting extra duties. They thought the Military Career Transition Program at Old Dominion University prepared them well for the classroom. Principals and mentors felt they were well prepared in knowledge of content, but they needed additional training in pedagogy.  The new teacher program of the school division included a three-day preservice, a two-day school orientation, a classroom observation from an instructional specialist, a handbook for beginning teachers, and an assigned mentor. Problems were identified with the implementation of the beginning teacher program.",
  "description_provenance": [
    "Author Email: richardwwest@home.com",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: richards@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:40Z (GMT). No. of bitstreams: 5 Chapters.PDF: 263501 bytes, checksum: 785358813d48a135672a07e423f4f8f0 (MD5) Appendix.pdf: 34961 bytes, checksum: 41797608ad1fc791a6c0a78c05e3868d (MD5) Section1.pdf: 14069 bytes, checksum: a4f974461579aec2fb8df9a2f9aed737 (MD5) Section5.pdf: 206346 bytes, checksum: 6a78f66ffb224816e041d3c72592ada4 (MD5) References.PDF: 17760 bytes, checksum: 0a262242dd629bf7e1c1fbe172e90b60 (MD5)   Previous issue date: 2000-06-01"
  ],
  "handle": "29086",
  "identifier_other": "etd-09252000-20230014",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09252000-20230014/",
  "identifier_uri": "http://hdl.handle.net/10919/29086",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapters.PDF",
    "Appendix.pdf",
    "Section1.pdf",
    "Section5.pdf",
    "References.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "SECOND-CAREER",
    "TEACHERS",
    "TRANSITION",
    "MILITARY"
  ],
  "title": "The Transition of Military Personnel to Public Educatiion",
  "type": "Dissertation"
}