{
  "contributor_author": "Ranjan, Ashish",
  "contributor_committeechair": "Ramanathan  Kasimanickam",
  "contributor_committeemember": [
    "Nammalwar Sriranganathan",
    "Judy Riffle",
    "Kevin Pelzer",
    "Gary Pickrell",
    "William S. Swecker Jr."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:16:40Z",
  "date_adate": "2009-10-21",
  "date_available": "2014-03-14T20:16:40Z",
  "date_issued": "2009-09-10",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-09-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Intracellular pathogens like Salmonella have developed various mechanisms to evade host defenses, and they can establish infections. Treatment and eradication are difficult due to our inability in achieving the optimum concentrations of cell-impermeable aminoglycosides like gentamicin within these cells. In this dissertation, we hypothesize that developing a novel core-shell methodology for incorporating high amounts of gentamicin into the cores with either hydrophilic or amphiphilic shell will be more effective than the free gentamicin in clearing intracellular Salmonella infection. <p> Hydrophilic core-shell nanostructures (N1) were made with block co-polymers of poly (ethylene oxide-b-sodium acrylate) blended with sodium polyacrylate (PAA-+Na) and complexed with the polycationic antibiotic gentamicin. N1 showed 20-25 fold higher gentamicin loading than the currently existing materials and reduced numbers of viable Salmonella in the liver and spleen compared to free gentamicin. To further improve the rate and route of uptake, the shell of the nanostructures were made amphiphilic by incorporating pluronics F68 (PPO)68 in the block copolymer. We showed that core-shell nanostructures encapsulating gentamicin having (PPO)68 in the shell (N2) enhances the rate and modulates the route of uptake into macrophages, thus promoting significant reduction in the intracellular Salmonella in-vitro and in-vivo.   The main drawback of N2 was its poor stability at physiological pH of 7.4, 0.1 M NaCl. Therefore, core-shell nanostructures encapsulating gentamicin containing pluronic P85 (PPO)85 in the shell (N3) with improved colloidal and ionic stability were designed. N3 achieved significant intracellular reduction of vacuolar Salmonella (0.53 log10) and cytoplasm resident Listeria (3.11 log10) compared to free gentamicin in-vitro. However, greater reduction of Listeria suggested that sub-cellular localization of bacterium influences targeting by N3. Even though oral administration of N3 was not effective compared to free gentamicin, parenteral (I.P.) administration significantly reduced the intracellular Salmonella from liver and spleen compared to free gentamicin and appeared to have no abnormal in-vivo toxicity.<p> In summary, core-shell nanostructures encapsulating gentamicin (N) with improved encapsulation efficiency and different shell chemistry (N1, N2 and N3) were developed with enhanced efficacy against intracellular Salmonella. The novel gentamicin delivery approach developed in this study may be applicable for therapy of many intracellular infections.",
  "description_provenance": [
    "Author Email: aranjan@vt.edu",
    "Advisor Email: drram@vt.edu",
    "Advisor Email: nathans@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: kpelzer@vt.edu",
    "Advisor Email: pickrell@vt.edu",
    "Advisor Email: cvmwss@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:40Z (GMT). No. of bitstreams: 2 Ranjan_Ashish_D_2009.pdf: 12562863 bytes, checksum: 222772afc82d6e71bb3af65e0883e3f7 (MD5) CERTIF.pdf: 213798 bytes, checksum: 7216f75bd5594e9af8eb9020770f471f (MD5)   Previous issue date: 2009-09-10"
  ],
  "handle": "29082",
  "identifier_other": "etd-09242009-231415",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09242009-231415/",
  "identifier_uri": "http://hdl.handle.net/10919/29082",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Ranjan_Ashish_D_2009.pdf",
    "CERTIF.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Nanostructures",
    "Salmonella",
    "Gentamicin",
    "Drug delivery"
  ],
  "title": "Development of core-shell nanostructure encapsulating gentamicin as efficient drug delivery system against intracellular Salmonella",
  "type": "Dissertation"
}