{
  "contributor_author": "James, Tracy",
  "contributor_committeechair": "Banerjee, Diya",
  "contributor_committeemember": [
    "Kuhn, Jeffrey R.",
    "Cimini, Daniela",
    "Sobrado, Pablo"
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:16:40Z",
  "date_adate": "2012-10-23",
  "date_available": "2014-03-14T20:16:40Z",
  "date_issued": "2012-09-11",
  "date_rdate": "2012-10-23",
  "date_sdate": "2012-09-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Period, which is broadly conserved in metazoans, regulates circadian timing of neurophysiology as well as cell fate specification. Studies in mouse and humans indicate that period functions as a tumor suppressor and controls adult stem cell differentiation. However, regulation of period function in developmental pathways has not been characterized and appears to be different from its regulation and function in circadian pathways. lin-42 is the Caenorhabditis elegans ortholog of period and has both circadian and developmental timing functions. During post-embryonic larval development, cyclic expression and function of lin-42 controls stage-specific and reiterative cell fate choices of a subset of epidermal stem cells called seam cells. We are studying lin-42 regulation of seam cell fate during C. elegans larval development as a model for understanding the mechanisms of period regulation of adult stem cell fate in mammals.  This dissertation describes the research undertaken to characterize the cis-regulatory elements and the trans-regulatory factors that control lin-42 expression. We used direct molecular interaction assays (Electrophoretic Mobility Shift Assay, EMSA) (Chapter 2) followed by an RNA interference (RNAi)-based genetic screen (Chapter 3) to identify lin-42 transcriptional regulators. Using the EMSA, we identified three 50 to 100 base pair regions (binding regions, BR1-3) in the lin-42 5â  noncoding sequences that were bound with specificity by C. elegans nuclear proteins. These binding regions represent putative cis-regulatory elements that may serve as transcription factor binding sites (TFBSs). We attempted to identify by mass spectrometry the proteins that bind to the BR sequences. We also used Phylogenetic Footprinting and bioinformatics screens to identify candidate C. elegans transcription factors (TFs) that may bind to putative TFBSs within the BR sequences. Using an RNAi-based screen, we tested the candidate TF genes for potential genetic interactions with lin-42. We identified ZTF-16, a member of the Hunchback/Ikaros zinc-finger transcription factor family, as a potential lin-42 activator and, using quantitative real-time PCR, confirmed that ztf-16 mutation results in down-regulation and loss of cycling expression of lin-42. We further determined that loss of ztf-16 results in seam cell development defects that phenocopy lin-42 loss-of-function, thus validating ZTF-16 as a transcriptional activator of lin-42.",
  "description_provenance": [
    "Author Email: tjames84@vt.edu",
    "Advisor Email: jrkuhn@vt.edu",
    "Advisor Email: cimini@vt.edu",
    "Advisor Email: dibaner@vt.edu",
    "Advisor Email: psobrado@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:40Z (GMT). No. of bitstreams: 1 James_T_D_2012.pdf: 17943446 bytes, checksum: 0b23f2ad2e83bc9fd42ea28295289882 (MD5)   Previous issue date: 2012-09-11"
  ],
  "handle": "29083",
  "identifier_other": "etd-09242012-133234",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09242012-133234/",
  "identifier_uri": "http://hdl.handle.net/10919/29083",
  "publisher": "Virginia Tech",
  "relation_haspart": "James_T_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "RNAi",
    "circadian period",
    "EMSA",
    "ztf-16",
    "lin-42",
    "C. elegans",
    "post-embryonic",
    "transcriptional"
  ],
  "title": "Characterization of Transcriptional and Post-transcriptional Regulation of lin-42/Period During Post-embryonic Development of C. elegans",
  "type": "Dissertation"
}