{
  "contributor_author": "Tyree, Michael Christopher",
  "contributor_committeechair": "Seiler, John R.",
  "contributor_committeemember": [
    "Maier, Christopher A.",
    "Fox, Thomas R.",
    "Nilsen, Erik T.",
    "Daniels, Walter Lee"
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:16:39Z",
  "date_adate": "2008-10-16",
  "date_available": "2014-03-14T20:16:39Z",
  "date_issued": "2008-09-11",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-09-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objective of this research was to determine how genetics and nutrient availability influence C cycling in intensively managed southern pine forests.  This work consisted of a two year field and a complimentary one year greenhouse study each split into above- and belowground pools and fluxes.  Both the greenhouse and field experiment showed differences between contrasting genotypes in gas exchange parameters and C partitioning patterns, but genetic by nutrient availability interactions were only observed in the field.  In the field study, some genotypes were better able to tolerate nutrient limitations due to more favorable canopy architecture and lower N demand.  Our results clearly show that contrasting ideotypes have the potential to respond differently to differences in nutrient availability in terms of biomass partitioning, leaf physiology, and leaf biochemistry (Chapter 3).<p>  Both experiments showed short-term improvements to soil physical and chemical properties, which have been shown to correlate with higher site quality.  In both the greenhouse and field experiment, we concluded that increased C loss by way of total soil CO2 efflux (FS) made up only a small percent total C incorporated as LR.  Short-term results led us to conclude that combining LR treatments and planting of genotypes with low nutrient demand or high nutrient use efficiency may increase soil organic matter (SOM) while avoiding loss of stem volume from nutrient immobilization.  Data from our field study showed a strong genotype by soil amendment interaction for FS over all sampling dates with the relative importance of contributing factors (heterotrophic or root respiration) also changing (Chapter 5).   <p> Overall, logging residue incorporation increased total system C gain per ha more than did fertilization alone, but there were differences between genotypes planted (Chapter 6).  Data from the field experiment show that although LR incorporation did not decrease overall net primary productivity, it did decrease biomass partitioning to merchantable products (main stem) depending on genotype.  These data underline the importance of matching appropriate genotypes to specific site conditions and silvicultural prescriptions.",
  "description_provenance": [
    "Author Email: mtyree@vt.edu",
    "Advisor Email: jseiler@vt.edu",
    "Advisor Email: cmaier@fs.fed.us",
    "Advisor Email: trfox@vt.edu",
    "Advisor Email: enilsen@vt.edu",
    "Advisor Email: wdaniels@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:39Z (GMT). No. of bitstreams: 1 Tyree_ETD.pdf: 3556448 bytes, checksum: 41ea7bada7bf66cd3572c24736b1a520 (MD5)   Previous issue date: 2008-09-11"
  ],
  "handle": "29080",
  "identifier_other": "etd-09242008-134413",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09242008-134413/",
  "identifier_uri": "http://hdl.handle.net/10919/29080",
  "publisher": "Virginia Tech",
  "relation_haspart": "Tyree_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "C sequestration",
    "fertilization",
    "genetic by environment interactions",
    "leaf gas exchange",
    "loblolly pine",
    "logging residue",
    "soil respiration"
  ],
  "title": "Genetics by Nutrient Availability Interactions on Short-term Carbon Pools and Fluxes in Young Pinus taeda Plantations",
  "type": "Dissertation"
}