{
  "contributor_author": "Williamson, David",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "Esker, Alan R.",
    "Willis, Carl L.",
    "McGrath, James E.",
    "Kingston, David G. I."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:16:41Z",
  "date_adate": "2003-10-10",
  "date_available": "2014-03-14T20:16:41Z",
  "date_issued": "2003-08-21",
  "date_rdate": "2003-10-10",
  "date_sdate": "2003-09-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Polymers containing poly(1,3-cyclohexadiene) were synthesized using a novel pre-formed initiator comprised of an alkyllithium and a tertiary diamine.  The use of a pre-formed intiator at moderate temperatures (25° C) enabled the synthesis of high molecular weight poly(1,3-cyclohexadiene) homopolymers (<Mn> = 50000) with narrow molecular weight distributions (<Mw>/<Mn> = 1.20).  In contrast, the use of a conventional anionic initiation approach resulted in polymerizations that lacked significant degrees of livingness, which limited the polymer molecular weights to approximately 10000. Use of the preformed initiator resulted in a reduction in the degree of both chain termination and chain transfer.  In addition, the livingness of the polymerization was shown to be a function of the monomer concentration and the polymerization temperature.  The regiochemistry of the polymers were shown to be dependent on the tertiary amine used in the polymerization, which provided a route for the synthesis of polymers with a microstructure rich in either high 1,2-addition (70%) or high 1,4-addition (90%).  A range of analytical methods were employed to determine the stereo and regiochemistry of poly(1,3-cyclohexadiene).  These methods included 1H NMR, 13C NMR, and endgroup functionalization of the propagating center with chlorotrimethylsilane.  The impact of regiochemistry on the thermal properties was examined using differential scanning calorimetry.  In addition, the thermooxidative properties of these poly(1,3-cyclohexadiene) polymers were characterized in a series of oxidative studies and the onset of oxidative degradation occurred at 110° C.  Perfectly alternating copolymers of poly(1,3-cyclohexadiene-alt-styrene) were synthesized, and the reactivity ratios for these copolymers (r1,3CHD =   0.022, rstyrene = 0.024) were determined using a conventional Mayo-Lewis approach.  The effect of aromatization and hydrogenation on the thermal properties of these copolymers was determined using thermal gravimetric analysis and differential scanning calorimetry. The synthesis of poly(1,3-cyclohexadiene) DVB coupled star-shaped polymers was performed using a convergent arm-first approach in combination with a divinylbenzene coupling agent (PDI = 1.25).  Well-defined poly(1,3-cyclohexadiene-block-isoprene)-star shaped polymers were synthesized and utilized for the development of novel high temperature thermoplastic elastomers, with excellent elastomeric properties (percent elongation = 745 %, tensile strength = 7.2 MPa).  Atomic force microscopy in combination with differential scanning calorimetry verified the presence of microphase separation between the blocks.",
  "description_provenance": [
    "Author Email: dawill11@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:41Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 7926772 bytes, checksum: 7bd462338b109ee0e078b51cb4c40438 (MD5)   Previous issue date: 2003-08-21"
  ],
  "handle": "29090",
  "identifier_other": "etd-09252003-192601",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09252003-192601/",
  "identifier_uri": "http://hdl.handle.net/10919/29090",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "1",
    "high molecular weight",
    "block copolymers",
    "anionic polymerization",
    "3-cyclohexadiene",
    "thermoplastic elastomers"
  ],
  "title": "SYNTHESIS AND CHARACTERIZATION OF WELL-DEFINED POLY(1,3-CYCLOHEXADIENE) HOMOPOLYMERS AND COPOLYMERS",
  "type": "Dissertation"
}