{
  "contributor_author": "Hickman, Michael Darnell",
  "contributor_committeechair": "Salmon, Richard G.",
  "contributor_committeecochair": "Fortune, Jimmie C.",
  "contributor_committeemember": [
    "Niles, Jerome A.",
    "DeBolt, Thomas"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:16:41Z",
  "date_adate": "2006-11-29",
  "date_available": "2014-03-14T20:16:41Z",
  "date_issued": "2006-08-14",
  "date_rdate": "2007-11-29",
  "date_sdate": "2006-09-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Keeping students engaged in the learning process is a challenge faced by most teachers. Instituting a bell schedule that requires them to make changes in their traditional instructional delivery may increase that challenge exponentially. The benefit of an extended period, also known as the block schedule, is that it permits the opportunity for teachers to alter their instruction with learning experiences that require more than 55 minutes by using engaging student-centered instruction. One reality of teaching on a block schedule is that many teachers lack the knowledge of effective strategies and rely on instructional devices they employed on a shorter time period. The purpose behind this work is to create a manual that demonstrates engaging student centered strategies and becomes a resource for teachers who are searching for instructional models to utilize in the block schedule. It does this in part by featuring actual hands-on strategies from three instructional models that can be readily used by classroom teachers. With the generative information about the models and activities that is provided in the manual, teachers are encouraged to create their own activities.  Finally, the work provides solicited teacher feedback on the utility of the manual.",
  "description_provenance": [
    "Author Email: mickeyhickman@yahoo.com",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: thomas.debolt@mpark.net",
    "Advisor Email: rgsalmon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:41Z (GMT). No. of bitstreams: 1 StudentCenteredStrategiesforEngagingInstructionExtendedPeriodETD112206.pdf: 1853024 bytes, checksum: 1229f83487df57b5c5eeb2fc1561c300 (MD5)   Previous issue date: 2006-08-14"
  ],
  "handle": "29092",
  "identifier_other": "etd-09252006-100137",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09252006-100137/",
  "identifier_uri": "http://hdl.handle.net/10919/29092",
  "publisher": "Virginia Tech",
  "relation_haspart": "StudentCenteredStrategiesforEngagingInstructionExtendedPeriodETD112206.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Block Schedule",
    "Cooperative Problem Solving",
    "Concept Attainment",
    "Problem Based Learning"
  ],
  "title": "Student Centered Strategies for Engaging Instruction in the Extended Period",
  "type": "Dissertation"
}