{
  "contributor_author": "Vance, David",
  "contributor_committeechair": "Brill, Jennifer M.",
  "contributor_committeemember": [
    "Rees, Loren Paul",
    "Potter, Kenneth R.",
    "Lockee, Barbara B."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:16:47Z",
  "date_adate": "2012-11-09",
  "date_available": "2014-03-14T20:16:47Z",
  "date_issued": "2012-09-12",
  "date_rdate": "2012-11-09",
  "date_sdate": "2012-09-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examined the relationship between mentored ministerial field educationâ  s four components and student efficacy beliefs in 11 professional skills for students at several evangelical seminaries in the U.S.  It also investigated whether students believed they had become competent practitioners of these skills or had received sufficient mentored field education in order for them to do so.  A new self-efficacy survey was developed, and N=102 students from seven seminaries participated.  Practice accounted for 7.9% of the variance in self-efficacy.  Observation, instruction, and feedback were more weakly correlated with self-efficacy and not significant in the regression.  On a scale from 0 (â  I cannot do at allâ  ) to 10 (â  Highly certain I can doâ  ), participantsâ   self-efficacy in the skills ranged from 6.89 in counseling to 8.98 in â  using and interpreting Scripture;â   and there were indications that many participants had received a somewhat uneven field education.  Only 23% of participants reported receiving sufficient practice and 19% sufficient feedback for them to become competent professionals.  Future directions for research are suggested; and implications for both schools and churches are discussed from the perspective of instructional design, including incorporating studentsâ   self-assessments into learner analysis and field education program evaluation.",
  "description_provenance": [
    "Author Email: dev@vt.edu",
    "Advisor Email: lrees@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: jmbrill@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:47Z (GMT). No. of bitstreams: 2 IRB_Approval_letter.pdf: 279040 bytes, checksum: c54e602562b9c068b4211b9c0d7d2a94 (MD5) Vance_DE_D_2012.pdf: 593608 bytes, checksum: bf65495c38edd346227db2df0c1f7577 (MD5)   Previous issue date: 2012-09-12"
  ],
  "handle": "29097",
  "identifier_other": "etd-09252012-201542",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09252012-201542/",
  "identifier_uri": "http://hdl.handle.net/10919/29097",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "IRB_Approval_letter.pdf",
    "Vance_DE_D_2012.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "professional education",
    "ministerial education",
    "seminary",
    "instructional design",
    "quantitative research"
  ],
  "title": "Self-Efficacy and Ministerial Field Education:  An Instructional Design Perspective",
  "type": "Dissertation"
}