{
  "contributor_author": "Esen, Derya",
  "contributor_committeechair": "Zedaker, Shepard M.",
  "contributor_committeemember": [
    "Jones, Robert H.",
    "Kirwan, Jeffrey L.",
    "Smith, David William",
    "Mou, Paul P."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:16:47Z",
  "date_adate": "2000-09-27",
  "date_available": "2014-03-14T20:16:47Z",
  "date_issued": "2000-06-28",
  "date_rdate": "2001-09-27",
  "date_sdate": "2000-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Purple-flowered rhododendron (Rhododendron ponticum L.) and yellow-flowered rhododendron (R. flavum Don.) are two dominant shrub species of the eastern beech (Fagus orientalis L.) understories in the eastern and western Black Sea Region (BSR), respectively.  These invasive woody species significantly reduce beech growth and can preclude tree regeneration. The ecological consequence is an aging beech overstory with little or no regeneration to replace the mature trees.  Great rhododendron (R. maximum L.) has been increasing in the forests of the Southern Appalachians of the United States, reducing tree regeneration and growth.  The BSR and Southern Appalachians bear noteworthy similarities in climate, topography, and the forest flora.  Purple-flowered and great rhododendrons also show important similarities in their ecology and the forest vegetation problems they can cause.  Current rhododendron-dominated and threatened BSR forests may provide an advanced ecological picture of the forests of the Southern Appalachians in which great rhododendron now thrives.  Therefore, new information gained on the ecology and effective and cost-efficient control of purple-flowered rhododendron may significantly improve forest management practices, not only for the current rhododendron-invaded BSR ecosystem, but also for other parts of the world.  This dissertation consists of five separate yet related chapters.  The first gives relevant literature reviewed for the dissertation.  The second chapter focuses on various environmental and disturbance factors that may have shaped the current purple-flowered rhododendron-dominated beech forests of the BSR of Turkey.  Chapter 3 assesses the effects of various manual and herbicidal woody control techniques on purple-flowered and yellow-flowered rhododendron in two field experiments in the BSR.  The fourth chapter relates a study of uptake and translocation behavior of triclopyr ester and imazapyr in great rhododendron.  This information is used to determine the optimum herbicide-surfactant combinations for the greatest active ingredient uptake and root translocation in great rhododendron.  The last chapter is a synthesis of the information gained in all of these different experiments.",
  "description_provenance": [
    "Author Email: desen@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: zedaker@vt.edu",
    "Advisor Email: jkirwan@vt.edu",
    "Advisor Email: smithdwm@vt.edu",
    "Advisor Email: ppmou@uncg.edu",
    "Made available in DSpace on 2014-03-14T20:16:47Z (GMT). No. of bitstreams: 1 esen.pdf: 599510 bytes, checksum: d892cda811cd969640fd6970f28b195a (MD5)   Previous issue date: 2000-06-28"
  ],
  "handle": "29098",
  "identifier_other": "etd-09262000-16320008",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09262000-16320008/",
  "identifier_uri": "http://hdl.handle.net/10919/29098",
  "publisher": "Virginia Tech",
  "relation_haspart": "esen.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "ecology of rhododendron and beech",
    "cost",
    "anthropogenic",
    "herbicide uptake and translocation",
    "woody weed control",
    "disturbance",
    "tree growth",
    "topography",
    "soil",
    "efficacy",
    "herbicides",
    "surfactant",
    "fire"
  ],
  "title": "Ecology and Control of Rhododendron (Rhododendron ponticum L.) in Turkish Eastern Beech (Fagus orientalis Lipsky) Forests",
  "type": "Dissertation"
}