{
  "contributor_author": "Koyama, Chieko",
  "contributor_committeecochair": [
    "Bodenhorn, Nancy E.",
    "Belli, Gabriella M."
  ],
  "contributor_committeemember": [
    "Lawson, Gerard F.",
    "Madison-Colmore, Octavia D.",
    "Ng, Kok-Mun"
  ],
  "contributor_department": "Education",
  "date_accessioned": "2014-03-14T20:16:48Z",
  "date_adate": "2005-10-14",
  "date_available": "2014-03-14T20:16:48Z",
  "date_issued": "2005-09-12",
  "date_rdate": "2005-10-14",
  "date_sdate": "2005-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Alcohol use among international students in a U.S. community college setting was explored in regard to the interrelationships with acculturation stress and drinking motivations. Misuse of alcohol has been acknowledged as a serious problem on American college campuses. A positive relationship between stress and alcohol use has been documented among those who lack internal and external resources and support systems. International students have been recognized as higher-risk than other college students due to acculturation stress. However, very few studies have investigated the drinking behaviors of this population. To fill this research gap, a survey was conducted with non-immigrant international students (F-1 students) (N = 126) and immigrants international students (non-F-1 students) (N = 136) enrolled in English as a Second Language (ESL) programs in a U.S. community college. The results, which were derived from responses to three published instruments, Index of Life Stress (ILS), Core Alcohol and Drug Survey (CADS) Community College Long Form, and Revised Drinking Motivation Questionnaire (DMQ-R), as well as the researcher-made demographic information sheet, indicated that these groups were not engaged in abusive drinking behavior. This finding may reflect the support systems available to these students in an ESL setting and their family/friend networks. However, moderately strong zero-order correlations between acculturation stress and drinking motives to control negative affects were revealed. Further discussions and implication are provided.",
  "description_provenance": [
    "Author Email: ckoyama@vt.edu",
    "Advisor Email: glawson@vt.edu",
    "Advisor Email: colmore1@juno.com",
    "Advisor Email: kokmunng@email.uncc.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: gbelli@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:48Z (GMT). No. of bitstreams: 2 Koyama_Dissertation.pdf: 605019 bytes, checksum: 95cf2fd32c286f9613bc4bc31d811b9c (MD5) Koyama_Appendices.pdf: 278772 bytes, checksum: 15587aeeffd531c38198b92e9dd03208 (MD5)   Previous issue date: 2005-09-12"
  ],
  "handle": "29103",
  "identifier_other": "etd-09262005-135714",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09262005-135714/",
  "identifier_uri": "http://hdl.handle.net/10919/29103",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Koyama_Dissertation.pdf",
    "Koyama_Appendices.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "International students",
    "Drinking Motivations",
    "Acculturation Stress",
    "Alcohol Use"
  ],
  "title": "Acculturation Stress and Alcohol Use Among International College Students  in a U.S. Community College Setting",
  "type": "Dissertation"
}