{
  "contributor_author": "Pung, Thitiya",
  "contributor_committeechair": "Ehrich, Marion F.",
  "contributor_committeemember": [
    "Kingston, David G. I.",
    "Klein, Bradley G.",
    "Blodgett, Dennis J.",
    "Jortner, Bernard S."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:16:47Z",
  "date_adate": "2004-09-30",
  "date_available": "2014-03-14T20:16:47Z",
  "date_issued": "2004-09-14",
  "date_rdate": "2007-09-30",
  "date_sdate": "2004-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Repeated stress has been reported to cause reversible impairment to the hippocampus. Glutamatergic and cholinergic systems were proposed to be involved in responses seen after exposure to stress and cholinesterase inhibitors. Effects of concurrent exposure to repeated stress and chlorpyrifos (CPF) on concentrations of excitatory amino acids, activities of cholinergic enzymes, and maximum binding density (Bmax) and equilibrium dissociation rate constant (Kd) of NMDA and total muscarinic receptors were studied in Long-Evans rats. The study was divided into 4 experiments. The first experiment was to find the dose of CPF to use for studies on the interaction of stress and CPF. From the results obtained, 60% of the maximum tolerated dose was chosen. An experiment to determine effects of repeated stress and CPF on cholinergic enzymes and glutamate included groups of rats (n=7-8) that were handled 5 days/week; restrained 1 hour/day for 5 days/week; swum 30 minutes for 1 day/week; or restrained 4 days/week and swum for 1 day/week, for 28 days. On day 24, each group was injected either with corn oil or CPF 160 mg/kg sc 4 hours after restraint. On day 28, blood samples were collected for acetylcholinesterase (AChE) activity. Brains were dissected into hippocampus (HP) and cerebral cortex (CC) to determine activities of acetylcholinesterase (AChE), carboxylesterase (Cbxy), and choline acetyltransferase (ChAT), and glutamate and aspartate concentrations. CPF inhibited AChE activity in blood, CC and HP, but stress did not affect AChE activity. Repeated restraint with swim reduced Cbxy and CPF inhibited Cbxy. Restraint with swim had a statistical trend to increase concentrations of glutamate in the HP more than swim alone (p = 0.064); but CPF had no effect on glutamate in the HP. CPF decreased concentrations of elevated aspartate in the HP of rats that were restrained and swum. The results suggested that restraint with swim indirectly elevated acetylcholine in the CC, and tended to increase glutamate in the HP. The experiment designed to study the effects of concurrent exposure to stress and CPF on NMDA and total muscarinic receptors was designed similar to the previous study, except that endpoints were Bmax and Kd of NMDA and total muscarinic receptors in the HP and CC, and NMDA receptors in the hypothalamus (HT). Restrained rats had higher Kd of NMDA receptors in the HP than control and restrained with swim rats; however, Bmax was similar. CPF deceased Bmax and Kd of total muscarinic receptors in the CC of swum rats (237.64 &#177; 17.36 fmol/mg protein, 0.216 &#177; 0.023 nM) and CPF also decreased Bmax of total muscarinic receptors in the CC of restrained rats (229.08 &#177; 17.36 fmol/mg protein). There were no effects of stress, CPF, or interactions of stress and CPF on NMDA receptors in the CC or on total muscarinic receptors in the HP. In summary, CPF was capable of modulation of total muscarinic receptors of swum and restrained rats, suggesting that cholinergic transmission in the CC for cognition, sensory and motor activity may be modified. Furthermore, we examined effects of stress and CPF on concentrations of monoamines. Swim stress and CPF individually decreased concentrations of norepinephrine in the HP, whereas swim and restraint with swim decreased concentrations of norepinephrine but increased concentrations of DOPAC in the HT. Swim stress increased concentrations of dopamine in the HT more than control or restraint. CPF did not alter concentrations of norepinephrine, dopamine, or DOPAC in the HT. The interactions of repeated stress and CPF on serotonin approached significance in the HP (p = 0.06) and HT (p = 0.08). CPF increased serotonin concentrations in rats that were handled and restrained but not swum. CPF reduced the elevated concentrations of serotonin in restrained rats and restrained with swim rats (p < 0.05). Swim and restraint with swim were potential stress models that altered noradrenergic, dopaminergic, and serotonergic responses in the HT. In summary, repeated stressors had effects on glutamatergic, cholinergic, and monoamine systems. CPF had effects on cholinergic and monoamine systems but the interactions between stress and CPF were few.",
  "description_provenance": [
    "Author Email: tpung@vt.edu",
    "Advisor Email: marion@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: bklein@vt.edu",
    "Advisor Email: dblodg@vt.edu",
    "Advisor Email: bjortner@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:47Z (GMT). No. of bitstreams: 3 01_Title.pdf: 54195 bytes, checksum: e028cefd992fd2a77e670874323805bf (MD5) 02_Abstract.pdf: 125481 bytes, checksum: 095703763bdb5bf3fde32f021f6ac219 (MD5) 03_DissertationPDF.pdf: 767567 bytes, checksum: 87f60e51cac4e87e8e9c3dee58e1ce40 (MD5)   Previous issue date: 2004-09-14"
  ],
  "handle": "29101",
  "identifier_other": "etd-09262004-145341",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09262004-145341/",
  "identifier_uri": "http://hdl.handle.net/10919/29101",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01_Title.pdf",
    "02_Abstract.pdf",
    "03_DissertationPDF.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cholinergic system",
    "Keywords: Repeated stress",
    "glutamatergic system"
  ],
  "subject_lcc": "LD5655.V856 2004.P864",
  "title": "Neurochemical Effects of Concurrent Exposure to Repeated Stress and Chlorpyrifos on the Central Nervous System",
  "type": "Dissertation"
}