{
  "contributor_author": "Whitacre, Brian E.",
  "contributor_committeechair": "Mills, Bradford F.",
  "contributor_committeemember": [
    "Peterson, Everett B.",
    "Taylor, Daniel B.",
    "Ashley, Richard A.",
    "Alwang, Jeffrey R."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:16:47Z",
  "date_adate": "2005-10-07",
  "date_available": "2014-03-14T20:16:47Z",
  "date_issued": "2005-09-01",
  "date_rdate": "2005-10-07",
  "date_sdate": "2005-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation explores the persistent gap between rural and urban areas in the percentage of households that access the Internet at home (a discrepancy commonly known as the \"digital divide\").  The theoretical framework underlying a household's Internet adoption decision is examined, with emphasis on the roles that household characteristics, network externalities, and digital communication technology (DCT) infrastructure potentially play.  This framework is transferred into a statistical model of household Internet access, where non-linear decomposition techniques are employed to estimate the contributions of these variables to the digital divide in a given year.  Differences in Internet access rates between years are also analyzed to understand the importance of temporal resistance to the continuing digital divide.     \tThe increasing prevalence of \"high-speed\" or broadband access is also taken into account by modeling a decision process where households that choose to have Internet access must decide between dial-up and high-speed access.  This nested process is also decomposed in order to estimate the contributions of household characteristics, network externalities, DCT infrastructure, and temporal resistance to the high-speed digital divide.   \tThe results suggest that public policies designed to alleviate digital divides in both general and high-speed access should focus more on the broader income and education inequities between rural and urban areas.  The results also imply that the current policy environment of encouraging DCT infrastructure investment in rural areas may not be the most effective way to close the digital divide in both general and high-speed Internet access.",
  "description_provenance": [
    "Author Email: bwhitacr@vt.edu",
    "Advisor Email: petrsone@vt.edu",
    "Advisor Email: taylord@vt.edu",
    "Advisor Email: ashleyr@vt.edu",
    "Advisor Email: alwangj@vt.edu",
    "Advisor Email: bfmills@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:47Z (GMT). No. of bitstreams: 1 Whitacre.pdf: 1690832 bytes, checksum: a95cd93b49889421b5f0283047f91a80 (MD5)   Previous issue date: 2005-09-01"
  ],
  "handle": "29102",
  "identifier_other": "etd-09262005-123744",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09262005-123744/",
  "identifier_uri": "http://hdl.handle.net/10919/29102",
  "publisher": "Virginia Tech",
  "relation_haspart": "Whitacre.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Logit Decomposition",
    "Diffusion",
    "Digital Divide",
    "Internet",
    "Rural"
  ],
  "title": "Bridging the Rural - Urban Digital Divide in Residential Internet Access",
  "type": "Dissertation"
}