{
  "contributor_author": "Parkunan, Venkatesan",
  "contributor_committeechair": "Johnson, Charles S.",
  "contributor_committeecochair": "Eisenback, Jonathan D.",
  "contributor_committeemember": [
    "Jelesko, John G.",
    "McDowell, John M.",
    "Pattison, Jeremy A.",
    "Tolin, Sue A.",
    "Reed, Thomas David"
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:16:49Z",
  "date_adate": "2008-10-28",
  "date_available": "2014-03-14T20:16:49Z",
  "date_issued": "2008-09-15",
  "date_rdate": "2008-10-28",
  "date_sdate": "2008-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Active disease resistance in plants is induced during the pathogen infection process that triggers multiple defense-related genes to establish broad-spectrum resistance. Several biotic and abiotic agents can mimic natural induced resistance (IR), categorized as systemic acquired (SAR) or induced systemic resistance (ISR). IR, triggered by acibenzolar-S-methyl (ASM) or plant growth-promoting rhizobacteria (PGPR), was evaluated on two-to-three types of tobacco in greenhouse and field studies.  Tobacco mosaic virus (TMV) local lesion assays monitored induction and maintenance of ASM-induced SAR over a 21 day period via proportional reduction in the number of TMV local lesions between an untreated control and ASM-treated plants. Intraspecific variation in SAR was found among tobacco types; burley and flue-cured tobaccos responded by day 3, while oriental tobacco responded between day 3 and 6. The SAR signal was greatest between 6 and 15 days following ASM application, but IR was slightly evident even at 21 days after ASM application in all three tobacco types. Bottom and middle leaves responded similarly on all sample dates, but top leaves showed the weakest SAR response. Tobacco cyst nematode (TCN; Globodera tabacum solanacearum) is one of the most destructive pathogens of tobacco in Virginia. Among four PGPR combinations tested, a mixture of Bacillus amyloliquefaciens IN937a (GB99) and B. subtilis A13 (GB122) most consistently suppressed TCN reproduction in flue-cured and oriental tobacco. Application of ASM similarly reduced final numbers of TCN cysts, but also resulted in chlorosis, stunting, and lower plant fresh weight. GB99+GB122 also suppressed TCN development and reproduction in susceptible and resistant flue-cured cultivars, but reductions by ASM were less consistent. In a split-root trial, soil amendment with GB99+GB122 in one half of an oriental tobacco root system lowered final numbers of TCN more than did ASM. ASM exhibited undesirable effects in phytotoxicity trials in flue-cured and oriental tobacco, but GB99+GB122 was not phytotoxic. When oriental tobacco seedlings were grown in a GB99+GB122-treated soil-less media, a single application of 200 mg ASM/L one week after transplanting significantly suppressed TCN reproduction in the field without phytotoxicity. Further field research is needed to confirm this effect in flue-cured tobacco.",
  "description_provenance": [
    "Author Email: venki@vt.edu",
    "Advisor Email: jelesko@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Advisor Email: jpfruit@vt.edu",
    "Advisor Email: spcdis@vt.edu",
    "Advisor Email: jon@vt.edu",
    "Advisor Email: stolin@vt.edu",
    "Advisor Email: threed@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:49Z (GMT). No. of bitstreams: 1 Dissertation_Venkatesan_Parkunan.pdf: 4482434 bytes, checksum: 79b7a11d9b88aa3c6245f5df3765a74f (MD5)   Previous issue date: 2008-09-15"
  ],
  "handle": "29109",
  "identifier_other": "etd-09262008-175116",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09262008-175116/",
  "identifier_uri": "http://hdl.handle.net/10919/29109",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Venkatesan_Parkunan.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Induced resistance",
    "Globodera tabacum solanacearum",
    "TMV local lesion assay",
    "acibenzolar-S-methyl",
    "plant growth-promoting rhizobacteria"
  ],
  "title": "Induced disease resistance elicited by acibenzolar-S-methyl and plant growth-promoting rhizobacteria in tobacco (Nicotiana tabacum L.)",
  "type": "Dissertation"
}