{
  "contributor_author": "Cline, Terry Lee",
  "contributor_committeecochair": [
    "Fortune, Jimmie C.",
    "Alexander, David"
  ],
  "contributor_committeemember": [
    "Hairston, Joseph",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:16:48Z",
  "date_adate": "2006-11-21",
  "date_available": "2014-03-14T20:16:48Z",
  "date_issued": "2006-07-18",
  "date_rdate": "2006-11-21",
  "date_sdate": "2006-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Does ethnicity of the student prevent equal levels of learning at an equal pace? Are schools required to teach all children effectively, no matter what their socio-economic status, gender, or ethnicity? Educators and researchers have longed for the answers to these questions. For years, educators have been looking for ways to teach children in schools that are racially identifiable and have the highest percentages of children on free and reduced lunch. School districts that have choice as a way of assigning students are increasing the number of racially identifiable schools. In Charlotte-Mecklenburg Schools, a choice plan was implemented in June 2001. That plan created more schools of poverty within the district. The district also offered additional resources, teacher incentives, and financial assistance as a way to leverage the student make-up of the school district and the individual schools at all levels.",
  "description_provenance": [
    "Author Email: tcline@lenoir.k12.nc.us",
    "Advisor Email: jhairston@BCS.edu",
    "Advisor Email: fortuneJ@vt.edu",
    "Advisor Email: dsalmon@vt.edu",
    "Advisor Email: mdavid@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:48Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 551507 bytes, checksum: b148285d74742ed434c64039fc396e5f (MD5)   Previous issue date: 2006-07-18"
  ],
  "handle": "29106",
  "identifier_other": "etd-09262006-063544",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09262006-063544/",
  "identifier_uri": "http://hdl.handle.net/10919/29106",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ethnicity",
    "poverty",
    "socio-economic status",
    "Fourteenth Amendment",
    "Jim Crow Law",
    "segregation",
    "school choice plan",
    "free and reduced lunch"
  ],
  "title": "An Evaluation of the School Choice Plan in Charlotte-Mecklenburg Schools and its Perceived Effects on Academic Achievement for all Students",
  "type": "Dissertation"
}