{
  "contributor_author": "Christenberry, Thomas Catron",
  "contributor_committeechair": "Boucouvalas, Marcie",
  "contributor_committeemember": [
    "Combs, Letitia A.",
    "Jarvis, John P.",
    "Parson, Stephen R."
  ],
  "contributor_department": "Adult Learning and Human Resource Development",
  "date_accessioned": "2014-03-14T20:16:47Z",
  "date_adate": "2004-10-08",
  "date_available": "2014-03-14T20:16:47Z",
  "date_issued": "2004-09-15",
  "date_rdate": "2004-10-08",
  "date_sdate": "2004-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Thomas Catron Christenberry Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>Using the Federal Bureau of Investigation's (FBI) 212 th session of the National Academy, a residential adult learning environment, as a case study and the 1996 research on participant's perception of residential adult learning environments by Dr. Jean Anderson Fleming, this study examined the relationship among the characteristics (overarching themes: detachment and continuity and descriptive themes: building relationships in residence, learning in residence, and individual change in residence) and how this relationship impacts the participant's attitude of satisfaction with the program. </p> <p>A 33-item Likert scale, developed by the researcher, was used to collect the data from 244 police officers and the Kropp-Verner Attitude Scale was used for measuring the overall participant attitude of satisfaction with the residential learning environment. Demographic data were also collected from the participants to provide an overall profile of the respondents and each police officer had the opportunity to respond to an open-ended question at the end of the survey. </p> <p>Six hypotheses formed the basis of the study and were investigated through bivariate and multivariate analysis. Univariate analysis was used to describe and summarize the collected demographic data, as well as the frequency responses to each statement by the participants, while multivariate analysis was used to determine the best model for the prediction of satisfaction. </p> <p>Positive relationships existed between each of the five independent variables (detachment, continuity, building relationships in residence, learning in residence, and individual change in residence) and the dependent variable, satisfaction. The overarching themes of detachment and continuity were combined to form a new variable, DECONTI. Individually, (bivariate regression) DECONTI was the most significant predictor of satisfaction, while building relationships in residence exhibited no significance. Multivariate analysis (standard and stepwise regression) suggested that the model of DECONTI, learning in residence, and individual change was the best predictor of satisfaction. </p> <p>The analysis of the characteristics of residential adult learning environments and their impact on participant satisfaction was quantitatively supported in this study. The results of this study supported the assertions of Fleming, the literature, and the research questions, while offering new observations and insights into the effectiveness of residential adult learning environments. </p> <br> </body> </html>",
  "description_provenance": [
    "Author Email: tchberry@earthlink.net, tchristenbe@uindy.edu",
    "Advisor Email: lcombs@letitiacombs.com, lcombs@vt.edu",
    "Advisor Email: marcie@vt.edu, marcie9@attglobal.net",
    "Advisor Email: jjarvis@fbiacademy.edu",
    "Advisor Email: parson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:47Z (GMT). No. of bitstreams: 1 tometd.pdf: 1240461 bytes, checksum: 0dd58528698fe3f4b13326b0eea43766 (MD5)   Previous issue date: 2004-09-15"
  ],
  "handle": "29100",
  "identifier_other": "etd-09262004-113537",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09262004-113537/",
  "identifier_uri": "http://hdl.handle.net/10919/29100",
  "publisher": "Virginia Tech",
  "relation_haspart": "tometd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Residential Adult Learning",
    "Adult Education"
  ],
  "title": "CHARACTERISTICS OF RESIDENTIAL ADULT LEARNING IN THE FBI NATIONAL ACADEMY LEARNING ENVIRONMENT AND THE IMPACT ON PARTICIPANT'S ATTITUDE OF SATISFACTION",
  "type": "Dissertation"
}