{
  "contributor_author": "Wang, Xiaohai",
  "contributor_committeechair": "Mauldon, Matthew",
  "contributor_committeemember": [
    "Dove, Joseph E.",
    "Westman, Erik Christian",
    "Gutierrez, Marte S.",
    "Dunne, William M."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:16:48Z",
  "date_adate": "2005-10-11",
  "date_available": "2014-03-14T20:16:48Z",
  "date_issued": "2005-09-16",
  "date_rdate": "2005-10-11",
  "date_sdate": "2005-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Fracture systems or networks always control the stability, deformability, fluid and gas storage capacity and permeability, and other mechanical and hydraulic behavior of rock masses.  The characterization of fracture systems is of great significance for understanding and analyzing the impact of fractures to rock mass behavior.  Fracture trace data have long been used by engineers and geologists to character fracture system.  For subsurface fractures, however, boreholes, wells, tunnels and other cylindrical samplings of fractures often provide high quality fracture trace data and have not been sufficiently utilized.  The research work presented herein is intended to interpret fracture traces on borehole walls and other cylindrical surfaces by using stereology.  The relationships between the three-dimension fracture intensity measure, P32, and the lower dimension fracture intensity measures are studied.  The analytical results show that the conversion factor between the three-dimension fracture intensity measure and the two-dimension intensity measure on borehole surface is not dependent on fracture size, shape or circular cylinder radius, but is related to the orientation of the cylinder and the orientation distribution of fractures weight by area.  The conversion factor between the two intensity measures is determined to be in the range of [1.0, &#960;/2].  The conversion factors are also discussed when sampling in constant sized or unbounded fractures with orientation of Fisher distribution.  At last, the author proposed estimators for mean fracture size (length and width) with borehole/shaft samplings in sedimentary rocks based on a probabilistic model.  The estimators and the intensity conversion factors are tested and have got satisfactory results by Monte Carlo simulations.",
  "description_provenance": [
    "Author Email: xhwang@vt.edu",
    "Advisor Email: jodove@vt.edu",
    "Advisor Email: mauldon@vt.edu",
    "Advisor Email: ewestman@vt.edu",
    "Advisor Email: magutier@vt.edu",
    "Advisor Email: wdunne@utk.edu",
    "Made available in DSpace on 2014-03-14T20:16:48Z (GMT). No. of bitstreams: 1 Dissertation_Xiaohai_Wang.pdf: 1321259 bytes, checksum: 42c95fb4ab36d132b0de799446d12647 (MD5)   Previous issue date: 2005-09-16"
  ],
  "handle": "29105",
  "identifier_other": "etd-09262005-164731",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09262005-164731/",
  "identifier_uri": "http://hdl.handle.net/10919/29105",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Xiaohai_Wang.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fractures",
    "cylindrical sampling",
    "borehole",
    "stereology",
    "Monte Carlo method",
    "intensity measures",
    "conversion factors",
    "mean fracture length and width"
  ],
  "title": "Stereological Interpretation of Rock Fracture Traces on Borehole Walls and Other Cylindrical Surfaces",
  "type": "Dissertation"
}