{
  "contributor_author": "Bond, Jason Edward",
  "contributor_committeechair": "Opell, Brent D.",
  "contributor_committeemember": [
    "West, David A.",
    "Hilu, Khidir W.",
    "Turner, Bruce J.",
    "Coyle, Frederick A."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:16:50Z",
  "date_adate": "1999-09-28",
  "date_available": "2014-03-14T20:16:50Z",
  "date_issued": "1999-09-22",
  "date_rdate": "2000-09-28",
  "date_sdate": "1999-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Chapter One  Raven's 1985 phylogenetic analysis of the Mygalomorphae placed a number of previously unrelated genera into the rastelloid family Cyrtaucheniidae.  Although Goloboff's 1993 reanalysis of mygalomorph relationships retained the familial composition of the Rastelloidina it di not support cyrtaucheniid monophyly.  This study resolves the issue of cyrtaucheniid monophyly within the context of the Rastelloidina.  Using 71 morphological characters scored for 29 mygalomorph taxa we find that the Cyrtaucheniidae is polyphyletic and propose the following families in its place: Cyrtaucheniidae, Kiamidae (new family), Aporoptychidae (new rank), Ancylotrypidae (new family) and Euctenizidae (new rank).  We also propose two new euctenizid genera, Apachella and Sinepedica, revise the taxonomy of the euctenizids of the Southwestern United States, and present a key for these six genera.  In addition to the morphologically based phylogeny we test and refine the euctenizid intergeneric phylogeny using molecular data (mitochondrial 16S rRNA and COI genes and 28S rRNA nuclear genes).  The results of the combined morphological and molecular analysis are used to construct a composite rastelloid phylogeny that is used to investigate biogeographical relationships, burrow entrance evolution, and homoplasy.     Chapter Two  This systematic study of the predominately Californian trapdoor spider genus Aptostichus Simon, 1890 describes 28 species, 25 of which are newly described: A. atomus, A. improbulus, A. insulanus, A. icenoglei, A. ebriosus, A. muiri, A. cahuillus, A. luiseni, A. serranos, A. calientus, A. chemehuevi, A. shoshonei, A. pauitei, A. tipai, A. cochesensis, A. indegina, A. gertschi, A. kristenae, A. fornax, A. spinaserratus, A. brevifolius, A. brevispinus, A. agracilapandus, A. tenuis, and A. gracilapandus.  Aptostichus stanfordianus Smith, 1908 is considered to be a junior synonym of A. atomarius Simon 1890.  Using 72 quantitative and qualitative morphological characters we propose a preliminary phylogeny for this group.  Based on the results of this phylogenetic analysis, we recognize the Atomarius, Simus, Hesperus and Pandus species groups.  Additionally, our phylogenetic analysis indicates that adaptations favoring the invasion of the very arid desert habitats of southern California have evolved multiple times in the Aptostichus clade.  The existence of both desert and non - desert species in three of the four species groups makes this genus an ideal candidate for the study of the evolutionary ecology of desert arthropods.  Chapter Three  Aptostichus simus is a trapdoor spider that is endemic to the coastal dunes of southern California and is recognized as a single species on morphological grounds.  Mitochondrial DNA 16S rRNA sequences demonstrate that populations from San Diego County, Los Angeles County, Santa Rosa Island, and Monterey County are extremely divergent (6 - 12%). These results are comparable to, or higher than recent reports of species - level differences in other invertebrate taxa.  A molecular clock hypothesis shows that these four populations have been separated for 2 - 6 million years.  A statistical cluster analysis of morphological features demonstrates that this genetic divergence is not reflected in anatomical features that might signify ecological differentiation among these lineages.  The species status of these divergent populations of A. simus depends upon the species concept utilized.  The time - limited genealogical perspective that is employed separates A. simus into two genetically distinct species.  This study suggests that a species concept based on morphological distinctiveness in spider groups with limited dispersal capabilities probably underestimate taxonomic diversity.",
  "description_provenance": [
    "Author Email: jabond@vt.edu",
    "Advisor Email: hilukw@vt.edu",
    "Advisor Email: bopell@vt.edu",
    "Advisor Email: fishgen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:50Z (GMT). No. of bitstreams: 4 etd.pdf: 535401 bytes, checksum: 38f34f2b31b456833e39e2d599ba4d57 (MD5) ch1.pdf: 33745755 bytes, checksum: da59295b90b091021799e58723bcf5ea (MD5) ch2.pdf: 15430149 bytes, checksum: f64b438074e1435fee2f591e1a30cb86 (MD5) ch3.pdf: 312304 bytes, checksum: 848228012627a52d00402b48b852fa6c (MD5)   Previous issue date: 1999-09-22"
  ],
  "handle": "29114",
  "identifier_other": "etd-092699-200205",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-092699-200205/",
  "identifier_uri": "http://hdl.handle.net/10919/29114",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etd.pdf",
    "ch1.pdf",
    "ch2.pdf",
    "ch3.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "character evolution",
    "homoplasy",
    "phylogenetic classification",
    "molecular evolution",
    "desert adaptation",
    "speciation",
    "quantitative characters",
    "molecular ecology",
    "cladistics",
    "spider taxonomy",
    "phylogeography",
    "biogeography",
    "combined analysis"
  ],
  "title": "SYSTEMATICS AND EVOLUTION OF THE CALIFORNIAN TRAPDOOR SPIDER GENUS APTOSTICHUS SIMON (ARANEAE: MYGALOMORPHAE: EUCTENIZIDAE)",
  "type": "Dissertation"
}