{
  "contributor_author": "Ozbek, Mehmet Egemen",
  "contributor_committeechair": "de la Garza, Jesus M.",
  "contributor_committeemember": [
    "Van Aken, Eileen M.",
    "Triantis, Konstantinos P.",
    "Songer, Anthony D.",
    "Vorster, Michael C."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:16:51Z",
  "date_adate": "2007-10-12",
  "date_available": "2014-03-14T20:16:51Z",
  "date_issued": "2007-09-19",
  "date_rdate": "2007-10-12",
  "date_sdate": "2007-09-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "For the last two decades, the road maintenance concept has been gaining tremendous attention. This has brought about new institutional changes, predominant of which is the challenge for maintenance managers to achieve maximum performance from the existing road system. Such challenge makes it imperative to implement comprehensive systems that measure road maintenance performance. However, the road maintenance performance measurement systems developed and implemented by researchers and state departments of transportation (DOTs) mainly focus on the effectiveness measures, e.g., the level-of-service. Such measurement systems do not sufficiently elaborate on the efficiency concept, e.g., the amount of resources utilized to achieve such level-of-service. Not knowing how 창  efficient창   state DOTs are in being 창  effective창   can lead to excessive and unrealistic maintenance budget expectations. This issue indicates the need for a performance measurement approach that can take the efficiency concept into account.    Another important concept that is not investigated in the current road maintenance performance measurement systems is the effect of the environmental factors (e.g., climate, location, and etc.) and operational factors (e.g., traffic, load, design-construction adequacy, and etc.) on the performance of the road maintenance process. This issue, again, indicates the need for a performance measurement approach that can take such external and uncontrollable factors into account.   The purpose of this research is to develop and implement a comprehensive framework that can measure the relative efficiency of different road maintenance strategies given the (i) multiple inputs and outputs that characterize the road maintenance process and (ii) uncontrollable factors (e.g., climate, traffic, etc.) that affect the performance of such process. It is challenging to measure the overall efficiency of a process when such process is a multiple input-multiple output process and when such process is affected by multiple factors. To address this challenge, an innovative approach to efficiency measurement, Data Envelopment Analysis, is used in this research.    It is believed that this research, by taking the efficiency concept into account, will significantly improve the ways that are currently used to model and measure the performance of road maintenance. The findings of this research will contribute new knowledge to the asset management field in the road maintenance domain by providing a framework that is able to differentiate effective and efficient maintenance strategies from effective and inefficient ones.",
  "description_provenance": [
    "Author Email: meozbek@vt.edu",
    "Advisor Email: evanaken@vt.edu",
    "Advisor Email: triantis@vt.edu",
    "Advisor Email: ansonger@vt.edu",
    "Advisor Email: mikev@vt.edu",
    "Advisor Email: chema@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:51Z (GMT). No. of bitstreams: 1 MehmetEOzbekPhDDissertation.pdf: 2717944 bytes, checksum: b95e74003117d36f37ca9e5bf04bbdcb (MD5)   Previous issue date: 2007-09-19"
  ],
  "handle": "29117",
  "identifier_other": "etd-09272007-023934",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09272007-023934/",
  "identifier_uri": "http://hdl.handle.net/10919/29117",
  "publisher": "Virginia Tech",
  "relation_haspart": "MehmetEOzbekPhDDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Data Envelopment Analysis",
    "Performance Measurement",
    "Performance-Based Contracts",
    "Road Maintenance",
    "Efficiency Measurement",
    "Asset Management"
  ],
  "title": "Development of a Comprehensive Framework for the Efficiency Measurement of Road Maintenance Strategies using Data Envelopment Analysis",
  "type": "Dissertation"
}