{
  "contributor_author": "Sokol, Eric Robert",
  "contributor_committeechair": "Benfield, Ernest Fredrick",
  "contributor_committeemember": [
    "Lisa K. Belden",
    "H. Maurice Valett",
    "Jones, Robert H.",
    "J. Reese Voshell, Jr."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:16:49Z",
  "date_adate": "2009-10-13",
  "date_available": "2014-03-14T20:16:49Z",
  "date_issued": "2009-09-04",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PHD",
  "description_abstract": "Competing paradigms of community assembly emphasize different mechanisms for predicting patterns in biogeography.  Niche assembly emphasizes the role of environmental gradients as filters that organize a metacommunity by locally selecting colonizers with similar functional traits, whereas dispersal assembly emphasizes the importance of source pool characteristics and dispersal limitation in organizing a metacommunity.  In this study, I developed a framework that uses spatially explicit patterns in taxonomic and functional measures of community composition as diagnostics for community assembly processes for benthic macroinvertebrates in headwater streams in the southern Appalachians.  Distance decay in taxonomic and functional similarity was used to determine the scales at which taxonomic turnover occurred within functional niches.  Trait-neutral models of community composition were used as null models to assess which functional traits were the best candidates to explain how community composition was influenced by environmental gradients: an assessment of niche-based community assembly.  Regional scale patterns suggested that niche-based community assembly was the dominant mechanism organizing community composition in headwater streams at local scales (<30km).  Therefore, I compared how well trait-neutral models identified functional traits as relevant to community sorting against how well observed trait distributions correlated with environmental variation at a local scale, in the Ray Branch catchment (<10km study extent).  Functional traits exhibiting non-random distributions within the Ray Branch watershed were most strongly correlated with environmental variation.  Lastly, I assessed how the influences of niche and dispersal assembly on benthic macroinvertebrate community composition were affected by disturbance (shelterwood logging).  Environmental variables defining the habitat template, and macroinvertebrate community composition, were measured before and after the disturbance; and path analysis was used to quantify the disturbance effect.  The relationship between environmental variation and functional composition increased following logging, indicating disturbance augmented the influence of environmental filters, and consequently, the importance of niche-based community assembly.  My dissertation provides the framework for a novel assessment of taxonomic and functional community composition data to infer the types of ecological dynamics that organize communities in the landscape.  Additionally, this work provides a theoretical basis for assessing how dominant ecological processes change, in predictable ways, in response to changes in the habitat template.",
  "description_provenance": [
    "Author Email: sokole@vt.edu",
    "Advisor Email: belden@vt.edu",
    "Advisor Email: benfield@vt.edu",
    "Advisor Email: mvalett@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: jvoshell@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:49Z (GMT). No. of bitstreams: 1 Sokol_ER_D_2009.pdf: 2628859 bytes, checksum: 80017f6e080a5b0e8ff706ec443a8ee3 (MD5)   Previous issue date: 2009-09-04"
  ],
  "handle": "29110",
  "identifier_other": "etd-09262009-191937",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09262009-191937/",
  "identifier_uri": "http://hdl.handle.net/10919/29110",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sokol_ER_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "community assembly",
    "niche",
    "streams",
    "neutral",
    "disturbance",
    "benthic macroinvertebrates"
  ],
  "title": "Community ecology of aquatic insects in forested headwater streams in the southern Appalachians",
  "type": "Dissertation"
}