{
  "contributor_author": "Taylor, Megan Sands",
  "contributor_committeechair": "Knowlton, Katharine F.",
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:16:51Z",
  "date_adate": "2007-10-09",
  "date_available": "2014-03-14T20:16:51Z",
  "date_issued": "2007-09-11",
  "date_rdate": "2007-10-09",
  "date_sdate": "2007-09-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>The objective of this dissertation was to assess the dynamics of calcium (Ca) and phosphorus (P) metabolism in dairy cattle.  Hypocalcemia, or a drop in blood Ca, is a common condition near parturition.  All cows experience some degree of hypocalcemia.  Maintenance of blood Ca within the acceptable range of 8 to 10 mg/dl is a balancing act between the demand for Ca for milk production and the cowâ  s homeostatic mechanisms to maintain blood Ca.  These homeostatic mechanisms include bone resorption that is driven by Ca demand however both Ca and P are released when bone is resorbed.  These times of bone resorption and bone mineral replenishment have not been accounted for in current mineral recommendations. </p><p> For the first study, it was postulated that dairy producers could administer 25-hydroxyvitamin D3 (25-OH) in the prepartum period to prevent hypocalcemia.  Twenty-seven multiparous Jersey cows were randomly assigned to receive an oral bolus containing corn starch (control, CON) or corn starch plus 15 mg of 25-hydroxyvitamin D3 (25-OH) or 15 mg of vitamin D3 (D3) at 6 d prior to expected parturition. Jugular blood samples were collected at -14, -13, -5, -4, -3, -2, -1 d prior to expected calving, on the day of calving, and 1, 3, 5, 7, 9, 11, 13, 28, 56, and 84 d with respect to calving. Samples were analyzed for 25-OH, Ca, P, magnesium, osteocalcin (OC), and parathyroid hormone (PTH). Blood Ca, P, and Mg decreased near the time of calving and then increased over time. Serum 25-hydroxyvitamin D3 was higher for cows dosed with 25-OH (119.0 pg/ml) compared with those dosed with D3 (77.5 pg/ml) or CON (69.3 pg/ml). Cows dosed with 25-OH tended to have lower serum PTH concentration, but treatments did not affect serum Ca, P, or Mg. Serum OC was higher in second lactation cows compared with cows entering their third or fourth lactation but OC was unaffected by treatment. Although results indicated a 60% increase in serum 25-OH due to a single oral dose of 25-OH prior to calving, the amount administered in this study apparently was not sufficient for initiation of any improvement in Ca homeostasis at parturition.  </p><p> Due to the intimate relationship of Ca and P in bone, it was postulated for the second study that dietary Ca would affect bone mobilization and Ca and P balance in the lactating dairy cow. Eighteen Holstein cows were blocked by parity and calving date and randomly assigned to one of three dietary treatments: high (1.03%, HI), medium (0.78%, MED), or low (0.52%, LOW) dietary Ca. Dietary P was 0.34% in all diets. Total collection of milk, urine, and feces was conducted 2 wk prior to calving and in wk 2, 5, 8, 11, and 20 of lactation. Blood samples were collected at -14 and -10 d prior to calving and 0, 1, 3, 5, 10, 14, 21, 28, 35, 56, 70, 84, 98, and 140 d after calving. Blood samples were analyzed for Ca, P, PTH, OC, and deoxypyridinoline (DPD). Rib bone biopsies were conducted within 10 d of calving and during wk 11 and 20 of lactation. Dietary Ca concentration affected Ca balance, with cows consuming the HI Ca diet in positive Ca balance for all weeks with the exception of wk 11. Interestingly, all cows across all treatments had a negative Ca balance at wk 11, possibly the result of timed estrous synchronization that occurred during wk 11. At wk 20, Ca balances were 61.2, 29.9, and 8.1 g/d for the HI, MED, and LOW diets, respectively. Phosphorus balances across all treatments and weeks were negative. Dietary Ca concentration did not affect P balance in the weeks examined for this study but there was a clear effect of parity on balance, markers of bone metabolism, and bone P. Regardless of dietary treatment, serum OC concentration peaked around d 35 of lactation. Simultaneously, DPD concentration began to decrease, which may indicate a switch from net bone resorption to net bone formation after day 35. This was not reflected in balance measures however, this information may help refine dietary mineral recommendations for lactating dairy cows and ultimately reduce P excretion into the environment.  </p><p> Ultimately from the first study it is clear that oral dosing with 25-OH at 6 d prior to expected calving is not justified.  However, we learned that parity has an effect on bone formation with younger animals resorbing and forming more bone and that net formation appears to occur after 30 days in milk.  Both of these points were corroborated in the second study.  Additionally, the second study demonstrated that dietary Ca content has no effect on P balance from 2 to 20 wk of lactation.  Finally, the rib bone does not appear to be a sensitive indicator of bone metabolism or at least not at the time points we measured.</p>",
  "description_provenance": [
    "Author Email: mtsands@vt.edu",
    "Advisor Email: knowlton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:51Z (GMT). No. of bitstreams: 1 Dissertation_Final_w_correctpgnum.pdf: 328935 bytes, checksum: 37e0b57b83890441d4a58ee174dfac48 (MD5)   Previous issue date: 2007-09-11"
  ],
  "handle": "29118",
  "identifier_other": "etd-09272007-145245",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09272007-145245/",
  "identifier_uri": "http://hdl.handle.net/10919/29118",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Final_w_correctpgnum.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "phosphorus",
    "bone",
    "calcium",
    "cow"
  ],
  "title": "Calcium and Phosphorus Metabolism in Jersey and Holstein Cows During Early Lactation",
  "type": "Dissertation"
}