{
  "contributor_author": "Baptist, Joyce Alexandria",
  "contributor_committeechair": "Allen, Katherine R.",
  "contributor_committeemember": [
    "Uttech, Melanie R.",
    "Roberto, Karen A.",
    "Prouty, Anne M.",
    "Piercy, Fred P."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:16:51Z",
  "date_adate": "2002-10-10",
  "date_available": "2014-03-14T20:16:51Z",
  "date_issued": "2002-09-10",
  "date_rdate": "2003-10-10",
  "date_sdate": "2002-09-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This case study elicits the process of coming out of a 6 member family-of-choice of an adult gay man in rural New Hampshire. 27.5 hours of face-to-face interviews were conducted with the family individually and collectively. Reflexivity, as a technique, was used extensively. Four themes were identified: Embracing gay identity, integrating as a family, building social networks, and social awakening. This study addresses the complexities of how multiple individuals negotiate rules and accommodate diverse viewpoints within a family system, provides insight into a family's journey of accepting their gay identity, utilizes personal narratives of family members, and reveals how the reflexive process contributes to a family's creation of new stories. Implications for clinical practice and future research are discussed.",
  "description_provenance": [
    "Author Email: jxanbap@hotmail.com",
    "Made available in DSpace on 2014-03-14T20:16:51Z (GMT). No. of bitstreams: 4 Appendices.pdf: 117128 bytes, checksum: d9fa2f34279271e756f848376b6448a9 (MD5) AppendixF.pdf: 2593971 bytes, checksum: 6a573106589a90c4ced37d6c3c860a8e (MD5) Title.pdf: 92891 bytes, checksum: 374f97c5a15409a98563df7e428e8289 (MD5) Dissertation.pdf: 349307 bytes, checksum: 8223f709b0d93f4464c3c7bef60fb336 (MD5)   Previous issue date: 2002-09-10"
  ],
  "handle": "29115",
  "identifier_other": "etd-09272002-184653",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09272002-184653/",
  "identifier_uri": "http://hdl.handle.net/10919/29115",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Appendices.pdf",
    "AppendixF.pdf",
    "Title.pdf",
    "Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Family process",
    "Gay families",
    "Coming out"
  ],
  "title": "Coming Out: One Family's Story",
  "type": "Dissertation"
}