{
  "contributor_author": "Drape, Tiffany",
  "contributor_committeechair": "Westfall-Rudd, Donna",
  "contributor_committeemember": [
    "Chang, Mido",
    "Doolittle, Peter",
    "Rudd, Rick"
  ],
  "contributor_department": "Agricultural and Extension Education",
  "date_accessioned": "2014-03-14T20:16:50Z",
  "date_adate": "2011-10-13",
  "date_available": "2014-03-14T20:16:50Z",
  "date_issued": "2011-09-12",
  "date_rdate": "2011-10-13",
  "date_sdate": "2011-09-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Students in any educational setting need to learn how to integrate and successfully use technology to be successful in a future career.  While no one educational system can teach every skill, faculty can help integrate technology and model skills that students will need later in life. Using Rogers창   Diffusion of Innovations as a model, the researcher examined technology integration and how it affected engagement, motivation, and learning in the classroom setting.  The purpose of this study was to investigate the phenomenon of technology integration in an agriculture associate창  s degree program and evaluate the program from the faculty and student perspective.  Ninety-six students enrolled in an agriculture associate창  s degree program served as the case study group. A qualitative approach guided the inquiry of the study and was represented through observations, participant interviews, and video collection using Noldus Observer.     Findings indicated that technology integration was being implemented in a purposeful way and the faculty work together to make decisions regarding what to integrate for the students창   use in their courses.  Technology integration decisions were supported by the faculty and program leader. Students viewed the technology as beneficial to their learning while enrolled in the program and as an asset when they graduated.  Students reported that they felt as though technology was helping them remain engaged and motivated in the program.   Students who participated in the recommend that the faculty use the course management system more efficiently to streamline content to students and the faculty use more features that the system offers such as chat and discussion boards. Students expressed a belief that these practices would help keep students more engaged during class time and help them locate resources more efficiently.  It is recommended that faculty work to offer a blended learning experience in the classroom, with group work or guided practice.  Finally, as an alternative to traditional assessment, it is recommended that faculty members in the program encourage students to work with technology outside of class to create videos or podcasts to illustrate what they are learning.",
  "description_provenance": [
    "Author Email: tdrape@vt.edu",
    "Advisor Email: mchang@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: rrudd@vt.edu",
    "Advisor Email: mooredm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:50Z (GMT). No. of bitstreams: 1  Drape_TA_D_2011.pdf: 1582492 bytes, checksum: fe1d4a9f3b285c24a6c016af606e12d3 (MD5)    Previous issue date: 2011-09-12"
  ],
  "handle": "29112",
  "identifier_other": "etd-09262011-163335",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09262011-163335/",
  "identifier_uri": "http://hdl.handle.net/10919/29112",
  "publisher": "Virginia Tech",
  "relation_haspart": "Drape_TA_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "education",
    "engagement",
    "motivation",
    "integration",
    "technology"
  ],
  "title": "Teaching with Technology in an Agriculture Associate's Degree Program",
  "type": "Dissertation"
}