{
  "contributor_author": "Ma, Liying",
  "contributor_committeechair": "Corl, Benjamin A.",
  "contributor_committeemember": [
    "Akers, Robert Michael",
    "Jiang, Honglin",
    "Wong, Eric A."
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:16:51Z",
  "date_adate": "2012-11-02",
  "date_available": "2014-03-14T20:16:51Z",
  "date_issued": "2012-09-13",
  "date_rdate": "2012-11-02",
  "date_sdate": "2012-09-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objective of these studies was to investigate the milk fat synthesis regulation by transcription factors. In the first study, bovine mammary epithelial (MAC-T) cells were treated with sterol regulatory element binding protein-1 (SREBP-1) specific siRNA. The mRNA and protein expression of SREBP-1 were decreased by more than 90% by siRNA. Fatty acid (FA) synthesis, uptake, and selected lipogenic enzyme expression were reduced in cells treated with SREBP-1 siRNA. Therefore, SREBP-1 plays an important role in integrated regulation of lipid synthesis in MAC-T cells through regulation of key enzymes. In the second study, MAC-T cells treated with hormones or FA were transfected with luciferase reporter constructs containing response elements for SREBP-1, peroxisome proliferator-activated receptor γ (PPARγ), or liver X receptor (LXR). The activation of PPARγ and SREBP-1 were stimulated by insulin and insulin combined with leptin, respectively. Trans-10, cis-12 conjugated linoleic acid (CLA) inhibited SREBP-1 activation, and this inhibition was not attenuated by insulin and leptin. Neither trans-10 nor cis-12 double bond inhibited SREBP-1 activation. Taken together, trans-10 and cis-12 double bonds need to be conjugated in CLA to reduce SREBP-1 activation and this inhibition cannot be overcome by insulin and leptin combination in MAC-T cells. In the third study, lactating dairy cows were intravenously infused with 0.625 g/h trans-10, cis-12 CLA for 14 h. We confirmed the appearance of trans-10, cis-12 CLA in the milk of CLA treated cows. Milk and component yield were not affected by the CLA treatment. The desaturation of stearic acid was reduced by CLA. The mRNA and protein expression of transcription factors or lipogenic enzymes were not affected by trans-10, cis-12 CLA. DNA-binding activities for PPARγ and LXR and the activation of SREBP-1 to its mature form were not changed by the treatment. The infusion time in this study was probably too short to induce any changes in transcription factors and lipogenic enzymes. We confirmed DNA-binding activities of PPARγ and LXR in bovine mammary gland. Overall, a prominent role for SREBP-1 in mammary epithelial cell lipid synthetic pathways was described and regulation of transcription factor activation by trans-10, cis-12 CLA was specific to SREBP-1.",
  "description_provenance": [
    "Author Email: maliying@vt.edu",
    "Advisor Email: bcorl@vt.edu",
    "Advisor Email: rma@vt.edu",
    "Advisor Email: hojiang@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:51Z (GMT). No. of bitstreams: 2 MA_L_D_2012.pdf: 1839785 bytes, checksum: 4e2ef1fec4a3dc40f44f9eec870240ce (MD5) MA_L_D_2012_Copyright.pdf: 392890 bytes, checksum: ab3ad70debd29506597a53bbaafe7e79 (MD5)   Previous issue date: 2012-09-13"
  ],
  "handle": "29120",
  "identifier_other": "etd-09272012-123131",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09272012-123131/",
  "identifier_uri": "http://hdl.handle.net/10919/29120",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "MA_L_D_2012.pdf",
    "MA_L_D_2012_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "milk fat depression",
    "SREBP-1",
    "hormone"
  ],
  "title": "Regulatory factors of milk fat synthesis in dairy cows",
  "type": "Dissertation"
}