{
  "contributor_author": "Powell, Jodi",
  "contributor_committeechair": "O'Keefe, Sean F.",
  "contributor_committeemember": [
    "Eigel, William N. III",
    "Duncan, Susan E.",
    "Williams, Robert C.",
    "Mallikarjunan, Parameswarakumar"
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:16:52Z",
  "date_adate": "2004-11-17",
  "date_available": "2014-03-14T20:16:52Z",
  "date_issued": "2004-08-27",
  "date_rdate": "2007-11-17",
  "date_sdate": "2004-09-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Preventing flavor fade requires an understanding of the relationship between carbonyl amine and lipid oxidation reactions.  The polyunsaturated fatty acid content of lipids in peanuts makes them more susceptible to lipid oxidation.  The major by-products of the oxidation reaction are nonanal, hexanal, octanal, and decanal.  These chemicals are associated with cardboardy, painty, and oxidized flavors associated with flavor fade.  The carbonyl-amine reaction yields a variety of pyrazines with positive flavor attributes.    </p><p>    Initial flavor notes were explored through sensory work, Gas Chromatography-Olfactometry, and chemical analysis.  The fresh roasted volatiles produced from roasted peanuts and the aldehydes resulting from oxidation were also evaluated using GC-FID to quantify and identify the pyrazines and hexanal over a 21 day storage period.  Electronic Nose was used to determine differences between storage periods.    </p><p> Gas chromatography-Olfactometry identified potent pyrazines contributing to fresh roasted peanutty aroma in fresh peanuts.  Using GC-FID a significant decrease (p<.05) in 2-ethylpyrazine and 2,3-diethylpyrazine concentration was found over a 21-day period.  No significant difference (p>0.05) was noted in the other pyrazines evaluated.  A significant increase (p<0.05) was noted in the hexanal concentration over a 21-day period.  The peroxide values and sensory analysis correlated directly with the GC-FID results with a significant increase (p<0.05) in peroxide value at Day 14 and Day 21, and a significant decrease (p<0.05) in fresh roasted peanuty flavor from days 0-21 and a significant increase (p<.05) in painty, cardboardy and bitter from days 7-21.  The electronic nose successfully separated Day 0 and Day 21 samples from Day 7 and 14, which were also separated, but with minimal overlap.  </p>",
  "description_provenance": [
    "Author Email: jopowel4@vt.edu",
    "Advisor Email: weigel@vt.edu",
    "Advisor Email: duncans@vt.edu",
    "Advisor Email: okeefes@vt.edu",
    "Advisor Email: rcwillia@vt.edu",
    "Advisor Email: kumar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:52Z (GMT). No. of bitstreams: 1 dissertationpdf.pdf: 1538647 bytes, checksum: 408009d68831ed2881db73087c56fa03 (MD5)   Previous issue date: 2004-08-27"
  ],
  "handle": "29127",
  "identifier_other": "etd-09282004-153221",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09282004-153221/",
  "identifier_uri": "http://hdl.handle.net/10919/29127",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertationpdf.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "solid phase microextraction",
    "gas chromatography-olfactometry",
    "roasted peanuts",
    "Pyrazines"
  ],
  "title": "Evaluation of Initial Flavor Fade in Fresh Roasted Peanuts using Gas Chromatography-Flame Ionization Detection, Gas Chromatography-Olfactometry, Sensory Analysis, and Chemosensory Techniques",
  "type": "Dissertation"
}