{
  "contributor_author": "McDaniel, Lori Heldreth",
  "contributor_committeechair": "Taylor, Larry T.",
  "contributor_committeemember": [
    "Long, Gary L.",
    "Bell, Harold M.",
    "Glanville, James O.",
    "McNair, Harold M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:16:52Z",
  "date_adate": "1999-09-30",
  "date_available": "2014-03-14T20:16:52Z",
  "date_issued": "1999-09-17",
  "date_rdate": "2000-09-30",
  "date_sdate": "1999-09-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Supercritical fluid extraction (SFE) is an alternative to traditional extractions with organic solvents.  SFE consists of removing the analyte(s) from the matrix, solubilizing them, moving the analyte(s) into the bulk fluid, and sweeping the fluid containing the analyte(s) out of the extraction vessel.  As the fluid leaves the extraction vessel, decompression of the fluid occurs, changing its volume and temperature which can lead to analyte loss.  This work focussed on the trapping process with the restrictor immersed in a liquid after SFE. Experiments compared the effects of trapping parameters on the collection efficiencies of fat-soluble vitamins of similar polarities and structures.  The most important variable was the selection of collection solvent and its physical properties, such as viscosity, surface tension and density were found to be important.  Additionally, adding a modifier to the collection solvent in an attempt to change its physical properties and influence collection efficiencies for a polarity test mix was studied. Addition of a modifier can improve collection efficiencies and allow higher collection temperature to be used, but the modifier did not increase trapping recoveries to the extent that collection pressurization did.  The occurrence of a methylation reaction of decanoic acid during the SFE and collection processes, using a methanol modified fluid or collection solvent was investigated. The majority of the reaction occurred during the collection process and the degree of methylation was found to be dependent on temperature, but not on static or dynamic extraction time.  When no additional acidic catalyst other than carbon dioxide in the presence of water was present, conversion was limited to about 2%, but was quantitative with an added acidic catalyst.  The last portion of this work involved the application of the SFE process to the extraction and analysis of extractable material in eight hardwood and softwood pulp samples.  Grinding the samples increased extractable fatty acid methyl esters (FAMEs) by ten-fold, and in-situ derivatizations resulted in higher FAME recoveries than derivatization after SFE.  Liquid trapping enhanced recoveries of lower FAMEs when compared to tandem (solid/liquid) trapping.  In-situ acetylations sometimes yielded acetylated glucoses.  Large differences in FAMEs concentrations were seen for hardwood samples, but lesser differences were seen for the softwood pulp samples.",
  "description_provenance": [
    "Author Email: lorimcd@vt.edu",
    "Advisor Email: long@vt.edu",
    "Advisor Email: hbell@chemserver.chem.vt.edu",
    "Advisor Email: ltaylor@chemserver.chem.vt.edu",
    "Advisor Email: jglanville@chemserver.chem.vt.edu",
    "Advisor Email: hmcnair@chemserver.chem.vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:52Z (GMT). No. of bitstreams: 3 etd2.pdf: 31840 bytes, checksum: 3b001a94c8341a11c3733b4f730f5de0 (MD5) etd1.pdf: 439417 bytes, checksum: 9a2ff73aa870b87f43e3dbe778d35089 (MD5) ETD3A.PDF: 144871 bytes, checksum: c370b2aa2e55b1bef62ed8f1a0e617e8 (MD5)   Previous issue date: 1999-09-17"
  ],
  "handle": "29121",
  "identifier_other": "etd-092799-113523",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-092799-113523/",
  "identifier_uri": "http://hdl.handle.net/10919/29121",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "etd2.pdf",
    "etd1.pdf",
    "ETD3A.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "collection solvent modification",
    "supercritical fluid extraction",
    "liquid trapping",
    "fat-soluble vitamins",
    "in-situ methylation",
    "wood pulp"
  ],
  "title": "Investigation of Liquid Trapping Following Supercritical Fluid Extraction",
  "type": "Dissertation"
}