{
  "contributor_author": "Medun, Beverly Dawn",
  "contributor_committeecochair": [
    "Sughrue, Jennifer A.",
    "Creamer, Donald G."
  ],
  "contributor_committeemember": [
    "Dave, Dinesh S.",
    "Janosik, Steven M.",
    "Hirt, Joan B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:16:52Z",
  "date_adate": "2001-10-03",
  "date_available": "2014-03-14T20:16:52Z",
  "date_issued": "2001-09-20",
  "date_rdate": "2002-10-03",
  "date_sdate": "2001-09-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "THE FACTORS THAT MAY INFLUENCE A FACULTY MEMBER'S DECISION TO ADOPT ELECTRONIC TECHNOLOGIES IN INSTRUCTION   Abstract  The adoption and diffusion of electronic technologies into the higher education are complex processes. This study was formulated to see which factors might influence faculty members' motivation and inclination to adopt new electronic technologies in their delivery of instruction. The following research questions were addressed in this study: a) What social variables are involved in the decision to adopt electronic technologies used in the delivery of instruction? b) What organizational variables are involved in the decision to adopt electronic technologies used in the delivery of instruction? c) What personal motivational variables are involved in the decision to adopt electronic technologies used in the delivery of instruction? d) What is the relationship between the social factor with size of the university, size of the department, rank, tenure status, level of experience, and adopter behavior categories? e) What is the relationship between the organizational factor by size of the university, size of the department, rank, tenure status, level of experience, and adopter behavior categories? f) What is the relationship between the personal motivational factor by size of the university, size of the department, rank, tenure status, level of experience, and adopter behavior categories? g) What is the relationship between the social factor and the types and frequency of technology used? h) What is the relationship between the organizational factor and the types and frequency of technology used? i) What is the relationship between the personal motivational factor and the types and frequency of technology used? j) What is the relationship between self-selected adopter categories and the types and frequency of technology used? k) What comparison can be made between a priori adopter categories and self-selected adopter categories? The sample consisted of accounting faculty who taught an introductory accounting class at 12 of the 16 public 4-year institutions of higher education that are in North Carolina, who have accredited Schools or Colleges of Business. The results of this study reinforce the need for administrators and faculty to be made aware of the many social, organizational, and personal motivational factors that can assist and affect a faculty member's decision to use and adopt electronic technologies. Social variables that include friends, mentors, peer support, and students were found to significant in their influence related to a faculty members' decision to adopt electronic technologies in the classroom. Organizational variables of physical resource support and mandate from the university were reported by faculty to also be statistically significant in their influence. All three personal motivational variables emerged as important in the decision to adopt instructional technologies. With the recognition of these social, organizational, and personal motivational factors environments could be developed that enhance and establish the appropriate settings and goals for incorporating instructional technologies into higher educational settings.",
  "description_provenance": [
    "Author Email: BDMEDLIN@YAHOO.COM",
    "Advisor Email: jsugh@vt.edu",
    "Advisor Email: daveds@appstate.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:52Z (GMT). No. of bitstreams: 1 NewCOMPLETE2.pdf: 210307 bytes, checksum: 246900adf8d593198c4e0392bccea124 (MD5)   Previous issue date: 2001-09-20"
  ],
  "handle": "29125",
  "identifier_other": "etd-09282001-155044",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09282001-155044/",
  "identifier_uri": "http://hdl.handle.net/10919/29125",
  "publisher": "Virginia Tech",
  "relation_haspart": "NewCOMPLETE2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "innovation",
    "electronic technologies"
  ],
  "title": "The factors that may influence a faculty members' decision to adopt electronic technologies in instruction",
  "type": "Dissertation"
}