{
  "contributor_author": "Milne, Jason Syme",
  "contributor_committeechair": "Kiecolt, K. Jill",
  "contributor_committeemember": [
    "Snyder, Harvey",
    "Fuller, Theodore D.",
    "Calasanti, Toni M."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:16:53Z",
  "date_adate": "2006-10-30",
  "date_available": "2014-03-14T20:16:53Z",
  "date_issued": "2006-09-15",
  "date_rdate": "2009-10-30",
  "date_sdate": "2006-09-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examines how identity processes affect role exit.  I test a model of role exit that situates the identity processes of cognitive processes (reflected appraisals and social comparisons), rewards and costs related to the role, commitment to the role, and identity centrality as mediating factors between role-set and social characteristic background factors, and role exit.   Using a sample of 940 current and former soccer referees in Virginia and the District of Columbia, the results show that several role-set background factors and social characteristics affect role exit.  However, identity processes explain some of the effect that the background factors have on role exit.  The results have implications for identity theory and role exit theory and for helping referee organizations understand why referees quit.",
  "description_provenance": [
    "Author Email: milnejs@longwood.edu",
    "Advisor Email: ted.fuller@vt.edu",
    "Advisor Email: kiecolt@vt.edu",
    "Advisor Email: toni@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:53Z (GMT). No. of bitstreams: 1 RefereeRoleExitDissertation1.pdf: 450864 bytes, checksum: a3e012adc4b5bd94885eb5cf3f99c649 (MD5)   Previous issue date: 2006-09-15"
  ],
  "handle": "29134",
  "identifier_other": "etd-09292006-143403",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09292006-143403/",
  "identifier_uri": "http://hdl.handle.net/10919/29134",
  "publisher": "Virginia Tech",
  "relation_haspart": "RefereeRoleExitDissertation1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "identities",
    "role exit",
    "referees",
    "soccer"
  ],
  "title": "An Identity Theory of Role Exit among Soccer Referees",
  "type": "Dissertation"
}