{
  "contributor_author": "Tehan III, William J.",
  "contributor_committeechair": "Rohr, John A.",
  "contributor_committeemember": [
    "Wamsley, Gary L.",
    "Kronenberg, Philip S.",
    "Goodsell, Charles T.",
    "Wolf, James F."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:16:53Z",
  "date_adate": "2003-03-03",
  "date_available": "2014-03-14T20:16:53Z",
  "date_issued": "2002-08-30",
  "date_rdate": "2004-03-03",
  "date_sdate": "2002-09-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "For more than a half century Douglas MacArthur was a servant of the United States. He is best remembered as a general and a soldier, especially for his leadership during World War II and the Korean War. MacArthur was also the Superintendent of West Point, Chief of Staff of the U.S. Army, Generalissimo ( Commander) of the Armed Forces and Military Advisor (Minister of Defense) to the President of the Commonwealth of the Philippines, and the Supreme Commander Allied Powers and the Military Governor of occupied Japan. In these positions he functioned not as a soldier, but as a senior public administrator. The dissertation will begin by establishing the military as a valid and unique field of Public Administration. Contributions of military adminstration to the discipline of Public Administration will then be examined. The dissertation will examine MacArthur's professional and academic training for his previously listed administrative posts. A determination and analysis of MacArthur's theoretical and applied approaches to Public Administration and General Management Theories will be made. The analysis of MacArthur's performance in his administrative positions will be made against a backdrop of contemporary Public Administration Theory.",
  "description_provenance": [
    "Author Email: wjtehaniii@aol.com",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: jrohr@vt.edu",
    "Advisor Email: pkronenberg@vt.edu",
    "Advisor Email: goodsell@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:53Z (GMT). No. of bitstreams: 1 Tehan.pdf: 7633483 bytes, checksum: 22227ce4454dbb5ee5a95abf901b1cb3 (MD5)   Previous issue date: 2002-08-30"
  ],
  "handle": "29130",
  "identifier_other": "etd-09292002-133302",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09292002-133302/",
  "identifier_uri": "http://hdl.handle.net/10919/29130",
  "publisher": "Virginia Tech",
  "relation_haspart": "Tehan.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Public Administration",
    "Administrative Biography",
    "Douglas MacArthur"
  ],
  "title": "Douglas MacArthur- An Administrative Biography",
  "type": "Dissertation"
}