{
  "contributor_author": "O'Brien, Emmett P",
  "contributor_committeechair": "Ward, Thomas C.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Dillard, David A.",
    "Marand, Eva",
    "Saraf, Ravi F."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:16:55Z",
  "date_adate": "2003-10-03",
  "date_available": "2014-03-14T20:16:55Z",
  "date_issued": "2003-08-28",
  "date_rdate": "2003-10-03",
  "date_sdate": "2003-09-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Environmental stresses arising from temperature and moisture changes, and/or other aggressive fluid ingressions can degrade the mechanical properties of the adhesive, as well as the integrity of an adhesive interface with a substrate. Therefore such disruptions can significantly reduce the lifetime and durability of an adhesive joint.1-4 In this research, the durability of certain epoxy adhesive joints and coatings were characterized using a fracture mechanics approach and also by constant frequency impedance spectroscopy. \tThe shaft-loaded blister test (SLBT) was utilized to measure the strain energy release rate (G) or adhesive fracture energy of a pressure sensitive adhesive tape. In this study, support for the value of the SLBT fracture mechanics approach was obtained. The SLBT was then used to investigate the effects of relative humidity on a model epoxy bonded to silicon oxide. Lastly, the effects of water and temperature on the adhesion of a commercial filled epoxy bonded to silicon oxide was characterized and interpreted. \tA novel impedance sensor for investigating adhesion was developed in a collaborative effort between Virginia Tech and Hewlett-Packard. Utilizing the technique of constant frequency impedance spectroscopy, the distribution and transport of fluids at the interface of adhesive joints was measured. A broad spectrum of adhesives was tested. In addition, the effects of hygroscopic cycling on the durability of adhesive coatings were measured for the commercial filled epoxy using the device. Lastly, recommended modifications of the experimental set-up with the new sensor are proposed to improve the technique.",
  "description_provenance": [
    "Author Email: emobrien@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: dillard@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:55Z (GMT). No. of bitstreams: 1 EmmettOBrienThesisFinal.pdf: 2365991 bytes, checksum: 38a6a10a90515c374da15c7b83597c6e (MD5)   Previous issue date: 2003-08-28"
  ],
  "handle": "29139",
  "identifier_other": "etd-09302003-110117",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09302003-110117/",
  "identifier_uri": "http://hdl.handle.net/10919/29139",
  "publisher": "Virginia Tech",
  "relation_haspart": "EmmettOBrienThesisFinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ink",
    "dielectric spectroscopy",
    "diffusion",
    "electrochemical impedance spectroscopy (EIS)",
    "epoxy",
    "interface",
    "water",
    "sub-critical crack growth",
    "durability",
    "environmental degradation",
    "adhesion",
    "shaft-loaded blister test"
  ],
  "title": "Durability of Adhesive Joints Subjected to Environemntal Stress",
  "type": "Dissertation"
}