{
  "contributor_author": "Zhao, Junmei",
  "contributor_committeechair": "Harper, Allen F.",
  "contributor_committeemember": [
    "Wong, Eric A.",
    "Estienne, Mark J.",
    "Denbow, Donald Michael",
    "Webb, Kenneth E. Jr."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:16:53Z",
  "date_adate": "2005-10-11",
  "date_available": "2014-03-14T20:16:53Z",
  "date_issued": "2005-09-15",
  "date_rdate": "2005-10-11",
  "date_sdate": "2005-09-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The objectives of these studies were to investigate the effects of two special proteins, spray-dried plasma protein (SDPP), a high quality protein source, and Peptiva®, a mixture of peptides manufactured from marine products, on growth performance, nitrogen balance and enzyme and nutrient transporter mRNA expression in the brushborder membrane in weanling pigs.  The results indicated that 6 % SDPP increased ADG and ADFI in the first 10 d after weaning (P < 0.05) without carry-over benefits in subsequent phases. There were potential additive effects of SDPP and Cu on growth promotion.  Trends for interaction of diet and pen sanitation were observed for G:F with more pronounced response to SDPP (P = 0.07) and Cu (P = 0.11) supplementation in the sub-sanitary pens.  In the duodenum, reduced crypt depth with Cu supplementation (P < 0.01) and a trend for greater villous length with SDPP supplementation (P = 0.09) were observed.  Pigs reared in the sub-sanitary pens had lower ADG (P < 0.05) as well as shorter villous length and less crypt depth (P < 0.05) than those from sanitary pens.  \tTo investigate the potential impact of dietary proteins on gene expression in the intestine, 54 weanling pigs were fed either 6 % SDPP, 0.5 % Peptiva®, or soy control diets, and were killed 3 or 10 d after weaning.  Northern blot results revealed significant diet by intestinal segment interactions (P < 0.05) for aminopeptidase A and aminopeptidase N. Aminopeptidase A was evenly distributed along the small intestine in the Peptiva® group, but decreased dramatically in the ileum in other groups.  Aminopeptidase N increased from the proximal to the distal intestine in the soy protein and SDPP groups, whereas in the Peptiva® group, relative abundance was highest in the jejunum and lowest in the duodenum.  Most of the enzyme and nutrient transporter mRNA abundance was observed in the distal segements of the small intestine and changed as the animals matured.  Due to the low abundance of cytokine mRNA expression in the intestine, mRNA levels of cytokine were quantified by Real-Time PCR.  The results indicated that the pigs fed the SDPP diet tended to have lower pro-inflammatory cytokine IL-1-β and TNF-α compared to other treatments.  Tumor necrosis factor--α and IL-10 mRNA abundance increased from the proximal to the distal intestine, and was higher (P < 0.05) in the ileum than in the duodenum and jejunum.  The mRNA abundance of IL-1-β, IL-10, and TNF-α also increased as the animals matured (P < 0.01).  In summary, SDPP increased growth performance of weanling pigs, which were associated with changes in intestinal morphology and function.  Peptiva® influenced aminopeptidases distribution along the small intestine.  The mRNA abundance for digestive enzymes, nutrient transporters, and cytokines were differentially regulated along the small intestine as pigs matured.",
  "description_provenance": [
    "Author Email: juzhao1@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: mestienn@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Advisor Email: alharper@vt.edu",
    "Advisor Email: webbk@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:53Z (GMT). No. of bitstreams: 1 finaldissertationjunmei.pdf: 879139 bytes, checksum: c7d42b00ea5f23870e6c05dc6ff00c6e (MD5)   Previous issue date: 2005-09-15"
  ],
  "handle": "29132",
  "identifier_other": "etd-09292005-161242",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09292005-161242/",
  "identifier_uri": "http://hdl.handle.net/10919/29132",
  "publisher": "Virginia Tech",
  "relation_haspart": "finaldissertationjunmei.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Copper",
    "Peptide",
    "Spray-dried plasma protein",
    "Transporter",
    "Cytokine",
    "Enzyme"
  ],
  "title": "Impact of Dietary Proteins on Growth Performance, Intestinal Morphology, and mRNA Abundance in Weanling Pigs",
  "type": "Dissertation"
}