{
  "contributor_author": "Dellinger, Theresa Ann",
  "contributor_committeechair": "Youngman, Roger R.",
  "contributor_committeemember": [
    "Paulson, Sally L.",
    "Pfeiffer, Douglas G.",
    "Luckhart, Shirley",
    "Lewis, Edwin E."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:16:55Z",
  "date_adate": "2003-10-16",
  "date_available": "2014-03-14T20:16:55Z",
  "date_issued": "2003-09-19",
  "date_rdate": "2004-10-16",
  "date_sdate": "2003-09-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Both alfalfa weevil, <i>Hypera postica</i> (Gyllenhal), (Coleoptera: Curculionidae), and potato leafhopper, <i>Empoasca fabae</i> (Harris), (Homoptera: Cicadellidae), remain key pests of alfalfa in Virginia.  Commercial varieties of potato leafhopper-resistant (or glandular-haired) alfalfa were released in the mid-1990s, but the impact of alfalfa weevil on these varieties has not been well documented.   In 1999, two large-scale field experiments were initiated to compare the performance of a glandular-haired alfalfa variety against a standard, non-glandular-haired variety under both alfalfa weevil and potato leafhopper pest pressures in the southwestern and Piedmont regions of Virginia over a 3 year period.  Results indicated that alfalfa weevil must be managed in potato leafhopper-resistant alfalfa to limit crop loss.  Surprisingly, similar densities of potato leafhoppers were found in both the glandular-haired and standard varieties.  Both varieties frequently had similar yields and forage quality.  In general, the glandular-haired variety did not outperform the standard variety.  Results also indicated that insecticide application did not always provide the expected benefits of higher yields and forage quality, despite reducing pest densities for 2-3 weeks after application.  These data suggest that the economic thresholds for one or both of these pests in Virginia may require adjustment. The potential impact of glandular-haired alfalfa on the natural enemies of alfalfa weevil was examined as well.  <i>Bathyplectes anurus</i> (Thompson) (Hymenoptera: Ichneumonidae) was the dominant parasitoid attacking weevil larvae at both locations.  Parasitization of weevil larvae by <i>Bathyplectes</i> spp. did not appear to be adversely affected by the presence of glandular trichomes on the potato leafhopper-resistant variety.  Glandular trichomes had little impact on the infection of weevil larvae by the fungus <i>Zoophthora phytonomi</i> as well, but this was not unexpected. The genetic variation of <i>B. anurus</i> was surveyed at both study sites using RAPD-PCR to establish or eliminate the possibility that differences in parasitization levels between the Piedmont and southwestern regions could be attributed to the presence of different parasitoid strains.  Most of the detected phenotypic variation was attributed to within population variation, with very little variation occurring between the two populations.  However, the between population variation was statistically significant in 2000, but not in 2001.",
  "description_provenance": [
    "Author Email: tdelling@vt.edu",
    "Advisor Email: spaulson@vt.edu",
    "Advisor Email: youngman@vt.edu",
    "Advisor Email: dgpfeiff@vt.edu",
    "Advisor Email: luckhart@vt.edu",
    "Advisor Email: lewise@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:55Z (GMT). No. of bitstreams: 1 TreeDissert.pdf: 514092 bytes, checksum: bc5740f7fa7882a7bd2636a96c7b870b (MD5)   Previous issue date: 2003-09-19"
  ],
  "handle": "29140",
  "identifier_other": "etd-09302003-112826",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09302003-112826/",
  "identifier_uri": "http://hdl.handle.net/10919/29140",
  "publisher": "Virginia Tech",
  "relation_haspart": "TreeDissert.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "<i>Bathyplectes anurus</i>",
    "<i>Empoasca fabae</i>",
    "<i>Hypera postica</i>",
    "glandular-haired",
    "alfalfa",
    "RAPD-PCR",
    "biological control"
  ],
  "title": "Combined Roles of Glandular-haired Alfalfa and Natural Enemies in Alfalfa Pest Managment in Virginia",
  "type": "Dissertation"
}