{
  "contributor_author": "Uan-Zo-li, Julie Tammy",
  "contributor_committeechair": "Marand, Hervé L.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Esker, Alan R.",
    "Reynolds, William T. Jr.",
    "Love, Brian J."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:16:55Z",
  "date_adate": "2005-10-25",
  "date_available": "2014-03-14T20:16:55Z",
  "date_issued": "2005-09-19",
  "date_rdate": "2006-10-25",
  "date_sdate": "2005-09-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>In this work the morphology, crystallization and melting behavior of novel Dow Chemical propylene-ethylene copolymers were investigated.   <p>The incorporation of ethylene units into a polypropylene chain resulted in the decrease in crystallization, melting and glass transition temperatures and overall crystallinity.  Based on the shape of heat capacity curves and the dependence of the melting temperature offset on ethylene content, it was concluded that copolymers prepared using different catalyst systems exhibited different ethylene sequence length distributions.    <p>The behavior of Dow Chemical propylene-ethylene copolymers was compared to that of copolymers prepared using traditional metallocene and Ziegler-Natta catalysts.  The catalyst system used in the preparation of these new copolymers is similar to a metallocene catalyst system. <p>It was demonstrated that ethylene defects are partially included in the polypropylene crystal.  The thermodynamic heat of fusion at the equilibrium melting temperature decreased by 44% with an increase in ethylene concentration from 0 mol% to 21.2 mol%.  On the basis of calorimetric and density data, the inclusion model based on the Sanchez-Eby crystallization theory was shown to be applicable for the evaluation of the degree of crystallinity.  At the same time, inadequacies were found in application of the rigid amorphous fraction model to these copolymers. <p>The formation of gamma-phase crystals was shown to be favored by both an increase in the ethylene content and a decrease in the crystallization rate.  Increase in the ethylene content was shown to lead to a decrease in the density, length and thickness of alpha-phase crystals.  It was also demonstrated that the cross-hatching morphology is present in all propylene-ethylene copolymers.",
  "description_provenance": [
    "Author Email: jdvorkin@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: blove@vt.edu",
    "Advisor Email: hmarand@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:55Z (GMT). No. of bitstreams: 1 Dissertation_final_2.pdf: 5740000 bytes, checksum: 23e20f413b3d467d0edf2010a8534df5 (MD5)   Previous issue date: 2005-09-19"
  ],
  "handle": "29143",
  "identifier_other": "etd-09302005-134815",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09302005-134815/",
  "identifier_uri": "http://hdl.handle.net/10919/29143",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_final_2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "alpha and gamma phases",
    "ethylene inclusion",
    "rigid amorphous fraction",
    "thermodynamic heat of fusion",
    "propylene-ethylene copolymers"
  ],
  "title": "Morphology, Crystallization and Melting Behavior of Propylene-Ethylene Statistical Copolymers",
  "type": "Dissertation"
}