{
  "contributor_author": "Wang, Wei",
  "contributor_committeechair": "Burton, John K.",
  "contributor_committeemember": [
    "Moore, David Michael",
    "Potter, Kenneth R.",
    "Lockee, Barbara B."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:16:56Z",
  "date_adate": "2011-10-17",
  "date_available": "2014-03-14T20:16:56Z",
  "date_issued": "2011-08-30",
  "date_rdate": "2011-10-17",
  "date_sdate": "2011-09-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In contemporary Chinese higher education, classroom lectures combined with a web-based learning support system are broadly applied. This study investigated what kind of feedback strategy could be effective in improving students창   self-efficacy and course satisfaction in a blended learning context. Standard volitional messages were constructed and창  along with traditional feedback content (knowledge of results and knowledge of correct response)창  distributed to a large undergraduate class in China. Sixty-seven freshmen participated in this pure experimental study. Results indicated that students창   learning self-efficacy and course satisfaction were significantly correlated. In addition, participants who received the knowledge of correct response plus volitional messages (KCR+V) showed greater course satisfaction than those who received other types of feedback messages. No significant difference emerged in self-efficacy. Future research directions are discussed.",
  "description_provenance": [
    "Author Email: wwang06@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: kpotter@exchange.vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:56Z (GMT). No. of bitstreams: 1 Wang_Wei_D_2011.pdf: 2640887 bytes, checksum: 1f5c5cf45455aa3d9e241ab9469a1176 (MD5)   Previous issue date: 2011-08-30"
  ],
  "handle": "29149",
  "identifier_other": "etd-09302011-082401",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09302011-082401/",
  "identifier_uri": "http://hdl.handle.net/10919/29149",
  "publisher": "Virginia Tech",
  "relation_haspart": "Wang_Wei_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Volition",
    "Feedback",
    "satisfaction",
    "self-efficacy"
  ],
  "title": "The Impact of Volitional Feedback on Learners' Self-Efficacy and Course Satisfaction in a College Assignment System",
  "type": "Dissertation"
}