{
  "contributor_author": "Owens, Daniel Kenneth",
  "contributor_committeechair": "Winkel, Brenda S. J.",
  "contributor_committeemember": [
    "Sible, Jill C.",
    "Walker, Richard A.",
    "Rutherford, Charles L.",
    "McDowell, John M."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:16:55Z",
  "date_adate": "2005-10-21",
  "date_available": "2014-03-14T20:16:55Z",
  "date_issued": "2005-09-22",
  "date_rdate": "2007-10-21",
  "date_sdate": "2005-09-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> The flavonols are a varied and abundant sub-class of flavonoids that are associated with a number of essential physiological functions in plants and pharmacological activities in animals. The 2-oxoglutarate-dependant dioxygenases(2-ODDs), flavonol synthase (FLS) and flavanone 3-hydroxylase (F3H), are essential for flavonol synthesis. The primary goal of this study has been to gain a deeper understanding of the biochemistry of these enzymes in Arabidopsis.     </p><p> To accomplish this goal, an activity assay employing recombinant protein expression and HPLC as a detection system was developed for F3H and adapted for use with FLS. The assay was employed to establish the biochemical parameters of F3H from Arabidopsis, and to further characterize the F3H mutant allele, <i>tt6</i>(87). Enzymatic activity was demonstrated for F3H enzymes from <i>Ipomoea alba</i> (moonflower), <i>Ipomoea purpurea</i> (common morning glory), <i>Citrus sinensis</i> (sweet orange), and <i>Malus X domestica</i> (newton apple), each of which had previously been identified solely based on sequence homology.    </p><p>  Arabidopsis contains six genes with high similarity to FLS from other plant species; however, all other central flavonoid pathway enzymes in Arabidopsis are encoded by single genes. The hypothesis that differential expression of FLS isozymes with varying substrate specificities is responsible for observed tissue-specific differences in flavonol accumulation was tested. Sequence analysis revealed that <i>AtFLS2, 4 and 6</i> contain premature stop codons that eliminate residues essential for enzyme activity. AtFLS1 was found to have a strong preference for dihydrokaempferol as a substrate. However, no enzyme activity was observed for AtFLS3 or AtFLS5 with a number of different substrates under a variety of reaction conditions. To identify structural elements that may contribute to the observed differences in biochemical activity, homology models for each of the isoforms were generated utilizing Arabidopsis anthocyanin synthase (ANS) as a template. A domain at the N-terminus of AtFLS1 that is missing in the other isozymes was insufficient to convey activity to an AtFLS1/5 chimera. These findings suggest a single catalytically-active form of FLS exists in Arabidopsis. The possibility that the apparently expressed but non-catalytic proteins, AtFLS2, 3, and 5, serve noncatalytic roles in flavonol production were explored by yeast 2-hybrid analysis.</p>",
  "description_provenance": [
    "Author Email: dowens@vt.edu",
    "Advisor Email: siblej@vt.edu",
    "Advisor Email: rawalker@vt.edu",
    "Advisor Email: winkel@vt.edu",
    "Advisor Email: rutherfo@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:55Z (GMT). No. of bitstreams: 1 dowens_final_update.pdf: 521029 bytes, checksum: 09bc3c595a6984f0d1bc29ee4afddcd6 (MD5)   Previous issue date: 2005-09-22"
  ],
  "handle": "29144",
  "identifier_other": "etd-09302005-204631",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09302005-204631/",
  "identifier_uri": "http://hdl.handle.net/10919/29144",
  "publisher": "Virginia Tech",
  "relation_haspart": "dowens_final_update.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "2-oxoglutarate dependant dioxygenases",
    "Michaelis-Menten kinetics",
    "flavanone 3-hydroxylase",
    "flavonoid biosynthesis",
    "flavonol synthase"
  ],
  "title": "Examination of 2-Oxoglutarate Dependant Dioxygenases Leading to the Production of Flavonols in <i>Arabidopsis thaliana</i>",
  "type": "Dissertation"
}