{
  "contributor_author": "Hurtado, Oscar",
  "contributor_committeechair": "Westwood, James H.",
  "contributor_committeemember": [
    "McDowell, John M.",
    "Cramer, Carole L."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:16:55Z",
  "date_adate": "2004-10-22",
  "date_available": "2014-03-14T20:16:55Z",
  "date_issued": "2004-08-27",
  "date_rdate": "2005-10-22",
  "date_sdate": "2004-09-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Master of Science",
  "description_abstract": "The parasitic angiosperm Orobanche aegyptiaca (Pers.) (Egyptian broomrape) is a root holoparasite that causes severe losses in yield and quality of many crops. Control of Orobanche is extremely challenging, in part because the parasite is hidden underground for most of its life cycle. However, the dependence of the parasite on the host suggests that broomrape-resistant hosts could be an ideal control method. Genetic engineering strategies may facilitate realization of this goal, but require an understanding of host defense responses to parasitism. Previous studies with tobacco indicated that broomrape parasitism induces host genes associated with jasmonic acid (JA)-mediated defenses such as wound responses and localized production of phenylpropanoid and isoprenoid phytoalexins. However, the gene for the pathogenesis-related (PR) protein, PR-1a, was not induced by parasitism in tobacco. Expression of PR-1a is correlated with the salicylic acid (SA)-mediated defense pathway that leads to systemic acquired resistance (SAR). The objective of this research was to extend the characterization of PR gene expression in order to define the scope of host defense response. Analyses of gene expression using RNA hybridization and RT-PCR in broomrape-parasitized Arabidopsis thaliana roots indicated that PR-1, PR-2, PR-5, as well as the JA-associated PDF1.2, were slightly induced by parasitism. Expression of PR-1, PR-5, and PDF1.2 in parasitized roots was not detectable by RNA hybridization analysis, but was demonstrated by RT-PCR. Interestingly, shoots of the parasitized plants showed greater PR gene expression levels than roots, indicating that O. aegyptiaca induced a response in the host that was systemic and amplified in shoots. Microarray analysis of parasitized Arabidopsis roots demonstrated a broad range of host gene expression changes including both defense- and non-defense-related genes. Genes induced were consistent with O. aegyptiaca preferentially stimulating JA-mediated responses.  \tThe failure of O. aegyptiaca to elicit SA-mediated defenses in host roots suggested that exogenous induction of this signaling pathway could enhance host resistance to parasitism. Treatment of O. aegyptiaca-inoculated tobacco with BTH, a SA analog that activates SAR, caused a 49% reduction in O. aegyptiaca numbers. Analysis of PR-1a using RNA hybridizations and protein immunoblots in treated plants showed the expected induction in shoots, but not in roots, confirming the organ-specific differences in defense response observed in Arabidopsis. Experiments using a strategy to engineer the hypersensitive response via the gene-for-gene interaction confirmed previous findings that parasite-specific activation of an R/Avr interaction in tobacco reduced parasitism by approximately 50%. This research suggests that approaches to stimulate SAR in susceptible host plants may be useful for reducing Orobanche parasitism",
  "description_provenance": [
    "Author Email: ohurtado@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Advisor Email: ccramer@vt.edu",
    "Advisor Email: westwood@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:55Z (GMT). No. of bitstreams: 1 dissertation_Oscar_Hurtado.pdf: 1117119 bytes, checksum: d422eec2e1ac7dfc9f41a90ec512de2a (MD5)   Previous issue date: 2004-08-27"
  ],
  "handle": "29141",
  "identifier_other": "etd-09302004-171835",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-09302004-171835/",
  "identifier_uri": "http://hdl.handle.net/10919/29141",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation_Oscar_Hurtado.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "microarray analysis",
    "Orobanche aegyptiaca",
    "plant defense response"
  ],
  "title": "Study and Manipulation of the Salicylic Acid-Dependent Defense Pathway in Plants Parasitized by Orobanche aegyptiaca Pers.",
  "type": "Dissertation"
}