{
  "contributor_author": "Mathai, Christina McGrady",
  "contributor_committeechair": "Getz, Hilda M.",
  "contributor_committeemember": [
    "Hutchins, David E.",
    "Skaggs, Gary E.",
    "Curcio, Claire Cole Vaught",
    "Moore, James"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:16:58Z",
  "date_adate": "2002-10-04",
  "date_available": "2014-03-14T20:16:58Z",
  "date_issued": "2002-09-18",
  "date_rdate": "2003-10-04",
  "date_sdate": "2002-10-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Crisis intervention is a responsibility of school counselors. Specific training in crisis intervention skills is recommended for performing adequately in crisis situations, however, no generally accepted standards exist for training school counselors in crisis intervention. This exploratory study was conducted entirely online. Participants in the study were recruited via email and listservs and accessed a website to complete a survey. State certified school counselors (n=517) from across the United States (response rate 47%) participated. The following research questions were investigated: (1) Do these school counselors have training in situational crisis intervention skills? (2) What is the format and source of this training? (3) What situational crises have these counselors faced in their work? (4) Do these counselors feel adequately prepared for crisis situations? (5) Do these counselors differ in their preparedness according to demographic variables? (6) What additional training regarding crisis intervention do these counselors believe they need? Results indicate the majority of participants have had training in crisis intervention. Significant differences in level of training were found based on years of experience, age group, and ethnic group. The most frequently cited training topics previously received by respondents are stages of grief, suicide prevention and intervention, and assessment and referral. The most frequently encountered crisis situations are suicide ideation, child physical abuse, child sexual abuse, and suicide gesture. The average percentage of time spent by respondents on crisis intervention is 17%. Over 50% of respondents report being adequately prepared as the result of training for crises related to suicide, violence, accidents, and alcohol/drugs. Forty-six percent report being adequately prepared for crises involving disaster. For each of the five categories of crisis (suicide, violence, accidents, alcohol/drugs, disaster), respondents with 1-5 years of experience report lower perceptions of preparedness as the result of training than the other groups. Elementary counselors report lower levels of preparedness for suicide and alcohol/drug related crises. High school counselors report lower levels of preparedness for disaster. Eighty-nine percent of respondents wish to have additional training in crisis intervention. The most desired training topics are responding to violence, psychological first aid, crisis simulations, Critical Incident Stress Debriefing, and legal/ethical issues in crisis intervention.",
  "description_provenance": [
    "Author Email: cmathai@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:58Z (GMT). No. of bitstreams: 2 MathaiDissertation.pdf: 1564603 bytes, checksum: d21670e16d8cc0e55298e2cb8d1f9096 (MD5) Abstract.pdf: 40698 bytes, checksum: ec6ea24638ef80876cfe17371e3360ad (MD5)   Previous issue date: 2002-09-18"
  ],
  "handle": "29156",
  "identifier_other": "etd-10012002-154307",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10012002-154307/",
  "identifier_uri": "http://hdl.handle.net/10919/29156",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "MathaiDissertation.pdf",
    "Abstract.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Counselor Training/Education",
    "Crisis Intervention",
    "School Counseling",
    "School Crisis Intervention",
    "Web-based research"
  ],
  "title": "Surveying School Counselors via the Internet Regarding Their Experiences and Training Needs in Crisis Intervention",
  "type": "Dissertation"
}