{
  "contributor_author": "Mokwa, Robert L.",
  "contributor_committeechair": "Duncan, James Michael",
  "contributor_committeemember": [
    "Kapania, Rabesh K.",
    "Barker, Richard M.",
    "Brandon, Thomas L.",
    "Filz, George G."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:16:57Z",
  "date_adate": "1999-10-02",
  "date_available": "2014-03-14T20:16:57Z",
  "date_issued": "1999-09-28",
  "date_rdate": "2000-10-02",
  "date_sdate": "1999-09-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Investigation of the Resistance of Pile Caps to Lateral Loading by Robert L. Mokwa  Dr. J. Michael Duncan, Chairman Charles E. Via, Jr. Department of Civil and Environmental Engineering   ABSTRACT Bridges and buildings are often supported on deep foundations.  These foundations consist of groups of piles coupled together by concrete pile caps.  These pile caps, which are often massive and deeply buried, would be expected to provide significant resistance to lateral loads.  However, practical procedures for computing the resistance of pile caps to lateral loads have not been developed, and, for this reason, cap resistance is usually ignored. Neglecting cap resistance results in estimates of pile group deflections and bending moments under load that may exceed the actual deflections and bending moments by 100 % or more.  Advances could be realized in the design of economical pile-supported foundations, and their behavior more accurately predicted, if the cap resistance can be accurately assessed.   This research provides a means of assessing and quantifying many important aspects of pile group and pile cap behavior under lateral loads.  The program of work performed in this study includes developing a full-scale field test facility, conducting approximately 30 lateral load tests on pile groups and pile caps, performing laboratory geotechnical tests on natural soils obtained from the site and on imported backfill materials, and performing analytical studies.  A detailed literature review was also conducted to assess the current state of practice in the area of laterally loaded pile groups.  A method called the \"group-equivalent pile\" approach (abbreviated GEP) was developed for creating analytical models of pile groups and pile caps that are compatible with established approaches for analyzing single laterally loaded piles.  A method for calculating pile cap resistance-deflection curves (p-y curves) was developed during this study, and has been programmed in the spreadsheet called PYCAP.   A practical, rational, and systematic procedure was developed for assessing and quantifying the lateral resistance that pile caps provide to pile groups.  Comparisons between measured and calculated load-deflection responses indicate that the analytical approach developed in this study is conservative, reasonably accurate, and suitable for use in design.  The results of this research are expected to improve the current state of knowledge and practice regarding pile group and pile cap behavior.",
  "description_provenance": [
    "Author Email: rmokwa@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:57Z (GMT). No. of bitstreams: 12 Chapter1.PDF: 107914 bytes, checksum: 0fd366fc043fc586dec3b33c458ccb7e (MD5) Chapter3.PDF: 1092388 bytes, checksum: 2a098cbbedc15b3621b34c075b14b01d (MD5) References.PDF: 147521 bytes, checksum: a215cb26ae1d985023c5928235b59845 (MD5) Chapter2.pdf: 578015 bytes, checksum: 000f96d925608a7415d6437c6d639f9f (MD5) Chapter4.PDF: 737333 bytes, checksum: 7afc3a34a75f78b0d2271fb4d6c1414b (MD5) Chapter7.pdf: 2026815 bytes, checksum: 719b5ad5ad42a902241ca735e78a1282 (MD5) Chapter8.PDF: 146135 bytes, checksum: 00bb83cccf0770c6d45a08cd4fd159bb (MD5) Appendices.pdf: 2273161 bytes, checksum: 32ad4179ac4115c63641fc14a54da759 (MD5) Chapter6.PDF: 1161348 bytes, checksum: 3e91c8f7b3d285eadc5f48526c253997 (MD5) ETD.pdf: 367463 bytes, checksum: 46e02cd38ad147fc6fc981a960e3ec18 (MD5) Chapter5.PDF: 488401 bytes, checksum: 29c91030913631e239ee9256b6b2a98f (MD5) Vita.PDF: 79833 bytes, checksum: bd447201caf7e22d7a3bc0faaac8aee4 (MD5)   Previous issue date: 1999-09-28"
  ],
  "handle": "29152",
  "identifier_other": "etd-093099-180817",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-093099-180817/",
  "identifier_uri": "http://hdl.handle.net/10919/29152",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter1.PDF",
    "Chapter3.PDF",
    "References.PDF",
    "Chapter2.pdf",
    "Chapter4.PDF",
    "Chapter7.pdf",
    "Chapter8.PDF",
    "Appendices.pdf",
    "Chapter6.PDF",
    "ETD.pdf",
    "Chapter5.PDF",
    "Vita.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "log spiral",
    "pile group",
    "lateral loads",
    "pile cap"
  ],
  "title": "Investigation of the Resistance of Pile Caps to Lateral Loading",
  "type": "Dissertation"
}