{
  "contributor_author": "Cicek, Muzaffer",
  "contributor_committeechair": "Esen, Asim",
  "contributor_committeemember": [
    "Winkel, Brenda S. J.",
    "Beers, Eric P.",
    "Rutherford, Charles L.",
    "Walker, Richard A."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:16:57Z",
  "date_adate": "1999-10-07",
  "date_available": "2014-03-14T20:16:57Z",
  "date_issued": "1999-09-07",
  "date_rdate": "2000-10-07",
  "date_sdate": "1999-09-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Ã -glucosidases catalyze the hydrolysis of aryl and alkyl Ã -D-glucosides as well as glucosides with a carbohydrate moiety.  The maize Ã -glucosidase isozymes Glu1and Glu2 hydrolyze a broad spectrum of substrates in addition to its natural substrate DIMBOAGlc, while the sorghum Ã -glucosidase Dhr1 (dhurrinase-1) hydrolyzes exclusively its natural substrate dhurrin.  For the expression of mature Ã -glucosidase isozymes Glu1 and Glu2 of maize and Dhr1 of sorghum, complementary DNAs were amplified by PCR and cloned into the expression vector pET-21a.  Recombinant Glu1, Glu2 and Dhr1 enzymes were found to display activity towards the physiological substrates DIMBOAGlc and dhurrin, respectively, at levels similar to their native counterparts.  It has been a subject of the subsequent studies by our lab and others to investigate what determines the aglycone specificity in Ã -glucosidases, and how Ã -glucosidases catalyze the hydrolysis of Ã -glycosidic bond between sugar and aglycone moieties.  Molecular modeling techniques allowed to predict the substrate binding sites in Glu1 and Dhr1.  Based on structural analysis of Glu1 and Dhr1, chimeric Ã -glucosidases (Glu1/Dhr1) were constructed by shuffling the C-terminal amino acids of Glu1 with the homologous region of Dhr1 to study the mechanism of substrate specificity.  The resulting chimeric enzymes were characterized with respect to substrate specificity as well as kinetic, immunological, and electrophoretic properties.  Shuffling a small portion of the C-terminal region altered the substrate specificity and improved by 2-4 fold the catalytic efficiency on other substrates in the chimeric v-glucosidases.  These experiments showed that one or more of the 10 amino acid substitutions in the 30 amino acid long Dhr1 subdomain, 462SSGYTERFGIVYVDRENGCERTMKRSARWL491, plays a key role in dhurrin recognition and hydrolysis.  To further investigate dhurrin recognition within this peptide region, two chimeric enzymes containing 462SSGYTERF469 and 466FAGFTERY473 Dhr1 peptides, respectively, were generated.  The kinetic parameters indicated that Dhr1 peptide, 462SSGYTERF469, alone is sufficient to convert Glu1 to Dhr1 substrate specificity when it replaces the homologous peptide, 466FAGFTERY473, of Glu1.   Maize v-glucosidases share high sequence similarities with Family 1 O-glucosidases.  Therefore, these proteins are classified as retaining glycosyl hydrolases whose active site contains two glutamic acids (E) as the key catalytic residues, one as a general acid/base catalyst (E191) and the other as a nucleophile (E406).  To confirm the identity and function of the acid/base catalyst E191, we have changed this residue to isosteric glutamine (Q) and aspartic acid (D) in both Glu1 and Glu2 isozymes by site-directed mutagenesis.  The resulting mutant proteins were purified and their kinetic parameters (Km, kcat and ki) were determined.  The replacement of the acid/base catalyst E191 in the active site of maize Ã -glucosidase by Q and D resulted in inactivation of the enzyme.  The kinetic analysis of the E191Q mutants showed that catalytic activity was reduced 200- and 110-fold towards ortho- and para-nitrophenyl-Ã -D-glucosides, respectively, when compared with the wild type enzyme.  The E191D mutants showed no detectable activity towards any of the substrates tested.  The back mutation of the E191Q mutants of the Glu1 and Glu2 isozymes to wild type restored full catalytic activity in both cases.  These data indicate that E191 in maize Ã -glucosidases functions as an acid/base catalyst, and its function in catalysis cannot be performed by an isosteric residue such as glutamine or by a carboxyl group on a shorter side chain such as in aspartic acid.",
  "description_provenance": [
    "Author Email: mcicek@vt.edu",
    "Advisor Email: shirley@vt.edu",
    "Advisor Email: ebeers@vt.edu",
    "Advisor Email: aevatan@vt.edu",
    "Advisor Email: rutherfo@vt.edu",
    "Advisor Email: rawalker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:57Z (GMT). No. of bitstreams: 14 Chapter4_2.ETD.pdf: 19316 bytes, checksum: cbb53eef062e7643fcd838a929ff4dae (MD5) Chapter3_2.ETD.pdf: 25265 bytes, checksum: 7d22df2ccbb395c36fb4d05b3b0257e0 (MD5) Chapter5.ETD.pdf: 15613 bytes, checksum: ff799af5b3d7c96d8b5f25a47627a7f2 (MD5) Chapter4_3.ETD.pdf: 7892 bytes, checksum: 113e3c9e59d7485ae50849192baf1269 (MD5) Chapter2.ETD.pdf: 121310 bytes, checksum: cdffa8775807d2d17a5696f881e309d5 (MD5) Chapter3_4.ETD.pdf: 58506 bytes, checksum: 4cfef953cfa4fdcdee8deb61fbcfc5eb (MD5) Chapter1.ETD.pdf: 155316 bytes, checksum: a1ba7a2b2ad128b2bab414d1a33abd26 (MD5) Chapter3_0.ETD.pdf: 138178 bytes, checksum: 0d776b0f6756f1e4d1fa1508b6f7ffdd (MD5) Chapter4_1.ETD.pdf: 62220 bytes, checksum: df7fd78d1ed31bc56f1e27b06fe03b47 (MD5) Chapter3_3.ETD.pdf: 3445 bytes, checksum: 1bf5cbf7ee7209642c676ca44d13844b (MD5) 01table.content.ETD.pdf: 20015 bytes, checksum: d0adbe78666db2d40acd93f78420901f (MD5) Chapter3_1.ETD.pdf: 2397 bytes, checksum: 962a3bfe1fe5d56ba470fc92b6bbf479 (MD5) Chapter4_4.ETD.pdf: 37587 bytes, checksum: b00f2a315c80e1f8dc510e41a488ea96 (MD5) Chapter4_5.ETD.pdf: 9235 bytes, checksum: 1540cbe8971c67471e57756c20d6097e (MD5)   Previous issue date: 1999-09-07"
  ],
  "handle": "29150",
  "identifier_other": "etd-093099-112234",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-093099-112234/",
  "identifier_uri": "http://hdl.handle.net/10919/29150",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter4_2.ETD.pdf",
    "Chapter3_2.ETD.pdf",
    "Chapter5.ETD.pdf",
    "Chapter4_3.ETD.pdf",
    "Chapter2.ETD.pdf",
    "Chapter3_4.ETD.pdf",
    "Chapter1.ETD.pdf",
    "Chapter3_0.ETD.pdf",
    "Chapter4_1.ETD.pdf",
    "Chapter3_3.ETD.pdf",
    "01table.content.ETD.pdf",
    "Chapter3_1.ETD.pdf",
    "Chapter4_4.ETD.pdf",
    "Chapter4_5.ETD.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Ã -glucosidase",
    "dhurrin",
    "DINBOA-glucoside"
  ],
  "title": "Mechanism of Substrate Specificity and Catalysis in Retaining β-Glucosidases From Maize and Sorghum",
  "type": "Dissertation"
}