{
  "contributor_author": "Christmann, Undine",
  "contributor_committeechair": "Buechner-Maxwell, Virginia A.",
  "contributor_committeecochair": "Witonsky, Sharon G.",
  "contributor_committeemember": [
    "Reilly, Christopher M.",
    "Taylor, Larry T.",
    "Ward, Daniel",
    "Hite, Duncan"
  ],
  "contributor_department": "Large Animal Clinical Sciences",
  "date_accessioned": "2014-03-14T20:16:58Z",
  "date_adate": "2008-10-22",
  "date_available": "2014-03-14T20:16:58Z",
  "date_issued": "2008-08-28",
  "date_rdate": "2008-10-22",
  "date_sdate": "2008-10-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Pulmonary surfactant is synthesized in the alveoli and lines the respiratory epithelium of the airways. Phospholipids, the main component of surfactant, confer it its ability to lower  surface tension and to prevent alveolar collapse. Airway surfactant helps maintain smaller airway patency, improves muco-ciliary clearance, decreases bronchoconstriction, and modulates pulmonary immunity. Surfactant alterations in human asthma are therefore believed to contribute to the severity of airway obstruction.  The goal of our first study was to characterize surfactant phospholipid composition and function in healthy horses, and to investigate the influence of age and bronchoalveolar lavage fluid (BALF) sample characteristics on surfactant. For that purpose, BALF was collected from 17 healthy horses and evaluated for BALF recovery percentage, cell count, and cell differential. BALF was separated into crude surfactant pellets (CSP) and supernatant and was analyzed for phospholipid content, protein content, phospholipid composition, and surface tension. Interestingly, phospholipid (surfactant) content in CSP significantly decreased with age. BALF recovery percentage, nucleated cell count, and cytological profile did not affect surfactant composition or function.  The hypothesis of our second study was that surfactant alterations in RAO-affected horses are related to clinical stage of RAO. The objectives were 1) to compare surfactant phospholipid composition and function between Non-RAO and RAO horses at clinical stages and 2) to investigate relationships between surfactant alterations and variables assessing clinical stage of RAO.  Seven horses with confirmed RAO and seven Non-RAO horses were evaluated in pairs (RAO/Non-RAO) at baseline, during exposure to hay, and post-exposure. Assessments included: clinical scoring, measure of maximal change in pleural pressure (Î Pplmax), airway endoscopy, and BALF cell counts and differentials. Samples were processed and analyzed as described above.  Phospholipid levels in BALF were significantly lower in RAO versus Non-RAO horses, even in the absence of clinical signs. In the group of RAO horses, phospholipid content was significantly lower during exposure versus baseline. Furthermore, exposure to hay led to an increase in the protein versus phospholipid ratio in BALF from RAO horses. No significant differences were found in BALF protein content, phospholipid composition, or surface tension between or within groups of horses. Phosphatidylglycerol percentage had a tendency to be lower in RAO horses with higher clinical scores. Supernatant protein content was related to BALF neutrophilia in RAO crisis and overall Î Pplmax .   In conclusion, our study demonstrated that surfactant alterations in RAO horses are present in remission and are exacerbated following exposure to hay. It is conceivable that a lower amount of surfactant in bronchioli of RAO horses may contribute to the horsesâ   propensity to develop airway obstruction, mucous accumulation, and bronchial hyperresponsiveness. This may be exacerbated during crisis by a relatively higher protein versus phospholipid ratio.  Furthermore, a progressive decrease of surfactant levels in older horses may contribute to a worsening of clinical signs in older RAO-affected horses.",
  "description_provenance": [
    "Author Email: chrisun@vt.edu",
    "Advisor Email: creilly@vcom.vt.edu",
    "Advisor Email: switonsk@vt.edu",
    "Advisor Email: bmax@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: Dward@AESOP.Rutgers.edu",
    "Advisor Email: dhite@wfubmc.edu",
    "Made available in DSpace on 2014-03-14T20:16:58Z (GMT). No. of bitstreams: 2 Copyrights.pdf: 265809 bytes, checksum: 2e7de701a454eb104669dd888f4ceb36 (MD5) 1022ChristmannETD.pdf: 3051076 bytes, checksum: 0ee15f41f534c7884f16e89d2db0b6cd (MD5)   Previous issue date: 2008-08-28"
  ],
  "handle": "29159",
  "identifier_other": "etd-10012008-213752",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10012008-213752/",
  "identifier_uri": "http://hdl.handle.net/10919/29159",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Copyrights.pdf",
    "1022ChristmannETD.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "recurrent airway obstruction (RAO)",
    "horse",
    "surface tension",
    "phospholipid",
    "surfactant"
  ],
  "title": "Relationship between surfactant alterations and severity of disease in horses with recurrent airway obstruction (RAO).",
  "type": "Dissertation"
}