{
  "contributor_author": "Poston, Daniel Hasford",
  "contributor_committeechair": "Wilson, Henry P.",
  "contributor_committeemember": [
    "Hagood, Edward Scott Jr.",
    "Hatzios, Kriton K.",
    "Hess, John L.",
    "Orcutt, David M."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:16:57Z",
  "date_adate": "1999-10-07",
  "date_available": "2014-03-14T20:16:57Z",
  "date_issued": "1999-09-28",
  "date_rdate": "2000-10-07",
  "date_sdate": "1999-09-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Studies were conducted in 1996 through 1999 to: (1) evaluate the responses of one imidazolinone (IMI)-susceptible (S) and four -resistant (R1, R2, R3, and R4) smooth pigweed populations to various acetolactate synthase (ALS)-inhibiting herbicides, (2) determine the mechanism of resistance, and (3) evaluate the relative growth and competitiveness of each population. Field studies were conducted in 1996 near Marion, MD, in a field with a history of repeated imazaquin use. Smooth pigweed control with IMI herbicides was < 8 percent, but control with sulfonylurea (SU) herbicides ranged from 73 to 99 percent. Follow-up greenhouse studies were used to confirm IMI resistance in the Marion, MD smooth pigweed population (R4) as well as three others (R1, R2, and R3). R populations were 730- to 1350-fold more tolerant to imazethapyr than the S population. Based on resistance ratios, all R populations displayed low-level cross-resistance to chlorimuron and negative cross-resistance to thifensulfuron, pyrithiobac, and cloransulam-methyl with R2 being the most sensitive of the R populations to pyrithiobac and cloransulam-methyl. <p> Absorption, translocation, and metabolism of 14C-cloransulam-methyl in S and R2 populations were generally similar. Three metabolites of cloransulam-methyl with ratio of front (Rf) values approximately 0.83, 0.65, and 0.45 were isolated. The metabolite with a 0.83 Rf value increased over time as the parent molecule decreased indicating that it plays a major role in cloransulam-methyl metabolism in smooth pigweed. The other metabolites did not change significantly over time and never represented more than 5 percent of the extracted radioactivity. The identity of these metabolites has not been determined. <p>Using enzyme assays, it was determined that IMI resistance in R populations was due to an altered ALS that was no longer susceptible to inhibition by these herbicides. ALS from S, R1, and R2 populations responded similarly to chlorimuron and thifensulfuron, but reductions in enzyme activity by chlorimuron and thifensulfuron were significantly greater for R3 ALS than for S, R1 or R2 ALS. ALS from R2 and R3 was significantly more sensitive to inhibition by pyrithiobac compared to S ALS. Based on resistance ratios, R2 and R3 ALS were also more sensitive to inhibition by cloransulam-methyl than S ALS. Negative cross-resistance to thifensulfuron, pyrithiobac, and cloransulam-methyl in some R populations at the whole-plant level can be explained by increased sensitivity at the enzyme level. <p>Under noncompetitive conditions in the greenhouse, S produced 17, 23, 25, and 44 percent more biomass than R1, R2, R3, and R4 populations, respectively. S plants were also taller than R plants 17 and 21 d after planting (DAP) and displayed a faster initial rate of leaf area increase compared to all R populations. The net assimilation rate of S was significantly higher than R2 and R3 populations 24 DAP. R3 and R4 populations had significantly less chlorophyll per g of plant tissue compared to S; therefore, reduced growth in some R populations compared to S may be linked to chlorosis that generally appears early in seedling development. Biomass production in the field under competitive conditions was similar for all populations using both monoculture and mixed populations. For this reason, the differences in growth observed in the greenhouse in the S population may not confer a competitive advantage over R populations in the field.",
  "description_provenance": [
    "Author Email: dposton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:57Z (GMT). No. of bitstreams: 1 DPOSTON.PDF: 648774 bytes, checksum: 47b4bf868e2ce89ec5e9c86e93dfc776 (MD5)   Previous issue date: 1999-09-28"
  ],
  "handle": "29151",
  "identifier_other": "etd-093099-161507",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-093099-161507/",
  "identifier_uri": "http://hdl.handle.net/10919/29151",
  "publisher": "Virginia Tech",
  "relation_haspart": "DPOSTON.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Herbicide Resistance",
    "Fitness",
    "Acetolactate Synthase",
    "Imidazolinone"
  ],
  "title": "GROWTH ANALYSES AND PATTERNS OF CROSS-RESISTANCE IN FOUR IMIDAZOLINONE-RESISTANT SMOOTH PIGWEED (Amaranthus hybridus) POPULATIONS",
  "type": "Dissertation"
}