{
  "contributor_author": "Amenkhienan, Charlotte A",
  "contributor_committeechair": "Curcio, Claire Cole Vaught",
  "contributor_committeemember": [
    "Fortune, Jimmie C.",
    "Getz, Hilda M.",
    "Hohenshil, Thomas H.",
    "Scott, Delores W."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:16:57Z",
  "date_adate": "2000-10-03",
  "date_available": "2014-03-14T20:16:57Z",
  "date_issued": "2000-09-07",
  "date_rdate": "2003-10-03",
  "date_sdate": "2000-10-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study identifies and discusses the academic activities and support services that second-year-engineering students perceived as having impacted their freshman year academic performance.  Guided by Astin's (1984) student involvement theory, this investigation involved a total of 34 participants, and was conducted at a large land-grant university in the southeastern United States during the spring semester of the 1998/99 academic year. The following questions were addressed by this study: (1) Which academic activities do students consider as important to their academic performance?  (2) Which academic support services do students consider as important to their academic performance?  (3) Are there academic performance level-related differences in students' perceptions of the impact of various academic activities in which they are involved, relative to their academic performance?  (4) Are there academic performance level-related differences in students' perceptions of impact of the academic support services they use, relative to their academic performance?  (5) Are there gender-related differences in students' perceptions of the impact of various academic activities in which they are involved, relative to their academic performance?  (6) Are there gender-related differences in students' perceptions of impact of the academic support services they use, relative to their academic performance?  (7) Are there race-related differences in students' perceptions of the impact of various academic activities in which they are involved, relative to their academic performance?  (8) Are there race-related differences in students' perceptions of impact of the academic support services they use, relative to their academic performance? The data for this study were gathered from 9 focus group interviews and from an accompanying open-ended questionnaire.  The 34 participants were divided into groups according to their academic performance levels, gender and race.  There were six unsuccessful academic performers with below 2.00 GPAs; 12 low academic performers with GPAs below 2.7 but not less than 2.00; and 14 high academic performers with GPAs of 2.7 and above.  The racial and gender composition was:  25 White students, 9 Black students; and equal numbers of males and females (17 each).  The criteria for participation were being a second-year, full-time student enrolled in the 1998/99 academic year.  Data were analyzed through content analysis, constant comparative data analysis and supplemented by NUD*IST. The resulting findings demonstrate a link between academic involvement activities and academic performance.  The academic involvement factors that students perceived as either positively or negatively impacting their freshman year academic performance were identified and categorized into three general themes:  (1) effort and involvement, (2) peer interaction and (3) faculty interaction.  Effort and involvement factors refer to the specific learning activities implemented and the academic support services students used during the freshman year.  Peer interaction factors are the relationships and contacts with fellow students that were perceived as impacting academic performance.  Faculty interaction refers to a student's contact with professors inside and outside of the classroom and the perceived impact of these interactions on academic performance. The critical factors identified for success in engineering include doing homework and completing assignments, making good use of one's time, using supportive programmatic resources, and receiving academic support from interacting with peers and faculty.  Students who expend effort in these areas are more likely to perform at a higher academic performance level than those who do not.",
  "description_provenance": [
    "Author Email: camen@vt.edu",
    "Advisor Email: vaughtc@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: thohen@vt.edu",
    "Advisor Email: scottdw@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:57Z (GMT). No. of bitstreams: 1 OctoberThesis.pdf: 490351 bytes, checksum: b5f3252295b173ed61cdd3dd65274af0 (MD5)   Previous issue date: 2000-09-07"
  ],
  "handle": "29155",
  "identifier_other": "etd-10012000-15140005",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10012000-15140005/",
  "identifier_uri": "http://hdl.handle.net/10919/29155",
  "publisher": "Virginia Tech",
  "relation_haspart": "OctoberThesis.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Academic Success",
    "Engineering",
    "Persistence",
    "Freshman"
  ],
  "title": "Perception of the Impact of Freshmen Academic Involvement Activities, and Use of Academic Support Services on Academic Performance - (A Case Study of Virginia Tech Second Year Engineering Students): Implications for Counseling",
  "type": "Dissertation"
}