{
  "contributor_author": "Munn, Barbara J.",
  "contributor_committeechair": "Tracy, Robert J.",
  "contributor_committeemember": [
    "Law, Richard D.",
    "Cotkin, Spencer",
    "Hewitt, David A.",
    "Bodnar, Robert J."
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:16:57Z",
  "date_adate": "1998-01-13",
  "date_available": "2014-03-14T20:16:57Z",
  "date_issued": "1997-08-20",
  "date_rdate": "1999-01-13",
  "date_sdate": "1997-08-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Thermobarometry, detailed petrography, electron microprobe analysis, and fluid inclusion microthermometry were used to quantify the history of a high grade Proterozoic terrane exposed within the northeastern Colorado Front Range.  Pressure-temperature calculations identified two blocks from different crustal levels exposed adjacent to one another within the Poudre Canyon west of Fort Collins.  They are the eastern, higher pressure, block (HPB; 734 degree C, 7.1 kbar) and the western, lower pressure, block (LPB; 655 degree C, 5.2 kbar).  The blocks followed a clockwise uplift path and were juxtaposed by ductile shear near the end of the decompressive stage of uplift.  Final assembly of the separate blocks to the same crustal level was constrained by mineralogic and textural considerations and by the isochores of identical low density carbon dioxide inclusions trapped by both blocks.  Both blocks experienced peak metamorphism within the sillimanite-K-feldspar zone accompanied by partial melting, are characterized by stromatic migmatites, and show textural evidence for localized reactions related to decompression and cooling.  Differences between the blocks include the type of melt-generating reactions and the pronounced late muscovite in the LPB.  Gibbs' Method calculations indicate that local (outcrop scale) textural and mineralogical differences between HPB Mg-enriched pelites are caused by small differences in bulk composition and locally variable H2O content.  The quartzo-feldspathic biotite gneisses in the LPB generated migmatites by wet melting, whereas the pelitic schists and gneisses in the HPB generated migmatites by dehydration melting of muscovite and biotite.  Biotite dehydration melting enriched the leucosomes in HPB pelitic migmatites in K-feldspar and garnet.  The minor presence of late muscovite in the HPB relative to the LPB was controlled by the different positions of their uplift paths relative to the muscovite breakdown reaction.",
  "description_provenance": [
    "Author Email: bjmunn@csus.edu",
    "Advisor Email: rtracy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:57Z (GMT). No. of bitstreams: 1 MunnDiss.pdf: 5230805 bytes, checksum: efd06d1a99e38e6cc298cd9b75bf756a (MD5)   Previous issue date: 1997-08-20"
  ],
  "handle": "29154",
  "identifier_other": "etd-0998-19597",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-0998-19597/",
  "identifier_uri": "http://hdl.handle.net/10919/29154",
  "publisher": "Virginia Tech",
  "relation_haspart": "MunnDiss.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Metamorphic Petrology",
    "Precambrian",
    "Anatexis",
    "Cordierite"
  ],
  "title": "Metamorphism in the Northern Front Range, Colorado",
  "type": "Dissertation"
}