{
  "contributor_author": "Bodur, H.  Onur",
  "contributor_committeecochair": [
    "Arora, Neeraj",
    "Nakamoto, Kent"
  ],
  "contributor_committeemember": [
    "Brinberg, David L.",
    "Eckel, Catherine C.",
    "Klein, Noreen M."
  ],
  "contributor_department": "Marketing",
  "date_accessioned": "2014-03-14T20:17:00Z",
  "date_adate": "2000-10-02",
  "date_available": "2014-03-14T20:17:00Z",
  "date_issued": "2000-08-18",
  "date_rdate": "2001-10-02",
  "date_sdate": "2000-10-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Many purchase decisions involve groups of individuals.  In marketing literature, a majority of the studies related to group decisions place greater emphasis on predicting the outcome of the decision than the process.  In this dissertation, I contend that understanding the process by which a purchase decision is reached is important because it may influence the joint choice and the satisfaction of a group member with the decision.  I study two key elements of the decision making process namely, revision and concession.  Consistent with previous research, I propose that a member's preferences are unlikely to be stationary during the group decision-making process.  Additionally, a member may make a concession to accommodate the preferences of the other member(s).  These two elements are not mutually exclusive and members may revise and/or make concessions when reaching a joint decision.  I argue that it is important to distinguish between revision and concession because each may have a different impact on a member's satisfaction with the joint decision.   I propose that the degree of revision and concession made by a member is related to several member and decision related factors.  The change in preference of a member is expected to affect the joint purchase decision by reducing the degree of disagreement between the members.  It is proposed that a member's satisfaction with the joint decision made is positively related to her degree of revision and negatively related to her own concession.  A field study funded by a packaged goods company was designed and implemented to provide a rigorous test of the proposed hypotheses.  There is compelling evidence for the negative impact of concession on satisfaction.  There is also partial support for the positive impact of revision on satisfaction.  Additionally, satisfaction is influenced by an interaction effect between a member's own concession and the concession made by the other member.  An important implication of the proposed model is that the process by which a purchase decision is reached (via revision or concession) has a distinct impact on the satisfaction of the group member with the joint decision.",
  "description_provenance": [
    "Author Email: bodur@mercato.concordia.edu",
    "Advisor Email: narora@bus.wisc.edu",
    "Advisor Email: nakamoto@vt.edu",
    "Advisor Email: dbrinber@vt.edu",
    "Advisor Email: eckelc@vt.edu",
    "Advisor Email: nklein@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:00Z (GMT). No. of bitstreams: 1 Bodur-dissertation-2000.pdf: 292519 bytes, checksum: bf982c8909321f0bc0a485dc45eddc52 (MD5)   Previous issue date: 2000-08-18"
  ],
  "handle": "29166",
  "identifier_other": "etd-10022000-10490046",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10022000-10490046/",
  "identifier_uri": "http://hdl.handle.net/10919/29166",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bodur-dissertation-2000.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "revision",
    "satisfaction",
    "evolution of preferences",
    "group decisions"
  ],
  "title": "Understanding Preference Revision and Concession in Group Decisions",
  "type": "Dissertation"
}