{
  "contributor_author": "Huffstetler, Philip Plaxico",
  "contributor_committeechair": "Judy S Riffle",
  "contributor_committeemember": [
    "S. Richard Turner",
    "Esker, Alan R.",
    "James E. McGrath",
    "Richey M. Davis"
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:16:59Z",
  "date_adate": "2009-11-17",
  "date_available": "2014-03-14T20:16:59Z",
  "date_issued": "2009-09-15",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-10-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Well-defined heterobifunctional homopolyethers and amphiphilic block copolyethers containing a variety of functionalities were designed, synthesized, and characterized via GPC and 1H NMR.  These have included controlled molecular weight cholesterol-PEO-OH, mono- and trivinylsilyl-PEO-OH, monovinylsilyl-PEO-PPO-OH, monovinylsilyl-PEO-PPO-PEO-OH, maleimide-PEO-OH, stearyl alcohol-PEO-OH, propargyl alcohol-PEO-OH, trivinylsilyl-PPO-OH, trivinylsilyl-PPO-PEO-OH, and benzyl alcohol-initiated poly(allyl glycidyl ether)-OH.  The focus of polymers utilized in this study involved the mono- and trivinylsilyl polyethers.<p>  The vinylsilyl endgroups on these materials were functionalized with various bifunctional thiols through free radical addition of SH groups across the vinylsilyl double bonds. The resultant end-functional polyethers were adsorbed onto magnetite nanoparticles and the stabilities of the polymer-magnetite complexes were compared as a function of the type of anchoring moiety and the number of anchoring moieties per chain.    Anchoring chemistries investigated in this work included carboxylates, alkylammonium ions, and zwitterionic phosphonates.  The anchor group-magnetite bond stability was investigated in water and phosphate buffered saline (PBS). Through these studies, the zwitterionic phosphonate group was shown to be a better anchoring group for magnetite than either carboxylate or ammonium ions.  Tri-zwitterionic phosphonate anchor groups provided stability of the complexes in PBS for a broad range of polymer loadings.  Thus, investigations into the stability of polyether-magnetite complexes in PBS focused on hydrophilic zwitterionic phosphonate-PEO-OH and amphiphilic zwitterionic phosphonate-PPO-b-PEO-OH oligomer coatings on the surface of magnetite.  <p>  Superparamagnetic magnetite nanoparticles are of interest as potential contrast-enhancement agents for MRI imaging. Thus, transverse NMR relaxivities of these complexes were studied as a function of chemical composition and nanostructure size and compared to commercial contrast agents.  The amphiphilic polyether-magnetite nanoparticles were shown to be stable in both aqueous media as well as physiological media and have much higher transverse relaxation values, r2, than those of commercial contrast agents and other materials in the literature.",
  "description_provenance": [
    "Author Email: phuff@vt.edu",
    "Advisor Email: srturner@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Made available in DSpace on 2014-03-14T20:16:59Z (GMT). No. of bitstreams: 1  Huffstetler_PP_D_2009.pdf: 21301460 bytes, checksum: 99e532686cb307c45f72fb895a28d354 (MD5)    Previous issue date: 2009-09-15"
  ],
  "handle": "29160",
  "identifier_other": "etd-10012009-232212",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10012009-232212/",
  "identifier_uri": "http://hdl.handle.net/10919/29160",
  "publisher": "Virginia Tech",
  "relation_haspart": "Huffstetler_PP_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "magnetite",
    "MRI",
    "diblock copolymers",
    "heterobifunctional polyethers",
    "poly(ethylene oxide)",
    "contrast agents",
    "poly(propylene oxide)"
  ],
  "title": "Synthesis and Characterization of Well-Defined Heterobifunctional Polyethers for Coating Magnetite and Their Applications in Biomedicine Resonance Imaging",
  "type": "Dissertation"
}