{
  "contributor_author": "Brooks, John Daniel",
  "contributor_committeechair": "Cox, David F.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Hanson, Brian E.",
    "Morris, John R.",
    "Oyama, Shigeo Ted"
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:16:59Z",
  "date_adate": "2010-10-29",
  "date_available": "2014-03-14T20:16:59Z",
  "date_issued": "2010-09-29",
  "date_rdate": "2012-05-08",
  "date_sdate": "2010-10-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The thermally induced reaction of chlorinated ethanes on the nearly-stoichiometric α-Cr<sub>2</sub>O<sub>3</sub> (102) surface results in the formation of gas phase hydrocarbons including ethylene, ethane, acetylene, 2-butene, 2-butyne and dihydrogen, and deposition of surface chlorine adatoms.  No surface carbon or combustion products are observed in any reactions indicating that no thermally induced C-C bond cleavage occurs and surface lattice oxygen is not incorporated into surface intermediates.  A combination of photoemission and Auger electron spectroscopies indicates the surface reactions of the chlorinated ethanes proceed via C-Cl bond cleavage to form surface chlorine adatoms and surface C<sub>2</sub>-alkyl hydrocarbon fragments (i.e. ethyl, ethylidene and ethylidyne).  Temperature programmed desorption studies indicate that both ethyl and ethylidene intermediates are selective towards ethylene.  However, ethylidyne is more selective towards acetylene, but also produces ethylene in significant quantities.  Chlorine adatom deposition leads to deactivation of surface Cr reaction centers by simple site blocking.    <p>The interaction of water with nearly-stoichiometric α-Cr<sub>2</sub>O<sub>3</sub> (001) and (102) surfaces is structure sensitive.  Water is sensitive to the difference in coordination number of Cr surface cations between the two surfaces, and on the α-Cr<sub>2</sub>O<sub>3</sub> (001) surface, water has also demonstrated sensitivity to the degree of surface Cr cation reduction (and/or reduced coordination).  These observations allowed for the development of a surface treatment recipe for the nearly-stoichiometric (001) surface.",
  "description_provenance": [
    "Author Email: brooksd@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: hanson@vt.edu",
    "Advisor Email: jrmorris@vt.edu",
    "Advisor Email: oyama@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Made available in DSpace on 2014-03-14T20:16:59Z (GMT). No. of bitstreams: 1 Brooks_JD_D_2010.pdf: 1186827 bytes, checksum: 548a0803387733ce29e992a3e15d9efd (MD5)   Previous issue date: 2010-09-29"
  ],
  "handle": "29161",
  "identifier_other": "etd-10012010-210318",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10012010-210318/",
  "identifier_uri": "http://hdl.handle.net/10919/29161",
  "publisher": "Virginia Tech",
  "relation_haspart": "Brooks_JD_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ethyl",
    "ethylidene",
    "ethylidyne",
    "dehydrogenation",
    "water",
    "chromia"
  ],
  "title": "Model Chromia Surface Chemistry:  C<sub>2</sub> Alkyl Fragment Reactions and Probe Molecule Interactions",
  "type": "Dissertation"
}