{
  "contributor_author": "Walker, Katherine F.",
  "contributor_committeechair": [
    "Getz, Hilda M.",
    "Singh, Kusum"
  ],
  "contributor_committeemember": [
    "Bodenhorn, Nancy E.",
    "Garrison, James E.",
    "Hohenshil, Thomas H."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:17:00Z",
  "date_adate": "2002-11-25",
  "date_available": "2014-03-14T20:17:00Z",
  "date_issued": "2002-09-10",
  "date_rdate": "2003-11-25",
  "date_sdate": "2002-10-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Katherine F. Walker Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head> <p>The general purpose of this study was to both evaluate the effectiveness of    filial therapy and describe the filial treatment process with parents court-referred    for maltreatment. In filial therapy, parents learn basic play therapy skills    in a group format that they implement in weekly home play sessions. They then    generalize these skills into their parenting. Three research questions guided    the quantitative portion of this investigation: (1) Is filial therapy effective    at reducing the child abuse potential of parents court-referred for maltreatment?    (2) Is filial therapy effective at reducing parenting stress for parents court-referred    for maltreatment? (3) Is filial therapy effective at strengthening the parent-child    relationship for parents court-referred for maltreatment? Qualitative data about    parents' experience in the filial group was also collected and addressed the    following questions: (1) How does the filial therapy process affect participants?    (2) How does the filial therapy process affect treatment outcome? (3) What changes,    in addition to those measured quantitatively, are reported by parents. The experimental    group participants (n=7) received 8 weeks of filial therapy (modified from Landreth's    (1991) 10-week model) in 1-1/2 hour weekly sessions. The control group (n=5) received    a local agency's standard treatment. Parents completed two instruments, the    Parenting Stress Index (PSI) and the Child Abuse Potential Inventory (CAP).    Analyses of covariance indicated that parents significantly reduced there parenting    stress and strengthened the parent-child relationship. Although parents did    not significantly reduce their child abuse potential in this study, those results    were based on an incomplete analysis. Most of the pre-test CAP scores for parents    in the experimental group (6 of 7) were invalid as a result of excessive \"faking    good responses.\" As a result, only post-test scores could be compared between    the experimental and control groups. The qualitative data revealed that parents    made important changes during the filial therapy process. </p> </body> </html>",
  "description_provenance": [
    "Author Email: kawalke2@vt.edu",
    "Advisor Email: hgetz@vt.edu",
    "Advisor Email: ksingth@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: jgarris@usit.net",
    "Advisor Email: thohen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:00Z (GMT). No. of bitstreams: 2 walkerfinalweb.pdf: 1077714 bytes, checksum: 81b838b43cbf4fd4760c0eecc7b02454 (MD5) AbstractAddendum.pdf: 43330 bytes, checksum: 3e01cbdfef152fab4764d6121db31424 (MD5)   Previous issue date: 2002-09-10"
  ],
  "handle": "29168",
  "identifier_other": "etd-10022002-091952",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10022002-091952/",
  "identifier_uri": "http://hdl.handle.net/10919/29168",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "walkerfinalweb.pdf",
    "AbstractAddendum.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Filial Therapy",
    "Child Maltreatment",
    "Court-Referred"
  ],
  "title": "Filial Therapy with Parents Court-Referred for Child Maltreatment",
  "type": "Dissertation"
}