{
  "contributor_author": "Liut, Daniel Armando",
  "contributor_committeechair": "Mook, Dean T.",
  "contributor_committeemember": [
    "VanLandingham, Hugh F.",
    "Hughes, Owen F.",
    "Ragab, Saad A.",
    "Matheu, Enrique E.",
    "Nayfeh, Ali H."
  ],
  "contributor_department": "Engineering Mechanics",
  "date_accessioned": "2014-03-14T20:17:00Z",
  "date_adate": "1999-10-05",
  "date_available": "2014-03-14T20:17:00Z",
  "date_issued": "1999-08-18",
  "date_rdate": "2000-10-05",
  "date_sdate": "1999-10-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Neural-Network and Fuzzy-Logic Learning and Control of Linear and Nonlinear Dynamic Systems <p> Daniel Armando Liut <p> ABSTRACT) <p> The goal of this thesis is to develop nontraditional strategies to provide motion control for different engineering applications. We focus our attention on three topics: 1) roll reduction of ships in a seaway; 2) response reduction of buildings under seismic excitations; 3) new training strategies and neural-network configurations.  <p> The first topic of this research is based on a multidisciplinary simulation, which includes ship-motion simulation by means of a numerical model called LAMP, the modeling of fins and computation of the hydrodynamic forces produced by them, and a neural-network/fuzzy-logic controller. LAMP is based on a source-panel method to model the flowfield around the ship, whereas the fins are modeled by a general unsteady vortex-lattice method. The ship is considered to be a rigid body and the complete equations of motion are integrated numerically in the time domain. The motion of the ship and the complete flowfield are calculated simultaneously and interactively. The neural-network/fuzzy-logic controller can be progressively trained.  <p> The second topic is the development of a neural-network-based approach for the control of seismic structural response. To this end, a two-dimensional linear model and a hysteretic model of a multistory building are used. To control the response of the structure a tuned mass damper is located on the roof of the building. Such devices provide a good passive reduction. Once the mass damper is properly tuned, active control is added to improve the already efficient passive controller. This is achieved by means of a neural network.  <p> As part of the last topic, two new flexible and expeditious training strategies are developed to train the neural-network and fuzzy-logic controllers for both naval and civil engineering applications. The first strategy is based on a load-matching procedure, which seeks to adjust the controller in order to counteract the loads (forces and moments) which generate the motion that is to be reduced. A second training strategy provides training by means of an adaptive gradient search. This technique provides a wide flexibility in defining the parameters to be optimized. Also a novel neural-network approach called modal neural network is designed as a suitable controller for multiple-input multiple output control systems (MIMO).",
  "description_provenance": [
    "Author Email: leakim@vt.edu",
    "Advisor Email: hughv@vt.edu",
    "Advisor Email: hugheso@vt.edu",
    "Advisor Email: ragab@vt.edu",
    "Advisor Email: dtmook@vt.edu",
    "Advisor Email: matheu@vt.edu",
    "Advisor Email: anayfeh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:00Z (GMT). No. of bitstreams: 13 liut_phd_00.pdf: 115794 bytes, checksum: 4060c76de0256a69a7268630a6d37f65 (MD5) liut_phd_01.pdf: 49603 bytes, checksum: d3547e9998509895c8f8ffbf05f9ffd1 (MD5) liut_phd_02.pdf: 871925 bytes, checksum: 2464fa366b37c46fd83a36c61ede3b4f (MD5) liut_phd_03.pdf: 182488 bytes, checksum: 8209bd703dbcb6576673eebca0c4bace (MD5) liut_phd_04.pdf: 36814 bytes, checksum: dde20266dc432e3bfcd56290b7dc766f (MD5) liut_phd_06.pdf: 199822 bytes, checksum: ac1d34a51a5a72704e5d3d34b82a2e4c (MD5) liut_phd_07.pdf: 384616 bytes, checksum: dbf5c6868b55827610f1319493f1071f (MD5) liut_phd_05.pdf: 296205 bytes, checksum: 232c41f21202b0648a6c26f619ffcba9 (MD5) liut_phd_08.pdf: 169003 bytes, checksum: 4c0f0dbe5927673a44772224b2c47c70 (MD5) liut_phd_09.pdf: 179504 bytes, checksum: 167ab3dd9090a41afa14d439ec5d0d06 (MD5) liut_phd_10.pdf: 12785 bytes, checksum: 7b12298b97cdfc1e3c3cf1056f4e654e (MD5) liut_phd_bi.pdf: 37304 bytes, checksum: 5dcfeeacfae3393636fd68bd76fee710 (MD5) liut_phd_vi.pdf: 5169 bytes, checksum: c71e58102a7eef42662e2548b2afa9b4 (MD5)   Previous issue date: 1999-08-18"
  ],
  "handle": "29163",
  "identifier_other": "etd-100199-072001",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-100199-072001/",
  "identifier_uri": "http://hdl.handle.net/10919/29163",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "liut_phd_00.pdf",
    "liut_phd_01.pdf",
    "liut_phd_02.pdf",
    "liut_phd_03.pdf",
    "liut_phd_04.pdf",
    "liut_phd_06.pdf",
    "liut_phd_07.pdf",
    "liut_phd_05.pdf",
    "liut_phd_08.pdf",
    "liut_phd_09.pdf",
    "liut_phd_10.pdf",
    "liut_phd_bi.pdf",
    "liut_phd_vi.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "load-matching procedure",
    "ship-motion control with fins",
    "linear and hysteretic building structures",
    "unsteady source-vortex-lattice hydrodynamics",
    "modal neural networks.",
    "adaptive gradient search",
    "tuned mass dampers",
    "neural-network and fuzzy-logic control"
  ],
  "title": "Neural-Network and Fuzzy-Logic Learning and Control of Linear and Nonlinear Dynamic Systems",
  "type": "Dissertation"
}