{
  "contributor_author": "Poquette, Ben David",
  "contributor_committeechair": "Kampe, Stephen L.",
  "contributor_committeemember": [
    "Aning, Alexander O.",
    "Schultz, Jeffery P.",
    "Corcoran, Sean Gerald",
    "Pickrell, Gary R.",
    "Reynolds, William T. Jr."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:17:00Z",
  "date_adate": "2007-10-09",
  "date_available": "2014-03-14T20:17:00Z",
  "date_issued": "2007-09-25",
  "date_rdate": "2007-10-09",
  "date_sdate": "2007-10-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Ferroelectric-reinforced metal matrix composites (FR-MMCs) offer the potential to improve damping characteristics of structural materials.  Many structural materials are valued based on their stiffness and strength; however, stiff materials typically have limited inherent ability to dampen mechanical or acoustic vibrations. The addition of ferroelectric ceramic particles may also augment the strength of the matrix, creating a multifunctional composite. The damping behavior of two FR-MMC systems has been examined.  One involved the incorporation of barium titanate (BaTiO3) particles into a Cu- 10w%Sn (bearing bronze) matrix and the other incorporating them into an electroformed Ni matrix.  Here the damping properties of the resulting ferroelectric reinforced metal matrix composites (FR-MMCs) have been investigated versus frequency, temperature (above and below the Curie temperature of the reinforcement), and number of strain cycles.  FR-MMCs currently represent a material system capable of exhibiting increased damping ability, as compared to the structural metal matrix alone. Dynamic mechanical analysis and neutron diffraction have shown that much of this added damping ability can be attributed to the ferroelectric/ferroelastic nature of the reinforcement.",
  "description_provenance": [
    "Author Email: bpoquett@vt.edu",
    "Advisor Email: kampe@vt.edu",
    "Advisor Email: aaning@vt.edu",
    "Advisor Email: jeschult@vt.edu",
    "Advisor Email: sgc@vt.edu",
    "Advisor Email: pickrell@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:00Z (GMT). No. of bitstreams: 1 Dissertation_Final_10-4-07.pdf: 8553488 bytes, checksum: 88deb3ac64140efb63cef51b3fadc268 (MD5)   Previous issue date: 2007-09-25"
  ],
  "handle": "29169",
  "identifier_other": "etd-10022007-124455",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10022007-124455/",
  "identifier_uri": "http://hdl.handle.net/10919/29169",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Final_10-4-07.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Dispersion Strengthening",
    "Electroforming",
    "Electrodeposition",
    "Electroless Plating",
    "Metal Matrix Composites",
    "Damping",
    "Ferroelectric",
    "Ferroelastic",
    "Twinning"
  ],
  "title": "Understanding Ferroelastic Domain Reorientation as a Damping Mechanism in Ferroelectric Reinforced Metal Matrix Composites",
  "type": "Dissertation"
}