{
  "contributor_author": "Yoon, Yooshik",
  "contributor_committeechair": "Uysal, Muzaffer S.",
  "contributor_committeecochair": "Chen, Joseph S.",
  "contributor_committeemember": [
    "Williams, John A.",
    "Hutchinson, Susan R.",
    "Mihalik, Brian J."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:17:01Z",
  "date_adate": "2002-10-07",
  "date_available": "2014-03-14T20:17:01Z",
  "date_issued": "2002-09-19",
  "date_rdate": "2008-02-11",
  "date_sdate": "2002-10-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study was conducted to theoretically develop and empirically test a structural equation model of tourism destination competitiveness from the tourism stakeholders'perspective. The proposed hypotheses that attempted to identify the structural relationships among the five constructs in the model were examined through a series of analyses in LISREL: 1) perceived tourism development impacts, 2) environmental attitudes, 3) place attachment, 4) development preferences about destination attractions/resources, and 5) support for destination competitive strategies    The principle guideline of this study was that the support of tourism stakeholders for tourism planning and development is a key element for the successful operation, management, and long-term sustainability of tourism destinations. Tourism stakeholders' solid knowledge and experiences in tourism management and industry, professional involvement and participation in tourism planning and development, and long-term community observation and interactions have played an important role in tourism destination management.      A total of 646 usable questionnaires were collected from randomly selected tourism stakeholders in the state of Virginia.  From the results of hypotheses tests, tourism stakeholders' preferences about tourism attractions/ resources development are a function of perceived tourism development impacts as well as place attachment. The more stakeholders' preference for developing tourism attractions/resources, the more likely they were to support destination competitive strategies such as marketing efforts and activities, and destination management organizations' role.  An additional finding that was not hypothesized indicated that tourism stakeholders, who have perceived benefits from tourism development, particularly in its economic and cultural aspects, are likely to support enhancement strategies for destination competitiveness.     The implications of these findings can be applied to the enhancement of tourism destination competitiveness.",
  "description_provenance": [
    "Author Email: yoyoon1@vt.edu",
    "Advisor Email: williams@humec.ksu.edu",
    "Advisor Email: susan.hutchinson@unco.edu",
    "Advisor Email: bmihalik@vt.edu",
    "Advisor Email: j.chen@fh-bad-honnef.de",
    "Advisor Email: samil@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:01Z (GMT). No. of bitstreams: 1 TourismDestinationCompetitivenessYooshikYoon.pdf: 741889 bytes, checksum: aee08c88f7f8ec3d4ae87b38d7799df7 (MD5)   Previous issue date: 2002-09-19"
  ],
  "handle": "29174",
  "identifier_other": "etd-10032002-165524",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10032002-165524/",
  "identifier_uri": "http://hdl.handle.net/10919/29174",
  "publisher": "Virginia Tech",
  "relation_haspart": "TourismDestinationCompetitivenessYooshikYoon.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Tourism Destination Competitiveness",
    "Tourism Stakeholders",
    "Place Attachment",
    "Tourism Development Impact",
    "Environmental Attitude",
    "Structural Equation Modeling (SEM)"
  ],
  "title": "Development of a Structural Model for  Tourism Destination Competitiveness from Stakeholders' Perspectives",
  "type": "Dissertation"
}