{
  "contributor_author": "Bohland, Jon Donald",
  "contributor_committeechair": "Luke, Timothy W.",
  "contributor_committeemember": [
    "Nelson, Scott C.",
    "Toal, Gerard",
    "La Berge, Ann F."
  ],
  "contributor_department": "Public and International Affairs",
  "date_accessioned": "2014-03-14T20:17:02Z",
  "date_adate": "2006-11-09",
  "date_available": "2014-03-14T20:17:02Z",
  "date_issued": "2006-09-22",
  "date_rdate": "2009-11-09",
  "date_sdate": "2006-10-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examines issues of neo-Confederate collective memory, heritage, and geographical imagination within the Shenandoah Valley of Virginia.  I analyze a whole range of material cultural practices throughout the entire region centered on the memory of the Civil War including monuments, battlefields, museum exhibits, burial rituals, historical reenactments, paintings, and dramatic performances. These mnemonic sites and rituals throughout the Great Valley of Virginia serve to circulate a dominant and mythologized reading of the Civil War past, one that emphasizes the Lost Cause myth of the Confederacy. In addition to uncovering neo-Confederate forms of memorialization, I also examine how normative lessons of morality, honor, patriotism, masculinity, and hyper-militarism become naturalized as a result of Lost Cause remembrance.  The dissertation combines qualitative, practice-based modes of research with a Foucauldian influenced archival methodology that attempts to uncover particular silenced and alternative versions of the past that do not fit with normative version of heritage.",
  "description_provenance": [
    "Author Email: jobohlan@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Advisor Email: scnelson@vt.edu",
    "Advisor Email: toalg@vt.edu",
    "Advisor Email: alaberge@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:02Z (GMT). No. of bitstreams: 1 JBohlandDissertation.pdf: 4552495 bytes, checksum: d3c1e38febe62b5599d2d87f7ae9990c (MD5)   Previous issue date: 2006-09-22"
  ],
  "handle": "29177",
  "identifier_other": "etd-10032006-093242",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10032006-093242/",
  "identifier_uri": "http://hdl.handle.net/10919/29177",
  "publisher": "Virginia Tech",
  "relation_haspart": "JBohlandDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "cultural geography",
    "collective memory",
    "landscape",
    "Shenandoah Valley",
    "neo-Confederate nationalism.",
    "Foucault",
    "heritage tourism",
    "identity",
    "Lost Cause"
  ],
  "title": "A Lost Cause Found:  Vestiges of Old South Memory in the Shenandoah Valley of Virginia",
  "type": "Dissertation"
}