{
  "contributor_author": "Davis, Tamara E.",
  "contributor_committeechair": "Curcio, Claire Cole Vaught",
  "contributor_committeemember": [
    "Lichtman, Marilyn V.",
    "Hutchins, David E.",
    "Paritzky, Richard S.",
    "Rosen, Karen H."
  ],
  "contributor_department": "Counselor Education and Student Personnel Services",
  "date_accessioned": "2014-03-14T20:17:02Z",
  "date_adate": "2007-10-03",
  "date_available": "2014-03-14T20:17:02Z",
  "date_issued": "1997-09-08",
  "date_rdate": "2011-05-11",
  "date_sdate": "2007-10-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Research on storytelling in counseling and psychotherapy with children has typically involved literary and metaphoric techniques that foster client change. There is limited research on the efficacy of telling one's personal life story as a counseling technique, especially in the school setting.  <p>The purpose of this study was two-fold: (l) to describe and implement a technique for school counselors to use in individual counseling sessions to foster resilience in children and, more specifically, (2) to explore the effectiveness of telling one's life story and creating a personal life book as a counseling technique to improve two characteristics of resilience -- internal locus of control and perceived coping resources. The research question that guided this study was: To what extent is telling one's life story and creating a life book an effective counseling technique for fostering resilience in children who have experienced loss?  <p>A sample of fifty children from two elementary schools (grades 4-6) who had experienced a significant loss were randomly assigned to one of three groups: (1) the experimental group who received the life book technique, (2) a control group of students who received other individual counseling, or (3) a control group who received no counseling at all. Two constructs of resilience in children were measured: (1) internal/external locus of control (Children's Nowicki-Strickland Internal-External Locus of Control Scale) and (2) perceived coping resources (Coping Resources Inventory Scales for Educational Enhancement). Pre-test/Posttest analyses of data following the six-week experimental period were conducted using ANOVA statistical procedures.  <p>Quantitative results indicated that, statistically, the life book technique was no more or no less effective in improving internal locus of control or coping resources than either other individual counseling techniques or no counseling at all. However, qualitative evaluation of the technique offered support for the effectiveness of the life book technique as indicated by the life book participants who experienced change in a positive direction on both instruments and the unanimous positive evaluations of the life book participants and participating counselors.  <p> Therefore, while the life book technique was not found to be statistically significant in fostering resilience, the positive implications of qualitative analysis warrant further research to explore the life book technique as a school counseling practice to foster positive client change.",
  "description_provenance": [
    "Author Email: tdavis@marymount.edu",
    "Made available in DSpace on 2014-03-14T20:17:02Z (GMT). No. of bitstreams: 1 LD5655.V856_1997.D385.pdf: 5577573 bytes, checksum: 5cd601d94d424f12119b1172d019e206 (MD5)   Previous issue date: 1997-09-08"
  ],
  "format_medium": "BTD",
  "handle": "29178",
  "identifier_other": "etd-10032007-172134",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10032007-172134/",
  "identifier_uri": "http://hdl.handle.net/10919/29178",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1997.D385.pdf",
  "subject": [
    "counseling and resilience",
    "life books",
    "life stories"
  ],
  "subject_lcc": "LD5655.V856 1997.D385",
  "title": "Telling life stories and creating life books :a counseling technique for fostering resilience in children",
  "type": "Dissertation"
}