{
  "contributor_author": "Watson, Carol Elizabeth",
  "contributor_committeecochair": [
    "Triplett, Cheri F.",
    "Harris, Larry A."
  ],
  "contributor_committeemember": [
    "Abraham, Jane L.",
    "Barksdale, Mary Alice",
    "Brand, Brenda R."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:02Z",
  "date_adate": "2005-10-31",
  "date_available": "2014-03-14T20:17:02Z",
  "date_issued": "2005-08-26",
  "date_rdate": "2005-10-31",
  "date_sdate": "2005-10-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT Within the current national atmosphere of accountability and high-stakes testing, many teachers are changing their instruction to return to more traditional strategies that emphasize rote memorization. As a result, classroom curriculum and student learning are narrowing. This study sought to explore the potential of graphic organizers as an instructional strategy to expand student content knowledge beyond rote memorization to include more organized, complex, meaningful learning. \tFor the purpose of this study, graphic organizers are described as visual displays of concepts, their component parts, and the relationships among their parts. This study was conducted over a six week period in a third grade classroom in a rural elementary school in Virginia. Ten focus students were identified for in-depth data collection on their learning process as recorded during science instruction.  Although existing research strongly supports graphic organizer effectiveness as an instructional strategy toward general student achievement, little is known about the type of learning they support or the process by which students' knowledge develops. Thus, this research utilized qualitative methodological strategies in order to investigate this process. Data collection methods included field notes, student artifacts, and participant interviews. Constant comparative methodology was employed to analyze data. The theoretical framework of constructivism, espousing that newly acquired information is connected to prior knowledge forming complex, organized networks of conceptual understanding, guided this qualitative study.  \tFindings resulted in emergent themes including student motivation, simplicity, efficiency, visual hierarchical organization, reconstructing knowledge, and cooperative socialization. Documentation of the learning process as opposed to a comparison of pre/post measurements clearly indicated that student thinking gradually became more complex and organized in nature. As students worked with graphic organizers, and participated in study activities, their knowledge moved from a form of listing facts to resemble more complex, interconnected networks.  \tImplications of this study for practice include appropriate instruction and practice for students with graphic organizers as a strategy and a tool, value as an assessment tool, and potential for use with complex classroom populations. Suggestions for future research are given for teacher training on how to use graphic organizers effectively, interdisciplinary use of graphic organizers within one context, potential benefit for struggling and diverse learners, a continuing focus on process as opposed to product, and an examination of the connection between graphic organizer activities and sorting.",
  "description_provenance": [
    "Author Email: cwatson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:02Z (GMT). No. of bitstreams: 2 DISSERTATION-preliminarypages.pdf: 87064 bytes, checksum: 1d2186a7aa7e48d2386a1a7b9c66cf7f (MD5) DISSERTATION-compressedandrevised.pdf: 16701991 bytes, checksum: 5d2f92e24fe48730eb09241709497be0 (MD5)   Previous issue date: 2005-08-26"
  ],
  "handle": "29175",
  "identifier_other": "etd-10032005-163112",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10032005-163112/",
  "identifier_uri": "http://hdl.handle.net/10919/29175",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "DISSERTATION-preliminarypages.pdf",
    "DISSERTATION-compressedandrevised.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "organization",
    "complexity",
    "graphic organizaers",
    "instructional strategies"
  ],
  "title": "Graphic Organizers: Toward Organization and Complexity of Student Content Knowledge",
  "type": "Dissertation"
}