{
  "contributor_author": "Jerden, James L",
  "contributor_committeechair": "Sinha, A. Krishna",
  "contributor_committeemember": [
    "Hickmott, Donald",
    "Zelazny, Lucian W.",
    "Beard, James S.",
    "Henika, William S.",
    "Rimstidt, james Donald"
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:17:01Z",
  "date_adate": "2001-10-04",
  "date_available": "2014-03-14T20:17:01Z",
  "date_issued": "2001-09-21",
  "date_rdate": "2002-10-04",
  "date_sdate": "2001-10-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Development of a scientific basis for management of uranium bearing wastes and contaminants requires information from natural geologic systems. The following study of the Coles Hill uranium deposit and associated weathered zone constrains processes leading to the natural attenuation of uranium within an oxidizing, fluid rich environment typical of the eastern US. At the Coles Hill deposit fracture hosted, primary U(IV) bearing mineral assemblages formed during hydrothermal activity associated with Mesozoic faulting.  The most abundant ore assemblage consists of coffinite and apatite, but uraninite-zeolite and uraninite-calcite assemblages are also present.  Within the shallow bedrock there is a uranium redox transition where alteration of U(IV) minerals has produced secondary uranium minerals. Geochemical data suggests that the volume of rock containing this U(IV)/U(VI) transition is acting as a closed system with respect to uranium mass transport during oxidation. The dominant mechanism of uranium fixation within the oxidizing zone is the precipitation of Ba-U(VI) phosphates (meta-autunite group). Speciation and mineral stability calculations indicate that ground waters from the Coles Hill weathered zone are saturated with respect to Ba-meta-autunite and that this mineral is capable of buffering dissolved uranium concentrations to values lower than 20 parts per billion. U(VI) phosphates of the meta-autunite group are not stable in the vadose zone (soil pH ~ 4.5) at the Coles Hill site. In this zone uranium is associated with (Ba, Ca, Sr) aluminum phosphate of the crandallite group as well as with phosphate sorbed to iron oxy-hydroxide mineral coatings. Uranium leached from the vadose zone is reprecipitated as new meta-autunite minerals below the water table due to higher pH conditions of ~6.0 and relatively high activity ratios of dissolved phosphate to carbonate (e.g. log [H2PO4-/HCO3-] > -3). It is estimated that the U(VI) phosphates responsible for the natural attenuation of uranium at this site persist within the weathering zone for hundreds of thousands of years. Thus, the Coles Hill deposit represents an excellent natural laboratory for the study of uranium attenuation with potential applications for the design and implementation of cost effective remediation and containment strategies, such as soil amendments techniques and in-situ reactive barriers technologies.",
  "description_provenance": [
    "Author Email: jjerden@vt.edu",
    "Advisor Email: dhickmott@lanl.gov",
    "Advisor Email: pitlab@vt.edu",
    "Advisor Email: zelazny@vt.edu",
    "Advisor Email: jbeard@vt.edu",
    "Advisor Email: bhenika@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:01Z (GMT). No. of bitstreams: 2 JerdenDissertation.pdf: 12465295 bytes, checksum: 8e36eeb1ffd5a36f0c28dc0e2bbf9956 (MD5) JerdenVita.pdf: 746319 bytes, checksum: e56a8585d7effec082efd617098a83f5 (MD5)   Previous issue date: 2001-09-21"
  ],
  "handle": "29173",
  "identifier_other": "etd-10032001-141240",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10032001-141240/",
  "identifier_uri": "http://hdl.handle.net/10919/29173",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "JerdenDissertation.pdf",
    "JerdenVita.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Autunite",
    "Uranium Transport",
    "Uranium Deposit",
    "Natural Attenuation",
    "Crandallite"
  ],
  "title": "Origin of Uranium Mineralization at Coles Hill Virginia (USA) and its Natural Attenuation within an Oxidizing Rock-Soil-Ground Water System",
  "type": "Dissertation"
}