{
  "contributor_author": "Allison-Jones, Lisa L.",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeemember": [
    "Olsen, Deborah",
    "Janosik, Steven M.",
    "Creamer, Donald G.",
    "Ingalls, Jane"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:17:04Z",
  "date_adate": "2002-10-08",
  "date_available": "2014-03-14T20:17:04Z",
  "date_issued": "2002-09-09",
  "date_rdate": "2003-10-08",
  "date_sdate": "2002-10-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The effectiveness of full-time and part-time faculty is an area of major interest in education, especially in light of the dramatic rise of part-time faculty on the nation's campuses. In the period between 1976 and 1994, the use of full-time faculty increased by 21% while the use of part-time faculty increased by 91% (Clery, 1998).  The quality of instruction is the primary concern surrounding the use of part-time faculty (Clery, 1998; Fedler, 1989; Gappa & Leslie, 1997; Leslie, 1998; Mellander & Mellander, 1999; Spangler, 1990). One way of assessing quality of education is by assessing teacher effectiveness.   The purpose of this study was to compare the teaching effectiveness of part-time and full-time clinical nursing faculty. To achieve this, the Nursing Clinical Teacher Effectiveness Inventory (NCTEI) (Knox & Mogan, 1985) was adapted for use in measuring student and faculty perceptions of part-time faculty and of full-time faculty. The NCTEI was designed to measure five categories important in clinical nursing instruction: teaching ability, nursing competence, evaluation, interpersonal relationships, and personality traits.   The sample included two groups: clinical nursing students in Associate Degree Nursing programs at schools in a mid-Atlantic state and the part-time and full-time faculty who taught those students. There were three components of the study. First students completed questionnaires about the effectiveness of their part-time and full-time clinical nursing faculty. Second, part-time and full-time clinical nursing faculty completed questionnaires about their perceptions of their own effectiveness. Finally, results were compared with the percentage of first-time pass rates on the National Council Licensing Exam for Registered Nurses (NCLEX-RN). \t  Results of the study indicate that students rank part-time faculty as significantly less effective than full-time faculty on each of the five categories measured by the NCTEI and on the overall scale. These results are supported by the finding that there is no significant difference in the ways that students rate the effectiveness of teachers and the self-ratings of the teachers themselves.",
  "description_provenance": [
    "Author Email: lallison-jones@cox.net",
    "Advisor Email: dolsen@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: dgc2@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: jingalls@gcc.vccs.edu",
    "Made available in DSpace on 2014-03-14T20:17:04Z (GMT). No. of bitstreams: 10 10Vitae.pdf: 87093 bytes, checksum: 0097348a6c99624d5c7bfec73b04fae6 (MD5) 08References.pdf: 79376 bytes, checksum: c29b37549f31e6fbc3f31ad920e48df1 (MD5) 06Results.pdf: 90137 bytes, checksum: 2c9ec3a1e4f28b209679389fb71904e6 (MD5) 07Discussion.pdf: 66534 bytes, checksum: 1a1dc2ae1806912ae6611b5b6282f913 (MD5) 01Titlepage.pdf: 32559 bytes, checksum: 285befd7dc99ddccb151d397b2bbdc55 (MD5) 09Appendicies.pdf: 58984 bytes, checksum: a8d86ff681839767dfa8ac51d8418c26 (MD5) 03Introduction.pdf: 85482 bytes, checksum: 9e8ee7a18dc85cd19e0f9cdfad8e775a (MD5) 05Methodology.pdf: 102256 bytes, checksum: 2ed7704160eacf1ccc807e5d4ccac0a8 (MD5) 04LiteratureReview.pdf: 97974 bytes, checksum: 31c587908bddd349d0633b3a981c1ee8 (MD5) 02Front_Matter.pdf: 53563 bytes, checksum: 83eeae13bbd68a6f6af25bacc0869a91 (MD5)   Previous issue date: 2002-09-09"
  ],
  "handle": "29188",
  "identifier_other": "etd-10042002-183948",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10042002-183948/",
  "identifier_uri": "http://hdl.handle.net/10919/29188",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "10Vitae.pdf",
    "08References.pdf",
    "06Results.pdf",
    "07Discussion.pdf",
    "01Titlepage.pdf",
    "09Appendicies.pdf",
    "03Introduction.pdf",
    "05Methodology.pdf",
    "04LiteratureReview.pdf",
    "02Front_Matter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "teaching ability",
    "quality of instruction",
    "nursing students",
    "community college",
    "faculty"
  ],
  "title": "Student and Faculty Perceptions of Teaching Effectiveness of Full-time and Part-time Associate Degree Nursing Faculty, Nursing Clinical Teacher Effectiveness Inventory",
  "type": "Dissertation"
}