{
  "contributor_author": "Kelley, Jennifer Paige",
  "contributor_committeechair": "Protinsky, Howard O. Jr.",
  "contributor_committeemember": [
    "Nespor, Jan K.",
    "Benningfield, Anna Beth",
    "Prouty, Anne M.",
    "Miller, Deborah"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:17:04Z",
  "date_adate": "2001-11-13",
  "date_available": "2014-03-14T20:17:04Z",
  "date_issued": "2001-10-04",
  "date_rdate": "2002-11-13",
  "date_sdate": "2001-10-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this research was to explore what women who are, or have been, in therapy for an eating disorder find helpful about that therapy. Since the perspectives and voices of women in therapy are largely absent from the treatment literature, participants were asked to talk about their experiences in therapy, particularly those aspects they identified as helping them change in desirable ways.  \tIn-depth interviews were conducted with nine women and one therapist who treated each of them individually. Qualitative methods of analysis were employed that privileged the voices of participants and used the therapist's comments to add depth to the understanding of the results. \tThe results of this research are organized to help clinicians arrange their thinking about how to work with clients who have eating problems. Five categories, or aspects, of helpfulness were created:  relationship aspects, self of therapist aspects, within therapy aspects, outside therapy but related to treatment aspects, and having nothing to do with therapy aspects. Participants' voices are used to add depth and details to each of these aspects. Suggestions for therapists are included.",
  "description_provenance": [
    "Author Email: paigeke@home.com",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: abenning@vt.edu",
    "Advisor Email: hprotins@vt.edu",
    "Advisor Email: aprouty@uri.edu",
    "Advisor Email: lgcpsych@rev.net",
    "Made available in DSpace on 2014-03-14T20:17:04Z (GMT). No. of bitstreams: 1 1kelleypdf.pdf: 393221 bytes, checksum: c8bc1827b5c459f18837ec7a8351d1a9 (MD5)   Previous issue date: 2001-10-04"
  ],
  "handle": "29185",
  "identifier_other": "etd-10042001-163720",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10042001-163720/",
  "identifier_uri": "http://hdl.handle.net/10919/29185",
  "publisher": "Virginia Tech",
  "relation_haspart": "1kelleypdf.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "relationship with therapist",
    "self-disclosure",
    "qualitative"
  ],
  "title": "What do Women in Therapy for an Eating Disorder find Helpful? A Qualitative Study",
  "type": "Dissertation"
}