{
  "contributor_author": "McGinnis, Marvin Harris",
  "contributor_committeechair": "Parson, Stephen R.",
  "contributor_committeecochair": "Dixon, Benjamin",
  "contributor_committeemember": [
    "Driscoll, Lisa G.",
    "Dawson, Christina M.",
    "Crockett, Jean B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:17:04Z",
  "date_adate": "2002-12-12",
  "date_available": "2014-03-14T20:17:04Z",
  "date_issued": "2002-09-20",
  "date_rdate": "2003-12-12",
  "date_sdate": "2002-10-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "CHALLENGES OF STUDYING ATTRIBUTES ASSOCIATED WITH AFRICAN  AMERICAN MALES WHO ARE NOT SUCCESSFUL WITH TESTING MEASURES  by  Marvin H. McGinnis  Steve R. Parson, Committee Chair Benjamin Dixon, Committee Co-Chair  ABSTRACT African Americans continue to perform significantly lower on high-stakes measures of educational achievement than do other ethnic groups. Osborn (1997) attributes this low performance by African Americans to their disidentification with the academic discourse. Ickes and Layden (1976), Metalsky, Abramson, and Peterson  (1982), Finn (1989), and Belgrave, Johnson, and Carey (1992) relate the poor performance of African Americans to the manner in which they internalize/externalize negative and positive outcomes and the longevity of such outcomes being internalized, which they term locus of control. This study explores the variables of self-esteem, locus of control, test anxiety, reading ability, testing behaviors and the performance of African American males on high-stakes tests of educational achievement. Simultaneously, the study provides a reflection on the challenges faced by a practitioner when he studies an issue of critical concern in his own community.",
  "description_provenance": [
    "Author Email: marmcginnis@aol.com",
    "Advisor Email: ldriscoll@vt.edu",
    "Advisor Email: bdixon@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: crockettj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:04Z (GMT). No. of bitstreams: 2 cchps.pdf: 367284 bytes, checksum: 5b9e2b96655946a94f2526ec173f81af (MD5) Vita.pdf: 4712 bytes, checksum: 748d696c7fe9a26f8991f7015ee4792c (MD5)   Previous issue date: 2002-09-20"
  ],
  "handle": "29186",
  "identifier_other": "etd-10042002-103859",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10042002-103859/",
  "identifier_uri": "http://hdl.handle.net/10919/29186",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "cchps.pdf",
    "Vita.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "African American Males",
    "Student Achievement",
    "high-stakes tests"
  ],
  "title": "Challenges Of Studying Attributes Associated With African American Males Who Are Not Successful With Testing Measures",
  "type": "Dissertation"
}