{
  "contributor_author": "Chen, Hong",
  "contributor_committeecochair": [
    "Wong, Eric A.",
    "Webb, Kenneth E. Jr."
  ],
  "contributor_committeemember": [
    "Bloomquist, Jeffrey R.",
    "Jiang, Honglin",
    "Denbow, Donald Michael"
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:17:04Z",
  "date_adate": "2001-10-05",
  "date_available": "2014-03-14T20:17:04Z",
  "date_issued": "2001-09-28",
  "date_rdate": "2002-10-05",
  "date_sdate": "2001-10-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "To study peptide absorption in chickens, an intestinal peptide transporter cDNA (cPepT1) was isolated from a chicken cDNA library.  The cDNA was 2,914-bp and encoded a protein of 714 amino acid residues.  Twenty-three di-, tri-, and tetra-peptides were used for functional analysis of cPepT1 in Xenopus oocytes and Chinese hamster ovary (CHO) cells.  For most di- and tripeptides tested, the Kt was in the micromolar range, except Lys-Lys and Lys-Trp-Lys.  Northern analysis demonstrated that cPepT1 is expressed strongly in the small intestine, and at lower levels in kidney and cecum.  These results demonstrated the presence and functions of a peptide transporter in chickens. cPepT1 mRNA abundance was evaluated in response to developmental and dietary regulations.  In Experiment 1, eggs at incubation day 18 (E18) and Cobb chicks after hatch (d 0) were sampled before treatments.  Three groups of chicks were fed diets containing 12, 18, or 24% crude protein (CP).  Feed intake of chicks fed the 18 or 24% CP diets was restricted to that of chicks fed the 12% CP diet.  In Experiment 2, a fourth group with free access to the 24% CP diet was added.  cPepT1 mRNA abundance was quantified from northern blots.  By d 0, there was a 50-fold increase in cPepT1 mRNA abundance compared with E 18.  In chicks fed the 12% CP diet, cPepT1 mRNA abundance decreased throughout the 35 d.  Chicks fed 18 or 24% CP diets showed an increase in cPepT1 mRNA abundance with time.  In chicks with free access to the 24% CP diet, cPepT1 mRNA decreased until d 14 but returned to an intermediate level at d 35.  Our results indicate that cPepT1 mRNA is regulated by both dietary protein and developmental stage.  To investigate the kinetics of an ovine peptide transporter (oPepT1), CHO cells were transfected with oPepT1 cDNA.  Uptake of Gly-Sar by transfected cells was pH-dependent, concentration-dependent, and saturable.  Competition studies showed that all di-, tri-, and tetra-peptides inhibited uptake of Gly-Sar.  Pretreatment of the cells with staurosporine resulted in an increase in peptide transport.  This increase was blocked by pretreatment with PMA.  The results indicate that protein kinase plays a role in oPepT1 function.",
  "description_provenance": [
    "Author Email: hochen@vt.edu",
    "Advisor Email: jbquist@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: hljiang@vt.edu",
    "Advisor Email: webbk@vt.edu",
    "Advisor Email: denbowdm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:04Z (GMT). No. of bitstreams: 1 hcDissertation100401.pdf: 1082820 bytes, checksum: bf50e74116ba2da631fd0ca61a47f78f (MD5)   Previous issue date: 2001-09-28"
  ],
  "handle": "29184",
  "identifier_other": "etd-10042001-134735",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10042001-134735/",
  "identifier_uri": "http://hdl.handle.net/10919/29184",
  "publisher": "Virginia Tech",
  "relation_haspart": "hcDissertation100401.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Protein Kinase",
    "Northern blot",
    "Dietary protein",
    "Development",
    "PepT1",
    "Peptide Transport"
  ],
  "title": "Cloning, Expression, and Developmental and Dietary Regulations of a Chicken Intestinal Peptide Transporter and Characterization and Regulation of an Ovine Gastrointestinal Peptide Transporter Expressed in a Mammalian Cell Line",
  "type": "Dissertation"
}