{
  "contributor_author": "Gonzaga, Paul Vincent",
  "contributor_committeechair": "Piedmont-Palladino, Susan C.",
  "contributor_committeemember": [
    "Jenkins, Eric J.",
    "Karvouni, Maria"
  ],
  "contributor_department": "Architecture",
  "date_accessioned": "2014-03-14T20:17:03Z",
  "date_adate": "1998-11-20",
  "date_available": "2014-03-14T20:17:03Z",
  "date_issued": "1998-05-01",
  "date_rdate": "1998-11-20",
  "date_sdate": "1998-10-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Master of Arts",
  "description_abstract": "The Book of Exodus in the Old Testament recounts the liberation and salvation of an oppressed people and their subsequent journey to and arrival at the Promised Land.  In the Christian Church, this journey continues in the lives of believers.  The spiritual journey begins with salvation, continues with a repeated process of suffering and redemption, and terminates with an awakening to a better understanding of God.<p> The spiritual journey made concrete is the concern of this project.  The Christian life, grossly simplified, is a passage from one place to another.  The believer is constantly passing through the threshold from this life to the next, from an old, limited understanding of the divine to  a new understanding.<p> In the Catholic Church, this process of passage is ritualized in the journey of the believer to the church each Sunday.  Upon entering the church building, the believer passes from the secular and mundane to the sacred and holy.<p> Where does the secular end and the sacred begin?  How does one delimit a boundary between the two?  How does one cross the threshold from the profane to the sacred?  That is the focus of this project.",
  "description_provenance": [
    "Author Email: vgonzaga@earthlink.net",
    "Advisor Email: JenkinsE@aol.com",
    "Advisor Email: spalla@vt.edu",
    "Advisor Email: mkarvoun@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:03Z (GMT). No. of bitstreams: 1 sacred.pdf: 3050136 bytes, checksum: bbbf264c8db102fe411581065f9ee203 (MD5)   Previous issue date: 1998-05-01"
  ],
  "handle": "29181",
  "identifier_other": "etd-100398-102908",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-100398-102908/",
  "identifier_uri": "http://hdl.handle.net/10919/29181",
  "publisher": "Virginia Tech",
  "relation_haspart": "sacred.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "liturgy",
    "catholic",
    "church",
    "architecture",
    "threshold"
  ],
  "subject_lcc": "LD5655.V855 1998.G669",
  "title": "Sacred Threshold:  An Examination of the Threshold in a Catholic Church for Hispanic Immigrants",
  "type": "Dissertation"
}