{
  "contributor_author": "Kumar, Dipmani",
  "contributor_committeechair": "Heatwole, Conrad D.",
  "contributor_committeemember": [
    "Dillaha, Theo A. III",
    "Perumpral, John V.",
    "Woeste, Frank E.",
    "Mostaghimi, Saied",
    "Gallagher, Daniel L."
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2014-03-14T20:17:05Z",
  "date_adate": "2006-10-04",
  "date_available": "2014-03-14T20:17:05Z",
  "date_issued": "1995-02-10",
  "date_rdate": "2011-12-13",
  "date_sdate": "2006-10-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The inherently non-deterministic nature of inputs in nonpoint source (NPS) pollution modeling and the lack of information in many cases resuHs in considerable uncertainty in model input parameters, and therefore, model outputs. Uncertainty in input parameters has important implications for model use in simulation studies and for procedures used to validate and evaluate models. Several management-oriented NPS pollution models have been developed with low input requirements in mind and are generally promoted as tools for comparative analysis of alternative land-use scenarios, with an implied blocking of the effects of parameter uncertainty. However, the impact of input parameter uncertainty on comparative analysis has not been rigorously investigated. <p> A dynamic Monte Carlo simulation based procedure is presented for quantifying the impact of parameter uncertainty on both absolute and comparative predictions from NPS pollution models, with possible correlations among inputs considered. An application of the procedure in a simulation study employing a management-oriented continuous NPS pollution model, GLEAMS, indicated parameter uncertainty had important consequences for both absolute predictions and comparative analysis between scenarios. <p> Information on correlations among input variables in Monte Carlo studies is frequently not available, and is commonly determined subjectively. A novel interactive approach to generating a correlation matrix from subjective information was developed. The procedure retains correlations between input variables with which a high degree of confidence is associated and allows use of these correlations to examine possible correlations between other variables. <p> Procedures were developed for defining probability distributions of important hydrologic inputs in management oriented NPS pollution models. A conceptual approach was used to derive runoff curve number distributions suitable for use in continuous models which adjust the input curve number based on continuous moisture accounting. New regression equations were developed for predicting saturated conductivity, field capacity, and wilting point using sand and clay content, porosity, and organic matter as regressors. Evaluation of the regression equations indicated acceptable predictions of field-scale variability in field capacity and wilting point but not of saturated conductivity. A comparison of point predictions from the new equations with previously developed equations reported in the literature showed improved prediction for all response variables. <p>  Theoretically sound procedures for probabilistic evaluation of NPS pollution models were developed by analogy with the goodness-of-fit testing procedure. The procedures do not require the assumption of normality of prediction errors for application, and may be used to assess model performance for both absolute and comparative predictions. A probabilistic index of model performance that is simple to calculate and interpret is proposed. The procedures were illustrated by application to the GLEAMS model using data from a short-term field study that examined pesticide fate and transport in a Coastal Plains soil under alternative tillage treatments.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:17:05Z (GMT). No. of bitstreams: 1 LD5655.V856_1995.K863.pdf: 5053654 bytes, checksum: bc236b71d8cd2be1e1f908c5d57f6216 (MD5)   Previous issue date: 1995-02-10",
  "format_medium": "BTD",
  "handle": "29190",
  "identifier_other": "etd-10042006-143856",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10042006-143856/",
  "identifier_uri": "http://hdl.handle.net/10919/29190",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1995.K863.pdf",
  "subject": "pollution modeling",
  "subject_lcc": "LD5655.V856 1995.K863",
  "title": "Parameter uncertainty in nonpoint source pollution modeling",
  "type": "Dissertation"
}