{
  "contributor_author": "Grover, Mansi",
  "contributor_committeechair": "Bosch, Darrell J.",
  "contributor_committeemember": [
    "Peterson, Everett B.",
    "Prisley, Stephen P.",
    "Amacher, Gregory S.",
    "Stephenson, Stephen Kurt"
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:17:06Z",
  "date_adate": "2005-10-14",
  "date_available": "2014-03-14T20:17:06Z",
  "date_issued": "2005-09-07",
  "date_rdate": "2006-10-14",
  "date_sdate": "2005-10-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A large number of concepts related to carbon offset trading policy are currently being discussed such as baseline, leakage, permanence, monitoring, verification, enforcement, financial feasibility, and third party verification. Cutting across these concepts are a variety of risks and uncertainties. These risks play a major role in developing effective market designs that achieve aggregate emission caps while encouraging market participation and investment in carbon reduction activities. What are the risks associated with carbon offset policy and how do such risks affect incentives for investing in carbon offsets? A literature review of carbon trading risks is developed. Risks associated with carbon offsets policy can be classified into three major categories: institutional/policy, project level and measurement risks. Institutional/policy risks are related to uncertainties surrounding the future policy decisions and the institutional arrangements established to define baselines, stipulate monitoring/enforcement requirements, and define and estimate leakage. Baseline estimates are necessary to calculate the net carbon reduction of a program or project. Monitoring/enforcement risk is associated with the regulators' ability to detect whether the promised carbon sequestration activities are undertaken. Leakage occurs when carbon sequestration at one site encourages increase in carbon emissions on some other site. Project risk refers to non-performance of a carbon sequestration project in terms of not achieving the requisite target of carbon sequestration. Project risk includes physical risk and financial risk. Physical risks are associated with unexpected carbon emissions due to natural hazards or events such as fire, or hurricanes or changes in the rate of sequestration, which depend on weather and pests. Landowners will not participate in carbon sequestration programs if they expect to incur financial losses by participating. Measurement risk arises because it is difficult to measure actual rates of carbon sequestered due to spatial and temporal heterogeneity of carbon present in agricultural and forest production. Forests are a principal carbon \"sink\" for sequestering carbon from the atmosphere. The provision of trading emission rights under the Kyoto Protocol will provide forest landowners the opportunity to reap financial gains from sequestering carbon and trading rights to emit carbon in carbon permit markets. However, landowners may be liable for repaying all or some of the proceeds received for sequestering carbon if stored carbon is released during the contract period. Hurricane damage to forests may cause extensive mortality and subsequent emission of carbon dioxide from decomposing biomass. Such liabilities may reduce landowners' incentives to sequester carbon. This research evaluates incentives of an individual forest landowner for sequestering and trading carbon, given the risk of carbon loss from hurricanes. Results of our simulation model reveal that the effect of hurricane risk on landowners' behavior depends on the variability of returns from carbon and timber and the ability of landowners to mitigate risk by diversifying forest holdings across regions with different sequestration rates and different hurricane strike probabilities. Some risk mitigation strategy might be required to create the necessary incentives for landowner participation especially in hurricane prone regions. We evaluate incentives of forest landowners for sequestering and trading carbon, given the risk of carbon loss from hurricanes, and an opportunity to insure their losses. Results of simulation model reveal that the effect of hurricane risk depends on the variability of returns from carbon and timber and landowners' ability to mitigate risk by diversifying forest holdings across regions or transferring risk by purchasing insurance. Although, landowner can spread the risk of carbon loss by diversifying into different regions, insurance has a role to play over and above diversification by reducing landowners' risk (variance) from forestry investments for sequestration and timber purposes, even when timber losses are not insured.",
  "description_provenance": [
    "Author Email: mgrover@vt.edu",
    "Advisor Email: bosch@vt.edu",
    "Advisor Email: petrsone@vt.edu",
    "Advisor Email: prisley@vt.edu",
    "Advisor Email: gamacher@vt.edu",
    "Advisor Email: kurts@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:06Z (GMT). No. of bitstreams: 1 Mansi_Grover_PhD_Thesis_Oct_2005_Final.pdf: 1116242 bytes, checksum: 9e44dfc5196e1fa0da615bbec4259736 (MD5)   Previous issue date: 2005-09-07"
  ],
  "handle": "29198",
  "identifier_other": "etd-10052005-231943",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10052005-231943/",
  "identifier_uri": "http://hdl.handle.net/10919/29198",
  "publisher": "Virginia Tech",
  "relation_haspart": "Mansi_Grover_PhD_Thesis_Oct_2005_Final.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Carbon Sequestration",
    "Risk",
    "Uncertainty",
    "Natural Disaster",
    "Emissions Trading",
    "Hurricane",
    "Insurance"
  ],
  "title": "Essays on Risk and Uncertainty in Greenhouse Gas Trading Markets",
  "type": "Dissertation"
}