{
  "contributor_author": "Hsu, Danny Chung",
  "contributor_committeechair": "Carlier, Paul R.",
  "contributor_committeemember": [
    "Kingston, David G. I.",
    "Etzkorn, Felicia A.",
    "Tanko, James M.",
    "Taylor, Larry T.",
    "Deck, Paul A."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:17:05Z",
  "date_adate": "2007-12-04",
  "date_available": "2014-03-14T20:17:05Z",
  "date_issued": "2007-09-18",
  "date_rdate": "2007-12-04",
  "date_sdate": "2007-10-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Memory of chirality (MOC) is an emerging strategy for asymmetric synthesis which relies upon the intermediacy of transiently non-racemic reactive species. In these reactions the configuration of the sole stereogenic center of the enantiopure starting material is \"memorized\" by a chiral non-racemic conformation in the intermediate; trapping then captures the stereochemical information, and generates a new stereogenic center with high fidelity. We experimentally and computationally studied the highly retentive deprotonation/alkylations of 1,4-benzodiazepin-2-ones (BZDs) that rely upon this strategy. We captured a transiently non-racemic BZD enolate intermediate in enantiopure form, then released the enolate and observed its subsequent reaction. This approach allowed the first ever step-wise observation of the stereochemical course of such a MOC process.    Approximately 2 million deaths are caused by malaria every year in the world. In total roughly 3.2 billion people are living under the risk of malaria transmission. Current use of anticholinesterase insecticides has been limited by their toxicity to human beings. A major African malaria insect vector, Anopheles gambiae (Ag), was targeted. Based on sequence alignment and homology models of AgAChE, a strategy of dual-site binding was adopted that targets Trp84 in the active site and Cys286 at the peripheral site. Selective AChE inhibitors have been designed and synthesized.",
  "description_provenance": [
    "Author Email: dhsu@vt.edu",
    "Advisor Email: dkingston@vt.edu",
    "Advisor Email: fetzkorn@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: pdeck@vt.edu",
    "Advisor Email: pcarlier@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:05Z (GMT). No. of bitstreams: 1 DannyHsuThesis.pdf: 4738387 bytes, checksum: f01e3ecb8e1d71f9ceb2243f4a1c4907 (MD5)   Previous issue date: 2007-09-18"
  ],
  "handle": "29192",
  "identifier_other": "etd-10042007-161139",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10042007-161139/",
  "identifier_uri": "http://hdl.handle.net/10919/29192",
  "publisher": "Virginia Tech",
  "relation_haspart": "DannyHsuThesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Asymmetric Synthesis",
    "Memory of Chirality",
    "Anopheles gambiae",
    "Sulfhydryl Reagents",
    "Free Cysteine Targeting",
    "Acetylcholinesterase",
    "Kinetics",
    "Freeze Frame Observation",
    "Enolate Chemistry",
    "1 4-Benzodiazepin-2-one",
    "Density Functional Theory"
  ],
  "title": "Mechanistic Studies on Memory of Chirality Alkylations of 1,4-Benzodiazepin-2-ones  &  Structure-based Design of Insecticidal AChE Inhibitors for Malaria Mosquito, Anopheles gambiae",
  "type": "Dissertation"
}