{
  "contributor_author": "Jarrett, Matthew Adam",
  "contributor_committeechair": "Thomas Ollendick",
  "contributor_committeemember": [
    "Scarpa-Friedman, Angela",
    "Kirby Deater-Deckard",
    "Kee Jeong Kim"
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:17:05Z",
  "date_adate": "2009-10-27",
  "date_available": "2014-03-14T20:17:05Z",
  "date_issued": "2009-09-25",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-10-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The current study evaluated a treatment designed specifically for children with attention-deficit/hyperactivity disorder (ADHD) and anxiety. The experimental treatment involved a combination of parent management training for ADHD and family-based treatment for anxiety. Sessions lasted approximately 90 minutes, and the treatment consisted of 10 weekly sessions. 8 children ages 8-12 with ADHD, Combined Type (ADHD-C) and at least one of three anxiety disorders (separation anxiety disorder, generalized anxiety disorder, social phobia) were selected for the study. Children were assessed with semi-structured diagnostic interviews and other standardized measures to determine study eligibility. The current study utilized a noncurrent multiple baseline design to evaluate treatment efficacy. Upon selection into the study, children were randomized to one of three baseline control conditions (i.e., 2, 3, or 4 weeks of waiting) in order to insure that change in behavior was associated with implementation of the treatment. Treatment commenced after the respective baseline periods. Families were assessed throughout treatment but more comprehensive assessments were conducted at pre-treatment, mid-treatment, and 1-week post-treatment. Results highlighted significant improvement in anxiety-related symptoms but more modest gains for ADHD-related symptoms.",
  "description_provenance": [
    "Author Email: mjarrett@vt.edu",
    "Advisor Email: ascarpa@vt.edu",
    "Advisor Email: kirbydd@vt.edu",
    "Advisor Email: keekim@vt.edu",
    "Advisor Email: tho@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:05Z (GMT). No. of bitstreams: 2 approvalletter.pdf: 254085 bytes, checksum: 1ea9405b95f7e39ed91d46c0f2456d95 (MD5) Jarrett_MA_D_2009.pdf: 3738009 bytes, checksum: f928fcd8e92093ecf33bc55b231dceb7 (MD5)   Previous issue date: 2009-09-25"
  ],
  "handle": "29194",
  "identifier_other": "etd-10042009-171427",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10042009-171427/",
  "identifier_uri": "http://hdl.handle.net/10919/29194",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "approvalletter.pdf",
    "Jarrett_MA_D_2009.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ADHD",
    "Anxiety",
    "Comorbidity",
    "Child Psychotherapy",
    "Attention-Deficit/Hyperactivity Disorder"
  ],
  "title": "The Treatment of Comorbid Attention-Deficit/Hyperactivity Disorder (ADHD) and Anxiety in Children",
  "type": "Dissertation"
}