{
  "contributor_author": "Lin, Fang",
  "contributor_committeechair": "Bodnar, Robert J.",
  "contributor_committeemember": [
    "Read, James Fredrick",
    "Dove, Patricia M.",
    "Sum, Amadeu K.",
    "Schreiber, Madeline E."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:17:07Z",
  "date_adate": "2005-10-21",
  "date_available": "2014-03-14T20:17:07Z",
  "date_issued": "2005-09-23",
  "date_rdate": "2005-10-21",
  "date_sdate": "2005-10-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The system H₂O-CH₄ is found in a variety of geological environments in the earth’s crust, from sedimentary basins to low grade metamorphic terrains. Knowledge of the PressureVolume-Temperature-Composition (PVTX) properties of the H₂O-CH₄ system is necessary to understand the role that these fluids play in different geological environments. In this study the properties of the H₂O-CH₄ fluid system at elevated temperatures and pressures has been investigated experimentally to determine the PVTX properties of H₂O-CH₄ fluids in the P-T range equivalent to late diagenetic to low grade metamorphic environments, and XCH₄≤4mol%. A study has also been conducted to determine methane hydrate stability over the temperature range of -40~20°C. Synthetic fluid inclusions were employed in both studies as miniature autoclaves.   Experimental data for the PVTX properties of H₂O-CH₄ fluids under late diagenetic to low grade metamorphic conditions was used to calculate the slopes of isoTh lines (the line connecting the P-T conditions of the inclusions at formation and at homogenization) at different PTX conditions. An empirical equation to describe the slope of iso-Th line as a function of homogenization temperature and fluid composition was developed. The equation is applicable to natural H₂O-CH₄ fluid inclusions up to 500°C and 3 kilobars, for fluid compositions ≤4 mol% CH₄.   The Raman peak position of CH₄ gas is a function of the pressure and temperature. This relationship was used to determine the pressure along the methane hydrate stability curve in the H₂O-CH₄ system. The combined synthetic fluid inclusion, microthermometry and Raman spectroscopy method is a novel experimental approach to determine the P-T stability conditions of methane hydrates. The method is fast compared to conventional methods, and has the potential to be applied to study other gas hydrate systems.",
  "description_provenance": [
    "Author Email: flin@vt.edu",
    "Advisor Email: rjb@vt.edu",
    "Advisor Email: jread@vt.edu",
    "Advisor Email: dove@vt.edu",
    "Advisor Email: asum@vt.edu",
    "Advisor Email: mschreib@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:07Z (GMT). No. of bitstreams: 1  FLin_Dissertation.pdf: 1226993 bytes, checksum: 3e3ac12408275300c3c96880e4504a34 (MD5)    Previous issue date: 2005-09-23"
  ],
  "handle": "29205",
  "identifier_other": "etd-10062005-222419",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10062005-222419/",
  "identifier_uri": "http://hdl.handle.net/10919/29205",
  "publisher": "Virginia Tech",
  "relation_haspart": "FLin_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "synthetic fluid inclusions",
    "Raman spectroscopy",
    "methane hydrate",
    "H₂O-CH₄ system",
    "PVTX properties",
    "phase equilibria"
  ],
  "title": "Experimental Study of the PVTX Properties of the System H₂O-CH₄",
  "type": "Dissertation"
}