{
  "contributor_author": "Asare, Ted Ankomahene",
  "contributor_committeechair": "Kampe, Stephen L.",
  "contributor_committeemember": [
    "Reynolds, William T. Jr.",
    "Aning, Alexander O.",
    "Pickrell, Gary R.",
    "Schultz, Jeffery P."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:17:07Z",
  "date_adate": "2007-10-22",
  "date_available": "2014-03-14T20:17:07Z",
  "date_issued": "2007-09-26",
  "date_rdate": "2007-10-22",
  "date_sdate": "2007-10-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Ferroelectric and piezoelectric ceramic reinforced metal matrix composites are new materials being explored for vibration damping purposes.  The high damping ability of ferroelectric and piezoelectric ceramics such as barium titanate (BaTiO3) and lead zirconate titanate (PZT) is due to the anelastic response of ferroelastic domain walls to applied external stress.  In piezoelectric ceramics, vibration energy can also be dissipated through the direct piezoelectric effect if the appropriate electric circuit is connected across the ceramic. In this work we have examined the vibration damping behavior of BaTiO3, nickel-barium titanate (Ni-BaTiO3) composites and nickel-lead zirconate titanate (Ni-PZT) composites.  BaTiO3 ceramics were fabricated by a combination of uniaxial pressing and cold isostatic pressing followed by sintering in air.  Low frequency (0.1Hz-10Hz) damping capacity of BaTiO3, tanδ has been measured in three-point bend configuration on a dynamic mechanical analyzer.  Tanδ has been found to increase with temperature up to the Curie temperature (Tc) of BaTiO3, after which there was a drop in damping capacity values due to the disappearance of ferroelectric domains above Tc.  Furthermore within the frequency range tested, tanδ has been found to decrease with increasing vibration frequency.  We also observed that tanδ decays with the number of vibration cycles (N).  The decrease in tanδ with N, however, is fully recovered if BaTiO3 is heated above the Tc. Ni-BaTiO3 composite composed of a layer of BaTiO3 ceramic sandwiched between two layers of Ni were fabricated using a combination of electroless plating and electroforming.  The damping behavior of the composite was analyzed in terms of the damping mechanisms below Tc and the damping mechanisms above Tc of BaTiO3.  Below Tc, vibration damping ability of the composite was highly influenced by ferroelastic damping in the BaTiO3 component.  Above the Curie temperature, the damping capacity was influence more by the inherent damping mechanisms in the nickel matrix. The damping mechanisms in Ni-PZT composites were evaluated at a low vibration frequency of 1Hz.  In these composites we identified ferroelastic domain wall motion as the main damping mechanism active below the Tc of PZT.  Using a poled PZT ceramic enhanced the damping capacity of the composite because of favorable ferroelastic domain orientation in the direction of applied stress.  Based on our experimental results, we found no evidence of a direct piezoelectric damping mechanism in the Ni-PZT composites.",
  "description_provenance": [
    "Author Email: asare@vt.edu",
    "Advisor Email: kampe@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: aaning@vt.edu",
    "Advisor Email: pickrell@vt.edu",
    "Advisor Email: jeschult@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:07Z (GMT). No. of bitstreams: 1 ETD-FINAL.pdf: 6618551 bytes, checksum: 721b8ed579f825ea9e0a14297a4d1ec7 (MD5)   Previous issue date: 2007-09-26"
  ],
  "handle": "29208",
  "identifier_other": "etd-10062007-151616",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10062007-151616/",
  "identifier_uri": "http://hdl.handle.net/10919/29208",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD-FINAL.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "damping capacity",
    "ferroelasticity",
    "ferroelectricity",
    "piezoelectricity",
    "barium titanate",
    "metal matrix composites"
  ],
  "title": "Investigating Ferroelastic and Piezoelectric Vibration Damping Behavior in Nickel-Barium Titanate and Nickel-PZT Composites",
  "type": "Dissertation"
}