{
  "contributor_author": "Hogan, Eric Philip",
  "contributor_committeechair": "Griffin, Gary J.",
  "contributor_committeemember": [
    "McDowell, John M.",
    "Stipes, R. Jay",
    "Elkins, John Rush",
    "Eisenback, Jonathan D."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:17:07Z",
  "date_adate": "2006-11-28",
  "date_available": "2014-03-14T20:17:07Z",
  "date_issued": "2006-09-25",
  "date_rdate": "2007-11-28",
  "date_sdate": "2006-10-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In the early 1900's the American chestnut (Castanea dentata (Marsh.) Borkh.) was nearly destroyed by the introduction of the orange-pigmented, chestnut blight fungus (Cryphonectria parasitica (Murr.) Barr). Chestnut blight is less severe in Europe, where hypovirulent (= reduced virulence) strains of the fungus are found to be associated with healing cankers.  These European hypovirulent strains are infected with a dsRNA virus, Cryphonectria hypovirus 1 (CHV1), and have a white phenotype when grown in culture.  Transmission of CHV1 in C. parasitica is limited by incompatibility between isolates in different vegetative compatibility (vc) types.  In 1982-83, naturally formed blight cankers on American chestnut grafts, derived from large survivors, were inoculated with a mixture of four European (white) hypovirulent strains of C. parasitica.  After 14 years the white strains were recovered throughout the inoculated grafts, which had low levels of blight damage.  CHV1 had infected at least 45 new vc types, and was present in four different fungal colony morphology groups, including one type that had intermediate or partial pigmentation.  However, CHV1 was unable to move throughout a single vc type within a natural canker.  The objectives of this study were: 1) to determine the frequency and phenotypic diversity of CHV1-infected C. parasitica isolates recovered from stromata and canker tissue from natural cankers on the grafted American chestnut trees and artificially established cankers on forest American chestnuts; 2) to determine the presence or absence of CHV1 in intermediate-pigmented isolates recovered from the American chestnut research plots; 3) to investigate the roles of colony age, resistance to hypovirus infection, and functional mycelial units in the failure of CHV1 to move throughout a vc type of C. parasitica in vitro, and; 4) to examine the role of low temperatures and a high elevation topographic site on CHV1 survival within C. parasitica colonies in vivo and in vitro.  The results indicated that there was no direct correlation between the amount of colony pigmentation and the presence of dsRNA.  Within each of the three colony phenotype categories (pigmented, intermediate and white), several C. parasitica isolates tested positive for the presence of CHV1.  This presence of CHV1 in intermediate isolates, coupled with the relatively large number of intermediate isolates collected from stromata on cankers, indicates that intermediate isolates may perform an important, and previously overlooked, function in biological control of chestnut blight.  In this study, all CHV1 movement trials indicated that the age of the C. parasitica colony limited the movement of CHV1 throughout the colony.  The majority of the CHV1 movement through a C. parasitica colony occurred between 0 and 7 days following challenge with an isogenic CHV1-infected strain.  Isolation data using a lattice grid did not indicate a consistent pattern of CHV1 movement throughout a C. parasitica colony.  Low temperatures associated with high altitude had no effect on hypovirus survival in vivo or in vitro.  Additionally, no long-term C. parasitica resistance to CHV1 infection or movement was identified in this study.  This research has identified new insights into CHV1 spread and survival that may be important in understanding the role of CHV1 in the biological control of chestnut blight.",
  "description_provenance": [
    "Author Email: ehogan@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Advisor Email: treedr@vt.edu",
    "Advisor Email: jrelkins@suddenlink.net",
    "Advisor Email: gagriffi@vt.edu",
    "Advisor Email: Jon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:07Z (GMT). No. of bitstreams: 6 TITLE_and_TABLE_of_CONTENTS.pdf: 31880 bytes, checksum: 3ba7af24ec0c166a21f0ae5b3e457f1f (MD5) Chapter_3_CHV1_MOVEMENT.pdf: 543024 bytes, checksum: 98e1ff53cd321848f49d77952acb10d3 (MD5) APPENDIX_and_VITA.pdf: 43479 bytes, checksum: d134fa99e1841052f85206235490a20c (MD5) Chapter_4_LITERATURE_CITED.pdf: 33179 bytes, checksum: 54c9b0703b2deccd1b04107bae068ce3 (MD5) Chapter_1_LITERATURE_REVIEW.pdf: 69072 bytes, checksum: fe76be99eedec3544c7cc9ce1f37992e (MD5) Chapter_2_CHV1_SPREAD.pdf: 544065 bytes, checksum: 995ea0e616a678ea6626c3094c0870a8 (MD5)   Previous issue date: 2006-09-25"
  ],
  "handle": "29207",
  "identifier_other": "etd-10062006-113104",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10062006-113104/",
  "identifier_uri": "http://hdl.handle.net/10919/29207",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "TITLE_and_TABLE_of_CONTENTS.pdf",
    "Chapter_3_CHV1_MOVEMENT.pdf",
    "APPENDIX_and_VITA.pdf",
    "Chapter_4_LITERATURE_CITED.pdf",
    "Chapter_1_LITERATURE_REVIEW.pdf",
    "Chapter_2_CHV1_SPREAD.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "functional mycelium units",
    "chestnut",
    "spread",
    "cankers",
    "Cryphonectria hypovirus 1",
    "fungi",
    "stromata",
    "colony morphology",
    "CHV1-Euro7",
    "intermediate phenotype",
    "resistance",
    "reproduction",
    "population biology",
    "hypovirus movement",
    "trees",
    "Cryphonectria parasitica",
    "temperature"
  ],
  "title": "Population biology of Cryphonectria parasitica infected with Cryphonectria hypovirus 1 on American chestnut trees",
  "type": "Dissertation"
}