{
  "contributor_author": "Shah, Sanjay Bikram",
  "contributor_committeechair": "Wolfe, Mary Leigh",
  "contributor_committeemember": [
    "Dillaha, Theo A. III",
    "Mostaghimi, Saied",
    "Persaud, Naraine",
    "Borggaard, Jeffrey T.",
    "Alley, Marcus M."
  ],
  "contributor_department": "Biological Systems Engineering",
  "date_accessioned": "2014-03-14T20:17:06Z",
  "date_adate": "2000-10-24",
  "date_available": "2014-03-14T20:17:06Z",
  "date_issued": "2000-08-02",
  "date_rdate": "2001-10-24",
  "date_sdate": "2000-10-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Agronomic and water quality impacts of urea particle size were evaluated through field and laboratory experiments and mathematical modeling.  In a two-year field study, corn silage yield, corn nitrogen (N) removal, and nitrate-N (N0<sup>3</sup>-N) leaching from urea pellets (1.5 g each) and granules (0.01-0.02 g each) applied at 184 kg-N/ha were compared.  A control treatment (no N) and two other N application rates (110 and 258 kg-N/ha) were also included.  Urea particle size impact on dissolution rate, dissolved urea movement, mineralization, and N0<sup>3</sup>-N leaching were evaluated in the laboratory.  A two-dimensional (2-D) mathematical model was developed to simulate the fate of subsurface-banded urea and its transformation products, ammonium (NH<sup>4</sup>)and NO<sup>3</sup>.<p>   With 184 kg-N/ha, corn silage yield was 15% higher (p = 0.02) and corn N removal was 19% higher (p = 0.07) with pellets than granules in the second year of the field study.  In the absence of yield response at 110 kg-N/ha, reason for higher yield at 184 kg-N/ha with pellets was unclear.  Greater N removal reduced N0<sup>3</sup>-N leaching potential from pellets compared to granules during the over-winter period.  No urea form response to yield or corn N removal was observed in the first year.  In 23 of 27 sampling events, granules had higher N0<sup>3</sup>-N concentration in the root zone than pellets, with average nitrate-N concentrations of 2.6 and 2.2 mg-N/L, respectively. However, statistically, N0<sup>3</sup>-N leaching from the root zone was unaffected by urea form, probably due to high variability within treatments masking the treatment effects.  In October 1997, pellets retained 16% more (p = 0.04) inorganic-N in the top half of the root zone than granules, due to slower nitrification in pellets as was determined in the mineralization study.  Slower N0<sup>3</sup>-N leaching allowed for greater N extraction by plants.  Pellets had lower dissolution, urea hydrolysis, and nitrification rates than granules; however, nitrification inhibition was the dominant mechanism controlling N fate.<p>  The model took into account high substrate concentration effects on N transformations, important for simulating the fate of band-applied N.  The model exhibited good mass conservative properties, robustness, and expected moisture and N distribution profiles.  Differences in measured field data and model outputs were likely due to uncertainties and errors in measured data and input parameters.  Model calibration results indicated that moisture-related parameters greatly affected N fate simulation.  Sensitivity analyses indicated the importance of nitrification-related parameters in N simulation, particularly, their possible multiplicative effects.  Need for extensive model testing and validation was recognized.  The validated 2-D N model could be incorporated into a management model for better management of subsurface-banded granular N.  However, the 2-D model is not appropriate for simulating the three dimensional N movement from pellets.",
  "description_provenance": [
    "Author Email: sashah2@vt.edu",
    "Advisor Email: mlwolfe@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:06Z (GMT). No. of bitstreams: 1 etd.pdf: 1832057 bytes, checksum: 8771dae071a7460d079221edb6feb77e (MD5)   Previous issue date: 2000-08-02"
  ],
  "handle": "29201",
  "identifier_other": "etd-10062000-15170004",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10062000-15170004/",
  "identifier_uri": "http://hdl.handle.net/10919/29201",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "corn silage yield",
    "mathematical modeling",
    "pellet",
    "tension lysimeter",
    "subsurface banding"
  ],
  "title": "Agronomic and Nitrate Leaching Impacts of Pelletized versus Granular Urea",
  "type": "Dissertation"
}