{
  "contributor_author": "Haas, Matthew Steven",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Janosik, Steven M.",
    "Yakimowski-Srebnick, Mary E.",
    "Parson, Stephen R.",
    "Tonelson, Louis O."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:17:07Z",
  "date_adate": "2002-10-10",
  "date_available": "2014-03-14T20:17:07Z",
  "date_issued": "2002-09-09",
  "date_rdate": "2003-10-10",
  "date_sdate": "2002-10-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Given Virginia's Standards of Learning (SOL)(1995) mandates, Virginia's Algebra I teachers and school leaders should utilize research for teaching methods; further, the relationship between teaching methods and student achievement on Virginia's End of Course SOL Test for Algebra I deserves investigation, since Virginia's students must pass this test to earn verified credit toward high school graduation.       Replicating Marcucci's (1980) methodology for meta-analysis, the present study focuses on research with methods for teaching secondary level algebra from 1980 to 2001. From a sample of 34 studies with 62 effect sizes, six categories for teaching methods and corresponding effect sizes were derived for \"good\" studies: direct instruction (.67), problem-based learning (.44), technology aided instruction (.41), cooperative learning (.26), manipulatives, models, and multiple representations (.23), and communication and study skills (.16).        Using results from the meta-analysis and review of literature and extensive content validation, a 51-item questionnaire with a reliability coefficient of .89 was developed. The questionnaire was posted as a web-site to survey selected Algebra I teachers in Region VII to ascertain how frequently they use research-based teaching methods and to determine the influence of teaching methods on their students' achievement on the spring, 2002, Algebra I SOL Test.       Ninety-eight percent of teachers surveyed responded. The 53 participating Algebra I teachers, representing 1,538 students, produced a passing mean scale score of 438.01  (SD = 32.67). Teachers indicated they used all teaching method categories more than half the time with mean usage frequencies ranging from 2.56 to 3.75 times out of five class sessions. Teaching method categories were then entered into a blockwise multiple regression analysis, ranked according to the strength of their correlations to teachers' mean scale SOL test scores. Teaching method usage shared 9.7% of variance with participating teachers' scores. \t      Meta- and regression analysis results suggest that Algebra I teachers should emphasize direct instruction, technology aided instruction, and problem-based learning. These three teaching method categories ranked highest in both analyses. The questionnaire developed here could be used with a larger sample for research into the influence of teaching methods on individual reporting categories on the Algebra I SOL test.",
  "description_provenance": [
    "Author Email: matthaas@scsb.org",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: myakimowski@bcps.k12.va.us",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: ltonelso@vbcps.k12.va.us",
    "Made available in DSpace on 2014-03-14T20:17:07Z (GMT). No. of bitstreams: 2 HAASDISSERTATION.PDF: 1014986 bytes, checksum: 2e4d522cfd714521e36ce630470b68a3 (MD5) Correction_to_Figure_9_on_Page_98.pdf: 7756 bytes, checksum: 3d7e25952dfc219fc1a54e6ccf28df14 (MD5)   Previous issue date: 2002-09-09"
  ],
  "handle": "29203",
  "identifier_other": "etd-10062002-202857",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10062002-202857/",
  "identifier_uri": "http://hdl.handle.net/10919/29203",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "HAASDISSERTATION.PDF",
    "Correction_to_Figure_9_on_Page_98.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Teaching Methods",
    "Achievement",
    "Instructional Practices",
    "Algebra"
  ],
  "title": "The Influence of Teaching Methods on Student Achievement on Virginia's End of Course Standards of Learning Test for Algebra I",
  "type": "Dissertation"
}