{
  "contributor_author": "Ison, Molly E.",
  "contributor_committeechair": "Haskell, Peter E.",
  "contributor_committeemember": [
    "Brown, Ezra A.",
    "Farkas, Daniel R."
  ],
  "contributor_department": "Mathematics",
  "date_accessioned": "2014-03-14T20:17:09Z",
  "date_adate": "2005-11-01",
  "date_available": "2014-03-14T20:17:09Z",
  "date_issued": "2005-10-07",
  "date_rdate": "2005-11-01",
  "date_sdate": "2005-10-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Master of Science",
  "description_abstract": "A graph configuration space is generated by the movement of a finite number of robots on a graph. These configuration spaces of points in a graph are topologically interesting objects. By using local, combinatorial properties, we define a new classification of graphs whose configuration spaces are pseudomanifolds with boundary. In algebraic topology, graph configuration spaces are closely related to classical braid groups, which can be described as fundamental groups of configuration spaces of points in the plane. We examine this relationship by finding a presentation for the fundamental group of one graph configuration space.",
  "description_provenance": [
    "Author Email: eponiner@yahoo.com",
    "Advisor Email: brown@math.vt.edu",
    "Advisor Email: farkas@math.vt.edu",
    "Advisor Email: haskell@math.vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:09Z (GMT). No. of bitstreams: 1 Molly_Ison_thesis.pdf: 797301 bytes, checksum: 45f360896f951ed97dbda05b34f227f1 (MD5)   Previous issue date: 2005-10-07"
  ],
  "handle": "29214",
  "identifier_other": "etd-10072005-173425",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10072005-173425/",
  "identifier_uri": "http://hdl.handle.net/10919/29214",
  "publisher": "Virginia Tech",
  "relation_haspart": "Molly_Ison_thesis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fundamental group",
    "pseudomanifold with boundary",
    "manifold",
    "braid group",
    "graph",
    "configuration space"
  ],
  "title": "Two Aspects of Topology in Graph Configuration Spaces",
  "type": "Dissertation"
}