{
  "contributor_author": "Huang, Zhenyu",
  "contributor_committeechair": "Marand, Hervé L.",
  "contributor_committeemember": [
    "Long, Timothy E.",
    "Crawford, Daniel T.",
    "Ducker, William A.",
    "Esker, Alan R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:17:08Z",
  "date_adate": "2004-11-04",
  "date_available": "2014-03-14T20:17:08Z",
  "date_issued": "2004-09-24",
  "date_rdate": "2004-11-04",
  "date_sdate": "2004-10-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The crystallization and melting behavior of linear polyethylene and of a series of random ethylene/styrene copolymers was investigated using a combination of classical and temperature modulated differential scanning calorimetry. In the case of linear polyethylene and low styrene content copolymers, the temporal evolutions of the melting temperature, degree of crystallinity, and excess heat capacity were studied during crystallization. The following correlations were established: 1) the evolution of the melting temperature with time parallels that of the degree of crystallinity, 2) the excess heat capacity increases linearly with the degree of crystallinity during primary crystallization, reaches a maximum during the mixed stage and decays during secondary crystallization, 3) the rates of shift of the melting temperature and decay of the excess heat capacity lead to apparent activation energies that are very similar to these reported for the crystal ac relaxation by other techniques. Strong correlations in the time domain between the secondary crystallization and the evolution of the excess heat capacity suggest that the reversible crystallization/melting phenomenon is associated with molecular events in the melt-crystal fold interfacial region.  \tIn the case of higher styrene content copolymers, the multiple melting behavior at high temperature is investigated through studies of the overall crystallization kinetics, heating rate effects and partial melting. Low melting crystals can be classified into two categories according to their melting behavior, superheating and reorganization characteristics. Low styrene content copolymers still exhibit some chain folded lamellar structure. The shift of the low melting temperature with time in this case is tentatively explained in terms of reorganization effects. Decreasing the crystallization temperature or increasing the styrene content leads to low melting crystals more akin to fringed-micelles. These crystals exhibit a lower tendency to reorganize during heating. The shift of their melting temperature with time is attributed to a decrease in the conformational entropy of the amorphous fraction as a result of constraints imposed by primary and secondary crystals.   To further understand the mechanism of formation of low melting crystals, quasi-isothermal crystallization experiments were carried out using temperature modulation. The evolution of the excess heat capacity was correlated with that of the melting behavior. On the basis of these results, it is speculated that the generation of excess heat capacity at high temperature results from reversible segmental exchange on the fold surface. On the other hand, the temporal evolution of the excess heat capacity at low temperature for high styrene content copolymers is attributed to the reversible segment attachment and detachment on the lateral surface of primary crystals. The existence of different mechanisms for the generation of excess heat capacity in different temperature ranges is consistent with the observation of two temperature regimes for the degree of reversibility inferred from quasi-isothermal melting experiments.  In a second project, the chain length and temperature dependences of spherulitic growth rates were studied for a series of narrow fractions of poly(ethylene oxide) with molecular weight ranging from 11 to 917 kg/mol. The crystal growth rate data spanning crystallization temperatures in regimes I and II was analyzed using the formalism of the Lauritzen-Hoffman (LH) theory. Our results are found to be in conflict with predictions from LH theory. The Kg ratio increases with molecular weight instead of remaining constant. The chain length dependence of the exponential prefactor, G0, does not follow the power law predicted by Hoffman and Miller (HM). On this basis, the simple reptation argument proposed in the HM treatment and the nucleation regime concept advanced by the LH model are questioned. We proposed that the observed I/II regime transition in growth rate data may be related to a transition in the friction coefficient, as postulated by the Brochard-de Gennnes slippage model. This mechanism is also consistent with recent calculations published by Toda in which both the rates of surface nucleation and substrate completion processes exhibit a strong temperature dependence.",
  "description_provenance": [
    "Author Email: szhzy@yahoo.com",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: crawdad@vt.edu",
    "Advisor Email: wducker@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: hmarand@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:08Z (GMT). No. of bitstreams: 10 cover.pdf: 73001 bytes, checksum: da20185960e0e845fc728fb21d0a1fd7 (MD5) Vita.pdf: 51371 bytes, checksum: fa708b78578b9dc586ea0a0fb30c8a88 (MD5) Chapter7.pdf: 120441 bytes, checksum: 8f2dacb1bc687e681e0c4867726709d8 (MD5) Chapter3.pdf: 475138 bytes, checksum: f67fc8c2b6b2b1f24b856774470e077c (MD5) Chapter5.pdf: 1262792 bytes, checksum: 1d32a467200c462440d949aa7bf67587 (MD5) Chapter6.pdf: 884773 bytes, checksum: 612cee49ba72e6d3eb1a63df1ffe13e0 (MD5) Chapter4.pdf: 1041094 bytes, checksum: 0baa3f0d9366c854a432111f25f84fbc (MD5) Abstract&List.pdf: 255454 bytes, checksum: 297197d6306a905bcc5da0d1d17a8fd2 (MD5) Chapter1.pdf: 103270 bytes, checksum: c38fb33f300615d17604a54b75d622de (MD5) Chapter2.pdf: 449068 bytes, checksum: 2a00022aec508087b90f2b7b0743ccde (MD5)   Previous issue date: 2004-09-24"
  ],
  "handle": "29211",
  "identifier_other": "etd-10072004-055504",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10072004-055504/",
  "identifier_uri": "http://hdl.handle.net/10919/29211",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "cover.pdf",
    "Vita.pdf",
    "Chapter7.pdf",
    "Chapter3.pdf",
    "Chapter5.pdf",
    "Chapter6.pdf",
    "Chapter4.pdf",
    "Abstract&List.pdf",
    "Chapter1.pdf",
    "Chapter2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Poly(ethylene oxide)",
    "Polyethylene",
    "Ethylene/styrene Copolymer",
    "Reptation",
    "Brochard-de Gennes model",
    "Lauritzen-Hoffman Theory",
    "Reversible Crystallization and Melting",
    "Secondary Crystallization",
    "Polymer Crystallization"
  ],
  "title": "Crystallization and Melting Behavior of                              Linear Polyethylene and Ethylene/Styrene Copolymers and Chain Length Dependence of Spherulitic Growth Rate for Poly(Ethylene Oxide) Fractions",
  "type": "Dissertation"
}