{
  "contributor_author": "Mohemkar-Kheirandish, Reza",
  "contributor_committeechair": "Haller, Hans H.",
  "contributor_committeemember": [
    "Salehi-Isfahani, Djavad",
    "Kats, Amoz",
    "Tideman, Thorwald Nicolaus",
    "Gilles, Robert P."
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:17:09Z",
  "date_adate": "2008-10-27",
  "date_available": "2014-03-14T20:17:09Z",
  "date_issued": "2008-08-15",
  "date_rdate": "2009-10-27",
  "date_sdate": "2008-10-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "</p><p>This dissertation consists of three essays. In the first one (Chapter three), â  Gains and Losses from Household Formation,â   I introduce a general equilibrium model, wherein a household may consist of more than one member, each with their own preferences and endowments. In these models at first, individuals form households. Then, collective decisions (or bargaining) within the household specifies the consumption plans of household members. Finally, competition across households determines a feasible allocation of resources. I consider a model with two types of individuals and pure group externalities. I investigate the competitive equilibrium allocation and stability of the equilibrium in that setting. Specifically, I show that under a certain set of assumptions a competitive equilibrium with free exit is also a competitive equilibrium with free household formation. Similar results are obtained for a special case of consumption externality. Illustrative examples, where prices may change as household structures change, are used to show how general equilibrium model with variable household structure works and some interesting results are discussed at the end of the first essay.  </p><p>\tIn the second essay (Chapter four), â  Effects of the Price System on Household Labor Supply,â   I introduce leisure and labor into the two-type economy framework that was constructed in the first essay. The main objective of this essay is to investigate the effects of exogenous prices on the labor supply decisions, and completely analyze the partial equilibrium model outcomes in a two-type economy setting. I assume a wage gap and explore the effect of that gap on labor supply. The main content of the second essay is the analysis of the effect of change in wages, price of the private good, power of each individual in the household, relative importance of private consumption compared to leisure, and the level of altruism on individualâ  s decisions about how much private good or leisure he/she wants to consume. The effect of a relative price change on labor supply, private consumption and utility level is also investigated. Moreover, one of the variations of Spenceâ  s signaling model is borrowed to explain why higher education of women in Iran does not necessarily translate into higher female labor force participation. Finally, fixed point theorem is used to calculate the power (or alternatively labor supply) of individuals in the household endogenously for the two-type economy with labor at the end of this essay.   \t</p><p>In the third essay (Chapter five), â  Dynamics of Poverty in Iran: What Are the Determinants of the Probability of Being Poor?,â   I explore the characteristics of the households who fall below the poverty line and stay there as well as those who climb up later. I decompose poverty in Iran into chronic and transient poverty, and investigate the relation of each component of poverty with certain characteristics of households. I also study mobility and the main characteristics of growth in expenditure of households. One of the main issues in economic policy making nowadays is the evaluation of effectiveness of anti-poverty programs. In order to achieve this goal one should be able to track down a household for a period of time.  In this essay, I am going to investigate the dynamics of poverty in Iran during 1992-95. I am especially interested in finding the characteristics of the households that fall below the poverty line and stay there in addition to those that climb up later. Obviously, if policy-makers want to have efficient policies to reduce poverty, they should target the former group.  I decompose poverty in Iran into chronic and transient poverty, and investigate the relation of each component of poverty with certain characteristics of households. I also study mobility in this period with an emphasis on mobility in and out of poverty and review the main characteristics of the growth in expenditure of households. </p>",
  "description_provenance": [
    "Author Email: rkheiran@vt.edu",
    "Advisor Email: haller@vt.edu",
    "Advisor Email: salehi@vt.edu",
    "Advisor Email: amoz@vt.edu",
    "Advisor Email: ntideman@vt.edu",
    "Advisor Email: rgilles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:09Z (GMT). No. of bitstreams: 1 ETD-103108.pdf: 422305 bytes, checksum: 3bde795fac7a9e2c39ca97a1cdb9fb0b (MD5)   Previous issue date: 2008-08-15"
  ],
  "handle": "29215",
  "identifier_other": "etd-10072008-001313",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10072008-001313/",
  "identifier_uri": "http://hdl.handle.net/10919/29215",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD-103108.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Mobility",
    "Transition Matrix",
    "Externality",
    "Household",
    "Decision Making",
    "Labor Supply",
    "Equilibrium",
    "Stability",
    "Poverty",
    "Private Consumption",
    "Labor Force Participation rate",
    "Chronically Poor",
    "Transitory Poor",
    "Dynamics",
    "Two-type economy"
  ],
  "title": "Intra-Household Decision Making",
  "type": "Dissertation"
}