{
  "contributor_author": "Woffenden, Bonnie Jean",
  "contributor_committeechair": "Beers, Eric P.",
  "contributor_committeemember": [
    "Veilleux, Richard E.",
    "Welbaum, Gregory E.",
    "Winkel, Brenda S. J.",
    "Hess, John L."
  ],
  "contributor_department": "Horticulture",
  "date_accessioned": "2014-03-14T20:17:11Z",
  "date_adate": "1999-04-11",
  "date_available": "2014-03-14T20:17:11Z",
  "date_issued": "1999-09-14",
  "date_rdate": "2000-04-11",
  "date_sdate": "1999-10-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A biochemical characterization of ubiquitin (Ub)-proteasome pathway activity was conducted in <I>Zinnia</I> mesophyll cell cultures to examine potential differences between differentiating cells of tracheary element (TE) cultures and non-differentiating cells of control cultures.  The pathway is highly active throughout development of differentiating TEs, a programmed cell death (PCD) process during which the majority of cellular proteins and biochemical processes are expected to be down-regulated in activity and/or expression.  Addition of the proteasome inhibitors <I>clasto</I>-lactacystin Beta-lactone (LAC) and carbobenzoxy-leucinyl-leucinyl-leucinal (LLL) at culture initiation prevented TE differentiation in this system.  Proteasome inhibition at 48h did not alter the final percentage of TEs compared to controls.  However, proteasome inhibition at 48 h delayed the differentiation program by approximately 24 h, as indicated by examination of morphological markers and the expression of putative autolytic cysteine proteases.These results suggest that proteasome activity is required both for induction of TE differentiation and for progression of the TE program in committed cells.  Treatment at 48 h with LLL resulted in partial uncoupling of autolysis from differentiation.  Results of protease activity gel analysis suggest that incomplete autolysis was due to the ability of LLL to inhibit TE cysteine proteases. <p>A characterization of phytohormone-stimulated growth of non-differentiating cultured <I>Zinnia</I> cells is also presented.  Differential effects on radial cell expansion versus cell elongation were observed for the four plant growth regulators examined.  Auxin (naphthaleneacetic acid, NAA) and a brassinosteroid (2,4-epibrassinolide, BI) stimulate only cell elongation.  Cytokinin (N-6-benzyladenine, BA) has a greater effect on growth in cell girth rather than length.  Gibberellic acid (GA<sub>3</sub>) has equivalent effects on expansion in both dimensions.  These results demonstrate that radial cell expansion and cell elongation can be uncoupled, and therefore, may be controlled by different mechanisms.  Additionally, this study establishes the utility of <I>Zinnia</I> suspension cultures as a valuable model for studies of cell expansion. <p>Finally, we modified <I>Arabidopsis</I> plant growth conditions to promote proliferation of secondary tissues, permitting the separation of secondary xylem from bark (phloem plus nonvascular) tissues using hypocotyl-root segments.  Dissected tissues were used for semi-quantitative and quantitative RT-PCR and for the construction of bark and xylem cDNA libraries for PCR-based screening of several Ub pathway components, including Ub-conjugating enzymes (<I>UBCs</I>), deubiquitinating enzymes (DUBs), and an Alpha (<I>PAF1</I>) and Beta (<I>PAF1</I>) subunit of the proteasome.  All targeted <I>UBC</I> families, candidate <I>UBCs</I> and DUBs, and proteasome subunits are expressed in secondary xylem and bark in this system.",
  "description_provenance": [
    "Author Email: bwoffend@vt.edu",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: welbaum@vt.edu",
    "Advisor Email: ebeers@vt.edu",
    "Advisor Email: shirley@vt.edu",
    "Advisor Email: jlhess@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:11Z (GMT). No. of bitstreams: 1 BWETD.PDF: 6850623 bytes, checksum: e26d24b2a0302b512f00f42a76fa11a9 (MD5)   Previous issue date: 1999-09-14"
  ],
  "handle": "29220",
  "identifier_other": "etd-100799-151033",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-100799-151033/",
  "identifier_uri": "http://hdl.handle.net/10919/29220",
  "publisher": "Virginia Tech",
  "relation_haspart": "BWETD.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "<I>Zinnia elegans</I>",
    "proteasome",
    "<I>Arabidopsis thaliana</I>",
    "tracheary element",
    "xylem",
    "proteolysis",
    "programmed cell death",
    "ubiquitin"
  ],
  "title": "The Role of the Ubiquitin-Proteasome Pathway During Xylem Differentiation in <I>Zinnia elegans</I> Mesophyll Cells and <I>Arabidopsis thaliana</I>",
  "type": "Dissertation"
}