{
  "contributor_author": "Kellogg, Amy",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_committeemember": [
    "Moore, David Michael",
    "Potter, Kenneth R.",
    "Carter, Edith H.",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:12Z",
  "date_adate": "2003-11-03",
  "date_available": "2014-03-14T20:17:12Z",
  "date_issued": "2003-09-19",
  "date_rdate": "2004-11-03",
  "date_sdate": "2003-10-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated the influence of computer-generated reminders on the rate in which distance learners submitted assignments and completed courses. The computer-generated reminders, sent via email, served as a time management support strategy. Participants were randomly divided into two groups: control and treatment. Both groups received a list of target due dates for course assignments. The control group did not receive reminders. The treatment group received reminders when they failed to submit an assignment by a target due date.  The results indicated no significant difference between the control and treatment groups in terms of assignment submission rates and course completion rates. However, results of this study did reveal that the number of assignments in a distance course influences the timeliness of assignment completion and the likelihood of course completion.",
  "description_provenance": [
    "Author Email: akellogg@swva.net",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Advisor Email: ecarter@radford.edu",
    "Advisor Email: jburton@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:12Z (GMT). No. of bitstreams: 1 kellogg_dissertation.pdf: 422045 bytes, checksum: f1f493bfdc4cbd0f0a5b3341901334ae (MD5)   Previous issue date: 2003-09-19"
  ],
  "handle": "29228",
  "identifier_other": "etd-10092003-074520",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10092003-074520/",
  "identifier_uri": "http://hdl.handle.net/10919/29228",
  "publisher": "Virginia Tech",
  "relation_haspart": "kellogg_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "time management",
    "pacing",
    "course completion",
    "distance learning"
  ],
  "title": "Using Computer Generated Reminders as Time Management Support to Influence Assignment Completion Rates and Course Completion in an Online Masters Program",
  "type": "Dissertation"
}