{
  "contributor_author": "Columbus, Rebecca Foushee",
  "contributor_committeechair": "Lickliter, Robert E.",
  "contributor_committeemember": [
    "Bell, Martha Ann",
    "Franchina, Joseph J.",
    "Friedman, Bruce H.",
    "Harrison, David W.",
    "Sturgis, Ellie T."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:17:12Z",
  "date_adate": "1998-10-10",
  "date_available": "2014-03-14T20:17:12Z",
  "date_issued": "1998-10-19",
  "date_rdate": "2012-08-07",
  "date_sdate": "1998-10-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Early perceptual learning capacity has been shown to correspond with the relative status of emergent sensory systems throughout prenatal and postnatal development.  It has also been shown that young infants can learn perceptual information during perinatal development.  However, the exact nature of the relationship between prenatal and postnatal perceptual development and the role of early experience on learning ability have yet to be examined.  The present study examined how auditory learning capacity in bobwhite quail chicks is affected by the interrelationship between the developing auditory and visual systems in late prenatal/early postnatal development.  Chicks were provided with auditory information during the period immediately prior to or the period following hatching.  In addition, visual experience was either provided or attenuated during both the prenatal and postnatal periods.  Findings revealed that chicks postnatally exposed to 10 min/hr of maternal auditory stimulation in lighted conditions required 72 hr exposure to the call in order to learn that bobwhite maternal call (Experiments 1A and 1B).  Control chicks who experienced the prenatal egg-opening procedure demonstrated no naive preference for two individual variants of the bobwhite maternal assembly call (Experiment 2). However, embryos who received 10 min/hr of prenatal visual stimulation, or who were reared in prenatal darkness successfully learned a maternal call with only 24 hr of postnatal exposure (Experiments 3A and 3C).  Embryos who received prenatal visual and postnatal darkened rearing conditions (a mismatch between prenatal and postnatal experience) showed deficits in postnatal auditory learning (Experiment 3B).  Embryos who were exposed to 10 min/hr of prenatal maternal auditory stimulation and 10 min/hr of nonconcurrent visual stimulation remembered the maternal call into later ages of postnatal development than in previous studies when reared in lighted or darkened postnatal conditions (Experiments 4A and 4B).  However, when all prenatal and postnatal visual experience were both removed from embryos' and chicks' environments, deficits in prenatal auditory learning and postnatal memory were observed (Experiment 4C). These results indicate that prenatal and postnatal learning in bobwhite quail occur differently, that mismatches in prenatal and postnatal experience interfere with postnatal auditory learning, and that prenatal learning and postnatal memory are affected by the amount of visual stimulation present within chicks' environmental milieu. In the broader scheme, these results provide further evidence that the auditory and visual systems are linked during early development and support an ecological perspective of learning and memory.",
  "description_provenance": [
    "Advisor Email: duckling@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:12Z (GMT). No. of bitstreams: 6 bwcalla.aiff: 651598 bytes, checksum: 9c3f15012921884f17481d285f03c475 (MD5) ETDDIS2.PDF: 10232 bytes, checksum: dd3b3907a2f59333b6225ba459e8ceb2 (MD5) bwcallb.aiff: 550532 bytes, checksum: 79716ea123589e57bb08361b6ea7a5c0 (MD5) etddis1.doc.pdf: 51809 bytes, checksum: 97e64326065b691e87bc451df06a15e4 (MD5) etddis3.doc.pdf: 274986 bytes, checksum: 9958a58b4fb29bf8a2d2011c9293b3a1 (MD5) chicks.jpg: 32143 bytes, checksum: 36b2d8bf3ac3ce029f0bd2216fed0b3a (MD5)   Previous issue date: 1998-10-19"
  ],
  "handle": "29226",
  "identifier_other": "etd-100898-201806",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-100898-201806/",
  "identifier_uri": "http://hdl.handle.net/10919/29226",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "bwcalla.aiff",
    "ETDDIS2.PDF",
    "bwcallb.aiff",
    "etddis1.doc.pdf",
    "etddis3.doc.pdf",
    "chicks.jpg"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Psychology",
    "Learning",
    "Development",
    "Bobwhite Quail",
    "Perception"
  ],
  "title": "Auditory-Visual System Interactions: Perinatal Visual Experience Affects Auditory Learning and Memory in Bobwhite Quail Chicks (Colinus virginianus)",
  "type": "Dissertation"
}