{
  "contributor_author": "Issenmann, Anthony John",
  "contributor_committeechair": "Johnson, Scott W.",
  "contributor_committeemember": [
    "Keeling, Margaret L.",
    "Dolbin-MacNab, Megan L.",
    "Piercy, Fred P."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:17:11Z",
  "date_adate": "2008-10-24",
  "date_available": "2014-03-14T20:17:11Z",
  "date_issued": "2008-10-06",
  "date_rdate": "2008-10-24",
  "date_sdate": "2008-10-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine differences in the changes in levels of differentiation, as measured by the Differentiation of Self Inventory (DSI) (Knauth & Skowron, 2004), that occurred among high school students who participated in a semester-long (n = 69) and year-long (n = 119) AFS (formerly known as American Field Service) program and a control group (n = 75) that did not study abroad. Gender of student and level of individualism of host country were also examined. The DSI full scale and four subscales: emotional reactivity, I position, emotional cutoff, and fusion with others were used to assess levels of differentiation. This study was a non-equivalent control group experimental pretest-posttest design. Pretest scores were used as the covariate in the posttest ANCOVA. Results revealed that female students who studied abroad for both one year and one semester experienced significant increases in levels of differentiation as measured by the DSI full scale versus female students who did not study abroad. There were no significant differences among males who studied abroad for one year, one semester or not at all. Additional results indicate a significant difference in changes in level of differentiation, as measured by the DSI full scale, between genders in the control group and the semester abroad group. Additional gender differences were revealed on the emotional reactivity and fusion with others subscales. Level of host countryâ  s individualism was not a significant factor. Results support previous literature which states that males and females engage in differing processes when forming their identity. Results also demonstrate that studying abroad is a meaningful life experience significant enough to assist females with increasing levels of differentiation. Additional results, a discussion of the results, limitations, and implications for practice and research are also provided.",
  "description_provenance": [
    "Author Email: aji@vt.edu",
    "Advisor Email: mkeeling@vt.edu",
    "Advisor Email: mdolbinm@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Advisor Email: scottwj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:11Z (GMT). No. of bitstreams: 2 Dissertation.pdf: 408773 bytes, checksum: 8ad5074d3fa8d020db19a5b9aaf8ede8 (MD5) Dissertation_resubmit.pdf: 414350 bytes, checksum: a0b9e550850150f29e8c26c4b67e4a6e (MD5)   Previous issue date: 2008-10-06"
  ],
  "handle": "29223",
  "identifier_other": "etd-10082008-172721",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10082008-172721/",
  "identifier_uri": "http://hdl.handle.net/10919/29223",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation.pdf",
    "Dissertation_resubmit.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Differentiation of Self Inventory",
    "Bowen",
    "differentiation",
    "AFS",
    "stud abroad"
  ],
  "title": "An Examination of the Impact of Studying Abroad with AFS on Level of Differentiation",
  "type": "Dissertation"
}