{
  "contributor_author": "Sharp, Lindsay Ann",
  "contributor_committeechair": "Goldstein, Aaron S.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Huckle, William R.",
    "Lee, Yong Woo",
    "Rajagopalan, Padmavathy"
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:17:11Z",
  "date_adate": "2009-10-21",
  "date_available": "2014-03-14T20:17:11Z",
  "date_issued": "2009-09-28",
  "date_rdate": "2009-10-21",
  "date_sdate": "2009-10-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Bone is the second most transplanted tissue in the body, with approximately 2.2 million bone graft procedures performed annually worldwide. Currently, autogenous bone is the gold standard for bone grafting due to its ability to achieve functional healing; however, it is limited in supply and results in secondary injury at the donor site. Tissue engineering has emerged as a promising means for the development of new bone graft substitutes in order to overcome the limitations of the current grafts. In this research project, the specific approach for bone tissue engineering involves seeding osteoprogenitor cells within a biomaterial scaffold then culturing this construct in a biodynamic bioreactor. The bioreactor imparts osteoinductive mechanical stimuli on the cells to stimulate the synthesis of an extracellular matrix rich in osteogenic and angiogenic factors that are envisioned to guide bone healing in vivo. Fluid flow, which exerts a hydrodynamic shear stress on adherent cells, has been identified as one of the strongest stimuli on bone cell behavior. It has been shown to enhance the deposition of osteoblastic matrix proteins in vitro, and is particularly important for the delivery of oxygen and nutrients to cells within large scaffolds suitable for bone tissue regeneration. In particular, dynamic flow profiles have been shown to be more efficient at initiating mechanotransductive signaling and enhancing gene expression of osteoblastic cells in vitro relative to steady flow. However, the molecular signaling mechanisms by which bone cells convert hydrodynamic shear stress into biochemical signals and express osteoblastic matrix proteins are not fully understood. Therefore, the overall goal of this research project was to determine the effect of dynamic fluid flow on mechanotransductive signaling and expression of bioactive factors and bone matrix proteins.        In the first study, an intermittent flow regimen, in which 5 min rest periods were inserted during fluid flow, was examined. Results showed that signaling molecules, mitogen activated protein kinases (MAPKs) and prostaglandin E2, were modulated with the flow regimen, but that expression of bone matrix proteins, collagen 1α1, osteopontin, bone sialoprotein (BSP), and osteocalcin (OC), were similar under continuous and intermittent flow. Thus, this study suggested that variation of the flow regimen modulates mechanotranductive signaling. In the second study, four flow conditions were examined: continuous flow, 0.074 Hz, 0.044 Hz, and 0.015 Hz pulsatile flow. This study demonstrated that pulsatile flow enhances expression of BSP and OC over steady flow. Similarly, bone morphogenetic protein (BMP)-2 and -7 were enhanced with pulsatile flow, while BMP-4 was suppressed with all flow conditions, suggesting that the mechanism by which fluid flow enhances bone matrix proteins may involve the induction of BMP-2 and -7, but not BMP-4. In the third study, the molecular mechanism by which fluid flow simulates expression of BMPs was examined. Results from this study suggest that this mechanism may involve activation of MAPKs, but BMP-2, -4, and -7 are regulated through multiple different signaling pathways.        Overall, the results from this research demonstrate that dynamic flow modulates mechanotransductive signaling and expression of osteoblastic matrix proteins by osteoblast cells. In particular, BMPs, important for formation in vivo, were shown to be induced by fluid flow. Therefore, this work may be beneficial in understanding and developing 3D perfusion culture systems for the creation of a clinically effective engineering bone tissue.",
  "description_provenance": [
    "Author Email: sharpl@vt.edu",
    "Advisor Email: goldst@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: ywlee@vt.edu",
    "Advisor Email: padmar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:11Z (GMT). No. of bitstreams: 1 Sharp_LA_D_2009.pdf: 2288717 bytes, checksum: 3548ca26163b21d861b119e375dd8687 (MD5)   Previous issue date: 2009-09-28"
  ],
  "handle": "29224",
  "identifier_other": "etd-10082009-162907",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10082009-162907/",
  "identifier_uri": "http://hdl.handle.net/10919/29224",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sharp_LA_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fluid flow",
    "bone marrow stromal cells",
    "osteoblastic differentiation",
    "mechanotransduction",
    "bone morphogenetic proteins"
  ],
  "title": "The Use of Dynamic Fluid Flow Strategies for Bone Tissue Engineering Applications",
  "type": "Dissertation"
}