{
  "contributor_author": "Falls, Jr., Horace L.",
  "contributor_committeechair": "Graham, Richard Terry",
  "contributor_committeemember": [
    "Burton, John K.",
    "Eschenmann, Konrad Kurt",
    "Sughrue, Jennifer A.",
    "Diss, Ron"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:12Z",
  "date_adate": "1999-10-29",
  "date_available": "2014-03-14T20:17:12Z",
  "date_issued": "1999-09-27",
  "date_rdate": "2000-10-29",
  "date_sdate": "1999-10-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<HTML> <HEAD> <META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=windows-1252\"> <META NAME=\"Generator\" CONTENT=\"Microsoft Word 97\"> <TITLE>Teachers' Self-Perceptions of their Role as Generalist: A Study of the Interpersonal Skills Necessary for Effective Leadership, and Counseling </TITLE> </HEAD> <BODY>  <B><P ALIGN=\"CENTER\">Teachers' Self-Perceptions of their Role as Generalist: A Study of the Interpersonal Skills Necessary for Effective Leadership, and Counseling </P> </B><P ALIGN=\"CENTER\"></P> <P ALIGN=\"CENTER\">by</P> <P ALIGN=\"CENTER\"></P> <P ALIGN=\"CENTER\">Rocky Falls</P> <P ALIGN=\"CENTER\"></P> <P ALIGN=\"CENTER\">Committee Chairperson: Dr. Terry R. Graham</P> <P ALIGN=\"CENTER\">Department of Teaching and Learning</P>  <P ALIGN=\"CENTER\">(ABSTRACT)</P> <P>\tThis study was designed to examine the various duties and roles teachers are called upon to play, and the potential effect of the teachers' behaviors on the relationships they establish with their students.  It was thought that by examining teacher behaviors, a road map could be created for maximizing the productive relationships that could be used by all teachers.  The focus of this road map was based on the notion of teacher as \"generalist,\" a term which denotes the multiple roles teachers play as a natural consequence of their vocation.  The primary teaching roles considered in the study were leadership, and counseling. </P> <P>\tThe Questionnaire on Teacher Interaction (QTI) was used to ascertain the teachers' opinion of their own interpersonal skills as determined by the Model of Interpersonal Teacher Behavior.  This was achieved by having the teachers complete the 64-item questionnaire about how they perceived themselves as teachers.  Secondly, the teachers were asked to give written responses to a case method narrative that depicts a problem classroom scenario wherein the teacher abandons her unruly classroom.  Then, three evaluators with expertise in pedagogy, leadership, and counseling, (respectively) were asked to complete a QTI for each teacher's responses to the case method narrative.  The evaluators were instructed to base their responses on their own particular area of expertise, either, pedagogy, leadership, or counseling.   \t</P> <P>The QTI profiles produced by this process served as the basis for the conversations held individually with the teachers in Interview Two.   The profiles also served as a tool that allowed the teachers to be grouped with other teachers having similar behavioral characteristics.  Three focus groups were also created based on the teachers' QTI self-reports.  Most of the teachers rated themselves highly in the areas of leadership and the counseling-type behaviors: helping & friendly, and understanding.  They also agreed that leadership and counseling were necessary duties for a teacher.  Thus, the importance of leadership and counseling as they apply to the performance requirements of a teacher was established.  This fact was reiterated in all of the interviews and in each of the focus groups, as well as, in the review of the literature.   </P> <P>The crucial dilemma arose from the fact that the teachers stated in the various methods of data collection that they were leaders and counselors.  Further, the literature noted that the \"best\" teachers are generalist with expertise and responsibilities in the areas of leadership and counseling.  And, finally, common sense also seemed to dictate that all teachers are required to be leaders and counselors.  Yet, despite the apparent importance of leadership and counseling for all teachers, the teachers in this study stated that they were not sure of the source of their leadership and counseling knowledge and abilities.  They also revealed that their leadership and counseling knowledge and abilities were innate; pedagogically related duties in the areas of leadership and counseling were based on behaviors that came naturally to them; they did not know the nomenclature and underlying theoretical tenets for formal leadership or counseling styles; their preservice teacher education programs did not prepare them for leadership or counseling duties; and that a greater understanding of leadership and counseling theory would help them to align their practice with their innate abilities.  Further, they noted the potential advantages of being able to recognize the leadership dynamics that are utilized by their students.  The ability to identify leadership and interpersonal characteristics in one's self and in others, particularly in students, peers, and superiors, was reported to be an ability that would be essential for teachers.  Thus, the need to identify various leadership and counseling theories via their given title, name, or label, etc. arose as a matter of controversy.  The value of having a uniform code for identifying leadership and counseling practices revealed itself to be one of the most interesting aspects of the study.</P> <FONT SIZE=2></FONT></BODY> </HTML>",
  "description_provenance": [
    "Author Email: rock4751@hotmail.com",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: rgraham@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Advisor Email: jsugh@vt.edu",
    "Advisor Email: rediss@ehc.edu",
    "Made available in DSpace on 2014-03-14T20:17:12Z (GMT). No. of bitstreams: 1 rockydone.pdf: 2898507 bytes, checksum: 7b1065bb4a34f8c27489e9827c372bf5 (MD5)   Previous issue date: 1999-09-27"
  ],
  "handle": "29227",
  "identifier_other": "etd-100899-144358",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-100899-144358/",
  "identifier_uri": "http://hdl.handle.net/10919/29227",
  "publisher": "Virginia Tech",
  "relation_haspart": "rockydone.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Leadership",
    "Counseling",
    "Teaching",
    "Generalist",
    "Relationships"
  ],
  "title": "Teachers' Self-Perceptions of Their Role as Generalist:  A Study of the Interpersonal Skills Necessary For Effective Leadership and Counseling",
  "type": "Dissertation"
}