{
  "contributor_author": "Plassmann, Vandana Shah",
  "contributor_committeecochair": [
    "Norton, Marjorie J. T.",
    "Peterson, Everett B."
  ],
  "contributor_committeemember": [
    "Alwang, Jeffrey R.",
    "Chen-Yu, Jessie H.",
    "Garman, E. Thomas",
    "McGuirk, Anya M."
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2014-03-14T20:17:11Z",
  "date_adate": "2000-10-10",
  "date_available": "2014-03-14T20:17:11Z",
  "date_issued": "2000-08-29",
  "date_rdate": "2001-10-10",
  "date_sdate": "2000-10-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The main objective of this study was to determine the relationship between household characteristics and the expenditure shares allocated among various categories of women's clothing for U.S. households belonging to different ethnic groups. The study also estimated unobserved latent quality variables based on household characteristics, and examined the effects of the latent quality variables on the expenditure shares for the various apparel categories. A Multiple Indicator-Multiple Cause Model, which is a special case of the general Structural Equations Model, was used to estimate separate Engel equations for 15 expenditure shares for women's clothing categories, for four different ethnic groups.  The results of the study showed that household characteristics had a significant impact on the latent quality variables associated with different categories of women's clothing, and the latent quality variables themselves impacted the clothing expenditure shares. Also, for different ethnic groups, household characteristics had differing effects on women's clothing expenditure shares. Of all the characteristics examined, annual total household expenditures and numbers of children and adults in the household had significant effects on the largest numbers of latent quality variables associated with the clothing categories for the four ethnic groups. The socio-economic variables also significantly affected several clothing expenditure shares for the four ethnic groups. These results imply that socio-economic variables impact consumers' quality choices, and presumably prices paid, for women's clothing. The results support the conclusions of Paulin (1998), and Wagner and Soberon-Ferrer (1990), in that different ethnic groups have distinct expenditure patterns possibly due to differences in socio-economic characteristics; such characteristics may signify  resources and constraints faced by a household. The distinct expenditure patterns and tastes of the four ethnic groups are reflected in the significantly different effects of annual total expenditures on the expenditure shares for each category of women's clothing, as well as in the significantly different effects of the latent quality variables on several expenditure shares, for the four ethnic groups.",
  "description_provenance": [
    "Author Email: vp25@cornell.edu",
    "Advisor Email: nortonm@vt.edu",
    "Advisor Email: alwangj@vt.edu",
    "Advisor Email: petrsone@vt.edu",
    "Advisor Email: chenyu@vt.edu",
    "Advisor Email: tgarman@vt.edu",
    "Advisor Email: mcguirk@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:11Z (GMT). No. of bitstreams: 7 3Chapter_3.PDF: 65910 bytes, checksum: 9d0d1fca044b2b61d7b891b35bf8dff3 (MD5) 4Chapter_4.PDF: 65691 bytes, checksum: 5738585a0350d7f6fdad36bd703e2481 (MD5) 6Back_matter.PDF: 67978 bytes, checksum: ba4fba28fe3fd3dd5f6d2650655dec97 (MD5) 5Chapter_5.PDF: 9127 bytes, checksum: 285b0b1fe29bc50495658fb7442a9e8a (MD5) 1Chapter_1.PDF: 9810 bytes, checksum: 45e03aa04b5a4e12a722cabebcdf8bf5 (MD5) 2Chapter_2.PDF: 188279 bytes, checksum: d3ea6691a9fbb5f0089609f4c3a5e748 (MD5) 0front_matter.PDF: 17722 bytes, checksum: 7f2634cf7d37588cd169643169a0d360 (MD5)   Previous issue date: 2000-08-29"
  ],
  "handle": "29221",
  "identifier_other": "etd-10082000-13500038",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10082000-13500038/",
  "identifier_uri": "http://hdl.handle.net/10919/29221",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "3Chapter_3.PDF",
    "4Chapter_4.PDF",
    "6Back_matter.PDF",
    "5Chapter_5.PDF",
    "1Chapter_1.PDF",
    "2Chapter_2.PDF",
    "0front_matter.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Structural Equations Model",
    "Clothing Expenditures",
    "Ethnicity"
  ],
  "title": "Ethnicity and Clothing Expenditures of U.S. Households: A Structural Equations Model with Latent Quality Variables",
  "type": "Dissertation"
}