{
  "contributor_author": "Bagwell, Dorothy Caroline",
  "contributor_committeechair": "Garman, E. Thomas",
  "contributor_committeemember": [
    "Redican, Kerry J.",
    "Lambur, Michael T.",
    "Leech, Irene E.",
    "Kratzer, Constance Y.",
    "Hutchinson, Susan R.",
    "Brunson, Bruce H."
  ],
  "contributor_department": "Near Environments",
  "date_accessioned": "2014-03-14T20:17:11Z",
  "date_adate": "2000-10-16",
  "date_available": "2014-03-14T20:17:11Z",
  "date_issued": "2000-08-14",
  "date_rdate": "2001-10-16",
  "date_sdate": "2000-10-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine a sample of employed individuals who participated in credit counseling through a non-profit consumer credit counseling agency in the Mid-Atlantic. Using data collected at two points in time, this sample was examined to measure changes in personal financial variables, health status, and work outcomes. The sample respondents were also examined to determine the extent to which they instituted positive financial behaviors following participation in credit counseling. In addition, this research assessed differences in the demographics among the clients. Also studied was the extent to which individual and family characteristics, health status, financial concerns and related stress, and financial wellness accounted for the variance in work outcomes of productivity, presenteeism, and worktime used for personal financial matters. Significant changes in personal financial outcomes, health status, and work outcomes were found between the initial and follow-up study. One year following credit counseling, respondents had decreased levels of financial concerns and financial stress, experienced fewer workloss days, and spent less time using work hours to handle personal financial matters. They also indicated improvements in their level of financial wellness, health status, and job productivity.  Respondents had instituted a number of positive financial behaviors since receiving credit counseling one year earlier. Most had reduced some of their personal debts and cut down on living expenses.  A model of work and personal financial outcomes was presented in this study. Hierarchical regression analyses using both data sets revealed that health status and financial concerns explained a significant amount of the variance in four work outcomes: (1) productivity, (2) presenteeism, (3) work time used for personal financial matters, and (4) workloss days. Adding financial wellness as the final step in the analysis, did not explain any additional variance in each of the work outcomes. This research assessed only the demographic and personal financial variables explanatory relationships to work outcomes. Therefore, life events beyond these variables may offer additional explanation of the work outcomes. Of importance is that this research provides documentation of positive changes in personal finances and work outcomes of employed individuals who participated in credit counseling one year earlier. In addition, the research presented a model of personal financial and work outcomes that can be advanced through further research.",
  "description_provenance": [
    "Author Email: dbagwell@hs.ttu.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: lamburmt@vt.edu",
    "Advisor Email: ileech@vt.edu",
    "Advisor Email: ckratzer@nmsu.edu",
    "Advisor Email: shutch@edtech.unco.edu",
    "Advisor Email: tgarman@vt.edu",
    "Advisor Email: bbrunson@fccj.org",
    "Made available in DSpace on 2014-03-14T20:17:11Z (GMT). No. of bitstreams: 4 chapter5and6.pdf: 335678 bytes, checksum: 417dc924f46f9ec467a99b945a2db70a (MD5) frontmatter.pdf: 74955 bytes, checksum: 688ca594cc0e942fed7a652f91bcc486 (MD5) chapter3and4.pdf: 274213 bytes, checksum: d480bc6a67494a702550dab3f3b504f0 (MD5) chapter1and2.pdf: 126798 bytes, checksum: e1fbf9aeaa1ba1eb1f269ef540ecd2c4 (MD5)   Previous issue date: 2000-08-14"
  ],
  "handle": "29222",
  "identifier_other": "etd-10082000-23210012",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10082000-23210012/",
  "identifier_uri": "http://hdl.handle.net/10919/29222",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chapter5and6.pdf",
    "frontmatter.pdf",
    "chapter3and4.pdf",
    "chapter1and2.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "financial wellness",
    "financial stress",
    "financial concerns",
    "productivity",
    "credit counseling"
  ],
  "title": "Work and Personal Financial Outcomes of Credit Counseling Clients",
  "type": "Dissertation"
}