{
  "contributor_author": "Sheaves, Rita Atwell",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Lepczyk, Billie F.",
    "Stratton, Richard K.",
    "Fortune, Jimmie C."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:12Z",
  "date_adate": "2008-11-17",
  "date_available": "2014-03-14T20:17:12Z",
  "date_issued": "2008-09-02",
  "date_rdate": "2008-11-17",
  "date_sdate": "2008-10-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this research was to determine if one program funded by the Virginia Tobacco Settlement Foundation produces a more effective result in increasing student knowledge about the harmful effects of tobacco use than another program.  Of particular interest is whether there is a difference in effectiveness based on the environment or settings in which these programs are presented.  According to the CDC (2006), approximately 4,000 people between the ages of 12 to 17 will initiate smoking.  In Virginia, a tobacco-growing state, there are 88,500 high school smokers.  The health costs to Virginia are approximately 2.08 billion dollars per year with an estimated cost of 2.42 billion (Campaign for Tobacco-free Kids, n.d.). By providing the VTSF an analysis of their programs, they will be better equipped at making an informed decision on which programs to support financially.  The research questions that were posed are: 1) is there a difference between school-based programs, faith-based programs, and community-based programs in increasing knowledge about tobaccoâ  s harmful effects? 2) is there a difference between programs in increasing knowledge and the location in which they are presented, urban versus rural?, and 3) is there a difference between programs implemented in middle schools in increasing knowledge about tobacco? From the focused analysis, the following conclusions can be drawn: 1) given the current evaluation and reporting process of the VTSF, no determination of whether there is a difference between program settings in increasing knowledge can be made, 2) in addition, no determination can be made in regards to whether there is a difference in increasing knowledge in regards to program location-urban versus rural, and 3) no conclusion can be drawn about middle school program effectiveness.  What one can conclude is that the evaluation process used by the VTSF needs to be reformed so that a more consistent method is utilized by all parties so that a comparison can be made about the effectiveness of implemented programs.  Also, long-term studies on programs need to be conducted since there are so few available.  Studies to determine whether knowledge acquisition actually translates into behavior change also need to be performed. The key to tobacco prevention and cessation must be a  multi-faceted approach. Educational programs, anti-tobacco media messages, tobacco taxation, and restriction of tobacco sales are all important in the prevention of tobacco use by the youth of Virginia. Each plays an important piece to the puzzle.",
  "description_provenance": [
    "Author Email: rsheaves@vt.edu",
    "Advisor Email: lepcyzk@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:12Z (GMT). No. of bitstreams: 1 finisheddissertation.pdf: 991449 bytes, checksum: fd3ebc29457b757fe58e5f58e1e8a7fd (MD5)   Previous issue date: 2008-09-02"
  ],
  "handle": "29229",
  "identifier_other": "etd-10092008-143304",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10092008-143304/",
  "identifier_uri": "http://hdl.handle.net/10919/29229",
  "publisher": "Virginia Tech",
  "relation_haspart": "finisheddissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "VTSF",
    "prevention",
    "tobacco education"
  ],
  "title": "The Effectiveness of Tobacco Prevention & Cessaation Programs:  A Focused-Analysis of the Virginia Tobacco Settlement Foundation Programs",
  "type": "Dissertation"
}