{
  "contributor_author": "Srivastava, Manish Kumar",
  "contributor_committeecochair": [
    "Hatfield, Donald E.",
    "Gnyawali, Devi R."
  ],
  "contributor_committeemember": [
    "Madhavan, Ravindranath",
    "Tegarden, Linda F."
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:17:15Z",
  "date_adate": "2007-10-15",
  "date_available": "2014-03-14T20:17:15Z",
  "date_issued": "2007-09-26",
  "date_rdate": "2007-10-15",
  "date_sdate": "2007-10-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is motivated by an overarching research question: How do firms leverage external resources residing in their ego network (portfolio of alliances) and their clusters in order to innovate in a sustained manner?  Research suggests that firms often struggle and falter in their innovation efforts.  However, past research has paid little systematic attention on why firms struggle in their innovation efforts. Further, though network and clustersâ   the key sources of external resourcesâ   may overlap in several ways, the extant literature has not examined their joint effect on a firm's technological innovation. In this dissertation, using a longitudinal research design I examine how the characteristics of a firm's ego network and of its cluster independently and jointly impact its patent output in the U.S. semiconductor industry.  The research provides a framework showing how networks and clusters may work in tandem in helping a firm overcome innovation barriers. The study demonstrates how firms can leverage network and cluster resources. The empirical evidence indicates that the efficacy of cluster resources increases in the presence of network ties within the cluster. It also shows that firms can mobilize resources of distant clusters using their network ties. The study further demonstrates that resource-rich firms leverage networks resources more effectively than the resource-deficient firms do while resource-deficient firms leverage cluster resources more effectively than the resource-rich firms do. The dissertation makes important theoretical and empirical contributions to alliance, network, cluster, and innovation literatures. The research findings also have important managerial implications.",
  "description_provenance": [
    "Author Email: msrivast@vt.edu",
    "Advisor Email: rmadhavan@katz.pitt.edu",
    "Advisor Email: hatfield@vt.edu",
    "Advisor Email: devi@vt.edu",
    "Advisor Email: tegarden@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:15Z (GMT). No. of bitstreams: 1 Dissertation_Manish_Srivastava_ETD.pdf: 1516409 bytes, checksum: 435239bad048230ce68010d47fba3465 (MD5)   Previous issue date: 2007-09-26"
  ],
  "handle": "29234",
  "identifier_other": "etd-10102007-144411",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10102007-144411/",
  "identifier_uri": "http://hdl.handle.net/10919/29234",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Manish_Srivastava_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Innovation Barriers",
    "Innovation",
    "Network",
    "Cluster"
  ],
  "title": "Friends or Neighbors? The Effects of Inter-firm Networks and Clusters on Technological Innovations in the U.S. Semiconductor Industry",
  "type": "Dissertation"
}