{
  "contributor_author": "Wang, Rongrong",
  "contributor_committeechair": "Quek, Francis K. H.",
  "contributor_committeemember": [
    "Kavanaugh, Andrea L.",
    "Martin, Thomas L.",
    "Harrison, Steven R.",
    "Tatar, Deborah Gail"
  ],
  "contributor_department": "Computer Science and Applications",
  "date_accessioned": "2014-03-14T20:17:18Z",
  "date_adate": "2012-12-06",
  "date_available": "2014-03-14T20:17:18Z",
  "date_issued": "2012-09-27",
  "date_rdate": "2012-12-06",
  "date_sdate": "2012-10-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Touch is an expressive and powerful modality in affect conveyance. A simple touch like a hug can elicit strong feelings of affection both in the touch initiator and recipient. Therefore delivering touch over a distance to a long-distance family member or significant other has been an appealing concept for both researchers and designers. However compared to the development of audio, video channels which allow the transmission of voice, facial expression and gesture,  digitally mediated touch (Remote Touch) has not received much attention. We believe that this is partially due to the lack of understanding of the capabilities and communication possibilities that remote touch brings.  This dissertation presents a review of relevant psychological and sociological literature of touch and proposes a model of immediacy of the touch channel for affect conveyance. We advance three hypotheses regarding the possibility of remote touch in immediate affect conveyance: presence, fidelity and context. We posit that remote touch with relatively low touch fidelity can convey meaningful immediate affect when it is accompanied by a contextualizing channel. To test the hypothesis, two sets of remote touch devices are designed and prototyped which allow users to send/receive a squeeze on the upper arm to/from others effectively.  Three in-lab user studies are conducted to investigate the role of remote touch in affect conveyance. These studies showed clearly that remote touch, when contextualized, can influence the affective component in communication. Our results demonstrated that remote touch can afford a rich spectrum of meanings and affects.  Three major categories of the usage are identified as positive affect touch which serves to convey affects such as affection, sympathy and sharing, comfort etc., playful touch which serves to lighten the conversations, and conversational touch which serves to regulate the dynamics in the discourse. Our interview results also provide insights of how people use this new channel in their communication.",
  "description_provenance": [
    "Author Email: wangr06@vt.edu",
    "Advisor Email: kavan@vt.edu",
    "Advisor Email: tlmartin@vt.edu",
    "Advisor Email: srh@cs.vt.edu",
    "Advisor Email: dtatar@cs.vt.edu",
    "Advisor Email: quek@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:18Z (GMT). No. of bitstreams: 1 Wang_R_D_2012.pdf: 21309526 bytes, checksum: 794ef2823642df2cc48d0d6fdab1f502 (MD5)   Previous issue date: 2012-09-27"
  ],
  "handle": "29247",
  "identifier_other": "etd-10112012-003922",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10112012-003922/",
  "identifier_uri": "http://hdl.handle.net/10919/29247",
  "publisher": "Virginia Tech",
  "relation_haspart": "Wang_R_D_2012.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Affective Interaction",
    "Haptic Interaction",
    "Remote Touch",
    "Context",
    "Computer Mediated Communication"
  ],
  "title": "Contextualizing Remote Touch for Affect Conveyance",
  "type": "Dissertation"
}