{
  "contributor_author": "Martin, Kris Rowland",
  "contributor_committeechair": "Richardson, Frederick M.",
  "contributor_committeemember": [
    "Easterwood, Cintia M.",
    "Easterwood, John C.",
    "Leininger, Wayne E.",
    "Brown, Robert"
  ],
  "contributor_department": "Accounting and Information Systems",
  "date_accessioned": "2014-03-14T20:17:16Z",
  "date_adate": "2006-06-23",
  "date_available": "2014-03-14T20:17:16Z",
  "date_issued": "2002-03-01",
  "date_rdate": "2006-06-23",
  "date_sdate": "2005-10-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Whether the quality of a firm's reported earnings affects investors' ability to predict future earnings and stock returns is still a subject of much debate among accounting researchers. Lev (1989) suggests that low quality earnings may be causing the relatively low correlation between reported earnings and stock returns (or the market's evaluation of future earnings). This dissertation used the valuation model described in Ohlson (1995) and Feltham and Ohlson (1995) to explore the possible links between accounting method choices and the ability of investors to use reported earnings to predict future earnings. The results demonstrate that prior researchers' assumptions regarding which accounting methods are generally conservative or liberal are reasonably accurate over large numbers of firms. The results also show that one group of analysts (Value Line Investment Survey) is able to predict future earnings more accurately over medium-term and long-term forecast horizons for firms using generally conservative accounting methods than those firms employing generally liberal accounting methods. This research adds to the prior \"quality of earnings\" research by showing that analysts can predict earnings more accurately for certain classes of firms (i.e., firms using conservative accounting methods), thus increasing our knowledge of what constitutes high-quality earnings. The research also explores the effects of growth on the quality of earnings question, the effects of firm size, leverage, and industry membership on the relationship, and the robustness of the Feltham and Ohlson Model to alternative definitions of key components of the model.",
  "description_provenance": [
    "Author Email: kmartin@bju.edu",
    "Advisor Email: frich@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:16Z (GMT). No. of bitstreams: 1 Martin_Kris_R_200203_phd.pdf: 493901 bytes, checksum: e285974ca4cc328a600f857bbd8d35a7 (MD5)   Previous issue date: 2002-03-01"
  ],
  "handle": "29240",
  "identifier_other": "etd-10112005-115737",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10112005-115737/",
  "identifier_uri": "http://hdl.handle.net/10919/29240",
  "publisher": "Virginia Tech",
  "relation_haspart": "Martin_Kris_R_200203_phd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "accounting method choice",
    "book-to-market ratio",
    "earnings quality"
  ],
  "title": "The Effect of Accounting Method Choice on Earnings Quality: A Study of Analysts' Forecasts of Earnings and Book Value",
  "type": "Dissertation"
}