{
  "contributor_author": "Kufel, Andrew Paul",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Henig, Cheryl B.",
    "Magliaro, Susan G.",
    "Creighton, Theodore B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:17:17Z",
  "date_adate": "2007-10-16",
  "date_available": "2014-03-14T20:17:17Z",
  "date_issued": "2007-10-01",
  "date_rdate": "2007-10-16",
  "date_sdate": "2007-10-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT  In many parts of the country principal candidates are being licensed through alternative pathways. Some view this movement as a plausible solution to the shortage of principals and inadequacy of principal preparation programs (Hess, 2003; Southern Regional Education Board, 2006; Thomas B. Fordham Institute, 2003). Others are insulted and threatened by the prospect of a person from a non-traditional background leading a school (Fenwick & Pierce, 2001). The debate as to whether or not these candidates possess the prerequisite skills and knowledge to effectively lead a school continues. But, will superintendents, as gatekeepers to school districts, afford these individuals the opportunity to prove their worth as principals?   In this study, superintendents창   attitudes toward alternative licensure of school principals; past behaviors related to hiring alternatively licensed school personnnel; attitudes toward specific alternatively licensed personnel; perceptions of the conditions in their school districts; anticipated concerns about hiring alternatively licensed principals; and the presence or absence of a clearly articulated induction program for new principals are used as predictors of superintendents' willingness to recommend hiring alternatively licensed principals to their school boards.  The composite model of attitude-behavior consistency and data from a qualitative study of 18 superintendents were the bases for the development of a theory. To test the theory, an on-line questionnaire, using Likert and Thurstone scaled items, was administered to 1200 randomly selected superintendents who were members of the American Association of School Administrators (AASA) in 2005. Multiple regression analysis was used for the analysis of the quantitative data. Five of the 19 predictor variables were significant predictors of superintendents창   willingness to recommend hiring alternatively licensed principals. The strongest relationship existed between superintendents창   willingness to recommend hiring alternatively licensed principals and their perceptions of the instructional leadership ability of alternatively licensed principals. Other significant predictors were superintendents창   past experiences hiring alternatively licensed principals, perceptions of the community acceptance of alternatively licensed principals, general attitude toward alternative licensure, and willingness to hire under the given definition. Superintendents displayed a low neutral (more unfavorable) score on the Thurstone scale, which means they view the employment of alternatively licensed principals slightly unfavorably.",
  "description_provenance": [
    "Author Email: akufel@vt.edu",
    "Advisor Email: cbh2c@Virginia.EDU",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: sumags@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:17Z (GMT). No. of bitstreams: 2 Kufel_IRB_approval.pdf: 150817 bytes, checksum: 9301b11a15642e954dd08e8f1d0d46e0 (MD5) Kufel_DissertationETD.pdf: 1791974 bytes, checksum: 044d2abf0c51d9cb5bcfdfd868ec8d4c (MD5)   Previous issue date: 2007-10-01"
  ],
  "handle": "29245",
  "identifier_other": "etd-10112007-164845",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10112007-164845/",
  "identifier_uri": "http://hdl.handle.net/10919/29245",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Kufel_IRB_approval.pdf",
    "Kufel_DissertationETD.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "alternatively licensed principals",
    "alternatively certified principals",
    "principal preparation",
    "alternative licensure",
    "alternative certification"
  ],
  "title": "Variation in the Willingness of Superintendents to Recommend  Hiring Alternatively Licensed Principals",
  "type": "Dissertation"
}