{
  "contributor_author": "Clements, Andrew P.",
  "contributor_committeechair": "Ferry, James G.",
  "contributor_committeemember": [
    "Dean, Dennis R.",
    "Johnson, John L.",
    "Sitz, Thomas O.",
    "White, Robert H."
  ],
  "contributor_department": "Anaerobic Microbiology",
  "date_accessioned": "2014-03-14T20:17:19Z",
  "date_adate": "2005-10-12",
  "date_available": "2014-03-14T20:17:19Z",
  "date_issued": "1992-09-05",
  "date_rdate": "2012-06-04",
  "date_sdate": "2005-10-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The CO dehydrogenase~linked ferredoxin from acetate-grown Methanosarcina thermophiIa was characterized to determine the structure and biochemical properties of the iron-sulfur clusters. Chemical and spectroscopic analyses indicated that the ferredoxin contained two [4Fe-4S] clusters per monomer of 6,790 Da, although a [3Fe-4S] species was also detected in the oxidized protein. The midpoint potentials of the [4Fe-4S] and [3Fe~4S] clusters at pH 7 were -407 m V and + 103 m V, respectively. Evidence from biochemical and spectroscopic studies indicated that the [3Fe-4S] species may have been formed from [4Fe-4S] clusters when ferredoxin was oxidized. <p> The gene encoding the CO dehydrogenase-linked ferredoxin (fdxA) in Ms. thermophila had the coding capacity for a 6,230-Da protein which contained eight cysteines with spacings typical of 2[4Fe-4S] ferredoxins. A second open reading frame (ORF1) was also identified which had the potential to encode a 2[4Fe-4S] bacterial-like ferredoxin (5,850 Da). The deduced proteins from fdxA and ORF1 were 62% identical. fdxA and ORFI were present as single copies in the genome and each was transcribed on a monocistronic mRNA. Both fdxA and ORF1 were transcribed in cells grown on methanol and trimethylamine, but only the fdxA -specific transcript was detected in acetate-grown cells. The apparent transcriptional start sites offdxA and ORFI were downstream of sequences which had high identity with the consensus methanogen promoter. <p> The heterodisulfide of two cofactors unique to the methanogenic microorganisms, HS-HTP and HS-CoM, was enzymatically reduced in cell extracts of Ms. thermophila using electrons from the oxidation of either H2 or CO. The homodisulfides of either HS-HTP or HS-CoM were not reduced under the same conditions. The results indicated that methane is formed by reductive demethylation of CH3-S-CoM using HS-HTP as a reductant in Ms. thermophila. Coupling of CO oxidation with reduction of the heterodisulfide suggested that the CO dehydrogenase-linked ferredoxin may be involved, although the details of electron flow are not known.",
  "description_provenance": [
    "Author Email: ankel88@aol.com",
    "Made available in DSpace on 2014-03-14T20:17:19Z (GMT). No. of bitstreams: 1 LD5655.V856_1992.C628.pdf: 8262031 bytes, checksum: a50b66d16b9a2ebb92dcd33de4afe7de (MD5)   Previous issue date: 1992-09-05"
  ],
  "format_medium": "BTD",
  "handle": "29255",
  "identifier_other": "etd-10122005-134449",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10122005-134449/",
  "identifier_uri": "http://hdl.handle.net/10919/29255",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1992.C628.pdf",
  "subject": [
    "Methanosarcina thermophila.",
    "Agglomeration.",
    "Ferredoxin-NADP reductase."
  ],
  "subject_lcc": "LD5655.V856 1992.C628",
  "title": "Molecular biology and biochemical characterization of the CO dehydrogenase-linked ferredoxin from Methanosarcina thermophila strain TM-1",
  "type": "Dissertation"
}