{
  "contributor_author": "Gaines, Rodney Perry",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeecochair": "Wojcik, Janet R.",
  "contributor_committeemember": [
    "Stratton, Richard K.",
    "Krouscas, James A. Jr.",
    "Fortune, Jimmie C."
  ],
  "contributor_department": "Education Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:17:19Z",
  "date_adate": "2001-10-25",
  "date_available": "2014-03-14T20:17:19Z",
  "date_issued": "2001-08-08",
  "date_rdate": "2002-10-25",
  "date_sdate": "2001-10-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Comparison of Anthropometric Measures of competitive Bodybuilders to Judges' Scores and a Comparison of Judges' Scores  By Rodney P. Gaines  Abstract  This research  compared physical characteristics of bodybuilders to judges' rankings, and compared the judges' rankings across three levels of judges: Elite, Trained, and Untrained.  Twenty-nine male and nine female bodybuilding athletes consented to anthropometric and circumference measurements.  The independent variables in this study were bodyfat, fat-free weight, and proportionality of muscle.  Three groups of judges ranked male and female athletes in the Open, Novice, Collegiate, and Masters divisions. The measurements of proportionality of muscle, bodyfat, girths, and fat-free weight were analyzed using simple and multiple regression.  The judges' rankings in each class were compared using reliability coefficients, correlation, repeated measures analysis of variance, and the generalized theory for inter-rater reliability.  There were significant correlations between the Elite judges' rankings and bodyfat in the Men's Open lightweight class.  The Trained and Elite judges' rankings were significantly correlated with bodyfat in the Women's Novice class.  Fat-free weight was significantly correlated with the Untrained and Elite judges' rankings in the Women's Novice division.  Proportionality of muscle was significantly correlated with the Elite and Trained judges' rankings in the Men's Open lightweight class.  Elite and Trained judges' rankings were significantly correlated with bodyfat and proportionality of muscle.  All three groups of judges' were significantly correlated with the Overall rankings. The Trained judges' rankings were more correlated and more reliable with the Elite judges.  The inter-rater reliability scores were higher for the Elite and Trained judges than for the Untrained judges.  When fat-free weight was substituted for body weight in the calculation of proportionality of muscle, prediction of ranking was enhanced.  The education session led to a significant disparity in judges' rankings between Trained and Untrained judges.  Bodyfat appears to be a better selection variable when comparing physical measurements to judges' rankings in women.  Proportionality of muscle is a better selection variable in predicting judges' rankings in men.  Prediction models developed from this investigation need further testing.",
  "description_provenance": [
    "Author Email: rgaines@vt.edu",
    "Advisor Email: jwojcik@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: jkrousca@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:19Z (GMT). No. of bitstreams: 1 dissertationfinal.pdf: 2027198 bytes, checksum: c5f8cb953cda8716749c906bceb29a3f (MD5)   Previous issue date: 2001-08-08"
  ],
  "handle": "29253",
  "identifier_other": "etd-10122001-163230",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10122001-163230/",
  "identifier_uri": "http://hdl.handle.net/10919/29253",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertationfinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "reliability",
    "bodyfat",
    "athletes",
    "judging",
    "bodybuilding",
    "anthropometrics"
  ],
  "title": "Comparison of Anthropometric Measures of Competitive Bodybuilders to Judges' Scores and a Comparison of Judges' Scores",
  "type": "Dissertation"
}