{
  "contributor_author": "Cheng, Fuzhi",
  "contributor_committeechair": "Orden, David R.",
  "contributor_committeemember": [
    "Yang, Dennis T.",
    "Ashley, Richard A.",
    "Mills, Bradford F.",
    "Peterson, Everett B."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:17:20Z",
  "date_adate": "2005-10-31",
  "date_available": "2014-03-14T20:17:20Z",
  "date_issued": "2005-10-04",
  "date_rdate": "2005-10-31",
  "date_sdate": "2005-10-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "There have been different degrees of exchange rate disequilibrium in the developing countries during recent transition or reform periods. The level of the exchange rate and its misalignment can have significant impacts on agricultural policy measures such as the Producer Support Estimates (PSEs). However, little efforts have been made to explicitly take into account the issue of exchange rate misalignment. In the conventional PSE studies the prevailing actual (nominal) exchange rates are usually used. There is general agreement that the use of actual exchange rates may introduce a bias in the PSE calculations, and that this bias can be substantial when the actual rates are significantly out of equilibrium, but there is much less agreement on the most appropriate alternative.   This dissertation proposes a theoretical and an empirical model for estimating equilibrium exchange rates. Within the context of these models, the equilibrium exchange rates are argued to be determined by a group of real economic fundamentals. These fundamentals within this study include technological progress (Balassa-Samuelson effect), levels of government expenditure, world interest rate, net capital inflows, terms of trade, and openness of the economy. Base on various time series techniques and using data from India and China, sensible long-run relationships are identified between the real exchange rate and these economic fundamentals. The long-run co-integrating relationships are used to derive the equilibrium exchange rates and to gauge corresponding misalignments for the currencies in the two countries.     The relevance and usefulness of the exchange rate equilibrium and disequilibrium in the calculation of the PSEs for India and China are then discussed. Results from the commodity-specific measures including the Market Price Support (MPS) and the PSE show that agricultural support levels are quite sensitive to alternative exchange rate assumptions. Specifically, exchange rate misalignments have either amplified or counteracted the direct effect on agriculture from sectoral-specific policies. With a few commodity exceptions such an indirect effect in both countries is relatively small in magnitude and dominated by the direct effect. This is also the case when the indirect effect rises substantially as a result of more misaligned exchange rates. Counterfactual MPS measure calculated assuming the exchange rate is in equilibrium with different exchange rate pass-through is also presented. It is shown that when no exchange rate pass-through to domestic prices occurs, the transfer of the indirect effect of exchange rate misalignment into the counterfactual MPS is full. But when there is exchange rate pass-through, even though partially, the transfer of indirect effect is significantly smaller.  Results based on the commodity-specific PSE show that the exchange rate effect also depends on the relative importance of different PSE components. In addition to a positive impact on the direct effects measured by commodity-specific PSE compared to those measured by commodity-specific MPS, the increasing share of budgetary expenditures in India's agricultural support in recent years has resulted in more pronounced indirect effects. For China, the exchange rate effects are more similar between the PSE and the MPS measures at the commodity level because of the dominance of the MPS component relative to the budgetary payments in the PSEs.   Moving from commodity-specific to aggregate measures, one can observe a similar pattern of agricultural support. However, the exchange rate effect measured by the total PSE appears to be more important: it becomes several times larger in magnitude than the direct effect in periods of severe exchange rate misalignment. The exchange rate effect when the PSE is \"scaled up\" from covered commodities to an estimate for the total agricultural sector is also demonstrated even though the assumption imposed by scaling-up may be unrealistic if price support is concentrated among those products included in the analysis. Since the commodity coverage in both countries tends to be incomplete and the scaling-up procedure leads to a total MPS component of greater magnitude, larger exchange rate effects are found in the scaled-up than the non-scaled-up version of the total PSEs. The impact of scaling-up on the indirect effect is proportional to the share of covered commodities in the total value of agricultural production. Again for the PSEs at both the commodity and aggregate levels, the counter factual measures indicate a full transfer of indirect effect of exchange rate when no exchange rate pass-through is assumed. A large portion of the indirect effect disappears when incomplete exchange rate pass-through is assumed resulting in a smaller transfer of the effect to the counter factual PSEs.",
  "description_provenance": [
    "Author Email: fucheng@vt.edu",
    "Advisor Email: deyang@vt.edu",
    "Advisor Email: ashleyr@vt.edu",
    "Advisor Email: d.orden@cgiar.org",
    "Advisor Email: bfmills@vt.edu",
    "Advisor Email: petrsone@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:20Z (GMT). No. of bitstreams: 1 ETDFULL.pdf: 1381199 bytes, checksum: 0c029a1000bff756339af19fce7efd9b (MD5)   Previous issue date: 2005-10-04"
  ],
  "handle": "29256",
  "identifier_other": "etd-10122005-160731",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10122005-160731/",
  "identifier_uri": "http://hdl.handle.net/10919/29256",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETDFULL.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "producer support estimates",
    "exchange rate misalignment",
    "exchange rate equilibrium",
    "cointegration"
  ],
  "title": "Effects of Exchange Rate Misalignment on Agricultural Producer Support Estimates: Empirical Evidence from India and China",
  "type": "Dissertation"
}