{
  "contributor_author": "Malone, Sean M.",
  "contributor_committeechair": "Herbert, David Ames Jr.",
  "contributor_committeemember": [
    "Mullins, Donald E.",
    "Higley, Leon G.",
    "Mack, Timothy P.",
    "Holshouser, David L."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:17:19Z",
  "date_adate": "2001-10-17",
  "date_available": "2014-03-14T20:17:19Z",
  "date_issued": "2001-08-31",
  "date_rdate": "2002-10-17",
  "date_sdate": "2001-10-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Commercially available leaf area index (LAI) meters are tools that can be used in making insect management decisions.  However, proper technique must be determined for LAI estimation, and accuracy must be validated for the meters.  Full-season soybean require LAI values of at least 3.5 to 4.0 by early to mid-reproductive developmental stages to achieve maximum yield potential, but the relationship between double-crop soybean LAI and yield is unknown.  This research (1) evaluated minimum plot size requirements for mechanically defoliated soybean experiments using the LAI-2000 Plant Canopy Analyzer, (2) compared LAI estimates among LAI-2000 detector types which respond to different wavelengths of light, (3) compared LAI-2000 estimates with directly determined LAI values for 0, 33, 66, and 100% mechanical defoliation levels, (4) used linear and non-linear models to describe the response of full-season and double-crop soybean yields to reductions in LAI through mechanical defoliation, and (5) evaluated the response of double-crop soybean yields to reductions in LAI through insect defoliation.   The minimum plot size for obtaining accurate LAI estimates of defoliated canopies in soybean with 91 cm row centers is four rows by 2 m, with an additional 1 m at the ends of the two middle rows also defoliated.  The wide-blue detector, which is found in newer LAI-2000 units and responds to wavelengths of light from 360 to 460 nm, gave higher LAI estimates than the narrow-blue detector, which responds to light from 400 to 490 nm.  The unit with the narrow-blue detector gave estimates equal to directly determined LAI in two of three years for 0, 33, and 66% defoliation levels, while the units with the wide-blue detectors gave estimates higher than directly determined LAI in the two years that they were studied, except for a few accurate 33% defoliation estimates.  Therefore, the LAI-2000 usually provides reasonable estimates of LAI.  Yield decreased linearly with LAI when LAI values were below 3.5 to 4.0 by developmental stages R4 to R5 in both full-season and double-crop soybean.  Usually, there was no relationship between yield and LAI at LAI values greater than 4.0.  There was an average yield reduction of 820 ± 262 kg ha-1 for each unit decrease in LAI below the critical 3.5 to 4.0 level; maximum yields ranged from 1909 to 3797 kg ha-1.  Insect defoliators did not defoliate double-crop soybean plots to LAI levels less than 4.0, and there was no yield difference between insect-defoliated and control plots.  Therefore, double-crop soybean that maintains LAI values above the 3.5 to 4.0 critical level during mid-reproductive developmental stages is capable of tolerating defoliating pest",
  "description_provenance": [
    "Author Email: smalone@vt.edu",
    "Advisor Email: mullinsd@vt.edu",
    "Advisor Email: lhigley1@unl.edu",
    "Advisor Email: tmack@vt.edu",
    "Advisor Email: dholshou@vt.edu",
    "Advisor Email: herbert@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:19Z (GMT). No. of bitstreams: 1 malone.pdf: 481653 bytes, checksum: 8cc3badd73f4ef9dc95a1d3170d6fd19 (MD5)   Previous issue date: 2001-08-31"
  ],
  "handle": "29252",
  "identifier_other": "etd-10122001-100457",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10122001-100457/",
  "identifier_uri": "http://hdl.handle.net/10919/29252",
  "publisher": "Virginia Tech",
  "relation_haspart": "malone.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "defoliation",
    "plant canopy analyzer",
    "Glycine max",
    "leaf area index"
  ],
  "title": "Assessment of Soybean Leaf Area for Redefining Management Strategies for Leaf-Feeding Insects",
  "type": "Dissertation"
}