{
  "contributor_author": "Atasoy, Sibel",
  "contributor_committeechair": "Mills, Bradford F.",
  "contributor_committeecochair": "Parmeter, Christopher F.",
  "contributor_committeemember": [
    "Alwang, Jeffrey R.",
    "Peterson, Everett B.",
    "Ge, Suqin"
  ],
  "contributor_department": "Economics (Agriculture and Life Sciences)",
  "date_accessioned": "2014-03-14T20:17:20Z",
  "date_adate": "2009-10-30",
  "date_available": "2014-03-14T20:17:20Z",
  "date_issued": "2009-09-25",
  "date_rdate": "2011-09-05",
  "date_sdate": "2009-10-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is composed of three essays that analyze the significance of the Food Stamp Program (FSP) for low-income households. The first essay entitled â  Intensity of Food Stamp Use and Transient and Chronic Poverty: Evidence from the Panel Study of Income Dynamicsâ   examines the impact of intensity of use of FSP benefits on household exposure to transient and chronic poverty with respect to food and housing expenditures. The study finds that FSP is used for both long-term expenditure support and as a smoothing mechanism before the welfare reform, and only for smoothing expenditures after the welfare reform. Factors that influence both components of poverty are number of children, human capital, minority status and local economic conditions. Another finding is that shorter recertification periods reduce the length of FSP use, and indirectly result in higher poverty. <p> The second essay entitled â  The End of the Paper Era in the Food Stamp Program: The Impact of Electronic Benefits on Program Participationâ   documents the impact of the implementation of the statewide Electronic Benefits Transfer (EBT) system on household participation behavior in the entire period of nationwide implementation. The major finding is that the switch from paper coupons to EBT cards induces participation among eligible households, most likely by reducing the stigma associated with FSP participation. The effect of the EBT system on participation probabilities is the largest among households residing in the rural South, those not headed by a single mother or those with a White household head. <p> The third essay entitled â  The Dynamics of Food Stamp Program Participation: A Lagged Dependent Variable Approachâ   investigates the existence of state dependence and its sources by analyzing the dynamics of participation in the FSP using a lagged dependent variable approach. Results show that FSP receipt in the previous period is an important determinant of current FSP receipt. Estimated persistence rates declined significantly after 1996, suggesting that long-term welfare dependency was reduced after the welfare reform, at least with respect to the FSP. The source of state dependence in FSP participation among low-income households is mostly structural implying that a welfare trap does exist for these households.",
  "description_provenance": [
    "Author Email: sibela@vt.edu",
    "Advisor Email: bfmills@vt.edu",
    "Advisor Email: parms@vt.edu",
    "Advisor Email: alwangj@vt.edu",
    "Advisor Email: petrsone@vt.edu",
    "Advisor Email: ges@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:20Z (GMT). No. of bitstreams: 1 Atasoy_S_D_2009.pdf: 1730003 bytes, checksum: 60e7fef1c67c4099b0cb1cae6f55bd69 (MD5)   Previous issue date: 2009-09-25"
  ],
  "handle": "29258",
  "identifier_other": "etd-10122009-162211",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10122009-162211/",
  "identifier_uri": "http://hdl.handle.net/10919/29258",
  "publisher": "Virginia Tech",
  "relation_haspart": "Atasoy_S_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Electronic Benefits",
    "Poverty Dynamics",
    "State Dependence",
    "Food Stamp Program"
  ],
  "title": "Three Essays on Food Stamp Program Participation and Poverty Dynamics",
  "type": "Dissertation"
}