{
  "contributor_author": "Adams, John Edwin",
  "contributor_committeechair": "Morgan, Samuel D.",
  "contributor_committeemember": [
    "Parson, Stephen R.",
    "Wildman, Terry M.",
    "Pantili, Linda D.",
    "Morgan, Samuel D.",
    "Belli, Gabriella M."
  ],
  "contributor_department": "Community College Education",
  "date_accessioned": "2014-03-14T20:17:21Z",
  "date_adate": "1997-11-18",
  "date_available": "2014-03-14T20:17:21Z",
  "date_issued": "1997-10-31",
  "date_rdate": "1997-11-18",
  "date_sdate": "1997-10-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A Study to Determine the Impact of a Precollege Intervention on Early Adolescent Aspiration and Motivation for College in West Virginia    John E. Adams  (ABSTRACT)  \tThe impact of a precollege intervention, the Junior High Washington Gateway Academy (JHWGA), on early adolescent aspiration and motivation for a college education was measured. JHWGA provided an intensive week of activities in career planning, self-concept improvement, and study skills. Specific research questions were: a) did participation in this program increase career readiness, self-concept, productive study habits, aspiration, and motivation to prepare for college? b) what percent of the variance in aspiration to and motivation for college in early adolescents could be explained by career readiness, self-esteem, and study habits?   \tUsing survey research, a questionnaire was developed with five scales (career readiness, self-esteem, study habits, aspiration, and motivation). Questionnaires were sent to 301 West Virginia students in Grade 8 who had been JHWGA applicants in 1996. The 265 (88%) who responded were divided into two groups: a participant group consisting of 104 students who participated in the 1996 program and a comparison group consisting of 161 students who did not attend the 1996 program.  \t \tT-tests and chi square tests revealed no significant differences between groups. Multiple regressions were performed for the aspiration and motivation variables using career readiness, self concept, and study scales as independent variables. An assumption of normal variance was found to be violated because subjects favored endpoints on Likert scale causing data to be skewed. Career readiness, self-concept, and study habits (using transformation and excluding several outliers) were found to explain 59 percent of the variance in the aspiration model. However, two regressors (study habits and career readiness) were discovered to be highly correlated (r = .66). Only one regressor for the motivation model (study habits) was found to be significant.  \t \tData results may have been affected by group differences, group selection, and lack of normal distribution. The two groups being measured were found to be unevenly matched with JHWGA participants having significantly lower grades than the comparison group. Based on this information and the low variance in data collected, results are believed to have been inconclusive regarding the effectiveness of JHWGA. Recommendations for further research are included.",
  "description_provenance": [
    "Author Email: jadams@wvnet.shepherd.edu",
    "Advisor Email: samorgan@vt.edu   gbelli@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:21Z (GMT). No. of bitstreams: 1 etd.pdf: 254280 bytes, checksum: 7d520ad478ac6130e943161b812f4a54 (MD5)   Previous issue date: 1997-10-31"
  ],
  "handle": "29268",
  "identifier_other": "etd-101397-15292",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-101397-15292/",
  "identifier_uri": "http://hdl.handle.net/10919/29268",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "aspiration",
    "motivation",
    "expectations",
    "career readiness",
    "self-concept",
    "study habits",
    "predisposition in college choice",
    "early adolescents",
    "precollege interventions",
    "West Virginia"
  ],
  "title": "A Study to Determine the Impact of a Precollege Intervention Program on Early Adolescent Aspiration and Motivation for College in West Virginia",
  "type": "Dissertation"
}