{
  "contributor_author": "Rose, Brett Tyler",
  "contributor_committeechair": "Mauldon, Matthew",
  "contributor_committeemember": [
    "Dymond, Randel L.",
    "Martin, James R. Jr.",
    "Gutierrez, Marte S.",
    "Drumm, Eric C."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:17:21Z",
  "date_adate": "2005-10-25",
  "date_available": "2014-03-14T20:17:21Z",
  "date_issued": "2005-09-29",
  "date_rdate": "2005-10-25",
  "date_sdate": "2005-10-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Rockfall Management System developed for Tennessee DOT (TennRMS)integrates a customized rockfall risk rating system, web-based GIS application, and rockfall database to provide a robust single interface for interacting with rock slope information. The system should prove to be a valuable tool for the proactive management of rock slopes. The most important use of the system will be to identify and prioritizing rock slopes with the greatest potential for rockfall in order to provide decision makers with all the necessary information they need to plan remediation efforts. Over time, TennRMS can be used to track costs and effectiveness of different remediation methods used on problem rock slopes.  Three papers have been developed for publication in peer reviewed journals. The papers describe the work done in support of developing Tennessee's Rockfall Management System (TennRMS) and its components. The system can be described by its conceptual framework and actual implemented components. Asset management incorporating risk & decision analysis and knowledge management makes up the conceptual framework. The system components include a field data collection system using PDA's, a rockfall database and a web-based GIS interface. The papers articulate the development and implementation of the various components and to provide a detailed review of rockfall management systems as implemented over the past 15 years.",
  "description_provenance": [
    "Author Email: brose@vt.edu",
    "Advisor Email: dymond@vt.edu",
    "Advisor Email: jrm@vt.edu",
    "Advisor Email: magutier@vt.edu",
    "Advisor Email: edrumm@utk.edu",
    "Advisor Email: mauldon@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:21Z (GMT). No. of bitstreams: 1 Brett_Rose-Dissertation.pdf: 4733680 bytes, checksum: 40a31a6b762e06df0ddf85dad99fe31e (MD5)   Previous issue date: 2005-09-29"
  ],
  "handle": "29263",
  "identifier_other": "etd-10132005-133738",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10132005-133738/",
  "identifier_uri": "http://hdl.handle.net/10919/29263",
  "publisher": "Virginia Tech",
  "relation_haspart": "Brett_Rose-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Hazard and Risk Assessment",
    "Information Technology",
    "Rockfall Management",
    "Landslide",
    "Geographic Information Systems (GIS)"
  ],
  "title": "Tennessee Rockfall Management System",
  "type": "Dissertation"
}