{
  "contributor_author": "Lee, Changyeol",
  "contributor_committeechair": "King, Scott D.",
  "contributor_committeemember": [
    "van Keken, Peter E.",
    "Angel, Ross J.",
    "Weiss, Chester J.",
    "Hole, John A."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:17:20Z",
  "date_adate": "2010-10-25",
  "date_available": "2014-03-14T20:17:20Z",
  "date_issued": "2010-10-05",
  "date_rdate": "2011-10-25",
  "date_sdate": "2010-10-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Subduction is a dynamic and time-dependent process which requires time-dependent models for its study. In addition, due to the very high pressures within the Earthâ  s interior, an evaluation of the role of compressibility in subduction studies should be undertaken. However, most subduction studies have been conducted by using kinematic, steady-state, and/or incompressible mantle convection models; these simplifications may miss important elements of the subduction process. In this dissertation, I evaluate the effects of time-dependence and compressibility on the evolution of subduction by using 2-D Cartesian numerical models. The effect of compressibility on the thermal and flow structures of subduction zones is evaluated by using kinematically prescribed slab and steady-state models. The effect of compressibility is primarily expressed as an additional heat source created by viscous dissipation. The heat results in thinner thermal boundary layer on the subducting slab and increases slab temperatures. With that exception, the effect of compressibility is relatively small compared with, for example, the effect of the mantle rheology on the thermal and flow structures of the mantle wedge. Plate reconstruction models show that the convergence rate and age of the incoming plate to trench vary with time, which poses a problem for steady-state subduction models. Thus, I consider the time-dependent convergence rate and age of the incoming plate in the kinematic-dynamic subduction models in order to understand the localization of high-Mg# andesites in the western Aleutians. The results show that the localization of high-Mg# andesites is a consequence of the time-dependent convergence rate and slab age along the Aleutian arc. The influence of mantle and slab parameters as well as compressibility on the slab dynamics is evaluated by using 2-D dynamic subduction models. The results demonstrate that periodic slab buckling in the mantle results in periodic convergence rate and dip of the subducting slab; time-dependence is a natural expression of subduction. The effect of compressibility on the slab dynamics is not significant. The periodic convergence rate and dip of the subducting slab explain time-dependent seafloor spreading at the mid-ocean ridge, convergence rate of the oceanic plate at trench and arc-normal migration of arc volcanoes.",
  "description_provenance": [
    "Author Email: changyeol.lee@gmail.com",
    "Made available in DSpace on 2014-03-14T20:17:20Z (GMT). No. of bitstreams: 1 Lee_C_D_2010.pdf: 4049977 bytes, checksum: da1cee5cf35d22afbe31af27860edadb (MD5)   Previous issue date: 2010-10-05"
  ],
  "handle": "29260",
  "identifier_other": "etd-10122010-215256",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10122010-215256/",
  "identifier_uri": "http://hdl.handle.net/10919/29260",
  "publisher": "Virginia Tech",
  "relation_haspart": "Lee_C_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Compressibility",
    "Numerical model",
    "Periodic slab buckling",
    "Subduction zone",
    "Aleutian island arc",
    "Viscous dissipation",
    "High-Mg# andesite"
  ],
  "title": "Compressible Convection and Subduction: Kinematic and Dynamic Modeling",
  "type": "Dissertation"
}