{
  "contributor_author": "Sherrer, Brenda Joyce",
  "contributor_committeechair": "Wolf, James F.",
  "contributor_committeemember": [
    "Gooden, Susan T.",
    "Rees, Joseph V.",
    "White, Orion F. Jr."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:17:22Z",
  "date_adate": "2006-02-22",
  "date_available": "2014-03-14T20:17:22Z",
  "date_issued": "2005-09-19",
  "date_rdate": "2006-02-22",
  "date_sdate": "2005-10-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation proposes that Dr. Mary C. Gentilel's (1998) descriptive Reframing Diversity model provides for the development of a public sector diversity program.  The Reframing Diversity model does not suggest that diversity programs conform to a \"one-size-fits all\" design.  \t The dissertation applied the lenses (motivation, mindset, method, and measure) of Gentile's Reframing Diversity model to the Federal Deposit Insurance Corporation (FDIC) diversity program.  The lenses of Gentile's model offer questions that are straightforward, easy to understand, and organizationally specific.  Additionally, the project utilized the generally accepted approach for qualitative inquiry supported by Rubin and Rubin (1995)  to develop an interview protocol for selected FDIC employees. \tThe most salient characteristic of Gentile's model, the lenses, apply to any program regardless of the target audience.  The lenses of Gentile's model are the architecture upon which a public sector organization could build a successful diversity program.  The model's descriptive nature allows public organizations to develop diversity programs that are voluntary in nature; inclusive of its total employee population; and incorporated into its day-to-day activities.",
  "description_provenance": [
    "Author Email: bsherrer@msn.com",
    "Advisor Email: stgooden@vcu.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Advisor Email: mcswite@sbcglobal.net",
    "Made available in DSpace on 2014-03-14T20:17:22Z (GMT). No. of bitstreams: 6 TitlePage.pdf: 4670 bytes, checksum: b35232cc2c01110cc0f74101591d9f17 (MD5) Abstract.pdf: 9344 bytes, checksum: 87fb466fbcb4ecef4e14b3b070731404 (MD5) Dedication.pdf: 3410 bytes, checksum: 8d0ae872afbd76a100c3ef53da94cfb2 (MD5) Acknowledgements.pdf: 7425 bytes, checksum: e902915adcc17e9cd17ff8eadb7b6a41 (MD5) TABLEOFCONTENTS.pdf: 12536 bytes, checksum: 4fa201e028520243f4e28927177c2318 (MD5) TheBody.pdf: 1021160 bytes, checksum: 10c9984688bbae115d7d712273e8faca (MD5)   Previous issue date: 2005-09-19"
  ],
  "handle": "29274",
  "identifier_other": "etd-10142005-215013",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10142005-215013/",
  "identifier_uri": "http://hdl.handle.net/10919/29274",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "TitlePage.pdf",
    "Abstract.pdf",
    "Dedication.pdf",
    "Acknowledgements.pdf",
    "TABLEOFCONTENTS.pdf",
    "TheBody.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "workforce demographics",
    "public sector"
  ],
  "title": "Using Gentile's Reframing Diversity Model In Public Organizations: FDIC As An Illustration",
  "type": "Dissertation"
}