{
  "contributor_author": "Kilian, Lars",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "Riffle, Judy S.",
    "Esker, Alan R.",
    "McGrath, James E.",
    "Morris, John R."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:17:22Z",
  "date_adate": "2004-12-03",
  "date_available": "2014-03-14T20:17:22Z",
  "date_issued": "2004-07-21",
  "date_rdate": "2004-12-03",
  "date_sdate": "2004-10-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Dimethacrylate monomers containing two cleavable tert-butyl ester groups were synthesized and utilized in the synthesis of star-shaped polymers. Star polymer coupling was achieved by reacting the living poly(alkyl methacrylate) using 2,5-dimethyl-2,5-hexanediol dimethacrylate (DHDMA) or dicumyl dimethacrylate (DCDMA). These starshaped polymers were cleaved under hydrolytic conditions, leading to significant reductions in molecular weights. The cleavable star-shaped polymers also underwent uncatalyzed degradation at elevated temperatures. Pressure-sensitive adhesive (PSA) copolymers based on 2-ethylhexyl acrylate (EHA) were synthesized containing cleavable branching comprised of either DHDMA or DCDMA. Extremely high molecular weight branched polymers were obtained, and these branched adhesives exhibited 180° peel strengths that displayed a strong dependence on the weight-average molecular weights.  The PSA branching sites were cleaved via acid-catalyzed hydrolysis, drastically lowering the 1180° peel strengths of the cleaved linear polymers between 75 and 95 percent.     Branched poly (EHA) PSAs containing 2-hydroxyethyl methacrylate (HEMA) and ethylene glycol dimethacrylate (EGDMA), as well as poly(EHA-co-HEMA), were synthesized and modified with photoactive functional groups. Cinnamate functionalized PSAs underwent photocrosslinking under UV light, leading to significant losses in 180° peel strengths. The acrylate functionalized PSAs were mixed with a photoinitiator, and following crosslinking under visible light, these PSAs exhibited excellent deactivation characteristics.       Poly(methyl methacrylate) containing aliphatic diols were synthesized via anionic polymerization utilizing the novel protected functional co-initiator 1,1-bis-, 4'-(2-(tertbutyldimethylsilyloxy) ethoxy)phenylethylene (BTOPE). Following the coupling of BTOPE with sec-butyl lithium, methyl methacrylate was polymerized in living fashion at -78 °C in THF. A broad molecular weight range of BTOPE-initiated PMMA samples were synthesized, and molecular weight distributions were as low as 1.03 were observed.  Hydrolytic deprotection of the protecting groups resulted in α,α-dihydroxy PMMA.     The graft macromonomers poly(tert-butyl styrene-block-styrene) methacrylate and poly(styrene-block-tert-butyl styrene) methacrylate were synthesized from the corresponding diblock copolymer alcohols utilizing acid chloride chemistry. Excellent molecular weight control, narrow molecular weight distributions, and perfect crossover were observed in both types of diblock polymers. The macromonomers were copolymerized with methyl methacrylate via solution free-radical copolymerization. The styrene blocks in the purified graft copolymers were selectively sulfonated using acetyl sulfate.",
  "description_provenance": [
    "Author Email: lkilian@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: aesker@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: jrmorris@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:22Z (GMT). No. of bitstreams: 1 Lars-Kilian-Dissertation.pdf: 2148140 bytes, checksum: 5b5d79294236b00154df52194fbceff9 (MD5)   Previous issue date: 2004-07-21"
  ],
  "handle": "29277",
  "identifier_other": "etd-10152004-064343",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10152004-064343/",
  "identifier_uri": "http://hdl.handle.net/10919/29277",
  "publisher": "Virginia Tech",
  "relation_haspart": "Lars-Kilian-Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Thermal Degradation",
    "Hydrolysis",
    "Free Radical Polymerization",
    "Anionic Polymerization",
    "Adhesives",
    "Macromonomer",
    "Branched Polymers"
  ],
  "title": "Synthesis and Characterization of Responsive Poly(Alkyl Methacrylate) Topologies",
  "type": "Dissertation"
}