{
  "contributor_author": "Jung, Hyung-il",
  "contributor_committeechair": "Olsen, Michael D.",
  "contributor_committeemember": [
    "Sumichrast, Robert T.",
    "Murrmann, Suzanne K.",
    "Khan, Mahmood A."
  ],
  "contributor_department": "Hospitality and Tourism Management",
  "date_accessioned": "2014-03-14T20:17:22Z",
  "date_adate": "2004-11-29",
  "date_available": "2014-03-14T20:17:22Z",
  "date_issued": "2004-09-22",
  "date_rdate": "2004-11-29",
  "date_sdate": "2004-10-15",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Despite the impact of Information Technology (IT) in today's service economy, its nature and role are elusive or ambiguous to say the least.  This ambiguity has made it so difficult to measure the value of IT.  To clarify the ambiguity, this study, with a focus on the strategic dimension of IT application in the web of organizational activities, proposes a conceptual model that relates IT application to Knowledge Management and then to Strategy.  In this effort, incorporating the Co-alignment model as a theoretical binding agent, the role of IT is defined as a facilitator of organizational knowledge management that is regarded as the core of strategic management.   The conceptual model proposed is further developed into a structural model for empirical testing.  The goodness of fit of the model is assessed through the technique of the Structural Equation Modeling (SEM) along with first-order and second-order confirmatory factor analyses (CFA) using the survey responses of unit managers of multi-unit restaurant companies of the U.S. and Korea.  Since the mail survey was conducted in two different nations, relevant multi cultural issues are also addressed to justify the use of combined samples for the study.  The results of the statistical analyses indicate that IT application can be incorporated successfully into the domain of strategic management of restaurant companies as the facilitator of Knowledge Management activities.  The hypotheses of the links between IT application and financial performance remained unsolved due to invalid data.  However, this study made a certain degree of contribution in identifying the dynamics of IT application in the process of strategic management incorporating the principle of the Co-alignment model.",
  "description_provenance": [
    "Author Email: hjung@roosevelt.edu",
    "Made available in DSpace on 2014-03-14T20:17:22Z (GMT). No. of bitstreams: 1 dissertation-hjung-02.pdf: 935519 bytes, checksum: 14f8287722ab5989bc438ad75b5f5483 (MD5)   Previous issue date: 2004-09-22"
  ],
  "handle": "29276",
  "identifier_other": "etd-10152004-001208",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10152004-001208/",
  "identifier_uri": "http://hdl.handle.net/10919/29276",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation-hjung-02.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "information technology",
    "knowledge transfer",
    "knowledge creation",
    "co-alignment principle",
    "strategy",
    "strategic value",
    "structural equation modeling",
    "restaurant firms",
    "knowledge management",
    "multi-cultural issues"
  ],
  "title": "An Exploratory Study of the Strategic Value of Information Technology: A Theoretical Application of the Co-Alignment Model",
  "type": "Dissertation"
}