{
  "contributor_author": "Stuart, Carolyn L.",
  "contributor_committeecochair": [
    "Lawson, Gerard F.",
    "Burge, Penny L."
  ],
  "contributor_committeemember": [
    "Bodenhorn, Nancy E.",
    "Day-Vines, Norma L."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:17:22Z",
  "date_adate": "2008-11-17",
  "date_available": "2014-03-14T20:17:22Z",
  "date_issued": "2008-09-10",
  "date_rdate": "2008-11-17",
  "date_sdate": "2008-10-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Consumers of mental health services are recognized as experts due to their rich lived experiences. Because of their expert status, they are expected to play a vital role in the re-shaping of mental health systems by determining what culturally competent services look like and how services are provided to culturally diverse populations. Therefore, it is essential that the consumersâ   voices, choices and roles in transforming the mental health system are included in assessing the cultural competence of mental health counselors (New Freedom Commission, 2003). There is a significant gap in the literature regarding the consumersâ   unique perspective (Pope-Davis et al., 2002). There is a need for both qualitative studies and studies that focus on consumers to gain a deeper, richer insight of the consumersâ   perspective (Rubin & Rubin, 1995). A qualitative phenomenological design was used to give voice to three participants regarding their perceptions of cultural competence in the counseling relationship. Phenomenological interviews were used to explore in depth and with diversity the participantsâ   subjective meaning of the lived experience (Denzin & Lincoln, 2003). Constant comparative research methods were used to analyze the data. Four themes naturally emerged from the data. Theme 1) Defining Cultural Competence was discussed as being inclusive of all differences; not focusing solely on race or ethnicity, including more than recognizing obvious differences, and counselorsâ   willingness to raise and engage in the issue of culture. Theme 2) Counselor Attitude participants voiced that counselorsâ   attitude plays a significant role in whether certain topics are broached and how much is shared about the topic. They reported what counselors convey through their attitude and interactions as being more important than what they convey verbally. Theme 3) The Counseling Relationship was discussed in regard to the importance of counseling relationships that fosters an environment of safety where sharing information and teaching and learning is reciprocal between counselor and consumer and Theme 4) Counselor Attributes were found to be more important than counseling techniques and theories. The findings are presented in a discussion of themes with narratives developed about each case.",
  "description_provenance": [
    "Author Email: clstuart@vt.edu",
    "Advisor Email: glawson@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: nanboden@vt.edu",
    "Advisor Email: ndayvine@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:22Z (GMT). No. of bitstreams: 1 CLStuartETD.pdf: 1288228 bytes, checksum: 7b6d08409dda69e1b2b88f4849a6cf65 (MD5)   Previous issue date: 2008-09-10"
  ],
  "handle": "29275",
  "identifier_other": "etd-10142008-161612",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10142008-161612/",
  "identifier_uri": "http://hdl.handle.net/10919/29275",
  "publisher": "Virginia Tech",
  "relation_haspart": "CLStuartETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Qualitative",
    "Perceptions",
    "Cultural Competence",
    "Consumer"
  ],
  "title": "Consumers' Perceptions of Cultural Competence in the Counseling Relationship: A Phenomenological Study",
  "type": "Dissertation"
}