{
  "contributor_author": "Hergert, Thomas  Robert Jr.",
  "contributor_committeechair": "Dodi, Norman R.",
  "contributor_committeemember": [
    "Magliaro, Susan G.",
    "Jones, Eluned C.",
    "Holmes, Glen A.",
    "Burton, John K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:24Z",
  "date_adate": "1997-12-02",
  "date_available": "2014-03-14T20:17:24Z",
  "date_issued": "1997-08-22",
  "date_rdate": "1998-12-02",
  "date_sdate": "1997-08-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>\t This study explores the use of a multimedia survey instrument      which includes an integrated treatment in the context of a one      semester human sexuality course. The instrument was created to      assess and affect student attitudes and to improve data collection      and analysis options. A literature review on attitudes, attitude      assessment, and applications of technology to the affective domain      introduces the discussion.<p>  Developed by a team of three university researchers, the survey      instrument was created as a stand-alone application using      Macromedia Authorware® multimedia authoring system. The instrument      was administered to 210 students in a university education      technology laboratory via CD-ROM with data collected across the      campus network to two remote servers. Due to problems within      specific response sets, 21 users' responses were removed from the      data set, leaving an N of 189 respondents in the analyzed data. <p>      The application was administered to the students twice, once early      and once late in the semester. Each use included demographic data      acquisition and two iterations of a 24-item survey instrument with      audiovisual and reflective response treatment between them. There      were also repines sections on truth of responses and evaluations      of the multimedia instrument. The final interactions were      opportunities for free text responses with no prompting on      content. The four sets of responses to the 24-item survey      comprised pretest/posttest data for six pairings of scores across      time. <p>      The 24-item survey was explored for the effects of both the      multimedia/reflective response treatment and of the human      sexuality course on student attitudes. Statistical analysis showed      no significant differences in scores among the four iterations of      the survey. Further exploration indicated that there were some      significant changes for specific survey items. <p>      This document examines the relationship among the elements of the      survey and the free responses from the users for further      illumination of the quantitative results. Five possible elements      that may have affected the survey's outcome are considered in      light of the respondents' text input. Themes that emerged from the      free responses were identified and explored for possible      improvements of multimedia applications for integrated information      delivery and data gathering. <p>      Conclusions are discussed and suggestions are made for further      study regarding the template on which the application under study      was built and regarding other similar multimedia instruments.      These include extensions into other disciplines and other types of      delivery media. Because of the exploratory nature of this study,      very little can be stated conclusively. The users' reactions to      and engagement with the multimedia instrument in this context do      suggest broader avenues for such applications. For the moment,      this medium seems to present a useful range of options to      designers and researchers.",
  "description_provenance": [
    "Author Email: hergert@vt.edu",
    "Advisor Email: dodl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:24Z (GMT). No. of bitstreams: 1 Hergert14.pdf: 1625986 bytes, checksum: 2a9056a2defe42dacb8696121e672d8f (MD5)   Previous issue date: 1997-08-22"
  ],
  "handle": "29288",
  "identifier_other": "etd-101697-204150",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-101697-204150/",
  "identifier_uri": "http://hdl.handle.net/10919/29288",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hergert14.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Sexuality",
    "Video",
    "Instructional Technology",
    "Multimedia",
    "Attitudes"
  ],
  "title": "An Exploration of Assessing, Affecting, and Analyzing Attitudes and Attitude Change through the Use of a Multimedia Survey Instrument",
  "type": "Dissertation"
}