{
  "contributor_author": "Zhang, Fajian",
  "contributor_committeechair": "Claus, Richard O.",
  "contributor_committeemember": [
    "Lu, Guo-Quan",
    "Guido, Louis J.",
    "Farkas, Diana",
    "Spillman, William B. Jr."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:17:25Z",
  "date_adate": "2002-10-29",
  "date_available": "2014-03-14T20:17:25Z",
  "date_issued": "2002-09-26",
  "date_rdate": "2003-10-29",
  "date_sdate": "2002-10-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>  In recent years, electro-optic polymers have been used to make various optical devices in the telecommunication field due to several advantages, such as large and fast electro-optic (EO) response. Semiconductor nano-crystals promise even higher response speed due to the unique quantum confinement mechanism, and they also show very high EO response because of surface and quantum size effects.   </p> <p>     Many investigative efforts have been made in the area of semiconductor nano-clusters. These efforts mainly focus on synthesizing high quality particles, and their physical and chemistry properties (luminescence spectra, nonlinear optical, and other effects), but their electro-optic properties and potential uses in devices have not been fully investigated, so there is still much work to do in this aspect. For application of electro-optic polymers in electro-optic devices, the challenges are to develop more stable electro-optic polymers with higher electro-optic coefficients.     </p> <p>  The electrostatic self-assembly (ESA) technique has many advantages over traditional polymer electro-optic film synthesis processes, such as spin coating. For ESA-generated EO films, no poling field is needed, high orientation of the EO polymer can be obtained which does not degrade with time, so the films can be very stable, and this processing is easily compatible with semiconductor VLSI technology. This is a very attractive technique.  </p> <p>    The goal of this research is to develop new electro-optic materials by means of ESA techniques and to use them to form improved performance next generation electro-optic devices, with emphasis on two kinds of electro-optic materials: nano-sized II-VI semiconductors (CdS, CdSe), and electro-optic active polymers (chromophores), and their potential use in electro-optic devices.    </p> <p>   In this research work, II-VI semiconductor nano-clusters have been synthesized, with particle diameters ranging from 4 nm to several tens of nanometers. There is a difference in peak positions of absorption and photo luminescence spectra, related to defects in nano-crystals. Larger CdS particles have larger differences than small CdSe particles. Particle sizes measured by absorption spectrum and by HRTEM methods are very close. Based on quantum mechanical theory, peak spectral shifts as a function of particle size can be predicted, but the theoretical results are typically far from the experimental results, because many complicating factors should be considered. Films fabricated by ESA have much stronger absorption than spin coated films, and exhibit a slight blue shift in peak position wavelength. Photo luminescence spectra also show a blue shift for ESA films with respect to spun films.             </p> <p>   Polymeric electro-optic films were also fabricated by the ESA technique. Effects due to applying an external electrical field during the ESA process on film growth and properties have also been investigated. Peak position, optical density and wavelength at maximum absorption, all increase with the number of bilayers, and films made under external fields have lower absorption and peak wavelength than those of films fabricated without an external field. These results are related to the order parameter, and indicate that molecule alignment can be improved by the application of an external field during the process of ESA film growth.    </p> <p>   CdSe nano-clusters have a much higher electro-optic coefficient than their bulk crystal counterparts. In comparison with polymers, they have totally different origins in their electro-optic effects. For both nano-cluster-and chromophore based ESA films, electro-optic coefficients are hi  gher than those of spin-coated films, and no poling voltage is needed. The reasons have been fully discussed. This result means that the ESA technique is effective to align and hold the dipoles in films and to intensify the electro-optic effect.    </p> <p>   CdSe quantum dots need 17. 5 ms to complete their physical orientation due to a rotation of the permanent dipole moment. Therefore, at lower frequencies (<100Hz), electro-optic modulation mainly stems from the orientation of the permanent dipole moment. At frequencies higher than 100 Hz, the electro-optic modulation mainly arises from the induced dipole moment orientation and pure electron movement.   </p> <p>   The ratio of the electro-optic coefficients r333/r113  > 3. This means that ESA films cannot be treated as an ideal isotropic system with the C  v symmetry, and interactions should be considered. Quadratic Kerr electro-optic coefficients have a similar frequency dependence to that of the linear electro-optic coefficients r333 and r113. This indicates that the orientational distribution of the CdSe quantum dots particularly contributes to the quadratic electro-optic modulation.    </p> <p>   From the FT-IR measurement of the films, proton irradiation can break the N=N double bonding in pi-conjugated bridges, leading to damage of the conjugating structure, so causing a decrease of the EO coefficient. But the thermal and temporal stability of ESA films are much better than those of spin coated films; this is a significant feature of ESA technique.    </p> <p>   The effect of an external field and film thickness on the optical and electro-optic properties of ESA films has been investigated. Electro-optic coefficient decreases with thickness. Electrical field influences the electronic states of the chromophores.   </p> <p>   Based on the properties of electro-optic films, the applications of polymer and nano-cluster electro-optic films are discussed. A nano-cluster CdSe electro-optic film has a higher refractive index than the PS-119 polymer film, and these values they are much lower than that of semiconductor wafers, but slightly higher than optical silica glasses. Accordingly optical silica glasses are the ideal substrates for those films. By analysis, the cutoff thickness was determined, which defines the minimum film thickness required for light propagation. For channel waveguides, the aspect ratio w/t, w, and t are determined versus the refractive index of the electro-optic films. Modulator beam length and modulation index were discussed, for high speed operation. Modulator beam length should be carefully chosen to obtain high modulation index; similarly important is the refractive index match between core, substrate, and cladding layers. For high speed operation, traveling wave electrode designs were considered, based on effective refractive index and impedance matching. The effective dielectric constant and characteristic impedance as a function of electrode configuration (sizes) were diagramed, and this served as a basic design suggestion for traveling wave electrodes.</p>",
  "description_provenance": [
    "Author Email: fajianzhang@hotmail.com",
    "Advisor Email: roclaus@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:25Z (GMT). No. of bitstreams: 7 04Chapter_2.pdf: 1491194 bytes, checksum: 8da41206edc0bb9331e019517cd7bf0e (MD5) 05Chapter_3.pdf: 877292 bytes, checksum: b3be9118afb5e6d3bcc7668312f75691 (MD5) 07Chapter_5.pdf: 13426 bytes, checksum: 9686569dcb3469c32efb2909c3fe75c9 (MD5) 06Chapter_4.pdf: 241737 bytes, checksum: 84b241c4e070b2a039a49fb2d16971c3 (MD5) 01abstract.pdf: 13376 bytes, checksum: f415379e647f55246ac7afedc1c9a10e (MD5) 02Table_of_Contents.pdf: 24338 bytes, checksum: 98e97ec463380c3c0dd26229a77d7b38 (MD5) 03Chapter_1.pdf: 41314 bytes, checksum: cfaceaf9e2d8d4a053da9436077759e8 (MD5)   Previous issue date: 2002-09-26"
  ],
  "handle": "29289",
  "identifier_other": "etd-10172002-101754",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10172002-101754/",
  "identifier_uri": "http://hdl.handle.net/10919/29289",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "04Chapter_2.pdf",
    "05Chapter_3.pdf",
    "07Chapter_5.pdf",
    "06Chapter_4.pdf",
    "01abstract.pdf",
    "02Table_of_Contents.pdf",
    "03Chapter_1.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Semiconductor nano-clusters",
    "Electro-optics",
    "Thin Films"
  ],
  "title": "Electro-optic Properties of Semiconductor Nano-crystals And Electro-optic Polymers And Their Applications",
  "type": "Dissertation"
}