{
  "contributor_author": "Silva, Polly M.",
  "contributor_committeecochair": [
    "Wiswell, Albert K.",
    "Callahan, Jamie L."
  ],
  "contributor_committeemember": [
    "Boyle, Jon",
    "Combs, Paul William"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:17:24Z",
  "date_adate": "2007-11-07",
  "date_available": "2014-03-14T20:17:24Z",
  "date_issued": "2007-10-01",
  "date_rdate": "2007-11-07",
  "date_sdate": "2007-10-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The study explored incidental learning in the workplace. Three research questions guided the study: 1.\tWhat is the nature of incidental learning in the workplace?   2.\tHow does professional context impact incidental learning?  3.\tHow do incidental learners know they know in the workplace?  A series of three interviews were done with seven human resource professionals and with seven engineers following Seidmanâ  s phenomenological interview protocol.  The first interview focused on the participantâ  s life history concentrating on the context of the participantâ  s early learning experiences and their professional choices.  The second interview provided details of the participantâ  s current incidental learning experiences and an example of their current professional tasks. The third interview provided an opportunity for the participants and me to explore the meaning of their experiences.  Analysis of individual experiences was done via profiles, and an analysis of thematic findings was done across all participants.    Findings showed that in the â  lived worldâ   the experience of the participants and the nature of incidental learning is mediated by the individualâ  s conception of learning and by the individualâ  s learning style.  At a professional level, frames and reflection-in and on-action further guide the focus of and validation of the incidental learning.  For the researcher â   and perhaps for co-workers or for participants themselves â   incidental learning is easy to overlook; lessons learned often appear to be simply common sense after the fact.   This may, in part, be due to the fact that the stories of incidental learning ultimately had successful outcomes.  This study confirmed and expanded the importance and impact of context on incidental learning, showing how the elements of an individualâ  s personal and professional context also impact incidental learning.  Recommendations for future research and implications for practice were provided. Recommendations for future research included: replicating the study to explore incidental learning in more professions and to explore of the impact of formal higher education on incidental learning.  Process recommendations include studying incidental learning as an adjunct to other studies of organizational learning and as a part of an action research project.  These methods allow the researcher to study the construct indirectly and as it happens.",
  "description_provenance": [
    "Author Email: psilva@vt.edu",
    "Advisor Email: jboyle14@cox.net",
    "Advisor Email: combs_paul@bah.com",
    "Advisor Email: awiswell@vt.edu",
    "Advisor Email: jcallahan@tamu.edu",
    "Made available in DSpace on 2014-03-14T20:17:24Z (GMT). No. of bitstreams: 1 silva.pdf: 938675 bytes, checksum: ba974698d9fec47556a6a5147182c02e (MD5)   Previous issue date: 2007-10-01"
  ],
  "handle": "29287",
  "identifier_other": "etd-10162007-224008",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10162007-224008/",
  "identifier_uri": "http://hdl.handle.net/10919/29287",
  "publisher": "Virginia Tech",
  "relation_haspart": "silva.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Incidental Learning",
    "Workplace Learning"
  ],
  "title": "Epistemology of Incidental Learning",
  "type": "Dissertation"
}