{
  "contributor_author": "Trimble, Tammy Elizabeth",
  "contributor_committeechair": "Dudley, Larkin S.",
  "contributor_committeemember": [
    "Tedesco, John C.",
    "Wamsley, Gary L.",
    "Wolf, James F."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:17:26Z",
  "date_adate": "2010-12-01",
  "date_available": "2014-03-14T20:17:26Z",
  "date_issued": "2010-10-04",
  "date_rdate": "2010-12-01",
  "date_sdate": "2010-10-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation explored the differences in federal budget communication associated with the development and passage of the Federal Budget Resolution for Fiscal Years 1999, 2000, and 2001. A computer-aided (i.e., DICTION) content analysis was completed to explore Executive, Legislature, and Agency budget communication for source-based and party-based differences. Source-based differences were explored using the variables Activity, Realism, Optimism, Commonality, Certainty, Public Interest, Budget Concepts, and Functional Budget Categories. When reviewing the findings as a whole â   and taking into account the variables, data, and time period analyzed - a distinct and predominant source-based perspective was not present in the federal budget communication associated with the development of the Congressional Budget Resolution. However, it was possible to identify predominant sources for individual variables Activity, Optimism, Commonality, and Certainty.   Party-based differences were explored within seven themes: the use of Lakoffâ  s value language; discussions of campaign actors; coalition building rhetoric; moral virtue and entrepreneurialism rhetoric; language of order, efficiency and unity; public interest; and, accusatory language. Variables included Liberal Language, Conservative Language, Party References, Voter References, Leader References, Commonality, Familiarity, Realism, Human Interest, Rapport, Praise, Inspiration, Liberation, Tenacity, Communication, Denial, Public Interest, Blame, and Pessimism. The analysis of party-based differences revealed that Democrats were more likely to incorporate language associated with the following variables: Liberal Language, Conservative Language, Party References, Voter References, Leader References, Human Interest, Rapport, Liberation, Blame, and Pessimism. Republicans were more likely to incorporate language associated with Familiarity, Realism, Tenacity, Communication, and Denial.  This research illustrates that within our political institutions generally, and the budget specifically, there are significant source-based and party-based differences in the goals and values communicated by the actors within the federal budget process. If it is possible to gain a better understanding of how actors within this key process communicate, public administrators will be better equipped to engage each other in an honest dialogue and debate that facilitates agreement and understanding. Until source-based and party-based communication barriers have been broken down, the negative tenor in political communication and the publicâ  s apathy and frustration towards the political process will continue.",
  "description_provenance": [
    "Author Email: ttrimble@vt.edu",
    "Advisor Email: tedesco@vt.edu",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:26Z (GMT). No. of bitstreams: 1 Trimble_TE_D_2010.pdf: 1551809 bytes, checksum: bbab802bc23f5846e259ce4db4784b07 (MD5)   Previous issue date: 2010-10-04"
  ],
  "handle": "29294",
  "identifier_other": "etd-10172010-152131",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10172010-152131/",
  "identifier_uri": "http://hdl.handle.net/10919/29294",
  "publisher": "Virginia Tech",
  "relation_haspart": "Trimble_TE_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "agency communication",
    "federal budget",
    "content analysis",
    "DICTION 5.0",
    "public administration",
    "partisan rhetoric",
    "political communication"
  ],
  "title": "Determining Source-Based and Party-Based Perspectives in the Federal Budget Process: A Content Analysis of United States Executive, Congressional and Agential Budget Communication from 1998 - 2000",
  "type": "Dissertation"
}