{
  "contributor_author": "Dyer, Michael  E.",
  "contributor_committeechair": "Burkhart, Harold E.",
  "contributor_committeemember": [
    "Zedaker, Shepard M.",
    "Scrivani, John A.",
    "Reynolds, Marion R. Jr.",
    "Gregoire, Timothy G."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:17:26Z",
  "date_adate": "1997-11-20",
  "date_available": "2014-03-14T20:17:26Z",
  "date_issued": "1997-11-13",
  "date_rdate": "1997-11-20",
  "date_sdate": "1997-11-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Data from three long-term field studies with loblolly pine (Pinus taeda L.) plantations were used to examine inequality (Gini coefficient) trends in diameter and the relationship between diameter relative growth rate (r) and initial size.  Analysis with two spacing studies shows inequality increases with increasing density.  For a given initial density, inequality initially decreases and then begins to increase as trees compete for resources.  The slope of the linear relationship between r and relative size also increases with increasing density. The slope is initially negative and switches to positive as competition intensifies.  The switch in the slope of the r/size relationship occurs when the crown projection area exceeds 1.05 or when the crown ratio falls below 0.75.  These results are consistent with the resource pre-emptive or dominance/suppression theory of intra-specific competition.  The r/size trends are not evident when calculations are based on class means as opposed to individual trees.  The slope of the r/size relationship is a function of stand height, density, and to a lesser extent, site quality.  Density reduction through mid-rotation thinning tends to decrease the slope coefficient.  The r/size trends are used to develop a disaggregation model to distribute stand-level basal area growth over an initial tree list.  This approach compares well with two other disaggregation models but tends to over predict growth on the largest trees.",
  "description_provenance": [
    "Author Email: medyer@westvaco.com",
    "Advisor Email: burkhart@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:26Z (GMT). No. of bitstreams: 8 Front.pdf: 32599 bytes, checksum: c3d352929542e58dfd1fbbba8c2e646e (MD5) chap1.pdf: 12738 bytes, checksum: fc384e2aa1a05344d91782009278425f (MD5) chap2.pdf: 81374 bytes, checksum: fc5fbdab8c428ce81b7d4dcf07f75096 (MD5) chap3.pdf: 715520 bytes, checksum: 38ddc4b84dc02cedfc81fe0eff0e074a (MD5) chap4.pdf: 414295 bytes, checksum: d7624f5edb1c0bcee848bb6e92d46297 (MD5) chap5.pdf: 317042 bytes, checksum: 8d739d7c494efad892f17e1d08bd14c5 (MD5) chap6.pdf: 8978 bytes, checksum: 544bc1f54d81859b407fb74463c890a2 (MD5) back.pdf: 867277 bytes, checksum: db4dec41d79f1889426c556d5b88f34a (MD5)   Previous issue date: 1997-11-13"
  ],
  "handle": "29298",
  "identifier_other": "etd-101797-155415",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-101797-155415/",
  "identifier_uri": "http://hdl.handle.net/10919/29298",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Front.pdf",
    "chap1.pdf",
    "chap2.pdf",
    "chap3.pdf",
    "chap4.pdf",
    "chap5.pdf",
    "chap6.pdf",
    "back.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Relative Growth Rate",
    "Resource Depletion",
    "Resource Pre-emption",
    "Thinning"
  ],
  "title": "Dominance/Suppression Competitive Relationships in Loblolly Pine (Pinus taeda L.) Plantations",
  "type": "Dissertation"
}