{
  "contributor_author": "Ward, R. Dionne",
  "contributor_committeechair": "Salmon, Richard G.",
  "contributor_committeemember": [
    "Creighton, Theodore B.",
    "Twiford, Travis W.",
    "Chapman, Barbara"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:17:25Z",
  "date_adate": "2007-12-17",
  "date_available": "2014-03-14T20:17:25Z",
  "date_issued": "2007-09-25",
  "date_rdate": "2007-12-17",
  "date_sdate": "2007-10-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Ward Abstract</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>Schools are facing challenges in their efforts to educate children appropriately and safely. Students who demonstrate inappropriate, anti-social, and/or disruptive behaviors are becoming more prevalent. School personnel are dealing with disruptive behaviors that occur more frequently and that affect staff and student safety. Additionally, the lack of discipline or management of disruptive behaviors has been identified by the public as the most persistent and possibly the most troublesome issue facing schools ( Cotton, 2001; Elam, Rose, & Gallop, 1998; Fitzsimmons, 1998; Killion, 1998). </p> <p>An assumption in managing problem behaviors in many urban schools is that punishment will change behavior. According to Skiba and Peterson (2000), severe and penalizing disciplinary policies frequently produce a negative school environment rather than improving student behavior. In general, urban schools across the nation rely on suspensions, loss of privileges, reprimands, and or expulsion as means of discipline. Unfortunately, these reactive consequences only help a small number of children learn to â  comply with general expectationsâ   and are insufficient for many students who exhibit more challenging behavior problems. </p> <p>This study examines the disciplinary practices being used in two urban middle schools to control disruptive behavior of students. It will reveal what aspects of certain disciplinary practices are viewed as helpful as well as areas needing improvement. It will also give insight into whether selected urban school principals and other stakeholders are using proactive strategies and techniques demonstrated in the research literature as being the most effective in terms of changing inappropriate behavior. Undertaking this study through the application of qualitative research methods of inquiry as a study using interviews, examining relevant documents, and observations will allow me an opportunity to explore my personal reactions to the defined disciplinary practices in the identified schools. </p> <br> </body> </html>",
  "description_provenance": [
    "Author Email: dward0809@yahoo.com",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: bbgily@aol.com",
    "Made available in DSpace on 2014-03-14T20:17:25Z (GMT). No. of bitstreams: 1 dionneetd.pdf: 763708 bytes, checksum: d0c0e74250c606942836088a7a76b13e (MD5)   Previous issue date: 2007-09-25"
  ],
  "handle": "29293",
  "identifier_other": "etd-10172007-102056",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10172007-102056/",
  "identifier_uri": "http://hdl.handle.net/10919/29293",
  "publisher": "Virginia Tech",
  "relation_haspart": "dionneetd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "disruptive behavior; classroom management",
    "behavior management",
    "classroom discipline",
    "challenging behaviors",
    "antisocial behavior"
  ],
  "title": "A Study of Two Urban Middle Schools: Discipline Practices Used to Control Disruptive Behavior of Students",
  "type": "Dissertation"
}