{
  "contributor_author": "Cicek, Mine",
  "contributor_committeecochair": [
    "Maroof, M. A. Saghai",
    "Buss, Glenn R."
  ],
  "contributor_committeemember": [
    "Veilleux, Richard E.",
    "Wilkinson, Carol A.",
    "Zobel, Richard W."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:17:27Z",
  "date_adate": "2002-11-18",
  "date_available": "2014-03-14T20:17:27Z",
  "date_issued": "2001-09-21",
  "date_rdate": "2005-11-18",
  "date_sdate": "2002-10-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Carbohydrate content sucrose, raffinose, and stachyose are one of the important seed quality traits in soybean. However, little is known about the genetics of these quantitative traits. Recombinant inbred lines (RIL) were developed from the interspecific hybridization between a Glycine max breeding line (V71-370) and a Glycine soja plant introduction (PI407162). The 308 RILs, each parent, and one cultivar were arranged in a randomized complete block design with two replications and planted at two locations in Virginia. The main objective of the first part of this research was to devise a quick, economical, and reliable HPLC methodology to determine the amount of sucrose, raffinose, and stachyose in soybean seeds.  Concentration of sucrose, raffinose and stachyose are quantitative traits, which are hard to manipulate genetically due to the influence of genotype, environment, and genotype by environment interactions on seed chemical composition. The objectives of the second study were to evaluate agronomic and quality traits over locations and to study correlations among traits. The agronomic traits analyzed in this study included; maturity, plant canopy height, canopy spread, leaflet length, leaflet width, yield, and seed size. Seed quality traits studied were sucrose, raffinose, and stachyose content. Although some correlation coefficients were statistically significant at P<0.001, many were not large enough to be of practical value. A positive correlation was observed between all three sugars. Significant variation was observed among RILs and locations for all traits studied. Genotype by environment interaction was significant for all of the agronomic traits, but was not significant for seed sucrose, stachyose, or raffinose. Maturity, seed size, and sucrose content were highly heritable traits, whereas plant height, canopy spread, yield, leaf length, leaf width, stachyose content, and raffinose content had relatively low broad-sense heritabilities.  The RIL population was used to investigate the genetic basis for these agronomic and seed quality traits. Seven out of twenty soybean molecular linkage groups (MLG), A1, A2, E, F, G, I, and M, were selected on the basis of previous research and mapped in this population with restriction fragment length polymorphism (RFLP) and simple sequence repeat (SSR) markers. Five QTL for seed sucrose content, one QTL each for raffinose and stachyose, and one for each agronomic trait except yield and leaflet width, and two QTL each for yield and leaflet width were detected using the Blacksburg data. Four QTL for seed sucrose content, one QTL for raffinose, two QTL for stachyose, one QTL each for plot width and yield and two QTL for leaflet width were detected using the Warsaw data. Several QTL affecting different agronomic traits shared common genomic regions suggesting pleiotropy at some loci. The majority of the seed quality QTL was stable at both locations. Agronomic traits were more environmentally sensitive and no QTL were common to both locations. Epistasis analysis showed interactions between QTL that detected new genomic regions associated with raffinose content. These results suggest that these potential QTL are definitely on the genomic regions of interest and would be more powerful in marker-assisted selection when we find closer markers to each QTL.",
  "description_provenance": [
    "Author Email: cicekm1@ccf.org",
    "Advisor Email: potato@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: gbuss@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:27Z (GMT). No. of bitstreams: 1 Dissertation.PDF: 442026 bytes, checksum: f43e8ee6f41000b2e9874e2bec4655ac (MD5)   Previous issue date: 2001-09-21"
  ],
  "handle": "29300",
  "identifier_other": "etd-10182002-222354",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10182002-222354/",
  "identifier_uri": "http://hdl.handle.net/10919/29300",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "HPLC",
    "raffinose",
    "molecular markers",
    "soybean",
    "QTL",
    "sucrose",
    "stachyose"
  ],
  "title": "Genetic marker analysis of three major carbohydrates in soybean seeds",
  "type": "Dissertation"
}