{
  "contributor_author": "Lensch, Carol",
  "contributor_committeecochair": [
    "Parks, David J.",
    "Niles, Jerome A."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:28Z",
  "date_adate": "1998-03-11",
  "date_available": "2014-03-14T20:17:28Z",
  "date_issued": "1999-01-01",
  "date_rdate": "2002-04-10",
  "date_sdate": "1998-10-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In recent years there has been a notable increase in the number of students being identified with Attention Deficit/Hyperactivity Disorder (AD/HD) in American schools. Although there is a tremendous amount of research being done in the area of AD/HD, parents, educators and individuals with AD/HD are ill-equipped to deal with the demands of the disorder. Only through extensive research and a better understanding of what AD/HD is can we expect to develop more effective means of dealing with AD/HD on a daily basis at home and in school.<P> The primary purpose of this book is to bridge the gap between research knowledge and the knowledge in use by educators on AD/HD. The book is a review and interpretation of selected studies on the causes, co-occurrence with other disorders, diagnosis, and treatments of AD/HD. It provides the reader with the opportunity to gain an understanding of AD/HD for making mindful, informed decisions on approaches best suited to meet the challenges presented by this disorder.<P> Five misconceptions are identified and refuted by research presented in chapters two through five. The findings of these studies lend support to: (a) a genetic and environmental basis for AD/HD; (b) a comorbid and hetergeneous nature to the disorder; (c) a need for educators to approach AD/HD from an educational perspective; (d) the need to consider a variety of interventions in addition to medication for the treatment of AD/HD; and (e) the unique response to interventions by individuals with AD/HD.<P> In conclusion, educators are seeking information on this disorder because they are faced with an ever-increasing number of students with AD/HD, and they want to effectively meet the needs of this growing population of children. The emphasis in chapter six is on using a collaborative team approach, involving all persons who have an impact on the life of the student with AD/HD. Only through knowledge, understanding, and collaboration can educators be empowered to do the job that so desperately needs to be done.<P>",
  "description_provenance": [
    "Author Email: clensch@hollins.edu",
    "Advisor Email: parks@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:28Z (GMT). No. of bitstreams: 1 final.pdf: 399278 bytes, checksum: 93cd3697ebf3092cb6a65dfb052cee54 (MD5)   Previous issue date: 1999-01-01"
  ],
  "handle": "29308",
  "identifier_other": "etd-101898-182436",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-101898-182436/",
  "identifier_uri": "http://hdl.handle.net/10919/29308",
  "publisher": "Virginia Tech",
  "relation_haspart": "final.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Hyperactivity",
    "AD/HD",
    "Teachers"
  ],
  "title": "MAKING SENSE OF ATTENTION DEFICIT/HYPERACTIVITY DISORDER",
  "type": "Dissertation"
}