{
  "contributor_author": "Goel, Nitin Kumar",
  "contributor_committeechair": "Stolen, Roger Hall",
  "contributor_committeecochair": "Pickrell, Gary R.",
  "contributor_committeemember": [
    "Heflin, James R.",
    "Safaai-Jazi, Ahmad",
    "Wang, Anbo",
    "Jacobs, Ira"
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:17:27Z",
  "date_adate": "2005-10-31",
  "date_available": "2014-03-14T20:17:27Z",
  "date_issued": "2005-10-11",
  "date_rdate": "2005-10-31",
  "date_sdate": "2005-10-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This thesis presents a novel technique named \"Core Suction\" for fabricating optical fiber preforms for manufacturing highly doped fibers (HDFs) for optical amplification (Raman effect based or Erbium fiber based). The technique involves drawing the molten non-conventional core glass material into the silica cladding tube to form the preform. The developed technique is simple, inexpensive and shows great potential for fabricating preforms of highly nonlinear non-conventional multi-component glasses as the core material.  Preforms were made with various core glasses such as Schott SF6, Lead-Tellurium-Germanate, Lead-Tellurium-Germanate- Neodymium -Erbium and MM2 in silica cladding tubes and then pulled into fibers.   The fabricated fibers were measured for refractive index profile, loss spectrum and spontaneous Raman spectra. Elemental analysis of the fiber samples was also performed using an electron microprobe. Erbium doped fiber amplifiers (EDFAs) were setup using 30 cm, 5cm and 1 cm lengths of fabricated erbium doped fibers and their gain spectra measured. The distributed gain spectrum for an EDFA was also measured using an optical frequency domain reflectometery (OFDR) technique. Commercial dispersion compensated fiber (DCF) with very high GeO2 doping was used to setup a Raman amplifier and the gain spectrum measured.   One of the needs of Raman amplification in optical fibers is to predict an accurate Raman gain, based on the fiber's refractive index profile. A method of predicting Raman gain in GeO2 doped fibers is presented and the predicted Raman gain values are compared with the measured ones in the same fibers.  Raman gain issues like the dependence of the Raman gain on the GeO2 concentration, polarization dependence were taken into account for the gain calculations. An experimental setup for Raman gain measurements was made and measurement issues addressed. Polarization dependence of the Raman gain in one kilometer of polarization maintaining fiber was also measured.",
  "description_provenance": [
    "Author Email: ngoel@vt.edu",
    "Advisor Email: stolen@vt.edu",
    "Advisor Email: rheflin@vt.edu",
    "Advisor Email: ajazi@vt.edu",
    "Advisor Email: awang@vt.edu",
    "Advisor Email: pickrell@vt.edu",
    "Advisor Email: ijacobs@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:27Z (GMT). No. of bitstreams: 1 goel_nitin_dissertation2005.pdf: 3004925 bytes, checksum: d0023ecd7a401d9f00b57b6cd75d24d8 (MD5)   Previous issue date: 2005-10-11"
  ],
  "handle": "29302",
  "identifier_other": "etd-10182005-202925",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10182005-202925/",
  "identifier_uri": "http://hdl.handle.net/10919/29302",
  "publisher": "Virginia Tech",
  "relation_haspart": "goel_nitin_dissertation2005.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Raman Amplifier",
    "Erbium Doped Fiber Amplifier",
    "\"Core-Suction\" Technique",
    "Highly Nonlinear Fibers"
  ],
  "title": "Development of \"Core-Suction\" Technique for Fabrication of Highly Doped Fibers for Optical Amplification and Characterization of Optical Fibers for Raman Amplification.",
  "type": "Dissertation"
}