{
  "contributor_author": "Eremin, Dmitry V",
  "contributor_committeechair": "Wolf, James F.",
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "Jensen, Laura S.",
    "Fichtner, Jason J.",
    "Mullins, Daniel R."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:17:27Z",
  "date_adate": "2009-10-30",
  "date_available": "2014-03-14T20:17:27Z",
  "date_issued": "2009-09-25",
  "date_rdate": "2009-10-30",
  "date_sdate": "2009-10-18",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation assesses the effects of tax and expenditure limitations (TELs) on principal items of revenue, largest components of expenditure and the levels of public debt of local governments serving urban cores and suburban fringes of the largest metropolitan areas in the US.   The first part of the dissertation consists of 4 chapters. Chapter 1 examines the formal aspects of TELs; Chapter 2 explores historical evolution of fiscal limits between 1800 and 2009; Chapter 3 examines substantive nature of TELs; and Chapter 4 reviews the extant research on TELs. The past research suggests that TELs are associated with increased centralization, diminished government responsiveness, and suboptimal outcomes of the entire local public sector.   The second part of the dissertation, Chapters 5-6, presents the empirical study of the asymmetrical fiscal effects of TELs on different geographic segments of metropolitan areas. The study employs the quasi-experimental multiple comparison group time series research design and measures fiscal outcomes associated with the imposition of TELs. It relies on a standard fixed effects dummy variable OLS model with constant slope coefficients and variable intercept. The sample (N = 166,530) contains 7 periods of observation at 5 year intervals of 745 metropolitan counties from 270 metropolitan areas. The unit of analysis is the metropolitan county area.  \t The study found that in the urban cores and suburban fringes of metropolitan areas: 1) overall fiscal effects of TELs follow general asymmetrical trends identified by past research; 2) specific fiscal effects varied by comparison group, type of TEL imposed, and measure of fiscal outcome; 3) local governments in the urban cores are more adversely affected by TELs; 4) general revenues and expenditures declined in all comparison groups but urban core local governments experienced larger declines; 5) in all comparison groups own source revenues declined, intergovernmental revenues increased, spending on public education and public safety declined with larger declines in the urban cores; 6) long-term debt (especially non-guaranteed) has been rising more quickly in the urban core segments of metropolitan areas; and 7) in general, the effects of TELs were more negative and more pronounced for local governments experiencing fiscal stress.",
  "description_provenance": [
    "Author Email: deremin@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: jensen7@vt.edu",
    "Advisor Email: jjfichtner@gmail.com",
    "Advisor Email: dmullins@american.edu",
    "Made available in DSpace on 2014-03-14T20:17:27Z (GMT). No. of bitstreams: 1 Eremin_DV_D_2009.pdf: 2464854 bytes, checksum: 54fe78b2d445de64b7e51da89448ba48 (MD5)   Previous issue date: 2009-09-25"
  ],
  "handle": "29304",
  "identifier_other": "etd-10182009-185312",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10182009-185312/",
  "identifier_uri": "http://hdl.handle.net/10919/29304",
  "publisher": "Virginia Tech",
  "relation_haspart": "Eremin_DV_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Local Government",
    "Tax and Expenditure Limits",
    "TEL",
    "Revenues",
    "Expenditures",
    "Debt"
  ],
  "title": "Urban Core vs. Suburban Fringe: Asymmetrical Fiscal Effects of Tax and Expenditure Limitations in Metropolitan Areas",
  "type": "Dissertation"
}