{
  "contributor_author": "Altieri, Elizabeth M.",
  "contributor_committeechair": "Niles, Jerome A.",
  "contributor_committeemember": [
    "Small, Robert C. Jr.",
    "Murphy, Susan",
    "Billingsley, Bonnie S.",
    "Lalik, Rosary V."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:28Z",
  "date_adate": "2001-11-02",
  "date_available": "2014-03-14T20:17:28Z",
  "date_issued": "2001-10-05",
  "date_rdate": "2002-11-02",
  "date_sdate": "2001-10-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<html> <head> <title>Untitled Document</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body bgcolor=\"#FFFFFF\" text=\"#000000\"> <div align=\"center\">Learning to Negotiate Difference: <br>   Narratives of Experience in Inclusive Education </div> <p align=\"center\"><br>   Elizabeth M. Altieri<br>   <br>   (ABSTRACT)</p> <p> This narrative inquiry examined how a small group of general educators constructed    three essential understandings of themselves as teachers within the context    of inclusive education: (a) To move past their fear of disabilities and negative    perceptions of students with disabilities, they had to learn to see children    with disabilities in new ways, identify what it was about their differences    that mattered, and respond to them as valued members of their classrooms; (b)    To move past feelings of inadequacy and incompetence, they had to figure out    how to negotiate those learning differences that mattered the most; and (c)    To keep from being overwhelmed with the additional demands inclusion placed    on them as teachers, they needed to garner support through a variety of relationships,    and work through conflicts that arose from trying on new roles and patterns    of interaction. These understandings were constructed through two interrelated    processes: Learning through experience, and learning through narrative, specifically,    informal talk, structured dialogue, and stories. The representation of this    inquiry was a polyvocal text which privileged what the teachers had to say,    and which featured their voices in solo and in dialogue with others. This alternative    format was used to convey the evolving nature of the teachers' practice, as    well as the contradictions and complexities that expand our understanding of    teacher learning and development in inclusive educational settings.<br> </p> </body> </html>",
  "description_provenance": [
    "Author Email: ealtieri@vt.edu",
    "Advisor Email: rsmall@radford.edu",
    "Advisor Email: susie@km4.com",
    "Advisor Email: bbilling@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: rlalik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:28Z (GMT). No. of bitstreams: 1 LizAltieriDiss.pdf: 3447163 bytes, checksum: c8bb187c6c4ca326c7491a1b6e7c524c (MD5)   Previous issue date: 2001-10-05"
  ],
  "handle": "29309",
  "identifier_other": "etd-10192001-103610",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10192001-103610/",
  "identifier_uri": "http://hdl.handle.net/10919/29309",
  "publisher": "Virginia Tech",
  "relation_haspart": "LizAltieriDiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Teacher Learning",
    "Inclusive Education",
    "Teacher Development"
  ],
  "title": "Learning to Negotiate Difference:  Narratives of Experience in Inclusive Education",
  "type": "Dissertation"
}