{
  "contributor_author": "Platt, Robert Terry",
  "contributor_committeechair": "Loferski, Joseph R.",
  "contributor_committeemember": [
    "Dolan, James Daniel",
    "Bush, Robert J.",
    "Beamish, Julia O."
  ],
  "contributor_department": "Wood Science and Forest Products",
  "date_accessioned": "2014-03-14T20:17:29Z",
  "date_adate": "1998-11-24",
  "date_available": "2014-03-14T20:17:29Z",
  "date_issued": "1998-07-05",
  "date_rdate": "1999-11-24",
  "date_sdate": "1998-10-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "To accommodate an expanding global population, a  renewable raw material resource base, in  conjunction with new building technologies, must  be applied to the residential housing sector.   Desirable characteristics of housing systems are  economy, safety, environmental sustainability,  durability, design flexibility and a long service life.  The system should be acceptable to the  end-user, consist of renewable, indigenous  resources, and require a minimum investment in  labor and equipment for both production and  erection.   <p> The objective of this research was to develop a ready-to-assemble (RTA) framing system.  Integral  to the framing system is a nail plate connector,  developed in this project, that laminates wood  or wood composite elements into larger building  components.  The laminated components can be  bolted together to form various structural  configurations.  Decisions on the development of  the RTA system were structured according to an  Innovation Development Decision Model (IDDP)  that was constructed from previous adoption and  diffusion research.  The IDDP model elucidates  and illustrates the innovation process from  conceptual idea to product adoption.  The  critical issues for product acceptance include  system performance in terms of safety, cost, and  building code approval.  The objective of the  experimental portion of the research was to test  the performance of the RTA connection system in  specific modes and to develop a theoretical  method to predict the strength of the connection.   A series of experiments to quantify the shear  strength and stiffness of six joint  configurations assembled with the   RTA connector were designed and conducted.   The joints were fabricated from solid sawn  lumber and three different wood-base composites. <p>   The experimental results indicated that the  strength of the RTA connector in  perpendicular-to-grain and parallel-to-grain  orientations can be predicted from a theoretical  dowel yield model.  The material properties used  in the yield model were adjusted for duration of  load and safety.  Empirical test values were  within ±6.3 % of the predicted values from the  theoretical model.  Joint stiffness was  evaluated, modeled and quantified in the linear  and non-linear ranges.  A structural analysis  program was used to design and model a simple  RTA building for realistic gravity and wind  loads.  The structural model was used to predict  joint forces that the RTA connector must resist  in-service.  The computer model predictions were  compared to the empirical joint test data.  The  results indicate that the RTA system can be  designed to meet safety and serviceability  criteria.  A comparison between the estimated  costs of a RTA building and the costs of  traditional on site construction of a building  of equal dimensions indicated that the RTA  system is economically competitive.",
  "description_provenance": [
    "Author Email: plattmrt@vt.edu",
    "Advisor Email: jddolan@vt.edu",
    "Advisor Email: rbush@vt.edu",
    "Advisor Email: jbeamish@vt.edu",
    "Advisor Email: jloferski@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:29Z (GMT). No. of bitstreams: 1 etd.pdf: 6594273 bytes, checksum: d12840028602d79d2afec93ddc1d40fa (MD5)   Previous issue date: 1998-07-05"
  ],
  "handle": "29315",
  "identifier_other": "etd-101998-151221",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-101998-151221/",
  "identifier_uri": "http://hdl.handle.net/10919/29315",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "low-cost housing",
    "building systems",
    "mechanical fasteners",
    "connection"
  ],
  "title": "Development of A Ready-To-Assemble Construction System",
  "type": "Dissertation"
}