{
  "contributor_author": "Goffi, Federica",
  "contributor_committeecochair": [
    "Frascari, Marco",
    "Emmons, Paul F."
  ],
  "contributor_committeemember": [
    "Holt, Jaan",
    "Piedmont-Palladino, Susan C.",
    "Feuerstein, Marcia F.",
    "Fai, Stephen"
  ],
  "contributor_department": "Architecture",
  "date_accessioned": "2014-03-14T20:17:28Z",
  "date_adate": "2010-12-02",
  "date_available": "2014-03-14T20:17:28Z",
  "date_issued": "2010-02-02",
  "date_rdate": "2010-12-02",
  "date_sdate": "2010-10-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Conservation is today often interpreted as the preservation of a still-shot, an understanding informed by the belief that by displaying photographic memory of the past, it is possible to gain access to it. Naturalistic representation is unequivocal and presents the onlooker with a single meaning. The dominance of the photorealistic image as model for memory, should be challenged by undermining the notion that architectural representation is a portrayal of likeness, restoring its full potential as an iconic representation of presence.  A micro-historical study of the Renaissance concept of restoration, focused on Tiberio Alfaranoâ  s 1571 ichnography of St. Peterâ  s Basilica in the Vatican, offers an alternative paradigm in order to inform, critically, contemporary theory and the practice of the renewal of mnemic buildings. The hybrid drawing (1571) extends beyond the opera of graphic architecture, realizing a real effigy.   Alfarano factured a track-drawing, providing memory traces on the drawing-site, which, acting like a veil, bear marks of the buildingâ  s presence within time. The ichnography makes visible a â  hallowed configurationâ  , conceived as a substratum for the imagination of conservation. This defines a collective daydreaming strategy, from which multiple authors can imagine possible futures. Ambiguity and polysemy inform the drawing, generating an equivocal space where unforeseeable inventions occur by the process of future predictions by recollecting memories. This invites merging multiple stories.  Grasping the significance of Alfaranoâ  s drawing, one begins to comprehend the mistaken belief in the primacy of photo rendering to access a building and conserve its essence. Any essence cannot be achieved through exact visual reconstruction, rather through a chiasmus of past and present form, expressing allegoric significance.  The retrospective and prospective character of the architectural-conservation process can be experienced through the intermediacy of hybrid-drawings directing the gaze simultaneously in two directions; a pre-existent condition engages in dialogue with future design. This is a condition absent from todayâ  s practice, where measured drawings and design drawings are often kept separate.  Seen this way, architectural drawings could rejoin these two temporal conditions, through metaphoric or literal transparency, and allow for a real transformation within continuity of identity.",
  "description_provenance": [
    "Author Email: Federica_Goffi@Carleton.ca",
    "Advisor Email: Marco_Frascari@Carleton.ca",
    "Advisor Email: pemmons@vt.edu",
    "Advisor Email: jholt@vt.edu",
    "Advisor Email: spalla@vt.edu",
    "Advisor Email: mfeuerst@vt.edu",
    "Advisor Email: sfai@cims.carleton.ca",
    "Made available in DSpace on 2014-03-14T20:17:28Z (GMT). No. of bitstreams: 1 GOFFI_F_D_2010_f1.pdf: 11855001 bytes, checksum: 57d23bcb0453741e3e926cc235040ea0 (MD5)   Previous issue date: 2010-02-02"
  ],
  "handle": "29312",
  "identifier_other": "etd-10192010-103753",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10192010-103753/",
  "identifier_uri": "http://hdl.handle.net/10919/29312",
  "publisher": "Virginia Tech",
  "relation_haspart": "GOFFI_F_D_2010_f1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "drawing",
    "architecture",
    "time",
    "conservation",
    "imagination"
  ],
  "title": "The Sempiternal Nature of Architectural-Conservation and the Unfinished Building and Drawing",
  "type": "Dissertation"
}