{
  "contributor_author": "Jackson, Giles Alexander",
  "contributor_committeechair": "Olsen, Michael D.",
  "contributor_committeemember": [
    "Tse, Eliza C.",
    "Uysal, Muzaffer S.",
    "Chon, Kye-Sung",
    "Bremer, Jennifer",
    "Boitnott, Richard L."
  ],
  "contributor_department": "Human Nutrition and Foods",
  "date_accessioned": "2014-03-14T20:17:28Z",
  "date_adate": "2006-10-19",
  "date_available": "2014-03-14T20:17:28Z",
  "date_issued": "1994-04-12",
  "date_rdate": "2006-10-19",
  "date_sdate": "2006-10-19",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The paradigm of sustainable development has moved center-stage in the development community and strategies for achieving sustainable development are proliferating. However, the capacity of institutions to support sustainable development in non-industrialized countries has not been adequately addressed. There is a need to solve the sustainable development problem conceptually by linking strategy content and implementation issues with processes of strategy formulation internal to institutions. This study investigated the hypothesis that the dominant \"technocratic\" approach to strategy formulation, in which development problems are treated as technical, apolitical problems, creates strategies that probably will not implement sustainable development as intended. <p> The World Bank's Strategy for Achieving Sustainable Development in Developing Countries (1992) was applied to the international tourism industry by twenty-five persons from industry, academia, non-government organizations and consultancies to identify implementation issues and problems that might be attributed to use of the technocratic approach. The study found that the World Bank's strategy probably will not implement sustainable development as intended due to fundamental conflicts in assumptions about how sustainable development can and should be achieved. The findings of this study support the argument made in the literature that a change in approach to strategy formulation is required. The findings also suggest that the proposed alternative to the technocratic approach may not be sufficient, because it is little more than a modification of the latter approach and does not resolve the fundamental contradiction between \"induced\" and \"sustainable\" development. A more fundamental shift in the values governing development may be required to adapt the modus operandi of development institutions to sustainable development and resolve the value conflicts that continue to diminish the possibility of consensus and action. Although this study provides knowledge of a limited scope, its findings and recommendations may guide an improved perception of the complex problem of identifying requirements for sustainable development and adapting institutions accordingly.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:17:28Z (GMT). No. of bitstreams: 1 LD5655.V856_1994.J335.pdf: 12431799 bytes, checksum: 338206989851b2cde3bca5d0c9aa31fb (MD5)   Previous issue date: 1994-04-12",
  "format_medium": "BTD",
  "handle": "29311",
  "identifier_other": "etd-10192006-115606",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10192006-115606/",
  "identifier_uri": "http://hdl.handle.net/10919/29311",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1994.J335.pdf",
  "subject": "Sustainable development Developing countries.",
  "subject_lcc": "LD5655.V856 1994.J335",
  "title": "Strategic issues in sustainable development",
  "type": "Dissertation"
}