{
  "contributor_author": "Iezzi, Erick Barton",
  "contributor_committeechair": "Dorn, Harry C.",
  "contributor_committeemember": [
    "Deck, Paul A.",
    "Tanko, James M.",
    "Long, Timothy E.",
    "Hanson, Brian E."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:17:31Z",
  "date_adate": "2003-10-24",
  "date_available": "2014-03-14T20:17:31Z",
  "date_issued": "2003-10-14",
  "date_rdate": "2004-10-24",
  "date_sdate": "2003-10-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This dissertation addresses the exohedral cage functionalization and potential applications of the Sc<sub>3</sub>N@C<sub>80</sub> and Sc<sub>3</sub>N@C<sub>78</sub> trimetallic nitride endohedral metallofullerenes.  In addition, this dissertation discusses miscellaneous research that is relevant to the aformentioned metallofullerenes and their applications, such as the discovery of a new cage isomer <i>(D<sub>5h</sub>)</i> of Sc<sub>3</sub>N@C<sub>80</sub>, the synthesis of Lu<sub>3</sub>N@C<sub>80</sub> as a novel X-ray contrasting agent, and the synthesis of Sc<sub>3</sub><sup>15</sup>N@C<sub>80</sub> with <sup>15</sup>N<sub>2</sub> gas.</p><p>    The first derivative of Sc<sub>3</sub>N@C<sub>80</sub> was synthesized by functionalizing the exterior of the cage via a [4 + 2] cycloaddition reaction with a <sup>13</sup>C-labeled intermediate.  Addition occurred across the [5,6] ring-juncture of the cage to form a mono-adduct, which has a mirror plane of symmetry as observed from the time-averaged <sup>13</sup>C NMR spectrum.  The structure of the mono-adduct was confirmed by X-ray crystallography.  Diethyl and dibenzyl malonate adducts of Sc<sub>3</sub>N@C<sub>80</sub> were synthesized, in addition to a <sup>15</sup>N-labeled terminal amine derivative. Water-soluble metallofullerenols, Sc<sub>3</sub>N@C<sub>80</sub>(OH)<sub>~10</sub>(O)<sub>~10</sub>, were synthesized from polyanionic intermediates.    </p><p>  The Sc<sub>3</sub>N@C<sub>78</sub> metallofullerene was derivatized with a <sup>13</sup>C-labeled reagent to afford mono-, di- and tri-adducts.  A single structural isomer of the mono-adduct was found, while several isomers of the di- and tri-adducts were observed by HPLC.  <sup>13</sup>C and <sup>1</sup>H NMR data of the mono-adduct support a structure that results from addend addition to an asymmetric site on the C<sub>78</sub> carbon cage.  </p><p>  The HPLC isolation and characterization of Lu<sub>3</sub>N@C<sub>80</sub> is discussed.  When irradiated with X-rays, Lu<sub>3</sub>N@C<sub>80</sub> provided a small level of contrast that can only be attributed to the large atomic number (Z) of the lutetium atoms.  Mixed-metal species that contains gadolinium and lutetium or holmium and lutetium could be employed as multifunctional contrasting agents for X-ray, MRI and radiopharmaceuticals, thereby eliminating the need for three separate agents.  </p><p>  A new cage isomer of the Sc<sub>3</sub>N@C<sub>80</sub>metallofullerene was synthesized and partially isolated by HPLC.  This carbon cage possesses <i>D<sub>5h</sub></i> symmetry, as indicated by the time-averaged six line <sup>13</sup>C NMR spectrum with a 1:2:2:1:1:1 ratio.   </p><p>   The internal metal-nitride cluster of Sc<sub>3</sub>N@C<sub>80</sub> was synthesized with a <sup>15</sup>N-label for studying the motion(s) of the cluster (within the carbon cage) at various temperatures using <sup>15</sup>N NMR spectroscopy.  </p>",
  "description_provenance": [
    "Author Email: eiezzi@vt.edu",
    "Advisor Email: hdorn@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:31Z (GMT). No. of bitstreams: 1 E.B.Iezzi-PhD-dissertation.pdf: 3598162 bytes, checksum: 5790f269b4d65055e6b60482a79a828d (MD5)   Previous issue date: 2003-10-14"
  ],
  "handle": "29325",
  "identifier_other": "etd-10212003-130521",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10212003-130521/",
  "identifier_uri": "http://hdl.handle.net/10919/29325",
  "publisher": "Virginia Tech",
  "relation_haspart": "E.B.Iezzi-PhD-dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "endohedral",
    "metallofullerene",
    "scandium nitride",
    "X-ray contrast",
    "functionalization"
  ],
  "title": "Exohedral Functionalization and Applications of the Trimetallic Nitride Endohedral Metallofullerenes",
  "type": "Dissertation"
}