{
  "contributor_author": "Hilton, Corydon",
  "contributor_committeechair": "Lesko, John J.",
  "contributor_committeemember": [
    "Thangjitham, Surot",
    "Ragab, Saad A.",
    "Ellis, Michael W.",
    "Case, Scott W."
  ],
  "contributor_department": "Engineering Science and Mechanics",
  "date_accessioned": "2014-03-14T20:17:30Z",
  "date_adate": "2009-11-05",
  "date_available": "2014-03-14T20:17:30Z",
  "date_issued": "2009-09-25",
  "date_rdate": "2009-11-05",
  "date_sdate": "2009-10-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Multifunctional material systems are systems that contain individual materials or components which are capable of performing multiple functions.  The combination of functions into single entities allows for system-level benefits that are not possible through the optimization of subsystems independently.  Benefits enabled through multifunctional designs include increased system efficiency through mass and or volume savings as well as part count reductions.  Fiber reinforced polymer (FRP) composite materials are lightweight, high-strength materials that can be tailored to achieve a unique set of properties.  These characteristics make composites ideal materials for multifunctional designs.  The current research focuses on the production, optimization, and characterization of a multifunctional fuel cell system.  This product combines fuel cell technology with composite materials technology to achieve a design that produces electrical power while also providing specific load carrying capability.  The study investigates new system designs and new processing techniques, including vacuum assisted resin transfer molding (VARTM) and pultrusion.  A metric which allows for the characterization of multifunctional fuel cell systems is developed and applied to three fuel cell designs.  This metric uses Frostigâ  s Higher Order Theory to analyze the mechanical behavior of the cells while the electrical performance of each device is based on its specific power output.  For the cells investigated here, multifunctional efficiencies between 22% and 69% are achieved.  The multifunctional efficiency is highly dependent on the transverse pressure applied to the fuel cell components, as this pressure determines ohmic resistances, mass transfer properties, and sealing abilities of the systems.  The mechanical pressures at the GDL/Polar Plate interface of a model fuel cell system are explored via experiments with pressure-sensitive film as well as FEA studies, and an optimum structural pressure of approximately 200 psi is identified.  Additionally, the effects that concentrated, bending loads have on the electrochemical performance of a model multifunctional cell are explored.  The results indicate that one must give generous consideration to the out of plane loads which the fuel cell system will be subjected to (both inherent, structural loads resulting from processing conditions and external, applied loads encountered during operation) in order to achieve optimal multifunctional efficiency.",
  "description_provenance": [
    "Author Email: cdhilton@vt.edu",
    "Advisor Email: surot@vt.edu",
    "Advisor Email: ragab@vt.edu",
    "Advisor Email: mwellis@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: scase@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:30Z (GMT). No. of bitstreams: 1 Hilton_CD_D_2009.pdf: 1793255 bytes, checksum: 36942f5b32af91196ad42c3433318a3e (MD5)   Previous issue date: 2009-09-25"
  ],
  "handle": "29321",
  "identifier_other": "etd-10202009-185712",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10202009-185712/",
  "identifier_uri": "http://hdl.handle.net/10919/29321",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hilton_CD_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Fuel Cell",
    "Composite",
    "Structural",
    "Multifunctional"
  ],
  "title": "Development and Analysis of a Multifunctional Fuel Cell Structure",
  "type": "Dissertation"
}