{
  "contributor_author": "Collier, James H.",
  "contributor_committeechair": "Pitt, Joseph C.",
  "contributor_committeemember": [
    "Moyer, Burt",
    "Fuhrman, Ellsworth R.",
    "Burian, Richard M.",
    "Fuller, Steven W."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:17:30Z",
  "date_adate": "1998-11-20",
  "date_available": "2014-03-14T20:17:30Z",
  "date_issued": "1998-08-10",
  "date_rdate": "1999-11-20",
  "date_sdate": "1998-10-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examines the structure of epistemological claims made about science within the field of science and technology studies (STS). The social constructivist invocation to put science in \"context\" necessarily implies a logic of justification. Made explicit, this logic of justification provides a basis on which to adjudicate meta-scientific claims. The appeal to context blurs internal and external references, offers an ontological starting point for STS accounts of science, serves as the basis for methodological debate, and refers to values which anchor a notion of scientific objectivity. Hence: Contexts are assumed to exist. Contexts can be accessed and demarcated from other contexts in which they may be embedded; as a result, contexts are not paradigm-bound. Since contexts exist, the elements composing them are taken to exist in some logical and ontological relation to one another. Contexts are taken to affect scientific practice. Since contexts affect scientific practice some logical and ontological relation exists among the elements of the context, a given scientific practice, and the world that practice describes. Contexts are taken as temporally stable; infinite regress is not an immediate consequence of a local explanation of scientific practice. Since contexts exist in a stable, ontological relationship to the scientific practice they interpret or explain, criteria for justifying one context-based perspective over another are necessarily implied. Contexts necessarily imply justificatory criteria and imply a means for adjudicating among contexts and context-based statements. Since contexts imply a logic of justification independent of the scientific practice being examined meta-scientific evidence consists of observation statements. Context-based observation statements can, initially, be adjudicated a priori. A form of meta-scientific realism exists. If a form of meta-scientific realism exists, we can determine which contexts explain scientific practice and which do not. As a result we have epistemological claims about science which can be adjudicated on realist grounds which are not just the product of designated contexts. The future of STS turns on articulating a meta-scientific realism in relation to scientific practice and truths about the world. Finally, I advocate a contingent foundationalism on which STS can be made relevant to an understanding of science and technology.",
  "description_provenance": [
    "Author Email: jcollier@english.umass.edu",
    "Advisor Email: jcpitt@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:30Z (GMT). No. of bitstreams: 11 ABSTRACT.PDF: 8817 bytes, checksum: d118c06a910421bca51c61bef66f6b1a (MD5) vita.pdf: 16096 bytes, checksum: 01429f1e1e97c1f66a9e3dca780f9021 (MD5) title.pdf: 4973 bytes, checksum: 82787c0a0ecba8066512eda4916d64d0 (MD5) references.pdf: 43916 bytes, checksum: d2d85a2313bcb67394aa3074c963bf6c (MD5) diss_toc.pdf: 10328 bytes, checksum: c9963af8190a14796e19710f89ae7745 (MD5) chapter5.pdf: 68637 bytes, checksum: a24f97cd341ce7d22f9e87bacebb811b (MD5) chapter4.pdf: 108761 bytes, checksum: cbd657d53420f00d075d1148d02f4a56 (MD5) chapter3.pdf: 105799 bytes, checksum: 0795271e35bdaadde43f5c163b7b30a8 (MD5) chapter1.pdf: 93349 bytes, checksum: ecb09f0c014cb83342b9ce07a7087cd5 (MD5) acknowledge.pdf: 5912 bytes, checksum: 22250f7c79eadacf52bec37775a674e2 (MD5) chapter2.pdf: 82355 bytes, checksum: d3628b353353a9ea005f1cab8ae887f5 (MD5)   Previous issue date: 1998-08-10"
  ],
  "handle": "29322",
  "identifier_other": "etd-102098-101838",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-102098-101838/",
  "identifier_uri": "http://hdl.handle.net/10919/29322",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ABSTRACT.PDF",
    "vita.pdf",
    "title.pdf",
    "references.pdf",
    "diss_toc.pdf",
    "chapter5.pdf",
    "chapter4.pdf",
    "chapter3.pdf",
    "chapter1.pdf",
    "acknowledge.pdf",
    "chapter2.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Epistomology",
    "Science and Technology Studies",
    "Meta-scientific"
  ],
  "title": "The Structure of Meta-Scientific Claims:  Toward a Philosophy of Science and Technology Studies",
  "type": "Dissertation"
}