{
  "contributor_author": "Hendricks, Harlan Judson",
  "contributor_committeechair": "Kosztarab, Michael",
  "contributor_committeemember": [
    "Opell, Brent D.",
    "Pfeiffer, Douglas G.",
    "Pienkowski, Robert L.",
    "Schultz, Peter B."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:17:31Z",
  "date_adate": "2005-10-21",
  "date_available": "2014-03-14T20:17:31Z",
  "date_issued": "1993-12-05",
  "date_rdate": "2005-10-21",
  "date_sdate": "2005-10-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Of the estimated 1100 species of mealybugs, approximately 6% are described as possessing degenerative legs and antennae in the adult female developmental stage or having lost these structures altogether. Fifteen genera composing 63 species are often separated into their own taxonomic group based on these vestigial features (e.g., Sphaerococcinae), and are collectively known as the \"legless\" mealybugs. A comparative morphological analysis of adult females was undertaken to clarify the taxonomic placement of these species and to determine their relationships. Methods were included on collecting, preserving, slide-mounting, and measuring specimens, and on preparing illustrations. Keys to genera and species of \"legless\" mealybugs were developed. <p>Reduction or loss of legs and antennae apparently occurred convergently in response to similar environmental conditions and was not found supportive of homogeneity in the \"legless\" group as a whole. However, the genera Chaetococcus Maskell, Idiococcus Takahashi & Kanda, Kermicus Newstead, Serrolecanium Shinji, Tangicoccus Kozar & Walter, and a newly established genus share many characteristics and were treated as the tribe Serrolecaniini Shinji. The adult females of 13 species contained in these genera were redescribed, with illustrations produced for 12. A phylogenetic analysis of the tribe showed that converse to simplification in appendages, adaptations in other features (e.g., latero-projecting lobes and a caudally-directed vulva) probably developed to increase reproductive success and survivorship. <p>The genera Acinococcus Williams, Antonina Signoret, Antoninoides Ferris, Cypericoccus Williams, Nesticoccus Tang, Paludicoccus Ferris, Parapaludicoccus Mamet, Peridiococcus Williams, Pseudantonina Green, and Sphaerococcus Maskell are not closely related to one another or to members of the tribe Serrolecaniini based on adult female morphology. These 10 genera and their type species were redescribed, and illustrations produced for all but Nesticoccus sinensis Tang. Comments or redescriptions are provided for the 21 additional species that comprise these genera; however, the taxonomic placement of 18 additional species erroneously assigned to Pseudantonina and Sphaerococcus is uncertain. <P>Lectotypes were designated for Antonina crawi Cockerell, A. graminis Parrott, A. phragmitis Marchal, A. purpurea Signoret, A. waterstoni Newstead, Jdiococcus bambusae Takahashi & Kanda, Pseudantonina bambusae Green, Pseudolecanium disticlium Kuwana, and Sphaerococcus ethelae Fuller. A replacement name was proposed for the junior homonym Antoninella Sulc. The species names Antonina anceps Green, Antonina maritima Green, and Jdiococcus maanshanensis Tang & Wu are considered junior synonyms. Two species of Serrolecanium were described, and a new genus was established for the placement of Serrolecanium jiuhuaensis Wu and Serrolecanium sasae (Siraiwa). Six new name combinations are also made.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:17:31Z (GMT). No. of bitstreams: 1 LD5655.V856_1993.H462.pdf: 12979615 bytes, checksum: 2cccca6659b334c990c50a9f6cd8da81 (MD5)   Previous issue date: 1993-12-05",
  "format_medium": "BTD",
  "handle": "29327",
  "identifier_other": "etd-10212005-123006",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10212005-123006/",
  "identifier_uri": "http://hdl.handle.net/10919/29327",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1993.H462.pdf",
  "subject": "Mealybugs",
  "subject_lcc": "LD5655.V856 1993.H462",
  "title": "Revision of the tribe Serrolecaniini Shinji (Pseudococcidae) with discussion on other \"legless\" mealybugs",
  "type": "Dissertation"
}