{
  "contributor_author": "DeLoria, Julie Elizabeth",
  "contributor_committeechair": "Wiswell, Albert K.",
  "contributor_committeemember": [
    "Pearson, Judy",
    "Callahan, Jamie L.",
    "Hardy, Christopher R.",
    "Cline, Marvin Gerald"
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:17:31Z",
  "date_adate": "2001-10-30",
  "date_available": "2014-03-14T20:17:31Z",
  "date_issued": "2001-10-04",
  "date_rdate": "2002-10-30",
  "date_sdate": "2001-10-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examined commitment levels of two groups of employees: core government employees and contract employees who directly supported the Federal Government.  The sample included 85 government employees and 131 contract employees.  The research identified each group's level of commitment to various work entities.  These included: immediate government office, government organization, employer, and occupation.  The focus was on affective commitment, i.e., an employee's emotional attachment to, and desire to maintain membership with, a work entity.  A measure was also taken for socialization-related learning.   The purpose was to determine if there were: (1) differing levels of affective commitment among the immediate government office, government organization, the employer, and the occupation within each group, (2) differences in work entity affective commitment levels between the two groups, (3) differences in levels of socialization-related learning between the two groups (4) relationships between socialization-related learning levels and work entity affective commitment levels for each group, (5) differences in work entity affective commitment levels in relation to certain demographic variables, and (6) relationships between certain demographic variables and work entity affective commitment levels for each group.  Findings indicated that both groups of employees did vary in commitment levels to various work entities.  Government employees displayed the most commitment to the occupation and least to the immediate office.  Contract employees also displayed the most commitment to the occupation but the least to the government organization.  Between the two groups, commitment level to the employer differed significantly with contractors displaying a higher level to the employing firm than government employees recorded to the Federal Service.  Work entity had a significant effect and a significant employee group-by-work entity interaction was found.  Differences in socialization-related learning levels and a relationship between socialization-related learning and work entity affective commitment levels were found for both groups.  Several relationships between demographic variables and work entity affective commitment levels were also found for both groups.   Formal and informal interventions and work delegation strategies are recommended for organizations involved in employment relationships involving core and contract employees.  Areas for future research are also presented.",
  "description_provenance": [
    "Author Email: delorias@bellatlantic.net",
    "Made available in DSpace on 2014-03-14T20:17:31Z (GMT). No. of bitstreams: 1 dissdf8.pdf: 605119 bytes, checksum: 13f6bf6e395d914af3ffea9dcf82f183 (MD5)   Previous issue date: 2001-10-04"
  ],
  "handle": "29324",
  "identifier_other": "etd-10212001-152609",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10212001-152609/",
  "identifier_uri": "http://hdl.handle.net/10919/29324",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissdf8.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "core government employees",
    "socialization-related learning",
    "contingent",
    "outsourcing",
    "contract employees",
    "commitment"
  ],
  "title": "A Comparative Study of Employee Commitment:  Core and Contract Employees in a Federal Agency",
  "type": "Dissertation"
}