{
  "contributor_author": "Gericke, Kevin Louis",
  "contributor_committeechair": "Sullivan, Jay",
  "contributor_committeemember": [
    "Hite, Michael P.",
    "Klemperer, W. David",
    "Williams, Daniel R.",
    "Wisdom, Harold W."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:17:30Z",
  "date_adate": "2005-10-20",
  "date_available": "2014-03-14T20:17:30Z",
  "date_issued": "1993-08-05",
  "date_rdate": "2005-10-20",
  "date_sdate": "2005-10-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This study examines multiple destination recreation trips and the economic valuation of recreation sites using the travel cost method. One common assumption of the travel cost method is that all travel costs incurred by a visitor are exclusively for a trip to a single site. However, this assumption is often invalid, particularly in the eastern United States where there are numerous recreation areas close to large urban populations.</p> <p> Few researchers have attempted to overcome the difficulty of incorporating multiple destination trips into the travel cost method. Those researchers that have proposed methods have not provided a definitive guideline for how to account for multiple destination trips in the travel cost method, and have not compared their methods.</p> <p>This study proposes a simple model to assist in understanding the varying suggestions by researchers who have attempted to incorporate multiple destination trips into travel cost analyses. The difficulty of defining a recreation good or service, the identification of recreation substitutes, and possible decision processes used by individuals to identify recreation trip destinations are also discussed.</p> <p> Data collected at Shenandoah National Park, Virginia, are used in a zonal travel cost model to estimate the consumers' surplus associated with on-site recreation use at the Park, and to compare proposed methods for handling multiple destination trips. The results of this study show that the travel cost method is sensitive to assumptions about multiple destination visitors, as well as which visitors are included in travel cost analyses. Consumers' surplus estimates ranged from $38 to $8249 per visitor, depending on the assumptions about multiple destination trips, and which visitors were included in the analyses.</p> <p> The results of this study suggest that the travel cost method can be used as an information system, rather than as a method to determine a single estimate of recreation value in monetary terms. The travel cost method is capable of providing a manager with information about relative magnitudes of willingness to pay for a resource by a variety of visitor groups. By varying the assumptions about visitors to the site, a manager can determine a range of consumers' surplus estimates, which may be more useful than a single estimate, to better assist in management decisions regarding the mixture of resources desired by individuals.</p>",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:17:30Z (GMT). No. of bitstreams: 1 LD5655.V856_1993.G474.pdf: 4399309 bytes, checksum: 6f0108c282f9b2a0a9f854b7174e9e57 (MD5)   Previous issue date: 1993-08-05",
  "format_medium": "BTD",
  "handle": "29320",
  "identifier_other": "etd-10202005-102828",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10202005-102828/",
  "identifier_uri": "http://hdl.handle.net/10919/29320",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1993.G474.pdf",
  "subject": [
    "Origin and destination traffic surveys",
    "Recreation areas Virginia Shenandoah National Park",
    "Trip generation",
    "Travel costs Virginia Shenandoah National Park."
  ],
  "subject_lcc": "LD5655.V856 1993.G474",
  "title": "Multiple destination trips and the economic valuation of outdoor recreation sites",
  "type": "Dissertation"
}