{
  "contributor_author": "Cramp, Ashley McCrary",
  "contributor_committeechair": "Byers, Larry",
  "contributor_committeemember": [
    "Twiford, Travis W.",
    "Mallory, Walter D.",
    "Krill, Cecelia W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:17:31Z",
  "date_adate": "2006-11-22",
  "date_available": "2014-03-14T20:17:31Z",
  "date_issued": "2006-08-28",
  "date_rdate": "2006-11-22",
  "date_sdate": "2006-10-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "There is ample research (Bova & Phillips, 1994; Cordeiro & Smith-Sloan, 1995; Daresh, 2002; Ginty & Gaskill, 1993; Playko, 1995; Riche, 1979) to demonstrate the need for and benefits of mentoring both in the business world and with first year teachers.  Mentoring allows a more experienced person to work directly with a less experienced person.  Some benefits of such a relationship can include knowledge transfer, increased learning, creation of a support network, a decrease in job stress and anxiety, and an opportunity for the prot&#233;g&#233; to learn the big picture.  School administrators face an increasing number of challenges in a job where new responsibilities are created almost on a daily basis.  Many states will experience a shortage of qualified administrative applicants for open positions.  This shortage is due to the retirement in the next several years of many existing administrators in addition to a larger number of positions accompanying increased school enrollment.  Many states are exploring ways to address this concern.  The first is through a reevaluation of certification criteria (training).  The second is through the development of mentoring programs for new administrators (keeping the administrators we have).  However, there is little research available on the mentoring of new administrators.  This study identified the existing opinions, beliefs, and attitudes, including perceived value that administrators have towards mentoring for their job assignment.  Statistical significance was determined at alpha < .01 for each analysis of variance between the groups. There was one item on the survey where a statistically significant difference was found between gender; assessment and grading (p(F)  = .007).  There was one item on the survey where a statistically significant difference was found between principals and assistant principals; school management (p(F) = .008).  There was one item on the survey where a statistically significant difference was found between administrators who have and have not served as a formal mentor; time for discussion together (p(F) = .003).  There was one item on the survey where a statistically significant difference was found between administrators who have and have not served as an informal mentor; mentor at same school level (p(F) = .005).  However, the final two items of statistical significance are from Section B of the survey.  Section B had a reliability of Cronbach's alpha = .50 (see Table 1).  Therefore, results of these items must be viewed with caution.  It is important to note that 400 out of 414 (96.7%) individual item analyses found no statistically significant differences between the various groups.",
  "description_provenance": [
    "Author Email: acramp@manassas.k12.va.us",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: lbyers@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:31Z (GMT). No. of bitstreams: 14 ReferencesETD.pdf: 37394 bytes, checksum: 6b0cd791a900943c998036216f97971c (MD5) CHAPTER1ETD2.pdf: 53765 bytes, checksum: cb97491ef57627e69293a85228916d18 (MD5) CHAPTER2ETD.pdf: 59127 bytes, checksum: d7c93251af6217af6a33c8c54ec5601b (MD5) AppendicesETD2.pdf: 1573497 bytes, checksum: ed9d5b2459915e6b8312308067fb698c (MD5) VitaETD.pdf: 11064 bytes, checksum: 21e86d49cee14180b3bd63aa40243751 (MD5) AbstractETD2.pdf: 12769 bytes, checksum: 8d90e9c986f4c154c68939649658212e (MD5) TableofContentsETD2.pdf: 18718 bytes, checksum: 184e27146b6dc68bf3472ccfe4576324 (MD5) Chapter5ETD.pdf: 26619 bytes, checksum: 2bb1bcd3cb3a35dd456941181ad56d82 (MD5) CHAPTER3ETD.pdf: 26088 bytes, checksum: 87fa4c440f57a29e3d05735d1d03ec24 (MD5) ACKNOWLEDGEMENTSETD.pdf: 11972 bytes, checksum: 7b7e6aba263bb95f4bd97a47fe03335d (MD5) ListofMultimediaObjectsETD2.pdf: 26695 bytes, checksum: a4fc7846ce9e889817aabeaaf47d1bec (MD5) CHAPTER4ETD.pdf: 213287 bytes, checksum: 5428c93329056084ba20f360fa981eb1 (MD5) TitlePageETD2.pdf: 10206 bytes, checksum: 7ba9344385b871e1e60d75df9785357b (MD5) DEDICATIONETD.pdf: 11074 bytes, checksum: 38612ef6635a0266e8a1f7571aec746d (MD5)   Previous issue date: 2006-08-28"
  ],
  "handle": "29329",
  "identifier_other": "etd-10212006-141010",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10212006-141010/",
  "identifier_uri": "http://hdl.handle.net/10919/29329",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ReferencesETD.pdf",
    "CHAPTER1ETD2.pdf",
    "CHAPTER2ETD.pdf",
    "AppendicesETD2.pdf",
    "VitaETD.pdf",
    "AbstractETD2.pdf",
    "TableofContentsETD2.pdf",
    "Chapter5ETD.pdf",
    "CHAPTER3ETD.pdf",
    "ACKNOWLEDGEMENTSETD.pdf",
    "ListofMultimediaObjectsETD2.pdf",
    "CHAPTER4ETD.pdf",
    "TitlePageETD2.pdf",
    "DEDICATIONETD.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Perceived Value",
    "Mentoring",
    "Attitudes",
    "Opinions",
    "School Administrators"
  ],
  "title": "Opinions, Beliefs, and Attitudes, Including Perceived Value, that Virginia Principals and Assistant Principals Have Towards Mentoring for Their Job Assignment",
  "type": "Dissertation"
}