{
  "contributor_author": "Uribe Leon, Marcela",
  "contributor_committeechair": "Tilley-Lubbs, Gresilda A.",
  "contributor_committeemember": [
    "Dr. Jim Garrison",
    "Dr. Barbara Ellen Smith",
    "Dr. Judith L. Shrum"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:32Z",
  "date_adate": "2010-11-09",
  "date_available": "2014-03-14T20:17:32Z",
  "date_issued": "2010-10-13",
  "date_rdate": "2013-05-21",
  "date_sdate": "2010-10-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Parental involvement is highly important for children창  s success at school. Research has shown that parental involvement leads to higher student achievement, better school attendance, and a reduction in dropout rates. However, what happens with those parents who do not speak English or have limited communication skills in this language? How can they become involved in their children창  s schooling when the children attend school in a language foreign to the parents?      <p> This study examines the experiences of three Mexican immigrant mothers and one father getting involved in their children창  s education in the United States. Helena was an active participant of a service-learning program hosted by a medium-sized Land Grand University. Sandra also attended the program but only for some time. Finally, the Hernandez parents, Mercedes and Jose Luis, were randomly selected in the community and did not participate in the service-learning program. This qualitative study relied mainly upon semi-structure interviews with the participants along with observations and field notes. The conclusions from this study provide insight as to how Mexican-immigrant parents with low-income develop an understanding of the school system in the United States.      <p> Analysis revealed two main strategies that parents use to communicate with the school: 1) using interpreters as affordance networks for communication, and 2) using their own knowledge of English to take actions and comply with school requirements. Data show that, contrary to common assumptions, parents do not prefer children as their first option for interpreting functions. In terms of learning about standard cultural practices of parental involvement parents accommodate to school demands by using various strategies and resources from their funds of knowledge. Parents learn about standard cultural practices of parental involvement and at the same time they support their children창  s education; in this process parents rely on their own cultural repertoires. Besides, parents seek places where they can develop community ties in order to learn about the how-tos of life in the United States. Finally, findings demonstrate that parents feel frustration and anxiety about their relationship with the schools, since they are facing with great resilience the every life challenges of living in a culture and language different from their own. The main findings of this study and discussing on the implications provided a discussion for policy changes in the context of the NCLB act, and suggestions for teacher preparation programs, and local school or service programs.",
  "description_provenance": [
    "Author Email: maruribe@vt.edu",
    "Advisor Email: glubbs@vt.edu",
    "Advisor Email: wesley@vt.edu",
    "Advisor Email: smithb@vt.edu",
    "Advisor Email: jshrum@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:32Z (GMT). No. of bitstreams: 3 Uribe_Dissertation_ETDOct2010.pdf: 1086552 bytes, checksum: f5c07dcec5e00f900c0ce5f73a5855f7 (MD5) Approval_Letter_1.pdf: 259033 bytes, checksum: 831afb775ab78c4971f9d325a25df831 (MD5) Continuation_approval_letter.pdf: 247022 bytes, checksum: 3f55bc5116fd3dcc706e5b882334b225 (MD5)   Previous issue date: 2010-10-13"
  ],
  "handle": "29333",
  "identifier_other": "etd-10212010-232036",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10212010-232036/",
  "identifier_uri": "http://hdl.handle.net/10919/29333",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Uribe_Dissertation_ETDOct2010.pdf",
    "Approval_Letter_1.pdf",
    "Continuation_approval_letter.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "interpreters",
    "service-learning",
    "Parental involvement; Latinos; funds of knowledge;"
  ],
  "title": "Re-Learning the Script of Parental Involvement in the United States;  Three Case Studies of Mexican Parents in Southwest Virginia.",
  "type": "Dissertation"
}