{
  "contributor_author": "Odeh, Awatef",
  "contributor_committeecochair": [
    "Eng, Ludeman A.",
    "Dascanio, John J."
  ],
  "contributor_committeemember": [
    "Bowen, John M.",
    "Caceci, Thomas",
    "Saacke, Richard G."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:17:33Z",
  "date_adate": "2002-10-30",
  "date_available": "2014-03-14T20:17:33Z",
  "date_issued": "2002-09-20",
  "date_rdate": "2003-10-30",
  "date_sdate": "2002-10-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "ABSTRACT Platelet activating factor (PAF) is a unique signaling phospholipid that has many biologic properties in addition to platelet activation. PAF roles in reproduction involve ovulation, fertilization, embryo development, implantation and parturition. It may also serve as a biomarker for normal sperm function. The presence of PAF receptor on the spermatozoa of 10 stallions was investigated by immunofluorescence microscopy. Statistical analysis revealed that the fluorescence intensity, FI (Mean+/-SEM), in the post- acrosomal region (FI= 2.60+/-0.15) was significantly higher (P< 0.01) than that in any other region of stallion spermatozoa. The effect of synthetic PAF on stallion spermatozoal motility, capacitation, and the acrosome reaction (AR) were evaluated. Treatment of 10 stallion semen samples with 10 â  4 to 10 â  13 M PAF resulted in statistically significant differences in motility and capacitation (r2 = 0.81 and 0.83 respectively). The concentration of PAF, incubation time and their interaction were highly significant (P< 0.01) for their effect on motility. Concentrations of PAF ranging from 10-9 to10-11 M were able to induce capacitation. Following capacitation in vitro with PAF, and induction of the acrosomal reaction by progesterone, transmission electron microscopy (TEM) was conducted on the spermatozoa of 3 stallions, to detect the true AR. Differences in PAF concentrations were highly significant as indicated by R-square (for intact: 97.2, reacted: 89.8, and for vesiculated: 98.1). Treating spermatozoa from 3 stallions with the PAF antagonist FR-49175 inhibited calcium release and fluorescence intensity with a median inhibitory concentration (IC50) of 10-7.5 M (r2=0.82, P<0.01) and 10-8 M (r2=0.92, P<0.01) respectively, suggesting a receptor mediated process for the mechanism of action of PAF. Although the exact mechanisms of PAF action on equine spermatozoa remain unclear, it is widely reported that PAF acts by a receptor-mediated mechanism and that the PAF receptor is a member of the family of G-protein coupled receptors with phospholipase C as the effector. Since the limited success in equine ART (e.g. IVF) is in part due to lack of efficient treatment of stallion spermatozoa for capacitation, PAF may be useful to help capacitate stallion spermatozoa. Without proper capacitation, spermatozoa are unable to initiate the acrosome reaction which is a prerequisite for fertilization.",
  "description_provenance": [
    "Author Email: aodeh@vt.edu",
    "Advisor Email: jmbowen@vt.edu",
    "Advisor Email: laeng@vt.edu",
    "Advisor Email: elitis@vt.edu",
    "Advisor Email: jjd@vt.edu",
    "Advisor Email: saacke@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:33Z (GMT). No. of bitstreams: 1 Odehfinal.pdf: 2043217 bytes, checksum: edd0aa0c25cf08b1da8c895f7df2a8f1 (MD5)   Previous issue date: 2002-09-20"
  ],
  "handle": "29337",
  "identifier_other": "etd-10222002-191649",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10222002-191649/",
  "identifier_uri": "http://hdl.handle.net/10919/29337",
  "publisher": "Virginia Tech",
  "relation_haspart": "Odehfinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Ionomycin",
    "CTC",
    "Fluo-3",
    "Antagonist",
    "TEM"
  ],
  "title": "Identification of platelet activating factor (PAF) receptor in equine spermatozoa and its role in motility, capacitation and the acrosome reaction",
  "type": "Dissertation"
}