{
  "contributor_author": "Rateau, Richard James",
  "contributor_committeechair": "Kaufman, Eric K.",
  "contributor_committeemember": [
    "Broyles, Thomas W.",
    "Fowler, Shelli B.",
    "Robinson, J. Shane"
  ],
  "contributor_department": "Agricultural and Extension Education",
  "date_accessioned": "2014-03-14T20:17:32Z",
  "date_adate": "2011-11-04",
  "date_available": "2014-03-14T20:17:32Z",
  "date_issued": "2011-10-11",
  "date_rdate": "2012-04-12",
  "date_sdate": "2011-10-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In our increasingly competitive world, it is critical that college graduates enter the workplace with the appropriate skills to not only survive but also grow their career. Current college graduates have not consistently acquired the skills needed for success in the workplace to learn and thrive continuously in our rapidly changing world. The Virginia Tech College of Agriculture and Life Science must identify the specific strategies that develop best the needed skills for the success of the graduate and society The purpose of the study was to identify a land grant college of agriculture and life sciencesâ   (LGCALS) current programmatic and classroom strategies for developing studentsâ   ability to learn and thrive continuously in our rapidly changing world and a (1) explore programmatic strategies for developing studentsâ   ability to continuously learn and thrive; (2) explore innovative instructors classroom strategies for developing studentsâ   ability to learn and thrive continuously; (3) describe graduates perceptions of career readiness as measured through the bases of competence inventory, and finally; (4) compare programmatic strategies, classroom strategies and graduatesâ   perceptions for career readiness.  A mixed methods convergent parallel design guided the research. Qualitative interviews were employed for exploring experiences using an interpretive, constructivist, and naturalistic approach for research objectives 1 and 2. A cross sectional survey design and questionnaire, Making the Match, was used to conduct the quantitative research for objective 3. The mixed methods portion of the convergent parallel design was used to frame and explore research objective 4. Findings of the study detail need for curriculum improvement in problem solving, learning, time management, creativity and change, and personal strengths.",
  "description_provenance": [
    "Author Email: rrateau@vt.edu",
    "Advisor Email: ekaufman@vt.edu",
    "Advisor Email: tbroyles@vt.edu",
    "Advisor Email: shfowler@vt.edu",
    "Advisor Email: shane.robinson@okstate.edu",
    "Made available in DSpace on 2014-03-14T20:17:32Z (GMT). No. of bitstreams: 2 Rateau_RJ_D_2011.pdf: 2612163 bytes, checksum: 2e32c4afc30f27520075c6d54ea6a612 (MD5) Rateau_RJ_D_2011_Copyright.pdf: 293708 bytes, checksum: bff2628b8aa2b4e519e1c157e2e9bcb8 (MD5)   Previous issue date: 2011-10-11"
  ],
  "handle": "29334",
  "identifier_other": "etd-10212011-111611",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10212011-111611/",
  "identifier_uri": "http://hdl.handle.net/10919/29334",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Rateau_RJ_D_2011.pdf",
    "Rateau_RJ_D_2011_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "skills model of leadership",
    "role of higher education",
    "path-goal leadership theory",
    "job skills",
    "learner-centered teaching",
    "employability potential",
    "Borich needs assessment"
  ],
  "title": "Understanding the Employability of College Graduates for Success in the Workplace",
  "type": "Dissertation"
}