{
  "contributor_author": "Lopes, Marco A. F.",
  "contributor_committeechair": "White, Nathaniel A. II",
  "contributor_committeecochair": "Crisman, Mark Virgil",
  "contributor_committeemember": [
    "Blikslager, Anthony",
    "Swecker, William S. Jr.",
    "Kronfeld, David S.",
    "Murray, Michael J."
  ],
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:17:33Z",
  "date_adate": "2002-10-25",
  "date_available": "2014-03-14T20:17:33Z",
  "date_issued": "2002-09-30",
  "date_rdate": "2003-10-25",
  "date_sdate": "2002-10-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Systemic hydration, plasma electrolytes, ingesta and fecal hydration and gastrointestinal passage of cobalt (after CoEDTA administration via nasogastric tube) in horses fed large grain meals or treated with enteral fluid therapy, IV fluid therapy and enteral laxatives were investigated. In the first study, 0.9% NaCl (10 L/h/8h) was administered slowly via a small-bore nasogastric tube or as 10 L boluses via a large-bore nasogastric tube to four normal horses. In the other studies, horses with a right dorsal colon fistula were used. To create the right dorsal colon fistula, a cannula with 5 cm internal diameter was implanted 2 to 6 weeks after a right dorsal colopexy had been created. Six horses with the right dorsal colostomy were alternately used to test three feeding regimes for 48 h: 1- hay free choice; 2- hay free choice plus 4.5 kg of sweet feed twice daily after a period of 5 days of adaptation; 3- sudden change from hay to hay plus sweet feed. Seven horses with the right dorsal colostomy were alternately used to test 6 experimental conditions while fasted for 24 h: 1- control (no treatment), 2- enteral MgSO4 (1 g/kg), 3- enteral Na2SO4 (1 g/kg), 4- IV lactated Ringer's solution (5 L/h/12 h), 5- enteral water (5 L/h/12 h), 6- enteral electrolyte solution (5 L/h/12 h). In the last study, four horses with the right dorsal colostomy were alternately treated with enteral electrolyte solution (10 L/h/6h) and enteral MgSO4 (1 g/kg) plus IV fluid therapy (10 L/h/6h). Despite the administration regimen, enteral administration of 0.9% NaCl produced diarrhea, hypernatremia and hyperchloremia. Colostomy allowed serial collection of large ingesta samples. Grain ingestion did not change PCV or plasma protein, but affected plasma electrolytes and produced dehydration of ingesta and formation of frothy ingesta. Fasting delayed gastrointestinal transit. Enteral fluid therapy was the most effective treatment in promoting ingesta hydration. Enteral water, MgSO4, Na2SO4, IV fluid therapy and enteral MgSO4 plus IV fluid therapy were either ineffective in promoting ingesta hydration or produced marked plasma electrolyte imbalance. These findings support the use of enteral fluid therapy in horses with gastrointestinal impaction.",
  "description_provenance": [
    "Author Email: mlopes@vt.edu",
    "Advisor Email: farmuse@vt.edu",
    "Advisor Email: nawhite2@vt.edu",
    "Advisor Email: Anthony_Blikslager@ncsu.edu",
    "Advisor Email: cvmwss@vt.edu",
    "Advisor Email: kronfeld@vt.edu",
    "Advisor Email: mjmurray@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:33Z (GMT). No. of bitstreams: 1 MarcoLopesPhD10-24-02.pdf: 1414912 bytes, checksum: c785eb2989d7f531e4fde715ede3ce28 (MD5)   Previous issue date: 2002-09-30"
  ],
  "handle": "29338",
  "identifier_other": "etd-10222002-205956",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10222002-205956/",
  "identifier_uri": "http://hdl.handle.net/10919/29338",
  "publisher": "Virginia Tech",
  "relation_haspart": "MarcoLopesPhD10-24-02.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "gastrointestinal physiology",
    "gastrointestinal disease",
    "equine",
    "colic"
  ],
  "title": "Hydration of Colonic Ingesta and Feces in Horses Fed Large Grain Meals or Treated with Enteral Fluid Therapy, Saline Cathartics and Intravenous Fluid Therapy",
  "type": "Dissertation"
}