{
  "contributor_author": "Mann, James Gainey",
  "contributor_committeechair": "Liu, Y. A.",
  "contributor_committeemember": [
    "Davis, Richey M.",
    "Sherali, Hanif D.",
    "Conger, William L.",
    "Love, Nancy G."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:17:33Z",
  "date_adate": "1999-10-29",
  "date_available": "2014-03-14T20:17:33Z",
  "date_issued": "1999-10-15",
  "date_rdate": "2005-10-29",
  "date_sdate": "1999-10-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation is a complete unifying approach to the fundamentals, industrial applications and software implementation of an important branch of process-engineering principles and practice, called process integration. The latter refers to the system-oriented, thermodynamically-based and integrated approaches to the analysis, synthesis and retrofit of process plants, focusing on integrating the use of materials and energy, and minimizing the generation of emissions and wastes. This work extends process integration to include applications for industrial water reuse and wastewater minimization and presents previous developments in a unified manner.  The basic ideas of process integration are: (1) to consider first the big picture by looking at the entire manufacturing process as an integrated system; (2) to apply process-engineering principles to key process steps to establish a priori targets for the use of materials and energy, and for the generation of emissions and wastes; and (3) to finalize the details of the process design and retrofit later to support the integrated view, particularly in meeting the established targets.  Pinch technology is a set of primarily graphical tools for analyzing a process plant's potential for energy conservation, emission reduction and waste minimization. Here, we identify targets for the minimum consumption of heating and cooling utilities, mass-separating agents, freshwater consumption, wastewater generation and effluent treatment and propose economical grassroots designs and retrofit projects to meet these goals.  An emerging alternative approach to pinch technology, especially when analyzing complex water-using operations and effluent-treatment systems, is mathematical optimization. We solve nonlinear programming problems for simple water-using operations through readily available commercial software. However, more complex, nonconvex problems require sophisticated reformulation techniques to guarantee optimality and are the subject of continuing academic and commercial development.  This work develops the principles and practice of an environmentally significant breakthrough of process integration, called water-pinch technology. The new technology enables the practicing engineers to maximize water reuse, reduce wastewater generation, and minimize effluent treatment through pinch technology and mathematical optimization. It applies the technology in an industrial water-reuse demonstration project in a petrochemical complex in Taiwan, increasing the average water reuse (and thus reducing the wastewater treatment) in the five manufacturing facilities from 18.6% to 37%.  This dissertation presents complete conceptual and software developments to unify the known branches of process integration, such as heat and mass integration, and wastewater minimization, and explores new frontiers of applications to greatly simplify the tools of process integration for practicing engineers.",
  "description_provenance": [
    "Author Email: jmann@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: hanifs@vt.edu",
    "Advisor Email: wlconger@vt.edu",
    "Advisor Email: design@vt.edu",
    "Advisor Email: nlove@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:33Z (GMT). No. of bitstreams: 13 Chapter_1.PDF: 105604 bytes, checksum: 3304489c71e0a1ad1b3394503af87e10 (MD5) Chapter_3.PDF: 161751 bytes, checksum: 062e68c75cbd09d5b83670775579c830 (MD5) Chapter_2.PDF: 177516 bytes, checksum: d9adf28cf18c72e34f58b86954e75078 (MD5) Appendix_A.PDF: 5680 bytes, checksum: 36cfd49009bffe12d26339ea31cfb687 (MD5) Chapter_10.PDF: 81047 bytes, checksum: e5a17b27d5563a900ab753947e4cb43d (MD5) Chapter_9.PDF: 7682 bytes, checksum: 81d674df9ef86edef0090bfcf6a02d09 (MD5) Chapter_8.PDF: 241419 bytes, checksum: 6e973b80c09b1b730cae28820926158b (MD5) Chapter_7.PDF: 141144 bytes, checksum: dbc57f6507b69d46efce298d49f1eb6a (MD5) Chapter_5.PDF: 148305 bytes, checksum: 738573b7b3262a09c80f25c6e689180b (MD5) Chapter_6.PDF: 210386 bytes, checksum: eacaf2f3b06b56c195ce43019c04c1ec (MD5) First_Pages.PDF: 56570 bytes, checksum: e2ef94018e10c5961fda5fe1e919c864 (MD5) Vita.PDF: 11232 bytes, checksum: 48fed63c1be836ffd06ba84417d53417 (MD5) Chapter_4.PDF: 55130 bytes, checksum: aacf4e46152dd973fe95853f1a11dc1d (MD5)   Previous issue date: 1999-10-15"
  ],
  "handle": "29336",
  "identifier_other": "etd-102199-101855",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-102199-101855/",
  "identifier_uri": "http://hdl.handle.net/10919/29336",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapter_1.PDF",
    "Chapter_3.PDF",
    "Chapter_2.PDF",
    "Appendix_A.PDF",
    "Chapter_10.PDF",
    "Chapter_9.PDF",
    "Chapter_8.PDF",
    "Chapter_7.PDF",
    "Chapter_5.PDF",
    "Chapter_6.PDF",
    "First_Pages.PDF",
    "Vita.PDF",
    "Chapter_4.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Wastewater Minimization",
    "Energy Conservation",
    "Water-Pinch Technology",
    "Heat Integration",
    "Mass Integration",
    "Mathematical Optimization",
    "Thermal-Pinch Technology",
    "Process Integration",
    "Water Reuse"
  ],
  "title": "Process Integration: Unifying Concepts, Industrial Applications and Software Implementation",
  "type": "Dissertation"
}