{
  "contributor_author": "Maupin, Laura Marie",
  "contributor_committeechair": "Rainey, Katy Martin",
  "contributor_committeemember": [
    "Grabau, Elizabeth A.",
    "Griffey, Carl A.",
    "Maroof, M. A. Saghai",
    "Buss, Glenn R."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:17:32Z",
  "date_adate": "2010-11-04",
  "date_available": "2014-03-14T20:17:32Z",
  "date_issued": "2010-09-20",
  "date_rdate": "2010-11-04",
  "date_sdate": "2010-10-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The development of soybean [Glycine max (L.) Merr.] cultivars with modified phosphorus (P) composition has nutritional and environmental benefits, but poor seed germination and emergence presents challenges for commercial production.  Different genetic mutations in two sources of germplasm, CX1834 and V99-5089, decrease the phytate and increase the inorganic phosphorus (Pi) content of seed.  In V99-5089, a mutation in the D-myo-inositol 3-phosphate synthase 1 gene (MIPS1) also results in elevated sucrose content with a concomitant decrease in raffinose and stachyose content, further improving the nutritional value of soybean meal.  Prior to the release of V99-5089-derived germplasm, germplasm with the MIPS1 mutation was characterized and compared to CX1834-derived germplasm to determine the effects of this mutation on agronomic and seed composition traits in multiple environments.     The correlations between P and sugar seed composition traits were favorable for improving the nutritional composition of soybean.  Lack of genotype Ã  environment interaction for sugar traits allows for selection in one growing environment.  Despite the significant genotype Ã  environment interaction for phytate and Pi, lines with the MIPS1 gene could readily be distinguished from normal phytate lines, even in unfavorable environments.  Phenotypic selection for seed Pi content was more effective than marker assisted selection with the Satt453 marker.  The CX1834-derived lines were lower for phytate and higher for Pi content compared to the V99-5089-derived lines.  The use of subtropical winter nursery environments for population development resulted in significant reductions in emergence of low phytate genotypes, skewing segregation ratios and prohibiting the analysis of agronomic traits.  Emergence was significantly affected by genotype, environment, and the genotype Ã  environment interaction in three emergence tests of advanced low phytate lines.  Emergence of modified lines was reduced but some were in a range that would not prohibit commercialization of P modified cultivars.  Yields of the best emerging lines were not significantly different from the control cultivars.  The results of this study indicate that the development of commercial cultivars with the V99-5089-derived MIPS1 mutation is possible but breeders and producers must focus attention on emergence during population development and seed production to emphasize selection of lines with high emergence potential.",
  "description_provenance": [
    "Author Email: lmmaupin@vt.edu",
    "Advisor Email: egrabau@vt.edu",
    "Advisor Email: cgriffey@vt.edu",
    "Advisor Email: smaroof@vt.edu",
    "Advisor Email: gbuss@vt.edu",
    "Advisor Email: kmrainey@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:32Z (GMT). No. of bitstreams: 1 Maupin_LM_D_2010.pdf: 641472 bytes, checksum: d95768200e4dd61acfc86247f54e2395 (MD5)   Previous issue date: 2010-09-20"
  ],
  "handle": "29332",
  "identifier_other": "etd-10212010-123209",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10212010-123209/",
  "identifier_uri": "http://hdl.handle.net/10919/29332",
  "publisher": "Virginia Tech",
  "relation_haspart": "Maupin_LM_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "phytate",
    "stachyose",
    "and emergence",
    "soybean",
    "sucrose",
    "inorganic phosphorus"
  ],
  "title": "Characterization of Soybean Germplasm with Modified Phosphorus and Sugar Composition",
  "type": "Dissertation"
}