{
  "contributor_author": "Wigginton, Krista Rule",
  "contributor_committeechair": "Vikesland, Peter J.",
  "contributor_committeemember": [
    "Dove, Patricia M.",
    "Little, John C.",
    "Tanko, James M.",
    "Love, Nancy G."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:17:32Z",
  "date_adate": "2008-11-25",
  "date_available": "2014-03-14T20:17:32Z",
  "date_issued": "2008-10-02",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-10-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The development of a waterborne pathogen detection method that is rapid, multiplex, sensitive, and specific, would be of great assistance for water treatment facilities and would help protect water consumers from harmful pathogens.  Here we have utilized surface enhanced Raman spectroscopy (SERS) in a sensitive multiplex pathogen detection method.  Two strategies are proposed herein, one that utilizes SERS antibody labels and one that measures the intrinsic SERS signal of organisms.  For the SERS label strategy, gold nanoparticles are conjugated with antibodies specific to Cryptosporidium parvum and Giardia lamblia and with organic dye molecules.  The dye molecules, rhodamine B isothiocyanate (RBITC) and malachite green isothiocyanate (MGITC) were surface enhanced by the gold nanoparticles resulting in unique fingerprint SERS spectra.  The SERS label method was successful in detecting G. lamblia and C. parvum simultaneously.  The method was subsequently coupled with a filtration step to both concentrate and capture cysts on a flat surface for detection.  Raman mapping across the filter membrane detected ~95% of the spiked cysts in the optimized system.  <p>  In the second type of strategy, intrinsic virus SERS signals were detected with silver nanoparticles for enhancement.  Principal component analysis performed on the spectra data set resulted in the successful differentiation of MS2 and PhiX174 species and also for the differentiation of viable virus samples and inactivated virus samples.",
  "description_provenance": [
    "Author Email: krule@vt.edu",
    "Advisor Email: dove@vt.edu",
    "Advisor Email: jcl@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: nglove@umich.edu",
    "Advisor Email: pvikes@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:32Z (GMT). No. of bitstreams: 1 KRW_ETD_112108.pdf: 1841312 bytes, checksum: c56cab1a3aa9407f68fabbb85b585b81 (MD5)   Previous issue date: 2008-10-02"
  ],
  "handle": "29330",
  "identifier_other": "etd-10212008-012204",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10212008-012204/",
  "identifier_uri": "http://hdl.handle.net/10919/29330",
  "publisher": "Virginia Tech",
  "relation_haspart": "KRW_ETD_112108.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "surface enhanced Raman spectroscopy",
    "Cryptosporidium parvum",
    "drinking water",
    "Giardia lamblia",
    "bacteriophage",
    "pathogen detection"
  ],
  "title": "Surface Enhanced Raman Spectroscopy as a Tool for Waterborne Pathogen Testing",
  "type": "Dissertation"
}