{
  "contributor_author": "Gaudet, Jason",
  "contributor_committeechair": "Oyama, Shigeo Ted",
  "contributor_committeemember": [
    "Hanson, Brian E.",
    "Cox, David F.",
    "Davis, Richey M."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:17:33Z",
  "date_adate": "2010-12-07",
  "date_available": "2014-03-14T20:17:33Z",
  "date_issued": "2010-10-21",
  "date_rdate": "2010-12-07",
  "date_sdate": "2010-10-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Catalysts consisting of silver on Î±-Al2O3, Î±-SiC, and Î²-SiC supports were synthesized and tested for catalytic performance in the gas-phase direct oxidation of ethylene to ethylene oxide.  For this study, which used no promoters, ethylene oxidation selectivity of SiC-supported catalysts ranged from 10 to 60% and conversion from 0-4.5%.  Silicon carbide supported catalysts exhibited poor performance except for a surface-modified Î²-SiC-supported catalyst, which demonstrated conversion and selectivity similar to that of an Î±-Al2O3-supported catalyst.  This Ag/Î²-SiC catalyst was further investigated with a kinetic study, and the reaction orders were found to be 0.18 with respect to ethylene and 0.34 with respect to oxygen.  The kinetic results were consistent with Langmuir-Hinshelwood rate expressions developed from single-site and dual-site reaction mechanisms.   Gold nanoparticles on titanium oxide and titania-silica supports are active for the formation of propylene oxide by the oxidation of propylene with hydrogen and oxygen mixtures.  This study investigates the effect of cyanide treatment on gold supported on titanosilicate zeolite supports (Au/TS-1).  Catalysts treated with weak solutions of sodium cyanide resulted in preferential removal of small gold particles, while catalysts treated with strong solutions resulted in dissolution of the gold and re-precipitation as gold (+1) cyanide.  X-ray absorption spectroscopy demonstrated that catalysts which produce propylene oxide in the presence of hydrogen and oxygen mixtures had supported gold (+3) oxide nanoparticles of 3 nm size after synthesis, which were reduced to gold metal at reaction conditions.  Samples treated with strong solutions of sodium cyanide resulted in supported gold (+1) cyanide particles of large size, 9-11 nm.  These particles did not produce propylene oxide but, surprisingly, showed high selectivity toward propylene hydrogenation.  Increasing gold (+1) cyanide particle size resulted in a decrease in hydrogenation activity.   TS-1 and Au/TS-1 surfaces were studied with laser Raman spectroscopy.  Surface fluorescence was substantially reduced with a low-temperature ozone treatment, allowing observation of titanosilicate framework bands.  Hydrocarbon vibrations are observed for TS-1 and Au/TS-1 under propylene.  Density functional theory models indicated that propylene adsorbed to a metal site along the Ï  bond would show a Raman spectrum very similar to gas-phase propylene except for out-of-plane C-H vibrations, which would be moved to higher energy.  This adsorption spectrum, with out-of-plane vibrations shifted to higher energy, was observed for both TS-1 and Au/TS-1.  Langmuir adsorption isotherms were generated for both TS-1 and Au/TS-1, and a scaling factor derived from propylene uptake experiments allowed these isotherms to be scaled to propylene coverage of titanium.",
  "description_provenance": [
    "Author Email: jgaudet@vt.edu",
    "Advisor Email: hanson@vt.edu",
    "Advisor Email: oyama@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:33Z (GMT). No. of bitstreams: 1 Gaudet_JR_D_2010.pdf: 5973869 bytes, checksum: 450365368ca0080884976a5b4908d63e (MD5)   Previous issue date: 2010-10-21"
  ],
  "handle": "29341",
  "identifier_other": "etd-10222010-115835",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10222010-115835/",
  "identifier_uri": "http://hdl.handle.net/10919/29341",
  "publisher": "Virginia Tech",
  "relation_haspart": "Gaudet_JR_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "TS-1",
    "Catalyst",
    "Propylene",
    "Ethylene  oxide",
    "EXAFS",
    "Silver",
    "Alumina",
    "Silicon carbide",
    "Ethylene oxidation",
    "Raman",
    "Au/TS-1",
    "XANES",
    "Ethylene"
  ],
  "title": "Gas-Phase Epoxidation of Ethylene and Propylene",
  "type": "Dissertation"
}