{
  "contributor_author": "Guo, Dali",
  "contributor_committeechair": "Mou, Paul P.",
  "contributor_committeemember": [
    "Jones, Robert H.",
    "Wynne, Randolph H.",
    "Burger, James A.",
    "Mitchell, Robert J."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:17:34Z",
  "date_adate": "2001-11-06",
  "date_available": "2014-03-14T20:17:34Z",
  "date_issued": "2001-10-09",
  "date_rdate": "2002-11-06",
  "date_sdate": "2001-10-23",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "There has been an increased interest in characterizing and interpreting ecological heterogeneity over space and time in the past two decades.  This is mainly due to the renewed recognition of the significance of heterogeneity in ecological theories.  However, studies that have combined both spatial and temporal aspects of heterogeneity have been rare.  A unified approach to define and quantify heterogeneity has also been lacking.  Designed to overcome these problems, this study was conducted in a 40-year-old Pinus elliottii Engelm. forest  at the Savannah River Site near Aiken, SC, USA with the following specific objectives: 1) to characterize the spatial patterns of soil and forest floor variables (moisture, pH, soil available nitrogen and phosphate, forest floor and soil carbon and nitrogen), 2) to examine the dynamics of these spatial patterns in response to two types of disturbance: whole-tree harvesting and girdling, and 3) to evaluate some of the current methods for quantifying ecological heterogeneity. \tIn response to both disturbance treatments, spatial heterogeneity measured by sample variance showed a marked \"increase and then decline\" temporal pattern in soil moisture, soil available nitrogen and phosphorus.  Similar patterns were not found in total soil C and N, and total litter C and N.  Harvesting resulted in greater and more drastic changes in the variations of soil nutrients and water than did girdling.  Despite the popularity of semivariogram analysis in recent ecological studies, the technique did not provide consistent results on patterns of heterogeneity in our system.  A simulation experiment demonstrated that semivariogram analysis may suffer from many problems when it is used to characterize patchiness, one form of heterogeneity.  \tThe results from this study have a number of implications.  First, spatial patterns of soil resources are high dynamic.  The dynamics of patterns in soil resources may partly account for the weak correlation between vegetation and soil observed in ecological literature.  Second, heterogeneity may be most effectively quantified by first identifying quantifiable components and then quantifying these components individually.  A common pattern can be sought by comparing patterns of different components of heterogeneity for a given ecological property and by comparing patterns of different ecological variables for a given component of heterogeneity.  Third, compared to surveys, field manipulative experiments can provide information that link patterns with ecological processes.  As such, this study adds to ecological literature valuable information on temporal changes of soil heterogeneity following disturbance and conceptual advances in the quantification of ecological heterogeneity.",
  "description_provenance": [
    "Author Email: dguo@vt.edu",
    "Advisor Email: ppmou@uncg.edu",
    "Advisor Email: rhjones@vt.edu",
    "Advisor Email: wynne@vt.edu",
    "Advisor Email: jaburger@vt.edu",
    "Advisor Email: rmitchel@jonesctr.org",
    "Made available in DSpace on 2014-03-14T20:17:34Z (GMT). No. of bitstreams: 1 GD01.pdf: 326590 bytes, checksum: 5cd72cb39d46ecce6682999e3553f79b (MD5)   Previous issue date: 2001-10-09"
  ],
  "handle": "29346",
  "identifier_other": "etd-10232001-084120",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10232001-084120/",
  "identifier_uri": "http://hdl.handle.net/10919/29346",
  "publisher": "Virginia Tech",
  "relation_haspart": "GD01.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "scale",
    "heterogeneity",
    "Geostatistics",
    "whole-tree harvesting",
    "girdling"
  ],
  "title": "Spatio-temporal patterns of soil resources following disturbance in a 40-year-old slash pine (pinus elliottii Engelm.) forest in the Coastal Plain of South Carolina",
  "type": "Dissertation"
}