{
  "contributor_author": "Tarner, Elizabeth  I.",
  "contributor_committeechair": "Gatewood, Thomas E.",
  "contributor_committeemember": [
    "Webb, Loretta C.",
    "Cline, Marvin Gerald",
    "Boucouvalas, Marcie",
    "Curcio, Joan L."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:17:34Z",
  "date_adate": "1997-12-12",
  "date_available": "2014-03-14T20:17:34Z",
  "date_issued": "1997-11-05",
  "date_rdate": "1997-12-12",
  "date_sdate": "1997-11-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to examine the distribution of males and females in line and staff positions in central offices in  selected school districts in Virginia and to explore factors which may have contributed to this distribution.   Answers to the following questions provided data for the study:  What is the gender distribution in central office positions?  What is the percentage of central office positions by gender based upon the total office gender representation in line and staff positions? What is the gender distribution in line and staff positions?  In what way do the selected case study subjects portray their aspirations, their perceived barriers to promotion, their mentors, and their perceptions of gender in central offices?  \tFirst, 56 out of 65 school superintendents responded to a survey requesting the number and title of central office positions, the name and gender of person holding each position, and the designation of each central office position as line or staff.  Student population and region were used in the analysis.  The findings revealed that males outnumber females in central office positions and in line positions.  Fifteen school districts had no women in line positions.  \tSecond, six interviews with line and staff representatives from three school districts were conducted to examine how they portray their aspirations, their perceived barriers to promotion, their mentors, and their perceptions of gender in central offices.   The interviewees revealed that  the line position representatives followed a different career path than those in staff positions; the females and the staff representatives did not aspire to be superintendent; the line position representatives had doctorates while those in staff positions did not; those in staff positions  discussed their accomplishments in programs; those in line positions talked about the responsibilities of their jobs.  All had mentors and guidance in their careers.   \tRecommendations for future studies include more study on the culture of a school system, a continuation of this study on women in line and staff positions in central offices, more inclusion of the perspectives of the female educator in training programs,and the requirement of states and school districts to record gender as part of the statistics.",
  "description_provenance": [
    "Author Email: liztarner@aol.com",
    "Advisor Email: tgatewood@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:34Z (GMT). No. of bitstreams: 2 chapters_1_20to_205.pdf: 364867 bytes, checksum: fa1ad7cb30c9500cd6dec0c9f21b1458 (MD5) front_matter.pdf: 10629 bytes, checksum: 3108ac9b9fecced95274d6e0b77d09bd (MD5)   Previous issue date: 1997-11-05"
  ],
  "handle": "29343",
  "identifier_other": "etd-102297-10149",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-102297-10149/",
  "identifier_uri": "http://hdl.handle.net/10919/29343",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "chapters_1_20to_205.pdf",
    "front_matter.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Education",
    "Administration",
    "Superintendent",
    "Gender",
    "Women",
    "Female",
    "Leadership"
  ],
  "title": "A Comparative Study of the Numbers, Job Responsibilities, and Preparation of Selected Males and Females as Central Office Administrators in Selected School Districts in Virginia",
  "type": "Dissertation"
}