{
  "contributor_author": "Johnson, Richard Kwesi",
  "contributor_committeechair": "Zink-Sharp, Audrey G.",
  "contributor_committeemember": [
    "Roman, Maren",
    "Frazier, Charles E.",
    "Glasser, Wolfgang G.",
    "Renneckar, Scott H.",
    "Esker, Alan R."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:17:34Z",
  "date_adate": "2010-12-01",
  "date_available": "2014-03-14T20:17:34Z",
  "date_issued": "2010-08-18",
  "date_rdate": "2010-12-01",
  "date_sdate": "2010-10-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The process of TEMPO-mediated oxidation has gained broad usage towards the preparation of highly charged, carboxyl-functionalized polysaccharides.  TEMPO-oxidized nanocelluloses (TONc) of high surface charge and measuring 3 to 5 nm in width have been recently prepared from TEMPO-oxidized pulp.  This study examines as-produced and surface-hydrophobized TONc as reinforcing additives in cellulosic polymer matrices.  In the first part of the work, covalent (amidation) and non-covalent (ionic complexation) coupling were compared as treatment techniques for the hydrophobization of TONc surfaces with octadecylamine (ODA). Subsequently, TONc and its covalently coupled derivative were evaluated as nanofiber reinforcements in a cellulose acetate butyrate (CAB) matrix.  The properties of the resulting nanocomposites were compared with those of similarly prepared ones reinforced with conventional microfibrillated cellulose (MFC). It was found that both ionic complexation and amidation resulted in complete conversion of carboxylate groups on TONc surfaces.  As a result of surface modification, the net crystallinity of TONc was lowered by 15 to 25% but its thermal decomposition properties were not significantly altered.  With respect to nanocomposite performance, the maximum TONc reinforcement of 5 vol % produced negligible changes to the optical transmittance behavior and a 22-fold increase in tensile storage modulus in the glass transition region of CAB.  In contrast, hydrophobized TONc and MFC deteriorated the optical transmittance of CAB by ca 20% and increased its tensile storage modulus in the glass transition region by only 3.5 and 7 times respectively.  These differences in nanocomposite properties were attributed to homogeneous dispersion of TONc compared to aggregation of both the hydrophobized derivative and the MFC reference in CAB matrix.  A related study comparing TONc with MFC and cellulose nanocrystals (CNC) as reinforcements in hydroxypropylcellulose (HPC), showed TONc reinforcements as producing the most significant changes to HPC properties.  The results of dynamic mechanical analysis and creep compliance measurements could be interpreted based on similar arguments as those made for the CAB-based nanocomposites. Overall, this work revealed that the use of TONc (without the need for surface hydrophobization) as additives in cellulosic polymer matrices leads to superior reinforcing capacity and preservation of matrix transparency compared to the use of conventional nanocelluloses.",
  "description_provenance": [
    "Author Email: rijohns6@vt.edu",
    "Advisor Email: maren.roman@vt.edu",
    "Advisor Email: agzink@vt.edu",
    "Advisor Email: cfrazier@vt.edu",
    "Advisor Email: wglasser@vt.edu",
    "Advisor Email: srenneck@vt.edu",
    "Advisor Email: aesker@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:34Z (GMT). No. of bitstreams: 2 Johnson_RK_D_2010.pdf: 7693463 bytes, checksum: 7af9879f15bac3a4e1ad5b59f01b104d (MD5) Johnson_RK_2010_Copyright.pdf: 75367 bytes, checksum: 188804397b8dea2ad0d7b0b59baad271 (MD5)   Previous issue date: 2010-08-18"
  ],
  "handle": "29342",
  "identifier_other": "etd-10222010-182711",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10222010-182711/",
  "identifier_uri": "http://hdl.handle.net/10919/29342",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Johnson_RK_D_2010.pdf",
    "Johnson_RK_2010_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "ionic complexation",
    "amidation",
    "octadecylamine",
    "surface modification",
    "nanocomposite",
    "TEMPO-oxidized",
    "nanocellulose",
    "thermal decomposition"
  ],
  "title": "TEMPO-oxidized Nanocelluloses: Surface Modification and use as Additives in Cellulosic Nanocomposites",
  "type": "Dissertation"
}