{
  "contributor_author": "Tarnoff, Karen Ann",
  "contributor_committeechair": "Madigan, Robert M.",
  "contributor_committeemember": [
    "Murrmann, Kent F.",
    "Connerley, Mary L.",
    "Foti, Roseanne J.",
    "Markham, Steven E."
  ],
  "contributor_department": "Business (Management)",
  "date_accessioned": "2014-03-14T20:17:34Z",
  "date_adate": "1999-10-30",
  "date_available": "2014-03-14T20:17:34Z",
  "date_issued": "1999-09-22",
  "date_rdate": "2000-10-30",
  "date_sdate": "1999-10-22",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p>This research investigated the determinants and outcomes of shared mental models of skill use in autonomous work teams. A model of the determinants and outcomes (team task behaviors) of shared mental models of skill use was tested. Three components of shared mental models of skill use were investigated: shared knowledge pertaining to skill use in task performance (i.e., knowledge about the task, equipment, team, and team interaction), shared expectations for skill use in task performance in both routine and non-routine situations, and shared attitudes relevant to skill use in task performance (i.e., collective orientation and collective efficacy). The model included the interdependence, uncertainty, and complexity of the technology; the degree to which the team is cross-trained and its membership stable; and the level of prior experience team members have had with teamwork as the determinants of overlap in a team's mental model of skill use. The beneficial outcomes of a high degree of overlap in the team's mental model of skill use were four team task behaviors: flexibility, quality, verbal communication, and time required in task planning. The flexibility construct was defined as the degree to which a team allocated and used the multiple competencies/skills of each of its members in pursuit of team goals. A model of the development of flexibility was developed as was a theory of the role of shared mental models in flexible skill use.</p>",
  "description_provenance": [
    "Author Email: tarnoffk@etsu.edu",
    "Advisor Email: murrmann@vt.edu                                   : murrmann@vt.edu",
    "Advisor Email: maryc@vt.edu",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: madigan@vt.edu",
    "Advisor Email: markhami@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:34Z (GMT). No. of bitstreams: 1 ETD.pdf: 335428 bytes, checksum: 5d86576acf7d3478af135f098d15b2f9 (MD5)   Previous issue date: 1999-09-22"
  ],
  "handle": "29345",
  "identifier_other": "etd-102299-133906",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-102299-133906/",
  "identifier_uri": "http://hdl.handle.net/10919/29345",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "skill use",
    "shared mental models",
    "cross-training",
    "autonomous work teams"
  ],
  "title": "An Exploratory Study of the Determinants and Outcomes of Shared Mental Models of Skill Use in Autonomous Work Teams",
  "type": "Dissertation"
}