{
  "contributor_author": "Simon, Stacey Ann",
  "contributor_committeechair": "McDowell, John M.",
  "contributor_committeecochair": "Jelesko, John G.",
  "contributor_committeemember": [
    "Cramer, Carole L.",
    "Winkel, Brenda S. J.",
    "Beers, Eric P."
  ],
  "contributor_department": "Plant Pathology, Physiology, and Weed Science",
  "date_accessioned": "2014-03-14T20:17:37Z",
  "date_adate": "2007-10-29",
  "date_available": "2014-03-14T20:17:37Z",
  "date_issued": "2007-10-12",
  "date_rdate": "2010-10-08",
  "date_sdate": "2007-10-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Plants have evolved multiple surveillance mechanisms to detect the presence of disease-causing organisms.  One mode of surveillance is based on dozens of constitutively expressed resistance (R) genes.  R genes recognize pathogen gene products as signals of invasion.  We are interested in how plants evolve R genes to keep pace with rapidly evolving pathogen populations.  The mechanisms that drive the evolution of new R genes are poorly understood.  There is data that supports the relevance of recombination in the evolution of resistance gene clusters in plants.  However, a more comprehensive understanding of the molecular biology of recombination and the impact recombination has on R gene evolution is necessary.  The objectives of this dissertation were to develop a genetic screen that models meiotic unequal crossing over at a synthetic RPP8 (synthRPP8) resistance gene cluster and to assess the effect of abiotic stress on recombination with the synthetic RBCSB gene cluster (synthRBCSB) in Arabidopsis.  The genetic screen utilized in these studies specifically identifies a novel recombinant gene and a concomitant gene duplication that results from meiotic unequal crossing-over by coupling chimeric gene formation to the activation of the firefly luciferase gene.  Two synthRPP8 clusters were constructed and extensive optimization of screening conditions were performed. An initial screen of ~1 million synthRPP8 transgenic plants was performed and plants that expressed the luc+ phenotype were isolated and analyzed.  Unexpectedly, background bioluminescence was found to interfere with the identification of bona fide luc+ synthRPP8 recombinants.  An abiotic stress response assay was performed and the data suggests activation of a putative stress response element in the promoter of RPP8 is responsible for background levels of in vivo luciferase activity.  The background bioluminescence could not be sufficiently reduced.  Therefore, two additional synthRPP8 constructs, synthRPP8-3 and synthRPP8-4, were constructed and are currently being examined for their utility to model meiotic unequal crossing-over.  UV-C treatment was shown to stimulate somatic unequal crossing over, as well as upregulate defense/stress response genes and transcription factors.  Meiotic recombination may also be affected by stress.  Therefore, the effect of UV-C irradiation on the frequency of unequal meiotic recombination between paralogous RBCSB genes and on the expression of genes associated with the defense/stress response was examined.  We observed a ~2-fold increase in the frequency of meiotic recombination after UV-C irradiation but this increase was not statistically significant.  We did not detect a significant alteration in the steady-state MYB10, PR-1 and HSF-3 mRNA levels by semi-quantitative RT-PCR.  The expression data we gathered provided minimal support for whether the UV-C treatment was an effective DNA damaging agent.",
  "description_provenance": [
    "Author Email: stsimon@dbi.udel.edu",
    "Advisor Email: ccramer@astate.edu",
    "Advisor Email: winkel@vt.edu",
    "Advisor Email: ebeers@vt.edu",
    "Advisor Email: johnmcd@vt.edu",
    "Advisor Email: jelesko@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:37Z (GMT). No. of bitstreams: 2 Dissertation_Front.pdf: 36448 bytes, checksum: 8af44e9bfc658606d5870e7c8c571aba (MD5) Dissertation_Body.pdf: 5128809 bytes, checksum: 51947ee583151c5ce7d61c1b0133e7c2 (MD5)   Previous issue date: 2007-10-12"
  ],
  "handle": "29359",
  "identifier_other": "etd-10242007-134119",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10242007-134119/",
  "identifier_uri": "http://hdl.handle.net/10919/29359",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation_Front.pdf",
    "Dissertation_Body.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Arabidopsis thaliana",
    "Recombination",
    "Resistance",
    "UV-C"
  ],
  "title": "Using Synthetic Gene Clusters to Model Resistance Gene Evolution by Meiotic Recombination in Arabidopsis thaliana",
  "type": "Dissertation"
}