{
  "contributor_author": "Ninnemann, Todd A.",
  "contributor_committeechair": "Ng, Fai",
  "contributor_committeemember": [
    "Schetz, Joseph A.",
    "Dancey, Clinton L.",
    "Nelson, Douglas J.",
    "Diller, Thomas E."
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:17:37Z",
  "date_adate": "2005-10-24",
  "date_available": "2014-03-14T20:17:37Z",
  "date_issued": "1994-09-01",
  "date_rdate": "2012-03-09",
  "date_sdate": "2005-10-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An experimental study to determine the effects of riblets on the performance of the supersonic through-flow fan (STF) cascade blades was performed. The two-dimensional cascade was tested in the Virginia Polytechnic Institute and State University intermittent wind tunnel facility, where the Mach and Reynolds (based on chord) numbers were 2.36 and 4.8 x 106 , respectively. Three different V-grooved riblet heights were tested on the blades: 0.023, 0.033, and 0.051 mm. Riblet testing were conducted at design incidence as well as at off-design conditions (incidence angles: +5, -10 deg). <p> The riblet effect on the performance of the STF blades was determined by measuring the total pressure profile downstream of the cascade and integrating this total pressure to obtain an overall mass-averaged loss coefficient. The riblet loss coefficient was compared with the loss coefficient of a control test case where an equivalent thickness of smooth material is applied to the blades. Results show that, at the design incidence, the 0.033 mm height riblets provided the optimal benefit, with a reduction of 8.5% in the loss coefficient compared to the control case. Smaller effects were measured at the off-design conditions. <p> Shadowgraph pictures were taken to study the effect of riblets on the turbulent transition location on the blades surfaces. At design incidence, the shadowgraphs revealed that the optimum height rib lets delayed the transition location on the suction surface of the blades. Therefore, it was concluded that for the 0.033 mm height riblets the decrease in the cascade's loss coefficient was the result of delayed transition in addition to a decrease in turbulent viscous losses. <p> A numerical simulation was conducted to investigate both rib let effects on the STF blades. The numerical study showed that only the combination of the two riblet effects was able to produce a decrease in loss coefficient that was observed experimentally. Results from the numerical study indicate, that at design incidence, 2/3 of the rib let benefit is attributed to the delayed transition effect on the blades with the other 1/3 resulting from a decrease in turbulent viscous losses.",
  "description_provenance": [
    "Advisor Email: wng@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:37Z (GMT). No. of bitstreams: 1 LD5655.V856_1994.N566.pdf: 6484682 bytes, checksum: b5fe3a3acaa5410cff5910c530709a53 (MD5)   Previous issue date: 1994-09-01"
  ],
  "format_medium": "BTD",
  "handle": "29358",
  "identifier_other": "etd-10242005-174031",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10242005-174031/",
  "identifier_uri": "http://hdl.handle.net/10919/29358",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1994.N566.pdf",
  "subject": "Supersonic aerodynamics",
  "subject_lcc": "LD5655.V856 1994.N566",
  "title": "Effects of riblets on the performance of the supersonic through-flow fan cascade blades",
  "type": "Dissertation"
}