{
  "contributor_author": "Supriya, Lakshmi",
  "contributor_committeechair": "Claus, Richard O.",
  "contributor_committeemember": [
    "Love, Brian J.",
    "Long, Timothy E.",
    "Inman, Daniel J.",
    "Leo, Donald J."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:17:36Z",
  "date_adate": "2005-11-04",
  "date_available": "2014-03-14T20:17:36Z",
  "date_issued": "2005-10-19",
  "date_rdate": "2010-10-13",
  "date_sdate": "2005-10-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This work describes the techniques of assembling colloidal gold on flexible polymeric substrates from solution. The process takes advantage of the strong affinity of gold to thiol and amino groups. Polymeric substrates were modified with silanes having these functional groups prior to Au attachment or in the case of poly(urethane urea) (PUU), no surface functionalization was required. This polymer has terminal amine and N-H groups on the polymer chain, which can act as coordination points for gold. Immersion in the colloidal gold solution led to the formation of a monolayer. Increased coverage was obtained by two methods. The first was a reduction or \"seeding\" process, where Au was reduced onto the attached particles on the surface. The second was using different linker molecules and creating a multilayered film by a layer-by-layer assembly. Three linker molecules of different lengths were used. Films fabricated using the smallest molecule had the least resistance whereas films fabricated with the longest molecule were not conductive. The resistance of these films may be varied easily by heating. Heating the films at temperatures as low as 120 °C caused a dramatic decrease in the resistance of over six orders in magnitude. Successful attachment of gold to PUU with very good adhesion properties was also demonstrated. The attachment of gold was stable in different solvents. Upon stretching the PUU-Au films, it was observed that there is a reversible resistance increase with strain and at a certain strain, the film becomes non-conductive. This sharp transition from conductive to insulating has potential applications in flexible switches and sensors. A hysteresis in the strain-resistance curves, analogous to the hysteresis in the stress-strain curves of the polymer was also observed. Using PUU as an adhesive agent, gold electrodes were successfully assembled on Nafion-based polymer transducers. These materials showed comparable actuation behavior to the electrodes made by the Pt-reduction method, with the added advantage of the ability to form patterned electrodes for distributed transducers. Patterning techniques were developed to form colloid-polymer multilayers for use in photonic crystal materials using selective deposition on patterned silane monolayers. Patterns of gold electrodes were also made on flexible polymers using a photoresist-based method.",
  "description_provenance": [
    "Author Email: lsupriya@vt.edu",
    "Advisor Email: blove@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: dinman@vt.edu",
    "Advisor Email: roclaus@vt.edu",
    "Advisor Email: donleo@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:36Z (GMT). No. of bitstreams: 1 Supriya_Dissertation.pdf: 6054777 bytes, checksum: e3ae2de5791d23832d8a1d527cf8b64e (MD5)   Previous issue date: 2005-10-19"
  ],
  "handle": "29356",
  "identifier_other": "etd-10242005-132045",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10242005-132045/",
  "identifier_uri": "http://hdl.handle.net/10919/29356",
  "publisher": "Virginia Tech",
  "relation_haspart": "Supriya_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "flexible substrates",
    "thin film",
    "solution-based assembly",
    "colloidal gold",
    "conductive"
  ],
  "title": "Assembly of Conductive Colloidal Gold Electrodes on Flexible Polymeric Substrates using Solution-Based Methods",
  "type": "Dissertation"
}