{
  "contributor_author": "Weaver, Robert M",
  "contributor_committeechair": "Hochella, Michael F. Jr.",
  "contributor_committeemember": [
    "Post, Jeffery E.",
    "Gibbs, Gerald V.",
    "Rimstidt, james Donald",
    "Cox, David F."
  ],
  "contributor_department": "Geological Sciences",
  "date_accessioned": "2014-03-14T20:17:38Z",
  "date_adate": "2002-01-04",
  "date_available": "2014-03-14T20:17:38Z",
  "date_issued": "2001-09-19",
  "date_rdate": "2003-01-04",
  "date_sdate": "2001-10-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The interaction between CrIIIaq and seven different Mn-oxides (6 monomineralic, 1 synthetic) have been observed in pH ~4.4 HNO3 and pH ~4.4 ~10-4M CrIIIaq solutions.  For each mineral-solution interaction, the aqueous chemical concentrations (e.g. [Mn]aq, [Cr]aq, [CrVIaq]) were measured with time.  Reacted samples were examined by XPS to determine if, and to what extent, the surface chemical states of Cr, Mn and O had changed.  Microscopic observations of the reacted surfaces were obtained using AFM and high-resolution, low-voltage FESEM. The solubility of the Mn-oxides in the acidic, non-Cr bearing solutions varied inversely with the average Mn valence, but did not show systematic behavior with respect to the mineral structure type (e.g. tunnel, layer, framework).  This trend was interpreted as resulting from the relative ability of an adsorbed proton to polarize surface Mn-O bonds, with the polarizability being in the order Mn2+-O > Mn3+-O > Mn4+-O.  For samples reacted with CrIIIaq, the rate and extent of reductive dissolution was always greater than for acidic dissolution during the initial time period.  The measured ratios of the [Mn]aq : [CrVI]aq were approximately in agreement with the values expected from the proposed stoichiometric reactions.  Cr-uptake was observed to occur in undersaturated solutions as a result of adsorption, absorption and surface catalyzed precipitation.  The chromium as detected by XPS was predominately CrIII, however pyrolusite contained both CrIII and CrVI.  Previous studies have implicated a chromium surface precipitate to be responsible for the cessation of the CrIIIaq oxidation reaction.  Our surface sensitive FESEM and AFM observations tend to suggest that Cr-uptake is by isolated site binding, very small (<30 nm) surface clusters or monolayer scale films.  Cr-uptake was followed by slow Cr-release on several of the solids (particularly the layered solids) after a substantial portion of the total aqueous Cr had been converted to CrVIaq.   The oxidizing ability of the different Mn-oxides for CrIIIaq is evaluated with regards to the energy level of the redox couple (i.e. the redox potential) as compared with the Fermi energy level of the Mn-oxide.  Although these energies were calculated rather than directly measured, the results indicate that electrons originating from adsorbed CrIII ions may be transferred into the conduction band or more likely, into available surface states.  The presence of an initial limited quantity of electron accepting surface states likely explains the observation of a rapid initial CrIII-oxidation followed by much slower oxidation.  The Mn-oxides that exhibited the greatest and longest  lasting CrIII-oxidizing power were the Mn-oxides containing Mn3+, and in particular those containing Mn3+ and Mn2+.  It is believed that the combined presence of a reducible Mn ion (e.g. Mn3+) and a highly soluble Mn2+ ion facilitates a sustained CrIII-oxidation reaction because fresh surface is exposed during the reaction.",
  "description_provenance": [
    "Author Email: rweaver@vt.edu",
    "Advisor Email: Post.Jeffrey@NMNH.SI.EDU",
    "Advisor Email: gvgibbs@vt.edu",
    "Advisor Email: jdr02@vt.edu",
    "Advisor Email: dfcox@vt.edu",
    "Advisor Email: hochella@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:38Z (GMT). No. of bitstreams: 2 Dissertationweaver.pdf: 26559456 bytes, checksum: 9a8d00b3801123dc2f05e0014464433b (MD5) VITAweaver.pdf: 14982 bytes, checksum: dadf12846d51e7a299b429bfb32e5740 (MD5)   Previous issue date: 2001-09-19"
  ],
  "handle": "29365",
  "identifier_other": "etd-10252001-011455",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10252001-011455/",
  "identifier_uri": "http://hdl.handle.net/10919/29365",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertationweaver.pdf",
    "VITAweaver.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "XPS",
    "FESEM",
    "manganese oxide",
    "chromium",
    "reduction",
    "spectroscopy",
    "AFM",
    "oxidation",
    "microscopy"
  ],
  "title": "Comparison of the Reactivity of Various Mn-Oxides With CrIIIaq: Microscopic and Spectroscopic Observations of Dissolution, Cr-sorption and Cr and Mn Redox Interactions",
  "type": "Dissertation"
}