{
  "contributor_author": "Burde, Adrian",
  "contributor_committeechair": "de la Garza, Jesus M.",
  "contributor_committeemember": [
    "Van Aken, Eileen M.",
    "Bonham, Thirwall W.",
    "Vorster, Michael C.",
    "Songer, Anthony D."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:17:37Z",
  "date_adate": "2008-11-13",
  "date_available": "2014-03-14T20:17:37Z",
  "date_issued": "2008-10-20",
  "date_rdate": "2008-11-13",
  "date_sdate": "2008-10-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The concept of involving the public in the development of transportation solutions was built in the Federal-Aid Highway Act of 1956, the legislation that authorized the construction of the Interstate Highway System. Better plans, transparent process, and public support are some of the benefits that road managers can obtain by educating and involving the general public. During the last two decades the volume of research performed related to the topic of customer-driven highway maintenance suggests an increasing level of interest in the field. Most research concentrates on gathering information from road users to assess the performance level of highways. However, public opinion can also be collected for measuring the quality of the service delivered by maintenance units. Assessing product and service delivery performance is important for determining the overall performance of highway maintenance programs. The present study examines the relationship between road users' overall perceptions of the quality of highway maintenance services and the variables that define the highway maintenance service quality domain. The results of the study indicate that two service dimensions, Safety and Reliability, explain about half of the variance in overall perceptions of highway maintenance service quality. The procedures developed for the study provide an initial step for further improvement of the highway maintenance service quality measurement.",
  "description_provenance": [
    "Author Email: burde@vt.edu",
    "Advisor Email: evanaken@vt.edu",
    "Advisor Email: bonham@vt.edu",
    "Advisor Email: chema@vt.edu",
    "Advisor Email: mikev@vt.edu",
    "Advisor Email: adsonger@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:37Z (GMT). No. of bitstreams: 2 Dissertation.pdf: 3939649 bytes, checksum: e74f6e6262aac8b67326784be401235e (MD5) Copyrights.pdf: 606411 bytes, checksum: 23e74ebea8b44cbc4ec88c614fe0d62f (MD5)   Previous issue date: 2008-10-20"
  ],
  "handle": "29363",
  "identifier_other": "etd-10242008-132745",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10242008-132745/",
  "identifier_uri": "http://hdl.handle.net/10919/29363",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation.pdf",
    "Copyrights.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Public Opinion",
    "Service Delivery",
    "Highway Maintenance",
    "Service Quality"
  ],
  "title": "A Study on Road Users' Overall Perceptions of Highway Maintenance Service Quality and the Variables that Define the Highway Maintenance Service Quality Domain",
  "type": "Dissertation"
}