{
  "contributor_author": "Larson, Miriam Bender",
  "contributor_committeechair": "Lockee, Barbara B.",
  "contributor_committeemember": [
    "Burton, John K.",
    "Creamer, Elizabeth G.",
    "Doolittle, Peter E.",
    "Cennamo, Kathy",
    "Potter, Kenneth R."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:38Z",
  "date_adate": "2004-10-29",
  "date_available": "2014-03-14T20:17:38Z",
  "date_issued": "2004-10-11",
  "date_rdate": "2005-10-29",
  "date_sdate": "2004-10-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Instructional Design and Technology (IDT) professionals practice their skills in a broad range of career environments and job roles. Each career environment has lists of competencies and unique knowledge and skill requirements that may or may not be communicated to students, since IDT programs do not typically distinguish themselves as preparing students for specific career environments. Not much has been written concerning how, and how well, IDT programs are preparing students for professional practice in different career or work environments. This study utilized a mixed method approach to carry out a two phase study. In Phase I, current IDT practitioners were surveyed concerning the match between their preparation program and their IDT work experience, and their opinions of exemplary programs for preparing students for their career environment.  Respondents to the survey indicated that they felt somewhat to fully prepared for general instructional design practices, but over 25% felt that their program was not adequate for preparing them for the cultural aspects of their career environment. Survey respondents identified Indiana University (Bloomington) and Florida State University (Tallahassee) as top exemplary programs for preparing graduates for practicing instructional design for a variety of career environments. Phase I results informed Phase II of the research, which consisted of a case study of the Instructional Systems program at Florida State University.  The case study identified the philosophies of educators at an exemplary program, the experiences those philosophies were based on, and specific ways the program instantiated those philosophies. Educators at Florida State use a pragmatic combination of situated methods and strategies that enable students to develop expertise through participation in communities of practice relevant to their career goals. The study concluded that, with respect to career environment preparation, the best approach to IDT preparation is a generalist approach that provides flexibility in coursework selection so that students can obtain coursework and authentic experiences to prepare them for the career environment of their choice.",
  "description_provenance": [
    "Author Email: milarso1@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: creamere@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: cennamo@vt.edu",
    "Advisor Email: kpotter@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:38Z (GMT). No. of bitstreams: 1 DissertationFinal10_04pdf.pdf: 3059184 bytes, checksum: 6772e812e96b255b38dfd7191afb1e1e (MD5)   Previous issue date: 2004-10-11"
  ],
  "handle": "29369",
  "identifier_other": "etd-10252004-171426",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10252004-171426/",
  "identifier_uri": "http://hdl.handle.net/10919/29369",
  "publisher": "Virginia Tech",
  "relation_haspart": "DissertationFinal10_04pdf.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "instructional design and technology",
    "graduate programs",
    "preparation for practice",
    "instructional technology",
    "career environments"
  ],
  "title": "Survey and Case Study Analyses of the Professional Preparation of Instructional Design and Technology (IDT) Graduates for Different Career Environments",
  "type": "Dissertation"
}