{
  "contributor_author": "Oyler, Jennifer D.",
  "contributor_committeechair": "Bonham, Thirwall W.",
  "contributor_committeemember": [
    "smith, Wanda J.",
    "Singh, Kusum",
    "Connerley, Mary L."
  ],
  "contributor_department": "Management",
  "date_accessioned": "2014-03-14T20:17:37Z",
  "date_adate": "2007-12-03",
  "date_available": "2014-03-14T20:17:37Z",
  "date_issued": "2007-10-12",
  "date_rdate": "2007-12-03",
  "date_sdate": "2007-10-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study extends job embeddedness and job satisfaction theory in several notable directions. As hypothesized, structural equation modeling revealed that community embeddedness was a partial mediator of the relationship between core self-evaluations and job satisfaction. Contrary to job embeddedness theory, this study found that organizational embeddedness and job satisfaction were best represented by a single latent factor. Thus, organizational embeddedness did not act as a mediator of the relationship between core self-evaluations and job satisfaction nor did it act as a multiple mediator with community embeddedness. Explanations of these results and new avenues for research are discussed.",
  "description_provenance": [
    "Author Email: joyler@vt.edu",
    "Advisor Email: wjsmith@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: maryc@vt.edu",
    "Advisor Email: bonham@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:37Z (GMT). No. of bitstreams: 1 Oyler,_Jennifer_D__Dissertation_VT_120207.pdf: 990856 bytes, checksum: 47568569c65a216c442d39ce222807d7 (MD5)   Previous issue date: 2007-10-12"
  ],
  "handle": "29360",
  "identifier_other": "etd-10242007-153627",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10242007-153627/",
  "identifier_uri": "http://hdl.handle.net/10919/29360",
  "publisher": "Virginia Tech",
  "relation_haspart": "Oyler,_Jennifer_D__Dissertation_VT_120207.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Job Satisfaction",
    "Job Embeddedness",
    "Core Self-Evaluations"
  ],
  "title": "Core Self-Evaluations and Job Satisfaction: The Role of Organizational and Community Embeddedness.",
  "type": "Dissertation"
}