{
  "contributor_author": "Kunkel, Danylle Ranae",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Lepczyk, Billie F.",
    "Krouscas, James A. Jr.",
    "Stratton, Richard K."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:37Z",
  "date_adate": "2007-11-15",
  "date_available": "2014-03-14T20:17:37Z",
  "date_issued": "2007-10-10",
  "date_rdate": "2007-11-15",
  "date_sdate": "2007-10-24",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to create a profile of the value of work-related competencies according to health educators in institutions of higher education in the state of Virginia.  The health educators were surveyed regarding competencies perceived to be of high importance in their current position.  Additionally, the study examined whether these competencies are addressed on the Certified Health Education Specialist (CHES) exam created by the National Commission for Health Education Credentialing, Inc. (NCHEC).    Data collected did support current literature in regards to importance of competencies.  Regardless of job title or CHES certification status, health educators rank oral communication skills and interpersonal skills as being in the top five â  soft skillsâ   related to career success.   Oral communication and interpersonal skills are among the competencies addressed by the CHES exam.  Interestingly, however, 76%  (n=29) of respondents reported that they were not CHES certified.  This study also examined the relationship between a respondentâ  s job title (health-related, medically-related, or other) and his or her willingness to assist with health education curriculum development and student evaluation. Respondents whose job title directly related to health education were much more likely to be willing to help with curriculum development and student evaluation than those that had the responsibility of disseminating health education but held another type of title.   There is a need for further investigation into the basis for perceptions of dissatisfaction with college graduates by employers in regards to level of preparedness for the workforce.",
  "description_provenance": [
    "Author Email: daglenn@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: lepczyk@vt.edu",
    "Advisor Email: jkrousca@vt.edu",
    "Advisor Email: rstratto@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:37Z (GMT). No. of bitstreams: 3 irbapprovals07082amend1.pdf: 160674 bytes, checksum: ccb7573f7f3dd1c8bdfa2b2e5e9ed9c8 (MD5) initalirbapprovalletter.pdf: 107001 bytes, checksum: c0c976d3c707e53e27e4c70fcb365f0a (MD5) ETDVERSIONKunkel2finalsubmission.pdf: 1365929 bytes, checksum: 0f1d92c8ae4a85d05116ab8ea9940f97 (MD5)   Previous issue date: 2007-10-10"
  ],
  "handle": "29362",
  "identifier_other": "etd-10242007-224204",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10242007-224204/",
  "identifier_uri": "http://hdl.handle.net/10919/29362",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "irbapprovals07082amend1.pdf",
    "initalirbapprovalletter.pdf",
    "ETDVERSIONKunkel2finalsubmission.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "College Graduates",
    "Employability",
    "CHES Exam",
    "Certifications",
    "Health Educators"
  ],
  "title": "Profile of Health Educators in Virginia Institutions of Higher Education: The Value Attached to Work-related Competencies",
  "type": "Dissertation"
}