{
  "contributor_author": "Burnkrant, Steven Richard",
  "contributor_committeechair": "Hauenstein, Neil M. A.",
  "contributor_committeemember": [
    "Foti, Roseanne J.",
    "Harvey, Robert J.",
    "Carlson, Kevin D.",
    "Stephens, Robert S."
  ],
  "contributor_department": "Psychology",
  "date_accessioned": "2014-03-14T20:17:38Z",
  "date_adate": "2003-10-27",
  "date_available": "2014-03-14T20:17:38Z",
  "date_issued": "2003-10-23",
  "date_rdate": "2003-10-27",
  "date_sdate": "2003-10-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Despite the importance of job specifications to much of industrial and organizational psychology, little is known of their reliability or validity. Because job specifications are developed based on input from subject matter experts, interrater agreement is a necessary condition for their validity. The purpose of the present research is to examine the validity of job specifications by assessing the level of agreement in ratings and the effects of occupational tenure, occupational complexity, and the abstractness of rated worker requirements. Based on the existing literature, it was hypothesized that (1) agreement will be worse than acceptable levels, (2) agreement will be higher among those with longer tenure, (3) agreement will be lower in more complex occupations, (4) the effect of occupational tenure will be more pronounced in complex than simple occupations, (5) agreement will be higher on more abstract items, and (6) agreement will be lowest for concrete KSAOs in complex occupations. These hypotheses were tested using ratings from 38,041 incumbents in 61 diverse occupations in the Federal government. Consistent with Hypothesis 1, agreement failed to reach acceptable levels in nearly every case, whether measured with the awg or various forms of the rwg agreement indices. However, tenure, occupational complexity, and item abstractness had little effect on ratings, whether agreement was measured with rwg or awg. The most likely explanation for these null findings is that the disagreement reflected a coarse classification system that overshadowed the effects of tenure, complexity, and abstractness. The existence of meaningful subgroups within a single title threatens the content validity of job specifications: the extent to which they include all relevant and predictive KSAOs. Future research must focus on the existence of such subgroups, their consequences, and ways of identifying them.",
  "description_degree": "PhD",
  "description_provenance": [
    "Author Email: srburnkr@opm.gov",
    "Advisor Email: rfoti@vt.edu",
    "Advisor Email: nhauen@vt.edu",
    "Advisor Email: harveyrj@vt.edu",
    "Advisor Email: kevinc@vt.edu",
    "Advisor Email: stephens@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:38Z (GMT). No. of bitstreams: 1 Burnkrant.pdf: 670929 bytes, checksum: 4f756855f9cea2d9b32d13e382a0dab5 (MD5)   Previous issue date: 2003-10-23"
  ],
  "handle": "29368",
  "identifier_other": "etd-10252003-132129",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10252003-132129/",
  "identifier_uri": "http://hdl.handle.net/10919/29368",
  "publisher": "Virginia Tech",
  "relation_haspart": "Burnkrant.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Job specification",
    "Competency",
    "Validity",
    "KSAO",
    "Job analysis",
    "Interrater agreement"
  ],
  "title": "Interrater Agreement of Incumbent Job Specification Importance Ratings: Rater, Occupation, and Item Effects",
  "type": "Dissertation"
}