{
  "contributor_author": "McKee, Matthew Gary",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeecochair": "Wilkes, Garth L.",
  "contributor_committeemember": [
    "McGrath, James E.",
    "Baird, Donald G.",
    "Davis, Richey M."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:17:39Z",
  "date_adate": "2005-11-14",
  "date_available": "2014-03-14T20:17:39Z",
  "date_issued": "2005-10-04",
  "date_rdate": "2005-11-14",
  "date_sdate": "2005-10-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The implications of chain topology and intermolecular interactions on the electrospinning process were investigated for linear and randomly branched polymers.  Empirical correlations were developed based on solution rheological measurements that predict the onset of electrospun fiber formation and average fiber diameter.  In particular, for neutral, non-associating polymer solutions, the minimum concentration required for fiber formation was the entanglement concentration (Ce), and uniform, bead-free fibers were formed at 2 to 2.5 Ce.  This was attributed to entanglement couplings stabilizing the electrospinning jet and preventing the Raleigh instability.  Moreover, the influence of molar mass and degree of branching on electrospun fiber diameter was eliminated when the polymer concentration was normalized with Ce, and the fiber diameter universally scaled with C/Ce to the 2.7 power. \tPolymers modified with quadruple hydrogen bonding groups were investigated to determine the role of intermolecular interactions on the solution rheological behavior and the electrospinning process.  In nonpolar solvents, the hydrogen bonding functionalized polymers displayed significant deviation from the electrospinning behavior for neutral solutions due to the strong intermolecular associations of the multiple hydrogen bonding groups.  The predicted electrospinning behavior was recovered when the hydrogen bonding interactions were screened with a polar solvent.  Moreover, it was observed that branching and multiple hydrogen bonding afforded significant processing advantages compared to functionalized, linear analogs of equal molar mass.  For example, branched chains in the unassociated state possessed a larger Ce compared to the linear chains, which indicated a lower entanglement density of the former.  However, in the associated state the linear and branched chains possessed nearly equivalent Ce values, suggesting a similar entanglement density.  Thus, the branched polymers displayed significantly lower viscosities in the unassociated state compared to linear polymers, while still retaining sufficient entanglements in the associated state due to the reversible network structure of the multiple hydrogen bond sites. The solution rheological and processing behavior of polyelectrolyte solutions was also investigated to discern the role of electrostatic interactions on electrospun fiber formation.  In particular, the polyelectrolyte solutions formed nano-scale electrospun fibers with an average fiber diameter 2 to 3 orders of magnitude smaller than neutral polymer solutions of equivalent viscosity and C/Ce.  This was attributed to the very high electrical conductivity of the polyelectrolyte solutions, which imparted a high degree of charge repulsion in the electrospinning jet and increased the extent of plastic stretching in the polymer filament.  In fact, the average diameter of the polyelectrolyte fibers under certain conditions was less than 100 nm, which makes them good candidates for protective clothing applications due to their high specific surface area. Moreover, the neutral polymer solution electrospinning behavior was recovered after the addition of NaCl, which screened the electrostatic charge repulsions along the polyelectrolyte main chain.  Finally, electrospun, biocompatible phospholipid membranes were produced from solutions of entangled worm-like lecithin micelles.  This is the first example of successfully electrospinning low molar mass, amphiphilic compounds into uniform fibers.  Electrospinning the phospholipid worm-like micelles into nonwoven fibrous mats will afford direct engineering of bio-functional, high surface area membranes without the use of multiple synthetic steps, complicated electrospinning setups, or post processing surface treatments.",
  "description_provenance": [
    "Author Email: mmckee@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: dbaird@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:39Z (GMT). No. of bitstreams: 1 McKeedissertation.pdf: 5328276 bytes, checksum: 6dcc62b10ddae9d4f569913ed2ca75e6 (MD5)   Previous issue date: 2005-10-04"
  ],
  "handle": "29370",
  "identifier_other": "etd-10252005-103247",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10252005-103247/",
  "identifier_uri": "http://hdl.handle.net/10919/29370",
  "publisher": "Virginia Tech",
  "relation_haspart": "McKeedissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Solution Rheology",
    "Polyelectrolytes",
    "Electrospinning",
    "Branching",
    "Multiple hydrogen bonding",
    "Entanglements"
  ],
  "title": "The Influence of Branching and Intermolecular Interactions on the Formation of Electrospun Fibers",
  "type": "Dissertation"
}