{
  "contributor_author": "Mahapatra, Sailendra Nath",
  "contributor_committeechair": "Imhof, Matthias G.",
  "contributor_committeemember": [
    "Chapman, Martin C.",
    "Eriksson, Kenneth A.",
    "Castle, James W."
  ],
  "contributor_department": "Geosciences",
  "date_accessioned": "2014-03-14T20:17:41Z",
  "date_adate": "2005-12-12",
  "date_available": "2014-03-14T20:17:41Z",
  "date_issued": "2005-08-12",
  "date_rdate": "2005-12-12",
  "date_sdate": "2005-10-26",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The research focuses on analysis and subsurface imaging of siliciclastics rocks on steam-affected 3D poststack seismic data, merged from different vintages, from the Temblor Formation in the Coalinga heavy oil reservoir in the San Joaquin basin, California. The objective was identification, delineation, and demarcation of reservoir heterogeneities by seismostratigraphic and seismogeomorphic analysis.<p>      The proximity of the San Andreas Transforms greatly controlled basin evolution and caused substantial reservoir heterogeneity by changing the depositional environment from shallow marine to near-shore fluvial. Moreover, two unconformities dissect the reservoir interval.<p>      The seismic dataset exhibits erratic, distorted reflection strengths and amplitudes caused by steam-injection-aided production. A petrophysical analysis based on Gassmann fluid substitution suggests a 27% P-wave velocity decrease in steam-saturated intervals. Seismic to well log ties were problematic and vexing due to the resulting statics, wavelet changes, and line mismatches. Mapping and flattening on a deeper horizon, however, allowed mapping of the internal unconformities and well ties which were crucial for seismostratigraphic sequence identification.<p>      Visualization of seismic attributes brought out stratification patterns and two distinct, laterally and vertically extensive, porous, and interconnected facies tracts interpreted as incised valley fills and tidal-to-subtidal deposits as evidenced by bright, steam related amplitudes.<p>      Seismic attribute analysis, Geobody Visualization and Interpretation, and structure and isochron maps brought out two prominent channel-systems, recut and restacked in the central part of the area. These deposits were identified on seismic data and correlated to high-gamma coarsening-upward sands on logs and cores. The deeper one, shifting towards SSE with depth, lies between the Base Temblor and Buttonbed unconformities both in the southwestern and northwestern parts of the study area and is scattered in the western-central portion. The shallower one originates in southwestern corner below the Top Temblor unconformity shifts towards ESE-SE with depth, and runs nearly parallel to the Top Temblor unconformity. It cuts across the Valv unconformity in central part creating a channel incision, and follows the Buttonbed unconformity towards the north.<p>      The investigation segmented the reservoir into channels, non-channel bearing, and unconformity-bounded subunits which will allow the operator to improve steam injection and optimize placement of oil producing infill wells.",
  "description_provenance": [
    "Author Email: sailendra@vt.edu",
    "Advisor Email: mcc@vt.edu",
    "Advisor Email: kaeson@vt.edu",
    "Advisor Email: jim.castle@ces.clemson.edu",
    "Advisor Email: mgi@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:41Z (GMT). No. of bitstreams: 1 Sailendra_Final_ETD.pdf: 28325401 bytes, checksum: 654a0711d2974b4b9e6fdaba55537b59 (MD5)   Previous issue date: 2005-08-12"
  ],
  "handle": "29377",
  "identifier_other": "etd-10262005-053324",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10262005-053324/",
  "identifier_uri": "http://hdl.handle.net/10919/29377",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sailendra_Final_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Seismic attribute and geovolume visualization",
    "Steam-affected merged 3D poststack seismic",
    "Seismostratigraphic and Seismogeomorphic analysi",
    "Monarch sands of Monterey Formation",
    "Stacked high-gamma coarsening upward sands",
    "San Joaquin basin and San Andreas Transforms"
  ],
  "title": "Determination of Heterogeneity by High-Resolution Seismic Reservoir Characterization in the Heavy Oil Temblor Reservoir of Coalinga Field, California",
  "type": "Dissertation"
}