{
  "contributor_author": "Hong, Jae  Hee",
  "contributor_committeechair": "Duncan, Susan E.",
  "contributor_committeemember": [
    "Mallikarjunan, Parameswarakumar",
    "Dietrich, Andrea M.",
    "Eigel, William N. III",
    "O'Keefe, Sean F."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:17:39Z",
  "date_adate": "2006-11-22",
  "date_available": "2014-03-14T20:17:39Z",
  "date_issued": "2006-10-11",
  "date_rdate": "2008-11-22",
  "date_sdate": "2006-10-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Copper in drinking water elicits a persisting bitter, metallic, or astringent taste.   Characteristics and perception mechanisms of copper sensation have not been fully understood.   Saliva is assumed to influence copper sensations via binding of salivary electrolytes or proteins with copper.  The interaction between salivary components and copper is thought to influence sensory perception by affecting volatility of aroma compounds, de-lubricating salivary proteins, and by controlling solubility of copper.   A recent study suggested that intensity of copper taste may be dependent on the amount of solubilized copper, which increases at lower pH.   This research was performed to identify 1) the temporal sensory characteristics of copper; 2) the effect of pH on perception of copper sensation; 3) the nature of copper-protein interaction and its impact on sensory perception.  The effect of copper on the volatility of aroma compounds and the role of copper-protein interaction in volatile chemistry were investigated using a model mouth system containing artificial saliva at different pH levels.  Headspace concentration of each volatile was measured using SPME-GC analysis.   Copper (2.5 mg/L) in the model system increased headspace concentration of volatiles (hexanal, butyl acetate, 2-heptanone, and ethyl hexanoate, 0.5 microL/L each) at pH 6.5, but no change in volatility was observed at pH 7.0.   At pH 7.5, presence of copper in the artificial saliva decreased headspace volatile concentration.  Effect of copper on volatiles at pH 6.5 may be due to increased solubility of copper at lower pH.   Copper seems to facilitate hydrophobic binding between mucin and aroma compounds at pH 7.5, possibly by exposing hydrophobic sites of mucin.    A time-intensity (TI) test was performed to identify the effect of pH on temporal characteristics of copper sensation.   Metallic taste, bitterness, and astringency were major attributes of drinking water containing 2.5 mg/L and 5 mg/L Cu.   All three attributes were responsible for the lingering aftertaste of copper.   TI test results of copper solutions did not show a common TI pattern of astringency that is characterized with slow onset and longer duration time.   Increase in pH of water from 5.5 to 7.5 inhibited metallic taste of copper, but did not reduce bitterness and astringency.      The level of soluble copper at pH 7.5 decreased by 50 % compared to that at pH 5.5.  Soluble copper concentration and temporal profile of sensory attributes of copper solutions at different pH levels suggest that soluble copper species decide the perception of copper sensation by controlling metallic taste.  The nature of copper-protein interaction and its implication on mechanisms of sensory perception were studied by investigating binding of copper to high molecular weight fractions of human saliva.   At the copper concentration < 10 mg/L, most copper exists as unbound copper form while about 60 % of copper was found in protein fractions or with precipitated salivary debris.   This result suggests that copper is in a soluble unbound form in saliva at low concentration (<10 mg/L) and assumed to be available for taste receptors.  At higher concentration, copper either becomes insoluble or binds with proteins.   Insoluble copper species are thought to cause astringency.  When copper was added at the concentration equal to or greater than 10 mg/L, two salivary proteins of molecular weight 29 kDa and 33 kDa formed insoluble complexes with copper.   Low molecular weight mucin (MG2), alpha-amylase, basic proline-rich proteins (PRPs), and a protein of MW 45 kDa also bound with copper.  In summary, sensations elicited or influenced by copper are thought to be determined by what copper species are dominant in the mouth.   Soluble copper species and insoluble copper species are assumed to interact with different sensory receptors, resulting in metallic taste or astringency.   This speciation process is influenced by pH conditions, composition of other electrolytes, and organic chelators such as proteins.",
  "description_provenance": [
    "Author Email: jhhong@vt.edu",
    "Advisor Email: duncans@vt.edu",
    "Advisor Email: kumar@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Advisor Email: weigel@vt.edu",
    "Advisor Email: okeefes@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:39Z (GMT). No. of bitstreams: 1 jaehee_hong_dissertation.pdf: 2325937 bytes, checksum: b3ac45a301e48156358c14a437533d86 (MD5)   Previous issue date: 2006-10-11"
  ],
  "handle": "29371",
  "identifier_other": "etd-10252006-221418",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10252006-221418/",
  "identifier_uri": "http://hdl.handle.net/10919/29371",
  "publisher": "Virginia Tech",
  "relation_haspart": "jaehee_hong_dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "sensory perception",
    "proteins",
    "HPLC",
    "time-intensity test",
    "saliva",
    "SDS-PAGE",
    "copper",
    "SPME",
    "ultrafiltration",
    "metallic taste"
  ],
  "title": "Formation of Copper-Salivary Component Complexes and Its Effect on Sensory Perception",
  "type": "Dissertation"
}