{
  "contributor_author": "Bowdridge, Scott Alexander",
  "contributor_committeechair": "Notter, David R.",
  "contributor_committeemember": [
    "Zajac, Anne M.",
    "Greiner, Scott P.",
    "Dalloul, Rami A.",
    "Mullarky, Isis K."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:17:39Z",
  "date_adate": "2009-11-20",
  "date_available": "2014-03-14T20:17:39Z",
  "date_issued": "2009-10-12",
  "date_rdate": "2012-05-08",
  "date_sdate": "2009-10-25",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation compares immune responses of resistant and susceptible sheep to infection with Haemonchus contortus during the peri-parturient period and larval stage of infection.  Identification of immunological events resulting in parasite resistance in St. Croix hair sheep may provide better targets for differential gene expression analysis and eventual discovery of selectable markers for parasite resistance.  Antibody levels of hair ewes and composite Dorset x Finnsheep-Rambouillet wool ewes were measured during breeding and again after parturition.  Results demonstrated that hair ewes had higher levels immunoglobulin-A after infection and maintained a higher level of circulating antigen-specific antibody when compared to wool ewes.  To characterize immune responses to the larval stage of infection, hair and wool lambs were sacrificed at 0, 3, 5, and 7 d after infection with H. contortus.  Neutrophil migration to abomasal mucosa and lymph node development were higher in hair sheep than in wool sheep.  Gene expression analysis indicated no difference in the abomasal lymph node as both breeds expressed a general T-helper cell type 2 (TH2) response.  However, profound differences in TH2 responses were observed in the abomasal mucosa, where hair sheep expressed more IL-4, -13 and -33 than wool sheep.  These data thus document the presence of immunological differences between the breeds.  Immune responses to larval parasite infection in wool sheep are generally suppressed and may increase the magnitude and duration of infection whereas immune responses to larval infection in hair sheep was more robust and more strongly polarized towards a TH2",
  "description_provenance": [
    "Author Email: sabowdri@vt.edu",
    "Advisor Email: drnotter@vt.edu",
    "Advisor Email: zajac@vt.edu",
    "Advisor Email: sgreiner@vt.edu",
    "Advisor Email: rdalloul@vt.edu",
    "Advisor Email: mullarky@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:39Z (GMT). No. of bitstreams: 1 Bowdridge_SA_D_2009.pdf: 1007398 bytes, checksum: 089e4c8e47d9a1c5ecc094c1288c8fda (MD5)   Previous issue date: 2009-10-12"
  ],
  "handle": "29372",
  "identifier_other": "etd-10252009-072131",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10252009-072131/",
  "identifier_uri": "http://hdl.handle.net/10919/29372",
  "publisher": "Virginia Tech",
  "relation_haspart": "Bowdridge_SA_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "gene expression",
    "immune response",
    "larval infection",
    "Hair sheep"
  ],
  "title": "Characterizing physiological and genetic differences in the early immune response to Haemonchus contortus in resistant and susceptible sheep",
  "type": "Dissertation"
}