{
  "contributor_author": "Tacla, Craig",
  "contributor_committeechair": "Redican, Kerry J.",
  "contributor_committeemember": [
    "Stratton, Richard K.",
    "Lepczyk, Billie F.",
    "Lockee, Barbara B.",
    "Hutchinson, Gayle"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:42Z",
  "date_adate": "2004-11-04",
  "date_available": "2014-03-14T20:17:42Z",
  "date_issued": "2004-10-11",
  "date_rdate": "2007-11-04",
  "date_sdate": "2004-10-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine the use of audio computer conferences on the process of guiding reflection among student teachers during an eight-week student teaching experience. After specific lessons that took place during the final eight weeks of their student teaching placement, each of the two student teachers conferenced with their university supervisor via the audio computer conferencing tool. The student teacher's comments were digitally recorded and analyzed. The Reflective Framework for Teaching in Physical Education (Tsangaridou & O'Sullivan, 1994) was used to describe the focus of the student teachers reflection. Both student teachers and the university supervisor then completed a follow-up interview with the researcher. Data collected through the follow-up interviews were analyzed using inductive thematic content analysis techniques. Content analysis provided insights into student teachers' and the university supervisor's views regarding the value of audio computer conferences in guiding reflection during an eight-week student teaching experience.",
  "description_provenance": [
    "Author Email: ctacla@csub.edu",
    "Advisor Email: rstratto@vt.edu",
    "Advisor Email: blepczyk@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: ghutchinson@csuchico.edu",
    "Advisor Email: kredican@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:42Z (GMT). No. of bitstreams: 1 dissertation.pdf: 414027 bytes, checksum: da1827650e16ca7550ef2b461586638b (MD5)   Previous issue date: 2004-10-11"
  ],
  "handle": "29384",
  "identifier_other": "etd-10272004-182449",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10272004-182449/",
  "identifier_uri": "http://hdl.handle.net/10919/29384",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "student teaching",
    "audio computer conferences",
    "physical education"
  ],
  "title": "Insights Into the Process of Guiding Student Teachers Reflection Using Audio Computer Conferences During an Eight-Week Student Teaching Experience",
  "type": "Dissertation"
}