{
  "contributor_author": "Whitehead, Phyllis Brown",
  "contributor_committeechair": "Kerry Redican",
  "contributor_committeemember": [
    "Eileen Anderson",
    "Ferrell, Betty",
    "Richard Stratton"
  ],
  "contributor_department": "Health Promotion",
  "date_accessioned": "2014-03-14T20:17:43Z",
  "date_adate": "2009-11-20",
  "date_available": "2014-03-14T20:17:43Z",
  "date_issued": "2009-10-20",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-10-27",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this quasi-experimental study was to assess the ongoing impact of the End-of-Life Nursing Education Consortium (ELNEC) training program on registered nursesâ   death anxiety, concerns about dying, and knowledge of the dying process utilizing the principles of The Comfort Theory and Practice by Kolcaba (2003) at the institutional level. The research hypothesis was upon completion of the ELNEC training, registered nurses would have decreased death anxiety, less concerns about dying, and increased knowledge of the dying process. The Revised Death Anxiety Scale (RDAS) was used to measure death anxiety which is a 25 item self-report questionnaire. The Concerns about Dying Instrument (CAD) was used to measure death attitude or concerns about dying which includes three distinct but related areas for providers: general concern about death, spirituality, and concerns about working with dying patients. Participantâ  s perceived knowledge of dying was measured using a self report 5-point Likert format with â  0â   indicating no level of knowledge to â  4â   reflecting complete knowledge of death and dying. <p>   Pre-tests of all dependent variables were administered to both a treatment and control group. Post-tests were administered two weeks after the two day ELNEC training, at 6 months, and finally at 12 months to both groups in order to study its lasting efficiency upon participants at one primary care medical center. Thirty eight participants completed all four questionnaires with 27 participants in the control group and 11 participants in the experimental group. Matched pair analysis with 11 participants in each group was conducted with statistical significance found for perceived knowledge about dying at post two weeks and 12 months (p= 0.01) for the intervention group. Death anxiety and concerns about dying were not found to be statistically significant at any testing interval, but mean scores of the treatment group revealed less death anxiety and concerns about dying.  <p> Recommendations included offering the ELNEC training on a routine basis to all registered nurses who care for dying patients. Additionally, clinicians and administrators were encouraged to seek out additional funding opportunities to plan more robust studies with larger samples, incentives, and research method triangulation addressing the qualitative aspects of palliative care.",
  "description_provenance": [
    "Author Email: pwhitehead@carilion.com",
    "Advisor Email: eileen@vt.edu",
    "Advisor Email: kredican@vt.edu",
    "Advisor Email: bferrell@coh.org",
    "Advisor Email: rstratto@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:43Z (GMT). No. of bitstreams: 1 Whitehead_PB_D_2009.pdf: 317143 bytes, checksum: f1ad646c8045ef524af29a9717238804 (MD5)   Previous issue date: 2009-10-20"
  ],
  "handle": "29388",
  "identifier_other": "etd-10272009-143643",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10272009-143643/",
  "identifier_uri": "http://hdl.handle.net/10919/29388",
  "publisher": "Virginia Tech",
  "relation_haspart": "Whitehead_PB_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "End-of-Life Nursing Education Consortium",
    "ELNEC",
    "end of life"
  ],
  "title": "Studying the Effects of the End-of-Life Nursing Education Consortium",
  "type": "Dissertation"
}