{
  "contributor_author": "Lau, Clara Sueling",
  "contributor_committeecochair": [
    "Duncan, Susan E.",
    "Nickols-Richardson, Sharon M."
  ],
  "contributor_committeemember": [
    "Serrano, Elena L.",
    "Hosig, Kathryn Wright"
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:17:46Z",
  "date_adate": "2007-11-29",
  "date_available": "2014-03-14T20:17:46Z",
  "date_issued": "2007-10-15",
  "date_rdate": "2007-11-29",
  "date_sdate": "2007-10-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> An increased interest in functional beverages is occurring, and omega-3 fatty acids (FA) are one of the most commonly sought ingredients to fortify such beverages.  Omega-3 FA produce beneficial health effects, likely due to their anti-inflammatory properties.  The majority of current omega-3 FA-fortified products include marine-derived omega-3 FA sources, often producing undesired flavors due to lipid oxidation.  Little research regarding incorporation of alpha-linolenic acid in functional beverage formulation has been conducted.  Alpha-linolenic acid is less susceptible to oxidation and may be a candidate to deliver omega-3 FA into the diet via functional products.  </p><p> Flaxseed is the richest plant source for alpha-linolenic acid; consumption may increase omega-3 FA intake and lower the omega-6:omega3 FA ratio, thereby, attenuating inflammation.  Finely ground flaxseed was, therefore, incorporated into a chocolate milk foundation (â  flaxmilkâ  ) to increase dietary omega-3 FA.  An untrained consumer panel tasted and rated flaxmilkâ  s palatability using a 9-point hedonic scale.  A score of â  6.0â   (â  like slightlyâ  ) was targeted.  A mean hedonic score of 6.35 was achieved, surpassing the targeted score and indicating an acceptable product.</p><p> Sensory and analytical analyses of flaxmilk were conducted and compared to standard chocolate milk.  Flaxmilk was significantly different in most physical, chemical and sensory characteristics compared to chocolate milk.   A reduction in the omega-6:omega-3 FA ratio may attenuate inflammation; inflammation has been linked to osteoporosis.  Thus, a secondary analysis of data collected from 202 women was conducted to estimate the dietary omega-6:omega-3 FA ratio and examine relationships between the omega-6:omega-3 FA ratio and total body and site-specific bone mineral density (BMD).  The omega-6:omega-3 FA ratio had no appreciable association with any measure of BMD in the overall sample of women or in younger or older subsamples of women.   </p><p> In summary, consumers found flaxmilk to be an acceptable product, despite sensory and compositional differences compared to chocolate milk.  The relationship between the omega-6:omega-3 FA ratio and BMD remains unclear.</p>",
  "description_provenance": [
    "Author Email: clara@vt.edu",
    "Advisor Email: serrano@vt.edu",
    "Advisor Email: khosig@vt.edu",
    "Advisor Email: duncans@vt.edu",
    "Advisor Email: smn13@psu.edu",
    "Made available in DSpace on 2014-03-14T20:17:46Z (GMT). No. of bitstreams: 1 Clara_Lau-dissertation.pdf: 3206825 bytes, checksum: d3d17c54c78c92da0eb041e64e70a48a (MD5)   Previous issue date: 2007-10-15"
  ],
  "handle": "29396",
  "identifier_other": "etd-10292007-105424",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10292007-105424/",
  "identifier_uri": "http://hdl.handle.net/10919/29396",
  "publisher": "Virginia Tech",
  "relation_haspart": "Clara_Lau-dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "inflammatory diseases",
    "flaxseed",
    "product development",
    "sensory evaluation",
    "product analysis",
    "functional foods"
  ],
  "title": "Formulation and Physical, Chemical and Sensory Analysis of a Novel Flaxseed-enriched Milk-based Beverage to Deliver Omega-3 Fatty Acids",
  "type": "Dissertation"
}