{
  "contributor_author": "Lomenzo, Richard  Allan Jr.",
  "contributor_committeechair": "Wicks, Alfred L.",
  "contributor_committeemember": [
    "Robertshaw, Harry H.",
    "Kirk, R. Gordon",
    "Barker, Andy",
    "Lopez-Dominguez, Jose Carlos"
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:17:46Z",
  "date_adate": "1998-11-12",
  "date_available": "2014-03-14T20:17:46Z",
  "date_issued": "1998-10-16",
  "date_rdate": "1999-11-12",
  "date_sdate": "1998-10-16",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The application of laser Doppler vibrometry to high speed rotating structures has been hampered by technical limitations. Whereas full-field three-dimensional velocity measurements can be made on stationary structures, the capability on rotating structures is limited to low speed, one-dimensional, steady state operation.  This work describes the implementation of a self-tracking laser vibrometry system which overcomes many of the limitations of current techniques for vibration measurements on rotating structures.  A model of the self-tracker is developed and used to predict the effects of static misalignments on the position and velocity errors.  These predictions are supported by experimental results and simplified models of the self-tracker.   NOTE: (02/2011) An updated copy of this ETD was added after there were patron reports of problems with the file.",
  "description_provenance": [
    "Author Email: lomenzor@snoopy.me.vt.edu",
    "Advisor Email: awicks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:46Z (GMT). No. of bitstreams: 2 lomenzoetd.pdf: 2725329 bytes, checksum: fe53b3f1a13e38ecac1295ec1ec6e29d (MD5) lomenzoetd_2011.pdf: 4111426 bytes, checksum: d21ec159bdabfde48fd851cc36273786 (MD5)   Previous issue date: 1998-10-16"
  ],
  "handle": "29398",
  "identifier_other": "etd-10298-151423",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10298-151423/",
  "identifier_uri": "http://hdl.handle.net/10919/29398",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "lomenzoetd.pdf",
    "lomenzoetd_2011.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "bladed disks",
    "laser vibrometry",
    "vibration measurement",
    "turbomachinery"
  ],
  "title": "Static Misalignment Effects is a Self-Tracking Laser Vibrometry System for Rotating Bladed Disks",
  "type": "Dissertation"
}