{
  "contributor_author": "Williams, Sharlene Renee",
  "contributor_committeechair": "Long, Timothy E.",
  "contributor_committeemember": [
    "Roman, Maren",
    "Turner, S. Richard",
    "Ward, Thomas C.",
    "Duncan, Susan E."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:17:46Z",
  "date_adate": "2008-11-19",
  "date_available": "2014-03-14T20:17:46Z",
  "date_issued": "2008-10-21",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-10-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Current research efforts have focused on the synthesis of novel, segmented, cross-linked networks and thermoplastics for emerging technologies.  Tailoring macromolecular structures for improved mechanical performance can be accomplished through a variety of synthetic strategies using step-growth polymerization.  The synthesis and characterization of novel Michael addition networks, ionene families, and ion-containing polyurethanes are described, with the underlying theme of fundamentally investigating the structure-property relationships of novel, segmented macromolecular architectures.  In addition, it was discovered that both covalent and electrostatic crosslinking play an important role in the mechanical properties of all types of polymers described herein.<p>  Novel cross-linked networks were synthesized using quantitative base-catalyzed Michael chemistry with acetoacetate and acrylate functionalities.  These novel synthetic strategies offer unique thermo-mechanical performance due to the formation of a multiphase morphology.  In order to fundamentally elucidate the factors that influence the kinetics of the Michael addition reaction a detailed analyses of model compounds were conducted in the presence of an in-situ IR spectrometer to optimize reaction conditions using statistical design of experiments.  Networks were then prepared based on these optimized conditions.  The mechanical performance was evaluated as a function of molecular weight between crosslink points.  Furthermore, the incorporation of hydrogen bonding within the monomer structure enhanced mechanical performance.  The changes in morphological, thermal, and mechanical properties evaluated using dynamic mechanical analysis (DMA) and tensile behavior are described.  In addition, the use of preformed urethane segments provides a safer method for incorporating hydrogen bonding functional groups into macromolecules.<p>  In order to compare the thermomechanical and morphological properties of ion-containing polyurethanes to non-charged polyurethanes, poly(tetramethylene oxide)-based polyurethanes containing either a novel phosphonium diol or 1,4-butanediol chain extenders were prepared using a prepolymer method.  The novel phosphonium polyurethane was more crystalline, and it was presumed that hydrogen bonding in the non-charged polyurethane restricted polymer mobility, and reduced PTMO crystallinity, and hydrogen bonding interactions were significantly reduced due to the presence of phosphonium cations.  These results correlated well with mechanical property analysis.  The phase separation and ionic aggregation were demonstrated via wide-angle X-ray scattering, small-angle X-ray scattering, scanning transmission electron microscopy, and  energy-dispersive X-ray spectroscopy during STEM imaging, as described herein.  In addition, a novel polyurethane containing imidazolium cations in the hard segment was synthesized and behaved very similarly to the phosphonium cation-containing polyurethane.  <p>  Ammonium ionenes, which contain quaternary nitrogen in the macromolecular repeating unit, have many potential uses in biomedical applications.  They offer interesting coulombic properties, and the charge density is easily controlled through synthetic design.  This property makes ionenes ideal polyelectrolyte models to investigate the influence of ionic aggregation on many physical properties.  Ammonium ionenes were prepared via the Menshutkin reaction from 1,12-dibromododecane and 1,12-bis(N,N-dimethylamino)dodecane.  The absolute molecular weights were determined for the first time using an on-line multi-angle laser light scattering (MALLS) in aqueous size exclusion chromatography (SEC).  Tensile testing and DMA were used to establish structure-property relationships between molecular weight and mechanical properties for a series of 12,12-ammonium ionenes.  Furthermore, degradation studies in the presence of base support the possibility for water-soluble coatings with excellent mechanical durability that are amenable to triggered depolymerization.  A novel synthetic strategy was utilized to prepare chain extended 12,12-ammonium ionenes containing cinnamate functional groups.  In the presence of UV light, the polymers chain extended, and the resulting ionenes possessed enhanced thermomechanical properties and increased molecular weight.  In addition, the novel synthesis of imidazolium ionenes was demonstrated, and the charge density was tuned for appropriate applications using either low molecular weight segments or oligomeric precursors.  The change in charge density had a profound role in imidazolium ionene thermal and mechanical behavior.",
  "description_provenance": [
    "Author Email: hopkinsr@vt.edu",
    "Advisor Email: maren.roman@vt.edu",
    "Advisor Email: srturner@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: duncans@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:46Z (GMT). No. of bitstreams: 1 Sharlene_Williams_Dissertation3.pdf: 10796521 bytes, checksum: e5e2163e030e2fb528d015941601189a (MD5)   Previous issue date: 2008-10-21"
  ],
  "handle": "29397",
  "identifier_other": "etd-10292008-101359",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10292008-101359/",
  "identifier_uri": "http://hdl.handle.net/10919/29397",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sharlene_Williams_Dissertation3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Michael Addition",
    "Electrostatic Interactions",
    "Hydrogen bonding",
    "Ionene",
    "Thermomechanical Behavior",
    "Polyurethane"
  ],
  "title": "Influence of Electrostatic Interactions and Hydrogen Bonding on the Thermal and Mechanical Properties of Step-Growth Polymers",
  "type": "Dissertation"
}