{
  "contributor_author": "Pyc, Wioleta Agata",
  "contributor_committeechair": "Weyers, Richard E.",
  "contributor_committeemember": [
    "Dillard, John G.",
    "Sprinkel, Michael M.",
    "Wightman, James P.",
    "Duke, John C. Jr.",
    "Cousins, Thomas E."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:17:46Z",
  "date_adate": "1998-02-11",
  "date_available": "2014-03-14T20:17:46Z",
  "date_issued": "1998-09-04",
  "date_rdate": "1998-02-11",
  "date_sdate": "1998-10-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "FIELD PERFORMANCE OF EPOXY-COATED REINFORCING STEEL IN VIRGINIA BRIDGE DECKS  Wioleta A. Pyc   (Abstract)  The corrosion protection performance of epoxy-coated reinforcing steel (ECR) was evaluated in 18 concrete bridge decks in Virginia in 1997.  The decks were 2 to 20 years old at the time of the investigation.  The concrete bridge deck inspections included crack survey and cover depth determination in the right traffic lane.  Maximum of 12 cores with the top reinforcement randomly located in the lowest 12th percentile cover depth and 3 cores with the truss bars were drilled from each bridge deck.  The concrete core evaluation included visual examination and determination of carbonation depth, moisture content, absorption, percent saturation and chloride content at 13 mm depth.  Rapid chloride permeability test was also performed for the surface and base concrete on samples obtained from cores containing truss bars.  The ECR inspection consisted of visual examination and damage evaluation, coating thickness and adhesion determination.  The condition of the steel underneath the epoxy coating was also evaluated.  Adhesion loss of the epoxy coating to the steel surface was detected for 4 years old bridge decks.   The epoxy coating had debonded from the reinforcing bar before the chloride arrival.  Visible signs of a possibility of a corrosion process underneath the coating suggest that ECR will not provide any or little additional service life for concrete bridge decks in comparison to black steel.  Other systems, which will provide longer protection with a higher degree of reliability against chloride induced corrosion of steel in concrete, should be considered.",
  "description_provenance": [
    "Author Email: wpyc@vt.edu",
    "Advisor Email: john.dillardj@vt.edu",
    "Advisor Email: rweyers@vt.edu",
    "Advisor Email: mms2c@virginia.edu",
    "Advisor Email: wightman@vt.edu",
    "Advisor Email: jcduke@vt.edu",
    "Advisor Email: tcousins@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:46Z (GMT). No. of bitstreams: 1 PYCPHD.pdf: 1260993 bytes, checksum: 4b4d0d9812b372948c2734c76a722752 (MD5)   Previous issue date: 1998-09-04"
  ],
  "handle": "29399",
  "identifier_other": "etd-102998-190256",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-102998-190256/",
  "identifier_uri": "http://hdl.handle.net/10919/29399",
  "publisher": "Virginia Tech",
  "relation_haspart": "PYCPHD.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "adhesion",
    "concrete",
    "bridge decks",
    "epoxy-coated reinforcement (ECR)"
  ],
  "title": "Field Performance of Epoxy-Coated Reinforcing Steel in Virginia Bridge Decks",
  "type": "Dissertation"
}