{
  "contributor_author": "Sheth, Jignesh Pramod",
  "contributor_committeechair": "WIlkes, Garth L.",
  "contributor_committeemember": [
    "Long, Timothy E.",
    "Davis, Richey M.",
    "Kiran, Erdogan R.",
    "Ward, Thomas C."
  ],
  "contributor_department": "Chemical Engineering",
  "date_accessioned": "2014-03-14T20:17:44Z",
  "date_adate": "2005-01-31",
  "date_available": "2014-03-14T20:17:44Z",
  "date_issued": "2004-10-22",
  "date_rdate": "2006-01-31",
  "date_sdate": "2004-10-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Segmented copolymers are a commercially important class of materials that are utilized in a wide variety of applications. In these systems a relatively large number of variables such as backbone chemistry, segment molecular weight, and the overall molecular weight of the copolymer can be independently controlled to engineer materials with targeted properties. Such versatility also means that a large number of variables can influence the morphology and therefore, properties and performance of segmented copolymers. In this dissertation, the influence of selected variables on the solid state structure-property behavior of segmented poly(ether-block-amide), polyurethane, polyurethaneurea, and polyurea copolymers is explored. The specific variables which have been utilized singly or in conjunction with others are hard segment crystallizability, crystallization conditions, hard segment content, soft segment type and molecular weight, nature of hydrogen bonding, extent of inter-segmental hydrogen bonding, segment symmetry, and chain architecture.   In poly(ether-block-amide)s, it was found that the morphology of both the crystalline and the amorphous phase depend upon the polyamide content of the sample and, as expected, the crystallization conditions.   A comparison of polydimethylsiloxane based segmented polyurethanes with their polyurea counterparts demonstrated that for a constant hard segment content the soft segment molecular weight particularly governs the extent of microphase separation in these materials. The nature of hydrogen bonding, monodentate or bidentate, also strongly influences their mechanical response. Remarkably, the polyurea sample with a polydimethylsiloxane molecular weight of 7000 g/mol and a hard segment content of 25 wt % exhibited a remarkable service temperature window (for rubber-like behavior) of ca. 230°C (from -55°C to 175°C) whereas it was ca. 200°C wide (from -55°C to 145°C) for the equivalent polyurethane sample. The extremely high chemical incompatibility between the polydimethylsiloxane of sufficiently high molecular weight and urethane or urea segment is expected to generate a relatively sharp interface between the soft matrix and the dispersed hard domains. Therefore, a polyether co-soft segment was incorporated in a controlled manner along the chain backbone, which resulted in inter-segmental hydrogen bonding between the ether and the urea segments. The consequent segmental mixing gave rise to a gradient interphase, which led to a significant improvement in the tensile strength, and elongation at break in selected polydimethylsiloxane segmented polyurea copolymers.  The importance of the hydrogen bonding network in model polyurethaneurea copolymers was also explored by utilizing LiCl as molecular probe. It has been demonstrated that hydrogen bonding plays an important role, over and above microphase separation, in promoting the long-range connectivity of the hard segments and the percolation of the hard phase through the soft matrix. The incorporation of hard segment branching in these polyurethaneurea also reduced the ability of the hard segments to pack effectively and establish long-range connectivity. The disruption of the percolated hard phase resulted in a systematic softening of the copolymers.  The role of chain architecture in governing the structure/property/processing of segmented was also investigated by comparing highly branched segmented polyurethaneureas with their linear analogs. These copolymers were based on poly(propylene oxide) or poly(tetramethylene oxide) as the soft segments The highly branched copolymers utilized in this dissertation were able to develop a microphase morphology similar to their linear analogs. Particularly noteworthy, and surprising, was the observation of weak second order interference shoulder in the respective small angle X-ray scattering profiles of the highly branched samples based on poly(propylene oxide) of MW 8200 and 12200, indicating the presence of at least some level of long-range order of the hard domains in these samples. Tapping-mode atomic force microscopy phase images of these two samples clearly confirmed the small angle X-ray scattering results. In addition to the strain induced crystallization of the poly(tetramethylene oxide) MW 2000 g/mol based linear polyurethaneureas, the highly branched analog of this sample also exhibited similar behavior at ambient temperature and uniaxial deformation of ca. 400 % strain. Wide angle X-ray scattering confirmed the above observation.  The reduced ability of the branched polymers to entangle resulted in slightly poorer mechanical properties, such as tensile strength, elongation at break, and stress relaxation as compared to their linear analogs. However, primarily due to their reduced entanglement density, the branched polyurethaneureas had significantly lower ambient temperature solution viscosity as compared to their linear polyurethaneurea analogs. Therefore, these highly branched polyurethaneureas can be more easily processed than the latter materials.   Finally, it was demonstrated that non-chain extended segmented polyurethane and polyurea copolymers in which the hard segment is based on only a single diisocyanate molecule may well exhibit properties, such as the breadth of the service window, the average plateau modulus, stiffness, tensile strength, and elongation at break that are similar to chain extended segmented copolymers that possess distinctly higher hard segment content. A careful control of the hard segment symmetry and the nature of the hydrogen bonding is necessary to achieve such improved performance in the non-chain extended systems. Therefore, the results of this study provide new direction for the production of thermoplastic segmented copolymers with useful structural properties.",
  "description_provenance": [
    "Author Email: jsheth@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: ekiran@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:44Z (GMT). No. of bitstreams: 11 ShethJP_Chapter-3.pdf: 2665663 bytes, checksum: 94f6c68064bc99a3f75102bfee5d4f5a (MD5) ShethJP_Front-Matter.pdf: 4534429 bytes, checksum: 381c8b9f6500ae7197183897091ba91c (MD5) ShethJP_Chapter-1.pdf: 946986 bytes, checksum: e1084a616450287a4665e0745c01dd16 (MD5) ShethJP_Chapter-5.pdf: 1139017 bytes, checksum: b581714cfd7c71d19da9503d7c853e6b (MD5) ShethJP_Chapter-4.pdf: 1544768 bytes, checksum: 15bef21e734fbb625211c98aaa79408d (MD5) ShethJP_Chapter-6.pdf: 1677518 bytes, checksum: 1ceed98284c3b1963bc55d696665a718 (MD5) ShethJP_Chapter-7.pdf: 1773910 bytes, checksum: 687264dabd6e7b3f25d6f925102dd434 (MD5) ShethJP_References-Notes.pdf: 969220 bytes, checksum: 8604247b8b214d3aecc4fa7c45b8c75d (MD5) ShethJP_Appendicies.pdf: 980394 bytes, checksum: 6e278a891665d89b608fe1b1c1533d38 (MD5) ShethJP_Chapter-8.pdf: 1344678 bytes, checksum: fa8a48213adb6bc17f2e41631df1d2c9 (MD5) ShethJP_Chapter-2.pdf: 1304394 bytes, checksum: 29598c310ab2ee3488a3a8de0f41fc10 (MD5)   Previous issue date: 2004-10-22"
  ],
  "handle": "29390",
  "identifier_other": "etd-10282004-165218",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10282004-165218/",
  "identifier_uri": "http://hdl.handle.net/10919/29390",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "ShethJP_Chapter-3.pdf",
    "ShethJP_Front-Matter.pdf",
    "ShethJP_Chapter-1.pdf",
    "ShethJP_Chapter-5.pdf",
    "ShethJP_Chapter-4.pdf",
    "ShethJP_Chapter-6.pdf",
    "ShethJP_Chapter-7.pdf",
    "ShethJP_References-Notes.pdf",
    "ShethJP_Appendicies.pdf",
    "ShethJP_Chapter-8.pdf",
    "ShethJP_Chapter-2.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "structure-property behavior",
    "hydrogen bonding",
    "polyurethane",
    "poly(ether-block-amide)",
    "microphase separation",
    "segmented copolymer",
    "atomic force microscopy"
  ],
  "title": "Investigation of the Influence of Selected Variables on the Solid State Structure-Property Behavior of Segmented Copolymers",
  "type": "Dissertation"
}